{
    "name": "Mindanao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Mindanao"
        ],
        [
            "92 languages"
        ],
        [
            "AfrikaansالعربيةAsturianuAzərbaycancaবাংলাBanjar閩南語 / Bân-lâm-gúБашҡортсаБеларускаяБеларуская (тарашкевіца)Bikol CentralБългарскиBosanskiBrezhonegCatalàЧӑвашлаCebuanoČeštinaChavacano de ZamboangaCymraegDanskDeutschEestiΕλληνικάEspañolEsperantoEuskaraفارسیFrançaisGaeilgeGàidhligGalego한국어Հայերենहिन्दीHrvatskiIdoIlokanoBahasa IndonesiaInterlinguaИронÍslenskaItalianoעבריתJawaKapampanganქართულიҚазақшаKiswahiliКыргызчаКырык марыLatinaLatviešuLietuviųMagyarМакедонскиMalagasyമലയാളംმარგალურიBahasa MelayuNederlands日本語NordfriiskNorsk bokmålNorsk nynorskOʻzbekcha / ўзбекчаپنجابیភាសាខ្មែរPolskiPortuguêsRomânăРусскийСаха тылаScotsSimple EnglishSlovenščinaСрпски / srpskiSrpskohrvatski / српскохрватскиSuomiSvenskaTagalogதமிழ்Татарча / tatarçaไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray吴语粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikinewsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°00′N 125°00′E﻿ / ﻿8.000°N 125.000°E﻿ / 8.000; 125.000"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Island in the Philippines"
        ],
        [
            "For the river, see Rio Grande de Mindanao.",
            "For the 2019 film, see Mindanao (film).",
            "For the old sultanate, see Sultanate of Maguindanao."
        ],
        [
            "MindanaoNative name: Pulu nu Mindanaw (Maguindanaon)Polo o Mindanao (Maranao)Pu sin Mindanaw (Tausug)Pu'yù to Mindanao (Manobo languages)Pulu' ni Mindanaw (Central Subanen)Composite satellite image of Mindanao captured by Sentinel-2 in 2019MindanaoLocation within the PhilippinesGeographyLocationPhilippinesCoordinates8°00′N 125°00′E﻿ / ﻿8.000°N 125.000°E﻿ / 8.000; 125.000ArchipelagoPhilippineAdjacent toBohol SeaCelebes SeaPhilippine SeaSulu SeaSurigao StraitMajor islandsMindanaoBasilanJoloTawi-TawiBucas GrandeDinagatSiargaoSamalCamiguinArea97,530 km2 (37,660 sq mi)Area rank19thHighest elevation2,954 m (9692 ft)Highest pointMount ApoAdministrationPhilippinesRegionsRegion 9 – Zamboanga PeninsulaRegion 10 – Northern MindanaoRegion 11 – Davao RegionRegion 12 – SoccsksargenRegion 13 – Caraga RegionBangsamoro Autonomous Region of Muslim MindanaoProvinces"
        ],
        [
            "List"
        ],
        [
            "Agusan del NorteAgusan del SurBukidnonCotabatoDavao del NorteDavao de OroDavao del SurDavao OccidentalDavao OrientalLanao del NorteLanao del SurMaguindanao del NorteMaguindanao del SurMisamis OccidentalMisamis OrientalSaranganiSouth CotabatoSultan KudaratSurigao del NorteSurigao del SurZamboanga del NorteZamboanga del SurZamboanga SibugayOutlying island provinces BasilanCamiguinDinagat IslandsSuluTawi-Tawi"
        ],
        [
            "Largest settlementDavao City (pop.",
            "1,776,949)DemographicsDemonymMindanaoanMindanawanMindanawonMindanaonMindanawnPopulation27,021,036 (2021) (Mindanao island group) Pop.",
            "density243/km2 (629/sq mi)Ethnic groups"
        ],
        [
            "List"
        ],
        [
            "Visayan (CebuanoHiligaynonBoholanoSurigaononButuanonDavaoeñoWarayKaray-a)Moro (BanguinguiIranunMaguindanaoMaranaoTausugSama-BajauSangireseYakan)Lumad (BlaanBukidnonSubanonKamayoManobo/BagoboMandayaMansakaTasadayTboli )Negrito (Mamanwa)IlocanoZamboangueño / Zamboangueño Chavacano"
        ],
        [
            "Mindanao (/ˌmɪndəˈnaʊ/ ⓘ MIN-də-NOW) is the second-largest island in the Philippines, after Luzon, and seventh-most populous island in the world.",
            "Located in the southern region of the archipelago, the island is part of an island group of the same name that also includes its adjacent islands, notably the Sulu Archipelago.",
            "According to the 2020 census, Mindanao has a population of 26,252,442 people, while the entire island group has an estimated population of 27,021,036 according to the 2021 census."
        ],
        [
            "Mindanao is divided into six administrative regions: the Zamboanga Peninsula, Northern Mindanao, the Caraga region, the Davao region, Soccsksargen, and the autonomous region of Bangsamoro.",
            "According to the 2020 census, Davao City is the most populous city on the island, with 1,776,949 people, followed by Zamboanga City (pop.",
            "977,234), Cagayan de Oro (pop.",
            "728,402), General Santos (pop.",
            "697,315), Butuan (pop.",
            "372,910), Iligan (pop.",
            "363,115) and Cotabato City (pop.",
            "325,079)."
        ],
        [
            "Etymology"
        ],
        [
            "The name Mindanao is a Spanish variation of the name of the Maguindanao people, the dominant ruling ethnic group in the Sultanate of Maguindanao in southwestern Mindanao during the Spanish colonial period.",
            "The name itself means \"people of the lake\", although it is usually translated to \"people of the flood plains\" in modern sources."
        ],
        [
            "History"
        ],
        [
            "Prehistory"
        ],
        [
            "The Agusan image statue (900–950 CE) discovered in 1917 on the banks of the Wawa River near Esperanza, Agusan del Sur"
        ],
        [
            "A 1926 photograph of Bagobo (Manobo) warriors"
        ],
        [
            "Archaeological findings on the island point to evidence of human activity dating back about ten thousand years.",
            "Around 1500 BC, Austronesian people spread throughout the Philippines."
        ],
        [
            "The Subanon are believed to have settled in the Zamboanga Peninsula during the Neolithic era c. 4500–2000 BC.",
            "Evidence of stone tools in Zamboanga del Norte may indicate a late Neolithic presence.",
            "Ceramic burial jars, both unglazed and glazed, Chinese celadons, gold ornaments, beads, and bracelets have been found in caves.",
            "Many of the ceramic objects are from the Yuan and Ming periods.",
            "Evidently, there was a long history of trade between the Subanon and the Chinese."
        ],
        [
            "Rajahnates and Hindu-Buddhism"
        ],
        [
            "An old Spanish map of Mindanao island."
        ],
        [
            "In the classic epoch of Philippine history (900 AD onwards), the people of Mindanao were heavily exposed to Hindu and Buddhist influence and beliefs from Indonesia and Malaysia.",
            "Indianized abugida scripts such as Kawi and baybayin were introduced from Java and an extinct intermediate from Sulawesi or Borneo respectively.",
            "Cultural icons of the sarong (known as malong or patadyong), the pudong turban, silk, and batik and ikat weaving and dyeing methods were introduced.",
            "Artifacts found from this era include a golden kinnara, a golden image believed by some to be a Tara, and a Ganesha pendant.",
            "These cultural traits passed from Mindanao into the Visayas and Luzon, but were subsequently lost or heavily modified after the Spanish arrival in the 16th century."
        ],
        [
            "Hindu-Buddhist cultural influence took root in the coastal settlements, syncretizing with indigenous animist beliefs and customs among the tribes of the interior.",
            "The Butuan Rajahnate, a Hinduized kingdom mentioned in Chinese records as a tributary state in the 10th century, was concentrated along the northeastern coast of Butuan Bay.",
            "The Rajahnate of Sanmalan in Zamboanga, was also in Mindanao.",
            "The Darangen epic of the Maranao people harkens back to this era as the most complete local version of the Ramayana.",
            "The Maguindanao at this time also had strong Hindu beliefs, evidenced by the Ladya Lawana (Rajah Ravana) epic saga that survives to the present, albeit highly Islamized from the 17th century onward."
        ],
        [
            "Sultanates and Islam"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(August 2020) (Learn how and when to remove this message)"
        ],
        [
            "Approximate historical extent of the Muslim sultanates of Sulu, Maguindanao and Lanao in the 19th century"
        ],
        [
            "The spread of Islam in the Philippines began in the 14th century, mostly through the influence of Muslim merchants from the western Malay Archipelago.",
            "The first mosque in the Philippines was built in the mid-14th century in the town of Simunul, Tawi-Tawi.",
            "Around the 16th century, the Muslim sultanates of Sulu, Lanao and Maguindanao were established from formerly Hindu-Buddhist rajahnates."
        ],
        [
            "As Islam gained influence in Mindanao, the natives of the sultanates had to either convert to Islam or pay tribute to their new Muslim rulers.",
            "The largest of the Muslim polities in mainland Mindanao was the Sultanate of Maguindanao, which controlled the southern floodplains of the Rio Grande de Mindanao and most of the coastal area of Illana Bay, Moro Gulf, Sarangani Bay and Davao Gulf.",
            "The name Mindanao was derived from this sultanate.",
            "But most of Mindanao remained animist, especially the Lumad people in the interior.",
            "Most of the northern, eastern, and southern coastal regions inhabited by Visayans (Surigaonon and Butuanon) and other groups were later converted to Christianity by the Spanish.",
            "Mindanao was then embroiled between a conflict with the Boholano (Visayan) Dapitan Kingdom and the Moluccan Sultanate of Ternate.",
            "Dapitan which was originally at Bohol was destroyed by an expeditionary force from the Ternate Sultanate and Dapitenyos were forced to relocate to Northern Mindanao where they waged war against the Sultanate of Lanao and established a new Dapitan there."
        ],
        [
            "Spanish colonization and Christianity"
        ],
        [
            "See also: Spanish–Moro conflict"
        ],
        [
            "Christian Filipinos, who served under the Spanish Army, searching for Moro rebels during the Spanish–Moro conflict, c. 1887.",
            "The insurgency in Mindanao can be traced to the early 16th century."
        ],
        [
            "Two Spanish missionaries baptizing a Moro convert to Catholicism, circa 1890."
        ],
        [
            "In 1521 Antonio Pigafetta wrote an account of reaching 'Maingdano.'",
            "He was with Magellan on the first circumnavigation of the globe and sailing for the king of Spain."
        ],
        [
            "On February 2, 1543, Ruy López de Villalobos was the first Spaniard to reach Mindanao."
        ],
        [
            "By the late 18th century Spain had geographic dominance over the island, having established settlements and forts in most of Mindanao, including Zamboanga City and Misamis Occidental to the northwest, Iligan City, Misamis Oriental, Bukidnon, and Camiguin Island to the north, Surigao and Agusan in the Caraga region to the east, and Davao in the island's gulf coast.",
            "Spain continued to engage in battles with Muslim sultanates until the end of the 19th century."
        ],
        [
            "At the same time as the Philippine revolution against Spain, the Republic of Zamboanga rose as a revolutionary state in Mindanao before it was absorbed by the oncoming Americans."
        ],
        [
            "American occupation and Philippine Commonwealth"
        ],
        [
            "See also: Moro Rebellion"
        ],
        [
            "In the Treaty of Paris in 1898 Spain sold the entire Philippine archipelago to the United States for $20 million.",
            "The 1900 Treaty of Washington and the 1930 Convention Between the United States and Great Britain clarified the borders between Mindanao and Borneo."
        ],
        [
            "In early 1900s the Commonwealth government (led by Americans) encouraged citizens from Luzon and Visayas to migrate to Mindanao.",
            "Consisting mostly of Ilocanos, Cebuanos, and Ilonggos.",
            "Settlers streaming into Soccsksargen led to the displacement of the Blaan and Tboli tribes."
        ],
        [
            "World War II"
        ],
        [
            "In April 1942 Mindanao, along with the rest of the Philippines, officially entered World War II after Japanese soldiers invaded key cities in the islands."
        ],
        [
            "Davao City was subjected by the returning forces of Gen. Douglas MacArthur to constant bombing before the American Liberation Forces landed in Leyte in October 1944."
        ],
        [
            "Postwar era and Philippine independence"
        ],
        [
            "Mindanao was peaceful and increasingly progressive in the postwar period, including the 1950s and the mid-1960s.",
            "Ethnic tensions were minimal, and there was essentially no presence of secessionists groups in Mindanao."
        ],
        [
            "Marcos era (1965–1986)"
        ],
        [
            "Main articles: Martial law under Ferdinand Marcos, Ilaga, Jabidah massacre, and Moro conflict"
        ],
        [
            "Under Ferdinand Marcos's administration, Christian groups began to settle in Mindanao, displacing many locals.",
            "The population boom resulted in conflicts as the original owners sought their ancestral land domains."
        ],
        [
            "The Marcos administration encouraged new settlers who had emigrated to Mindanao to form a militia, which was eventually called the Ilaga.",
            "Anecdotal evidence states that the Ilaga often committed human rights abuses by targeting the Moro and Lumad people, as well as attempting to seize additional territory.",
            "It resulted in a lingering animosity between Moro and Christian communities.",
            "Mistrust and a cycle of violence are still felt today due to the creation of the Ilaga."
        ],
        [
            "The Jabidah massacre in 1968 is commonly cited as the major flashpoint that ignited the Moro insurgency, and the ensuing ethnic tensions led to the formation of secessionist movements,"
        ],
        [
            "Additionally, an economic crisis in late 1969 led to social unrest throughout the country, and violent crackdowns on protests led to the radicalization of many students,"
        ],
        [
            "Marcos' declaration led to the shuttering of press outlets – television stations, national newspapers, weekly magazines, community newspapers, and radio stations – throughout the country, including in Mindanao."
        ],
        [
            "Fifth Republic (1986–present)"
        ],
        [
            "This section needs to be updated.",
            "Please help update this article to reflect recent events or newly available information.",
            "(October 2019)"
        ],
        [
            "In 1989, the Autonomous Region in Muslim Mindanao (ARMM) was established, constituted by several provinces in Western Mindanao."
        ],
        [
            "In March 2000, President Joseph Estrada declared an \"All Out War\" against the MILF after it committed a series of terrorist attacks on government buildings, civilians, and foreigners.",
            "A number of livelihood intervention projects, from organisations such as USAID and the Emergency Livelihood Assistance Program (ELAP), aided in the reconstruction of areas affected by constant battles on the island."
        ],
        [
            "In December 2009, President Gloria Macapagal Arroyo officially placed Maguindanao under a state of martial law following the Maguindanao massacre."
        ],
        [
            "On September 9, 2013, an MNLF faction attempted to raise the flag of a self-proclaimed Bangsamoro Republik at Zamboanga City Hall in an armed incursion into parts of the city."
        ],
        [
            "On January 25, 2015, a shootout took place during a police operation by the Special Action Force (SAF) of the Philippine National Police (PNP) in Tukanalipao, Mamasapano, Maguindanao.",
            "The operation, codenamed Oplan Exodus, was intended to capture or kill wanted Malaysian terrorist and bomb-maker Zulkifli Abdhir and other Malaysian terrorists or high-ranking members of the Bangsamoro Islamic Freedom Fighters (BIFF)."
        ],
        [
            "Lanao sultans making an open letter to Duterte urging for the quick resolution of the Marawi crisis"
        ],
        [
            "In May 2017, President Rodrigo Duterte declared martial law on the entire island group of Mindanao following the Marawi siege by the Maute terrorist group."
        ],
        [
            "In 2019, the Bangsamoro Autonomous Region in Muslim Mindanao was established, replacing the former ARMM."
        ],
        [
            "In 2024, former President Rodrigo Duterte called for Mindanao to secede from the Philippines,"
        ],
        [
            "Economy"
        ],
        [
            "See also: Economy of the Philippines"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(September 2013) (Learn how and when to remove this message)"
        ],
        [
            "Cagayan de Oro skyline in 2018"
        ],
        [
            "Mindanao's economy accounts for 14% of the country's gross domestic product.",
            "The region grew 4.9% in 2016 against Luzon's 5.5% and Visayas' 9.1%."
        ],
        [
            "Agriculture, forestry and fishing make up more than 40% of Mindanao's market, being the country's largest supplier of major crops such as pineapples and bananas."
        ],
        [
            "There is one defined growth corridor in the island, namely Metro Davao.",
            "Other growth centers are: Cagayan de Oro, General Santos, Zamboanga City, Cotabato City, and Pagadian City."
        ],
        [
            "Being the top-performing economy in Mindanao, Davao Region has the 5th-biggest economy in the country and the second-fastest-growing economy next to Cordillera Autonomous Region."
        ],
        [
            "There is also a growing call center sector in the region, mostly centered in Davao City."
        ],
        [
            "Upcoming developments"
        ],
        [
            "Some 2,130 government-led infrastructure projects worth P547.9 billion have also been lined up for Mindanao until 2022."
        ],
        [
            "NEDA official said that 68% of that budget will be allotted for the transportation sector, while 16% will go to water resources, and 6% to social infrastructure."
        ],
        [
            "Of this amount, 18 infrastructure projects have been identified as \"flagship projects,\" five of them have already been approved by President Rodrigo Duterte."
        ],
        [
            "The projects include the ₱35.26 billion Tagum-Davao-Digos Segment of the Mindanao Railway, the ₱40.57 billion Davao airport, the ₱14.62 billion Laguindingan airport, the ₱4.86 billion Panguil Bay Bridge Project, and the ₱5.44 billion Malitubog-Maridagao Irrigation Project, Phase II."
        ],
        [
            "Projects in the pipeline are the second and third phases of the Mindanao Railway; the Agus-Pulangi plant rehabilitation; the Davao expressway; the Zamboanga Fish Port Complex rehabilitation; the Balo-i Plains Flood Control Project; Asbang Small Reservoir Irrigation Project; the Ambal Simuay Sub-Basin of the Mindanao River Basin Flood Control and River Protection Project; as well as the Road Network Development Project in Conflict-Affected Areas in Mindanao project."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Further information: Political divisions of Mindanao"
        ],
        [
            "The island consists of six administrative regions, 23 provinces, and 30 cities (27 provinces and 33 cities if associated islands are included)."
        ],
        [
            "Location"
        ],
        [
            "Region(designation)"
        ],
        [
            "Population(2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Regionalcenter(capital region)"
        ],
        [
            "Component LGUs  Province  Independent city ∗  Associated island"
        ],
        [
            "ZamboangaPeninsula(Region IX)"
        ],
        [
            "3,875,376(3.1%)"
        ],
        [
            "17,056.73 km2(6,585.64 sq mi)"
        ],
        [
            "200/km2(520/sq mi)"
        ],
        [
            "Pagadian City"
        ],
        [
            "5"
        ],
        [
            "Isabela City*Zamboanga del NorteZamboanga del SurZamboanga Sibugay"
        ],
        [
            "NorthernMindanao(Region X)"
        ],
        [
            "5,022,768(4.6%)"
        ],
        [
            "20,496.02 km2(7,913.56 sq mi)"
        ],
        [
            "250/km2(650/sq mi)"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "7"
        ],
        [
            "BukidnonCagayan de OroLanao del NorteMisamis OccidentalMisamis Oriental"
        ],
        [
            "Davao Region(Region XI)"
        ],
        [
            "5,243,536(4.8%)"
        ],
        [
            "20,357.42 km2(7,860.04 sq mi)"
        ],
        [
            "260/km2(670/sq mi)"
        ],
        [
            "Davao City"
        ],
        [
            "6"
        ],
        [
            "Davao de OroDavao CityDavao del NorteDavao del SurDavao OrientalDavao Occidental"
        ],
        [
            "Soccsksargen(Region XII)"
        ],
        [
            "4,360,974(4.0%)"
        ],
        [
            "22,513.30 km2(8,692.43 sq mi)"
        ],
        [
            "190/km2(490/sq mi)"
        ],
        [
            "Koronadal"
        ],
        [
            "6"
        ],
        [
            "Cotabato (North)General SantosSaranganiSouth CotabatoSultan Kudarat"
        ],
        [
            "Caraga Region(Region XIII)"
        ],
        [
            "2,804,788(2.6%)"
        ],
        [
            "21,478.35 km2(8,292.84 sq mi)"
        ],
        [
            "130/km2(340/sq mi)"
        ],
        [
            "Butuan"
        ],
        [
            "6"
        ],
        [
            "Agusan del NorteAgusan del SurButuanDinagat Islands*Surigao del NorteSurigao del Sur"
        ],
        [
            " Bangsamoro Autonomous Regionin MuslimMindanao(BARMM)"
        ],
        [
            "4,944,800(4.5%)"
        ],
        [
            "12,535.79 km2(4,840.10 sq mi)"
        ],
        [
            "390/km2(1,000/sq mi)"
        ],
        [
            "Cotabato City"
        ],
        [
            "6"
        ],
        [
            "Basilan*(excluding Isabela City)Cotabato CityLanao del SurMaguindanao del NorteMaguindanao del SurSulu*Tawi-Tawi*"
        ],
        [
            "Table notes"
        ],
        [
            "^ Land area figures are the sum of each region's component provinces (and/or independent cities), derived from the National Statistical Coordination Board (Philippine Statistics Authority) official website."
        ],
        [
            "^ The provinces of Basilan, Camiguin, Dinagat Islands, Sulu, and Tawi-Tawi are separate islands and/or island groups themselves, but are included under the island group of Mindanao."
        ],
        [
            "^ A component city, part of the province of Basilan, but whose regional services are provided by the offices of Region IX."
        ],
        [
            "^ a b c d e f A highly urbanized city, independent from any province"
        ],
        [
            "^ An independent component city, not under the jurisdiction of any provincial government."
        ],
        [
            "Zamboangadel Norte"
        ],
        [
            "Zamboangadel Sur"
        ],
        [
            "ZamboangaSibugay"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Basilan"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Sulu"
        ],
        [
            "Camiguin"
        ],
        [
            "MisamisOccidental"
        ],
        [
            "Lanaodel Norte"
        ],
        [
            "Lanaodel Sur"
        ],
        [
            "Iligan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "MisamisOriental"
        ],
        [
            "Agusandel Norte"
        ],
        [
            "Surigaodel Norte"
        ],
        [
            "Bukidnon"
        ],
        [
            "Davaodel Sur"
        ],
        [
            "Davao City"
        ],
        [
            "Davaodel Norte"
        ],
        [
            "Davaode Oro"
        ],
        [
            "DavaoOriental"
        ],
        [
            "DavaoOccidental"
        ],
        [
            "Sarangani"
        ],
        [
            "SouthCotabato"
        ],
        [
            "GeneralSantos"
        ],
        [
            "SultanKudarat"
        ],
        [
            "CotabatoCity"
        ],
        [
            "Cotabato"
        ],
        [
            "Butuan"
        ],
        [
            "Agusandel Sur"
        ],
        [
            "Surigaodel Sur"
        ],
        [
            "Maguindanao"
        ],
        [
            "DinagatIslands"
        ],
        [
            "SuluSea"
        ],
        [
            "Moro Gulf"
        ],
        [
            "PhilippineSea"
        ],
        [
            " Administrative divisions"
        ],
        [
            "of Mindanao"
        ],
        [
            "(clickable map)"
        ],
        [
            "Largest cities and municipalities in Mindanao"
        ],
        [
            "The list of largest cities and municipalities in Mindanao in terms of population is shown in the table below."
        ],
        [
            " vte Largest cities and municipalities in MindanaoPSA Census May 2020"
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            "Pop."
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            "Pop."
        ],
        [
            "Davao CityZamboanga City"
        ],
        [
            "1"
        ],
        [
            "Davao City"
        ],
        [
            "Davao Region"
        ],
        [
            "1,776,949"
        ],
        [
            "11"
        ],
        [
            "Panabo"
        ],
        [
            "Davao Region"
        ],
        [
            "209,230"
        ],
        [
            "Cagayan de OroGeneral Santos"
        ],
        [
            "2"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Zamboanga Peninsula"
        ],
        [
            "977,234"
        ],
        [
            "12"
        ],
        [
            "Marawi"
        ],
        [
            "Bangsamoro"
        ],
        [
            "207,010"
        ],
        [
            "3"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "728,402"
        ],
        [
            "13"
        ],
        [
            "Koronadal"
        ],
        [
            "Soccsksargen"
        ],
        [
            "195,398"
        ],
        [
            "4"
        ],
        [
            "General Santos"
        ],
        [
            "Soccsksargen"
        ],
        [
            "697,315"
        ],
        [
            "14"
        ],
        [
            "Malaybalay"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "190,712"
        ],
        [
            "5"
        ],
        [
            "Butuan"
        ],
        [
            "Caraga Region"
        ],
        [
            "372,910"
        ],
        [
            "15"
        ],
        [
            "Digos"
        ],
        [
            "Davao Region"
        ],
        [
            "188,376"
        ],
        [
            "6"
        ],
        [
            "Iligan"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "363,115"
        ],
        [
            "16"
        ],
        [
            "Polomolok"
        ],
        [
            "Soccsksargen"
        ],
        [
            "172,605"
        ],
        [
            "7"
        ],
        [
            "Cotabato City"
        ],
        [
            "Bangsamoro"
        ],
        [
            "325,079"
        ],
        [
            "17"
        ],
        [
            "Surigao City"
        ],
        [
            "Caraga Region"
        ],
        [
            "171,107"
        ],
        [
            "8"
        ],
        [
            "Tagum"
        ],
        [
            "Davao Region"
        ],
        [
            "296,202"
        ],
        [
            "18"
        ],
        [
            "Kidapawan"
        ],
        [
            "Soccsksargen"
        ],
        [
            "160,791"
        ],
        [
            "9"
        ],
        [
            "Valencia"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "216,546"
        ],
        [
            "19"
        ],
        [
            "Mati"
        ],
        [
            "Davao Region"
        ],
        [
            "147,547"
        ],
        [
            "10"
        ],
        [
            "Pagadian"
        ],
        [
            "Zamboanga Peninsula"
        ],
        [
            "210,452"
        ],
        [
            "20"
        ],
        [
            "Ozamiz"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "140,334"
        ],
        [
            "Geography"
        ],
        [
            "Geofeatures map of Mindanao"
        ],
        [
            "Mindanao is the second-largest island in the Philippines at 97,530 square kilometres (37,660 sq mi), the Philippine Sea to the east, the Celebes Sea to the south, and the Mindanao Sea to the north."
        ],
        [
            "The island itself is part of an island group of the same name, which includes the Sulu Archipelago and the outlying islands of Camiguin, Dinagat, Siargao, and Samal."
        ],
        [
            "Mountains"
        ],
        [
            "Mountains in the province of Bukidnon"
        ],
        [
            "The mountains of Mindanao can be grouped into ten ranges, including both complex structural mountains and volcanoes.",
            "The structural mountains on the extreme eastern and western portions of the island show broad exposures of Mesozoic rock, and Ultrabasic rocks at the surface in many places along the east coast.",
            "Other parts of the island consist mainly of Cenozoic and Quaternary volcanic or sedimentary rocks."
        ],
        [
            "In the eastern portion of the island, from Bilas Point in Surigao del Norte to Cape San Agustin in Davao Oriental, is a range of complex mountains known in their northern portion as the Diwata Mountains.",
            "This range is low and rolling in its central portion.",
            "A proposed road connecting Bislig on the east coast with the Agusan River would pass through 16 kilometers (9.9 mi) of broad saddle across the mountains at a maximum elevation of less than 250 meters (820 ft); while the existing east–west road from Lianga, 48 km (30 mi) north of Bislig, reaches a maximum elevation of only 450 m (1,480 ft).",
            "The Diwata Mountains, north of these low points, are considerably higher and more rugged, reaching an elevation of 2,012 m (6,601 ft) in Mount Hilong-Hilong, 17 miles (27 km) along the eastern portion of Cabadbaran.",
            "The southern portion of this range is broader and even more rugged than the northern section.",
            "In Davao Oriental, several peaks rise above 2,600 m (8,530 ft) and one mountain rises to 2,910 m (9,547 ft)."
        ],
        [
            "Mt.",
            "Apo, the highest peak in the Philippines"
        ],
        [
            "The east-facing coastal regions of Davao and Surigao del Sur are marked by a series of small coastal lowlands separated from each other by rugged forelands which extend to the water's edge.",
            "Offshore are numerous coral reefs and tiny islets.",
            "This remote and forbidding coast is made doubly difficult to access during the months from October to March by the heavy surf driven before the northeast trade winds.",
            "A few miles offshore is found the Philippine Deep.",
            "This ocean trench, reaching measured depths of 34,696 feet (10,575 m), is the third-deepest trench, (after the Mariana Trench and Tonga Trench) on the earth's surface."
        ],
        [
            "A second north–south mountain range extends from Talisayan in the north, to Tinaca Point in the southernmost point of Mindanao.",
            "This mountain range runs along the western borders of the Agusan del Norte, Agusan del Sur, and Davao provinces.",
            "This range is mainly structural in origin, but it also contains at least three active volcano peaks.",
            "The central and northern portions of this range contain several peaks between 2,000 and 2,600 m (6,600 and 8,500 ft), and here the belt of mountains is about 30 miles (48 km) across."
        ],
        [
            "West of Davao City stand two inactive volcanoes: Mount Talomo at 2,893 meters (9,491 ft), and Mount Apo at 2,964 m (9,724 ft).",
            "Mount Apo is the highest point in the Philippines.",
            "South of Mount Apo, this central mountain belt is somewhat lower than it is to the north, with peaks averaging only 1,100 to 1,800 m (3,600 to 5,900 ft)."
        ],
        [
            "In Western Mindanao, a range of complex structural mountains forms the long, hand-like Zamboanga Peninsula.",
            "These mountains, reaching heights of only 1,200 meters (3,900 feet), are not as high as the other structural belts in Mindanao.",
            "There are several places in the Zamboanga Mountains where small inter-mountain basins have been created, with some potential for future agricultural development.",
            "The northeastern end of this range is marked by the twin peaks of the now-extinct volcano, Mount Malindang, that towers over Ozamiz at a height of 2,425 m (7,956 ft).",
            "Mount Dapia is the highest mountain in the Zamboanga Peninsula, reaching a height of 2,617 m (8,586 ft).",
            "Batorampon Point is the highest mountain of the southernmost end of the peninsula, reaching a height of only 1,335 m (4,380 ft); it is located in the boundary of Zamboanga City."
        ],
        [
            "A series of volcanic mountains is located within the vicinity of Lake Lanao forming a broad arc through the Lanao del Sur, Cotabato and Bukidnon provinces.",
            "At least six of the twenty odd peaks in this area are active and several stand in semi-isolation.",
            "The Butig Peaks, with their four crater lakes, are easily seen from Cotabato.",
            "Mount Ragang, an active volcano cone reaching 2,815 m (9,236 ft), is the most isolated, while the greatest height is reached by Mount Kitanglad at 2,889 m (9,478 ft)."
        ],
        [
            "Mindanao coast"
        ],
        [
            "In South Cotabato, is another range of volcanic mountains, this time paralleling the coast.",
            "These mountains have a maximum extent of 110 miles (180 km) from northwest to southeast and measures some 30 miles (48 km) across.",
            "One of the well-known mountains here is Mount Parker, whose almost circular crater lake measures a mile-and-a-quarter in diameter and lies 300 m (980 ft) below its 2,040 m (6,690 ft) summit.",
            "Mount Matutum is a protected area and is considered one of the major landmarks in the South Cotabato province."
        ],
        [
            "Plateaus"
        ],
        [
            "Another important physiographic division of Mindanao is the series of upland plateaus in the Bukidnon and Lanao del Sur provinces.",
            "These plateaus are rather extensive and almost surround several volcanoes in this area.",
            "The plateaus are made up of basaltic lava flows inter-bedded with volcanic ash and tuff.",
            "Near their edges, the plateaus are cut by deep canyons, and at several points waterfalls drop down to the narrow coastal plain.",
            "These falls hold considerable promise for development of hydroelectric energy.",
            "Indeed, one such site at Maria Cristina Falls has already become a major producer.",
            "The rolling plateaus lie at an elevation averaging 700 meters above sea level, and offer relief from the often oppressive heat of the coastal lowlands."
        ],
        [
            "Lakes and waterfalls"
        ],
        [
            "Lake Lanao occupies a large portion of one such plateau in Lanao del Sur.",
            "This lake is the largest lake in Mindanao and the second largest in the country; it is roughly triangular in shape with an 18-mile-long (29 km) base, having a surface at 780 meters above sea level, and is rimmed on the east, south, and west by a series of peaks reaching 2,300 meters.",
            "Marawi City, at the northern tip of the lake, is bisected by the Agus River, that feeds the Maria Cristina Falls."
        ],
        [
            "Another of Mindanao's waterfall sites is located in Malabang, 15 miles (24 km) south of Lake Lanao.",
            "Here the Jose Abad Santos Falls present one of the nation's scenic wonders at the gateway to a 200-hectare national park development."
        ],
        [
            "The Limunsudan Falls, with an approximate height of 800 ft (240 m), is the highest waterfall in the Philippines; it is located in Iligan City."
        ],
        [
            "Valleys, rivers, and plains"
        ],
        [
            "Rio Grande de Mindanao"
        ],
        [
            "Mindanao contains two large lowland areas in the valleys of the Agusan River in Agusan, and the Rio Grande de Mindanao in Cotabato City."
        ],
        [
            "There is some indication that the Agusan Valley occupies a broad syncline between the central mountains and the east-coast mountains.",
            "This valley measures 110 miles (180 km) from south to north and varies from 20 to 30 miles (32 to 48 km) in width.",
            "35 miles (56 km) north of the head of Davao Gulf lies the watershed between the Agusan and the tributaries of the Libuganon River, which flows to the gulf.",
            "The elevation of this divide is well under 200 m (660 ft), indicating the almost continuous nature of the lowland from the Mindanao Sea on the north to Davao Gulf."
        ],
        [
            "The Rio Grande de Mindanao and its main tributaries, the Catisan and the Pulangi, form a valley with a maximum length of 120 miles (190 km) and a width which varies from 12 miles (19 km) at the river mouth to about 60 miles (97 km) in central Cotabato.",
            "The southern extensions of this Cotabato Valley extend uninterrupted across a 350-meter (1,150 ft) watershed from Illana Bay on the northwest to Sarangani Bay on the southeast."
        ],
        [
            "Other lowlands of a coastal nature are to be found in various parts of Mindanao.",
            "Many of these are tiny isolated pockets, along the northwest coast of Zamboanga.",
            "In other areas such as the Davao Plain, these coastal lowlands are 16 km (9.9 mi) wide and several times in length."
        ],
        [
            "From Dipolog, eastward along the northern coast of Mindanao approaching Butuan, extends a rolling coastal plain of varying width.",
            "In Misamis Occidental, the now dormant Mount Malindang has created a lowland averaging 13 km (8.1 mi) in width.",
            "Shallow Panguil Bay divides this province from Lanao del Norte, and is bordered by low-lying, poorly drained lowlands and extensive mangroves.",
            "In Misamis Oriental, the plain is narrower and in places whittle into rugged capes that reach the sea.",
            "East of Cagayan de Oro, a rugged peninsula extends into the Mindanao Sea."
        ],
        [
            "Climate change"
        ],
        [
            "Climate change is expected to have adverse effects on Mindanao's population, environment, and agriculture."
        ],
        [
            "Demographics"
        ],
        [
            "As of 2017, Mindanao had a population of over 25 million people.",
            "This comprises 22.1 percent of the entire population of the country."
        ],
        [
            "Ethnicity and culture"
        ],
        [
            "Main articles: Culture of the Philippines, Music of the Philippines, and Kulintang"
        ],
        [
            "I-indak sa kadalanan or the Street dancing competition, part of Kadayawan Festival celebration in Davao City."
        ],
        [
            "Davao City's Chinatown"
        ],
        [
            "Region"
        ],
        [
            "Province"
        ],
        [
            "Major ethnic groups"
        ],
        [
            "Indigenous"
        ],
        [
            "Non-indigenous"
        ],
        [
            "Zamboanga Peninsula"
        ],
        [
            " Zamboanga del Sur"
        ],
        [
            "Iranun, Maguindanaon, Maranao,Sama-Bajaw, Subanen, Tausug, Yakan"
        ],
        [
            "Bicolano, Chavacano, Cebuano, Chinese, Hiligaynon, Ilocano, Kapampangan, Tagalog"
        ],
        [
            " Zamboanga Sibugay"
        ],
        [
            "Maguindanaon, Subanen, Tausug"
        ],
        [
            "Chavacano, Cebuano, Ilocano"
        ],
        [
            " Zamboanga del Norte"
        ],
        [
            "Maguindanaon, Sama-Bajaw, Subanen, Tausug"
        ],
        [
            "Chavacano, Cebuano"
        ],
        [
            "Northern Mindanao"
        ],
        [
            " Misamis Occidental"
        ],
        [
            "Subanen"
        ],
        [
            "Cebuano"
        ],
        [
            " Lanao del Norte"
        ],
        [
            "Higaonon, Maranao, Subanen"
        ],
        [
            "Cebuano"
        ],
        [
            " Misamis Oriental"
        ],
        [
            "Higaonon, Maranao"
        ],
        [
            "Bicolano, Cebuano, Chinese, Hiligaynon , Ilocano, Indian, Kapampangan, Tagalog"
        ],
        [
            " Camiguin"
        ],
        [
            "Kamigin Manobo"
        ],
        [
            "Bicolano, Cebuano, Hiligaynon, Ilocano, Kapampangan, Tagalog, Waray"
        ],
        [
            " Bukidnon"
        ],
        [
            "Higaonon, Maguindanaon, Maranao, Matigsalug, Talaandig"
        ],
        [
            "Cebuano, Hiligaynon, Ilocano, Ivatan, Tagalog, Waray"
        ],
        [
            "Davao Region"
        ],
        [
            " Davao del Sur"
        ],
        [
            "Ata Manobo, Bagobo Klata, Bagobo Tagabawa, Iranun, Kagan, Maguindanaon, Maranao, Matigsalug, Obu Manuvu, Sama-Bajaw, Tausug"
        ],
        [
            "Cebuano, Chinese, Hiligaynon, Ilocano, Indian, Kapampangan, Tagalog"
        ],
        [
            " Davao del Norte"
        ],
        [
            "Ata, Dibabawon, Kagan, Maguindanaon, Mandaya, Mangguangan, Mansaka, Sama-Bajaw"
        ],
        [
            "Bicolano, Cebuano, Hiligaynon, Ilocano, Tagalog"
        ],
        [
            " Davao de Oro"
        ],
        [
            "Ata Manobo, Dibabawon, Kagan, Mandaya, Mangguangan, Mansaka"
        ],
        [
            "Bicolano, Cebuano, Hiligaynon, Ilocano, Tagalog"
        ],
        [
            " Davao Oriental"
        ],
        [
            "Manobo, Kagan, Mandaya, Mansaka"
        ],
        [
            "Cebuano, Hiligaynon, Ilocano, Tagalog"
        ],
        [
            " Davao Occidental"
        ],
        [
            "Blaan, Tagakaulo, Manobo, Sangil"
        ],
        [
            "Cebuano, Hiligaynon, Ilocano, Tagalog"
        ],
        [
            "Soccsksargen"
        ],
        [
            " Cotabato"
        ],
        [
            "Bagobo Tagabawa, Iranun, Maguindanaon, Manobo, Tagakaulo"
        ],
        [
            "Bicolano, Cebuano, Hiligaynon, Ilocano, Karay-a, Tagalog, Waray"
        ],
        [
            " Sarangani"
        ],
        [
            "Blaan, Maguindanaon, Tagakaulo, Tboli"
        ],
        [
            "Cebuano, Hiligaynon, Ilocano, Tagalog, Waray"
        ],
        [
            " South Cotabato"
        ],
        [
            "Blaan, Maguindanaon, Tboli"
        ],
        [
            "Bicolano, Cebuano, Hiligaynon, Ilocano, Karay-a, Kapampangan, Tagalog, Waray"
        ],
        [
            " Sultan Kudarat"
        ],
        [
            "Blaan, Maguindanaon, Manobo, Teduray"
        ],
        [
            "Cebuano, Hiligaynon, Ilocano, Karay-a, Kapampangan, Tagalog"
        ],
        [
            "BARMM"
        ],
        [
            " Maguindanao del Norte"
        ],
        [
            "Iranun, Maguindanaon, Teduray"
        ],
        [
            "Cebuano, Hiligaynon, Ilocano, Tagalog"
        ],
        [
            " Maguindanao del Sur"
        ],
        [
            "Ilianen Manobo, Maguindanaon, Teduray"
        ],
        [
            "Hiligaynon, Ilocano, Karay-a, Tagalog"
        ],
        [
            " Lanao del Sur"
        ],
        [
            "Iranun, Maranao"
        ],
        [
            "Bicolano, Cebuano, Hiligaynon, Ilocano, Tagalog"
        ],
        [
            " Basilan"
        ],
        [
            "Sama-Bajaw, Tausug, Yakan"
        ],
        [
            "Chavacano, Cebuano, Hiligaynon, Ilocano"
        ],
        [
            " Sulu"
        ],
        [
            "Sama-Bajaw, Tausug"
        ],
        [
            "Cebuano"
        ],
        [
            " Tawi-tawi"
        ],
        [
            "Sama-Bajaw, Tausug"
        ],
        [
            "Cebuano"
        ],
        [
            "Caraga"
        ],
        [
            " Agusan del Norte"
        ],
        [
            "Agusan Manobo, Higaonon, Mamanwa"
        ],
        [
            "Butuanon, Cebuano, Hiligaynon, Ilocano, Surigaonon, Tagalog"
        ],
        [
            " Agusan del Sur"
        ],
        [
            "Bagobo, Agusan Manobo, Higaonon, Mamanwa"
        ],
        [
            "Bicolano, Butuanon, Cebuano, Hiligaynon, Ilocano, Surigaonon, Tagalog"
        ],
        [
            " Surigao del Norte"
        ],
        [
            "Mandaya, Agusan Manobo, Mamanwa, Mansaka"
        ],
        [
            "Bicolano, Cebuano, Hiligaynon, Ilocano, Surigaonon, Tagalog, Waray"
        ],
        [
            " Surigao del Sur"
        ],
        [
            "Mandaya, Agusan Manobo"
        ],
        [
            "Bicolano, Cebuano, Hiligaynon, Ilocano, Surigaonon, Tagalog, Waray"
        ],
        [
            " Dinagat Islands"
        ],
        [
            "Cebuano, Hiligaynon, Ilocano, Surigaonon, Tagalog, Waray"
        ],
        [
            "An American census conducted in the early 1900s noted that the island was inhabited by people \"greatly divided in origin, temperament and religion\".",
            "Evidence of the island's cultural diversity can be seen in the buildings and ruins of old Spanish settlements in the northwestern peninsula that span eastwards to the southern gulf coast, the site of the ancient Rajahnate of Butuan in the northeast region (Caraga), the sultanates in the southwest (Sultanate of Sulu, Sultanate of Lanao, Sultanate of Maguindanao), a number of Buddhist and Taoist temples, and the numerous indigenous tribes."
        ],
        [
            "Today around 25.8 percent of the household population in Mindanao classified themselves as Cebuanos.",
            "Other ethnic groups included Bisaya/Binisaya (18.4%), Hiligaynon/Ilonggo (8.2%), Maguindanaon (5.5%), and Maranao (5.4%).",
            "The remaining 36.6 percent belonged to other ethnic groups, including individuals from Luzon and the Lumad people (indigenous peoples of Mindanao).",
            "Cebuano registered the highest proportion of ethnic group in Northern Mindanao and Davao Region with 35.59 percent and 37.76 percent, respectively.",
            "In Soccsksargen, it was Hiligaynon/Ilonggo (31.58%), Binisaya/Bisaya (33.10%) in Zamboanga Peninsula, Maranao (26.40%) in BARMM, and Surigaonon (25.67%) in Caraga."
        ],
        [
            "Like elsewhere, assimilation from one ethnic group into another is not uncommon in Mindanao.",
            "Over the last decades, many migrants from Luzon and Lumad tribes on the island integrated and assimilated into the majority Cebuano-speaking society in Mindanao (Hiligaynon-speaking in the case of Soccsksargen).",
            "They identified themselves as Visayans as a result of learning to speak Cebuano or Hiligaynon fluently from their Cebuano or Hiligaynon neighbors.",
            "Despite this, many of them still know and retain their non-Visayan roots and some speak their ancestors' language fluently as their second or third language since Mindanao is a melting pot of cultures as a result of southward migration from Luzon and Visayas since the 20th century.",
            "Descendants of these migrant Luzon ethnic groups and Lumads, especially newer generations (as Mindanao-born natives), now speak Cebuano or Hiligaynon fluently as their main language with little or no knowledge of their ancestors' native tongues at the time of their southward journey to Mindanao and Lumads developed contact with Cebuano and Hiligaynon speakers."
        ],
        [
            "Languages"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(August 2020) (Learn how and when to remove this message)"
        ],
        [
            "Dozens of languages are spoken in Mindanao; among them, Cebuano, Hiligaynon, Maguindanaon, Maranao, Surigaonon, Tausug, and Chavacano are most widely spoken.",
            "Of the seven aforementioned regional languages, Cebuano (often referred to as Bisaya) has the largest number of speakers, being spoken throughout Northern Mindanao (except the southern parts of Lanao del Norte), the Davao region, the western half of the Caraga region (as well as the city of Bislig and the municipalities surrounding it in Surigao del Sur), the entirety of the Zamboanga Peninsula (with the exception of Zamboanga City), and southern Soccsksargen."
        ],
        [
            "Hiligaynon is the main language of Soccsksargen, where majority of the inhabitants are of ethnic Hiligaynon stock.",
            "Maguindanaon, Manobo, Tboli and Blaan are the indigenous languages spoken in Soccsksargen.",
            "Ilocano, a native language of the Luzon ethnic group of the same name, is also spoken in some areas in Soccsksargen, where they also share residency with Hiligaynons.",
            "Surigaonon is spoken in the eastern half of the Caraga region, mainly by the eponymous Surigaonons.",
            "Tausug is widely spoken specifically in the Sulu Archipelago, which comprises the provinces of Basilan, Sulu, and Tawi-Tawi, with a sizeable community of speakers residing in Zamboanga City."
        ],
        [
            "Maranao and Maguindanaon are the dominant languages of the eastern territories of the Bangsamoro, respectively, with the former being spoken in Lanao del Sur as well as the southern areas of Lanao del Norte, and the latter in the eponymous provinces of Maguindanao del Norte and Maguindanao del Sur and also in adjacent areas which are part of Soccsksargen.",
            "Chavacano is the native language of Zamboanga City and is also the lingua franca of Basilan; it is also spoken in the southernmost fringes of Zamboanga Sibugay.",
            "It is also spoken, albeit as a minority language, in Cotabato City and Davao City, where dialects of it, respectively, exist, namely Cotabateño and Castellano Abakay, both of which evolved from the variant of the language spoken in Zamboanga City."
        ],
        [
            "English and Filipino are also widely understood and spoken, with the former being highly utilized in business and academia, and the latter being used to communicate with visitors from Luzon and other parts of Visayas.",
            "Filipino is also the main lingua franca of Cotabato City and in BARMM as a whole."
        ],
        [
            "Religion"
        ],
        [
            "Religion in Mindanao (2020)"
        ],
        [
            "  Catholicism (55.16%)  Islam (24.84%)  Iglesia ni Cristo (5.2%)  Pentecostal (0.48%)  Aglipayan (2.16%)  Other (17.4%)"
        ],
        [
            "Christianity is the dominant religious affiliation in Mindanao with 65.9% of the household population, majority of which are adherents of Catholicism; Islam comprised 23.39%,"
        ],
        [
            "Tourism"
        ],
        [
            "Major tourist spots are scattered throughout Mindanao, consisting mostly of beach resorts, scuba diving resorts, surfing, museums, nature parks, mountain climbing, and river rafting.",
            "Siargao, best known for its surfing tower in Cloud 9, also has caves, pools, waterfalls, and lagoons."
        ],
        [
            "Energy"
        ],
        [
            "This section needs to be updated.",
            "Please help update this article to reflect recent events or newly available information.",
            "(July 2017)"
        ],
        [
            "Many areas in Mindanao suffer rotating 12-hour blackouts due to the island's woefully inadequate power supply."
        ],
        [
            "The Manila Electric Company (Meralco), the largest power distributor in the Philippines, and Global Business Power Corp (GBPC), also a major provider, have announced plans to enter Mindanao for the first time to establish solutions for the power problems within the island."
        ],
        [
            "Major annual events"
        ],
        [
            "Mindanao Film Festival (Established in 2003)"
        ],
        [
            "Kadayawan Festival"
        ],
        [
            "Kaamulan Festival"
        ],
        [
            "Christmas Symbols Festival"
        ],
        [
            "Bangsamoro Short Film Festival"
        ],
        [
            "Halad Festival"
        ],
        [
            "P'gsalabuk Festival"
        ],
        [
            "Kinabayo Festival"
        ],
        [
            "See also"
        ],
        [
            "Philippines portalIslands portalGeography portal"
        ],
        [
            "Geography of the Philippines"
        ],
        [
            "Island groups of the Philippines"
        ],
        [
            "List of islands in the Philippines"
        ],
        [
            "Luzon"
        ],
        [
            "Visayas"
        ],
        [
            "References"
        ],
        [
            "^ a b \"Island Directory Tables\".",
            "UN System-Wide Earthwatch Web Site.",
            "Archived from the original on December 1, 2015.",
            "Retrieved October 10, 2017."
        ],
        [
            "^ \"Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities\" (PDF).",
            "2010 Census and Housing Population.",
            "National Statistics Office.",
            "Archived from the original (PDF) on September 28, 2013.",
            "Retrieved August 15, 2014."
        ],
        [
            "^ \"Population and Housing\".",
            "Philippine Statistics Authority.",
            "Archived from the original on March 12, 2017.",
            "Retrieved March 15, 2017."
        ],
        [
            "^ a b c \"Mindanao Comprised About 24 Percent of the Philippines' Total Population\".",
            "Philippine Statistics Authority.",
            "June 8, 2005.",
            "Archived from the original on May 10, 2019.",
            "Retrieved June 24, 2017."
        ],
        [
            "^ \"Fruits of Peace\".",
            "The Economist.",
            "October 15, 2015.",
            "Archived from the original on July 1, 2017.",
            "Retrieved October 10, 2017."
        ],
        [
            "^ Calderon, Justin (April 22, 2013).",
            "\"Unearthed Gem\".",
            "Investvine.",
            "Archived from the original on December 26, 2018.",
            "Retrieved April 29, 2013."
        ],
        [
            "^ Campbell, Gwyn (2018).",
            "Bondage and the Environment in the Indian Ocean World.",
            "Cham, Switzerland: Springer.",
            "p. 84.",
            "ISBN 978-3-319-70028-1."
        ],
        [
            "^ \"The History of Subanon since the Neolithic Era or Stone Age\".",
            "Subanon Territories.",
            "Archived from the original on November 9, 2013.",
            "Retrieved November 8, 2013."
        ],
        [
            "^ a b Koerner, Brendan I.",
            "(January 28, 2005).",
            "\"How Islam got to the Philippines\".",
            "Slate.",
            "Archived from the original on September 7, 2011.",
            "Retrieved October 4, 2009."
        ],
        [
            "^ Catubig, Jonathan B.",
            "(2003).",
            "\"Dapitan Kingdom: A Historical Study on the Bisayan Migration and Settlement in Mindanao, circa 1563\".",
            "The Journal of History.",
            "49 (1–4): 144.",
            "The Ternatan king planned a retaliatory attack against the Boholanos.",
            "He succeeded with his plans by covertly sending his twenty joangas to Bohol one by one deceitfully saying that \"they are traders attending only to the sale of their goods\""
        ],
        [
            "^ Scott, William Henry (1989).",
            "\"The Mediterranean Connection\".",
            "Philippine Studies.",
            "37 (2): 131–144.",
            "Quoting from; Cortes 30, Suma, pp.",
            "376–77, and 362."
        ],
        [
            "^ Magellan's Voyage, Antonio Pigafetta.",
            "Chapter XXXIV"
        ],
        [
            "^ \"Ruy Lopez de Villalobos Begun His Expedition to the Philippines\".",
            "The Kahimyang Project.",
            "November 2011.",
            "Archived from the original on July 5, 2017.",
            "Retrieved July 11, 2017."
        ],
        [
            "^ a b \"Zamboanga City History\".",
            "Zamboanga.com.",
            "Archived from the original on June 4, 2017.",
            "Retrieved July 11, 2017."
        ],
        [
            "^ \"SECOND BOOK OF THE SECOND PART OF THE CONQUESTS OF THE FILIPINAS ISLANDS, AND CHRONICLE OF THE RELIGIOUS OF OUR FATHER, ST. AUGUSTINE\" (Zamboanga City History)"
        ],
        [
            "\"He (Governor Don Sebastían Hurtado de Corcuera) brought a great reënforcements of soldiers, many of them from Perú, as he made his voyage to Acapulco from that kingdom.\""
        ],
        [
            "^ Abubakar, Carmen A.",
            "(September 1, 2003).",
            "\"Mindanao: A Miniature History\".",
            "Le Monde diplomatique.",
            "Archived from the original on September 30, 2020.",
            "Retrieved September 16, 2020."
        ],
        [
            "^ Sordilla, Shane Patrick.",
            "\"Maguindanao and Ternate Connection and Disconnection During the Age of European Colonization: An Overview\".",
            "Archived from the original on April 11, 2021.",
            "Retrieved April 11, 2021 – via Academia.edu."
        ],
        [
            "^ Nakpil, Carmen Guerrero (October 29, 2003).",
            "\"Carmen Nakpil: Manila Under the Muslims\".",
            "Philippine Headline News Online.",
            "Archived from the original on March 4, 2009.",
            "Retrieved December 5, 2008."
        ],
        [
            "^ Chen, C. Peter (2006).",
            "\"Invasion of the Philippine Islands\".",
            "World War II Database.",
            "Archived from the original on July 17, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ \"During the Japanese Period\".",
            "Iligan City Government.",
            "November 22, 2012.",
            "Archived from the original on July 11, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ Schmidt, Larry (1982).",
            "American Involvement in the Filipino Resistance Movement on Mindanao During the Japanese Occupation, 1942–1945 (PDF) (Master's thesis).",
            "U.S. Army Command and General Staff College.",
            "Archived (PDF) from the original on May 8, 2021."
        ],
        [
            "^ Lee, Clark (April 3, 1942).",
            "\"Most of Philippines Still Free of Invading Japanese\".",
            "St. Joseph Gazette.",
            "p. 7 – via news.google.com."
        ],
        [
            "^ a b Miclat, Gus (2002).",
            "\"Our Lives Were Never the Same Again\".",
            "In Arguillas, Carolyn O.",
            "(ed.).",
            "Turning Rage Into Courage: Mindanao Under Martial Law.",
            "MindaNews Publications, Mindanao News and Information Cooperative Center.",
            "OCLC 644320116."
        ],
        [
            "^ See Francia, Luis H. (2013).",
            "History of the Philippines: From Indios Bravos to Filipinos.",
            "New York: Overlook Press.",
            "ISBN 978-1-4683-1545-5."
        ],
        [
            "^ For an in-depth survey of indigenous peoples and forced land seizures in the Philippines, see Eder, James F. (June 1994).",
            "\"Indigenous Peoples, Ancestral Lands and Human Rights in the Philippines\".",
            "Cultural Survival Quarterly.",
            "Archived from the original on December 22, 2018."
        ],
        [
            "^ The Bangsamoro Struggle for Self-Determintation: A Case Study (PDF).",
            "Archived (PDF) from the original on February 15, 2017.",
            "Retrieved September 25, 2020 – via manoa.hawaii.edu."
        ],
        [
            "^ a b c Mackerras, Colin, ed.",
            "(2004).",
            "Ethnicity in Asia.",
            "London: RoutledgeCurzon.",
            "p. 143.",
            "ISBN 0-203-38046-0."
        ],
        [
            "^ George, T. J. S. (1980).",
            "Revolt in Mindanao: The Rise of Islam in Philippine Politics.",
            "Kuala Lumpur: Oxford University Press.",
            "ISBN 0-19-580429-5.",
            "OCLC 6569089."
        ],
        [
            "^ Rodis, Rodel (January 30, 2015).",
            "\"Remembering the First Quarter Storm\".",
            "Inquirer.net.",
            "Archived from the original on January 31, 2015.",
            "Retrieved September 15, 2020."
        ],
        [
            "^ \"Infographic: The day Marcos declared Martial Law\".",
            "Official Gazette of the Republic of the Philippines.",
            "Archived from the original on September 11, 2017.",
            "Retrieved October 26, 2018."
        ],
        [
            "^ \"ORCULLO, Alexander L. – Bantayog ng mga Bayani\".",
            "Bantayog ng mga Bayani.",
            "March 6, 2016.",
            "Archived from the original on November 1, 2018.",
            "Retrieved October 31, 2018."
        ],
        [
            "^ Severino, Howie (February 25, 2017).",
            "iWitness: Sino si Alex Orcullo?",
            "At Ano ang Kontribusyon niya sa People Power sa Davao?",
            "(TV Documentary) (in Filipino).",
            "GMA News and Public Affairs."
        ],
        [
            "^ \"MARTYRS & HEROES: Amatong, Jacobo S.\" Bantayog ng mga Bayani.",
            "October 11, 2015.",
            "Archived from the original on June 16, 2021.",
            "Retrieved March 4, 2021."
        ],
        [
            "^ Maslog, Crispin C. (1993).",
            "The rise and fall of Philippine community newspapers.",
            "Intramuros, Manila: Published by the Philippine Press Institute with funding from Konrad Adenauer Foundation.",
            "ISBN 971-8703-09-8.",
            "OCLC 29830136."
        ],
        [
            "^ Santillan, Karina R. (2015).",
            "\"Livelihoods for Women in Mindanao: A Post-Conflict Reconstruction Approach\".",
            "Asian Journal of Women's Studies.",
            "21 (1): 19–39.",
            "doi:10.1080/12259276.2015.1029232.",
            "S2CID 153206038."
        ],
        [
            "^ \"Duterte Declares Martial Law in Mindanao, Cuts Short Russia Trip Moscow, Russia\".",
            "Presidential Communications Operations Office.",
            "May 24, 2017.",
            "Archived from the original on January 24, 2020.",
            "Retrieved August 5, 2020."
        ],
        [
            "^ Unson, John (June 13, 2017).",
            "\"ARMM: More than 183,500 Displaced by Marawi Crisis\".",
            "Philstar.com.",
            "Archived from the original on July 11, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ Morales, Neil Jerome (May 23, 2018).",
            "\"A Year After Siege, Marawi Families Seek Closure\".",
            "ABS-CBN News.",
            "Reuters.",
            "Archived from the original on May 23, 2018.",
            "Retrieved August 5, 2020."
        ],
        [
            "^ \"Philippines says it is ready to use force to quell secession attempts as Duterte row deepens\".",
            "The Guardian.",
            "February 5, 2024.",
            "ISSN 0261-3077.",
            "Retrieved February 8, 2024."
        ],
        [
            "^ Panganiban-Perez, Tina (January 31, 2024).",
            "\"Alvarez 'thanks' Romualdez over renewed calls for Mindanao independence\".",
            "GMA News.",
            "Retrieved January 31, 2024."
        ],
        [
            "^ a b c Tubayan, Elijah Joseph C. (January 7, 2018).",
            "\"Bringing Mindanao Into the Fold\".",
            "BusinessWorld.",
            "Archived from the original on January 19, 2019.",
            "Retrieved January 19, 2019."
        ],
        [
            "^ Alama, Rudolph Ian (May 10, 2018).",
            "\"Davao Region Surprises with Historic 10.9% GRDP Growth in 2017\".",
            "Philippine Information Agency.",
            "Archived from the original on September 15, 2018.",
            "Retrieved September 15, 2018."
        ],
        [
            "^ \"Davao\".",
            "Reserbasyon.",
            "Archived from the original on January 20, 2019.",
            "Retrieved January 19, 2019."
        ],
        [
            "^ \"Philippine Standard Geographic Code (PSGC) – Regions\".",
            "Philippine Statistics Authority.",
            "Retrieved December 27, 2021."
        ],
        [
            "^ Census of Population (2020).",
            "Table B - Population and Annual Growth Rates by Province, City, and Municipality - By Region.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSGC Interactive; List of Provinces\".",
            "Philippine Statistics Authority.",
            "Archived from the original on May 7, 2016.",
            "Retrieved April 3, 2016."
        ],
        [
            "^ \"PSGC Interactive; List of Cities\".",
            "Philippine Statistics Authority.",
            "Archived from the original on May 8, 2016.",
            "Retrieved April 7, 2016."
        ],
        [
            "^ Hogan, C. Michael (August 29, 2011).",
            "\"Sulu Sea\".",
            "The Encyclopedia of Earth.",
            "Archived from the original on May 4, 2012."
        ],
        [
            "^ \"Climate change affects Mindanao: Environment advocate\".",
            "Sunstar.",
            "January 3, 2017.",
            "Retrieved March 29, 2022."
        ],
        [
            "^ \"Climate change is a threat multiplier for the forcibly displaced in Mindanao\".",
            "UNHCR Philippines.",
            "Retrieved March 29, 2022."
        ],
        [
            "^ Mordeno, H. Marcos C. (August 10, 2021).",
            "\"Climate change closer to irreversible tipping points – IPCC\".",
            "MindaNews.",
            "Retrieved March 29, 2022."
        ],
        [
            "^ Boquet, Yves (2017).",
            "The Philippine Archipelago.",
            "Cham, Switzerland: Springer.",
            "p. 16.",
            "ISBN 978-3-319-51926-5."
        ],
        [
            "^ \"Mindanao\".",
            "The New Student's Reference Work.",
            "Chicago: F. E. Compton and Company.",
            "1914 – via Wikisource."
        ],
        [
            "^ Galay-David, Karlo Antonio.",
            "\"We Who Seek to Settle Problematizing the Mindanao Settler Identity\".",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ \"Religious Affiliation in the Philippines (2020 Census of Population and Housing)\".",
            "Philippines in Figures.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "February 22, 2023.",
            "Retrieved March 25, 2023."
        ],
        [
            "^ \"Muslim Population in Mindanao (Based on POPCEN 2015)\".",
            "Philippine Statistics Authority.",
            "July 26, 2017.",
            "Archived from the original on May 4, 2019.",
            "Retrieved August 31, 2018."
        ],
        [
            "^ \"Things to Do in Siargao Island\".",
            "Tripadvisor.",
            "Archived from the original on May 19, 2018.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ \"12 Places to Explore in Butuan City\".",
            "Angelo The Explorer.",
            "June 28, 2015.",
            "Archived from the original on July 27, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ \"\".",
            "Duka Bay Resort.",
            "Archived from the original on July 6, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ \"\".",
            "Matangale Alibuag.",
            "Archived from the original on July 2, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ \"Tourism\".",
            "Cagayan de Oro.",
            "Archived from the original on July 1, 2017."
        ],
        [
            "^ \"\".",
            "Dahilayan Adventure Park.",
            "Archived from the original on July 8, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ \"Places to See\".",
            "Iligan City Government.",
            "Archived from the original on July 19, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ \"Things to do in Zamboanga City\".",
            "The Pinay Solo Backpacker.",
            "January 3, 2017.",
            "Archived from the original on July 26, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ \"Attractions\".",
            "Official Website of the City Government of Tacurong.",
            "Archived from the original on July 29, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ \"Top 50 Must-visit Tourist Destinations in Davao City\".",
            "WayPH.com.",
            "Archived from the original on May 19, 2017.",
            "Retrieved July 12, 2017."
        ],
        [
            "^ Colina, Antonio L. IV (January 26, 2016).",
            "\"DLPC Eyeing Other Power Sources as Dry Spell Worsens\".",
            "MindaNews.",
            "Archived from the original on October 10, 2017.",
            "Retrieved October 10, 2017."
        ],
        [
            "^ Calderon, Justin (March 12, 2013).",
            "\"Mindanao to Face Higher Power Prices\".",
            "Investvine.",
            "Archived from the original on March 15, 2013.",
            "Retrieved March 13, 2013."
        ],
        [
            "^ a b Calderon, Justin (January 30, 2013).",
            "\"Mindanao Power Problem Close to Solution\".",
            "Investvine.",
            "Archived from the original on January 31, 2013.",
            "Retrieved February 11, 2013."
        ],
        [
            "^ \"Despite Pandemic, Mindanao Film Festival Will Push Thru This Year\".",
            "MumbaiNews.net.",
            "Philippine Information Agency.",
            "July 14, 2020.",
            "Archived from the original on December 26, 2021.",
            "Retrieved December 1, 2020."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Mindanao."
        ],
        [
            "Look up mindanao in Wiktionary, the free dictionary."
        ],
        [
            "Wikimedia Commons has media related to Mindanao."
        ],
        [
            "Wikisource has the text of The New Student's Reference Work article  \"Mindanao\"."
        ],
        [
            " Geographic data related to Mindanao at OpenStreetMap"
        ],
        [
            "Mindanao Development Authority Official Website Archived September 16, 2017, at the Wayback Machine"
        ],
        [
            "vteThe 40 largest islands of the Philippines"
        ],
        [
            "Alabat"
        ],
        [
            "Balabac"
        ],
        [
            "Basilan"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bucas Grande"
        ],
        [
            "Bugsuk"
        ],
        [
            "Burias"
        ],
        [
            "Busuanga"
        ],
        [
            "Calayan"
        ],
        [
            "Camiguin"
        ],
        [
            "Camiguin de Babuyanes"
        ],
        [
            "Cebu"
        ],
        [
            "Catanduanes"
        ],
        [
            "Culion"
        ],
        [
            "Dinagat"
        ],
        [
            "Dumaran"
        ],
        [
            "Guimaras"
        ],
        [
            "Jolo"
        ],
        [
            "Leyte"
        ],
        [
            "Lubang"
        ],
        [
            "Luzon"
        ],
        [
            "Masbate"
        ],
        [
            "Marinduque"
        ],
        [
            "Mindanao"
        ],
        [
            "Mindoro"
        ],
        [
            "Negros"
        ],
        [
            "Olutanga"
        ],
        [
            "Palawan"
        ],
        [
            "Panaon"
        ],
        [
            "Panay"
        ],
        [
            "Polillo"
        ],
        [
            "Samal"
        ],
        [
            "Samar"
        ],
        [
            "Siargao"
        ],
        [
            "Sibuyan"
        ],
        [
            "Siquijor"
        ],
        [
            "Tablas"
        ],
        [
            "Tawitawi"
        ],
        [
            "Ticao"
        ],
        [
            "Islands portal"
        ],
        [
            "See also"
        ],
        [
            "Geography of the Philippines"
        ],
        [
            "Island groups of the Philippines"
        ],
        [
            "List of islands"
        ],
        [
            "vteWorld's largest islands100,000 km2(38,610 sq mi) and greater"
        ],
        [
            "Greenland"
        ],
        [
            "New Guinea"
        ],
        [
            "Borneo"
        ],
        [
            "Madagascar"
        ],
        [
            "Baffin Island"
        ],
        [
            "Sumatra"
        ],
        [
            "Honshu"
        ],
        [
            "Victoria Island (Canada)"
        ],
        [
            "Great Britain"
        ],
        [
            "Ellesmere Island"
        ],
        [
            "Sulawesi"
        ],
        [
            "South Island"
        ],
        [
            "Java"
        ],
        [
            "North Island"
        ],
        [
            "Luzon"
        ],
        [
            "Newfoundland"
        ],
        [
            "Cuba"
        ],
        [
            "Iceland"
        ],
        [
            "Islands portal20,000–99,999 km2(7,722–38,610 sq mi)"
        ],
        [
            "Mindanao"
        ],
        [
            "Ireland"
        ],
        [
            "Hokkaido"
        ],
        [
            "Hispaniola"
        ],
        [
            "Sakhalin"
        ],
        [
            "Banks Island"
        ],
        [
            "Sri Lanka"
        ],
        [
            "Tasmania"
        ],
        [
            "Devon Island"
        ],
        [
            "Alexander Island"
        ],
        [
            "Severny Island"
        ],
        [
            "Isla Grande de Tierra del Fuego"
        ],
        [
            "Axel Heiberg Island"
        ],
        [
            "Melville Island"
        ],
        [
            "Southampton Island"
        ],
        [
            "Marajó"
        ],
        [
            "Spitsbergen"
        ],
        [
            "Kyushu"
        ],
        [
            "Taiwan"
        ],
        [
            "New Britain"
        ],
        [
            "Prince of Wales Island"
        ],
        [
            "Yuzhny Island"
        ],
        [
            "Hainan"
        ],
        [
            "Vancouver Island"
        ],
        [
            "Timor"
        ],
        [
            "Sicily"
        ],
        [
            "Somerset Island"
        ],
        [
            "Kotelny Island"
        ],
        [
            "Sardinia"
        ],
        [
            "Bananal"
        ],
        [
            "vte  Administrative divisions of the PhilippinesCapital"
        ],
        [
            "Manila (National Capital Region)"
        ],
        [
            "Island groups"
        ],
        [
            "Luzon"
        ],
        [
            "Visayas"
        ],
        [
            "Mindanao"
        ],
        [
            "RegionsAdministrative"
        ],
        [
            "I – Ilocos Region"
        ],
        [
            "II – Cagayan Valley"
        ],
        [
            "III – Central Luzon"
        ],
        [
            "IV-A – Calabarzon"
        ],
        [
            "Mimaropa – Southwestern Tagalog Region"
        ],
        [
            "V – Bicol Region"
        ],
        [
            "VI – Western Visayas"
        ],
        [
            "VII – Central Visayas"
        ],
        [
            "VIII – Eastern Visayas"
        ],
        [
            "IX – Zamboanga Peninsula"
        ],
        [
            "X – Northern Mindanao"
        ],
        [
            "XI – Davao Region"
        ],
        [
            "XII – Soccsksargen"
        ],
        [
            "XIII – Caraga Region"
        ],
        [
            "CAR – Cordillera Administrative Region"
        ],
        [
            "NCR – National Capital Region"
        ],
        [
            "NIR – Negros Island Region"
        ],
        [
            "Autonomous"
        ],
        [
            "BARMM – Bangsamoro Autonomous Region in Muslim Mindanao"
        ],
        [
            "Provinces"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "Cities"
        ],
        [
            "List of cities in the Philippines"
        ],
        [
            "Municipalities"
        ],
        [
            "List of cities and municipalities in the Philippines"
        ],
        [
            "Barangays"
        ],
        [
            "Lists of barangays by province"
        ],
        [
            "Poblacion"
        ],
        [
            "Other subdivisions"
        ],
        [
            "Puroks"
        ],
        [
            "Sitios"
        ],
        [
            "List of primary LGUs"
        ],
        [
            "Legislative districts"
        ],
        [
            "Metropolitan areas"
        ],
        [
            "Special Geographic Area"
        ],
        [
            "Proposed"
        ],
        [
            "Formally proposed provinces"
        ],
        [
            "Autonomous regions"
        ],
        [
            "Cordillera"
        ],
        [
            "Historical"
        ],
        [
            "Former provinces"
        ],
        [
            "Sub-provinces"
        ],
        [
            "Regions"
        ],
        [
            "Autonomous Region in Muslim Mindanao"
        ],
        [
            "Southern Tagalog"
        ],
        [
            "vteIsland groups of the Philippines"
        ],
        [
            "Luzon"
        ],
        [
            "Visayas"
        ],
        [
            "Mindanao"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Germany"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Japan"
        ],
        [
            "Czech Republic"
        ],
        [
            "Other"
        ],
        [
            "NARA"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Mindanao&oldid=1234220677\""
        ],
        [
            "Categories: MindanaoIsland groups of the PhilippinesIslands of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsPages using the Phonos extensionCS1 foreign language sources (ISO 639-2)CS1 errors: missing periodicalArticles with short descriptionShort description is different from WikidataUse mdy dates from October 2022Use Philippine English from July 2020All Wikipedia articles written in Philippine EnglishArticles containing Maguindanaon-language textArticles containing Maranao-language textArticles containing Tausug-language textArticles with text in Manobo languagesArticles containing Central Subanen-language textCoordinates on WikidataPages including recorded pronunciationsWikipedia articles in need of updating from December 2020All Wikipedia articles in need of updatingWikipedia articles needing clarification from June 2015All articles lacking reliable referencesArticles lacking reliable references from December 2021All articles with failed verificationArticles with failed verification from April 2020Articles needing additional references from August 2020All articles needing additional referencesArticles lacking reliable references from August 2020All articles with unsourced statementsArticles with unsourced statements from August 2020Articles with unsourced statements from September 2019Wikipedia articles in need of updating from October 2019Articles needing additional references from September 2013Pages using image label with a wide imagePages using largest cities with classArticles with unsourced statements from September 2010Wikipedia articles in need of updating from July 2017Commons category link from WikidataWebarchive template wayback linksArticles with VIAF identifiersArticles with GND identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with NDL identifiersArticles with NKC identifiersArticles with NARA identifiers"
        ]
    ]
}