{
    "name": "Bicol Region",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bicol Region"
        ],
        [
            "43 languages"
        ],
        [
            "閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoChavacano de ZamboangaDeutschEspañolEsperantoEuskaraفارسیFrançais한국어हिन्दीHrvatskiIlokanoItalianoKapampanganქართულიLatinaLatviešuLietuviųМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยУкраїнськаاردوTiếng Việt文言Winaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°30′N 123°20′E﻿ / ﻿13.5°N 123.33°E﻿ / 13.5; 123.33"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Administrative region of the Philippines"
        ],
        [
            "Region in Luzon, PhilippinesBicolRegion"
        ],
        [
            "Clockwise from the top: Mayon Volcano, Calaguas Islands, Ateneo de Naga University Church, Caramoan National Park, Legazpi CathedralNickname: Home of the UragonsAnthem: Bicol Regional MarchLocation in the PhilippinesOpenStreetMapCoordinates: 13°30′N 123°20′E﻿ / ﻿13.5°N 123.33°E﻿ / 13.5; 123.33Country PhilippinesIsland groupLuzonRegional centerand largest cityLegazpiArea • Total18,155.82 km2 (7,010.00 sq mi)Highest elevation (Mayon Volcano)2,463 m (8,081 ft)Population (2020 census) • Total6,082,165 • Density330/km2 (870/sq mi)Time zoneUTC+8 (PST)ISO 3166 codePH-05Provinces"
        ],
        [
            "6"
        ],
        [
            " Albay"
        ],
        [
            " Camarines Norte"
        ],
        [
            " Camarines Sur"
        ],
        [
            " Catanduanes"
        ],
        [
            " Masbate"
        ],
        [
            " Sorsogon"
        ],
        [
            "Independent cities"
        ],
        [
            "1"
        ],
        [
            " Naga"
        ],
        [
            "Component cities"
        ],
        [
            "6"
        ],
        [
            " Iriga"
        ],
        [
            " Legazpi"
        ],
        [
            " Ligao"
        ],
        [
            " Masbate City"
        ],
        [
            " Sorsogon City"
        ],
        [
            " Tabaco"
        ],
        [
            "Municipalities107Barangays3,471Cong.",
            "districts16LanguagesBikol languages (Central BikolAlbayanonRinconadaNorthern CatanduanesSouthern Catanduanes)Visayan languages (MasbateñoNorthern SorsogonWaray Sorsogon)TagalogEnglishGDP (2023)₱701.72 billion$12.61 billionHDI 0.687 (Medium)HDI rank13th in the Philippines (2019)Websitedilgbicol.org"
        ],
        [
            "The Bicol Region,"
        ],
        [
            "The regional center is Legazpi and has one independent component city, the pilgrim city of Naga.",
            "The region is bounded by Lamon Bay to the north, the Philippine Sea to the east, and the Sibuyan Sea and Ragay Gulf to the west.",
            "The northernmost provinces, Camarines Norte and Camarines Sur, are bordered to the west by the province of Quezon in the Calabarzon region."
        ],
        [
            "Geography"
        ],
        [
            "The Bicol Region comprises the southern part of Luzon, the largest island in the Philippine archipelago.",
            "The total land area is 5.9% of the total land area of the country.",
            "Around 69.3% of the total land area is alienable and disposable while the remaining 30.7% is public forest areas."
        ],
        [
            "History"
        ],
        [
            "The Bicol region was known as Ibalong, variously interpreted to derive from ibalio, \"to bring to the other side\"; ibalon, \"people from the other side\" or \"people who are hospitable and give visitors gifts to bring home\"; or as a corruption of Gibal-ong, a sitio of Magallanes, Sorsogon where the Spaniards first landed in 1567.",
            "The Bicol River was first mentioned in Spanish documents in 1572.",
            "The region was also called Los Camarines after the huts found by the Spaniards in Camalig, Albay.",
            "No prehistoric animal fossils have been discovered in Bicol and the peopling of the region remains obscure.",
            "The Aeta from Camarines Sur to Sorsogon strongly suggest that aborigines lived there long ago, but earliest evidence is of middle to late Neolithic life."
        ],
        [
            "A barangay (village) system was in existence by 1569.",
            "Records show no sign of Islamic rule nor any authority surpassing the datu (chieftain).",
            "Precolonial leadership was based on strength, courage, and intelligence.",
            "The native seemed apolitical.",
            "Thus, the datu's influence mattered most during crises like wars.",
            "Otherwise, early Bicol society remained family centered, and the leader was the head of the family."
        ],
        [
            "The Spanish influence in Bicol resulted mainly from the efforts of Augustinian and Franciscan Spanish missionaries.",
            "The first churches in Bicol, the San Francisco Church, and the Naga Cathedral, both in Naga City, along with the Holy Cross Parish in Nabua, Camarines Sur, are instituted by the Holy Order of the Franciscans.",
            "One of the oldest dioceses in the Philippines, the Archdiocese of Caceres, was also instituted in the Bicol Region.",
            "During this time, Bicol was dotted by many astilleros (shipyards) which were focused on constructing Manila Galleons, the heaviest ships in their time, from the local hardwood forests and these Manila Galleons were responsible for trade between Asia and the Americas."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Provinces"
        ],
        [
            "Provinces of Bicol"
        ],
        [
            "The region comprises six provinces: Albay, Camarines Norte, Camarines Sur, Sorsogon and the island-provinces of Catanduanes and Masbate, 107 Municipalities and 3,471 Barangays"
        ],
        [
            "As of 2020, Camarines Sur is the region's largest province in area and population, occupying 5,481.6 km2 (2,116.5 sq mi) or around 30.4% of the total land area with a population of 2,068,244.",
            "Catanduanes is the smallest in area as well as population with only 1,511.5 km2 (583.6 sq mi) or 8.4% of the total regional area and a population of 271,879."
        ],
        [
            "Province"
        ],
        [
            "Capital"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Cities"
        ],
        [
            "Muni."
        ],
        [
            "Barangay"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            " Albay"
        ],
        [
            "Legazpi City"
        ],
        [
            "22.6%"
        ],
        [
            "1,374,768"
        ],
        [
            "2,574.91"
        ],
        [
            "994.18"
        ],
        [
            "530"
        ],
        [
            "1,400"
        ],
        [
            "3"
        ],
        [
            "15"
        ],
        [
            "720"
        ],
        [
            " Camarines Norte"
        ],
        [
            "Daet"
        ],
        [
            "10.4%"
        ],
        [
            "629,699"
        ],
        [
            "2,277.93"
        ],
        [
            "879.51"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "0"
        ],
        [
            "12"
        ],
        [
            "282"
        ],
        [
            " Camarines Sur"
        ],
        [
            "Pili"
        ],
        [
            "34.0%"
        ],
        [
            "2,068,244"
        ],
        [
            "5,511.90"
        ],
        [
            "2,128.16"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "2"
        ],
        [
            "35"
        ],
        [
            "1,063"
        ],
        [
            " Catanduanes"
        ],
        [
            "Virac"
        ],
        [
            "4.5%"
        ],
        [
            "271,879"
        ],
        [
            "1,492.16"
        ],
        [
            "576.13"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "0"
        ],
        [
            "11"
        ],
        [
            "315"
        ],
        [
            " Masbate"
        ],
        [
            "Masbate City"
        ],
        [
            "14.9%"
        ],
        [
            "908,920"
        ],
        [
            "4,138.56"
        ],
        [
            "1,597.91"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "1"
        ],
        [
            "21"
        ],
        [
            "550"
        ],
        [
            " Sorsogon"
        ],
        [
            "Sorsogon City"
        ],
        [
            "13.6%"
        ],
        [
            "828,655"
        ],
        [
            "2,119.01"
        ],
        [
            "818.15"
        ],
        [
            "390"
        ],
        [
            "1,000"
        ],
        [
            "1"
        ],
        [
            "14"
        ],
        [
            "541"
        ],
        [
            "Total"
        ],
        [
            "6,082,165"
        ],
        [
            "18,114.47"
        ],
        [
            "6,994.04"
        ],
        [
            "340"
        ],
        [
            "880"
        ],
        [
            "7"
        ],
        [
            "107"
        ],
        [
            "3,471"
        ],
        [
            "Governors and vice governors"
        ],
        [
            "Province"
        ],
        [
            "Image"
        ],
        [
            "Governor"
        ],
        [
            "Political Party"
        ],
        [
            "Vice Governor"
        ],
        [
            "Albay"
        ],
        [
            "Edcel Greco Alexander B. Lagman"
        ],
        [
            "PFP"
        ],
        [
            "Baby Glenda O. Bongao"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Ricarte \"Dong\" Padilla"
        ],
        [
            "Aksyon"
        ],
        [
            "Joseph Ascutia"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Vincenzo Luigi Villafuerte"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Salvio Patrick Fortuno Jr."
        ],
        [
            "Catanduanes"
        ],
        [
            "Joseph Cua"
        ],
        [
            "NPC"
        ],
        [
            "Peter Cua"
        ],
        [
            "Masbate"
        ],
        [
            "Antonio Kho"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Elisa Olga T. Kho"
        ],
        [
            "Sorsogon"
        ],
        [
            "Boboy Hamor"
        ],
        [
            "NPC"
        ],
        [
            "Krunimar Antonio Escudero II"
        ],
        [
            "Cities"
        ],
        [
            "The region has one independent component city, Naga, and six component cities – Iriga, Legazpi, Ligao, Masbate City, Sorsogon City, and Tabaco.",
            "Masbate and Sorsogon are cities in their eponymous provinces."
        ],
        [
            " †  Regional center"
        ],
        [
            "City"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "City class"
        ],
        [
            "Income class"
        ],
        [
            "Province"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Iriga City"
        ],
        [
            "114,457"
        ],
        [
            "137.35"
        ],
        [
            "53.03"
        ],
        [
            "830"
        ],
        [
            "2,100"
        ],
        [
            "Component"
        ],
        [
            "4th"
        ],
        [
            "Camarines Sur"
        ],
        [
            "† Legazpi City"
        ],
        [
            "209,533"
        ],
        [
            "153.70"
        ],
        [
            "59.34"
        ],
        [
            "1,400"
        ],
        [
            "3,600"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Albay"
        ],
        [
            "Ligao"
        ],
        [
            "118,096"
        ],
        [
            "246.75"
        ],
        [
            "95.27"
        ],
        [
            "480"
        ],
        [
            "1,200"
        ],
        [
            "Component"
        ],
        [
            "4th"
        ],
        [
            "Albay"
        ],
        [
            "Masbate City"
        ],
        [
            "104,522"
        ],
        [
            "188.00"
        ],
        [
            "72.59"
        ],
        [
            "560"
        ],
        [
            "1,500"
        ],
        [
            "Component"
        ],
        [
            "4th"
        ],
        [
            "Masbate"
        ],
        [
            "Naga"
        ],
        [
            "209,170"
        ],
        [
            "84.48"
        ],
        [
            "32.62"
        ],
        [
            "2,500"
        ],
        [
            "6,500"
        ],
        [
            "Independent component"
        ],
        [
            "1st"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Sorsogon City"
        ],
        [
            "182,237"
        ],
        [
            "276.11"
        ],
        [
            "106.61"
        ],
        [
            "660"
        ],
        [
            "1,700"
        ],
        [
            "Component"
        ],
        [
            "3rd"
        ],
        [
            "Sorsogon"
        ],
        [
            "Tabaco City"
        ],
        [
            "140,961"
        ],
        [
            "117.14"
        ],
        [
            "45.23"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "Component"
        ],
        [
            "4th"
        ],
        [
            "Albay"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Bicol RegionYearPop.±% p.a.1903 643,901—    1918 840,004+1.79%1939 1,346,620+2.27%1948 1,666,459+2.40%1960 2,362,707+2.95%1970 2,966,881+2.30%1975 3,193,721+1.49%1980 3,476,982+1.71%1990 3,910,001+1.18%1995 4,325,307+1.91%2000 4,686,669+1.73%2007 5,106,160+1.19%2010 5,420,411+2.20%2015 5,796,989+1.29%2020 6,082,165+0.95%Source: Philippine Statistics Authority"
        ],
        [
            "See also: Demographics of the PhilippinesThis section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2018) (Learn how and when to remove this message)"
        ],
        [
            "Bicol Region has a population of 6,082,165 as of 2020 census, growing at an average annual rate of 1.29 percent between 2010 and 2015.",
            "The region's population density increased to 320 persons per square kilometer in 2015."
        ],
        [
            "In 1970, Camarines Sur was the only province with close to a million population.",
            "Albay, which was next in rank, reached the 1970 population level of Camarines Sur only 20 years later.",
            "Masbate and Sorsogon were in the same level every census year from 1970 to 1980.",
            "It is noteworthy that distribution and growth of the 1970 population were towards areas that were sparsely populated but agriculturally rich and/or endowed with fishery resources.",
            "The island province of Catanduanes and its municipalities have exhibited very low population growth from 1970 to 1980."
        ],
        [
            "A view of Legazpi City among Mt.",
            "Mayon"
        ],
        [
            "In 1980, the pattern was towards urbanization.",
            "This was due to the pull of newly installed infrastructures, particularly roads, and the sporadic growth of trade in strategically situated municipalities that have better economic opportunities.",
            "The 1990 growth originated from the strong attraction of employment opportunities in established urban centers, which have become a source of growth of adjacent municipalities.",
            "This situation was highly evident in Naga and Legazpi areas, whose surrounding municipalities exhibited high growth rates.",
            "Unmistakably, the spill-over effects of development permeated those initial high growth areas."
        ],
        [
            "Population spill-over happened in the Legazpi, Naga and Daet areas.",
            "Due to more population and more opportunities, Naga, Daet and Legazpi spilled their population to their neighboring and adjacent towns."
        ],
        [
            "The Bicolanos are descended from the Austronesian-speaking immigrants who came from Southern China during the Iron Age.",
            "Many of Bicolanos also have Chinese, Arab, and Spanish admixtures.",
            "Most of the townsfolk have Spanish Mixtures and their language is referred to as Bikol or Bikolano.",
            "Bicolanos have a high percentage of Spanish introgression with a government sponsored study showing 2 out of 10 Bicolanos or 2/10ths of the population being of Spanish descent.",
            "Only the Chavacanos among the Philippine ethnic groups, have a higher Spanish percentage at 4/10ths of the population, compared to Bicolano's 2/10ths, The Bicolano language is very fragmented, and its dialects are mutually incomprehensible to speakers of other Bicolano dialects.",
            "The majority of the Bicolano people are devout Roman Catholics due to the Spanish conquering the country and converting them to their religion.",
            "Catholic Mass is celebrated daily in many churches in the Bicol Region."
        ],
        [
            "Language"
        ],
        [
            "Further information: Bikol languagesThis section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2018) (Learn how and when to remove this message)"
        ],
        [
            "An election campaign sticker written in Rinconada Bikol."
        ],
        [
            "The people of the Bicol Region, called Bicolanos, speak any of the several languages of the Bikol language subgroup, called Bikol macrolanguages, Austronesian languages closely grouped under the Central Philippine languages family such as the Visayan languages and Tagalog.",
            "The four major groups of language in Bikol are Coastal Bikol (with four sub-languages), Inland Bikol (with six sub-languages), Pandan Bikol (lone language) and Bisakol (with three sub-languages).",
            "The majority of Bicolanos understand and speak Central Bikol language (a member of Coastal Bikol group of languages) since it is the language used in literature and mass media, but with varying degrees.",
            "A known misconception of many Bicolanos is that Central Bikol, used in the cities of Legazpi and Naga, is the standard Bikol.",
            "Central Bikol, though spoken by the majority and with speakers represented in all provinces in the region, is not a standard Bikol since other forms of Bikol used in the region are separate languages and usually unintelligible.",
            "However, the standard form of Central Bikol language is the Canaman dialect."
        ],
        [
            "Other Bikol languages are Rinconada Bikol, spoken in southern part of Camarines Sur province, Pandan Bikol spoken in northern part of Catanduanes island and the Albay Bikol group of languages that include Buhinon, Libon, West Miraya and East Miraya.",
            "Albay Bikol speakers can be found in Buhi, Camarines Sur, central and eastern parts of Albay and in Donsol, Sorsogon.",
            "The standard form of Rinconada Bikol both in pronunciation and writing is the Sinabukid (Highland) dialect of Iriga variant.",
            "On the other hand, Buhinon of Buhi, Camarines Sur and Libon of Libon, Albay are the languages that are only used in their respective municipalities.",
            "Rinconada Bikol and Albay Bikol group of languages are members of Inland Bikol, while Pandan Bikol is the only language with no sub-languages or division."
        ],
        [
            "The majority of the population in Masbate and Sorsogon speaks Masbateño, Waray Sorsoganon and Northern Sorsoganon.",
            "The three are Visayan languages but influenced by Bikol languages (especially the latter), thus tagged and collectively referred to as Bisakol (Being Visayan languages spoken in Bicol), a portmanteau of Bisaya (Visayan) and Bikol (Bicolano)."
        ],
        [
            "Aside from Masbateño, three more Visayan languages are spoken in Masbate, including Hiligaynon/Ilonggo are spoken in the southwestern tip, while Cebuano and Waray-Waray are spoken in the southern part of the island province respectively.",
            "Tagalog is the dominant and native language of Bicolanos living in the municipalities in the northern half of Camarines Norte and the town of Del Gallego in Camarines Sur."
        ],
        [
            "Bicolanos also speak and understand Filipino, the national language of the Philippines, aside from native Tagalog-speaking Bicolanos in northern half of Camarines Norte and Del Gallego.",
            "English is widely understood in businesses, schools and public places."
        ],
        [
            "Religion"
        ],
        [
            "The region retains Roman Catholicism as the overwhelming religion of the great majority.",
            "The Catholic religion has the highest number of followers than any other area in the Philippines.",
            "The Catholic church grew in the Bicol Region through the efforts of the bishops from Nueva Caceres (Naga City) from the 17th century until the Philippine Revolution in 1898.",
            "Naga City is the religious center of the Bicol Region and is the seat of one of the oldest dioceses in the Philippines, the ecclesiastical Archdiocese of Caceres.",
            "Other dioceses include are the Dioceses of Legazpi, Sorsogon, Daet, Masbate, Libmanan and Virac.",
            "Fiestas (Feast day of saints) are annual celebrations of parishes, from a simple barrio fiesta honoring a patron associated for good harvest, to a town fiesta honoring a miraculous saint, a diocesan fiesta like the feast of Our Lady of Salvation, or a regional one such as the Our Lady of Peñafrancia Fiesta, the largest Marian devotion in Asia, a week-long celebration to honor the Virgin Mary, dubbed as the \"Patroness of Bicolandia\".",
            "In Luzon, the Bicol Region holds the most men entering the seminary for Catholic priesthood, or women entering the religious life to become Catholic nuns.",
            "This can be accredited to the Holy Rosary Minor Seminary, Daughters of Mary, and Daughters of Charity Convents in Naga City."
        ],
        [
            "The largest minority religion in the region is Iglesia ni Cristo (INC) known for its magnificent worship buildings, commonly called chapels or kapilya, with towering spires that dot the Bicol landscape.",
            "Each province represents one ecclesiastical district (E.D.)",
            "with the exception of Camarines Sur which is divided into two – Camarines Southwest E.D.",
            "in Naga, and Camarines Southeast E.D.",
            "in Iriga City.",
            "In total, INC has seven ecclesiastical districts in the Bicol region.",
            "The chapel of local congregation of Legazpi, Albay is the biggest."
        ],
        [
            "Other religions are also well represented in Bicol such as Jehovah's Witnesses, Protestants denominations of Seventh-Day Adventist church, Baptist Church, Pentecostal, Islam, and indigenous religions."
        ],
        [
            "Prior to colonization, the region had a complex religious system which involved various deities.",
            "Among these deities include: Gugurang, the supreme god who dwells inside of Mount Mayon where he guards and protects the sacred fire in which Aswang, his brother was trying to steal.",
            "Whenever people disobey his orders, wishes and commit numerous sins, he would cause Mount Mayon to burst lava as a sign of warning for people to mend their crooked ways.",
            "Ancient Bikolanos had a rite performed for him called Atang;"
        ],
        [
            "Culture and traits"
        ],
        [
            "Bicol express"
        ],
        [
            "The Bicolano cuisine is primarily noted for the prominent use of chili peppers and gata (coconut milk) in its food.",
            "A classic example is the gulay na lada, known outside the region as Bicol express, a well-loved dish using siling labuyo (native small chillies) and the aforementioned gata."
        ],
        [
            "Like their other neighboring regions, Bicolanas are also expected to lend a hand in household work.",
            "They are even anticipated to offer assistance after being married.",
            "On the other hand, Bicolano men are expected to assume the role of becoming the primary source of income and financial support of his family."
        ],
        [
            "Bicolanos are also known for being very religious, the place is known for Señora De Peñafrancia.",
            "Bicolanos are often sweet, regionalistic, friendly, adventurous, puts high importance on education and social status.",
            "Contrary to what is believed, not all Bicolanos are fond of chili.",
            "Men often know how to cook."
        ],
        [
            "Infrastructure"
        ],
        [
            "Roads and Bridges"
        ],
        [
            "Matnog – Santa Magdalena – Bulusan Road – This project was a road improvement of Matnog – Santa Magdalena – Bulusan Road, linking the coastal barangays of Santa Magdalena – Bulusan – Matnog in the province of Sorsogon.",
            "This road also serves as an alternate route due to the traffic impairment along Daang Maharlika and also an access road leading to different tourist destination.",
            "The project was started on August 6, 2015, and was completed on July 20, 2018."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bicol Region"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  44.23"
        ],
        [
            "2009  44.21"
        ],
        [
            "2012  41.06"
        ],
        [
            "2015  39.85"
        ],
        [
            "2018  26.99"
        ],
        [
            "2021  21.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Pili nuts (shelled and roasted)"
        ],
        [
            "Bicol Region has a large amount of rich flatland, and agriculture is the largest component of the economy, followed by commercial fishing.",
            "Coconuts, abaca, banana, coffee and jackfruit are the top five permanent crops in the region.",
            "Rice and corn are among the chief seasonal crops.",
            "Coal mining is also one of the contributors to the region's economy.",
            "Commercial fishing is also important with thirteen major fishing grounds supplying fish markets in places as far as Metro Manila."
        ],
        [
            "Currently, Bicol Region has 13,435 farmers that cultivate 142,405 hectares of pili plantation according  the Department of Agriculture-Bicol's data.",
            "The DA further said that 90% of Philippines' pili production is from the Bicol Region and it began asexual reproduction for the product's export.",
            "The resilient tree's fruit is 7% kernel, 25% shell and 68% pulp.",
            "The Sorsogon Provincial Pili Development Board will petition for the Region's declaration as the \"Pili Capital of the Philippines\"."
        ],
        [
            "On October, 2023, the Department of Trade and Industry launched \"Orgullo kan Bikol\" Trade and Travel Fair at Shangri-La Plaza.",
            "The 103 exhibitors are MSMEs which displayed 253 new products from Bikol's 6 provinces."
        ],
        [
            "Tourism"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2018) (Learn how and when to remove this message)Whale shark spotting in Donsol, Sorsogon"
        ],
        [
            "The region's tourism industry has been revived by the popularity of Mayon Volcano, the new CamSur Water Sports Complex, whale shark spotting, among others, which consequently increased the number of upscale resorts.",
            "Naga City has its colonial churches, and pilgrimages to Our Lady of Peñafrancia."
        ],
        [
            "The municipality of Daet and Catanduanes province have long been destinations for surfers.",
            "The opening of the Bicol International Airport in Legazpi City was hoped to further boost tourism in the region."
        ],
        [
            "Geology"
        ],
        [
            "Bicol region is highly volcanic in origin and part of the Pacific Ring of Fire.",
            "Known as the Bicol Volcanic Arc or Chain, the volcanoes are the results of the Philippine Sea Plate subducting under the Philippine Mobile Belt, along the Philippine Trench.",
            "Volcanism is evident by the number of hot springs, crater lakes, and volcanoes that dot the region starting from Mount Labo in Camarines Norte to the Gate Mountains in Matnog, Sorsogon."
        ],
        [
            "Mayon Volcano is the most prominent of the volcanoes in the region, famous for its perfect conical shape and for being the most active in the Philippines.",
            "Its eruptions have repeatedly inflicted disasters on the region, but during lulls in activity, it is a particularly magnificent peak.",
            "The southernmost tip of the peninsula is dominated by Bulusan Volcano, the other active volcano in the region.",
            "Tiwi in Albay and the Bacon-Manito area between Sorsogon and Albay are the sites of two major geothermal fields that contribute substantially to the Bicol Power Grid, which is the only independent power grid in the Philippines."
        ],
        [
            "Volcanoes"
        ],
        [
            "From North to South"
        ],
        [
            "Picture"
        ],
        [
            "Name"
        ],
        [
            "Mount Isarog is a 1,966-metre (6,450 ft) fumarolic volcano with a 2.5-kilometre (1.6 mi) wide crater breached to the east."
        ],
        [
            "Mount Iriga is a 1,196-metre (3,924 ft) volcano with a large horseshoe-shaped collapsed crater located adjacent to Lake Buhi (foreground)."
        ],
        [
            "Mount Malinao is a 1,548-metre (5,079 ft) volcano with a large crater about 3 kilometres (1.9 mi) at its widest, which is breached to the east, The geothermal fields of Tiwi are located on its lower eastern slope."
        ],
        [
            "Mount Masaraga is a sharp-topped 1,328-metre (4,357 ft) Holocene volcano NW of Mayon."
        ],
        [
            "Mayon Volcano, the highest point of the region at 2,463 metres (8,081 ft), is also the most popular in the region for its beautifully symmetrical cone.",
            "It is also the most active in the country."
        ],
        [
            "Pocdol Mountains with its highest elevation at 1,102 metres (3,615 ft), is a fumarolic group of volcanoes situated between Albay and Sorsogon provinces.",
            "It is the location of the Bac-Man Geothermal Power Plant and the PNOC Eco-Park, a 25,100-hectare (62,000-acre) ecotourism park maintained and protected by the Philippine National Oil Company (PNOC)."
        ],
        [
            "Bulusan Volcano, the other active volcano of the region, has an altitude of 1,565 metres (5,135 ft).",
            "It is located on the remains of the 11-kilometre (6.8 mi) Irosin Caldera."
        ],
        [
            "Education"
        ],
        [
            "Main article: Education in the Philippines"
        ],
        [
            "Ateneo de Naga University"
        ],
        [
            "From 1945 until 2011, the basic education system was composed of six years of elementary education starting at the age of 6, and four years of high school education starting at the age of 12.",
            "Further education was provided by technical or vocational schools, or in higher education institutions such as universities.",
            "Although the 1987 Constitution stated that elementary education was compulsory, this was never enforced."
        ],
        [
            "In 2011, the country started to transition from its old 10-year basic educational system to a K–12 educational system, as mandated by the Department of Education.",
            "The new 12-year system is now compulsory, along with the adoption of new curriculum for all schools (see 2010s and the K–12 program).",
            "The transition period will end with the 2017–2018 school year, which is the graduation date for the first group of students who entered the new educational system."
        ],
        [
            "All public schools in the Philippines must start classes on the date mandated by the Department of Education (usually the first Monday for public, second Monday for private and third Monday for some colleges for the month of June) since the presidency of Joseph Estrada in 1999, and must end after each school completes the mandated 200-day school calendar organized by the Department of Education (usually around the third week of March to the second week of April).",
            "Private schools are not obliged to abide by a specific date but must open classes no later than the last week of August."
        ],
        [
            "Name"
        ],
        [
            "Acronym"
        ],
        [
            "Province (Main campus)"
        ],
        [
            "City/Municipality"
        ],
        [
            "Established"
        ],
        [
            "Ateneo de Naga University"
        ],
        [
            "AdNU"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Naga City"
        ],
        [
            "1940"
        ],
        [
            "Southeast Asian University of Technology"
        ],
        [
            "SEAUTech"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Naga City"
        ],
        [
            "1911"
        ],
        [
            "Bicol University"
        ],
        [
            "BU"
        ],
        [
            "Albay"
        ],
        [
            "Legazpi City"
        ],
        [
            "1969"
        ],
        [
            "Catanduanes State University"
        ],
        [
            "CatSU"
        ],
        [
            "Catanduanes"
        ],
        [
            "Virac"
        ],
        [
            "1961"
        ],
        [
            "Central Bicol State University of Agriculture"
        ],
        [
            "CBSUA"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Pili"
        ],
        [
            "1918"
        ],
        [
            "Divine Word College of Legazpi"
        ],
        [
            "DWCL"
        ],
        [
            "Albay"
        ],
        [
            "Legazpi City"
        ],
        [
            "1947"
        ],
        [
            "Dr. Emilio B. Espinosa Sr. Memorial State College of Agriculture and Technology"
        ],
        [
            "DEBESMSCAT"
        ],
        [
            "Masbate"
        ],
        [
            "Mandaon"
        ],
        [
            "1952"
        ],
        [
            "Naga College Foundation, Inc."
        ],
        [
            "NCF"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Naga City"
        ],
        [
            "1947"
        ],
        [
            "Mariners' Polytechnic Colleges, Inc."
        ],
        [
            "MPC"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Naga City"
        ],
        [
            "1974"
        ],
        [
            "Partido State University"
        ],
        [
            "PSU"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Goa"
        ],
        [
            "2001"
        ],
        [
            "Polytechnic State University of Bicol"
        ],
        [
            "PSUB"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Nabua"
        ],
        [
            "1983"
        ],
        [
            "Sorsogon State University"
        ],
        [
            "SorSU"
        ],
        [
            "Sorsogon"
        ],
        [
            "Sorsogon City"
        ],
        [
            "1907"
        ],
        [
            "Universidad de Santa Isabel"
        ],
        [
            "USI"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Naga City"
        ],
        [
            "1868"
        ],
        [
            "University of Camarines Norte"
        ],
        [
            "CNSC"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Daet"
        ],
        [
            "1992"
        ],
        [
            "University of Nueva Caceres"
        ],
        [
            "UNC"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Naga City"
        ],
        [
            "1948"
        ],
        [
            "University of Santo Tomas–Legazpi"
        ],
        [
            "UST–Legazpi"
        ],
        [
            "Albay"
        ],
        [
            "Legazpi City"
        ],
        [
            "1948"
        ],
        [
            "Bicol University Gubat Campus"
        ],
        [
            "BUGC"
        ],
        [
            "Sorsogon"
        ],
        [
            "Gubat"
        ],
        [
            "2000"
        ],
        [
            "Notable people"
        ],
        [
            "Public service and governance"
        ],
        [
            "Name"
        ],
        [
            "Information"
        ],
        [
            "Leni Robredo"
        ],
        [
            "Vice President of the Republic of the Philippines (2016–2022), politician and lawyer.",
            "Served during the 16th Congress as Member of the Philippine House of Representatives from Camarines Sur's Third District.",
            "The widow of then Interior Secretary Jesse Robredo.",
            "Born in Naga City."
        ],
        [
            "Tecla San Andres Ziga"
        ],
        [
            "Former senator, first female bar top-notcher.",
            "Born in  Nueva Caceres, Ambos Camarines."
        ],
        [
            "Raul Roco"
        ],
        [
            "Born in Naga City, a Filipino statesman, prominent lawyer, congressman, senator, secretary of education) during the presidency of Gloria Macapagal Arroyo."
        ],
        [
            "Francis \"Chiz\" Escudero"
        ],
        [
            "Incumbent senator, 2016 vice-presidential aspirant, former Sorsogon representative, and former Sorsogon governor."
        ],
        [
            "Antonio Trillanes IV"
        ],
        [
            "Former senator, vice-presidential aspirant (2016), and former military officer.",
            "Leader of the Magdalo group."
        ],
        [
            "Gregorio Honasan"
        ],
        [
            "Former senator, vice-presidential aspirant (2016), and former military officer."
        ],
        [
            "Leila de Lima"
        ],
        [
            "Former senator, lawyer, human rights activist and politician.",
            "She was appointed by President Gloria Macapagal Arroyo as chairperson of the Philippine Commission on Human Rights in May 2008 and she served in the commission until June 30, 2010, when she was appointed by President Benigno S. Aquino III as the Philippines' secretary of the Department of Justice."
        ],
        [
            "Ceferino \"Joker\" Arroyo Jr."
        ],
        [
            "Former senator turned congressman, statesman and key figure in the 1986 EDSA People Power Revolution which ousted strongman President Ferdinand Marcos.",
            "He was congressman for Makati from 1992 to 2001 and a senator from 2001 to 2013.",
            "Philippine Bar Association's Most Distinguished Award for Justice as a \"man beholden to no one except to his country\" and a Senate Resolution No.",
            "100 enacted in the 8th Congress commending him for his invaluable services to the Filipino people."
        ],
        [
            "Francisco Tatad"
        ],
        [
            "A native from Catanduanes, former senator of the Philippines (1992–2001)"
        ],
        [
            "Jesse Robredo"
        ],
        [
            "Secretary of the Interior and Local Government and former Naga City mayor"
        ],
        [
            "Irene Cortes"
        ],
        [
            "She was a former associate justice of the Supreme Court of the Philippines / First female dean of the UP College of Law"
        ],
        [
            "Shalani Soledad-Romulo"
        ],
        [
            "Valenzuela representative and TV host"
        ],
        [
            "Joseph Santiago"
        ],
        [
            "Congressman for two terms 2004 and 2007.",
            "He is a former executive of Pilipino Telephone Corporation.",
            "Serves as commissioner of the National Telecommunications Commission, and from 1997 to 1998, he served as team manager of the Mobiline Cellulars professional basketball team in the Philippine Basketball Association."
        ],
        [
            "Leandro Verceles Sr."
        ],
        [
            "Philippine ambassador, governor, Philippine immigration commissioner, initiator of the Catanduanes Circumferential Road, initiator of the ARDCI, a micro-lending strategy that eventually led to the nationally acclaimed Vision Bank."
        ],
        [
            "Leandro Verceles Jr."
        ],
        [
            "Congressman (1992–2001), governor (2001–2006), principal author of the Philippine E-Commerce Act that paved the way for the burgeoning $20b BPO industry in the Philippines."
        ],
        [
            "Arnulfo Fuentebella"
        ],
        [
            "House of Representatives of the Philippines 11th Congress speaker of the House (2000 -2001)"
        ],
        [
            "Gina Vera-Perez de Venecia"
        ],
        [
            "She is daughter of the famed star-builder of Sampaguita Pictures, then Doc Jose Perez and Azucena Vera-Perez.",
            "She is married to Jose de Venecia, Jr., Speaker of the House of Representatives of the Philippines from 1992 to 1998 and 2001 to 2008."
        ],
        [
            "José María Panganiban"
        ],
        [
            "A Filipino propagandist, linguist, and essayist.",
            "He was one of the main writers and contributors for La Solidaridad, writing under the pen names \"Jomapa\" and \"J.M.P.\"",
            "The municipality of Jose Panganiban in Camarines Norte—formerly known as Mambulao—is named after him."
        ],
        [
            "Crispin Beltran"
        ],
        [
            "A Filipino labor leader.",
            "Former member of 13th Congress of the Philippines with the Anakpawis (\"Toiling Masses\") party-list and former chair of Kilusang Mayo Uno (KMU), a militant and progressive labor movement."
        ],
        [
            "Romulo Espaldon"
        ],
        [
            "A former military officer, politician, civil servant and diplomat who was the first naval officer to attain the rank of Rear Admiral in the Philippine Navy.",
            "As a civilian, he became ambassador to Saudi Arabia, Yemen, Egypt, Somalia and Sudan in different time periods.",
            "He held two political p"
        ],
        [
            "positions, such as being Tawi-Tawi's first governor (1973-1974) and a lone district representative of Tawi-Tawi (1990-1992).",
            "Born in Donsol, Sorsogon to Christian Bicolano teachers but raised in Tawi-Tawi where his parents were sent to teach and he became exposed into Tausug and Sama cultures and converted to Islam at a yong age, which soon earned him a position as a first Commissioner (later Minister) of Muslim Affairs."
        ],
        [
            "Arts and literature"
        ],
        [
            "Name"
        ],
        [
            "Information"
        ],
        [
            "Merlinda Carullo Bobis"
        ],
        [
            "Born in Legazpi City, she is a contemporary Filipino writer and academic in Australia"
        ],
        [
            "Sports"
        ],
        [
            "Name"
        ],
        [
            "Information"
        ],
        [
            "Bernabe Concepcion"
        ],
        [
            "A native of Catanduanes and Filipino featherweight boxer"
        ],
        [
            "Don Trollano"
        ],
        [
            "A native from Gigmoto.",
            "He is a Filipino professional basketball player for the NLEX Road Warriors of the Philippine Basketball Association (PBA)."
        ],
        [
            "Reil Cervantes"
        ],
        [
            "From Virac.",
            "Is a Filipino professional basketball player for Blackwater Elite in the Philippine Basketball Association (PBA).",
            "He was drafted 9th by Barangay Ginebra Kings in the 2011 PBA draft."
        ],
        [
            "Entertainment industry"
        ],
        [
            "Name"
        ],
        [
            "Information"
        ],
        [
            "John Arcilla"
        ],
        [
            "Is a multi-awarded Filipino movie actor"
        ],
        [
            "Nora Aunor"
        ],
        [
            "Multi-awarded Filipino actress, singer and producer.",
            "She is regarded as the \"Superstar in Philippine Entertainment Industry\"."
        ],
        [
            "Janelle Quintana Manahan"
        ],
        [
            "Teen actress/Best New Female Artist (19th Aliw Awards) nominee"
        ],
        [
            "Enchong Dee"
        ],
        [
            "Born Ernest Lorenzo Dee, is an actor in Naga City, director and model, and an international competitive swimmer.",
            "He came to prominence after starring in Katorse (2009)."
        ],
        [
            "AJ Dee"
        ],
        [
            "Born Angel James Dee III in Naga City, is an actor and an international competitive swimmer.",
            "He played the role of Tony Javier in the play A Portrait of an Artist."
        ],
        [
            "Robin Padilla"
        ],
        [
            "Film/TV Actor and model popularly known as the \"Bad Boy of Philippine Movies\".",
            "Also an incumbent senator after topping the 2022 senatorial polls."
        ],
        [
            "Eddie Garcia"
        ],
        [
            "Born in Juban.",
            "Popularly known as \"Manoy\", he was a Filipino film actor and film director.",
            "A former member of the Philippine Scouts in Okinawa during World War II.",
            "Also a member of the Philippine Military Academy Marangal Class of 1974, alongside First Gentleman Mike Arroyo."
        ],
        [
            "Eddie Ilarde"
        ],
        [
            "Radio and television host.",
            "Born in Iriga.",
            "Also served political positions such as becoming councilor of Pasay, congressman, and assemblyman."
        ],
        [
            "Wally Bayola"
        ],
        [
            "Is a Filipino comedian, singer and actor born and raised in Naga City.",
            "He is best known appearing alongside his co-tandem Jose Manalo on the noon-time television variety show E.A.T."
        ],
        [
            "Gary V."
        ],
        [
            "Is a Filipino musician.",
            "Also known as \"Mr.",
            "Pure Energy\", Valenciano has released 26 albums, and won the Awit Awards for \"Best Male Performer\" eleven times.",
            "In 1998, he became UNICEF Philippines first National Ambassador."
        ],
        [
            "Imelda Papin"
        ],
        [
            "Is a Filipino singer and one of the bigger names in the Philippine music industry.",
            "Dubbed the \"Sentimental Songstress\", Imelda Papin is responsible for songs such as \"Bakit (Kung liligaya ka sa piling ng iba)\" and \"Isang Linggong Pag-ibig\".",
            "Born in Presentacion, she also served as vice governor of Camarines Sur from 2019 to 2022."
        ],
        [
            "Kyla"
        ],
        [
            "Melanie Calumpad Alvarez in real name.",
            "Kyla is a Filipino R&B singer-songwriter, producer, occasional actress and presenter dubbed as the Philippines' \"Queen of R&B\"."
        ],
        [
            "Paolo Gumabao"
        ],
        [
            "Born Paul Chen, is a Filipino actor and model.",
            "He is from Virac."
        ],
        [
            "Carmen Camacho"
        ],
        [
            "1960s Philippine Kundiman Diva"
        ],
        [
            "Noel Cabangon"
        ],
        [
            "Is a Filipino folk singer and composer, formerly of the band Buklod.",
            "He is known for composing socially-relevant songs such as Kanlungan and Tatsulok."
        ],
        [
            "Jericho Rosales"
        ],
        [
            "Is a Filipino cinema and television actor, model, singer, and songwriter."
        ],
        [
            "Julian Alturas"
        ],
        [
            "A former Filipino child actor and former Star Magic Artist."
        ],
        [
            "Aga Muhlach"
        ],
        [
            "Actor, model, host and former matinée idol of Philippine movies."
        ],
        [
            "Beatriz Saw"
        ],
        [
            "Actress, TV host and Pinoy Big Brother Season 2 big winner"
        ],
        [
            "Bugoy Drilon"
        ],
        [
            "Singer, actor and Pinoy Dream Academy Season 2 2nd Star Dreamer"
        ],
        [
            "Barbie Imperial"
        ],
        [
            "Actress and model"
        ],
        [
            "Lino Brocka"
        ],
        [
            "Multi-awarded film director.",
            "Co-founded the organization Concerned Artists of the Philippines (CAP) and the Free the Artist Movement.",
            "Born in Pilar, Sorsogon."
        ],
        [
            "Allen Ansay"
        ],
        [
            "Born in Sagñay, Camarines Sur, actor and was the first runner-up of StarStruck (season 7)"
        ],
        [
            "Modeling and fashion"
        ],
        [
            "Name"
        ],
        [
            "Information"
        ],
        [
            "Lara Quigaman"
        ],
        [
            "Born in Naga City.",
            "Film/TV actress, model, host and Miss International 2005 winner."
        ],
        [
            "Venus Raj"
        ],
        [
            "Beauty queen, TV personality, model, and actress.",
            "She was crowned Binibining Pilipinas-Universe 2010.",
            "Fourth runner-up in 2010 Miss Universe pageant."
        ],
        [
            "Miriam Quiambao"
        ],
        [
            "Is a Filipina television personality, occasional actress and 1st runner up at the Miss Universe 1999 pageant."
        ],
        [
            "Bea Rose Santiago"
        ],
        [
            "Fords model and Miss International 2013 winner.",
            "She was born in Cataingan, Masbate."
        ],
        [
            "Yvethe Marie Santiago"
        ],
        [
            "Graduated in Bicol University College of Business Economics and Management Binibining Pilipinas Supranational 2014 winner."
        ],
        [
            "Christi McGarry"
        ],
        [
            "A Filipino-American model and beauty pageant titleholder crowned Miss Intercontinental 2015 First runner-up."
        ],
        [
            "Rachel Peters"
        ],
        [
            "A Filipino-British model and beauty pageant titleholder who was crowned Miss Universe Philippines 2017"
        ],
        [
            "Catriona Gray"
        ],
        [
            "A Filipino-Australian model and beauty pageant titleholder who was crowned Miss World Philippines 2016 and Miss Universe Philippines 2018"
        ],
        [
            "Religion"
        ],
        [
            "Name"
        ],
        [
            "Information"
        ],
        [
            "Jose Tomas Sanchez"
        ],
        [
            "Born in Naga City.",
            "Roman Catholic Prefect Emeritus of the Congregation for the Clergy and Cardinal Priest from the Philippines"
        ],
        [
            "Mike Velarde"
        ],
        [
            "Tele-evangelist, founder and Servant-Leader of El Shaddai DWXI-PPFI"
        ],
        [
            "Jorge Barlin"
        ],
        [
            "Born in Baao.",
            "First native-born Filipino bishop."
        ],
        [
            "Notes"
        ],
        [
            "^ Central Bikol: Rehiyon kan Bikol; Rinconada Bikol: Rehiyon ka Bikol; Waray Sorsogon, Masbateño: Rehiyon san Bikol; Tagalog: Rehiyon ng Bikol"
        ],
        [
            "References"
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b \"2021 to 2023 Gross Regional Domestic Product (GRDP)\".",
            "openstat.psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ a b c \"Overview of Bicol Region\".",
            "Department of Agriculture, Regional Field Unit No.",
            "5 (Bicol Region).",
            "Archived from the original on April 16, 2010.",
            "Retrieved March 18, 2010."
        ],
        [
            "^ \"DILG Regional Office No.",
            "5 Directory\".",
            "Department of the Interior and Local Government, Regional Office No.",
            "5.",
            "Archived from the original on April 17, 2012.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ Refraccion, Mara Angelica (June 28, 2011).",
            "\"Bicol (Pre Colonial History)\".",
            "maraangelica.blogspot.com.",
            "Retrieved March 11, 2016."
        ],
        [
            "^ Bolunia, Mary Jane Louise A.",
            "(n.d.).",
            "\"Astilleros: The Spanish Shipyards of Sorsogon\" (PDF).",
            "Retrieved October 26, 2015 – via themua.org."
        ],
        [
            "^ Kraft, Kraig H.; Brown, Cecil H.; Nabhan, Gary P.; et al.",
            "(2014).",
            "\"Multiple Lines of Evidence for the Origin of Domesticated Chili Pepper, Capsicum annuum, in Mexico\".",
            "Proceedings of the National Academy of Sciences.",
            "111 (17): 6165–6170.",
            "Bibcode:2014PNAS..111.6165K.",
            "doi:10.1073/pnas.1308933111.",
            "PMC 4035960.",
            "PMID 24753581."
        ],
        [
            "^ a b \"Bicol Native Cuisine\".",
            "Camarines Sur Provincial Government.",
            "Archived from the original on June 28, 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSGC Interactive; List of Provinces\".",
            "Philippine Statistics Authority.",
            "Archived from the original on January 11, 2013.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"PSGC Interactive; List of Cities\".",
            "Philippine Statistics Authority.",
            "Archived from the original on April 7, 2016.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ National Statistics Office (n.d.).",
            "2010 Census and Housing Population: Population and Annual Growth Rates for the Philippines and Its Regions, Provinces, and Highly Urbanized Cities Based on 1990, 2000, and 2010 Censuses (PDF) (Tables).",
            "Archived from the original (PDF) on September 28, 2013.",
            "Retrieved August 9, 2013."
        ],
        [
            "^ Supplementary information for Larena, Maximilian; Sanchez-Quinto, Federico; Sjödin, Per; et al.",
            "(2021).",
            "\"Multiple Migrations to the Philippines During the Last 50,000 Years\".",
            "Proceedings of the National Academy of Sciences.",
            "118 (13).",
            "e2026132118.",
            "doi:10.1073/pnas.2026132118.",
            "PMC 8020671.",
            "PMID 33753512."
        ],
        [
            "^ Algee-Hewitt, Bridget F. B.; Hughes, Cris E.; Go, Matthew C.; Dudzik, Beatrix (2018).",
            "\"An Admixture Approach to Trihybrid Ancestry Variation in the Philippines with Implications for Forensic Anthropology\".",
            "Human Biology.",
            "90 (3): 178–195.",
            "doi:10.13110/humanbiology.90.3.01.",
            "PMID 33947174.",
            "S2CID 92490926.",
            "Filipinos appear considerably admixed with respect to the other Asian population samples, carrying on average less Asian ancestry (71%) than our Korean (99%), Japanese (96%), Thai (93%), and Vietnamese (84%) reference samples.",
            "We also revealed substructure in our Filipino sample, showing that the patterns of ancestry vary within the Philippines—that is, between the four differently sourced Filipino samples.",
            "Mean estimates of Asian (76%) and European (7%) ancestry are greatest for the cemetery sample of forensic signifĳicance from Manila."
        ],
        [
            "^ a b Eugenio, Damiana L. (n.d.).",
            "\"Asuang Steals Fire from Gugurang\".",
            "ourownvoice.com.",
            "Archived from the original on May 26, 2009.",
            "Retrieved April 3, 2010."
        ],
        [
            "^ a b Clark, Jordan (2011).",
            "The Aswang Phenomenon (Animation) – via Youtube."
        ],
        [
            "^ Soltes, Jonas Cabiles (September 7, 2009).",
            "\"Bicol Artist Protest Natl.",
            "Artist Awardees\".",
            "Inquirer.net.",
            "Archived from the original on September 11, 2009.",
            "Retrieved April 3, 2010."
        ],
        [
            "^ Abella, Jerrie M. (January 15, 2010).",
            "\"Eclipse; Bakunawa Eats the Sun Behind a Curtain of Clouds\".",
            "GMANews.TV.",
            "Archived from the original on March 23, 2010.",
            "Retrieved April 3, 2010."
        ],
        [
            "^ \"Roads and Bridges\".",
            "Build Build Build.",
            "Archived from the original on April 8, 2019.",
            "Retrieved August 2, 2019."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Bicol Regional Profile\".",
            "Department of Environment and Natural Resources: Region 5 – Bicol.",
            "Archived from the original on August 27, 2014.",
            "Retrieved August 26, 2014."
        ],
        [
            "^ Calipay, Connie (February 27, 2024).",
            "\"DA readies interventions for farmers eyeing pili milk production\".",
            "Philippine News Agency.",
            "Retrieved May 16, 2024."
        ],
        [
            "^ Guarin, Lovella (March 15, 2023).",
            "\"Exploring the potential of Bicol's pili nut as an export product\".",
            "Department of Agriculture (Philippines).",
            "Retrieved May 17, 2024."
        ],
        [
            "^ Calipay, Connie (October 18, 2023).",
            "\"103 Bicol MSMEs to showcase top products at Manila fair\".",
            "Philippine News Agency.",
            "Retrieved May 24, 2024."
        ],
        [
            "^ Gatdula, Donnabelle L. (June 3, 2013).",
            "\"Naga City Allots P1B for Infra\".",
            "Philstar Global.",
            "Archived from the original on January 27, 2016.",
            "Retrieved March 11, 2016."
        ],
        [
            "^ Lagdameo, F. J.",
            "(September 23, 2010).",
            "\"PNoy's EO Declares Naga 'Pilgrim City'\".",
            "Vox Bikol.",
            "Archived from the original on April 29, 2014.",
            "Retrieved March 11, 2016."
        ],
        [
            "^ Proclamation No.",
            "33, s. 2010 – via Official Gazette."
        ],
        [
            "^ \"Catanduanes Surfing Like No Other\".",
            "Philippines Travel Guide.",
            "January 28, 2016.",
            "Retrieved March 11, 2016."
        ],
        [
            "^ McDermott, Frank; Delfin, Francisco G. Jr.; Defant, Marc J.; Turner, Simon; Maury, Rene (2005).",
            "\"The Petrogenesis of Volcanics from Mt.",
            "Bulusan and Mt.",
            "Mayon in the Bicol Arc, the Philippines\" (PDF).",
            "Contributions to Mineralogy and Petrology.",
            "150 (6): 652–670.",
            "Bibcode:2005CoMP..150..652M.",
            "doi:10.1007/s00410-005-0042-7.",
            "S2CID 17067654.",
            "Archived (PDF) from the original on March 2, 2014.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ \"Our Projects\".",
            "Energy Development Corporation.",
            "Archived from the original on September 13, 2011.",
            "Retrieved August 1, 2011."
        ],
        [
            "^ \"The Tiwi Geothermal Power Plant\".",
            "Jcmiras.Net Gallery.",
            "January 20, 2009.",
            "Archived from the original on August 6, 2011.",
            "Retrieved August 1, 2011."
        ],
        [
            "^ \"Isarog\".",
            "Global Volcanism Program.",
            "Smithsonian Institution.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ a b c \"Region 5 – Protected Areas\".",
            "Bureau of Protected Areas and Wildlife Bureau.",
            "March 11, 2010.",
            "Archived from the original on March 21, 2012.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ \"Iriga\".",
            "Global Volcanism Program.",
            "Smithsonian Institution.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ \"Malinao\".",
            "Global Volcanism Program.",
            "Smithsonian Institution.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ \"Masaraga\".",
            "Global Volcanism Program.",
            "Smithsonian Institution.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ \"Mayon\".",
            "Global Volcanism Program.",
            "Smithsonian Institution.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ \"Pocdol Mountains\".",
            "Global Volcanism Program.",
            "Smithsonian Institution.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ Jamoralin, Reynaldo T. (n.d.).",
            "\"Places of Interest\".",
            "sorsogontourism.com.",
            "Archived from the original on March 14, 2012.",
            "Retrieved May 22, 2012."
        ],
        [
            "^ \"Bulusan\".",
            "Global Volcanism Program.",
            "Smithsonian Institution.",
            "Retrieved May 22, 2012."
        ],
        [
            "^  (PDF).",
            "Department of Education.",
            "Archived from the original (PDF) on May 22, 2012.",
            "Retrieved April 28, 2012."
        ],
        [
            "^ \"Gerona-Robredo, Leni\".",
            "congress.gov.ph.",
            "Archived from the original on March 4, 2016.",
            "Retrieved March 11, 2016."
        ],
        [
            "^ \"Reil Cervantes\".",
            "Pba-online.",
            "Archived from the original on November 15, 2016.",
            "Retrieved December 4, 2017."
        ],
        [
            "^ Bracher, Jane (July 18, 2014).",
            "\"Ildefonso, Cervantes Lead Pba Expansion Draft Picks\".",
            "Rappler.",
            "Retrieved February 2, 2022."
        ],
        [
            "^ \"John Arcilla\".",
            "IMDb.",
            "Retrieved March 11, 2016."
        ],
        [
            "^ Salamat, Marya (March 2, 2012).",
            "\"John Arcilla, Actor, Environmentalist Attends Peoples' Mining Conference\".",
            "Bulatlat.",
            "Retrieved March 11, 2016."
        ],
        [
            "External links"
        ],
        [
            " Media related to Bicol Region at Wikimedia Commons"
        ],
        [
            " The dictionary definition of Bicol at Wiktionary"
        ],
        [
            " Bicol Region travel guide from Wikivoyage"
        ],
        [
            " Geographic data related to Bicol Region at OpenStreetMap"
        ],
        [
            "Places adjacent to Bicol Region"
        ],
        [
            "Calabarzon"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Mimaropa / Sibuyan Sea"
        ],
        [
            "Bicol Region"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Jintotolo ChannelWestern Visayas"
        ],
        [
            "Visayan SeaCentral Visayas"
        ],
        [
            "San Bernardino StraitEastern Visayas"
        ],
        [
            "vteBicol Region (Region V)Provinces"
        ],
        [
            "Albay"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Catanduanes"
        ],
        [
            "Masbate"
        ],
        [
            "Sorsogon"
        ],
        [
            "Regional center"
        ],
        [
            "Legazpi"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Daet"
        ],
        [
            "Legazpi"
        ],
        [
            "Masbate City"
        ],
        [
            "Pili"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Virac"
        ],
        [
            "Metropolitan areas"
        ],
        [
            "Metro Naga"
        ],
        [
            "Independent component cities"
        ],
        [
            "Naga"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Iriga"
        ],
        [
            "Ligao"
        ],
        [
            "Masbate City"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Tabaco"
        ],
        [
            "Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baao"
        ],
        [
            "Bacacay"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Balatan"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Baras"
        ],
        [
            "Barcelona"
        ],
        [
            "Basud"
        ],
        [
            "Bato (Camarines Sur)"
        ],
        [
            "Bato (Catanduanes)"
        ],
        [
            "Batuan"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camalig"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Capalonga"
        ],
        [
            "Caramoan"
        ],
        [
            "Caramoran"
        ],
        [
            "Casiguran"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Daet"
        ],
        [
            "Daraga"
        ],
        [
            "Del Gallego"
        ],
        [
            "Dimasalang"
        ],
        [
            "Donsol"
        ],
        [
            "Esperanza"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Gigmoto"
        ],
        [
            "Goa"
        ],
        [
            "Gubat"
        ],
        [
            "Guinobatan"
        ],
        [
            "Irosin"
        ],
        [
            "Jose Panganiban"
        ],
        [
            "Jovellar"
        ],
        [
            "Juban"
        ],
        [
            "Labo"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Libon"
        ],
        [
            "Lupi"
        ],
        [
            "Magallanes"
        ],
        [
            "Magarao"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Mandaon"
        ],
        [
            "Manito"
        ],
        [
            "Matnog"
        ],
        [
            "Mercedes"
        ],
        [
            "Milaor"
        ],
        [
            "Milagros"
        ],
        [
            "Minalabac"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Nabua"
        ],
        [
            "Oas"
        ],
        [
            "Ocampo"
        ],
        [
            "Palanas"
        ],
        [
            "Pamplona"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "Paracale"
        ],
        [
            "Pasacao"
        ],
        [
            "Pilar"
        ],
        [
            "Pili"
        ],
        [
            "Pio Duran"
        ],
        [
            "Pio V. Corpuz"
        ],
        [
            "Placer"
        ],
        [
            "Polangui"
        ],
        [
            "Presentacion"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Ragay"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Sagñay"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando (Camarines Sur)"
        ],
        [
            "San Fernando (Masbate)"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Jose"
        ],
        [
            "San Lorenzo Ruiz"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pascual"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Talisay"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Tiwi"
        ],
        [
            "Uson"
        ],
        [
            "Viga"
        ],
        [
            "Vinzons"
        ],
        [
            "Virac"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vteRegions of the PhilippinesLuzon"
        ],
        [
            "NCR – National Capital Region"
        ],
        [
            "CAR – Cordillera Administrative Region"
        ],
        [
            "I – Ilocos Region"
        ],
        [
            "II – Cagayan Valley"
        ],
        [
            "III – Central Luzon"
        ],
        [
            "IV-A – Calabarzon"
        ],
        [
            "Mimaropa – Southwestern Tagalog Region"
        ],
        [
            "V – Bicol Region"
        ],
        [
            "Visayas"
        ],
        [
            "VI – Western Visayas"
        ],
        [
            "NIR – Negros Island Region"
        ],
        [
            "VII – Central Visayas"
        ],
        [
            "VIII – Eastern Visayas"
        ],
        [
            "Mindanao"
        ],
        [
            "IX – Zamboanga Peninsula"
        ],
        [
            "X – Northern Mindanao"
        ],
        [
            "XI – Davao Region"
        ],
        [
            "XII – Soccsksargen"
        ],
        [
            "XIII – Caraga Region"
        ],
        [
            "BARMM – Bangsamoro Autonomous Region in Muslim Mindanao"
        ],
        [
            "Former regions"
        ],
        [
            "ARMM – Autonomous Region in Muslim Mindanao"
        ],
        [
            "IV – Southern Tagalog"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bicol_Region&oldid=1231680246\""
        ],
        [
            "Categories: Bicol RegionRegions of the PhilippinesLuzonPeninsulas of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasArticles containing Central Bikol-language textArticles containing Tagalog-language textArticles with short descriptionShort description is different from WikidataUse mdy dates from November 2022Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishPages using multiple image with auto scaled imagesCoordinates on WikidataAll articles lacking reliable referencesArticles lacking reliable references from February 2022Articles needing additional references from July 2018All articles needing additional referencesAll articles with unsourced statementsArticles with unsourced statements from August 2014Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}