{
    "name": "Cagayan Valley",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cagayan Valley"
        ],
        [
            "46 languages"
        ],
        [
            "العربية閩南語 / Bân-lâm-gúBikol CentralBrezhonegCatalàCebuanoChavacano de ZamboangaDeutschEspañolEsperantoEuskaraفارسیFrançais한국어हिन्दीHrvatskiIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuLietuviųМакедонскиBahasa Melayuမြန်မာဘာသာNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยУкраїнськаاردوTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Administrative region of the Philippines"
        ],
        [
            "This article is about a region in the Philippines.",
            "For other uses, see Cagayan (disambiguation)."
        ],
        [
            "Region in Luzon, PhilippinesCagayan Valley"
        ],
        [
            "Tanap ti CagayanRegion"
        ],
        [
            "Clockwise from the top: Palaui Island Protected Landscape and Seascape, Cagua Volcano, Cape Engaño Lighthouse, Sabtang, Tumauini ChurchLocation in the PhilippinesOpenStreetMapCountry PhilippinesIsland groupLuzonRegional centerand largest cityTuguegaraoArea • Total28,228.83 km2 (10,899.21 sq mi)Highest elevation (Mount Pulag)2,928 m (9,606 ft)Population (2020 census) • Density130/km2 (340/sq mi)Time zoneUTC+8 (PST)ISO 3166 codePH-02Provinces"
        ],
        [
            "5"
        ],
        [
            " Batanes"
        ],
        [
            " Cagayan"
        ],
        [
            " Isabela"
        ],
        [
            " Nueva Vizcaya"
        ],
        [
            " Quirino"
        ],
        [
            "Independent cities"
        ],
        [
            "1"
        ],
        [
            " Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "3"
        ],
        [
            " Cauayan"
        ],
        [
            " Ilagan"
        ],
        [
            " Tuguegarao"
        ],
        [
            "Municipalities89Barangays2,311Cong.",
            "districts12HDI 0.709 (High)HDI rank7th in the Philippines (2019)"
        ],
        [
            "Cagayan Valley (Ilocano: Tanap ti Cagayan; Filipino: Lambak ng Cagayan), designated as Region II, is an administrative region in the Philippines.",
            "Located in the northeastern section of Luzon,"
        ],
        [
            "Most of its land area lies in the valley between the Cordilleras and the Sierra Madre mountain ranges.",
            "The eponymous Cagayan River, the country's largest and longest, runs through the region, flows from the Caraballo Mountains, and ends in Aparri.",
            "Cagayan Valley is the second-largest Philippine administrative region by land area."
        ],
        [
            "History"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(March 2016)"
        ],
        [
            "Prehistory and early history"
        ],
        [
            "Archaeology indicates that Cagayan has been inhabited for half a million years, though no human remains of any such antiquity have yet appeared.",
            "The earliest inhabitants are the Agta, or Atta, food-gatherers who roam the forests without fixed abodes.",
            "A large tract of land has lately been returned to them.",
            "The bulk of the population are of Austronesian origin.",
            "For centuries before the coming of the Spanish, the inhabitants traded with Indians, Malays, Chinese, and Japanese.",
            "In the nineteenth and 20th centuries, the prosperity found in tobacco cultivation caused many Ilokano people to settle here, it was only in this large-scale Ilocano settlement that made Ilocano language replace Ibanag as the lingua franca of the region.",
            "Tobacco is still a major factor in the economy of Cagayan, though a special economic zone and free port has been created to strengthen and diversify the provincial economy."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "During the Spanish era, Cagayan Valley had a larger territory than today, then named Provincia de Cagayan.",
            "Then it included the territories of the above-mentioned provinces and the eastern parts of the Cordillera provinces of Apayao, Kalinga, Ifugao and Benguet, and the north part of Aurora.",
            "Historian and missionary Jose Burgues said, \"The old Cagayan Valley comprises the province of Cagayan, Isabela and Nueva Vizcaya as well as the military Districts of Apayao, Itaves, Quiangan, Cayapa and Bintangan, plus the area of the Sierra Madre to the Pacific Ocean in the said trajectory.\""
        ],
        [
            "During World War II"
        ],
        [
            "During World War II, at Balete Pass in Nueva Vizcaya, the retreating Japanese Imperial Army under General Tomoyuki Yamashita dug in and held on for three months against the American and Filipino forces who eventually drove them out; the pass is now called Dalton Pass in honor of General Dalton, USA, who was killed in the fighting."
        ],
        [
            "During the Marcos dictatorship"
        ],
        [
            "Main articles: Martial law under Ferdinand Marcos and Human rights abuses of the Marcos dictatorship"
        ],
        [
            "Loan-funded government spending to promote Ferdinand Marcos' 1969 reelection campaign caused"
        ],
        [
            "With only a year left in his last constitutionally allowed term as president, Ferdinand Marcos placed the Philippines under Martial Law in September 1972 and thus retained the position for fourteen more years."
        ],
        [
            "In Isabela, protests erupted when Marcos crony Danding Cojuangco managed to block a Spanish-era grant which was supposed to see the return of Hacienda San Antonio and Hacienda Santa Isabel in Ilagan to local farmers, displacing tens of thousands of farmers who were supposed to get those lands back a hundred years after the Spanish accosted them."
        ],
        [
            "Also during that time, logging concessions were awarded to Juan Ponce Enrile, Herminio Disini, and other cronies, leading to the severe degradation of forest cover in the region, which contributed to widespread flooding and other environmental issues that persist today.<"
        ],
        [
            "Later 20th Century"
        ],
        [
            "Main articles: People Power Revolution and Cordillera autonomy movement"
        ],
        [
            "After the People Power Revolution in 1986, many of the activists who had joined the underground movement against Marcos decided to \"surface,\" as the new administration of Corazon Aquino released political prisoners and initiated peace talks."
        ],
        [
            "When the Cordillera Administrative Region was formed in 1987 under Corazon Aquino, the indigenous provinces of Ifugao and Kalinga-Apayao (later divided into the provinces of Kalinga and Apayao) were transferred into the newly formed region."
        ],
        [
            "Contemporary history"
        ],
        [
            "COVID-19 pandemic"
        ],
        [
            "Main article: COVID-19 pandemic in Cagayan Valley"
        ],
        [
            "During the worldwide COVID-19 pandemic, the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) virus reached Cagayan Valley on March 21, 2020, when the first case of the disease was confirmed in Tuguegarao."
        ],
        [
            "Extreme climate events"
        ],
        [
            "Main articles: Climate change in the Philippines and Typhoon Vamco"
        ],
        [
            "In November 2020, Typhoon Vamco (known in the Philippines as Typhoon Ulysses) crossed the island of Luzon,"
        ],
        [
            "Geography"
        ],
        [
            "Northern Luzon topography showing Cagayan Valley"
        ],
        [
            "Cagayan Valley is the large mass of land in the northeastern region of Luzon, comprising the provinces of Cagayan, Isabela, Nueva Vizcaya, Quirino, and the Batanes group of islands.",
            "It is bordered to the west by the Cordillera mountain range, to the east by the Sierra Madre, to the south by the Caraballo Mountains, and to the north by the Luzon Strait."
        ],
        [
            "The region contains two landlocked provinces, Quirino and Nueva Vizcaya, which are ruggedly mountainous and heavily forested.",
            "Nueva Vizcaya is the remnant of the southern province created when Cagayan Province was divided in two in 1839.",
            "They are ethnically and linguistically diverse, with a substrate of Agtas, Negritos who are food-gatherers with no fixed abodes, overlaid by Ilongots and others in a number of tribes, some of whom were fierce head-hunters (they have given up the practice), with the latest but largest element of the population being the Ilocanos, closely followed by the Ibanags."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Cagayan Valley comprises five provinces, one independent city, three component cities, 89 municipalities, and 2,311 barangays."
        ],
        [
            "Provinces"
        ],
        [
            "Political map of Cagayan Valley"
        ],
        [
            "Province"
        ],
        [
            "Capital"
        ],
        [
            "Largest settlement"
        ],
        [
            "Population (2020 census)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Cities"
        ],
        [
            "Muni."
        ],
        [
            "Barangay"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Batanes"
        ],
        [
            "Basco"
        ],
        [
            "0.5%"
        ],
        [
            "18,831"
        ],
        [
            "219.01"
        ],
        [
            "84.56"
        ],
        [
            "86"
        ],
        [
            "220"
        ],
        [
            "0"
        ],
        [
            "6"
        ],
        [
            "29"
        ],
        [
            "Cagayan"
        ],
        [
            "Tuguegarao"
        ],
        [
            "34.4%"
        ],
        [
            "1,268,603"
        ],
        [
            "9,295.75"
        ],
        [
            "3,589.11"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "1"
        ],
        [
            "28"
        ],
        [
            "820"
        ],
        [
            "Isabela"
        ],
        [
            "Ilagan"
        ],
        [
            "46.0%"
        ],
        [
            "1,697,050"
        ],
        [
            "12,414.93"
        ],
        [
            "4,793.43"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "3"
        ],
        [
            "34"
        ],
        [
            "1,055"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Bayombong"
        ],
        [
            "13.5%"
        ],
        [
            "497,432"
        ],
        [
            "3,975.67"
        ],
        [
            "1,535.01"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "0"
        ],
        [
            "15"
        ],
        [
            "275"
        ],
        [
            "Quirino"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Diffun"
        ],
        [
            "5.5%"
        ],
        [
            "203,828"
        ],
        [
            "3,323.47"
        ],
        [
            "1,283.20"
        ],
        [
            "61"
        ],
        [
            "160"
        ],
        [
            "0"
        ],
        [
            "6"
        ],
        [
            "132"
        ],
        [
            "Total"
        ],
        [
            "3,685,744"
        ],
        [
            "28,228.83"
        ],
        [
            "10,899.21"
        ],
        [
            "130"
        ],
        [
            "310"
        ],
        [
            "4"
        ],
        [
            "89"
        ],
        [
            "2,311"
        ],
        [
            "• Figures for Isabela include the independent component city of Santiago."
        ],
        [
            "Governors and vice governors"
        ],
        [
            "Province"
        ],
        [
            "Image"
        ],
        [
            "Governor"
        ],
        [
            "Political Party"
        ],
        [
            "Vice Governor"
        ],
        [
            "Batanes"
        ],
        [
            "Marilou Cayco"
        ],
        [
            "Liberal"
        ],
        [
            "Ignacio C. Villa"
        ],
        [
            "Cagayan"
        ],
        [
            "Manuel N. Mamba"
        ],
        [
            "Nacionalista"
        ],
        [
            "Melvin K. Vargas, Jr."
        ],
        [
            "Isabela"
        ],
        [
            "Rodolfo Albano III"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Faustino G. Dy III"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Carlos Padilla"
        ],
        [
            "Nacionalista"
        ],
        [
            "Jose Gambito"
        ],
        [
            "Quirino"
        ],
        [
            "Dakila Carlo E. Cua"
        ],
        [
            "PDDS"
        ],
        [
            "Julius Caesar S. Vaquilar"
        ],
        [
            "Cities and Municipalities"
        ],
        [
            " †  Regional center"
        ],
        [
            "City/Municipality"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Class"
        ],
        [
            "Income class"
        ],
        [
            "Province"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Abulug"
        ],
        [
            "34,579"
        ],
        [
            "162.60"
        ],
        [
            "62.78"
        ],
        [
            "210"
        ],
        [
            "540"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Aglipay"
        ],
        [
            "30,714"
        ],
        [
            "161.70"
        ],
        [
            "62.43"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Quirino"
        ],
        [
            "Alcala"
        ],
        [
            "41,295"
        ],
        [
            "187.20"
        ],
        [
            "72.28"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Alfonso Castañeda"
        ],
        [
            "8,539"
        ],
        [
            "375.40"
        ],
        [
            "144.94"
        ],
        [
            "23"
        ],
        [
            "60"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Alicia"
        ],
        [
            "73,874"
        ],
        [
            "154.10"
        ],
        [
            "59.50"
        ],
        [
            "480"
        ],
        [
            "1,200"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Allacapan"
        ],
        [
            "35,234"
        ],
        [
            "306.80"
        ],
        [
            "118.46"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Ambaguio"
        ],
        [
            "15,472"
        ],
        [
            "156.26"
        ],
        [
            "60.33"
        ],
        [
            "99"
        ],
        [
            "260"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Amulung"
        ],
        [
            "50,336"
        ],
        [
            "264.51"
        ],
        [
            "102.13"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Cagayan"
        ],
        [
            "Angadanan"
        ],
        [
            "44,977"
        ],
        [
            "204.40"
        ],
        [
            "78.92"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Isabela"
        ],
        [
            "Aparri"
        ],
        [
            "68,839"
        ],
        [
            "286.64"
        ],
        [
            "110.67"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Cagayan"
        ],
        [
            "Aritao"
        ],
        [
            "42,197"
        ],
        [
            "265.60"
        ],
        [
            "102.55"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Aurora"
        ],
        [
            "36,621"
        ],
        [
            "115.56"
        ],
        [
            "44.62"
        ],
        [
            "330"
        ],
        [
            "850"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Isabela"
        ],
        [
            "Bagabag"
        ],
        [
            "37,985"
        ],
        [
            "183.90"
        ],
        [
            "71.00"
        ],
        [
            "210"
        ],
        [
            "540"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Baggao"
        ],
        [
            "87,753"
        ],
        [
            "920.60"
        ],
        [
            "355.45"
        ],
        [
            "95"
        ],
        [
            "250"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Cagayan"
        ],
        [
            "Ballesteros"
        ],
        [
            "34,488"
        ],
        [
            "120.00"
        ],
        [
            "46.33"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Cagayan"
        ],
        [
            "Bambang"
        ],
        [
            "55,789"
        ],
        [
            "345.00"
        ],
        [
            "133.21"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Basco"
        ],
        [
            "9,517"
        ],
        [
            "49.46"
        ],
        [
            "19.10"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Batanes"
        ],
        [
            "Bayombong"
        ],
        [
            "67,714"
        ],
        [
            "136.00"
        ],
        [
            "52.51"
        ],
        [
            "500"
        ],
        [
            "1,300"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Benito Soliven"
        ],
        [
            "29,752"
        ],
        [
            "184.40"
        ],
        [
            "71.20"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Buguey"
        ],
        [
            "32,148"
        ],
        [
            "164.50"
        ],
        [
            "63.51"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Burgos"
        ],
        [
            "26,040"
        ],
        [
            "73.10"
        ],
        [
            "28.22"
        ],
        [
            "360"
        ],
        [
            "930"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Cabagan"
        ],
        [
            "53,897"
        ],
        [
            "430.40"
        ],
        [
            "166.18"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Cabarroguis"
        ],
        [
            "33,533"
        ],
        [
            "260.20"
        ],
        [
            "100.46"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Quirino"
        ],
        [
            "Cabatuan"
        ],
        [
            "39,990"
        ],
        [
            "72.00"
        ],
        [
            "27.80"
        ],
        [
            "560"
        ],
        [
            "1,500"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Isabela"
        ],
        [
            "Calayan"
        ],
        [
            "17,410"
        ],
        [
            "164.50"
        ],
        [
            "63.51"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "25,236"
        ],
        [
            "76.50"
        ],
        [
            "29.54"
        ],
        [
            "330"
        ],
        [
            "850"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Cagayan"
        ],
        [
            "Cauayan"
        ],
        [
            "143,403"
        ],
        [
            "336.40"
        ],
        [
            "129.88"
        ],
        [
            "430"
        ],
        [
            "1,100"
        ],
        [
            "Component city"
        ],
        [
            "3rd"
        ],
        [
            "Isabela"
        ],
        [
            "Claveria"
        ],
        [
            "31,900"
        ],
        [
            "194.80"
        ],
        [
            "75.21"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Cordon"
        ],
        [
            "46,477"
        ],
        [
            "144.00"
        ],
        [
            "55.60"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Isabela"
        ],
        [
            "Delfin Albano"
        ],
        [
            "29,928"
        ],
        [
            "189.00"
        ],
        [
            "72.97"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Diadi"
        ],
        [
            "19,236"
        ],
        [
            "181.20"
        ],
        [
            "69.96"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Diffun"
        ],
        [
            "56,102"
        ],
        [
            "320.10"
        ],
        [
            "123.59"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Quirino"
        ],
        [
            "Dinapigue"
        ],
        [
            "5,821"
        ],
        [
            "574.40"
        ],
        [
            "221.78"
        ],
        [
            "10"
        ],
        [
            "26"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Divilacan"
        ],
        [
            "5,827"
        ],
        [
            "889.49"
        ],
        [
            "343.43"
        ],
        [
            "6.6"
        ],
        [
            "17"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Isabela"
        ],
        [
            "Dupax del Norte"
        ],
        [
            "33,295"
        ],
        [
            "347.30"
        ],
        [
            "134.09"
        ],
        [
            "96"
        ],
        [
            "250"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Dupax del Sur"
        ],
        [
            "21,224"
        ],
        [
            "374.70"
        ],
        [
            "144.67"
        ],
        [
            "57"
        ],
        [
            "150"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Echague"
        ],
        [
            "88,410"
        ],
        [
            "680.80"
        ],
        [
            "262.86"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Enrile"
        ],
        [
            "36,705"
        ],
        [
            "184.50"
        ],
        [
            "71.24"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Gamu"
        ],
        [
            "30,655"
        ],
        [
            "129.40"
        ],
        [
            "49.96"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Gattaran"
        ],
        [
            "58,874"
        ],
        [
            "707.50"
        ],
        [
            "273.17"
        ],
        [
            "83"
        ],
        [
            "210"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Cagayan"
        ],
        [
            "Gonzaga"
        ],
        [
            "41,680"
        ],
        [
            "567.43"
        ],
        [
            "219.09"
        ],
        [
            "73"
        ],
        [
            "190"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Cagayan"
        ],
        [
            "Iguig"
        ],
        [
            "30,060"
        ],
        [
            "108.10"
        ],
        [
            "41.74"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Cagayan"
        ],
        [
            "Ilagan"
        ],
        [
            "158,218"
        ],
        [
            "1,166.26"
        ],
        [
            "450.30"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "Component city"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Itbayat"
        ],
        [
            "3,128"
        ],
        [
            "83.13"
        ],
        [
            "32.10"
        ],
        [
            "38"
        ],
        [
            "98"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Batanes"
        ],
        [
            "Ivana"
        ],
        [
            "1,407"
        ],
        [
            "16.54"
        ],
        [
            "6.39"
        ],
        [
            "85"
        ],
        [
            "220"
        ],
        [
            "Municipality"
        ],
        [
            "6th"
        ],
        [
            "Batanes"
        ],
        [
            "Jones"
        ],
        [
            "45,628"
        ],
        [
            "670.14"
        ],
        [
            "258.74"
        ],
        [
            "68"
        ],
        [
            "180"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Kasibu"
        ],
        [
            "41,776"
        ],
        [
            "318.80"
        ],
        [
            "123.09"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Kayapa"
        ],
        [
            "26,469"
        ],
        [
            "482.90"
        ],
        [
            "186.45"
        ],
        [
            "55"
        ],
        [
            "140"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Lal-lo"
        ],
        [
            "48,733"
        ],
        [
            "702.80"
        ],
        [
            "271.35"
        ],
        [
            "69"
        ],
        [
            "180"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Cagayan"
        ],
        [
            "Lasam"
        ],
        [
            "41,225"
        ],
        [
            "213.70"
        ],
        [
            "82.51"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Luna"
        ],
        [
            "20,697"
        ],
        [
            "45.70"
        ],
        [
            "17.64"
        ],
        [
            "450"
        ],
        [
            "1,200"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Isabela"
        ],
        [
            "Maconacon"
        ],
        [
            "3,977"
        ],
        [
            "538.66"
        ],
        [
            "207.98"
        ],
        [
            "7.4"
        ],
        [
            "19"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Isabela"
        ],
        [
            "Maddela"
        ],
        [
            "40,943"
        ],
        [
            "918.57"
        ],
        [
            "354.66"
        ],
        [
            "45"
        ],
        [
            "120"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Quirino"
        ],
        [
            "Mahatao"
        ],
        [
            "1,703"
        ],
        [
            "12.90"
        ],
        [
            "4.98"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "Municipality"
        ],
        [
            "6th"
        ],
        [
            "Batanes"
        ],
        [
            "Mallig"
        ],
        [
            "32,208"
        ],
        [
            "133.40"
        ],
        [
            "51.51"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Nagtipunan"
        ],
        [
            "25,399"
        ],
        [
            "1,607.40"
        ],
        [
            "620.62"
        ],
        [
            "16"
        ],
        [
            "41"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Quirino"
        ],
        [
            "Naguilian"
        ],
        [
            "33,788"
        ],
        [
            "169.81"
        ],
        [
            "65.56"
        ],
        [
            "38"
        ],
        [
            "98"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Palanan"
        ],
        [
            "17,684"
        ],
        [
            "880.24"
        ],
        [
            "339.86"
        ],
        [
            "20"
        ],
        [
            "52"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Pamplona"
        ],
        [
            "24,781"
        ],
        [
            "173.30"
        ],
        [
            "66.91"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Cagayan"
        ],
        [
            "Peñablanca"
        ],
        [
            "50,300"
        ],
        [
            "1,193.20"
        ],
        [
            "460.70"
        ],
        [
            "42"
        ],
        [
            "110"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Cagayan"
        ],
        [
            "Piat"
        ],
        [
            "24,805"
        ],
        [
            "139.60"
        ],
        [
            "53.90"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Cagayan"
        ],
        [
            "Quezon"
        ],
        [
            "27,037"
        ],
        [
            "189.90"
        ],
        [
            "73.32"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Quezon"
        ],
        [
            "24,055"
        ],
        [
            "187.50"
        ],
        [
            "72.39"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Quirino"
        ],
        [
            "25,023"
        ],
        [
            "126.20"
        ],
        [
            "48.73"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Ramon"
        ],
        [
            "56,523"
        ],
        [
            "135.17"
        ],
        [
            "52.19"
        ],
        [
            "420"
        ],
        [
            "1,100"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Isabela"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "27,900"
        ],
        [
            "57.14"
        ],
        [
            "22.06"
        ],
        [
            "490"
        ],
        [
            "1,300"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Rizal"
        ],
        [
            "19,077"
        ],
        [
            "124.40"
        ],
        [
            "48.03"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Cagayan"
        ],
        [
            "Roxas"
        ],
        [
            "65,839"
        ],
        [
            "184.80"
        ],
        [
            "71.35"
        ],
        [
            "360"
        ],
        [
            "930"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Sabtang"
        ],
        [
            "1,696"
        ],
        [
            "40.70"
        ],
        [
            "15.71"
        ],
        [
            "42"
        ],
        [
            "110"
        ],
        [
            "Municipality"
        ],
        [
            "6th"
        ],
        [
            "Batanes"
        ],
        [
            "Saguday"
        ],
        [
            "17,137"
        ],
        [
            "55.50"
        ],
        [
            "21.43"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Quirino"
        ],
        [
            "San Agustin"
        ],
        [
            "22,096"
        ],
        [
            "278.40"
        ],
        [
            "107.49"
        ],
        [
            "79"
        ],
        [
            "200"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Isabela"
        ],
        [
            "San Guillermo"
        ],
        [
            "20,915"
        ],
        [
            "325.49"
        ],
        [
            "125.67"
        ],
        [
            "64"
        ],
        [
            "170"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "San Isidro"
        ],
        [
            "27,044"
        ],
        [
            "71.90"
        ],
        [
            "27.76"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Isabela"
        ],
        [
            "San Manuel"
        ],
        [
            "34,085"
        ],
        [
            "112.77"
        ],
        [
            "43.54"
        ],
        [
            "300"
        ],
        [
            "780"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "San Mariano"
        ],
        [
            "60,124"
        ],
        [
            "1,469.50"
        ],
        [
            "567.38"
        ],
        [
            "41"
        ],
        [
            "110"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "San Mateo"
        ],
        [
            "66,663"
        ],
        [
            "120.60"
        ],
        [
            "46.56"
        ],
        [
            "550"
        ],
        [
            "1,400"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "San Pablo"
        ],
        [
            "26,320"
        ],
        [
            "637.90"
        ],
        [
            "246.29"
        ],
        [
            "41"
        ],
        [
            "110"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Isabela"
        ],
        [
            "Sanchez-Mira"
        ],
        [
            "26,164"
        ],
        [
            "198.80"
        ],
        [
            "76.76"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Santa Ana"
        ],
        [
            "35,688"
        ],
        [
            "441.30"
        ],
        [
            "170.39"
        ],
        [
            "81"
        ],
        [
            "210"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Cagayan"
        ],
        [
            "Santa Fe"
        ],
        [
            "18,276"
        ],
        [
            "399.81"
        ],
        [
            "154.37"
        ],
        [
            "46"
        ],
        [
            "120"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Santa Maria"
        ],
        [
            "25,758"
        ],
        [
            "140.00"
        ],
        [
            "54.05"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "4,434"
        ],
        [
            "109.97"
        ],
        [
            "42.46"
        ],
        [
            "40"
        ],
        [
            "100"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Cagayan"
        ],
        [
            "Santa Teresita"
        ],
        [
            "19,573"
        ],
        [
            "166.98"
        ],
        [
            "64.47"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Cagayan"
        ],
        [
            "Santiago"
        ],
        [
            "148,580"
        ],
        [
            "275.00"
        ],
        [
            "106.18"
        ],
        [
            "540"
        ],
        [
            "1,400"
        ],
        [
            "Independent component city"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Santo Niño"
        ],
        [
            "28,537"
        ],
        [
            "512.90"
        ],
        [
            "198.03"
        ],
        [
            "56"
        ],
        [
            "150"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Cagayan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "24,528"
        ],
        [
            "60.70"
        ],
        [
            "23.44"
        ],
        [
            "400"
        ],
        [
            "1,000"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Isabela"
        ],
        [
            "Solana"
        ],
        [
            "88,445"
        ],
        [
            "234.60"
        ],
        [
            "90.58"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Cagayan"
        ],
        [
            "Solano"
        ],
        [
            "65,287"
        ],
        [
            "139.80"
        ],
        [
            "53.98"
        ],
        [
            "470"
        ],
        [
            "1,200"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Tuao"
        ],
        [
            "63,970"
        ],
        [
            "215.50"
        ],
        [
            "83.21"
        ],
        [
            "300"
        ],
        [
            "780"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Cagayan"
        ],
        [
            "† Tuguegarao"
        ],
        [
            "166,334"
        ],
        [
            "144.80"
        ],
        [
            "55.91"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "Component city"
        ],
        [
            "3rd"
        ],
        [
            "Cagayan"
        ],
        [
            "Tumauini"
        ],
        [
            "70,743"
        ],
        [
            "467.30"
        ],
        [
            "180.43"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Isabela"
        ],
        [
            "Uyugan"
        ],
        [
            "1,380"
        ],
        [
            "16.28"
        ],
        [
            "6.29"
        ],
        [
            "85"
        ],
        [
            "220"
        ],
        [
            "Municipality"
        ],
        [
            "6th"
        ],
        [
            "Batanes"
        ],
        [
            "Villaverde"
        ],
        [
            "20,118"
        ],
        [
            "81.50"
        ],
        [
            "31.47"
        ],
        [
            "250"
        ],
        [
            "650"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "1 Santiago City is administratively and legally independent from the province of Isabela as stated in Section 25 of the LGC."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Cagayan ValleyYearPop.±% p.a.1903 295,211—    1918 348,332+1.11%1939 600,151+2.62%1948 669,006+1.21%1960 1,035,750+3.71%1970 1,462,723+3.51%1975 1,665,245+2.63%1980 1,919,091+2.88%1990 2,340,545+2.01%1995 2,536,035+1.51%2000 2,813,159+2.25%2007 3,051,487+1.13%2010 3,229,163+2.08%2015 3,451,410+1.28%2020 3,685,744+1.30%Source: Philippine Statistics Authority"
        ],
        [
            "Population percentage(2020)"
        ],
        [
            "  Batanes: 18,831 (0.5%)"
        ],
        [
            "  Cagayan: 1,268,603 (34.4%)"
        ],
        [
            "  Isabela: 1,697,050 (46.0%)"
        ],
        [
            "  Nueva Vizcaya: 497,432 (13.5%)"
        ],
        [
            "  Quirino: 203,828 (5.5%)"
        ],
        [
            "Languages"
        ],
        [
            "Ilocano is the main lingua franca (orally) of the region.",
            "Other languages include Ibanag and Ivatan, the main language of Batanes.",
            "The use of Tagalog and English also serve as the region's language in education, governance, tourism, popular culture, and commerce inside and outside the region."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cagayan Valley"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  26.84"
        ],
        [
            "2009  25.50"
        ],
        [
            "2012  22.14"
        ],
        [
            "2015  17.77"
        ],
        [
            "2018  16.29"
        ],
        [
            "2021  11.70"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Rice fields in Nueva Vizcaya"
        ],
        [
            "A view of Tuguegarao, Cagayan as seen in April 2011"
        ],
        [
            "The province of Isabela and the city of Santiago"
        ],
        [
            "The city of Tuguegarao is the center of excellence in education, commerce, trade and culture and as the economic center of the region, the city continuously aims for outstanding performance and competence in administration, citizen participation, community and economic development, cultural arts, education, fiscal management, infrastructure, intergovernmental cooperation, planning, public safety, recreation and leisure services, social services, and technology.",
            "Its economy gradually shifted from agriculture to secondary/tertiary economic activities such as trading, commerce and services.",
            "The shift was ushered by city's role as the Regional Government Center and Center of Commerce in Northern Luzon."
        ],
        [
            "Tuguegarao City was included to be one of the digital cities for 2025 to sustain the rapid growth of the Information Technology and Business Process Management and to promote development in the city.",
            "The program (Digital Cities 2025) was created through a partnership between the DICT, the IT and Business Process Association of the Philippines (IBPAP), and Leechiu Property Consultants (LPC)."
        ],
        [
            "Cauayan is a component city in the province of Isabela.",
            "It is dubbed as the Ideal City of the North and the host city for the proposed Isabela Special Economic Zone and the Regional Agro-Industrial Growth Center."
        ],
        [
            "Ilagan is a component city and the capital of the province of Isabela.",
            "The city is the Corn Capital of the Philippines and has been considered as the Primary Growth Center of Region 2."
        ],
        [
            "Solano is a first class municipality and the main commercial and financial center of the province of Nueva Vizcaya.",
            "It also has the most fast food restaurants chains and the most banks among the municipalities in the entire region.",
            "According to the 2016 Cities and Municipalities Competitiveness Index conducted by the National Competitiveness Council, Solano took the 25th spot overall and ranked 30th among the first class and second class municipalities in the Philippines.",
            "This further solidified the status of Solano as the undisputed premier town of Cagayan Valley being the premier town in Nueva Vizcaya and the fastest-growing municipality in the region."
        ],
        [
            "Cagayan has several attractions which include beaches, swimming, snorkeling, skin-diving, fishing in the river and the sea, hiking in primeval forest, mountain-climbing, archaeological sites, the collection of the provincial museum, the Callao Caves, and many churches."
        ],
        [
            "The Cagayan Economic Zone Authority (CEZA) is situated in Santa Ana, Cagayan."
        ],
        [
            "Quirino is the youngest province in the region.",
            "With its agricultural based nature, the vast vegetative agricultural covers reveal the major source of living of the people.",
            "Farming has been the main industry in the province, with rice and corn as major crops as with other provinces in the region.",
            "Virgin forest and wealthy bodies of water have been great contributors in its development.",
            "Small scale industries like furniture making, basketry, rattan craft, and dried/fossilized flower production, where the province was famously known, are prevalent.",
            "Banana products also sold in and out the province and also for export purposes.",
            "The small scale business and associations also make their own products like banana chips, peanuts, patupats and others.",
            "The province also produces a substantial amount of fruits/crops like mango, citrus, pineapple, coffee, coconut, papaya, lanzones, rambutan and vegetables."
        ],
        [
            "The province of Nueva Vizcaya has basically an agricultural economy with commerce, trade, and industry contributing to its growth and development.",
            "Among other major economic activities are farming and cattle and swine raising.",
            "Primary crops are palay and corn.",
            "The province produces quality onions and vegetables often sold in Metro Manila.",
            "Oranges and mangoes are now major crops being exported fresh to other Asian countries; earning its title as the Citrus Capital of the Philippines."
        ],
        [
            "Batanes is the northernmost and smallest province in the region as well as in the whole Philippines.",
            "It is the only province located outside the mainland Cagayan Valley.",
            "Due to its geographical location, fishing is considered as a major industry and source of livelihood for the people.",
            "Garlic and cattle are major export crops.",
            "Ivatans also plant camote (sweet potato), cassava, gabi or tuber and a unique variety of white uvi.",
            "Sugarcane is raised to produce palek, a kind of native wine, and vinegar.",
            "Tourism also contributes to the province's thriving economy."
        ],
        [
            "Agriculture"
        ],
        [
            "Cagayan Valley being the country's second largest region in terms of land area.",
            "As of 2022, Cagayan Valley region remains to be the top producer of corn in the whole country and second in rice production."
        ],
        [
            "Trade and industry"
        ],
        [
            "In 2014, retail giants like Robinsons Land and SM Prime opened its pioneer malls in the region, the Robinsons Place Santiago and SM City Cauayan in Santiago City and Cauayan respectively."
        ],
        [
            "In 2018, Vista Land and Life Scapes, Inc. announced the establishment of its first high-end mall in the region that is Vista Mall Santiago in Santiago City, and they are also putting up Vista Mall in Tuguegarao City it will be second on the region after Vista Mall Santiago."
        ],
        [
            "Aquaculture and fishing industry"
        ],
        [
            "On January 11, 2008, the Bureau of Fisheries and Aquatic Resources (BFAR) stated that tilapia (species of cichlid fishes from the tilapiine cichlid tribe) production grew and Cagayan Valley is now the Philippines' tilapia capital (Saint Peter's fish)."
        ],
        [
            "Cagayan's coastline is one of the longest in the country having almost 73% of Cagayan Valley Region's coastal seaboards.",
            "This is aside from the large rivers and their tributaries, lakes, creeks and streams which are also rich fishing and aquaculture grounds.",
            "Untapped coastal fishing grounds stretch from the towns of Santa Praxedes in the west to Santa Ana on the east, on its northern coast facing the Babuyan Channel;"
        ],
        [
            "The coastal waters of Isabela are big sources of marine life that could supply the fish requirements of the region, according to a study commissioned by the Bureau of Fisheries and Aquatic Resources (BFAR).",
            "The study stated that Isabela waters are rich in untapped fisheries and marine resources and also has extensive sea grass beds and coral reefs that are home to variety of fish species which include sardines and mackerel and have sizable chunks of oceanic tunas, which thrive throughout the year.",
            "The fishing ground has 238 marine fish species.",
            "High species diversity could be an indication that the habitat is still good and undisturbed."
        ],
        [
            "The fishing industry in Cagayan Valley has been in perturbed condition owing to the declining pattern of production for the past years."
        ],
        [
            "By fishing grounds classification in the region, there is an inland municipal fisheries production and marine municipal fisheries production, the latter, particularly in provinces with coastal areas in the provinces of Cagayan, Isabela and Batanes.",
            "According to the Philippine Statistics Authority (PSA), inland municipal production for 2021 has gone up close to 2,000 metric tons, while marine municipal production reached close to 3,300 metric tons, both as an initial production in the first quarter of 2020."
        ],
        [
            "According to the Bureau Fisheries and Aquatic Resources (BFAR), since 2010 to 2015, the fish sufficiency level in Cagayan Valley is on downtrend level because of the various threats to the industry.",
            "Several problems have affected the sector in the recent years including the weather disturbances, use of illegal fishing gears and methods and the increasing demand of a fast-growing population.",
            "The provinces of Batanes and Cagayan have passed the 100 percent sufficiency level at 138 percent while Cagayan recorded 96 percent.",
            "However, the performances of Isabela, Quirino and Nueva Vizcaya at 17 percent, 11 percent and 10 percent, respectively, have affected the total performance of the region.",
            "Data obtained from the Bureau Fisheries and Aquatic Resources showed that from 2006 to 2015, the sufficiency level has dropped significantly in 2010 until it reached its lowest level at 44 percent in the last five years."
        ],
        [
            "Citrus industry"
        ],
        [
            "Cagayan Valley is positioned to become the country's Citrus Capital through a program undertaken by the Nueva Vizcaya State University (NVSU) with funding from the Philippine Council for Agriculture, Aquatic and Natural Resources Research and Development of the Department of Science and Technology (DoST-PCAARRD).",
            "The country's domestic supply of citrus is currently insufficient to meet local demand, according to DoST-PCAARRD, due to \"high incidence of pest and diseases, poor orchard management, and low adoption of improved management practices, among many other factors.\"",
            "The NVSU's citrus research and development program includes yield improvement, setting up a gene bank, and value chain analysis.",
            "It targets a 233% increase in yield — from 4.5 tons per hectare ha (t/ha) to 15 t/ha — and a 60% reduction in post-harvest losses from 25% to 10% by 2019.",
            "The targets are part of the Citrus Industry Strategic S&T Program (ISP) of DoST-PCAARRD.",
            "By the end of 2017, the program team is expected to produce value chain maps for calamansi, orange, and pomelo in the region; characterize fifteen species for the database system of the gene bank study; improve NVSU and Municipal Agriculture Office (MAGRO) citrus nurseries producing 10,000 and 2,000 budded seedlings, respectively; establish new 1-hectare orchard with planting materials from NVSU; and generate data on the description of local citrus pests and diseases."
        ],
        [
            "Infrastructure"
        ],
        [
            "Roads and Bridges"
        ],
        [
            "Pigalo Bridge - The Pigalo Bridge traverses over the Cagayan River in Angadanan, Isabela.",
            "This bridge also connects the two municipalities of Angadanan, Northeast Isabela and San Guillermo, Isabela at Southwest.",
            "The proposed construction of the Pigolo Bridge approaches the span of about 450 lin.",
            "meters across the Cagayan River, the project started on April 10, 2017, and was completed on April 29, 2019."
        ],
        [
            "Buntun Bridge - Buntun Bridge took three administrations to finish the construction from 1960 to 1969 connecting the municipality of Solana and Tuguegarao City.",
            "considered to be one of the longest bridge in the country crossing the longest river in the country called Cagayan River also known as the Rio Grande de Cagayan.",
            "The bridge was stretched to 1,369 m (meters) in length."
        ],
        [
            "Image gallery"
        ],
        [
            " Sierra Madre mountains at Palanan"
        ],
        [
            "Landscape of Batanes"
        ],
        [
            " Eastern coast of Isabela"
        ],
        [
            " Tuguegarao Cathedral"
        ],
        [
            " Northern coast of Cagayan"
        ],
        [
            "Northern end of the Sierra Madre with Palaui Island in the background"
        ],
        [
            "Batanes coastline in Batan Island"
        ],
        [
            "See also"
        ],
        [
            "List of Cultural Properties of the Philippines in Cagayan Valley"
        ],
        [
            "References"
        ],
        [
            "^ \"POPULATION PROJECTIONS BY REGION, PROVINCE, CITIES AND MUNICIPALITIES, 2020-2025\".",
            "www.doh.gov.ph.",
            "Department of Health.",
            "August 27, 2020.",
            "Archived from the original on May 14, 2021.",
            "Retrieved October 16, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ \"Republic Act No.",
            "11080 - An act reapportioning the second largest province of the Philippines into six legislative districts\".",
            "Inquirer PH.",
            "Inquirer.Net.",
            "September 27, 2018.",
            "Retrieved September 29, 2018."
        ],
        [
            "^ a b \"2021 to 2023 Gross Regional Domestic Product (GRDP)\".",
            "openstat.psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ a b \"List of Regions\".",
            "National Statistical Coordination Board.",
            "Archived from the original on October 13, 2008.",
            "Retrieved January 9, 2011."
        ],
        [
            "^ a b \"PSGC Interactive; List of Cities\".",
            "Philippine Statistics Authority.",
            "Archived from the original on April 29, 2011.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ Cagayan Valley Archived May 11, 2013, at the Wayback Machine, Department of Tourism - Region 2, Retrieved June 21, 2012"
        ],
        [
            "^ https://psa.gov.ph/statistics/education-mass-media/node/163646"
        ],
        [
            "^ Descripcion del Valle de Cagayan, 1897, Jose Burgues"
        ],
        [
            "^ \"Tantingco: The Kapampangan in Us\".",
            "Archived from the original on January 23, 2024.",
            "Retrieved January 23, 2024.",
            "\"At one point, Pampanga’s borders extended all the way to Palanan, Isabela in the north and to Infanta, Quezon in the south, with the Pacific Ocean on its east side and the China Sea on its west side.\"",
            "(Baler which was the origin of Spanish forces and Tagalog settlers who settled Palanan was part of Pampanga along with Casiguran.)"
        ],
        [
            "^ Salgado, Pedro.",
            "\"Other Missions in Isabela\".",
            "Cagayan Valley and Easter Cordillera: 1581-1898, Volume I. Rex Publishing.",
            "pp.",
            "496–499."
        ],
        [
            "^ Cite error: The named reference :1 was invoked but never defined (see the help page)."
        ],
        [
            "^ Who We Are: Nueva Ecija"
        ],
        [
            "^ Balbosa, Joven Zamoras (1992).",
            "\"IMF Stabilization Program and Economic Growth: The Case of the Philippines\" (PDF).",
            "Journal of Philippine Development.",
            "XIX (35).",
            "Archived from the original (PDF) on September 21, 2021.",
            "Retrieved November 6, 2022."
        ],
        [
            "^ Balisacan, A. M.; Hill, Hal (2003).",
            "The Philippine Economy: Development, Policies, and Challenges.",
            "Oxford University Press.",
            "ISBN 9780195158984."
        ],
        [
            "^ Cororaton, Cesar B.",
            "\"Exchange Rate Movements in the Philippines\".",
            "DPIDS Discussion Paper Series 97-05: 3, 19."
        ],
        [
            "^ Celoza, Albert F. (1997).",
            "Ferdinand Marcos and the Philippines: The Political Economy of Authoritarianism.",
            "Greenwood Publishing Group.",
            "ISBN 9780275941376."
        ],
        [
            "^ Schirmer, Daniel B.",
            "(1987).",
            "The Philippines reader : a history of colonialism, neocolonialism, dictatorship, and resistance (1st ed.).",
            "Boston: South End Press.",
            "ISBN 0896082768.",
            "OCLC 14214735."
        ],
        [
            "^ Kessler, Richard J.",
            "(1989).",
            "Rebellion and repression in the Philippines.",
            "New Haven: Yale University Press.",
            "ISBN 0300044062.",
            "OCLC 19266663."
        ],
        [
            "^ Pimentel, Benjamin (2006).",
            "U.G.",
            "an underground tale: the journey of Edgar Jopson and the first quarter storm generation.",
            "Pasig: Anvil Publishing, Inc. ISBN 9712715906.",
            "OCLC 81146038."
        ],
        [
            "^ Rodis, Rodel.",
            "\"Remembering the First Quarter Storm\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on January 31, 2015.",
            "Retrieved January 27, 2020."
        ],
        [
            "^ Lacaba, Jose F. (1982).",
            "Days of Disquiet, Nights of Rage: The First Quarter Storm & Related Events.",
            "Manila: Salinlahi Pub.",
            "House.",
            "pp.",
            "11–45, 157–178."
        ],
        [
            "^ Magno, Alexander R., ed.",
            "(1998).",
            "\"Democracy at the Crossroads\".",
            "Kasaysayan, The Story of the Filipino People Volume 9:A Nation Reborn.",
            "Hong Kong: Asia Publishing Company Limited."
        ],
        [
            "^ \"Alfred McCoy, Dark Legacy: Human rights under the Marcos regime\".",
            "Ateneo de Manila University.",
            "September 20, 1999."
        ],
        [
            "^ Abinales, P.N.",
            "; Amoroso, Donna J.",
            "(2005).",
            "State and society in the Philippines.",
            "Lanham, MD: Rowman & Littlefield Publishers.",
            "ISBN 978-0742510234.",
            "OCLC 57452454."
        ],
        [
            "^ \"Gone too soon: 7 youth leaders killed under Martial Law\".",
            "Rappler.",
            "Retrieved June 15, 2018."
        ],
        [
            "^ \"PADILLA, Sabino \"Abe\" Garcia Jr\".",
            "November 29, 2017.",
            "Retrieved September 9, 2020."
        ],
        [
            "^ \"PURUGGANAN, Miguel Gatan\".",
            "Bantayog ng mga Bayani.",
            "October 9, 2015.",
            "Retrieved September 4, 2020."
        ],
        [
            "^ REYES, RACHEL A. G. (October 18, 2016).",
            "\"Marcos cronies and the golden oriole of Isabela\".",
            "Archived from the original on November 8, 2020.",
            "Retrieved May 10, 2024."
        ],
        [
            "^ Danguilan Vitug, Marites (1993).",
            "The Politics of Logging: Power from the Forest.",
            "Manila: Philippine Center for Investigative Journalism.",
            "ISBN 978-971-8686-01-0."
        ],
        [
            "^ Villegas, Bernardo M. (February 1, 1987).",
            "\"The Philippines in 1986: Democratic Reconstruction in the Post-Marcos Era\".",
            "Asian Survey.",
            "27 (2): 194–205.",
            "doi:10.2307/2644614.",
            "ISSN 0004-4687.",
            "JSTOR 2644614."
        ],
        [
            "^ Curaming, Rommel and Claudio, Lisandro, A Historicised (Re)Assessment of EDSA 'People Power' (1986) (February 1, 2010).",
            "Asia Research Institute Working Paper No.",
            "134. https://ssrn.com/abstract=1716572 or http://dx.doi.org/10.2139/ssrn.1716572"
        ],
        [
            "^ Marchadesch, Barbara (November 24, 2017).",
            "\"TIMELINE: The peace talks between the government and the CPP-NPA-NDF, 1986 – present\".",
            "GMA News Online.",
            "Archived from the original on November 24, 2017.",
            "Retrieved April 15, 2020."
        ],
        [
            "^ Ablat, Jhon Dave (March 23, 2020).",
            "\"Passenger from Manila is Cagayan Valley's 1st COVID-19 case\".",
            "Retrieved April 22, 2020."
        ],
        [
            "^  Mocon-Ciriaco, Claudeth (September 30, 2020).",
            "\"DOH: Batanes no longer Covid-free, all PHL provinces now have Covid cases\".",
            "BusinessMirror.",
            "Retrieved September 30, 2020."
        ],
        [
            "^ Villanueva, Raymund B.",
            "(November 14, 2020).",
            "\"Worst flooding in decades: Cagayan Valley's turn to cry for help\".",
            "Northern Dispatch.",
            "Archived from the original on June 22, 2024.",
            "Retrieved June 22, 2024."
        ],
        [
            "^ Lalu, Gabriel Pabico (November 13, 2020).",
            "\"Robredo assures Cagayan Valley: We heard you, gov't finding ways to reach you\".",
            "INQUIRER.net.",
            "Retrieved November 13, 2020."
        ],
        [
            "^ \"Cagayan province turned into 'Pacific Ocean': disaster management official\".",
            "ABS-CBN News.",
            "November 13, 2020.",
            "Retrieved November 13, 2020."
        ],
        [
            "^ \"Robredo backs probe into oversights that may have led to Cagayan Valley floods\".",
            "Philstar.com.",
            "Retrieved November 16, 2020."
        ],
        [
            "^ Marquez, Consuelo (November 14, 2020).",
            "\"After ABS-CBN shutdown, lack of Ulysses warning made Cagayan residents suffer– Robredo\".",
            "INQUIRER.net.",
            "Retrieved November 14, 2020."
        ],
        [
            "^ \"ABS-CBN's Wide Reach Missed by Netizens as Typhoon Ulysses Hits Philippines\".",
            "www.msn.com.",
            "Retrieved November 14, 2020."
        ],
        [
            "^ \"Roque denies information gap in Cagayan floods, but vows to 'do better' in disaster response\".",
            "cnn.",
            "Archived from the original on November 16, 2020.",
            "Retrieved November 16, 2020."
        ],
        [
            "^ \"POPULATION BY REGION, PROVINCE, CITIES AND MUNICIPALITIES, 2020-2025\".",
            "Department of Health.",
            "August 27, 2020.",
            "Archived from the original on May 14, 2021.",
            "Retrieved October 20, 2020."
        ],
        [
            "^ \"PSGC Interactive; List of Provinces\".",
            "Philippine Statistics Authority.",
            "Archived from the original on January 11, 2013.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"Republic Act No.",
            "7160 LOCAL GOVERNMENT CODE OF 1991\".",
            "The LawPhil Project.",
            "Retrieved November 5, 2013."
        ],
        [
            "^ \"Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities\" (PDF).",
            "2010 Census and Housing Population.",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on September 28, 2013.",
            "Retrieved August 9, 2013."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Transforming Santiago City into an independent component city up north\".",
            "Ceasar M. Perante of the Business Mirror.",
            "businessmirror.com.ph.",
            "June 30, 2018.",
            "Retrieved June 30, 2018."
        ],
        [
            "^ \"Santiago City: In the commercial hub of Cagayan Valley\".",
            "Amadís Ma.",
            "Guerrero - @inquirerdotnet.",
            "businessinquirer.net.",
            "June 4, 2012.",
            "Retrieved June 4, 2012."
        ],
        [
            "^ Top 10 Highest earning Philippine province Nobert Bermosa website.",
            "Retrieved June 17, 2012."
        ],
        [
            "^ \"Richest Cities and Provinces in PH 2021\".",
            "CNN PH.",
            "cnnphilippines.com.",
            "Archived from the original on October 17, 2022.",
            "Retrieved October 18, 2022."
        ],
        [
            "^ Top 10 Highest earning Philippine province, Nobert Bermosa website, Retrieved June 17, 2012."
        ],
        [
            "^ \"Isabela,10th richest province in the Philippines in 2011\".",
            "Inquirer PH.",
            "Inquirer.",
            "October 19, 2014.",
            "Retrieved October 19, 2014."
        ],
        [
            "^ \"Richest Cities and Provinces in PH 2021\".",
            "CNN PH.",
            "cnnphilippines.com.",
            "Archived from the original on October 17, 2022.",
            "Retrieved October 18, 2022."
        ],
        [
            "^ \"Isabela, the Regional Trade and Industrial Center of north-eastern Luzon\".",
            "Inquirer PH.",
            "Inquirer.",
            "October 19, 2014.",
            "Retrieved October 19, 2014."
        ],
        [
            "^ \"Cagayan Valley is 5th fastest growing region in the country in 2019\".",
            "NEDA Region 2. neda.rdc2.gov.ph.",
            "Retrieved November 23, 2020."
        ],
        [
            "^ \"Tuguegarao; The Country's Premiere Ybanag City\".",
            "Philippine Cities.",
            "Retrieved June 5, 2018."
        ],
        [
            "^ \"Cagayan Valley's economy rebounds to 5.1% in 2021\".",
            "Mark Djeron Tumabao of the Philippine Information Agency.",
            "pia.gov.ph.",
            "May 23, 2022.",
            "Retrieved May 23, 2022."
        ],
        [
            "^ \"DBP-backed infra projects to boost economic activity in Tuguegarao City\".",
            "Development Bank of the Philippines.",
            "dbp.ph.",
            "October 4, 2019.",
            "Retrieved October 4, 2019."
        ],
        [
            "^ \"25 PH cities chosen to be next 'digital cities' by 2025\".",
            "Philippine News Agency.",
            "Retrieved September 2, 2020."
        ],
        [
            "^ \"Metropolitan Cauayan eyed as PH's agro-industrial capital\".",
            "Merlito Edale of the Philippines News Agency.",
            "pna.gov.ph.",
            "Retrieved January 23, 2018."
        ],
        [
            "^ \"Cauayan; The Ideal City of the North\".",
            "Philippine Cities.",
            "Retrieved June 5, 2018."
        ],
        [
            "^ \"Future Investment Hub\".",
            "Official Website of Isabela the Queen Province of the PH.",
            "rdc2.gov.ph.",
            "Retrieved December 31, 2015."
        ],
        [
            "^ \"Economic Profile; City of Ilagan\".",
            "CMCI DTI.",
            "cmci.dti.gov.ph.",
            "Retrieved March 8, 2022."
        ],
        [
            "^ Communications, CESO (January 17, 2020).",
            "\"Ilagan Makes Its Way On The Map\".",
            "CESO - Stronger economies.",
            "Better lives.",
            "Retrieved October 17, 2021."
        ],
        [
            "^ \"LANDBANK-funded bridges, hospital help boost Ilagan City's dev't\".",
            "Landbank of the Philippines.",
            "landbank.com.",
            "Retrieved March 23, 2023."
        ],
        [
            "^ \"The Corn Capital of the Philippines\".",
            "ILAGAN CITY AGRICULTURIST OFFICIAL WEBSITE.",
            "agriculture.cityofilagan.com.",
            "Retrieved August 11, 2015."
        ],
        [
            "^ \"Ilagan; The Corn Capital of the Philippines\".",
            "Philippine Cities.",
            "Retrieved June 5, 2018."
        ],
        [
            "^ \"Local Economic Development & Investment Promotion in the City of Ilagan\".",
            "Official website of the City of Ilagan.",
            "cityofilagan.com.",
            "Retrieved March 8, 2022."
        ],
        [
            "^ \"Solano; The Premiere Town of Cagayan Valley\".",
            "NuevaVizcaya.gov.ph.",
            "Retrieved June 5, 2018."
        ],
        [
            "^ \"2016 Cities and Municipalities Competitiveness Index\".",
            "cmcindex.org.ph.",
            "Retrieved June 5, 2018."
        ],
        [
            "^ \"Solano gears up for cityhood\".",
            "LEANDER C. DOMINGO of The Manila Times.",
            "manilatimes.net.",
            "January 10, 2023.",
            "Retrieved January 10, 2023."
        ],
        [
            "^ \"Economy of Quirino Province\".",
            "I Love Quirino.",
            "July 15, 2013.",
            "Retrieved June 7, 2018."
        ],
        [
            "^ \"The Province of Quirino\".",
            "Department of Trade and Industry (Region 2).",
            "Archived from the original on June 12, 2018.",
            "Retrieved June 7, 2018."
        ],
        [
            "^ \"The Province of Nueva Vizcaya\".",
            "DTI Region 2.",
            "Archived from the original on June 12, 2018.",
            "Retrieved June 7, 2018."
        ],
        [
            "^ \"The Province of Nueva Vizcaya; Citrus Capital of the Philippines\".",
            "Business Mirror.",
            "February 28, 2015.",
            "Retrieved February 28, 2015."
        ],
        [
            "^ \"The Province of Batanes\".",
            "Philippine Information Agency.",
            "Archived from the original on June 12, 2018.",
            "Retrieved June 7, 2018."
        ],
        [
            "^ \"Region 2 posts high rice, corn yield\".",
            "DA Communications Group.",
            "da.gov.ph.",
            "February 3, 2022.",
            "Retrieved February 3, 2022."
        ],
        [
            "^ \"Cagayan Valley posted the highest increment in agricultural production in 2019 at 6.6 percent\".",
            "Philippine Statistics Authority.",
            "psa.gov.ph.",
            "Retrieved October 30, 2020."
        ],
        [
            "^ \"Cagayan Valley remains number 1 corn producer, 2nd in rice\".",
            "Philippine Information Agency & Regional Dev't Council (RII).",
            "rdc.rdc2.gov.ph.",
            "Retrieved January 17, 2023."
        ],
        [
            "^ \"Cagayan Valley, the granary region: where to?\".",
            "Inquirer.net.",
            "Rolando T. Dy - @inquirerdotnet.",
            "August 8, 2016.",
            "Retrieved August 8, 2016."
        ],
        [
            "^ \"SM City Cauayan now open\".",
            "inquirer.net.",
            "lifestyle.inquirer.net.",
            "October 18, 2014.",
            "Retrieved October 19, 2014."
        ],
        [
            "^ \"Robinsons opening malls in Roxas and Santiago cities\".",
            "inquirer.net.",
            "business.inquirer.net.",
            "Retrieved February 3, 2014."
        ],
        [
            "^ \"SM Prime opens its Newest Mall in Tuguegarao City, Cagayan\".",
            "SM Investments.",
            "sminvestments.com.",
            "October 10, 2017.",
            "Retrieved October 10, 2017."
        ],
        [
            "^ \"Robinsons Land opens 50th mall\".",
            "Business World.",
            "bworldonline.com.",
            "July 19, 2018.",
            "Retrieved July 20, 2018."
        ],
        [
            "^ \"Newest SM mall opens in Tuguegarao\".",
            "Philippine Star Global.",
            "philstar.com.",
            "November 19, 2022.",
            "Retrieved November 19, 2022."
        ],
        [
            "^ \"Vista Land Plans to Adds 7 New Malls to its Portfolio by 2020\".",
            "Orissa International.",
            "orissa-international.com.",
            "Retrieved January 1, 2019."
        ],
        [
            "^ \"Vista Land to build seven new malls in next 2 years\".",
            "Manila Standard Business.",
            "manilastandard.net.",
            "January 6, 2019.",
            "Retrieved January 6, 2019."
        ],
        [
            "^ \"Cagayan Valley country's tilapia capital\".",
            "Charlie Lagasca(Philstar.com).",
            "philstar.com.",
            "January 13, 2008.",
            "Retrieved January 13, 2008."
        ],
        [
            "^ \"Cagayan Valley emerges as the Tilapia capital in the Philippines\".",
            "eFeedLink.",
            "efeedlink.com.",
            "Retrieved January 15, 2008."
        ],
        [
            "^ \"Profiles\".",
            "Department of Trade and Industry.",
            "Archived from the original on March 7, 2016.",
            "Retrieved March 6, 2016.",
            "The region is hailed as the \"Tilapia Capital of the Philippines\" The main crops are rice, corn, and tobacco.",
            "Fishing is prevalent in the coast of Cagayan, Isabela, Batanes and Magat Dam in Isabela."
        ],
        [
            "^ \"Cagayan Valley Tops Charts for Tilapia\".",
            "The Fish Site.",
            "thefishsite.com.",
            "January 14, 2008.",
            "Retrieved January 14, 2008."
        ],
        [
            "^ \"Tilapia farmers cope with climate change in Isabela\".",
            "Agriculture Magazine.",
            "agriculture.com.ph.",
            "Retrieved January 22, 2021."
        ],
        [
            "^ \"Isabela fish farm reels in success with LANDBANK support\".",
            "Landbank of the Philippines.",
            "landbank.com.",
            "Retrieved July 7, 2022."
        ],
        [
            "^ \"Isabela holds the record as the highest producer of Tilapia in Region 2\" (PDF).",
            "boi.gov.ph.",
            "Archived from the original (PDF) on January 27, 2018.",
            "Retrieved June 7, 2018."
        ],
        [
            "^ \"BFAR promotes tilapia, ulang polyculture to benefit fish farmers in Cagayan Valley\".",
            "Liezle Basa Iñigo of Manila Bulletin.",
            "mb.com.ph.",
            "Retrieved October 8, 2022."
        ],
        [
            "^ \"Tilapia industry gets support from DA\".",
            "Jerico Joshua Kahulugan of the Northern Forum.",
            "northernforum.net.",
            "Retrieved February 7, 2023."
        ],
        [
            "^ \"Claveria lives up to its name as Coastal Paradise of the North\".",
            "Max Prudencio of the Philippine News Agency.",
            "pia.gov.ph.",
            "Retrieved September 7, 2017."
        ],
        [
            "^ \"Cagayan tourism town to boost fishery industry\".",
            "The Manila Times.",
            "manilatimes.net.",
            "August 3, 2018.",
            "Retrieved August 3, 2018."
        ],
        [
            "^ \"Beltfishing is the next big thing in Santa Ana, Cagayan\".",
            "Mark Djeron Tumabao of the Philippine Information Agency.",
            "pia.gov.ph.",
            "Retrieved November 18, 2021."
        ],
        [
            "^ \"CAGAYAN PROVINCE FISHERIES AND AQUATIC RESOURCES\".",
            "Official Website of the Provincial Government of Cagayan.",
            "cagayan.gov.ph.",
            "Retrieved December 31, 2022."
        ],
        [
            "^ \"Isabela has enough fish to feed Cagayan Valley, study says\".",
            "Inquirer.net.",
            "newsinfo.inquirer.net.",
            "Retrieved February 27, 2018."
        ],
        [
            "^ \"Isabela waters can augment fish supply in Cagayan Valley\".",
            "Leander C. Domingo of The Manila Times.",
            "manilatimes.net.",
            "February 22, 2018.",
            "Retrieved February 22, 2018."
        ],
        [
            "^ \"Palanan, Isabela: Angels' Paradise\".",
            "Leonardo Perante II of the Business Mirror.",
            "businessmirror.com.ph.",
            "Retrieved May 7, 2017."
        ],
        [
            "^ \"1st Quarter 2019 Fish Production in Cagayan Valley Continues to Display Negative Indicator at 10.65 Percent\".",
            "Philippine Statistics Authority.",
            "rsso02.psa.gov.ph.",
            "Retrieved June 25, 2019."
        ],
        [
            "^ \"Fish Production in the Region Fell Short Anew\".",
            "Philippine Statistics Authority - Region II.",
            "rsso02.psa.gov.ph.",
            "Retrieved March 25, 2020."
        ],
        [
            "^ \"Fish Production in Cagayan Valley Deccelerates Further by 8.90 Percent in 4th Quarter of 2018\".",
            "Philippine Statistics Authority - Region II.",
            "rsso02.psa.gov.ph.",
            "Retrieved February 27, 2019."
        ],
        [
            "^ \"FROM THE MANILA TIMES: DTI, BFAR to boost Cagayan fishery industry\".",
            "DA Communications Group.",
            "da.gov.ph.",
            "Retrieved March 3, 2022."
        ],
        [
            "^ \"Fish sufficiency level in Cagayan Valley on downtrend\".",
            "Benjamin De Yro of the Northern Forum.",
            "northernforum.net.",
            "Retrieved October 17, 2016."
        ],
        [
            "^ \"Fish Production sa Cagayan Valley, Bumaba dahil sa Pandemic- BFAR region 2\".",
            "Geronimo Dig of RMN Network.",
            "rmn.ph.",
            "Retrieved September 21, 2021."
        ],
        [
            "^ \"Good Performance Of Aquaculture Lift Up Fishery Production in Q3 2020\".",
            "Philippine Statistics Authority - Region II.",
            "rsso02.psa.gov.ph.",
            "Retrieved December 15, 2020."
        ],
        [
            "^ \"Cagayan Valley aims to become 'Citrus Capital of the Philippines'\".",
            "Business World.",
            "Retrieved October 5, 2017."
        ],
        [
            "^ \"Cagayan Valley eyes \"Citrus Capital of the Philippines\" title\".",
            "pcaarrd.dost.",
            "Retrieved November 15, 2017."
        ],
        [
            "^ \"Pigalo Bridge\".",
            "Department of Public Works and Highways.",
            "Retrieved August 1, 2019."
        ],
        [
            "^ \"Cagayan - Crossing Buntun Bridge, the Longest River Bridge in the Philippines\".",
            "pinoyadventurista.com.",
            "Retrieved September 2, 2020."
        ],
        [
            "External links"
        ],
        [
            " Media related to Cagayan Valley at Wikimedia Commons"
        ],
        [
            " Cagayan Valley travel guide from Wikivoyage"
        ],
        [
            " Geographic data related to Cagayan Valley at OpenStreetMap"
        ],
        [
            "Places adjacent to Cagayan Valley"
        ],
        [
            "Ilocos Region"
        ],
        [
            "Luzon Strait"
        ],
        [
            "Cordillera Administrative Region"
        ],
        [
            "Cagayan Valley"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Ilocos Region"
        ],
        [
            "Central Luzon"
        ],
        [
            "vteCagayan Valley (Region II)Regional center"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Provinces"
        ],
        [
            "Batanes"
        ],
        [
            "Cagayan"
        ],
        [
            "Isabela"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Quirino"
        ],
        [
            "Independent component city"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Basco"
        ],
        [
            "Bayombong"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Ilagan"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Municipalities"
        ],
        [
            "Abulug"
        ],
        [
            "Aglipay"
        ],
        [
            "Alcala"
        ],
        [
            "Alfonso Castañeda"
        ],
        [
            "Alicia"
        ],
        [
            "Allacapan"
        ],
        [
            "Ambaguio"
        ],
        [
            "Amulung"
        ],
        [
            "Angadanan"
        ],
        [
            "Aparri"
        ],
        [
            "Aritao"
        ],
        [
            "Aurora"
        ],
        [
            "Bagabag"
        ],
        [
            "Baggao"
        ],
        [
            "Ballesteros"
        ],
        [
            "Bambang"
        ],
        [
            "Basco"
        ],
        [
            "Bayombong"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Buguey"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "Claveria"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Diadi"
        ],
        [
            "Diffun"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Dupax del Norte"
        ],
        [
            "Dupax del Sur"
        ],
        [
            "Echague"
        ],
        [
            "Enrile"
        ],
        [
            "Gamu"
        ],
        [
            "Gattaran"
        ],
        [
            "Gonzaga"
        ],
        [
            "Iguig"
        ],
        [
            "Itbayat"
        ],
        [
            "Ivana"
        ],
        [
            "Jones"
        ],
        [
            "Kasibu"
        ],
        [
            "Kayapa"
        ],
        [
            "Lal-lo"
        ],
        [
            "Lasam"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Maddela"
        ],
        [
            "Mahatao"
        ],
        [
            "Mallig"
        ],
        [
            "Nagtipunan"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Pamplona"
        ],
        [
            "Peñablanca"
        ],
        [
            "Piat"
        ],
        [
            "Quezon (Isabela)"
        ],
        [
            "Quezon (Nueva Vizcaya)"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "Sabtang"
        ],
        [
            "Saguday"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Sanchez-Mira"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Solana"
        ],
        [
            "Solano"
        ],
        [
            "Tuao"
        ],
        [
            "Tumauini"
        ],
        [
            "Uyugan"
        ],
        [
            "Villaverde"
        ],
        [
            "Luzon, Philippines"
        ],
        [
            "vteRegions of the PhilippinesLuzon"
        ],
        [
            "NCR – National Capital Region"
        ],
        [
            "CAR – Cordillera Administrative Region"
        ],
        [
            "I – Ilocos Region"
        ],
        [
            "II – Cagayan Valley"
        ],
        [
            "III – Central Luzon"
        ],
        [
            "IV-A – Calabarzon"
        ],
        [
            "Mimaropa – Southwestern Tagalog Region"
        ],
        [
            "V – Bicol Region"
        ],
        [
            "Visayas"
        ],
        [
            "VI – Western Visayas"
        ],
        [
            "NIR – Negros Island Region"
        ],
        [
            "VII – Central Visayas"
        ],
        [
            "VIII – Eastern Visayas"
        ],
        [
            "Mindanao"
        ],
        [
            "IX – Zamboanga Peninsula"
        ],
        [
            "X – Northern Mindanao"
        ],
        [
            "XI – Davao Region"
        ],
        [
            "XII – Soccsksargen"
        ],
        [
            "XIII – Caraga Region"
        ],
        [
            "BARMM – Bangsamoro Autonomous Region in Muslim Mindanao"
        ],
        [
            "Former regions"
        ],
        [
            "ARMM – Autonomous Region in Muslim Mindanao"
        ],
        [
            "IV – Southern Tagalog"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cagayan_Valley&oldid=1232934483\""
        ],
        [
            "Categories: Cagayan ValleyRegions of the PhilippinesLuzonValleys of the PhilippinesHidden categories: Pages with reference errorsWebarchive template wayback linksPages with broken reference namesAll articles with dead external linksArticles with dead external links from February 2024Articles with permanently dead external linksArticles with short descriptionShort description is different from WikidataUse mdy dates from March 2020Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishPages using multiple image with auto scaled imagesPages using infobox settlement with no coordinatesArticles containing Ilocano-language textArticles containing Filipino-language textArticles to be expanded from March 2016All articles to be expandedArticles using small message boxesAll articles with unsourced statementsArticles with unsourced statements from March 2016Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}