{
    "name": "Calabarzon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Calabarzon"
        ],
        [
            "48 languages"
        ],
        [
            "العربية閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoChavacano de ZamboangaDeutschEspañolEsperantoEuskaraفارسیFrançais한국어हिन्दीHrvatskiIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuLietuviųМакедонскиBahasa Melayuမြန်မာဘာသာNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийScotsSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوVènetoTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°00′N 121°30′E﻿ / ﻿14°N 121.5°E﻿ / 14; 121.5"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Administrative region of the Philippines"
        ],
        [
            "For the historical region, see Southern Tagalog."
        ],
        [
            "Region in Luzon, PhilippinesCalabarzon"
        ],
        [
            "Southern TagalogRegion"
        ],
        [
            "Clockwise (from the top): Aguinaldo Shrine, Taal Volcano, Taal Basilica, Malagonlong Bridge, Pagsanjan FallsMotto: Calabarzon sa Habang Panahon!",
            "(Calabarzon Forever!",
            ")Location in the PhilippinesOpenStreetMapCoordinates: 14°00′N 121°30′E﻿ / ﻿14°N 121.5°E﻿ / 14; 121.5Country PhilippinesIsland groupLuzonRegional centerCalamba (Laguna)Largest cityAntipoloArea • Total16,873.31 km2 (6,514.82 sq mi)Highest elevation (Mount Banahaw)2,170 m (7,120 ft)Population (2020 census) • Total16,195,042 • Density960/km2 (2,500/sq mi)Time zoneUTC+8 (PST)ISO 3166 codePH-40Provinces"
        ],
        [
            "5"
        ],
        [
            " Batangas"
        ],
        [
            " Cavite"
        ],
        [
            " Laguna"
        ],
        [
            " Quezon"
        ],
        [
            " Rizal"
        ],
        [
            "Independent cities"
        ],
        [
            "1"
        ],
        [
            " Lucena"
        ],
        [
            "Component cities"
        ],
        [
            "21"
        ],
        [
            " Antipolo"
        ],
        [
            " Bacoor"
        ],
        [
            " Batangas City"
        ],
        [
            " Biñan"
        ],
        [
            " Cabuyao"
        ],
        [
            " Calaca"
        ],
        [
            " Calamba"
        ],
        [
            " Carmona"
        ],
        [
            " Cavite City"
        ],
        [
            " Dasmariñas"
        ],
        [
            " General Trias"
        ],
        [
            " Imus"
        ],
        [
            " Lipa"
        ],
        [
            " San Pablo"
        ],
        [
            " San Pedro"
        ],
        [
            " Santa Rosa"
        ],
        [
            " Santo Tomas"
        ],
        [
            " Tagaytay"
        ],
        [
            " Tanauan"
        ],
        [
            " Tayabas"
        ],
        [
            " Trece Martires"
        ],
        [
            "Municipalities120Barangays4,019Cong.",
            "districts19LanguagesTagalogEnglishGDP (2023)₱3.44 trillion$61.77 billionHDI 0.795 (High)HDI rank2nd in the Philippines (2019)"
        ],
        [
            "Calabarzon (officially stylized in all caps; It is situated southeast of Metro Manila, and is bordered by Manila Bay and South China Sea to the west, Lamon Bay and the Bicol Region to the east, Tayabas Bay and the Sibuyan Sea to the south, and Central Luzon to the north.",
            "It is home to places like Mount Makiling near Los Baños, Laguna, and Taal Volcano in Batangas."
        ],
        [
            "Prior to its creation as a region, Calabarzon, together with the Mimaropa region, the province of Aurora, and several parts of Metro Manila, formed the historical region known as Southern Tagalog, until they were separated in 2002 by virtue of Executive Order No.",
            "103."
        ],
        [
            "The history of the area now known as Calabarzon dates back to early historic times.",
            "Since the Spanish colonial period of the Philippines, the region has served as home to some of the most important Philippine historical figures, including the Philippine national hero, José Rizal, who was born in Calamba."
        ],
        [
            "Etymology"
        ],
        [
            "The name of the region is an acronym of its five component provinces: Cavite, Laguna, Batangas, Rizal and Quezon."
        ],
        [
            "History"
        ],
        [
            "On June 5, 1901, a convention was called on whether or not the province of Manila should annex the province of Morong, which was found to be unable to be self-sufficient as a province.",
            "Eventually, on June 11, Act No.",
            "137 of the First Philippine Commission abolished Morong and created a new province, named after the Philippines' national hero, Jose Rizal, who, coincidentally, was a native of Laguna.",
            "The new province comprised 29 municipalities, 17 from Manila and 12 from Morong.",
            "In 1902, Macario Sakay, a veteran Katipunan member, established the Tagalog Republic in the mountains of Rizal.",
            "Ultimately, Sakay's Tagalog Republic ended in 1906 when he and his men were betrayed under the guise of holding a national assembly aimed at the self-determination of the Filipino people."
        ],
        [
            "On September 7, 1946, the Third Philippine Republic enacted Republic Act No.",
            "14, which renamed the province of Tayabas to Quezon, in honor of Manuel Quezon,"
        ],
        [
            "On September 24, 1972, President Ferdinand Marcos enacted Presidential Decree No.",
            "1, which organized the provinces into 11 regions as part of Marcos' Integrated Reorganization Plan."
        ],
        [
            "On May 17, 2002, President Gloria Macapagal Arroyo signed Executive Order No.",
            "103, which reorganized the Southern Tagalog region.",
            "Due to its size, Region IV was split into two separate regions, Region IV-A (Calabarzon) and Region IV-B (Mimaropa).",
            "Aurora was transferred to Region III, Central Luzon, the province's geographic location;"
        ],
        [
            "Geography"
        ],
        [
            "Main article: Geography of the Philippines"
        ],
        [
            "See also: Cavite § Geography, Laguna § Geography, Batangas § Geography, Rizal (province) § Geography, and Quezon § Geography"
        ],
        [
            "The region is the 12th largest region in the Philippines, with an area of 16,873.31 km2 (6,514.82 sq mi).",
            "The region itself is relatively flat, but also consists of coastal areas and highlands.",
            "It is bordered by Manila Bay in the west, Metro Manila, Bulacan, and Aurora in the north, Lamon Bay and Bicol in the east, and the Isla Verde Passage in the south.",
            "Each province in the region is composed of different environments, ranging from low coastal areas to rugged mountainous ones."
        ],
        [
            "Cavite is characterized by rolling hinterlands punctured by hills, with a shoreline bordering Manila Bay and a rugged portion bordering Batangas near Mount Pico de Loro.",
            "Tagaytay is located in Cavite, bordering Alfonso, Silang, Calamba, and Santa Rosa.",
            "Mount Sungay is the highest peak in the province and can be found in Tagaytay.",
            "There are nine islands in Cavite, most notable of which is the island of Corregidor.",
            "Historically a site of great strategic importance, Corregidor is found at the mouth of Manila Bay and is under the jurisdiction of Cavite City."
        ],
        [
            "Laguna has rugged terrain, with narrow plains near the shores of Laguna de Bay and mountainous ranges further inland.",
            "Laguna de Bay is the largest lake in the Philippines, and is named after the town of Bay.",
            "Laguna is also home to Mount Makiling, a dormant volcano near Los Baños reputed for its mystical properties.",
            "There are also a lot of hot springs near the Makiling area, especially in San Pablo.",
            "Another famous landmark in Laguna are the Pagsanjan Falls, in Cavinti.",
            "The water from the Pagsanjan Falls comes from the Bumbungan River.",
            "Mount Banahaw borders Laguna and Quezon, and is similarly considered to be a holy mountain like Makiling."
        ],
        [
            "Aerial view of the Taal Volcano"
        ],
        [
            "The Batangas area is mostly elevated, with small low flat lands and scattered mountain areas.",
            "Batangas is also home to the Taal Volcano, a complex volcano and one of the 16 Decade Volcanoes.",
            "The Taal Volcano is situated within Taal Lake, making Taal a third-order island, and possibly one of the largest in the world.",
            "Other islands in Batangas are Verde Island, near the Isla Verde Passage, and Fortune Island in Nasugbu.",
            "Batangas borders Cavite via Mount Pico de Loro, known for the views that could be found in its summit.",
            "Mount Macolod and Mount Batulao can also be found in Batangas."
        ],
        [
            "Rizal is situated north of Laguna de Bay, and consists of a mixture of valleys and mountain ranges, with flat low-lying areas in the western portion of the province near Manila.",
            "The eastern portion of Rizal has hills and ridges which form part of the Sierra Madre range.",
            "Talim Island, the largest island in Laguna de Bay, is under the jurisdiction of the province of Rizal."
        ],
        [
            "Quezon province is mountainous, with few plains and swamps, and the tail-end of the Sierra Madre running through it.",
            "Quezon is a narrow province, with the Tayabas Isthmus comprising the southern part of the province and connecting it to the Bicol Peninsula.",
            "The southern part also consists of the Bondoc Peninsula, sandwiched between the Tayabas Bay and Ragay Gulf."
        ],
        [
            "Further information: Mount Maburgos"
        ],
        [
            "The largest islands in Quezon are the Alabat and Polillo islands, which are both located in Lamon Bay, connecting to Calauag Bay of the town of Calauag.",
            "Laguna shares a border with Quezon via Mount Banahaw."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Provinces"
        ],
        [
            "Political map of Calabarzon"
        ],
        [
            "Calabarzon comprises five provinces, 1 highly urbanized city, 21 component cities and 4,019 barangays."
        ],
        [
            "Province or HUC"
        ],
        [
            "Capital"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Cities"
        ],
        [
            "Muni."
        ],
        [
            "Barangay"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            " Batangas"
        ],
        [
            "Batangas City"
        ],
        [
            "18.0%"
        ],
        [
            "2,908,494"
        ],
        [
            "3,115.05"
        ],
        [
            "1,202.73"
        ],
        [
            "930"
        ],
        [
            "2,400"
        ],
        [
            "5"
        ],
        [
            "29"
        ],
        [
            "1,078"
        ],
        [
            " Cavite"
        ],
        [
            "Imus"
        ],
        [
            "26.8%"
        ],
        [
            "4,344,829"
        ],
        [
            "1,526.28"
        ],
        [
            "589.30"
        ],
        [
            "2,800"
        ],
        [
            "7,300"
        ],
        [
            "8"
        ],
        [
            "15"
        ],
        [
            "829"
        ],
        [
            " Laguna"
        ],
        [
            "Santa Cruz"
        ],
        [
            "20.9%"
        ],
        [
            "3,382,193"
        ],
        [
            "1,928.23"
        ],
        [
            "744.49"
        ],
        [
            "1,800"
        ],
        [
            "4,700"
        ],
        [
            "6"
        ],
        [
            "24"
        ],
        [
            "681"
        ],
        [
            " Quezon"
        ],
        [
            "Lucena †"
        ],
        [
            "12.0%"
        ],
        [
            "1,950,459"
        ],
        [
            "8,743.84"
        ],
        [
            "3,376.02"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "1"
        ],
        [
            "39"
        ],
        [
            "1,209"
        ],
        [
            " Rizal"
        ],
        [
            "Antipolo"
        ],
        [
            "20.6%"
        ],
        [
            "3,330,143"
        ],
        [
            "1,182.65"
        ],
        [
            "456.62"
        ],
        [
            "2,800"
        ],
        [
            "7,300"
        ],
        [
            "1"
        ],
        [
            "13"
        ],
        [
            "189"
        ],
        [
            " Lucena"
        ],
        [
            "†"
        ],
        [
            "—"
        ],
        [
            "1.7%"
        ],
        [
            "278,924"
        ],
        [
            "80.21"
        ],
        [
            "30.97"
        ],
        [
            "3,500"
        ],
        [
            "9,100"
        ],
        [
            "1"
        ],
        [
            "—"
        ],
        [
            "33"
        ],
        [
            "Total"
        ],
        [
            "16,195,042"
        ],
        [
            "16,576.26"
        ],
        [
            "6,400.13"
        ],
        [
            "980"
        ],
        [
            "2,500"
        ],
        [
            "21"
        ],
        [
            "122"
        ],
        [
            "4,019"
        ],
        [
            " †  Lucena is a highly urbanized city; figures are excluded from Quezon province."
        ],
        [
            "Governors and vice governors"
        ],
        [
            "Governors and vice governors in Calabarzon"
        ],
        [
            "Province"
        ],
        [
            "Governor"
        ],
        [
            "Vice governor"
        ],
        [
            "Name"
        ],
        [
            "Map"
        ],
        [
            "Image"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "Image"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "  Cavite"
        ],
        [
            "Jonvic Remulla"
        ],
        [
            "NUP"
        ],
        [
            "Athena Tolentino"
        ],
        [
            "NUP"
        ],
        [
            "  Laguna"
        ],
        [
            "Ramil Hernandez"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Katherine Agapay"
        ],
        [
            "PFP"
        ],
        [
            " Batangas"
        ],
        [
            "Hermilando Mandanas"
        ],
        [
            "Mark Leviste"
        ],
        [
            "PDP–Laban"
        ],
        [
            "  Rizal"
        ],
        [
            "Nina Ynares"
        ],
        [
            "NPC"
        ],
        [
            "Reynaldo H. San Juan Jr."
        ],
        [
            "PFP"
        ],
        [
            "  Quezon"
        ],
        [
            "Angelina Tan"
        ],
        [
            "Anacleto A. Alcala III"
        ],
        [
            "NPC"
        ],
        [
            "Cities"
        ],
        [
            "View of the City of Calamba, Laguna"
        ],
        [
            "Calabarzon has 22 cities (21 component cities and 1 highly urbanized city of Lucena) in total, making it the region with the most cities amongst the Luzon regions.",
            "Antipolo is the most populous city in the region, as well as the 6th most populous city of the whole Philippines, while Bacoor and San Pedro is the most densely populated cities in the whole region.",
            "A large section of Calabarzon is considered part of the Greater Manila Area; while Batangas City is the center of the Batangas metropolitan area.",
            "The region has a gross regional product of ₱1.65 trillion (at current prices), which accounts for 17% of the national GDP."
        ],
        [
            "On August 7, 2000, the municipality of Los Baños, Laguna, was declared as a \"Special Science and Nature City of the Philippines\" in recognition of its importance as a center for science and technology, being home to many prestigious educational, environmental and research institutions.",
            "This proclamation does not convert the municipality to a city or give it corporate powers that are accorded to other cities."
        ],
        [
            " †  Regional center"
        ],
        [
            "City"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "City class"
        ],
        [
            "Income class"
        ],
        [
            "Province"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Antipolo"
        ],
        [
            "887,399"
        ],
        [
            "306.10"
        ],
        [
            "118.19"
        ],
        [
            "2,900"
        ],
        [
            "7,500"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Rizal"
        ],
        [
            "Bacoor"
        ],
        [
            "664,625"
        ],
        [
            "46.17"
        ],
        [
            "17.83"
        ],
        [
            "14,000"
        ],
        [
            "36,000"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Cavite"
        ],
        [
            "Batangas City"
        ],
        [
            "351,437"
        ],
        [
            "282.96"
        ],
        [
            "109.25"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Batangas"
        ],
        [
            "Biñan"
        ],
        [
            "407,437"
        ],
        [
            "43.50"
        ],
        [
            "16.80"
        ],
        [
            "9,400"
        ],
        [
            "24,000"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Laguna"
        ],
        [
            "Cabuyao"
        ],
        [
            "355,330"
        ],
        [
            "43.40"
        ],
        [
            "16.76"
        ],
        [
            "8,200"
        ],
        [
            "21,000"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Laguna"
        ],
        [
            "Calaca"
        ],
        [
            "87,361"
        ],
        [
            "114.58"
        ],
        [
            "44.24"
        ],
        [
            "760"
        ],
        [
            "2,000"
        ],
        [
            "Component"
        ],
        [
            "N/A"
        ],
        [
            "Batangas"
        ],
        [
            "† Calamba"
        ],
        [
            "539,671"
        ],
        [
            "149.50"
        ],
        [
            "57.72"
        ],
        [
            "3,600"
        ],
        [
            "9,300"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Laguna"
        ],
        [
            "Carmona"
        ],
        [
            "106,256"
        ],
        [
            "29.68"
        ],
        [
            "11.46"
        ],
        [
            "3,600"
        ],
        [
            "9,300"
        ],
        [
            "Component"
        ],
        [
            "Cavite"
        ],
        [
            "Cavite City"
        ],
        [
            "100,674"
        ],
        [
            "10.89"
        ],
        [
            "4.20"
        ],
        [
            "9,200"
        ],
        [
            "24,000"
        ],
        [
            "Component"
        ],
        [
            "4th"
        ],
        [
            "Cavite"
        ],
        [
            "Dasmariñas"
        ],
        [
            "703,141"
        ],
        [
            "90.13"
        ],
        [
            "34.80"
        ],
        [
            "7,800"
        ],
        [
            "20,000"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Cavite"
        ],
        [
            "General Trias"
        ],
        [
            "450,583"
        ],
        [
            "90.01"
        ],
        [
            "34.75"
        ],
        [
            "5,000"
        ],
        [
            "13,000"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Cavite"
        ],
        [
            "Imus"
        ],
        [
            "496,794"
        ],
        [
            "53.15"
        ],
        [
            "20.52"
        ],
        [
            "9,300"
        ],
        [
            "24,000"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Cavite"
        ],
        [
            "Lipa"
        ],
        [
            "372,931"
        ],
        [
            "209.40"
        ],
        [
            "80.85"
        ],
        [
            "1,800"
        ],
        [
            "4,700"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Batangas"
        ],
        [
            "Lucena"
        ],
        [
            "278,924"
        ],
        [
            "80.21"
        ],
        [
            "30.97"
        ],
        [
            "3,500"
        ],
        [
            "9,100"
        ],
        [
            "Highly Urbanized"
        ],
        [
            "1st"
        ],
        [
            "Quezon"
        ],
        [
            "San Pablo"
        ],
        [
            "285,348"
        ],
        [
            "197.56"
        ],
        [
            "76.28"
        ],
        [
            "1,400"
        ],
        [
            "3,600"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Laguna"
        ],
        [
            "San Pedro"
        ],
        [
            "326,001"
        ],
        [
            "24.05"
        ],
        [
            "9.29"
        ],
        [
            "14,000"
        ],
        [
            "36,000"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Laguna"
        ],
        [
            "Santa Rosa"
        ],
        [
            "414,812"
        ],
        [
            "54.84"
        ],
        [
            "21.17"
        ],
        [
            "7,600"
        ],
        [
            "20,000"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Laguna"
        ],
        [
            "Santo Tomas"
        ],
        [
            "218,500"
        ],
        [
            "95.41"
        ],
        [
            "36.84"
        ],
        [
            "5,900"
        ],
        [
            "15,000"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Batangas"
        ],
        [
            "Tagaytay"
        ],
        [
            "85,330"
        ],
        [
            "65.00"
        ],
        [
            "25.10"
        ],
        [
            "1,300"
        ],
        [
            "3,400"
        ],
        [
            "Component"
        ],
        [
            "2nd"
        ],
        [
            "Cavite"
        ],
        [
            "Tanauan"
        ],
        [
            "193,936"
        ],
        [
            "107.16"
        ],
        [
            "41.37"
        ],
        [
            "1,800"
        ],
        [
            "4,700"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Batangas"
        ],
        [
            "Tayabas"
        ],
        [
            "112,658"
        ],
        [
            "230.95"
        ],
        [
            "89.17"
        ],
        [
            "490"
        ],
        [
            "1,300"
        ],
        [
            "Component"
        ],
        [
            "6th"
        ],
        [
            "Quezon"
        ],
        [
            "Trece Martires"
        ],
        [
            "210,503"
        ],
        [
            "39.10"
        ],
        [
            "15.10"
        ],
        [
            "5,400"
        ],
        [
            "14,000"
        ],
        [
            "Component"
        ],
        [
            "4th"
        ],
        [
            "Cavite"
        ],
        [
            "Notes"
        ],
        [
            "^ Antipolo was declared a \"highly-urbanized city\" by President Benigno Aquino; such proclamation however still needs to be ratified in a plebiscite."
        ],
        [
            "^ Bacoor was declared a \"highly urbanized city\" by President Rodrigo Duterte; such proclamation however still needs to be ratified in a plebiscite."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CalabarzonYearPop.±% p.a.1903 739,776—    1918 962,856+1.77%1939 1,388,269+1.76%1948 1,592,493+1.54%1960 2,316,173+3.17%YearPop.±% p.a.1970 3,356,327+3.77%1975 3,904,174+3.08%1980 4,603,435+3.35%1990 6,349,452+3.27%1995 7,750,204+3.81%YearPop.±% p.a.2000 9,320,629+4.03%2007 11,757,755+3.26%2010 12,609,803+2.58%2015 14,414,774+2.58%2020 16,195,042+2.32%Source: Philippine Statistics Authority"
        ],
        [
            "See also: Demographics of the Philippines"
        ],
        [
            "Calabarzon has a population of 16.1 million people, the largest of all the regions of the Philippines."
        ],
        [
            "A vast majority of people living in Calabarzon are Tagalogs.",
            "It is estimated that around 5.8 million Tagalogs live in Region IV-A.",
            "Taal, in particular, is considered the \"Heartland of Tagalog Culture\" and is currently the \"center\" of the Tagalog culture and people.",
            "Calabarzon is also home to a sizable number of people with Chinese and Spanish ancestry on account of Chinese immigration and Spanish colonization, respectively.",
            "Because of the large majority of Tagalog natives, the majority of people living in Calabarzon speak the Tagalog language.",
            "Filipino, being a version of Tagalog, is predominant in the region, which is spoken as a lingua franca of Tagalog speakers of different dialects.",
            "English is also used in Calabarzon.",
            "In Cavite, Chavacano, a creole language, was once commonly spoken; however, its usage is now in steep decline, and it is now only spoken by a handful of elderly residents in the province.",
            "The other native language spoken in Calabarzon is Hatang Kayi, also named as Sinauna, a Central Luzon language spoken in Tanay, Rizal and General Nakar, Quezon; this is related to Kapampangan and Sambalic languages.",
            "Other native languages spoken in the region are the Manide language in east Quezon and a small portion in north Quezon, the Umiray Dumaget language in north Quezon and a small area in central Quezon,  and the Inagta Alabat language on Alabat Island.",
            "Languages not native in the region are also spoken by minority residents, including Bicolano, Butuanon, Cebuano, various Cordilleran languages, Cuyunon, Hiligaynon, Ilocano (especially in Quezon bordering Aurora), Karay-a, Kapampangan, Lumad (indigenous tribal languages in Mindanao), Surigaonon, Waray, Maguindanaon, Maranao and Tausug."
        ],
        [
            "Religion"
        ],
        [
            "The large majority of the population of Calabarzon are part of a Christian denomination, with the Catholic Church forming the largest proportion with its adherents accounting for 89% of the regional population.",
            "It is then followed up by the Iglesia ni Cristo (3.06%) , Philippine Independent Church (0.066%) and the Jesus is Lord Church (0.4%).",
            "A small Muslim population also exists, accounting for 0.4% of the regional population."
        ],
        [
            "Population by religious affiliation in CALABARZON (2020)"
        ],
        [
            "Affiliation"
        ],
        [
            "Number"
        ],
        [
            "Percentage"
        ],
        [
            "Roman Catholic"
        ],
        [
            "14,390,095"
        ],
        [
            "89.1%"
        ],
        [
            "Iglesia ni Cristo"
        ],
        [
            "494,599"
        ],
        [
            "3.06%"
        ],
        [
            "Philippine Independent Church"
        ],
        [
            "107,210"
        ],
        [
            "0.66%"
        ],
        [
            "Islam"
        ],
        [
            "80,057"
        ],
        [
            "0.50%"
        ],
        [
            "Jesus is Lord Church"
        ],
        [
            "65,036"
        ],
        [
            "0.4%"
        ],
        [
            "Church of Christ"
        ],
        [
            "63,664"
        ],
        [
            "0.39%"
        ],
        [
            "Seventh-day Adventist"
        ],
        [
            "58,949"
        ],
        [
            "0.37%"
        ],
        [
            "Bible Baptist Church"
        ],
        [
            "52,301"
        ],
        [
            "0.32%"
        ],
        [
            "Christian Missions in the Philippines"
        ],
        [
            "45,166"
        ],
        [
            "0.28%"
        ],
        [
            "Jehovah's Witnesses"
        ],
        [
            "45,122"
        ],
        [
            "0.28%"
        ],
        [
            "Other religious affiliations"
        ],
        [
            "737,571"
        ],
        [
            "4.57%"
        ],
        [
            "None"
        ],
        [
            "3,338"
        ],
        [
            "0.02%"
        ],
        [
            "Not reported"
        ],
        [
            "805"
        ],
        [
            "0%"
        ],
        [
            "Total"
        ],
        [
            "16,139,770"
        ],
        [
            "100%"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "^ excluding Catholic Charismatic numbering 13,287 persons (0.08%)"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Calabarzon"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  10.27"
        ],
        [
            "2009  11.92"
        ],
        [
            "2012  10.92"
        ],
        [
            "2015  12.46"
        ],
        [
            "2018  7.15"
        ],
        [
            "2021  7.20"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Calabarzon is the second largest contributor to the national GDP, accounting for 17% of the gross domestic product.",
            "The region boasts a 2.1% inflation rate, lower than the national average of 3%.",
            "The region has a 9.2% unemployment rate which is higher than the national average of 7%.",
            "Calabarzon, much like the rest of the country, is caught in the middle of being an industrial and an agricultural economy."
        ],
        [
            "Due to the region's proximity to Metro Manila, a large amount of urbanization has taken place over the years.",
            "Cavite and Laguna in particular are sites of manufacturing and high-tech industries, with companies like Intel and Panasonic setting up plants in the region.",
            "Santa Rosa, Laguna, is home to a host of semi-conductor and automotive companies such as Amkor and Toyota, while General Trias is home to Cavite's largest economic development zone, the PEC Industrial Park."
        ],
        [
            "The region still has a large agricultural base.",
            "As of 2002, the region had 282,700 farms, covering 588,500 hectares (1,454,000 acres), or 36.3% of the region's total land area.",
            "Cavite alone has almost 70,500 hectares (174,000 acres) of agricultural land.",
            "Laguna is home to the International Rice Research Institute, which can be found within the University of the Philippines Los Baños, whose main goal is to find sustainable ways to help rice farmers.",
            "Batangas, meanwhile, is home to a large pineapple and coconut industry, which is used to make Barong Tagalogs and lambanog.",
            "Quezon is the country's leader in coconut products such as coconut oil and copra.",
            "Quezon's towns such as Tayabas City, Mauban and Infanta are also known producers of commercialized native liqueurs such as lambanog and tuba.",
            "Rizal is known for its piggeries.",
            "Region IV-A's agricultural base, however, is slowly decreasing.",
            "Due to their proximity to large bodies of water, Laguna and Batangas also have sizable fishing industries.",
            "Taal Lake is a large source of fresh water fishes for the country."
        ],
        [
            "Tourism"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Calabarzon\" – news · newspapers · books · scholar · JSTOR (June 2023) (Learn how and when to remove this message)"
        ],
        [
            "Main article: Tourism in the Philippines"
        ],
        [
            "Rizal Shrine in Calamba, Laguna"
        ],
        [
            "Due to the region's history and natural resources, tourism plays a major role in the regional economy.",
            "Cavite and Laguna are homes to various historical sites, such as the Rizal Shrine in Calamba, Pagsanjan for its majestic waterfalls and both Taal Lake and the historic Taal town in Batangas.",
            "Tayabas is known as the City of Festivals, Rest and Recreation Destination of Quezon and famous for lambanog."
        ],
        [
            "The Minor Basilica of Saint Michael Archangel is the religious testaments of the Tayabenses and declared as National Cultural Treasures of the Philippines, the Casa Comunidad de Tayabas, the former office of the then President Manuel Luis Quezon and the place where Hermano Pule was sentenced to death, and the Malagonlong Bridge and the 9 other century-old Spanish arch type and National Cultural Treasure bridges.",
            "Local festivals include the Taytsinoy Festival, Mayohan Festival, Pa'yas Festival Hagisan Festival, Baliskog Festival, Angel Festival, Aguyod Festival and the Turumba Festival every Holy Week."
        ],
        [
            "Lucban is most famous for its annual Pahiyas Festival or locally known as Pahiyas, an event not only visited by local tourists but also by international tourists as well.",
            "Devotees and pilgrims also visit Lucban's Kamay ni Hesus Shrine, which has a 50-foot statue of the Ascending Christ on top of a hill.",
            "Batangas is also famous for its scenic beaches in Nasugbu and Calatagan.",
            "Antipolo is another major tourist spot, found in Rizal.",
            "The region is also home to a multitude of baroque churches."
        ],
        [
            "Infrastructure"
        ],
        [
            "Roads and bridges"
        ],
        [
            "The Laguna Lake Highway, a joint project of DPWH NCR and Region IV-A, is the widening/rehabilitation at Taytay, Rizal segment, a 3.34-kilometer road."
        ],
        [
            "Currently, there are two more bridges being built - Barkadahan Bridge and Napindan Bridge - which will provide additional 2 lanes crossing over Manggahan Floodway and Pasig River, respectively."
        ],
        [
            "References"
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b \"2021 to 2023 Gross Regional Domestic Product (GRDP)\".",
            "openstat.psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ a b c \"Executive Order No.",
            "1 – Dividing Region IV Into Region IV-A and Region IV-B, Transferring the Province of Aurora to Region III and for Other Purposes\".",
            "Official Gazette (Philippines).",
            "Office of the President of the Philippines.",
            "May 17, 2002.",
            "Retrieved May 10, 2023."
        ],
        [
            "^ Sources using Calabarzon and Southern Tagalog interchangeably:"
        ],
        [
            "Nepomuceno, Priam (January 18, 2021).",
            "\"3 NPA fronts in Southern Tagalog dismantled\".",
            "Philippine News Agency.",
            "Retrieved May 10, 2023.",
            "The military has dismantled three New People's Army (NPA) guerrilla fronts in the Southern Tagalog region...",
            "The dismantling of these fronts has put an end to the NPA's terroristic activities in most parts of Region 4-A (Calabarzon)."
        ],
        [
            "\"Malacañang vows probe on deaths of activists in Calabarzon\".",
            "CNN Philippines.",
            "March 8, 2021.",
            "Archived from the original on December 28, 2022.",
            "Retrieved May 10, 2023.",
            "Malacañang assured the public an investigation is underway on the deaths of activists in the Southern Tagalog region...",
            "In his briefing on Monday, Presidential Spokesperson Harry Roque said the government is obligated to probe the killings, which happened during simultaneous police operations in Calabarzon over the weekend."
        ],
        [
            "\"Moderate to heavy rains expected in Metro Manila, Calabarzon\".",
            "ABS-CBN News.",
            "October 22, 2022.",
            "Retrieved May 10, 2023.",
            "Moderate to heavy rains are expected over Metro Manila and southern Tagalog due to the effect of shearline and trough of a low pressure area (LPA)...",
            "In its 11 p.m. weather advisory, PAGASA said moderate to heavy with at times intense rains may persist over Metro Manila and Calabarzon."
        ],
        [
            "^ Andal, Rudy (August 2, 2018).",
            "\"Libong OFWs dumagsa sa DOLE\" .",
            "Pilipino Star Ngayon (in Tagalog).",
            "Retrieved May 10, 2023."
        ],
        [
            "^ a b Census of Population (2020).",
            "Table B - Population and Annual Growth Rates by Province, City, and Municipality - By Region.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ Scott, William Henry (1994).",
            "Barangay: Sixteenth Century Philippine Culture and Society.",
            "Quezon City: Ateneo de Manila University Press.",
            "ISBN 971-550-135-4."
        ],
        [
            "^ Tiongson, Jaime F. (November 29, 2006).",
            "\"Pailah is Pila, Laguna\".",
            "Archived from the original on July 7, 2012.",
            "Retrieved November 18, 2011."
        ],
        [
            "^ Dery, Luis Camara (2001).",
            "A History of the Inarticulate.",
            "Quezon City: New Day Publishers.",
            "ISBN 971-10-1069-0."
        ],
        [
            "^ Go, Bon Juan (2005).",
            "\"Ma'I in Chinese Records - Mindoro or Bai?",
            "An Examination of a Historical Puzzle\".",
            "Philippine Studies.",
            "53 (1).",
            "Ateneo de Manila Press: 119–138.",
            "Archived from the original on October 21, 2013."
        ],
        [
            "^ Star: The mark of Sakay: The vilified hero of our war with America, retrieved March 9, 2013"
        ],
        [
            "^ An Act to Change the Name of the Province of Tayabas to Quezon (Republic Act 14).",
            "September 7, 1946.",
            "Retrieved April 12, 2017."
        ],
        [
            "^ An Act Creating the Subprovince of Aurora, Which Shall Comprise the Municipalities of Baler, Casiguran, Dipaculao and Maria Aurora, Province of Quezon (Republic Act 648).",
            "June 14, 1951.",
            "Retrieved April 12, 2017."
        ],
        [
            "^ Reorginazing the Executive Branch of the National Government (Presidential Decree 1).",
            "September 24, 1972.",
            "Retrieved April 12, 2017.",
            "Archived September 28, 2022, at the Wayback Machine"
        ],
        [
            "^ \"Aurora, Philippines – History\".",
            "www.aurora.ph.",
            "Archived from the original on February 8, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ Designating Calamba City as Regional Center of Region IV-A (Executive Order 246).",
            "October 28, 2003.",
            "Retrieved January 15, 2013.",
            "Archived May 22, 2018, at the Wayback Machine"
        ],
        [
            "^ \"CALABARZON Region and Socio-Economic Profile\".",
            "Department of Environment and Natural Resources.",
            "Archived from the original on May 18, 2017.",
            "Retrieved April 12, 2017."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSGC Interactive; List of Provinces\".",
            "Philippine Statistics Authority.",
            "Archived from the original on January 11, 2013.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ GRDP by Region Archived May 13, 2013, at the Wayback Machine, National Statistical Coordination Board, retrieved March 10, 2013"
        ],
        [
            "^ \"Los Banos, Laguna - Science and Nature City\".",
            "Losbanos.gov.ph.",
            "Retrieved October 29, 2012."
        ],
        [
            "^ \"Information for Prospective Students | University of the Philippines Los Baños\".",
            "Old.uplb.edu.ph.",
            "Archived from the original on November 10, 2012.",
            "Retrieved October 29, 2012."
        ],
        [
            "^ \"Los Baños\".",
            "Laguna Travel Guide.",
            "September 17, 2000.",
            "Archived from the original on December 26, 2013.",
            "Retrieved October 29, 2012."
        ],
        [
            "^ \"PSGC Interactive; List of Cities\".",
            "Philippine Statistics Authority.",
            "Archived from the original on April 29, 2011.",
            "Retrieved March 30, 2016."
        ],
        [
            "^ \"Aquino declares Antipolo as Highly Urbanized City\".",
            "GMA News Online.",
            "April 3, 2011.",
            "Retrieved September 9, 2014."
        ],
        [
            "^ \"Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities\" (PDF).",
            "2010 Census and Housing Population.",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on September 28, 2013.",
            "Retrieved August 9, 2013."
        ],
        [
            "^ Quickstat on Region IVA (CALABARZON) - February 2013 Archived April 14, 2016, at the Wayback Machine, Philippine Statistics Authority, retrieved March 10, 2013"
        ],
        [
            "^ National Commission for Culture and Arts: Tagalog Archived March 29, 2013, at the Wayback Machine, National Commission for Culture and Arts"
        ],
        [
            "^ a b Mapa, Dennis S. (February 22, 2023).",
            "\"Religious Affiliation in the Philippines (2020 Census of Population and Housing)\".",
            "Philippine Statistics Authority (Press release).",
            "Archived from the original on March 10, 2023.",
            "Retrieved March 12, 2023."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ A Review of the Agriculture Sector in CALABARZON Archived April 10, 2016, at the Wayback Machine Philippine Statistics Authority, Retrieved March 11, 2013"
        ],
        [
            "^ \"Fact-checking Calamba's History\".",
            "ptvnews.ph.",
            "Retrieved July 24, 2018."
        ],
        [
            "^ \"Cavite: The next culinary destination - The Manila Times Online\".",
            "www.manilatimes.net.",
            "June 29, 2018.",
            "Retrieved July 24, 2018."
        ],
        [
            "^ \"President Duterte leads Aguinaldo Shrine Independence Day rites\".",
            "Retrieved July 24, 2018."
        ],
        [
            "^ \"Flag City gets glass store upgrade\".",
            "BusinessMirror.",
            "Retrieved July 24, 2018."
        ],
        [
            "^ Cinco, Maricar.",
            "\"San Pablo wakes up to 7-lakes challenge\".",
            "Retrieved July 24, 2018."
        ],
        [
            "^ Mallari, Delfin Jr. (March 31, 2018).",
            "\"3 million devotees, pilgrims visit Kamay ni Hesus Shrine in Lucban\".",
            "Inquirer.net.",
            "Inquirer Interactive Inc. Archived from the original on June 24, 2023.",
            "Retrieved June 25, 2023."
        ],
        [
            "^ \"Laguna Lake Highway\".",
            "Archived from the original on June 20, 2022.",
            "Retrieved August 7, 2019."
        ],
        [
            "External links"
        ],
        [
            " Media related to Calabarzon at Wikimedia Commons"
        ],
        [
            " Calabarzon travel guide from Wikivoyage"
        ],
        [
            " Geographic data related to Calabarzon at OpenStreetMap"
        ],
        [
            "Places adjacent to Calabarzon"
        ],
        [
            "Central Luzon / Manila Bay"
        ],
        [
            "Metro Manila / Central Luzon"
        ],
        [
            "South China Sea"
        ],
        [
            "Calabarzon"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Verde Island Passage / Tayabas Bay / Sibuyan SeaMimaropa"
        ],
        [
            "Bicol Region"
        ],
        [
            "vteCalabarzon (Region IV-A)CAvite, LAguna, BAtangas, Rizal, QueZONRegional center"
        ],
        [
            "Calamba"
        ],
        [
            "Provinces"
        ],
        [
            "Batangas"
        ],
        [
            "Cavite"
        ],
        [
            "Laguna"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Lucena"
        ],
        [
            "Component cities"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Batangas City"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "Calaca"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Lipa"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tanauan"
        ],
        [
            "Tayabas"
        ],
        [
            "Trece Martires"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Antipolo"
        ],
        [
            "Batangas City"
        ],
        [
            "Imus (de jure)"
        ],
        [
            "Lucena"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Trece Martires (de facto)"
        ],
        [
            "Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alabat"
        ],
        [
            "Alaminos"
        ],
        [
            "Alfonso"
        ],
        [
            "Alitagtag"
        ],
        [
            "Amadeo"
        ],
        [
            "Angono"
        ],
        [
            "Atimonan"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Baras"
        ],
        [
            "Bauan"
        ],
        [
            "Bay"
        ],
        [
            "Binangonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Cainta"
        ],
        [
            "Calatagan"
        ],
        [
            "Calauag"
        ],
        [
            "Calauan"
        ],
        [
            "Candelaria"
        ],
        [
            "Cardona"
        ],
        [
            "Catanauan"
        ],
        [
            "Cavinti"
        ],
        [
            "Cuenca"
        ],
        [
            "Dolores"
        ],
        [
            "Famy"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Luna"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Ibaan"
        ],
        [
            "Indang"
        ],
        [
            "Infanta"
        ],
        [
            "Jalajala"
        ],
        [
            "Jomalig"
        ],
        [
            "Kalayaan"
        ],
        [
            "Kawit"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Liliw"
        ],
        [
            "Lobo"
        ],
        [
            "Lopez"
        ],
        [
            "Los Baños"
        ],
        [
            "Lucban"
        ],
        [
            "Luisiana"
        ],
        [
            "Lumban"
        ],
        [
            "Mabini"
        ],
        [
            "Mabitac"
        ],
        [
            "Macalelon"
        ],
        [
            "Magallanes"
        ],
        [
            "Magdalena"
        ],
        [
            "Majayjay"
        ],
        [
            "Malvar"
        ],
        [
            "Maragondon"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Mauban"
        ],
        [
            "Mendez"
        ],
        [
            "Morong"
        ],
        [
            "Mulanay"
        ],
        [
            "Nagcarlan"
        ],
        [
            "Naic"
        ],
        [
            "Nasugbu"
        ],
        [
            "Noveleta"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Paete"
        ],
        [
            "Pagbilao"
        ],
        [
            "Pagsanjan"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pila"
        ],
        [
            "Pililla"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Rizal"
        ],
        [
            "Rodriguez"
        ],
        [
            "Rosario (Batangas)"
        ],
        [
            "Rosario (Cavite)"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Mateo"
        ],
        [
            "San Narciso"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Sariaya"
        ],
        [
            "Silang"
        ],
        [
            "Siniloan"
        ],
        [
            "Taal"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Talisay"
        ],
        [
            "Tanay"
        ],
        [
            "Tanza"
        ],
        [
            "Taysan"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Ternate"
        ],
        [
            "Tiaong"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "Unisan"
        ],
        [
            "Victoria"
        ],
        [
            "Barangays"
        ],
        [
            "Batangas (List)"
        ],
        [
            "Cavite (List)"
        ],
        [
            "Laguna (List)"
        ],
        [
            "Quezon (List)"
        ],
        [
            "Rizal (List)"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vteRegions of the PhilippinesLuzon"
        ],
        [
            "NCR – National Capital Region"
        ],
        [
            "CAR – Cordillera Administrative Region"
        ],
        [
            "I – Ilocos Region"
        ],
        [
            "II – Cagayan Valley"
        ],
        [
            "III – Central Luzon"
        ],
        [
            "IV-A – Calabarzon"
        ],
        [
            "Mimaropa – Southwestern Tagalog Region"
        ],
        [
            "V – Bicol Region"
        ],
        [
            "Visayas"
        ],
        [
            "VI – Western Visayas"
        ],
        [
            "NIR – Negros Island Region"
        ],
        [
            "VII – Central Visayas"
        ],
        [
            "VIII – Eastern Visayas"
        ],
        [
            "Mindanao"
        ],
        [
            "IX – Zamboanga Peninsula"
        ],
        [
            "X – Northern Mindanao"
        ],
        [
            "XI – Davao Region"
        ],
        [
            "XII – Soccsksargen"
        ],
        [
            "XIII – Caraga Region"
        ],
        [
            "BARMM – Bangsamoro Autonomous Region in Muslim Mindanao"
        ],
        [
            "Former regions"
        ],
        [
            "ARMM – Autonomous Region in Muslim Mindanao"
        ],
        [
            "IV – Southern Tagalog"
        ],
        [
            "Authority control databases International"
        ],
        [
            "FAST"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Calabarzon&oldid=1232888654\""
        ],
        [
            "Categories: CalabarzonRegions of the PhilippinesLuzonHidden categories: Pages using gadget WikiMiniAtlasCS1 Tagalog-language sources (tl)Webarchive template wayback linksArticles with short descriptionShort description matches WikidataUse Philippine English from June 2020All Wikipedia articles written in Philippine EnglishUse mdy dates from May 2023Short description is different from WikidataPages using multiple image with auto scaled imagesCoordinates on WikidataPages with Tagalog IPAArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from February 2017Articles with unsourced statements from January 2023Articles needing additional references from June 2023All articles needing additional referencesCommons category link from WikidataArticles with FAST identifiersArticles with VIAF identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}