{
    "name": "Caraga",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Caraga"
        ],
        [
            "43 languages"
        ],
        [
            "العربية閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoChavacano de ZamboangaDeutschEspañolEsperantoEuskaraFrançais한국어हिन्दीHrvatskiIlokanoItalianoKapampanganქართულიLatinaLatviešuLietuviųМакедонскиBahasa MelayuNederlands日本語Norsk bokmålOccitanPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยУкраїнськаاردوTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°55′N 125°30′E﻿ / ﻿8.92°N 125.5°E﻿ / 8.92; 125.5"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Administrative region of the Philippines"
        ],
        [
            "For the municipality in the province of Davao Oriental, see Caraga, Davao Oriental."
        ],
        [
            "Region in Mindanao, PhilippinesCaraga"
        ],
        [
            "Region XIIIRegionCaraga Administrative Region"
        ],
        [
            "From top, left to right: A naked beach in Siargao Island; Tinuy-an Falls; Rice Corn and Flower Festival in Bayugan; Macapagal Bridge in Butuan; A lagoon in Libjo; Hinatuan Enchanted RiverLocation in the PhilippinesOpenStreetMapCoordinates: 8°55′N 125°30′E﻿ / ﻿8.92°N 125.5°E﻿ / 8.92; 125.5CountryPhilippinesIsland groupMindanaoRegional centerand largest cityButuanArea • Total21,478.35 km2 (8,292.84 sq mi)Highest elevation (Mount Hilong-hilong)2,012 m (6,601 ft)Population (2020 census) • Total2,804,788 • Density130/km2 (340/sq mi)Time zoneUTC+8 (PST)ISO 3166 codePH-13Provinces"
        ],
        [
            "5"
        ],
        [
            " Agusan del Norte"
        ],
        [
            " Agusan del Sur"
        ],
        [
            " Dinagat Islands"
        ],
        [
            " Surigao del Norte"
        ],
        [
            " Surigao del Sur"
        ],
        [
            "Cities"
        ],
        [
            "6"
        ],
        [
            " Bayugan"
        ],
        [
            " Bislig"
        ],
        [
            " Butuan"
        ],
        [
            " Cabadbaran"
        ],
        [
            " Surigao City"
        ],
        [
            " Tandag"
        ],
        [
            "Municipalities67Barangays1,311Cong.",
            "districts7LanguagesCebuanoSurigaononButuanonKamayoManoboTagalogEnglishother minority languagesGDP (2023)₱406.45 billion$7.31 billionHDI 0.698 (Medium)HDI rank9th in the Philippines (2019)"
        ],
        [
            "Caraga, officially the Caraga Administrative Region six cities: Bayugan, Bislig, Butuan, Cabadbaran, Surigao and Tandag; 67 municipalities and 1,311 barangays.",
            "Butuan, the most urbanized city in Caraga, serves as the regional administrative center."
        ],
        [
            "Etymology"
        ],
        [
            "Caraga is named after the Kalagan people (Spanish \"Caragan\"), a Mansakan subgroup (related to Visayans) native to the regions of Davao and parts of Caraga who speak the Kalagan languages.",
            "The name itself is from kalagan (literally \""
        ],
        [
            "History"
        ],
        [
            "During pre-colonial times, the Rajahnate of Butuan ruled in what is now Agusan del Norte and Butuan.",
            "It had much influence on all of Caraga, portions of northern Mindanao, and the western side of Bohol.",
            "According to records, Butuan was in conflict with the Sultanate of Ternate in present-day Moluccas of Indonesia.",
            "The Ternateans would attack and ransack Butuan and its wealth, but Butuan always prevailed.",
            "Butuan had friendly relations with the Rajahnate of Cebu which it considered an ally.",
            "It became a powerful Hindu state much known for its goldsmithing and boat-making.",
            "Its people used gigantic boats known as balangay which carried numerous men.",
            "Relics of these gold crafts and giant boats have been unearthed and preserved by the National Museum of the Philippines and other museums.",
            "Butuan also had cordial relations with the Kingdom of Champa in what is now central Vietnam.",
            "The Butuan people managed to cross the Sulu Sea and the South China Sea to reach Champa for trade.",
            "While the Rajahnate of Butuan was at large, the indigenous lumads of the inner sections of Caraga were free and had their own highly advanced democratic societies, known for their knowledge of nature, medicine, mythology, and warfare.",
            "Chinese traders eventually came into Butuan and the Sino-Butuan trade became the focal point of Champa-Butuan relations, where the two nations competed against one another for better trade with the Chinese.",
            "Eventually, Butuan started to weaken due to massive attacks from Ternate.",
            "Cebu was unable to help at the time because it was also being attacked by Ternate.",
            "Likewise, the Kedatuan of Dapitan in Bohol, \"The Venice of the Visayas\", was also destroyed by an attack from Ternate."
        ],
        [
            "Rajah Siawi and Rajah Kulambo, members of the nobility of the Surigaonon and Butuanon people, respectively, were encountered by the Magellan expedition in 1521 on the island of Limasawa (a hunting ground for the rulers).",
            "Antonio Pigafetta describes them as tattooed and covered in gold ornaments.",
            "Pigafetta also records the name of the Surigao region as \"Calagan\".",
            "He also describes the \"balanghai\" (balangay) warships they sailed.",
            ": 141–142"
        ],
        [
            "When the Spaniards returned and subjugated the Rajahante of Butuan, already weak due to tensions with the Sultanate of Ternate, the boat-making and goldsmithing traditions were eradicated and relations between coastal Butuan and the lumads of the interior became less known.",
            "The lumads of the interior were also converted to Christianity, which diminished some of their traditions on nature worship.",
            "The Spanish attacked the Sultanate of Ternate to negate any future attacks on Caraga, in which they succeeded, due to their much greater firepower.",
            "With the Spaniards having full control of Caraga, they started establishing Spanish-modeled centers to maximize their coverage and control over the territory, in which they succeeded.",
            "The Spaniards ruled the country until the United States defeated them in the Spanish-American War which led to the entire archipelago falling into American hands."
        ],
        [
            "The \"Kalagan\", called \"Caragan\" by the Spaniards, occurred in the two provinces of Surigao, the northern part of Davao Oriental and eastern Misamis Oriental.",
            "In 1635, Caraga was fortified by 45 additional Spanish soldiers and household heads from Mexico, in 1670 a further 81 soldiers, and in 1672 still another 81."
        ],
        [
            "In the early years of the Caraga Region, its inhabitants reportedly came from mainland Asia, followed by Malayans, Arabs, Chinese, Japanese, Spanish and Americans.",
            "Migrants from the Visayan and Luzon provinces later settled in the area.",
            "Most of its inhabitants speak Cebuano and live in rural areas."
        ],
        [
            "On February 23, 1995, the Caraga Region was created through Republic Act No.",
            "7901 in the administration of President Fidel Ramos.",
            "The creation of Caraga Region is the revival of the Spanish province of the same name.",
            "The provinces of Agusan del Norte, Agusan del Sur and Surigao del Norte (of the former Northern Mindanao region) and Surigao del Sur (of the former Southern Mindanao region) were annexed as part of the newly created region."
        ],
        [
            "Geography"
        ],
        [
            "Caraga Region, situated in the northeast section of Mindanao, is between 8 00' to 10 30' N. latitude and 125 15' to 126 30' E. longitude.",
            "It is bounded on the north by the Bohol Sea; on the south by the provinces of Davao del Norte, Davao de Oro and Davao Oriental of Region XI; on the west by Bukidnon and Misamis Oriental of Region X; and on the east by the Philippine Sea of the Pacific Ocean."
        ],
        [
            "The region has a total land area of 18,846.97 square kilometres (7,276.86 sq mi), representing 6.3% of the country's total land area and 18.5% of the island of Mindanao.",
            "47.6% of the total land area of the region belongs to the province of Agusan del Sur.",
            "Of the total land area, 71.22% is forestland and 28.78% is alienable and disposable land.",
            "Major land uses include forestland comprising 31.36% and 23.98% of agricultural and open spaces."
        ],
        [
            "Topography"
        ],
        [
            "The region is characterized by mountainous areas, flat and rolling lands.",
            "Mountain ranges divide Agusan and Surigao provinces and sub-ranges separate most of the lowlands along the Pacific coast.",
            "The most productive agricultural area of the region lies along the Agusan River Basin.",
            "The well-known Agusan Marsh sits in the middle of Agusan del Sur.",
            "Among the lakes in the region, Lake Mainit is the widest.",
            "It traverses eight municipalities: Alegria, Tubod, Mainit and Sison in Surigao del Norte, and Tubay, Santiago, Jabonga and Kitcharao in Agusan del Norte."
        ],
        [
            "Climate"
        ],
        [
            "Caraga Region has Type II climate, with no pronounced wet and dry season.",
            "During the months of November to February, heavy rains are usually experienced in the region."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Map of Caraga"
        ],
        [
            "Provinces"
        ],
        [
            "Caraga comprises 5 provinces, 1 highly urbanized city, 5 component cities, 67 municipalities, and 1,311 barangays."
        ],
        [
            " †  Regional center"
        ],
        [
            "Province or HUC"
        ],
        [
            "Capital"
        ],
        [
            "Population (2015)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Cities"
        ],
        [
            "Muni."
        ],
        [
            "Barangay"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Cabadbaran City"
        ],
        [
            "12.1%"
        ],
        [
            "354,503"
        ],
        [
            "2,730.24"
        ],
        [
            "1,054.15"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "1"
        ],
        [
            "10"
        ],
        [
            "167"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Prosperidad"
        ],
        [
            "23.9%"
        ],
        [
            "700,653"
        ],
        [
            "9,989.52"
        ],
        [
            "3,856.98"
        ],
        [
            "70"
        ],
        [
            "180"
        ],
        [
            "1"
        ],
        [
            "13"
        ],
        [
            "314"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "San Jose"
        ],
        [
            "4.3%"
        ],
        [
            "127,152"
        ],
        [
            "1,036.34"
        ],
        [
            "400.13"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "0"
        ],
        [
            "7"
        ],
        [
            "100"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao City"
        ],
        [
            "16.5%"
        ],
        [
            "485,088"
        ],
        [
            "1,972.93"
        ],
        [
            "761.75"
        ],
        [
            "250"
        ],
        [
            "650"
        ],
        [
            "1"
        ],
        [
            "20"
        ],
        [
            "335"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tandag"
        ],
        [
            "20.2%"
        ],
        [
            "592,250"
        ],
        [
            "4,932.70"
        ],
        [
            "1,904.53"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "2"
        ],
        [
            "17"
        ],
        [
            "309"
        ],
        [
            "† Butuan"
        ],
        [
            "11.5%"
        ],
        [
            "337,063"
        ],
        [
            "816.62"
        ],
        [
            "315.30"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "86"
        ],
        [
            "Total"
        ],
        [
            "2,596,709"
        ],
        [
            "22,294.97"
        ],
        [
            "8,608.14"
        ],
        [
            "120"
        ],
        [
            "340"
        ],
        [
            "6"
        ],
        [
            "67"
        ],
        [
            "1,311"
        ],
        [
            " †  Butuan is a highly urbanized city; figures are excluded from Agusan del Norte."
        ],
        [
            "Governors and vice governors"
        ],
        [
            "Province"
        ],
        [
            "Image"
        ],
        [
            "Governor"
        ],
        [
            "Political Party"
        ],
        [
            "Vice Governor"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Angelica Amante"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Rico Corvera"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Santiago Cane Jr."
        ],
        [
            "NUP"
        ],
        [
            "Samuel Tortor"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Nilo Demerey Jr."
        ],
        [
            "Lakas"
        ],
        [
            "Benglen Ecleo"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Robert Lyndon Barbers"
        ],
        [
            "Nacionalista"
        ],
        [
            "Eddie Gokiangkee Jr."
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Alexander Pimentel"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Manuel Alameda"
        ],
        [
            "Demography"
        ],
        [
            "Population census of CaragaYearPop.±% p.a.1903 115,112—    1918 166,904+2.51%1939 324,918+3.22%1948 391,400+2.09%1960 631,007+4.06%1970 950,129+4.17%1975 1,114,336+3.25%1980 1,371,512+4.24%1990 1,764,297+2.55%1995 1,942,687+1.82%2000 2,095,367+1.64%2007 2,293,346+1.25%2010 2,429,224+2.12%2015 2,596,709+1.28%2020 2,804,788+1.53%Source: Philippine Statistics Authority"
        ],
        [
            "Based on the 2020 census, the total population of the region was 2,933,772.",
            "The annual growth rate over this period was over 20%.",
            "Among the five provinces, Agusan del Sur registered the largest population at 700,653, and Dinagat Islands was the smallest at 127,152.",
            "Surigao del Norte was the fastest growing province with an annual average growth rate of 1.76% over the last five years, while Dinagat Islands was the slowest at 0.05% over the same period."
        ],
        [
            "Butuan and Surigao cities had total populations of 337,063 and 154,137, respectively.",
            "Butuan recorded an annual growth rate of 1.62% in the period 2010–2015."
        ],
        [
            "Language"
        ],
        [
            "Nuestra Senora del Rosario Parish in Magallanes"
        ],
        [
            "Cebuano is spoken by 33.79% of the households in the region, the language serves as a lingua franca of the region, making it the second language of the majority of residents.",
            "Surigaonon is spoken by 33.21% of households, followed by Butuanon with 15%; Kamayo, 7.06%, and Manobo, 4.73%.",
            "The rest speak a Boholano dialect of Cebuano, 5.87%; Hiligaynon,  2.87%; and other languages and dialects, 7.20%–these include Ilocano, Kapampangan, Maranao, Maguindanaon and Tausug languages."
        ],
        [
            "Religion"
        ],
        [
            "The dominant religion in the region is Roman Catholic, with 74% of the total household population in Caraga.",
            "Significant religious minorities include Protestants that constitute 20% of the total household population and Aglipayan that constitute 6% of the total household population."
        ],
        [
            "Cultural groups"
        ],
        [
            "The majority of the inhabitants of the region are of Visayan heritage.",
            "They are mostly descended from settlers from Cebu, Bohol, Siquijor and Negros Oriental.",
            "The province is home to several minority groups, totaling 675,722 in 1995, representing 34.7% of the region's population.",
            "Most numerous were the Manobos with 294,284 or 43.55% of the ethnic minorities.",
            "Other cultural groups in the region with significant populations were the Kamayos, Higaonons, Banwaons, Umayamnons, Kalagans, and Mamanwas.",
            "Other significant minority residents in the province include:"
        ],
        [
            "Ilocanos"
        ],
        [
            "Hiligaynons"
        ],
        [
            "Kapampangans"
        ],
        [
            "Bicolanos"
        ],
        [
            "Pangasinans"
        ],
        [
            "Warays"
        ],
        [
            "Maranaos"
        ],
        [
            "Maguindanaons"
        ],
        [
            "Tausugs"
        ],
        [
            "Most members of these cultural groups reside in the province of Agusan del Sur."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Caraga"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  49.24"
        ],
        [
            "2009  54.35"
        ],
        [
            "2012  40.33"
        ],
        [
            "2015  39.65"
        ],
        [
            "2018  30.54"
        ],
        [
            "2021  25.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "From 2001 to 2003, Caraga Region consistently maintained its performance vis-à-vis other regions in Mindanao.",
            "Caraga posted a 0.9% growth rate compared to the 9.5% growth rate of Region 12 and the 2.6% growth rate of the Autonomous Region for Muslim Mindanao (ARMM).",
            "Caraga's growth rate in 2001–2002 and the 2002–2003 period was the same (0.9%).",
            "This was much less than the growth of the population.",
            "This performance was better however than the region's performance in the 2000–2001 period, where the region's economy declined by 1.4%."
        ],
        [
            "The region's contribution to Mindanao's domestic product is 7.58% in 2003.",
            "Caraga has the second lowest per capital income among Mindanao regions and nationwide.",
            "In 2003, the region accounted for 1.35% of the country's GNP."
        ],
        [
            "Poverty rate"
        ],
        [
            "Poverty in the region decreased by 1.7% from 44.7% in 1997 to 42.9% in 2000.",
            "Another positive development is the increase in the regional annual family income based on the 1997 and 2000 Family Income and Expenditure Survey, which increased by 13.65% from ₱71,7126.00 in 1997 to ₱81,519.00 in 2000.",
            "Regional annual family expenditures also posted a 16.65% increase, from ₱61,815.00 in 1997 to ₱72,108.00 in 2000.",
            "The average annual savings slipped by 5% from ₱9,911.00 to ₱9,411.00.",
            "Poverty incidence data for 2003 is not yet available."
        ],
        [
            "On a national and Mindanao-wide perspective, Caraga Region is one of the most impoverished regions in the country.",
            "The region has the fourth highest poverty incidence level of families among all the regions in the country for years 1997 and 2000 while among Mindanao regions, Caraga has the third highest poverty incidence (in terms of incidence of families)."
        ],
        [
            "Gross regional domestic product (GRDP)"
        ],
        [
            "Downtown Butuan"
        ],
        [
            "The region performed fairly well in terms of regional output contributing 8.01% in 1998, 8.25% in 1999 and 8.29% in 2000 to the Mindanao GRDP.",
            "The region contributed 1.44% in 1998, 1.48% in 1999 and 1.50% in 2000, to the Philippine economy.",
            "In terms of growth rate, the region accelerated faster and outpaced the other regions in Mindanao from 1998 to 2000, except for the Southern Mindanao Region which posted a 6.06% increase in 1999–2000.",
            "Caraga Region recorded a 5.42% increase during the same period."
        ],
        [
            "GRDP in 2000 amounted to P14.336 billion as against the 1999 performance of P13.599 billion.",
            "The deceleration of the region's economy from 6.03% in 1999 to 5.42% in 2000 was attributed to the slowdown of the agriculture, fishery and forestry (AFF) and services sectors.",
            "The improved performance of the Industry sector, from 5.69% in 1999 to 6.69% in 2000, cushioned the effects of what could have been a slowdown of the region's economy."
        ],
        [
            "From the 1.4% decrease in the GRDP in 2000–2001, the GRDP bounced back in 2001–2002 by a 0.9% growth.",
            "The positive trend was maintained in 2002–2003, with the region's GRDP growing by 0.9%, the same growth rate from the previous year."
        ],
        [
            "The agriculture, fishery and forestry (AFF) sector is Caraga's banner economic sector, exhibiting an increasing growth trend of 3.8% and 6.8% growth rates in 2001 and 2003 respectively.",
            "Despite the decreasing growth trend of the agriculture and fishery subsectors, the sizeable growth rate of the forestry subsector more than compensated for the decrease.",
            "The forestry subsector grew by 36.3% in 2003, the highest growth rate for any subsector in the region.",
            "Caraga Region has the highest GVA in the forestry subsector among all regions in the Philippines."
        ],
        [
            "The services sector is also one of the bright spots in the region's economy.",
            "After experiencing a decelerated growth rate in 2002 compared to the previous year's 6.1% growth rate, the sector bounced back in 2003 with a 5.6% growth rate.",
            "Moreover, the trade subsector continued to be the dominant subsector posting a 5.6%, 6.6% and 6.3% growth rate in 2001 to 2003 respectively.",
            "It is significant to note that all the subsectors posted positive growth rates in 2001 and 2003.",
            "The transportation, communication and storage sub-sector posted the highest growth rate of 8.4% among the sub-sectors in the services sector."
        ],
        [
            "The industry sector was the worst performing sector of the regional economy with a continuous decline from 2001 to 2003.",
            "Although the sector's slide slightly decelerated in 2002 (-6.7% in 2002 from -13.3% decline in 2001), it contracted by -12.1% in 2003.",
            "The construction subsector had the largest decline of 16.6%, 11.3% and 33.5% in 2001, 2002 and 2003 respectively.",
            "The mining subsector also posted negative growth rates but the decreasing trend in this subsector decelerated.",
            "The manufacturing offset the decrease in the two sub-sectors by growing at 8.9% in 2003, making it the biggest contributor to this sector.",
            "Even with the negative performance of the mining and quarrying sector, Caraga was the second highest producer of metallic minerals, with metallic mineral productions valued at PhP 1.25 billion in 2001 (Philippine Yearbook, 2003)."
        ],
        [
            "Exports and investments"
        ],
        [
            "SM City Butuan, the first SM Mall in the region"
        ],
        [
            "Investments in the region fell by 25.4% from PhP 6.3 billion in 2002 to PhP 4.6 billion in 2003.",
            "All provinces in the region posted a negative growth rate in investments, with Agusan del Sur posting the biggest year-on-year decline of 62.6% for the 2002–2003 period.",
            "Agusan del Norte's percentage share on investments increased from 64.8% to 79.5% despite an 8.5% decline.",
            "Per advice of the Department of Trade and Industry (DTI)-Caraga office, the data on investments are partial at best and is not reflective of the whole investment level in the region.",
            "DTI Caraga's data does not include public investment figures."
        ],
        [
            "Exports decreased by 19.08% in the 2000–2001 period and 57.52% in 2001–2002.",
            "Agusan Norte, Surigao Norte and Surigao Sur posted negative growth rates in the 2000–2001 period, with Surigao Sur posting the biggest decrease in exports (81.31%).",
            "In 2002, Agusan Norte posted an impressive 741.04% increase in exports, a harbinger of increased economic activity in the province.",
            "Surigao Norte posted the biggest decrease in exports for 2002 (63.17%)."
        ],
        [
            "In 2000, the region contributed 1.87% to Mindanao's exports; this expanded to 2.68% in 2001 only to decrease to 0.77% in 2002."
        ],
        [
            "Natural resources"
        ],
        [
            "The region is noted for its wood-based economy, its extensive water resources and its rich mineral deposits such as iron, gold, silver, nickel, chromite, manganese and copper.",
            "Its leading crops are palay (rice), banana and coconut."
        ],
        [
            "The region features several beaches, abundant seafood, hot and cold springs, evergreen forests and balmy weather.",
            "Caraga's most famous attraction today is Siargao Island, a surfing destination in Dinagat Islands."
        ],
        [
            "Major products"
        ],
        [
            "Major agricultural products of the region include palay, corn, coconut, gold, banana, rubber, oil palm, calamansi, prawns, milkfish, crabs, seaweeds and mango.",
            "Caraga's proximity to Cebu and Manila makes it a favorable shipping point for products to and from these markets.",
            "Nasipit Port can serve as a secondary shipping hub to Cagayan de Oro when traffic volume from other points in Mindanao increases.",
            "With a roll-on, roll-off (RORO) ferry service now in place, Surigao City serves as a vital transportation link for trucks and buses bound for Luzon."
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "gold mining, rice, coconut, and bananas"
        ],
        [
            "Palm oil, coconut, and rice"
        ],
        [
            "Ironwood, nickeliferous laterite ore, gold, chromite, lode ore, and laterite ore; limestone, silica deposits, guano, rock phosphate, sand, and gravel; chromate; Marlin, tuna, lapu-lapu, mollusks, crabs, even squid, stingrays, and octopuses"
        ],
        [
            "palay, corn, coconut, abaca, soybeans, coffee, and other high value crops; prawns, milkfish, and crabs; are Narra, red and white Lauan, Mayapis, Almon, Apitong, Yakal, Bagtikan, Tanguile, Rattan and Bonbon"
        ],
        [
            "seafood, coconut and other lumber products, mines"
        ],
        [
            "Environment and Wildlife"
        ],
        [
            "Agusan River in Butuan"
        ],
        [
            "The region contains one of the last ecological frontiers of the Philippines.",
            "It is home to 12 Key Biodiversity Areas identified by Haribon Foundation and the Philippine Department of Environment and Natural Resources.",
            "The Key Biodiversity Areas include: Mt.",
            "Kambinliw and Mt.",
            "Redondo in Dinagat Islands which is home to the critically endangered Dinagat bushy-tailed cloud rat which was recently rediscovered after decades of disappearance, the endangered Dinagat hairy-tailed rat, Dinagat Gymnure which has been declared by the EDGE Species Programme of the Zoological Society of London as one of the top 100 most evolutionary distinct and globally endangered species in the world, and a strange sub-species of the Philippine Tarsier which is unusually larger and darker in color than the common Philippine tarsier; Siargao Island Protected Landscape and Seascape in Surigao del Norte which is the surfing capital of the country; Carrascal Bay in Surigao del Sur; Consuelo and General Islands in Surigao del Sur; Mt.",
            "Hilong-hilong which is shared by Agusan del Norte, Agusan del Sur, Surigao del Norte, and Surigao del Sur and is regarded as one of the most expansive home of the critically endangered Philippine Eagle; Magsaysay in Agusan del Norte; Mt.",
            "Kaluayan-Mt.",
            "Kinabalian which is shared between Agusan del Sur and Northern Mindanao's Bukidnon province; Cagwait in Surigao del Sur; Mt.",
            "Diwata Range which is shared between Agusan del Sur and Surigao del Sur and is a focal point in the West Mindanao Ecological Frontier; Hinatuan Bay in Surigao del Sur which is famous for its Hinatuan Enchanted River; Bislig Rainforest between Agusan del Sur and Surigao del Sur; and Agusan Marsh Wildlife Sanctuary in Agusan del Sur which is part of the UNESCO Tentative List"
        ],
        [
            "Tourism"
        ],
        [
            "This section is written like a travel guide.",
            "Please help improve the section by introducing an encyclopedic style or move the content to Wikivoyage.",
            "(February 2017)"
        ],
        [
            "Surfing"
        ],
        [
            "Siargao, popularly known as the \"surfing capital of the Philippines\", hosts an annual international surfing event.",
            "The huge \"pacific rollers\" have been ranked among the top five breaks in the world, including the \"Cloud Nine\" considered one of the world's top surfing waves.",
            "Other breaks, which offer exploratory surfing without crowds, are found in the towns of Cantilan, Tandag and Lanuza."
        ],
        [
            "Islands"
        ],
        [
            "The islets and islands of Guyam, Daku, Naked or Pansukian, La Janosa, Pig-ot, Dinagat, Bucas Grande, Britania and the General Island in Cantilan feature white-sand beaches which are ringed by coral reefs suitable for swimming and snorkeling."
        ],
        [
            "Other attractions include naturally-carved water channels amidst mangrove forests in Barangay Manjagao; the floating village of Barangay Dayasan, the Buenavista Cave; and the tropical white sand beaches in Sagisi island.",
            "The Britania in San Agustin-Surigao del Sur features 25 islets and islands of white sand and clusters of limestone hills."
        ],
        [
            "Mountain-biking"
        ],
        [
            "Biking trails within Kawas, Alabel City, Surigao del Sur, Agusan del Norte and Siargao play host to cross-country and downhill competitions participated by local and international bikers."
        ],
        [
            "Trekking"
        ],
        [
            "Mount Mayapay in Agusan del Norte"
        ],
        [
            "Mt.",
            "Mas-ai and Mt.",
            "Hilong-Hilong features panoramic views of the vast lower Agusan Valley.",
            "Close to Mt.",
            "Mas-ai lies Lake Mainit, the fourth-largest lake in the country, with an area of 147 square kilometres (57 sq mi).",
            "Through the years, the lake has been a known lair for pidjanga, tilapia, kasili, banak, haw-an, gingaw, saguyon and igi.",
            "Migratory birds, pagosi and tabokali flowers are its intermittent added attractions."
        ],
        [
            "The 8,000-hectare (80 km2) mangrove forests in Del Carmen form one of the largest contiguous mangrove forests in the Philippines.",
            "Sohoton Cave and Lagoon in Bucas Grande Island, which is more than an hour boat ride from Siargao, features limestone formations to a point where one enters a narrow channel which soon becomes a cave."
        ],
        [
            "Caves"
        ],
        [
            "The limestone karst bedrock of some areas in Surigao and Agusan provinces (particularly in the towns of San Agustin, Tagbina, Lianga, Rosario, and Bislig) features several caves, but none of these are regular destinations for recreational cavers.",
            "Located within the towns of Tagbina and Bislig, Banbow and Tatol caves (which are ranked the 6th and 9th longest caves in the Philippines) have recently been declared by the Japanese cave explorers as the third longest cave in the country.",
            "Some of the most frequently visited and accessible caves in the region are the Buenavista and Silop Caves in Surigao City and the Libas Cave in Jabonga-Agusan del Norte.",
            "These caves have limestone formations and naturally carved stalagmites, stalactites and columns."
        ],
        [
            "Agusan Marsh"
        ],
        [
            "The 14,000-hectare (140 km2) Agusan Marsh in Agusan del Sur is one of the biggest wetlands in the country and is host to diverse species of birds."
        ],
        [
            "Events and festivals"
        ],
        [
            "A Manobo girl performing a dance during the Kahimunan Festival in Butuan in 2019."
        ],
        [
            "Festivals include the Naliyagan Festival of Agusan del Sur, Surfers from around the world converge in Siargao during the annual international surfing competition."
        ],
        [
            "Facilities"
        ],
        [
            "The entire region is connected by roads from and to the major commercial, trading and processing centers of Cagayan de Oro and Davao.",
            "Butuan is being developed as the regional center with modern facilities and big commercial centers.",
            "There are secondary seaports and airports in the region.",
            "It has an increasing number of telecommunication facilities and the presence of the Verano Seaport in Surigao City as the major baseport in the region."
        ],
        [
            "Social development"
        ],
        [
            "Education and skills development"
        ],
        [
            "Father Saturnino Urios University Open Field (Left) and Student Center (Right), at night."
        ],
        [
            "The region's literacy rate of 93% in 1990 was marginally higher than the National Average of 92.57%.",
            "Supporting the education of the region in 1997 were the 1,478 public and 49 private elementary schools, 110 public and 71 private secondary schools, 26 secondary school annexes, and 7 vocational schools."
        ],
        [
            "The region has a total of 49 higher education institutions comprising 45 private Higher Education Institutions (HEIs) and 4 State Universities and Colleges (SUCs).",
            "Among the Higher Education Institutions, San Nicolas College (now St. Paul University-Surigao and first university established in the entire region) is identified as the center for development in teacher education and the regional center for Gender and Development, it being the seat of Caraga Women's resources center."
        ],
        [
            "The Caraga State University (CSU) formerly known as Northern Mindanao State Institute of Science and Technology (NORMISIST), is among the 112 state-funded universities and colleges in the Philippines.",
            "It is identified by the Commission on Higher Education (CHED) as the Center of Development (COD) in Information Technology, COD in Biology, and COD in Mathematics.",
            "It is the seat of the Caraga Center for Research in Environmental Management and Eco-governance (CREME), formerly known as the Caraga Center for Environmental Studies and Management (CCESM), which acts as the focal point of capability building and coordination for environmental efforts in the region.",
            "The university, through the Caraga Center for Geo-informatics (CCGeo), is also the lead implementing agency of the Geo-SAFER Mindanao (Geo-informatics for the Systematic Assessment of Flood Effects and Risks for a Resilient Mindanao), a research program that utilizes LiDAR data for mapping flood risk areas towards building a resilient Mindanao.",
            "CSU is producing Board Topnotchers in Forestry, Geodetic Engineering, Mining Engineering, and Agricultural Engineering, and has strengthened its research and innovation system through the years which resulted to its recent status as a Level IV State University, recognized by CHED as excellent in Teaching and Research."
        ],
        [
            "Father Saturnino Urios University, was founded by Caraga's most loved Spanish missionary, Fr.",
            "Saturnino Urios S.J.",
            "in 1990.",
            "The Commission on Higher Education (CHED) recognized Father Saturnino Urios University as one of the best schools in the region producing top notchers in national board examinations in Nursing, Engineering, and Accountancy.",
            "Its performance in the Licensure Examinations for Teachers (LET) and the Philippine Bar (BAR) is also relatively high.",
            "On July 12, 2006, Urios College formally announced its elevation into a university and is now renamed Fr.",
            "Saturnino Urios University (FSUU), the first home-grown university in Caraga."
        ],
        [
            "For the school year 1996–1997, the participation rate for public elementary schools was 93.65%.",
            "Public secondary schools registered a lower rate, 56%.",
            "The teacher-to-pupil ratios for both levels were within the standard of one teacher per 40 pupils.",
            "Cohort survival rates were considered low for both the elementary and secondary levels at 66.23% and 68.93%, respectively.",
            "For the school year 1996–97, dropout rate at the secondary level was high, especially in Butuan (9.5%) and Surigao Del Sur (7.8%).",
            "This can be one of the causes why the majority of the population finished only up to the elementary school level."
        ],
        [
            "Health and nutrition"
        ],
        [
            "Democrito O. Plaza Memorial Hospital in Prosperidad.",
            "Opened in 2017."
        ],
        [
            "All the vital health indicators from 1992 to 1997 showed a decreasing trend except for maternal mortality rate.",
            "The crude birth rate decreased from the 1992–1996 five-year average of 21.02 to 18.71 in 1997.",
            "The crude death rate also decreased from 3.60 in the 1992–1996 average to 3.0 in 1997.",
            "The infant mortality rate increased from an average of 1.33 in 1992–1996 to 1.56 in 1997."
        ],
        [
            "All of the leading causes of morbidity from 1992 to 1997 were communicable diseases, and showed a reduction in rates for every 1,000,000 population, except for pneumonia (836.30 to 1,200.23), diarrhea (1,059.40 to 1,133.11), influenza (655.36 to 926.74), and malaria (216.80 to 366.5).",
            "With regards to the leading causes of mortality, lifestyle-related diseases like cardiovascular diseases and cancer top the list, replacing the communicable diseases."
        ],
        [
            "The region is faced with problems of endemic diseases like schistosomiasis and malaria.",
            "Although there was a slight reduction in its prevalence for the past three years, still Caraga ranked as number two in schistosomiasis cases and number six in malaria cases nationwide."
        ],
        [
            "Malnutrition rates were posted at 49.25%, of which 34.05% were classified as mildly underweight, 11.66% as moderately underweight, 1.43% as severely underweight and 3.60% as overweight."
        ],
        [
            "Life expectancy for the region, based on the 1995 census, was 65.73 years old for males and 70.98 years old for females."
        ],
        [
            "As of 1997, there were 62 hospitals in the region, of which 35 were government and 27 were private.",
            "Out of the 27 private hospitals, 20 were primary, 4 secondary and 3 tertiary.",
            "Out of the 35 government hospitals, 18 were primary, 14 were secondary and 3 were tertiary.",
            "There were 73 main health centers, 489 barangay health stations manned by 76 doctors, 147 nurses, 35 medical technologists, 45 dental aides, 52 dentists, 608 midwives and 137 sanitary inspectors.",
            "All of these were devolved to the local government units in accordance with the 1991 local Government code."
        ],
        [
            "Social welfare services"
        ],
        [
            "In 1996, Caraga had 1,619 welfare facilities of which 1,238 were Day care Centers; 8 were Senior Citizens' Center; 3 were Productivity Skills capability Building for Disadvantaged Women (PSCBDW); and with 1 each were the child Learning and Resource Center, Women Center, Home for the Girls, Regional Rehabilitation Center for Youth, Lingap Center, Balay Silongan, Foster Home for Exploited Children And Women, and Halfway Home for Improved Mental Patients."
        ],
        [
            "On the community-based services, only the PSCBDW is being managed by DSWD while the rest are managed by the LGUs."
        ],
        [
            "Housing"
        ],
        [
            "The region had unique housing profile in 1990.",
            "While other areas complained of housing shortage, a significant number of houses, particularly in Agusan del Norte and Surigao del Norte were vacant.",
            "However, available statistics do not give the magnitude of substandard of units to be replaced and current housing backlog.",
            "Currently, the cities of Butuan and Surigao and other municipalities are not spared from housing problems, i.e.",
            "squatters bought by urbanization."
        ],
        [
            "Infrastructure"
        ],
        [
            "Agusan Bridge in Butuan City (Under construction)"
        ],
        [
            "Roads and bridges"
        ],
        [
            "Caraga Region has the first and only cable-stayed bridge in the entire Mindanao island, the Macapagal Bridge in Butuan connecting the Butuan Bypass Road over Agusan River."
        ],
        [
            "The region is connected to the major centers of its neighboring regions by the Maharlika Highways that runs from the cities of Davao, Cagayan de Oro and Surigao.",
            "The provinces are interlinked with concrete roads, except for a very few parts in Surigao del Sur which is still partially concreted in select areas and is on its nearing completion.",
            "Total road length of the region runs to 7,515.596 km.",
            "Road density was at 0.3988 as of 1995.",
            "There were 1,325.558 km classified as national roads in the region and 1,289.774 km of city and provincial roads.",
            "The total municipal road length for the region was 696.46 km."
        ],
        [
            "The region had bridges with the combined length of 23,775.49 meters linear.",
            "Surigao del Norte and Surigao del Sur had the longest bridge length 9,288.520 m linear and 7,853.4 m linear, respectively."
        ],
        [
            "A project called 'East-West Lateral Road' forms part of the total regional connectivity between the Region XIII and Northern Mindanao.",
            "It foresees to promote development in different fields such as eco-tourism, agriculture, industry, and domestic trade.",
            "It will also provide an accessible route for the remote area settlers, thus uplifting their economic growth."
        ],
        [
            "Seaports and airports"
        ],
        [
            "As the overland gateway to Visayas and Luzon, the region is accessible by sea through the baseport of Verano Port and Lipata Ferry Terminal in Surigao City that connects the neighboring province of Southern Leyte.",
            "Other terminal ports are in Dapa in Siargao, Surigao del Norte, San Jose in Dinagat Islands, Tandag and Bislig in Surigao del Sur and Nasipit Port in Agusan del Norte.",
            "Fast craft ferry services used to ply the Surigao City-Cebu City route every day.",
            "Private ports can also be found in the different municipalities and cities of the region, however, only three of these 42 ports are operational."
        ],
        [
            "The region is serviced by commercial flights to and from Manila and Cebu through the airports of Butuan, Surigao and Siargao in Surigao del Norte and Tandag Airport in Surigao del Sur.",
            "The Bislig Airport used to service commercial flights before its operations were suspended.",
            "Proposed airports in Agusan del Sur and Dinagat are being studied if viable for commercial operations.",
            "There are six other private owned airports in the region among them is the PHILNICO airport located in Nonoc Island in Surigao City.",
            "The ports and airports are supported by the road networks that connect the provinces within and outside the region."
        ],
        [
            "References"
        ],
        [
            "^ a b c d e Census of Population (2015).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b \"2021 to 2023 Gross Regional Domestic Product (GRDP)\".",
            "openstat.psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ a b \"Republic Act No.",
            "7901 - An Act Creating Region XIII to be Known as the Caraga Administrative Region, and for Other Purposes\".",
            "Chan Robles Virtual Law Library.",
            "February 23, 1995.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"IRA Shares for LGUs Jump by 37.5% in 2013\".",
            "Office of the President of the Philippines.",
            "January 9, 2013.",
            "Archived from the original on September 3, 2014."
        ],
        [
            "^ \"CARAGA Region History and Geography\".",
            "GOVPH.",
            "Republic of the Philippines.",
            "Archived from the original on August 28, 2018.",
            "Retrieved June 3, 2019."
        ],
        [
            "^ Nowell, C. E. (1962).",
            "\"Antonio Pigafetta's account\".",
            "Magellan's Voyage Around the World.",
            "Evanston: Northwestern University Press.",
            "hdl:2027/mdp.39015008001532.",
            "OCLC 347382."
        ],
        [
            "^ a b Convicts or Conquistadores?",
            "Spanish Soldiers in the Seventeenth-Century Pacific By Stephanie J. Mawson AGI, México, leg.",
            "25, núm.",
            "62; AGI, Filipinas, leg.",
            "8, ramo 3, núm.",
            "50; leg.",
            "10, ramo 1, núm.",
            "6; leg.",
            "22, ramo 1, núm.",
            "1, fos.",
            "408 r –428 v; núm.",
            "21; leg.",
            "32, núm.",
            "30; leg.",
            "285, núm.",
            "1, fos.",
            "30 r –41 v ."
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO PRIMERO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO SEGUNDO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ \"Republic Act No.",
            "2786 - An Act to Create the Provinces of Surigao del Norte and Surigao del Sur\".",
            "Chan Robles Virtual Law Library.",
            "June 19, 1960.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"Republic Act No.",
            "4979; An Act Creating the Provinces of Agusan del Norte and Agusan del Sur\".",
            "The LawPhil Project.",
            "June 17, 1967.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"Republic Act No.",
            "523; An Act Creating the City of Butuan\".",
            "Official Gazette of the Republic of the Philippines.",
            "June 15, 1950.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"PSGC Interactive; List of Provinces\".",
            "Philippine Statistics Authority.",
            "Archived from the original on January 11, 2013.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"2010 Census and Housing Population\" (PDF).",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on September 28, 2013.",
            "Retrieved March 14, 2014."
        ],
        [
            "^ \"Caraga: Three in Every Ten Households Owned Agricultural Land | Philippine Statistics Authority\".",
            "Psa.gov.ph.",
            "November 21, 2002.",
            "Retrieved February 1, 2020."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b c Caraga Regional Development Plan 2004-2010"
        ],
        [
            "^ Ty, Charley (March 20, 2016).",
            "\"Bringing back the sparkle to Siargao's shores\".",
            "The Philippine Star.",
            "Retrieved March 29, 2016.",
            "The municipality of Del Carmen is home to about half of Surigao del Norte's 8,000 hectares of mangrove forests."
        ],
        [
            "^ \"A biodiversity hotspot called Agusan Marsh\".",
            "Manila Bulletin.",
            "October 28, 2015.",
            "Archived from the original on April 15, 2016.",
            "Retrieved March 29, 2016.",
            "A protected area covering more than 14,000 hectares in the heart of the 250-kilometer Agusan River, it is perhaps the country's most significant wetland and listed in the prestigious Ramsar List Wetlands of International Importance."
        ],
        [
            "^ Crismundo, Mike (June 11, 2015).",
            "\"Week-long 'Naliyagan' Festival gears up in Agusan del Sur\".",
            "Manila Bulletin.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"Surigao Norte celebrates Bonok-Bonok Festival\".",
            "The Philippine Star.",
            "September 8, 2006.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"East-West Lateral Road\".",
            "Retrieved July 31, 2019."
        ],
        [
            "External links"
        ],
        [
            " Media related to Caraga Region at Wikimedia Commons"
        ],
        [
            " Caraga travel guide from Wikivoyage"
        ],
        [
            " Geographic data related to Caraga at OpenStreetMap"
        ],
        [
            "Regions adjacent to Caraga"
        ],
        [
            "Central VisayasBohol Sea"
        ],
        [
            "Eastern VisayasSurigao Strait"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "Caraga"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Davao Region"
        ],
        [
            "vteCaraga Administrative Region (Region XIII)Regional center"
        ],
        [
            "Butuan"
        ],
        [
            "Provinces"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Butuan"
        ],
        [
            "Component cities"
        ],
        [
            "Bayugan"
        ],
        [
            "Bislig"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Surigao City"
        ],
        [
            "Tandag"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Prosperidad"
        ],
        [
            "San Jose"
        ],
        [
            "Surigao City"
        ],
        [
            "Tandag"
        ],
        [
            "Municipalities"
        ],
        [
            "Alegria"
        ],
        [
            "Bacuag"
        ],
        [
            "Barobo"
        ],
        [
            "Basilisa"
        ],
        [
            "Bayabas"
        ],
        [
            "Buenavista"
        ],
        [
            "Bunawan"
        ],
        [
            "Burgos"
        ],
        [
            "Cagdianao"
        ],
        [
            "Cagwait"
        ],
        [
            "Cantilan"
        ],
        [
            "Carmen (Agusan del Norte)"
        ],
        [
            "Carmen (Surigao del Sur)"
        ],
        [
            "Carrascal"
        ],
        [
            "Claver"
        ],
        [
            "Cortes"
        ],
        [
            "Dapa"
        ],
        [
            "Del Carmen"
        ],
        [
            "Dinagat"
        ],
        [
            "Esperanza"
        ],
        [
            "General Luna"
        ],
        [
            "Gigaquit"
        ],
        [
            "Hinatuan"
        ],
        [
            "Jabonga"
        ],
        [
            "Kitcharao"
        ],
        [
            "La Paz"
        ],
        [
            "Lanuza"
        ],
        [
            "Las Nieves"
        ],
        [
            "Lianga"
        ],
        [
            "Libjo"
        ],
        [
            "Lingig"
        ],
        [
            "Loreto (Agusan del Sur)"
        ],
        [
            "Loreto (Dinagat Islands)"
        ],
        [
            "Madrid"
        ],
        [
            "Magallanes"
        ],
        [
            "Mainit"
        ],
        [
            "Malimono"
        ],
        [
            "Marihatag"
        ],
        [
            "Nasipit"
        ],
        [
            "Pilar"
        ],
        [
            "Placer"
        ],
        [
            "Prosperidad"
        ],
        [
            "Remedios T. Romualdez"
        ],
        [
            "Rosario"
        ],
        [
            "San Agustin"
        ],
        [
            "San Benito"
        ],
        [
            "San Francisco (Agusan del Sur)"
        ],
        [
            "San Francisco (Surigao del Norte)"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Luis"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Josefa"
        ],
        [
            "Santa Monica"
        ],
        [
            "Santiago"
        ],
        [
            "Sibagat"
        ],
        [
            "Sison"
        ],
        [
            "Socorro"
        ],
        [
            "Tagana-an"
        ],
        [
            "Tagbina"
        ],
        [
            "Tago"
        ],
        [
            "Talacogon"
        ],
        [
            "Trento"
        ],
        [
            "Tubajon"
        ],
        [
            "Tubay"
        ],
        [
            "Tubod"
        ],
        [
            "Veruela"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vteRegions of the PhilippinesLuzon"
        ],
        [
            "NCR – National Capital Region"
        ],
        [
            "CAR – Cordillera Administrative Region"
        ],
        [
            "I – Ilocos Region"
        ],
        [
            "II – Cagayan Valley"
        ],
        [
            "III – Central Luzon"
        ],
        [
            "IV-A – Calabarzon"
        ],
        [
            "Mimaropa – Southwestern Tagalog Region"
        ],
        [
            "V – Bicol Region"
        ],
        [
            "Visayas"
        ],
        [
            "VI – Western Visayas"
        ],
        [
            "NIR – Negros Island Region"
        ],
        [
            "VII – Central Visayas"
        ],
        [
            "VIII – Eastern Visayas"
        ],
        [
            "Mindanao"
        ],
        [
            "IX – Zamboanga Peninsula"
        ],
        [
            "X – Northern Mindanao"
        ],
        [
            "XI – Davao Region"
        ],
        [
            "XII – Soccsksargen"
        ],
        [
            "XIII – Caraga Region"
        ],
        [
            "BARMM – Bangsamoro Autonomous Region in Muslim Mindanao"
        ],
        [
            "Former regions"
        ],
        [
            "ARMM – Autonomous Region in Muslim Mindanao"
        ],
        [
            "IV – Southern Tagalog"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Caraga&oldid=1229672659\""
        ],
        [
            "Categories: CaragaRegions of the PhilippinesMindanaoHidden categories: Pages using gadget WikiMiniAtlasAll articles with incomplete citationsArticles with incomplete citations from August 2015All articles with dead external linksArticles with dead external links from November 2016Articles with permanently dead external linksArticles with short descriptionShort description is different from WikidataUse mdy dates from March 2020Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishCoordinates on WikidataWikipedia articles with style issues from February 2017All articles with style issuesAll articles with unsourced statementsArticles with unsourced statements from March 2016Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}