{
    "name": "Cordillera Administrative Region",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cordillera Administrative Region"
        ],
        [
            "42 languages"
        ],
        [
            "閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoChavacano de ZamboangaDeutschEspañolEsperantoEuskaraفارسیFrançais한국어हिन्दीHrvatskiIlokanoItalianoKapampanganქართულიLatviešuLietuviųМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยУкраїнськаاردوVènetoTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°10′N 121°10′E﻿ / ﻿17.17°N 121.17°E﻿ / 17.17; 121.17"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Administrative region of the Philippines"
        ],
        [
            "Not to be confused with CAR.",
            "For other  uses, see CAR (disambiguation)"
        ],
        [
            "Region in Luzon, PhilippinesCordilleraRegionCordillera Administrative Region"
        ],
        [
            "Clockwise from the top: Maligcong Rice Terraces, Tayum Church, Banaue Rice Terraces, Baguio Cathedral, Mount Pulag"
        ],
        [
            "SealLocation in the PhilippinesOpenStreetMapCoordinates: 17°10′N 121°10′E﻿ / ﻿17.17°N 121.17°E﻿ / 17.17; 121.17Country PhilippinesIsland groupLuzonRegional centerand largest cityBaguioArea • Total19,422.03 km2 (7,498.89 sq mi)Highest elevation (Mount Pulag)2,928 m (9,606 ft)Population (2020 census) • Density93/km2 (240/sq mi)Time zoneUTC+8 (PST)ISO 3166 codePH-15Provinces"
        ],
        [
            "6"
        ],
        [
            " Abra"
        ],
        [
            " Apayao"
        ],
        [
            " Benguet"
        ],
        [
            " Ifugao"
        ],
        [
            " Kalinga"
        ],
        [
            " Mountain Province"
        ],
        [
            "Independent cities"
        ],
        [
            "1"
        ],
        [
            " Baguio"
        ],
        [
            "Component cities"
        ],
        [
            "1"
        ],
        [
            " Tabuk"
        ],
        [
            "Municipalities75Barangays1,178Cong.",
            "districts7LanguagesIlocanoIbaloiKankanaeyKalanguyaKalingaIfugaoItnegIsnegPangasinanFilipinoEnglishothersGDP (2023)₱410.56 billion$7.38 billionHDI 0.777 (High)HDI rank3rd in the Philippines (2019)"
        ],
        [
            "The Cordillera Administrative Region (CAR; Ilocano: Rehion/Deppaar Administratibo ti Kordiliera; Filipino: Rehiyong Pampangasiwaan ng Cordillera), also known as the Cordillera Region and Cordillera (IPA: ), is an administrative region in the Philippines, situated within the island of Luzon.",
            "It is the only landlocked region in the insular country, bordered by the Ilocos Region to the west and southwest, and by the Cagayan Valley Region to the north, east, and southeast.",
            "It is the least populous region in the Philippines, with a population less than that of the city of Manila.",
            "Baguio is the regional center and largest city."
        ],
        [
            "The region comprises six provinces: Abra, Apayao, Benguet, Ifugao, Kalinga and Mountain Province.",
            "The regional center is the highly urbanized city of Baguio."
        ],
        [
            "The region was officially created on July 15, 1987, and covers most of the Cordillera Mountain Range of Luzon and is home to numerous ethnic peoples.",
            "The Nueva Vizcaya province has a majority of Igorot population, but was placed by the American colonial government in the Cagayan Valley Region instead during the early 20th century, so do Quirino."
        ],
        [
            "According to the 2020 Census of Population and Housing, this region is the least populated region in the Philippines."
        ],
        [
            "History"
        ],
        [
            "An old U.S. Army map showing Mountain province covering the present areas of Benguet, Ifugao, Kalinga and Apayao."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "During the Spanish occupation of the Philippines, Christianization and eventual subjugation of the mountain region proved difficult for the Spanish colonial government."
        ],
        [
            "On August 18, 1908, during the American regime, Mountain Province was established by the Philippine Commission with the enactment of Act No.",
            "1876.",
            "Ifugao, which was part of Nueva Vizcaya province,"
        ],
        [
            "Philippine independence"
        ],
        [
            "On June 18, 1966, Republic Act No.",
            "4695 was enacted to split Mountain Province and create four separate and independent provinces namely Benguet, Ifugao, Kalinga-Apayao, and Mountain Province.",
            "with Benguet and Mountain Province placed under the Ilocos Region."
        ],
        [
            "The Martial Law era"
        ],
        [
            "Detail of the Wall of Remembrance at the Bantayog ng mga Bayani in Quezon City, showing names from the first batch of Bantayog Honorees, including that of Macli-ing Dulag."
        ],
        [
            "Main articles: Chico River Dam Project and Macli-ing Dulag"
        ],
        [
            "After the declaration of martial law by Ferdinand Marcos in 1972, the region became the focus of militarization as a result of local objections to the government's push for the Chico River Dam Project near Sadanga, Mountain Province and Tinglayan, Kalinga."
        ],
        [
            "Empowered by martial law to conduct warrantless arrests, the 60th PC Brigade had arrested at least 150 locals by April 1977, accusing them of supposed subversion and of obstructing government projects, and various other offenses such as boycotting the October 1976 Constitutional Referendum.",
            "Individuals arrested included tribal papangat (leaders/elders), young couples, and in at least one case, a 12-year-old child."
        ],
        [
            "On April 24, 1980, Marcos-controlled military forces assassinated Macli-ing Dulag a pangat (leader) of the Butbut tribe of Kalinga."
        ],
        [
            "After the end of the Marcos administration due to the 1986 People Power Revolution, the succeeding government under President Corazon Aquino secured a ceasefire with the main indigenous armed group in the Cordilleras, the Cordillera People's Liberation Army led by Conrado Balweg.",
            "The Aquino government made a sipat or indigenous treaty, which would be known as the Mount Data Peace Accord, with the CPLA on September 13, 1986, ending hostilities."
        ],
        [
            "Creation of the region"
        ],
        [
            "On July 15, 1987, President Corazon Aquino issued Executive Order 220 which created the Cordillera Administrative Region.",
            "The provinces of Abra, Benguet and Mountain Province (of the Ilocos Region), and Ifugao and Kalinga-Apayao (of the Cagayan Valley) were annexed as part of the newly created region.",
            "Cordillera Administrative Region is the revival of the U.S. political division of Mountain Province, with Abra which was part of Spanish province of Ilocos.",
            "Nueva Vizcaya & Quirino were not included in the region despite having an Igorot majority at the time."
        ],
        [
            "On February 14, 1995, Kalinga-Apayao, one of the five provinces of the region was split into two separate and independent provinces of Apayao and Kalinga with the enactment of Republic Act No.",
            "7878."
        ],
        [
            "Several attempts at legalizing autonomy in the Cordillera region have failed in two separate plebiscites."
        ],
        [
            "At present, a third organic act of the Cordillera is in the offing supported by the Cordillera Regional Development Council."
        ],
        [
            "Contemporary"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Cordillera Administrative Region\" – news · newspapers · books · scholar · JSTOR (March 2019) (Learn how and when to remove this message)"
        ],
        [
            "In September 2000, the municipal council of Itogon, Benguet, withdrew support for the San Roque Dam project.",
            "The project had met a lot of resistance, because of the reported failure of its proponents to update its Environmental Certificate of Compliance (ECC) and to submit a watershed management plan required for a project of that magnitude.",
            "The San Roque Dam was to become one of the biggest dams in the world and would threaten the living environment of the Igorot."
        ],
        [
            "The Cordillera Peoples Alliance (CPA), an indigenous rights organization in the region, in co-operation with other organizations, had highly resisted this project and thus booked a little victory.",
            "In May 2001, however, President Arroyo stated that the San Roque Dam project would proceed regardless due to the fact that it had already been initiated and therefore was difficult to stop.",
            "At the same time, she promised not to sacrifice the environment, to rehabilitate the people who will lose their homes, to compensate those who will suffer, and to not initiate any more large-scale irrigation projects in the future."
        ],
        [
            "In December 2000, the Supreme Court of the Philippines dismissed a petition that questioned the constitutional legality of the Indigenous Peoples Rights Act (IPRA), and act which came into existence in 1997 giving the peoples of the Cordillera decisive influence over the establishment of foreign mining companies.",
            "In this act, ownership over the lands was regarded as communal, rather than individual and thus coincided more with the view on ownership of the Igorot.",
            "The IPRA was totally different in tone than the 1995 Mining Code."
        ],
        [
            "Without consultation from the people of the Cordilleras, the Mining Code gave companies the freedom to devastate tribal lands, allowed 100% foreign ownership, and gave companies the right to displace and resettle people within their concessionary areas.",
            "Some influential people filed a lawsuit with the Supreme Court against the IPRA, because it contradicted with the Mining Code and would therefore be unlawful.",
            "The petition was dismissed in a 7–7 vote by the Supreme Court."
        ],
        [
            "A bill creating an autonomous Cordillera was filed in Congress in 2014, but it was not backed by strategic politicians in the region due to lack of support from the national government.",
            "However, in 2017, all provincial congressmen within the CAR jointly filed a new Bill creating an autonomous Cordillera, the first time in three decades where all provincial district representatives called in unison for autonomy.",
            "The move was made due to the election win of President Duterte, who publicly supported the creation of an autonomous Cordillera.",
            "However, questions lingered on the issue of Nueva Vizcaya's exclusion from the proposed region, despite being culturally and geographically part of the Cordilleras, leaving Nueva Vizcaya Igorots left out from the proposal."
        ],
        [
            "Geography"
        ],
        [
            "Topographical mapPolitical map"
        ],
        [
            "The region is the only landlocked region in the Philippines, bounded on the northeast and east by the Cagayan Valley, and on the southwest and west by the Ilocos Region."
        ],
        [
            "The region is primarily mountainous, positioned in the Cordillera Central mountain range, which includes Mount Pulag, the highest mountain in Luzon."
        ],
        [
            "Further information: Cordillera Central, Luzon"
        ],
        [
            "Within the region are several streams and rivers including the Chico River, which is a tributary of the Cagayan River.",
            "Other major rivers include"
        ],
        [
            "Abra"
        ],
        [
            "Abulog"
        ],
        [
            "Agno"
        ],
        [
            "Ahin"
        ],
        [
            "Amburayan"
        ],
        [
            "Apayao"
        ],
        [
            "Bued"
        ],
        [
            "Siffu"
        ],
        [
            "Administrative divisions"
        ],
        [
            "A view of Baguio as seen in November 2012"
        ],
        [
            "Cordillera Administrative Region is politically subdivided into 6 provinces.",
            "It has 2 cities; the highly urbanized city of Baguio, and the component city of Tabuk.",
            "There are 1,178 barangays in the region.",
            "Geographically, the western half of Nueva Vizcaya is part of the main Cordilleras, while its eastern half is part of the Caraballos, the meeting point of the Cordilleras and the Sierra Madre.",
            "There have been moves to reunify Nueva Vizcaya with the Cordilleras, however, no such legislation has yet been introduced in Congress."
        ],
        [
            "Regional divisions"
        ],
        [
            "Province or HUC"
        ],
        [
            "Capital"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Cities"
        ],
        [
            "Muni."
        ],
        [
            "Barangay"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Abra"
        ],
        [
            "Bangued"
        ],
        [
            "14.0%"
        ],
        [
            "250,985"
        ],
        [
            "4,199.72"
        ],
        [
            "1,621.52"
        ],
        [
            "60"
        ],
        [
            "160"
        ],
        [
            "0"
        ],
        [
            "27"
        ],
        [
            "303"
        ],
        [
            "Apayao"
        ],
        [
            "Kabugao"
        ],
        [
            "6.9%"
        ],
        [
            "124,366"
        ],
        [
            "4,502.33"
        ],
        [
            "1,738.36"
        ],
        [
            "28"
        ],
        [
            "73"
        ],
        [
            "0"
        ],
        [
            "7"
        ],
        [
            "133"
        ],
        [
            "Benguet"
        ],
        [
            "La Trinidad"
        ],
        [
            "25.6%"
        ],
        [
            "460,683"
        ],
        [
            "2,769.08"
        ],
        [
            "1,069.15"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "1"
        ],
        [
            "13"
        ],
        [
            "140"
        ],
        [
            "Ifugao"
        ],
        [
            "Lagawe"
        ],
        [
            "11.5%"
        ],
        [
            "207,498"
        ],
        [
            "2,618.01"
        ],
        [
            "1,010.82"
        ],
        [
            "79"
        ],
        [
            "200"
        ],
        [
            "0"
        ],
        [
            "11"
        ],
        [
            "176"
        ],
        [
            "Kalinga"
        ],
        [
            "Tabuk"
        ],
        [
            "12.8%"
        ],
        [
            "229,570"
        ],
        [
            "3,282.04"
        ],
        [
            "1,267.20"
        ],
        [
            "70"
        ],
        [
            "180"
        ],
        [
            "1"
        ],
        [
            "7"
        ],
        [
            "153"
        ],
        [
            "Mountain Province"
        ],
        [
            "Bontoc"
        ],
        [
            "8.8%"
        ],
        [
            "158,200"
        ],
        [
            "2,389.43"
        ],
        [
            "922.56"
        ],
        [
            "66"
        ],
        [
            "170"
        ],
        [
            "0"
        ],
        [
            "10"
        ],
        [
            "144"
        ],
        [
            "Baguio"
        ],
        [
            "†"
        ],
        [
            "—"
        ],
        [
            "20.4%"
        ],
        [
            "366,358"
        ],
        [
            "57.51"
        ],
        [
            "22.20"
        ],
        [
            "6,400"
        ],
        [
            "17,000"
        ],
        [
            "—"
        ],
        [
            "—"
        ],
        [
            "129"
        ],
        [
            "Total"
        ],
        [
            "1,797,660"
        ],
        [
            "19,818.12"
        ],
        [
            "7,651.82"
        ],
        [
            "91"
        ],
        [
            "240"
        ],
        [
            "2"
        ],
        [
            "75"
        ],
        [
            "1,178"
        ],
        [
            " †  Baguio is a highly urbanized city; figures are excluded from Benguet."
        ],
        [
            "Governors and vice governors"
        ],
        [
            "Province"
        ],
        [
            "Image"
        ],
        [
            "Governor"
        ],
        [
            "Political Party"
        ],
        [
            "Vice Governor"
        ],
        [
            "Abra"
        ],
        [
            "Dominic Valera"
        ],
        [
            "NUP"
        ],
        [
            "Maria Jocelyn Bernos"
        ],
        [
            "Apayao"
        ],
        [
            "Elias Bulut Jr."
        ],
        [
            "NPC"
        ],
        [
            "Remy N. Albano"
        ],
        [
            "Benguet"
        ],
        [
            "Melchor Diclas"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Ericson Lawagey Felipe"
        ],
        [
            "Ifugao"
        ],
        [
            "Jerry U. Dalipog"
        ],
        [
            "KBL"
        ],
        [
            "Glenn D. Prudenciano"
        ],
        [
            "Kalinga"
        ],
        [
            "James Edduba"
        ],
        [
            "Lakas"
        ],
        [
            "Jocel Baac"
        ],
        [
            "Mountain Province"
        ],
        [
            "Bonifacio C. Lacwasan"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Francis O. Tauli"
        ],
        [
            "Cities and municipalities"
        ],
        [
            " †  Regional center"
        ],
        [
            "City/Municipality"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Class"
        ],
        [
            "Income class"
        ],
        [
            "Province"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Aguinaldo"
        ],
        [
            "21,128"
        ],
        [
            "538.05"
        ],
        [
            "207.74"
        ],
        [
            "39"
        ],
        [
            "100"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Ifugao"
        ],
        [
            "Alfonso Lista"
        ],
        [
            "34,061"
        ],
        [
            "347.46"
        ],
        [
            "134.16"
        ],
        [
            "98"
        ],
        [
            "250"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Ifugao"
        ],
        [
            "Asipulo"
        ],
        [
            "15,963"
        ],
        [
            "182.87"
        ],
        [
            "70.61"
        ],
        [
            "87"
        ],
        [
            "230"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Ifugao"
        ],
        [
            "Atok"
        ],
        [
            "19,218"
        ],
        [
            "214.99"
        ],
        [
            "83.01"
        ],
        [
            "89"
        ],
        [
            "230"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Benguet"
        ],
        [
            "† Baguio"
        ],
        [
            "366,358"
        ],
        [
            "57.51"
        ],
        [
            "22.20"
        ],
        [
            "6,400"
        ],
        [
            "17,000"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "1st"
        ],
        [
            "Benguet"
        ],
        [
            "Bakun"
        ],
        [
            "14,535"
        ],
        [
            "286.91"
        ],
        [
            "110.78"
        ],
        [
            "51"
        ],
        [
            "130"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Benguet"
        ],
        [
            "Balbalan"
        ],
        [
            "12,914"
        ],
        [
            "542.69"
        ],
        [
            "209.53"
        ],
        [
            "24"
        ],
        [
            "62"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Kalinga"
        ],
        [
            "Banaue"
        ],
        [
            "20,652"
        ],
        [
            "191.20"
        ],
        [
            "73.82"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Ifugao"
        ],
        [
            "Bangued"
        ],
        [
            "50,382"
        ],
        [
            "105.70"
        ],
        [
            "40.81"
        ],
        [
            "480"
        ],
        [
            "1,200"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Abra"
        ],
        [
            "Barlig"
        ],
        [
            "4,796"
        ],
        [
            "228.64"
        ],
        [
            "88.28"
        ],
        [
            "21"
        ],
        [
            "54"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Mountain Province"
        ],
        [
            "Bauko"
        ],
        [
            "32,021"
        ],
        [
            "153.00"
        ],
        [
            "59.07"
        ],
        [
            "210"
        ],
        [
            "540"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Mountain Province"
        ],
        [
            "Besao"
        ],
        [
            "6,873"
        ],
        [
            "173.62"
        ],
        [
            "67.04"
        ],
        [
            "40"
        ],
        [
            "100"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Mountain Province"
        ],
        [
            "Bokod"
        ],
        [
            "14,435"
        ],
        [
            "274.96"
        ],
        [
            "106.16"
        ],
        [
            "52"
        ],
        [
            "130"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Benguet"
        ],
        [
            "Boliney"
        ],
        [
            "4,551"
        ],
        [
            "216.92"
        ],
        [
            "83.75"
        ],
        [
            "21"
        ],
        [
            "54"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Bontoc"
        ],
        [
            "24,104"
        ],
        [
            "396.10"
        ],
        [
            "152.94"
        ],
        [
            "61"
        ],
        [
            "160"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Mountain Province"
        ],
        [
            "Bucay"
        ],
        [
            "17,953"
        ],
        [
            "102.16"
        ],
        [
            "39.44"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Bucloc"
        ],
        [
            "2,395"
        ],
        [
            "63.77"
        ],
        [
            "24.62"
        ],
        [
            "38"
        ],
        [
            "98"
        ],
        [
            "Municipality"
        ],
        [
            "6th"
        ],
        [
            "Abra"
        ],
        [
            "Buguias"
        ],
        [
            "44,877"
        ],
        [
            "175.88"
        ],
        [
            "67.91"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Benguet"
        ],
        [
            "Calanasan"
        ],
        [
            "12,550"
        ],
        [
            "1,256.15"
        ],
        [
            "485.00"
        ],
        [
            "10.0"
        ],
        [
            "26"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Apayao"
        ],
        [
            "Conner"
        ],
        [
            "27,552"
        ],
        [
            "694.30"
        ],
        [
            "268.07"
        ],
        [
            "40"
        ],
        [
            "100"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Apayao"
        ],
        [
            "Daguioman"
        ],
        [
            "2,019"
        ],
        [
            "114.37"
        ],
        [
            "44.16"
        ],
        [
            "18"
        ],
        [
            "47"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Danglas"
        ],
        [
            "4,074"
        ],
        [
            "156.02"
        ],
        [
            "60.24"
        ],
        [
            "26"
        ],
        [
            "67"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Dolores"
        ],
        [
            "11,512"
        ],
        [
            "47.45"
        ],
        [
            "18.32"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Flora"
        ],
        [
            "17,944"
        ],
        [
            "324.40"
        ],
        [
            "125.25"
        ],
        [
            "55"
        ],
        [
            "140"
        ],
        [
            "Municipality"
        ],
        [
            "3rd"
        ],
        [
            "Apayao"
        ],
        [
            "Hingyon"
        ],
        [
            "9,930"
        ],
        [
            "62.02"
        ],
        [
            "23.95"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Ifugao"
        ],
        [
            "Hungduan"
        ],
        [
            "8,866"
        ],
        [
            "260.30"
        ],
        [
            "100.50"
        ],
        [
            "34"
        ],
        [
            "88"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Ifugao"
        ],
        [
            "Itogon"
        ],
        [
            "61,498"
        ],
        [
            "449.73"
        ],
        [
            "173.64"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Benguet"
        ],
        [
            "Kabayan"
        ],
        [
            "15,806"
        ],
        [
            "242.69"
        ],
        [
            "93.70"
        ],
        [
            "65"
        ],
        [
            "170"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Benguet"
        ],
        [
            "Kabugao"
        ],
        [
            "16,215"
        ],
        [
            "935.12"
        ],
        [
            "361.05"
        ],
        [
            "17"
        ],
        [
            "44"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Apayao"
        ],
        [
            "Kapangan"
        ],
        [
            "19,297"
        ],
        [
            "164.39"
        ],
        [
            "63.47"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Benguet"
        ],
        [
            "Kiangan"
        ],
        [
            "17,691"
        ],
        [
            "200.00"
        ],
        [
            "77.22"
        ],
        [
            "88"
        ],
        [
            "230"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Ifugao"
        ],
        [
            "Kibungan"
        ],
        [
            "17,051"
        ],
        [
            "254.86"
        ],
        [
            "98.40"
        ],
        [
            "67"
        ],
        [
            "170"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Benguet"
        ],
        [
            "La Paz"
        ],
        [
            "16,493"
        ],
        [
            "51.41"
        ],
        [
            "19.85"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "La Trinidad"
        ],
        [
            "137,404"
        ],
        [
            "70.04"
        ],
        [
            "27.04"
        ],
        [
            "2,000"
        ],
        [
            "5,200"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Benguet"
        ],
        [
            "Lacub"
        ],
        [
            "3,612"
        ],
        [
            "295.30"
        ],
        [
            "114.02"
        ],
        [
            "12"
        ],
        [
            "31"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Lagangilang"
        ],
        [
            "14,914"
        ],
        [
            "101.44"
        ],
        [
            "39.17"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Lagawe"
        ],
        [
            "18,876"
        ],
        [
            "208.91"
        ],
        [
            "80.66"
        ],
        [
            "90"
        ],
        [
            "230"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Ifugao"
        ],
        [
            "Lagayan"
        ],
        [
            "4,488"
        ],
        [
            "215.97"
        ],
        [
            "83.39"
        ],
        [
            "21"
        ],
        [
            "54"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Lamut"
        ],
        [
            "26,235"
        ],
        [
            "149.45"
        ],
        [
            "57.70"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Ifugao"
        ],
        [
            "Langiden"
        ],
        [
            "3,576"
        ],
        [
            "116.29"
        ],
        [
            "44.90"
        ],
        [
            "31"
        ],
        [
            "80"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Licuan-Baay"
        ],
        [
            "4,566"
        ],
        [
            "256.42"
        ],
        [
            "99.00"
        ],
        [
            "18"
        ],
        [
            "47"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Luba"
        ],
        [
            "6,518"
        ],
        [
            "148.27"
        ],
        [
            "57.25"
        ],
        [
            "44"
        ],
        [
            "110"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Lubuagan"
        ],
        [
            "9,323"
        ],
        [
            "234.20"
        ],
        [
            "90.43"
        ],
        [
            "40"
        ],
        [
            "100"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Kalinga"
        ],
        [
            "Luna"
        ],
        [
            "21,297"
        ],
        [
            "606.04"
        ],
        [
            "233.99"
        ],
        [
            "35"
        ],
        [
            "91"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Apayao"
        ],
        [
            "Malibcong"
        ],
        [
            "4,027"
        ],
        [
            "283.17"
        ],
        [
            "109.33"
        ],
        [
            "14"
        ],
        [
            "36"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Manabo"
        ],
        [
            "11,611"
        ],
        [
            "110.95"
        ],
        [
            "42.84"
        ],
        [
            "100"
        ],
        [
            "260"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Mankayan"
        ],
        [
            "37,233"
        ],
        [
            "130.48"
        ],
        [
            "50.38"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Benguet"
        ],
        [
            "Mayoyao"
        ],
        [
            "15,621"
        ],
        [
            "238.05"
        ],
        [
            "91.91"
        ],
        [
            "66"
        ],
        [
            "170"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Ifugao"
        ],
        [
            "Natonin"
        ],
        [
            "10,339"
        ],
        [
            "252.00"
        ],
        [
            "97.30"
        ],
        [
            "41"
        ],
        [
            "110"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Mountain Province"
        ],
        [
            "Paracelis"
        ],
        [
            "31,168"
        ],
        [
            "570.16"
        ],
        [
            "220.14"
        ],
        [
            "55"
        ],
        [
            "140"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Mountain Province"
        ],
        [
            "Pasil"
        ],
        [
            "10,577"
        ],
        [
            "189.00"
        ],
        [
            "72.97"
        ],
        [
            "56"
        ],
        [
            "150"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Kalinga"
        ],
        [
            "Peñarrubia"
        ],
        [
            "6,951"
        ],
        [
            "38.29"
        ],
        [
            "14.78"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "Municipality"
        ],
        [
            "6th"
        ],
        [
            "Abra"
        ],
        [
            "Pidigan"
        ],
        [
            "12,475"
        ],
        [
            "49.15"
        ],
        [
            "18.98"
        ],
        [
            "250"
        ],
        [
            "650"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Pilar"
        ],
        [
            "10,146"
        ],
        [
            "66.10"
        ],
        [
            "25.52"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Pinukpuk"
        ],
        [
            "34,275"
        ],
        [
            "743.56"
        ],
        [
            "287.09"
        ],
        [
            "46"
        ],
        [
            "120"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Kalinga"
        ],
        [
            "Pudtol"
        ],
        [
            "15,491"
        ],
        [
            "401.02"
        ],
        [
            "154.83"
        ],
        [
            "39"
        ],
        [
            "100"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Apayao"
        ],
        [
            "Rizal"
        ],
        [
            "19,554"
        ],
        [
            "231.00"
        ],
        [
            "89.19"
        ],
        [
            "85"
        ],
        [
            "220"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Kalinga"
        ],
        [
            "Sabangan"
        ],
        [
            "9,621"
        ],
        [
            "72.04"
        ],
        [
            "27.81"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Mountain Province"
        ],
        [
            "Sablan"
        ],
        [
            "11,588"
        ],
        [
            "105.63"
        ],
        [
            "40.78"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Benguet"
        ],
        [
            "Sadanga"
        ],
        [
            "8,427"
        ],
        [
            "259.79"
        ],
        [
            "100.31"
        ],
        [
            "32"
        ],
        [
            "83"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Mountain Province"
        ],
        [
            "Sagada"
        ],
        [
            "11,510"
        ],
        [
            "109.71"
        ],
        [
            "42.36"
        ],
        [
            "100"
        ],
        [
            "260"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Mountain Province"
        ],
        [
            "Sallapadan"
        ],
        [
            "6,389"
        ],
        [
            "128.62"
        ],
        [
            "49.66"
        ],
        [
            "50"
        ],
        [
            "130"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "San Isidro"
        ],
        [
            "4,745"
        ],
        [
            "48.07"
        ],
        [
            "18.56"
        ],
        [
            "99"
        ],
        [
            "260"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "San Juan"
        ],
        [
            "10,688"
        ],
        [
            "64.08"
        ],
        [
            "24.74"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "San Quintin"
        ],
        [
            "5,705"
        ],
        [
            "66.59"
        ],
        [
            "25.71"
        ],
        [
            "86"
        ],
        [
            "220"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Santa Marcela"
        ],
        [
            "13,317"
        ],
        [
            "196.32"
        ],
        [
            "75.80"
        ],
        [
            "68"
        ],
        [
            "180"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Apayao"
        ],
        [
            "Tabuk City"
        ],
        [
            "121,033"
        ],
        [
            "700.25"
        ],
        [
            "270.37"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "Component city"
        ],
        [
            "5th"
        ],
        [
            "Kalinga"
        ],
        [
            "Tadian"
        ],
        [
            "19,341"
        ],
        [
            "145.20"
        ],
        [
            "56.06"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Mountain Province"
        ],
        [
            "Tanudan"
        ],
        [
            "8,746"
        ],
        [
            "307.55"
        ],
        [
            "118.75"
        ],
        [
            "28"
        ],
        [
            "73"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Kalinga"
        ],
        [
            "Tayum"
        ],
        [
            "14,869"
        ],
        [
            "61.14"
        ],
        [
            "23.61"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Tineg"
        ],
        [
            "4,977"
        ],
        [
            "744.80"
        ],
        [
            "287.57"
        ],
        [
            "6.7"
        ],
        [
            "17"
        ],
        [
            "Municipality"
        ],
        [
            "2nd"
        ],
        [
            "Abra"
        ],
        [
            "Tinglayan"
        ],
        [
            "13,148"
        ],
        [
            "283.00"
        ],
        [
            "109.27"
        ],
        [
            "46"
        ],
        [
            "120"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Kalinga"
        ],
        [
            "Tinoc"
        ],
        [
            "18,475"
        ],
        [
            "239.70"
        ],
        [
            "92.55"
        ],
        [
            "77"
        ],
        [
            "200"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Ifugao"
        ],
        [
            "Tuba"
        ],
        [
            "48,312"
        ],
        [
            "295.97"
        ],
        [
            "114.27"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "Municipality"
        ],
        [
            "1st"
        ],
        [
            "Benguet"
        ],
        [
            "Tublay"
        ],
        [
            "19,429"
        ],
        [
            "102.55"
        ],
        [
            "39.59"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Benguet"
        ],
        [
            "Tubo"
        ],
        [
            "5,674"
        ],
        [
            "409.87"
        ],
        [
            "158.25"
        ],
        [
            "14"
        ],
        [
            "36"
        ],
        [
            "Municipality"
        ],
        [
            "4th"
        ],
        [
            "Abra"
        ],
        [
            "Villaviciosa"
        ],
        [
            "5,675"
        ],
        [
            "102.93"
        ],
        [
            "39.74"
        ],
        [
            "55"
        ],
        [
            "140"
        ],
        [
            "Municipality"
        ],
        [
            "5th"
        ],
        [
            "Abra"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of  Cordillera Administrative RegionYearPop.±% p.a.1903 145,186—    1918 267,041+4.15%1939 384,654+1.75%1948 364,720−0.59%1960 551,032+3.50%1970 730,906+2.86%1975 811,103+2.11%1980 914,432+2.43%1990 1,146,191+2.29%1995 1,254,838+1.71%2000 1,365,220+1.82%2007 1,520,847+1.50%2010 1,616,867+2.25%2015 1,722,006+1.21%2020 1,797,660+0.85%Source: Philippine Statistics Authority"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Further information: Igorot people"
        ],
        [
            "A man from Tinglayan vested in traditional garb holding a handcrafted weapon first produced during the Second World War; traditional Kalinga cloth is draped over Orthodox icons in the manner of Russian nabozhnyks."
        ],
        [
            "A Bontoc woman with a snake skeleton in her hair.",
            "Skeletons serve as a charm against lightning."
        ],
        [
            "Cordillera is home to many ethnic tribes living on the Cordillera mountain range.",
            "They are commonly referred to as the Igorot."
        ],
        [
            "Ethnic people of Abra"
        ],
        [
            "The Tingguians are composed of sub-groups known as the Itneg tribes which includes Adasen, Balatok, Banaw, Belwang, Binungan, Gubang, Inlaud, Mabaka, Maeng, Masadiit, and Muyadan or Ammutan.",
            ": Their places in Abra are as follows:"
        ],
        [
            "Adasen — Lagayan, Lagangilang, San Juan and Tineg"
        ],
        [
            "Banaw — Daguioman, Malibcong, also found in Balbalan, Kalinga"
        ],
        [
            "Binungan — Baay-Licuan and Lacub"
        ],
        [
            "Balatok — in the villages of Amti, Kilong-olaw, & Danak, all in Boliney"
        ],
        [
            "Belwang — in the village of Dao-angan in Boliney"
        ],
        [
            "Gubang — Malibcong"
        ],
        [
            "Inlaud — Lagangilang and Peñarrubia, in Lumaba village of Villaviciosa, in the villages of Abang and Patoc in Bucay, in Langiden, San Isidro, San Quintin, Danglas (also found in some parts of Nueva Era)"
        ],
        [
            "Mabaka — Lacub and Malibcong"
        ],
        [
            "Maeng — Luba, Tubo and Villaviciosa, (also found in San Emilio, Ilocos Sur, Banayoyo and other towns in Ilocos Sur)"
        ],
        [
            "Masadiit — Sallapadan, Bucloc and in the village of Sapdaan in Manabo, and in barangays Poblacion, Bawiyan, and Dumagas in Boliney"
        ],
        [
            "Ammutan a.k.a.",
            "Muyadan tribe — in Manabo"
        ],
        [
            "Ethnic people of Apayao"
        ],
        [
            "Isnag tribe — also known as Isneg comprising the sub-groups known as the Ymandaya and Imallod (Isnag refers to the people, while Isneg refers to the dialect).",
            "Isnags are found not only in Apayao but also in the eastern section of Ilocos Norte and northwestern portion of Cagayan.",
            "Their places of abode in Apayao are as follows:"
        ],
        [
            "Ymandaya (Isnag) — Calanasan (Bayag)"
        ],
        [
            "Imallod (Isnag) — Kabugao, Conner, Pudtol, and some parts of Luna (Macatel)"
        ],
        [
            "Malaweg — Conner"
        ],
        [
            "Ethnic people of Benguet"
        ],
        [
            "Ibaloi"
        ],
        [
            "Kankanaey"
        ],
        [
            "Kalanguya"
        ],
        [
            "Karao Tribe"
        ],
        [
            "Ethnic People of Ifugao"
        ],
        [
            "Ifugao"
        ],
        [
            "Tuwali"
        ],
        [
            "Ayangan"
        ],
        [
            "Kalanguya"
        ],
        [
            "Ifannawer - Banaue"
        ],
        [
            "Ethnic people of Kalinga"
        ],
        [
            "Kalinga"
        ],
        [
            "Tubog"
        ],
        [
            "Banao"
        ],
        [
            "Tanudan"
        ],
        [
            "Tanudan"
        ],
        [
            "Tongrayan"
        ],
        [
            "Ifutfut: Fugnay, Ngifat, Lacnog, Tabuk"
        ],
        [
            "Iterkaw: Nambaran, Tabuk"
        ],
        [
            "Ifasao: Isla, Appas Tabuk"
        ],
        [
            "Ichananaw: Lacnog, Tabuk"
        ],
        [
            "Itongrayan: Luprupa, Ifunug, Amfato, Damsite, Tabuk"
        ],
        [
            "Isumacher: Sumacher, Filong, Man-ufer, Mallango, Fangad, Madopdop, Lacnog, Ipil, Bayabat, Tannubong, Bulo.",
            "Tabuk"
        ],
        [
            "Ylubuagen: Lubuagan"
        ],
        [
            "Ipinukpuk"
        ],
        [
            "Kankana-ey"
        ],
        [
            "Bagbag-o"
        ],
        [
            "Ifontok"
        ],
        [
            "Ilocano"
        ],
        [
            "Ethnic people of Mountain Province"
        ],
        [
            "Bontoc — Bontoc"
        ],
        [
            "Balangao — Natonin"
        ],
        [
            "Baliwon — Paracelis"
        ],
        [
            "Applai: Bauko, Besao, Sabangan and Sagada"
        ],
        [
            "Languages"
        ],
        [
            "The region has been called \"the most diversified ethno-linguistic region in the Philippines\" The region has been using the Ilocano language as a lingua franca across different Igorot groups.",
            "The use of Filipino and English as the official languages of the Philippines is also implemented within the Cordillera."
        ],
        [
            "Balangao, spoken in Natonin, Mountain Province."
        ],
        [
            "Bontoc, spoken in Bontoc, Mountain Province."
        ],
        [
            "Ibaloi, spoken in Benguet."
        ],
        [
            "Ifugao, spoken in Ifugao."
        ],
        [
            "Ilocano, spoken in Apayao, Abra, Kalinga, Mountain Province, Benguet, and Ifugao.",
            "It is the regional lingua franca."
        ],
        [
            "Isnag, spoken in Apayao."
        ],
        [
            "Itneg, spoken in Abra."
        ],
        [
            "Kalinga, spoken in Kalinga."
        ],
        [
            "Kalanguya, spoken in some parts of Benguet."
        ],
        [
            "Kankanaey, spoken in western Mountain Province and some parts of Benguet."
        ],
        [
            "Religion"
        ],
        [
            "Like most other regions of the Philippines, Roman Catholicism is the single largest denomination in this region, however, a slightly lower (around 60–70% of the population) adhere to the faith, while Protestants, mostly Anglicans and Evangelicals forming a large minority at about 20–30% of the population.",
            "The traditional anitist religions maintain a significant presence in the region and are still practiced by the tribal people.",
            "There is a significant increasing members of Iglesia Ni Cristo for the landmarks like kapilyas (chapels) in each town approximately 4-6% ."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cordillera Administrative Region"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  25.95"
        ],
        [
            "2009  25.08"
        ],
        [
            "2012  22.84"
        ],
        [
            "2015  22.69"
        ],
        [
            "2018  12.05"
        ],
        [
            "2021  6.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Infrastructure"
        ],
        [
            "Roads and bridges"
        ],
        [
            "Apayao – Ilocos Norte Road – As a lateral road, the highway is a significant element of the Cordillera Roads Improvement Project (CRIP), connecting Northern Cordillera to the Ilocos Region. It traverses Apayao's Kabugao and Calanasan municipalities and turns west to Ilocos Norte's Solsona.",
            "This road project was started on January 7, 2013, and will be completed around December 2020."
        ],
        [
            "Culture"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(January 2015)"
        ],
        [
            "The Bontoc Museum, run by the Sisters of the Immaculate Heart of Mary, hosts many of the materials used by the different tribes of the Mountain Province."
        ],
        [
            "The Cordillera region is known for its unique musical instruments including the gangsa kalinga, nose flute, bamboo flute, buzzer, bangibang, tongatong, diwdiw-as, saggeypo, and bamboo zither."
        ],
        [
            "The region is also known for their dance, arts, and crafts like wood-carving, ibaloi basket, loom weaving, tinalik, loinclothes called ikat, amulets, tattoo, akob, bobo, suklang and ikat weaving."
        ],
        [
            "The symbol of the tattoo of the Bontocs is about being brave (because of the pain while inking), a talisman or a good luck charm against evil forces, or a symbol of a status or position (ex.",
            "Chief captain, Leader, Mayor).",
            "They also use tattoos as a decoration and clothes to their body using arts by drawing or placing inks with a pattern or abstract on their skin."
        ],
        [
            "It has been observed that the people in Cordillera make arts based on their emotions and belief.",
            "They use their talents in making arts and crafts as a source of income like wood-carving, basket-weaving, weaving clothes, amulets and ikat weaving.",
            "They have different patterns in weaving and they also have their own God that is called \"Bulul\", it is the God of the rice that is made and worshipped by the Ifugaos.",
            "Aside from their tattoo art, the Bontocs are also known for their excellence in making different baskets for storage and rice."
        ],
        [
            "Tourism"
        ],
        [
            "Maligcong rice terraces in Bontoc, Mountain Province"
        ],
        [
            "Banaue Rice Terraces which is part of the Rice Terraces of the Philippine Cordilleras (World Heritage Site)"
        ],
        [
            "Cassamata Hill National Park"
        ],
        [
            "Kabayan Mummies"
        ],
        [
            "Mount Data, Balbalasang-Balbalan National Park"
        ],
        [
            "Mount Pulag, the highest mountain in Luzon at 2,922 metres (9,587 ft) above sea level"
        ],
        [
            "Baguio Sites which includes Burnham Park, Minesview Park, The Mansion, Lion's Head, Camp John Hay Philippine Military Academy, Bell Church, Wright Park, Baguio Garden, and Centermall"
        ],
        [
            "See also"
        ],
        [
            "Cordillera Central (Luzon)"
        ],
        [
            "Luzon tropical pine forests"
        ],
        [
            "Cordillera autonomy movement"
        ],
        [
            "References"
        ],
        [
            "^ \"POPULATION PROJECTIONS BY REGION, PROVINCE, CITIES AND MUNICIPALITIES, 2020-2025\".",
            "www.doh.gov.ph.",
            "Department of Health.",
            "August 27, 2020.",
            "Archived from the original on May 14, 2021.",
            "Retrieved October 16, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b \"Gross Regional Domestic Product\".",
            "openstat.psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ a b \"Regional Profile: Cordillera Administrative Region (CAR)\".",
            "CountrySTAT Philippines.",
            "Archived from the original on October 22, 2014.",
            "Retrieved September 18, 2014."
        ],
        [
            "^ \"It's official: Philippine population at 109 million\".",
            "RAPPLER.",
            "July 8, 2021.",
            "Retrieved July 10, 2023."
        ],
        [
            "^ a b \"Mt.",
            "Province\".",
            "VisitMyPhilippines.com The Ultimate Travel Guide for Tourists.",
            "Department of Tourism.",
            "Retrieved December 23, 2013."
        ],
        [
            "^ Keesing, Felix; Keesing, Marie (1934).",
            "Taming Philippine Headhunters: A Study of Government and of Cultural Change in Northern Luzon.",
            "Stanford University Press.",
            "pp. 67–69.",
            "ISBN 9780804721103 – via Hathi Trust."
        ],
        [
            "^ \"Benguet History\".",
            "Province of Benguet (official website).",
            "Archived from the original on October 19, 2014.",
            "Retrieved October 22, 2014.",
            "Benguet was once part of Mountain Province."
        ],
        [
            "^ \"Historical Background\".",
            "Provincial Government of Apayao.",
            "Archived from the original on January 4, 2015.",
            "Retrieved January 3, 2015."
        ],
        [
            "^ Kasaysayan.",
            "Vol.",
            "3, no. 1–4.",
            "National Historical Institute.",
            "1978. p. 16 https://books.google.com/books?id=9MbjAAAAMAAJ.",
            "Retrieved January 2, 2015.",
            "{{cite magazine}}: Missing or empty |title= (help)"
        ],
        [
            "^ Ingles, Raul Rafael (2008).",
            "1908 :The Way it Really was: Historical Journal for the UP Centennial, 1908–2008.",
            "Diliman, Quezon City: University of the Philippines Press.",
            "pp.",
            "330, 339.",
            "ISBN 978-9715425803.",
            "Retrieved January 2, 2015."
        ],
        [
            "^ Worcester, Dean C.; Philippine Commission (1908).",
            "Seventh Annual Report of the Secretary of the Interior to the Philippine Commission for the Fiscal Year Ended June 30, 1908 (Digitized by Google on November 23, 2005 (Original file from the University of Michigan)).",
            "Manila: U.S. Government Printing Office.",
            "pp. 17–19.",
            "Retrieved January 2, 2015.",
            "Google Books link"
        ],
        [
            "^ Philippines.",
            "Census Office; Buencamino, Felipe; Villamor, Ignacio (1920).",
            "Census of the Philippine Islands Taken Under the Direction of the Philippine Legislature in the Year 1918, Volume 1.",
            "Bureau of printing.",
            "p. 68."
        ],
        [
            "^ \"Cordillera Administrative Region History\".",
            "Cordillera Connection (Blogspot).",
            "August 14, 2009.",
            "Retrieved October 22, 2014."
        ],
        [
            "^ \"Republic Act No.",
            "4695: An Act Creating the Provinces of Benguet, Mountain Province, Ifugao and Kalinga-Apayao\".",
            "Chan Robles Virtual Law Library.",
            "Retrieved September 18, 2014."
        ],
        [
            "^ \"Facts & Figures: Ifugao Province\".",
            "Philippine Statistics Authority – National Statistical Coordination Board.",
            "Department of the Interior and Local Government – Cordillera Administrative Region.",
            "Retrieved January 2, 2015."
        ],
        [
            "^ \"Historical Background\".",
            "Provincial Government of Apayao.",
            "April 15, 2013.",
            "Archived from the original on January 4, 2015.",
            "Retrieved January 3, 2015."
        ],
        [
            "^ \"DULAG, Macli-ing – Bantayog ng mga Bayani\".",
            "Bantayog ng mga Bayani.",
            "Bantayog Memorial Center.",
            "October 15, 2015.",
            "Retrieved September 23, 2017."
        ],
        [
            "^ Doyo, Ma.",
            "Ceres P. (2015).",
            "Macli-ing Dulag: Kalinga Chief, Defender of the Cordillera.",
            "Diliman, Quezon City: University of the Philippines Press.",
            "ISBN 978-971-542-772-2."
        ],
        [
            "^ a b c d Cariño, Joanna K. (April 22–27, 1980).",
            "\"The Chico River Basin Development Project: A Case Study of National Development Policy\".",
            "Paper Presented at the Third Annual Conference of the Anthropological Association of the Philippines.",
            "Manila.",
            "Archived from the original on April 14, 2018."
        ],
        [
            "^ Marcos, Ferdinand E. (December 12, 1975).",
            "\"Presidential Decree No 848 ONSTITUTING CERTAIN MUNICIPALITIES WITHIN THE PROVINCE OF KALINGA-APAYAO INTO A SPECIAL DEVELOPMENT REGION TO BE KNOWN AS KALINGA SPECIAL DEVELOPMENT REGION\".",
            "CHAN ROBLES VIRTUAL LAW LIBRARY.",
            "Retrieved April 14, 2018."
        ],
        [
            "^ Catajan, Maria Elena (April 22, 2017).",
            "\"Chico hydro project opposed\".",
            "SunStar.",
            "Archived from the original on April 22, 2017.",
            "Retrieved April 14, 2018."
        ],
        [
            "^ Aureus, Leonor J., ed.",
            "(1985).",
            "The Philippine Press Under Siege II."
        ],
        [
            "^ \"The Cordillera Administrative Region (CAR)\".",
            "Department of Agriculture.",
            "Retrieved September 18, 2014."
        ],
        [
            "^ \"R.A. No.",
            "7878: An Act Converting the Sub-Provinces of Kalinga and Apayao into Regular Provinces to be Known as the Province of Kalinga and the Province of Apayao, Amending for the Purpose Republic Act No.",
            "4695\".",
            "Chan Robles Virtual Law Library.",
            "February 14, 1995.",
            "Retrieved January 4, 2015."
        ],
        [
            "^ \"Facts & Figures: Apayao Province\".",
            "Philippine Statistics Authority – National Statistical Coordination Board.",
            "April 19, 2012.",
            "Retrieved January 4, 2015."
        ],
        [
            "^ a b c Ferrer, Miriam Coronel (September 4, 2010).",
            "\"Cordillera autonomy – Miriam Coronel Ferrer\".",
            "ABS-CBN News.",
            "Retrieved January 4, 2015."
        ],
        [
            "^ a b c \"Cordillera Autonomy\".",
            "Scribd Inc. Dona Dee Lacdao.",
            "Retrieved January 4, 2015."
        ],
        [
            "^ \"R.A. No.",
            "6766: An Act Providing for an Organic Act for the Cordillera Autonomous Region\".",
            "The LawPhil Project.",
            "Congress of the Philippines.",
            "Retrieved January 4, 2015."
        ],
        [
            "^ \"R.A. No.",
            "8438: An Act to Establish the Cordillera Autonomous Region\".",
            "The LawPhil Project.",
            "Congress of the Philippines.",
            "Retrieved January 4, 2015."
        ],
        [
            "^ \"Creation of Cordillera Autonomous Region pushed\".",
            "July 2, 2017."
        ],
        [
            "^ \"Mayor Domogan optimistic on OK of Cordillera Autonomous Region bill with P75B investments\".",
            "July 2, 2017."
        ],
        [
            "^ a b c d e \"Car | Dof – Bureau of Local Government Finance\"."
        ],
        [
            "^ Cordillera People's Alliance, Public Information Commission (January 1, 2001).",
            "\"Dams In the Cordillera\" (PDF).",
            "International Rivers.",
            "Archived from the original (PDF) on January 4, 2015.",
            "Retrieved January 4, 2015."
        ],
        [
            "^ \"Cordillera's Water Resources\".",
            "Cordillera Peoples Alliance.",
            "Retrieved January 4, 2015."
        ],
        [
            "^ \"POPULATION PROJECTIONS BY REGION, PROVINCE, CITIES AND MUNICIPALITIES, 2020-2025\".",
            "www.doh.gov.ph.",
            "Department of Health.",
            "August 27, 2020.",
            "Archived from the original on May 14, 2021.",
            "Retrieved October 16, 2020."
        ],
        [
            "^ \"PSGC Interactive; List of Provinces\".",
            "Philippine Statistics Authority.",
            "Archived from the original on January 17, 2013.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ Census of Population (2020).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSGC Interactive; List of Cities\".",
            "Philippine Statistics Authority.",
            "Archived from the original on April 29, 2011.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities\" (PDF).",
            "2010 Census and Housing Population.",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on September 28, 2013.",
            "Retrieved August 9, 2013."
        ],
        [
            "^ \"Tingguian\".",
            "Archived from the original on November 16, 2011.",
            "Retrieved January 14, 2012."
        ],
        [
            "^ \"National Commission for Culture and the Arts\".",
            "Archived from the original on January 15, 2015.",
            "Retrieved January 15, 2015."
        ],
        [
            "^ \"Intriguing Patterns in Scolbert08's Map of Religion in Insular Southeast Asia\".",
            "GeoCurrents.",
            "Retrieved December 6, 2017."
        ],
        [
            "^ \"Philippine Church National Summary\".",
            "philchal.org.",
            "Archived from the original on October 10, 2017.",
            "Retrieved December 6, 2017."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Apayao – Ilocos Norte Road\".",
            "Department of Public Works and Highways.",
            "Archived from the original on June 17, 2021.",
            "Retrieved August 9, 2019."
        ],
        [
            "External links"
        ],
        [
            " Media related to Cordillera Administrative Region at Wikimedia Commons"
        ],
        [
            " Cordillera Administrative Region travel guide from Wikivoyage"
        ],
        [
            " Geographic data related to Cordillera Administrative Region at OpenStreetMap"
        ],
        [
            "Places adjacent to Cordillera Administrative Region"
        ],
        [
            "Cagayan Valley"
        ],
        [
            "Ilocos Region"
        ],
        [
            "Cordillera Administrative Region"
        ],
        [
            "Cagayan Valley"
        ],
        [
            "Ilocos Region"
        ],
        [
            "vteCordillera Administrative Region (CAR)Regional center"
        ],
        [
            "Baguio"
        ],
        [
            "Provinces"
        ],
        [
            "Abra"
        ],
        [
            "Apayao"
        ],
        [
            "Benguet"
        ],
        [
            "Ifugao"
        ],
        [
            "Kalinga"
        ],
        [
            "Mountain Province"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Baguio"
        ],
        [
            "Component city"
        ],
        [
            "Tabuk"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Bangued"
        ],
        [
            "Bontoc"
        ],
        [
            "Kabugao"
        ],
        [
            "La Trinidad"
        ],
        [
            "Lagawe"
        ],
        [
            "Tabuk"
        ],
        [
            "Municipalities"
        ],
        [
            "Aguinaldo"
        ],
        [
            "Alfonso Lista"
        ],
        [
            "Asipulo"
        ],
        [
            "Atok"
        ],
        [
            "Bakun"
        ],
        [
            "Balbalan"
        ],
        [
            "Banaue"
        ],
        [
            "Bangued"
        ],
        [
            "Barlig"
        ],
        [
            "Bauko"
        ],
        [
            "Besao"
        ],
        [
            "Bokod"
        ],
        [
            "Boliney"
        ],
        [
            "Bontoc"
        ],
        [
            "Bucay"
        ],
        [
            "Bucloc"
        ],
        [
            "Buguias"
        ],
        [
            "Calanasan"
        ],
        [
            "Conner"
        ],
        [
            "Daguioman"
        ],
        [
            "Danglas"
        ],
        [
            "Dolores"
        ],
        [
            "Flora"
        ],
        [
            "Hingyon"
        ],
        [
            "Hungduan"
        ],
        [
            "Itogon"
        ],
        [
            "Kabayan"
        ],
        [
            "Kabugao"
        ],
        [
            "Kapangan"
        ],
        [
            "Kiangan"
        ],
        [
            "Kibungan"
        ],
        [
            "La Paz"
        ],
        [
            "La Trinidad"
        ],
        [
            "Lacub"
        ],
        [
            "Lagangilang"
        ],
        [
            "Lagawe"
        ],
        [
            "Lagayan"
        ],
        [
            "Lamut"
        ],
        [
            "Langiden"
        ],
        [
            "Licuan-Baay"
        ],
        [
            "Luba"
        ],
        [
            "Lubuagan"
        ],
        [
            "Luna"
        ],
        [
            "Malibcong"
        ],
        [
            "Manabo"
        ],
        [
            "Mankayan"
        ],
        [
            "Mayoyao"
        ],
        [
            "Natonin"
        ],
        [
            "Paracelis"
        ],
        [
            "Pasil"
        ],
        [
            "Peñarrubia"
        ],
        [
            "Pidigan"
        ],
        [
            "Pilar"
        ],
        [
            "Pinukpuk"
        ],
        [
            "Pudtol"
        ],
        [
            "Rizal"
        ],
        [
            "Sabangan"
        ],
        [
            "Sablan"
        ],
        [
            "Sadanga"
        ],
        [
            "Sagada"
        ],
        [
            "Sallapadan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Juan"
        ],
        [
            "San Quintin"
        ],
        [
            "Santa Marcela"
        ],
        [
            "Tadian"
        ],
        [
            "Tanudan"
        ],
        [
            "Tayum"
        ],
        [
            "Tineg"
        ],
        [
            "Tinglayan"
        ],
        [
            "Tinoc"
        ],
        [
            "Tuba"
        ],
        [
            "Tublay"
        ],
        [
            "Tubo"
        ],
        [
            "Villaviciosa"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vteRegions of the PhilippinesLuzon"
        ],
        [
            "NCR – National Capital Region"
        ],
        [
            "CAR – Cordillera Administrative Region"
        ],
        [
            "I – Ilocos Region"
        ],
        [
            "II – Cagayan Valley"
        ],
        [
            "III – Central Luzon"
        ],
        [
            "IV-A – Calabarzon"
        ],
        [
            "Mimaropa – Southwestern Tagalog Region"
        ],
        [
            "V – Bicol Region"
        ],
        [
            "Visayas"
        ],
        [
            "VI – Western Visayas"
        ],
        [
            "NIR – Negros Island Region"
        ],
        [
            "VII – Central Visayas"
        ],
        [
            "VIII – Eastern Visayas"
        ],
        [
            "Mindanao"
        ],
        [
            "IX – Zamboanga Peninsula"
        ],
        [
            "X – Northern Mindanao"
        ],
        [
            "XI – Davao Region"
        ],
        [
            "XII – Soccsksargen"
        ],
        [
            "XIII – Caraga Region"
        ],
        [
            "BARMM – Bangsamoro Autonomous Region in Muslim Mindanao"
        ],
        [
            "Former regions"
        ],
        [
            "ARMM – Autonomous Region in Muslim Mindanao"
        ],
        [
            "IV – Southern Tagalog"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cordillera_Administrative_Region&oldid=1232590631\""
        ],
        [
            "Categories: Cordillera Administrative RegionRegions of the PhilippinesLuzonHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: missing titleCS1 errors: bare URLWikipedia articles needing clarification from August 2022Articles with short descriptionShort description matches WikidataUse mdy dates from May 2020Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishShort description is different from WikidataPages using multiple image with auto scaled imagesCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textPages with Tagalog IPAArticles needing additional references from March 2019All articles needing additional referencesArticles to be expanded from January 2015All articles to be expandedArticles using small message boxesAll articles with unsourced statementsArticles with unsourced statements from October 2021Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}