{
    "name": "Davao Region",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Davao Region"
        ],
        [
            "43 languages"
        ],
        [
            "閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoChavacano de ZamboangaDeutschEspañolEsperantoEuskaraفارسیFrançais한국어हिन्दीHrvatskiIlokanoItalianoKapampanganქართულიLatinaLatviešuLietuviųМакедонскиBahasa MelayuNederlands日本語PangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوVènetoTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°05′N 125°35′E﻿ / ﻿7.08°N 125.58°E﻿ / 7.08; 125.58"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Administrative region of the Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Davao Region\" – news · newspapers · books · scholar · JSTOR (August 2013) (Learn how and when to remove this message)"
        ],
        [
            "Region in Mindanao, PhilippinesDavao RegionRegion"
        ],
        [
            "Clockwise from the top: Davao City aerial view, Mount Apo, Pujada Bay, Aliwagwag Protected Landscape, TagumNickname: Cacao Capital of the Philippines  • Total5,243,536 • Density260/km2 (670/sq mi)DemonymDavaoeñoTime zoneUTC+8 (PST)ISO 3166 codePH-11Provinces"
        ],
        [
            "5"
        ],
        [
            " Davao de Oro"
        ],
        [
            " Davao del Norte"
        ],
        [
            " Davao del Sur"
        ],
        [
            " Davao Occidental"
        ],
        [
            " Davao Oriental"
        ],
        [
            "Independent cities"
        ],
        [
            "1"
        ],
        [
            " Davao City"
        ],
        [
            "Component cities"
        ],
        [
            "5"
        ],
        [
            " Digos"
        ],
        [
            " Mati"
        ],
        [
            " Panabo"
        ],
        [
            " Samal"
        ],
        [
            " Tagum"
        ],
        [
            "Municipalities43Barangays1162Cong.",
            "districts11LanguagesCebuanoMandayaKalaganGianganDibabawonTagabawaMansakaSangireseOboSaranganiTagalogFilipinoEnglishGDP (2023)₱1.018 trillion$18.51 billionHDI 0.697 (Medium)HDI rank10th in the Philippines (2019)"
        ],
        [
            "Davao Region, formerly called Southern Mindanao (Cebuano: Rehiyon sa Dabaw; Filipino: Rehiyon ng Davao), is an administrative region in the Philippines, designated as Region XI.",
            "It is situated at the southeastern portion of Mindanao and comprises five provinces: Davao de Oro, Davao del Norte, Davao del Sur, Davao Oriental, and Davao Occidental."
        ],
        [
            "The region encloses Davao Gulf, and its regional center and largest city is Davao City.",
            "Dávao is the Hispanicized pronunciation of daba-daba, the Bagobo word for \"fire\"."
        ],
        [
            "Etymology"
        ],
        [
            "Many historians believe that the name Davao is the mixture of the three names that three different tribes, the earliest settlers in the region, had for the Davao River.",
            "The Manobos, an aboriginal tribe, referred to the Davao Rivers as Davohoho.",
            "Another tribe, the Bagobos, referred to the river as Davohaha, which means \"fire\", while another tribe, the Guiangan tribe, called the river as Duhwow."
        ],
        [
            "History"
        ],
        [
            "The history of the region dates back to the times when various tribes occupied the region.",
            "It is believed that the Manobos, Mandayas, Kalagans, Mansakas, and Bagobos occupied the area.",
            "These are the same tribes that created the small settlements and communities that eventually became Mindanao."
        ],
        [
            "Maguindanao era"
        ],
        [
            "The Davao Region was once part of Sultanate of Maguindanao and was called \"Pinagurasan\" by the Maguindanaons.",
            "Early settlers of the region were Maguindanaons and the Tausugs under the Sultanate of Sulu.",
            "Datu Bago was one of the Datus in Davao Gulf who resisted the Spanish Empire colonization on the region."
        ],
        [
            "First European contact"
        ],
        [
            "The Davao Gulf area was the first region in the country that was in contact with the Europeans, with such contacts taking place as early as 16th century.",
            "The Portuguese preceded the Spaniards, who were the ones to colonize the region albeit much later, in sighting and visiting the region.",
            "In 1512, Francisco Serrano was shipwrecked in the shallow waters and coral reefs of Cape of San Agustín, located in what is now the province of Davao Oriental.",
            "In 1538, Francisco de Castro, a Portuguese ship captain, was driven by strong winds to the southeastern coast of Mindanao.",
            "He baptized several chieftains in the area."
        ],
        [
            "Around January 1546, Francis Xavier, a Jesuit priest, left Malacca and went to Molucca Islands, then called the Spice Islands, where the Portuguese had some settlements, and for a year and a half he preached the Gospel to the inhabitants of Amboyna, Ternate, Baranura, and other lesser islands.",
            "It is claimed by some of the seventeenth century, and in the Bull of canonization issued in 1623.",
            "It is also said that he is the one to have preached the Gospel in Mindanao."
        ],
        [
            "Spanish administration"
        ],
        [
            "For centuries the tribes lived in relative peace until the Spanish, under the adventurous Spanish businessman Don Jose Oyanguren, arrived in the region in 1847.",
            "At that time, the Kalagan Moro chieftain Datu Bago was in control of the area in what is now Davao City.",
            "Don Oyanguren attempted to conquer the area which Datu Bago ruled; although he failed at first, the Moro chieftain eventually evacuated his people to live in the areas near Mount Apo.",
            "This is the time the town of Davao, then called Nueva Vergara by the Spaniards, was established in the year 1848."
        ],
        [
            "Don Oyanguren attempted to develop the region.",
            "Although the Spanish gained the upper hand when they finally controlled the ports of the region, the population of Davao grew very slowly until the arrival of Christian missionaries in the area in 1890.",
            "Unlike the major parts of Luzon, Visayas and other coastal parts of Mindanao, Spanish rule in Davao lasted only for 50 years, abandoning it in 1898 when the Philippines became independent from Spain, making it among the shortest-lived areas controled by Spain."
        ],
        [
            "American administration"
        ],
        [
            "After the Spanish–American War in 1898, Spanish rule in the region ended.",
            "Americans then landed in the region and they subsequently developed the regions communications and transportation systems.",
            "During this period, private farm ownership grew in the region.",
            "Japanese migration in the region began as two Japanese entrepreneurs, Kyosaburo Ohta and Yoshizo Furukawa, were finding better agricultural lands for building abaca and coconut plantations in the region.",
            "The Port of Davao was opened on 1900, becoming the first Philippine international port to be established in the south."
        ],
        [
            "In 1903 until 1914, the region was one of the districts of the former Moro Province in Mindanao.",
            "After 1914, the province was replaced by an American colonial agency called Department of Mindanao and Sulu, which spanned the entire Mindanao island except Lanao.",
            "The agency lasted from 1914 to 1920."
        ],
        [
            "Wartime Japanese occupation"
        ],
        [
            "In 1942, during World War II, as the Japanese occupation of the Philippines began, the region was one of the first among the Philippine regions to be subjected by Japanese occupation.",
            "The Japanese immigrants in Davao acted as a fifth column, welcoming the Japanese invaders during World War II.",
            "These Japanese were hated by the Moro Muslims and disliked by the Chinese.",
            "The longest battle of the Allied liberation campaign, the Battle of Davao, took place in 1945.",
            "After the war, the region eventually passed to the American hands again for at least almost one year before the formal Philippine independence on July 4, 1946, most of the Japanese living in the region were now integrated in the Filipino population."
        ],
        [
            "Philippine administration"
        ],
        [
            "Davao province"
        ],
        [
            "Prior to Philippine independence in 1946, the entire region was a single province called Davao Province, with Davao City serving as its capital.",
            "The province was one of the largest provinces in the Philippines during that time, spanning more than 20,000 square kilometres (7,700 sq mi).",
            "It lasted from 1920 until 1967, when the province was split into three provinces in May 1967: Davao del Norte, Davao del Sur and Davao Oriental.",
            "After the division, Davao City was officially named its regional center."
        ],
        [
            "Southern Mindanao and Davao Region"
        ],
        [
            "Region XI, then known as Southern Mindanao, originally covered 6 provinces (Compostela Valley, Davao del Norte, Davao del Sur, Davao Oriental, South Cotabato and Sarangani), and the cities of Davao, Digos, Panabo, Tagum, Samal, General Santos and Koronadal.",
            "Surigao del Sur was moved to the newly created region Caraga on February 23, 1995."
        ],
        [
            "In September 2001, Executive Order No.",
            "36 was enacted which reorganized the regions in Mindanao.",
            "Region XI, then known as Southern Mindanao, was renamed Davao Region, and the provinces of South Cotabato and Sarangani, and the cities of General Santos and Koronadal were moved to Region XII."
        ],
        [
            "On October 12, 2022, the Regional Peace and Order Council declared the entire region \"insurgency-free\" after decades of being a stronghold for the communist insurgency, barring some scattered members of the New People's Army that are left in the region."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Map of Region XI"
        ],
        [
            "Provinces"
        ],
        [
            "Davao Region is subdivided into 5 provinces, 1 highly urbanized city, 5 component cities, 43 municipalities and 1,162 barangays."
        ],
        [
            "Province or HUC"
        ],
        [
            "Capital"
        ],
        [
            "Population (2015)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Cities"
        ],
        [
            "Muni."
        ],
        [
            "Barangay"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Nabunturan"
        ],
        [
            "15.0%"
        ],
        [
            "736,107"
        ],
        [
            "4,479.77"
        ],
        [
            "1,729.65"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "0"
        ],
        [
            "11"
        ],
        [
            "237"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Tagum"
        ],
        [
            "20.8%"
        ],
        [
            "1,016,332"
        ],
        [
            "3,426.97"
        ],
        [
            "1,323.16"
        ],
        [
            "300"
        ],
        [
            "780"
        ],
        [
            "3"
        ],
        [
            "8"
        ],
        [
            "223"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Digos City"
        ],
        [
            "12.9%"
        ],
        [
            "632,588"
        ],
        [
            "2,163.98"
        ],
        [
            "835.52"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "1"
        ],
        [
            "9"
        ],
        [
            "232"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Malita"
        ],
        [
            "6.5%"
        ],
        [
            "316,342"
        ],
        [
            "2,163.45"
        ],
        [
            "835.31"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "0"
        ],
        [
            "5"
        ],
        [
            "105"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Mati"
        ],
        [
            "11.4%"
        ],
        [
            "558,958"
        ],
        [
            "5,679.64"
        ],
        [
            "2,192.92"
        ],
        [
            "98"
        ],
        [
            "250"
        ],
        [
            "1"
        ],
        [
            "10"
        ],
        [
            "183"
        ],
        [
            "Davao City"
        ],
        [
            "†"
        ],
        [
            "—"
        ],
        [
            "33.4%"
        ],
        [
            "1,632,991"
        ],
        [
            "2,443.61"
        ],
        [
            "943.48"
        ],
        [
            "670"
        ],
        [
            "1,700"
        ],
        [
            "—"
        ],
        [
            "—"
        ],
        [
            "182"
        ],
        [
            "Total"
        ],
        [
            "4,893,318"
        ],
        [
            "20,433.38"
        ],
        [
            "7,889.37"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "6"
        ],
        [
            "43"
        ],
        [
            "1,162"
        ],
        [
            " †  Davao City is a highly urbanized city; figures are excluded from Davao del Sur."
        ],
        [
            "Governors and vice governors"
        ],
        [
            "Province"
        ],
        [
            "Image"
        ],
        [
            "Governor"
        ],
        [
            "Political Partymed Office"
        ],
        [
            "Vice Governor"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Dorothy Gonzaga"
        ],
        [
            "Reporma"
        ],
        [
            "Jayvee Tyron Uy"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Edwin Jubahib"
        ],
        [
            "Reporma"
        ],
        [
            "De Carlo Lim Uy"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Yvonne Rhona Cagas"
        ],
        [
            "Nacionalista"
        ],
        [
            "Riafe Cagas-Fernandez"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Franklin Bautista"
        ],
        [
            "Lakas"
        ],
        [
            "Lorna Bautista-Bandigan"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Corazon Nuñez Malanyaon"
        ],
        [
            "Nacionalista"
        ],
        [
            "Niño Sotero Uy Jr."
        ],
        [
            "Cities"
        ],
        [
            " †  Regional center"
        ],
        [
            "City"
        ],
        [
            "Population (2015)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Founding year"
        ],
        [
            "City class"
        ],
        [
            "Income class"
        ],
        [
            "Province"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "† Davao City"
        ],
        [
            "1,632,991"
        ],
        [
            "2,443.61"
        ],
        [
            "943.48"
        ],
        [
            "670"
        ],
        [
            "1,700"
        ],
        [
            "1848 (cityhood: 1936)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "1st"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Digos"
        ],
        [
            "169,393"
        ],
        [
            "287.10"
        ],
        [
            "110.85"
        ],
        [
            "590"
        ],
        [
            "1,500"
        ],
        [
            "1949 (cityhood: 2000)"
        ],
        [
            "Component"
        ],
        [
            "2nd"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Mati"
        ],
        [
            "141,141"
        ],
        [
            "588.63"
        ],
        [
            "227.27"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "1861 (cityhood: 2007)"
        ],
        [
            "5th"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Panabo"
        ],
        [
            "184,599"
        ],
        [
            "251.23"
        ],
        [
            "97.00"
        ],
        [
            "730"
        ],
        [
            "1,900"
        ],
        [
            "1949 (cityhood: 2001)"
        ],
        [
            "3rd"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Samal"
        ],
        [
            "104,123"
        ],
        [
            "301.30"
        ],
        [
            "116.33"
        ],
        [
            "350"
        ],
        [
            "910"
        ],
        [
            "1948 (cityhood: 1998)"
        ],
        [
            "4th"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Tagum"
        ],
        [
            "259,444"
        ],
        [
            "195.80"
        ],
        [
            "75.60"
        ],
        [
            "1,300"
        ],
        [
            "3,400"
        ],
        [
            "1941 (cityhood: 1998)"
        ],
        [
            "1st"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Climate"
        ],
        [
            "The region has a generally uniform distribution of rainfall through the year.",
            "It lies outside the typhoon belt."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Davao RegionYearPop.±% p.a.1903 65,463—    1918 108,222+3.41%1939 292,600+4.85%1948 364,854+2.48%1960 893,023+7.74%1970 1,475,936+5.15%1975 1,825,386+4.35%1980 2,198,683+3.79%YearPop.±% p.a.1990 2,933,743+2.93%1995 3,288,824+2.16%2000 3,676,163+2.42%2007 4,159,469+1.72%2010 4,468,563+2.64%2015 4,893,318+1.74%2020 5,243,536+1.37%Source: Philippine Statistics Authority"
        ],
        [
            "See also: Davaoeño people and List of people from Davao"
        ],
        [
            "Davao Region is the most populous region in Mindanao and the 7th most populous in the country, with a total of 5,243,536 inhabitants in 2020.",
            "Davao City, its regional capital, is also the largest city in Mindanao, with an area of 2,444 km2, the largest in the country and one of the largest in the world, and has 1,632,991 inhabitants in 2015, making it the third most populous city in the country and the most populous city proper in the entire Visayas-Mindanao region.",
            "Davao Metropolitan Area, the primary economic and urban build-up area in the region, is also the most populous in the island and the third most populous in the country, with about 2,274,913 inhabitants in that year."
        ],
        [
            "Most of the region's inhabitants speak Cebuano.",
            "Filipino and English are also spoken and widely used in schools, businesses, commerce, and industry.",
            "In the Davao City Metro Area, a linguistic phenomenon has developed whereby locals have either shifted to Filipino or significantly mix Filipino terms and grammar into their Cebuano speech.",
            "Minority indigenous groups of the region speak their own languages as well."
        ],
        [
            "Chinese immigrants are widespread in the region, with a considerable population based in Davao City.",
            "Davao Chinatown is one of the two defined Chinatowns in the Philippines, alongside Binondo in Manila.",
            "A considerable population of Japanese are also found in the region, most of them also located in Davao City.",
            "Before World War II, Davao was and still is heavily populated by Japanese immigrants and their descendants, with Davao City being touted at one point in its history as the Little Tokyo of the Philippines."
        ],
        [
            "Religion"
        ],
        [
            "The majority of the region's population are Christians, mostly Catholics (73.29%); however, there are also Muslims (3.55%), Buddhists (0.03%), and Shintoists living in the region."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Davao Region"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  30.64"
        ],
        [
            "2009  31.38"
        ],
        [
            "2012  30.74"
        ],
        [
            "2015  23.51"
        ],
        [
            "2018  19.07"
        ],
        [
            "2021  11.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "A view of Davao City as seen in July 2018"
        ],
        [
            "While the region's economy is predominantly agri-based, it is now developing into a center for agro-industrial business, trade and tourism.",
            "Its competitive advantage is in agri-industry as its products, papayas, mangoes, bananas, pineapples, fresh asparagus, flowers, and fish products are exported internationally.",
            "The region can be a vital link to markets in other parts of Mindanao, Brunei Darussalam and parts of Malaysia and Indonesia.",
            "There is also a growing call center sector in the region, mostly centered in Davao City."
        ],
        [
            "There is a gradual shift to industrialization as shown with industry's growth rate of 8.1% in 1996.",
            "Other economic activities are mining, fishery, forestry and agriculture.",
            "Due to the region's rise as the main commercial and industrial hub of Mindanao, many of its workers are oriented to urban services such as putting small-scale businesses and working in commercial industries in thriving urban areas like Davao, Tagum, and Digos.",
            "Both private and foreign investors and businessmen are putting up huge business centers in the region, fueling up its commercial growth rate."
        ],
        [
            "The region is also venturing to online business like outsourcing."
        ],
        [
            "Ports and airport"
        ],
        [
            "The region's principal ports are the Sasa International Seaport in Sasa and Santa Ana Pier in the Chinatown District, both in Davao City; Panabo Seaport in Davao del Norte; and Mati Seaport in Davao Oriental.",
            "The former two, both of which are located in Port of Davao in Davao City, can service both interisland and international shipments.",
            "Sasa International Container Port, also located in the Port of Davao, is the busiest in Mindanao."
        ],
        [
            "The international airport in Davao City, Francisco Bangoy International Airport, is the largest and most developed in Mindanao, has the first longest runway in the island, and the third busiest in the country, after Ninoy Aquino International Airport and Mactan–Cebu International Airport.",
            "Being the only airport in the island that is currently catering for international destinations, it can handle both domestic and international flights, serving several domestic flights to Manila, Cebu, Bacolod, Iloilo, Zamboanga and other major Philippine cities, and international flights to Doha, Hong Kong, Manado, Quanzhou, and Singapore.",
            "Its ATC Tower is the most advanced in the country."
        ],
        [
            "The region is accessible by land, air and sea.",
            "The region has adequate communications facilities, reliable power, and an abundant water supply."
        ],
        [
            "In December 2016, President Duterte helped enter a contract with Chinese investors to create a new port in the region of Isla Verde in Davao."
        ],
        [
            "Government"
        ],
        [
            "Legislators to the House of Representatives for Region 11"
        ],
        [
            "See also: 17th Congress of the Philippines"
        ],
        [
            "Davao de Oro"
        ],
        [
            "1st"
        ],
        [
            "Maria Carmen Zamora"
        ],
        [
            "PDP–Laban"
        ],
        [
            "3"
        ],
        [
            "Majority"
        ],
        [
            "2nd"
        ],
        [
            "Ruwel Peter Gonzaga"
        ],
        [
            "PDP–Laban"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "Davao City"
        ],
        [
            "1st"
        ],
        [
            "Karlo Nograles"
        ],
        [
            "NUP"
        ],
        [
            "3"
        ],
        [
            "Majority"
        ],
        [
            "2nd"
        ],
        [
            "Mylene Garcia-Albano"
        ],
        [
            "Liberal"
        ],
        [
            "3"
        ],
        [
            "Majority"
        ],
        [
            "3rd"
        ],
        [
            "Alberto Ungab"
        ],
        [
            "Nacionalista/Hugpong"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "Davao del Norte"
        ],
        [
            "1st"
        ],
        [
            "Pantaleon Alvarez"
        ],
        [
            "PDP–Laban"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "2nd"
        ],
        [
            "Antonio Floirendo, Jr."
        ],
        [
            "PDP–Laban"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Lone"
        ],
        [
            "Mercedes Cagas"
        ],
        [
            "Nacionalista"
        ],
        [
            "2"
        ],
        [
            "Majority"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Lone"
        ],
        [
            "Claude P. Bautista"
        ],
        [
            "Liberal"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "Davao Oriental"
        ],
        [
            "1st"
        ],
        [
            "Corazon Malanyaon"
        ],
        [
            "Nacionalista"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "2nd"
        ],
        [
            "Joel Mayo Almario"
        ],
        [
            "Lakas"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "Provincial governors and city mayors"
        ],
        [
            "Davao de Oro — Gov.",
            "Jayvee Tyron L. Uy (Reporma)"
        ],
        [
            "Davao del Norte — Gov.",
            "Edwin I. Jubahib (PDP–Laban)"
        ],
        [
            "Davao del Sur — Gov.",
            "Douglas R. Cagas (Independent)"
        ],
        [
            "Davao Occidental - Gov.",
            "Franklyn P. Bautista (Hugpong ng Pagbabago)"
        ],
        [
            "Davao Oriental — Gov.",
            "Nelson L. Dayanghirang (Hugpong ng Pagbabago)"
        ],
        [
            "Davao City — Mayor Sebastian Z. Duterte (Hugpong ng Pagbabago)"
        ],
        [
            "Education"
        ],
        [
            "The government provides free education at the primary (grade school) and secondary (high school) levels.",
            "Some state-run universities in the region are the University of the Philippines Mindanao and the University of Southeastern Philippines.",
            "Private colleges / universities in Davao include Ateneo de Davao University, Assumption College of Davao, Holy Cross of Davao College, Holy Child College of Davao, and University of the Immaculate Conception.",
            "The literacy rate of the country is 93.9%; Davao City has a literacy rate of 98.05%."
        ],
        [
            "References"
        ],
        [
            "^ \"Republic Act No.",
            "11547, AN ACT DECLARING THE CITY OF DAVAO AS THE CHOCOLATE CAPITAL OF THE PHILIPPINES AND THE ENTIRE REGION X1 (DAVAO REGION) AS THE CACAO CAPITAL OF THE PHILIPPINES\" (PDF).",
            "Official Gazette.",
            "Retrieved May 27, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ a b \"2021 to 2023 Gross Regional Domestic Product (GRDP)\".",
            "openstat.psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ List of Regions Archived October 13, 2008, at the Wayback Machine, ."
        ],
        [
            "^ Curtis 1942, p. 4."
        ],
        [
            "^ CURTIS 1942, p. 4."
        ],
        [
            "^ \"80 Japanese Troop Ships Are Sighted Off Luzon\" 1941, p. 7."
        ],
        [
            "^ AP 1941, p. 1."
        ],
        [
            "^ \"SITUATION AT DAVAO OBSCURE AS JAPS LAND\" 1941, p. 2."
        ],
        [
            "^ \"THE JAPS SWARM AT DAVAO BUT THE SITUATION OBSCURE\" 1941, p. 3."
        ],
        [
            "^ \"Six Japanese Bombers In New Raid On Manila\" 1941, p. 13."
        ],
        [
            "^ THE NEW YORK TIMES 1941, p. 1."
        ],
        [
            "^ \"Large Force Is Attacking\" 1941, p. 58."
        ],
        [
            "^ LEE 1942, p. 8."
        ],
        [
            "^ LEE 1942, p. 1."
        ],
        [
            "^ LEE 1942, p. 7."
        ],
        [
            "^ LEE 1942, p. 9."
        ],
        [
            "^ Lee 1942, p. 2."
        ],
        [
            "^ Lee 1942, p. 25."
        ],
        [
            "^ Lee 1942, p. 4."
        ],
        [
            "^ \"Republic Act No.",
            "4867 - An Act Creating the Provinces of Davao del Norte, Davao del Sur and Davao Oriental\".",
            "Chan Robles Virtual Law Library.",
            "May 8, 1967.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ a b \"Southern Mindanao Is Now All Davao Region\".",
            "RDC XI Bulletin.",
            "No.",
            "Oct-Dec 2001, Volume 7.",
            "National Statistical Coordination Board.",
            "January 29, 2002.",
            "Archived from the original on January 2, 2016.",
            "Retrieved March 29, 2016.",
            "Southern Mindanao or Region XI is now known as Davao Region and comprises of four provinces (Compostela Valley, Davao del Norte, Davao del Sur and Davao Oriental) and five cities (Davao, Digos, Panabo, Tagum and the Island Garden City of Samal.",
            "Said provinces and cities are situated along the Davao Gulf area.",
            "South Cotabato, Sarangani, General Santos City (Socsksargen) and Koronadal City, which were part of the old Region XI) have been transferred to Region XII."
        ],
        [
            "^ \"Executive Order No.",
            "36; Providing for the Reorganization of the Administrative Regions in Mindanao and for Other Purposes\".",
            "Official Gazette of the Republic of the Philippines.",
            "Malacañang, Manila, Philippines.",
            "September 19, 2001.",
            "Archived from the original on December 2, 2022.",
            "Retrieved March 29, 2016.",
            "SECTION 3.",
            "Region XI is hereby reorganized to be known as Davao Region and shall be composed of the following provinces and cities:  a.",
            "Provinces i. Compostela Valley ii.",
            "Davao del Norte iii.",
            "Davao del Sur iv.",
            "Davao Oriental b.",
            "Cities i. Davao City ii.",
            "Digos City iii.",
            "Panabo City iv.",
            "Island Garden City of Samal v. Tagum City"
        ],
        [
            "^ Zuasola, Ferdinand (October 13, 2022).",
            "\"Peace and order council declares Davao Region insurgency-free\".",
            "Rappler.",
            "Davao Oriental, Philippines: Rappler Inc. Retrieved November 7, 2022."
        ],
        [
            "^ a b c Census of Population (2015).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 11, 2013.",
            "Retrieved April 15, 2014."
        ],
        [
            "^ a b \"PSGC Interactive; List of Cities\".",
            "Philippine Statistics Authority.",
            "Archived from the original on April 29, 2011.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"Province: Davao Occidental\".",
            "Philippine Statistics Authority.",
            "Archived from the original on March 16, 2016.",
            "Retrieved March 29, 2016."
        ],
        [
            "^ \"Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities\" (PDF).",
            "2010 Census and Housing Population.",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on September 28, 2013.",
            "Retrieved August 12, 2013."
        ],
        [
            "^ \"Religious Affiliation in the Philippines (2020 Census of Population and Housing) | Philippine Statistics Authority | Republic of the Philippines\".",
            "psa.gov.ph.",
            "Retrieved August 6, 2023."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"China uses island building skills to develop Duterte's backyard\".",
            "Bloomberg news.",
            "December 21, 2016.",
            "Retrieved December 21, 2016."
        ],
        [
            "^ \"China's Island-Building Skills Lift Hopes in Duterte's Backyard\".",
            "Yahoo news.",
            "December 21, 2016.",
            "Retrieved December 21, 2016."
        ],
        [
            "External links"
        ],
        [
            " Media related to Davao Region at Wikimedia Commons"
        ],
        [
            " Davao Region travel guide from Wikivoyage"
        ],
        [
            " Geographic data related to Davao Region at OpenStreetMap"
        ],
        [
            "Regions adjacent to Davao Region"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "Caraga"
        ],
        [
            "Soccsksargen"
        ],
        [
            "Davao Region"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Celebes Sea, Davao Gulf"
        ],
        [
            "vteDavao Region (Region XI)Regional center"
        ],
        [
            "Davao City"
        ],
        [
            "Provinces"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Metropolitan Area"
        ],
        [
            "Metro Davao"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Davao City"
        ],
        [
            "Component cities"
        ],
        [
            "Digos"
        ],
        [
            "Mati"
        ],
        [
            "Panabo"
        ],
        [
            "Samal"
        ],
        [
            "Tagum"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Digos"
        ],
        [
            "Malita"
        ],
        [
            "Mati"
        ],
        [
            "Nabunturan"
        ],
        [
            "Tagum"
        ],
        [
            "Municipalities"
        ],
        [
            "Asuncion"
        ],
        [
            "Baganga"
        ],
        [
            "Banaybanay"
        ],
        [
            "Bansalan"
        ],
        [
            "Boston"
        ],
        [
            "Braulio E. Dujali"
        ],
        [
            "Caraga"
        ],
        [
            "Carmen"
        ],
        [
            "Cateel"
        ],
        [
            "Compostela"
        ],
        [
            "Don Marcelino"
        ],
        [
            "Governor Generoso"
        ],
        [
            "Hagonoy"
        ],
        [
            "Jose Abad Santos"
        ],
        [
            "Kapalong"
        ],
        [
            "Kiblawan"
        ],
        [
            "Laak"
        ],
        [
            "Lupon"
        ],
        [
            "Mabini"
        ],
        [
            "Maco"
        ],
        [
            "Magsaysay"
        ],
        [
            "Malalag"
        ],
        [
            "Malita"
        ],
        [
            "Manay"
        ],
        [
            "Maragusan"
        ],
        [
            "Matanao"
        ],
        [
            "Mawab"
        ],
        [
            "Monkayo"
        ],
        [
            "Montevista"
        ],
        [
            "Nabunturan"
        ],
        [
            "New Bataan"
        ],
        [
            "New Corella"
        ],
        [
            "Padada"
        ],
        [
            "Pantukan"
        ],
        [
            "San Isidro (Davao del Norte)"
        ],
        [
            "San Isidro (Davao Oriental)"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sarangani"
        ],
        [
            "Sulop"
        ],
        [
            "Talaingod"
        ],
        [
            "Tarragona"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vteRegions of the PhilippinesLuzon"
        ],
        [
            "NCR – National Capital Region"
        ],
        [
            "CAR – Cordillera Administrative Region"
        ],
        [
            "I – Ilocos Region"
        ],
        [
            "II – Cagayan Valley"
        ],
        [
            "III – Central Luzon"
        ],
        [
            "IV-A – Calabarzon"
        ],
        [
            "Mimaropa – Southwestern Tagalog Region"
        ],
        [
            "V – Bicol Region"
        ],
        [
            "Visayas"
        ],
        [
            "VI – Western Visayas"
        ],
        [
            "NIR – Negros Island Region"
        ],
        [
            "VII – Central Visayas"
        ],
        [
            "VIII – Eastern Visayas"
        ],
        [
            "Mindanao"
        ],
        [
            "IX – Zamboanga Peninsula"
        ],
        [
            "X – Northern Mindanao"
        ],
        [
            "XI – Davao Region"
        ],
        [
            "XII – Soccsksargen"
        ],
        [
            "XIII – Caraga Region"
        ],
        [
            "BARMM – Bangsamoro Autonomous Region in Muslim Mindanao"
        ],
        [
            "Former regions"
        ],
        [
            "ARMM – Autonomous Region in Muslim Mindanao"
        ],
        [
            "IV – Southern Tagalog"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Davao_Region&oldid=1229666008\""
        ],
        [
            "Categories: Davao RegionRegions of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataUse mdy dates from March 2020Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishArticles needing additional references from August 2013All articles needing additional referencesPages using multiple image with auto scaled imagesCoordinates on WikidataArticles containing Cebuano-language textArticles containing Filipino-language textAll articles with specifically marked weasel-worded phrasesArticles with specifically marked weasel-worded phrases from March 2020All articles with unsourced statementsArticles with unsourced statements from December 2012Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}