{
    "name": "Western Visayas",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Western Visayas"
        ],
        [
            "45 languages"
        ],
        [
            "العربية閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoChavacano de ZamboangaDeutschEspañolEsperantoEuskaraفارسیFrançaisGalego한국어हिन्दीHrvatskiIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuLietuviųМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°08′N 122°32′E﻿ / ﻿11.13°N 122.53°E﻿ / 11.13; 122.53"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Administrative region of the Philippines"
        ],
        [
            "This article needs to be updated.",
            "The reason given is: Negros Island Region has been revived by Pres.",
            "Ferdinand Marcos Jr. via Republic Act No.",
            "12000 on June 13, 2024.",
            "Please help update this article to reflect recent events or newly available information.",
            "(June 2024)"
        ],
        [
            "Region in Visayas, PhilippinesWestern Visayas"
        ],
        [
            "Kabisay-an Nakatundan Kanlurang KabisayaanRegion"
        ],
        [
            "Clockwise from the top: Miagao Church, Jaro Belfry, Taklong Island, Islas de Gigantes, Tibiao Rice Terraces, Pan-ay Belfry, BoracayLocation in the PhilippinesOpenStreetMapCoordinates: 11°08′N 122°32′E﻿ / ﻿11.13°N 122.53°E﻿ / 11.13; 122.53Country PhilippinesIsland groupVisayasRegional centerand largest cityIloilo CityArea • Total12,750.63 km2 (4,923.05 sq mi)Highest elevation (Mount Madja-as)2,117 m (6,946 ft)Population (2020 census) • Total4,730,771 • Density370/km2 (960/sq mi)Time zoneUTC+8 (PST)ISO 3166 codePH-06Provinces"
        ],
        [
            "5"
        ],
        [
            " Aklan"
        ],
        [
            " Antique"
        ],
        [
            " Capiz"
        ],
        [
            " Guimaras"
        ],
        [
            " Iloilo"
        ],
        [
            "Independent cities"
        ],
        [
            "1"
        ],
        [
            " Iloilo City"
        ],
        [
            "Component cities"
        ],
        [
            "2"
        ],
        [
            " Passi"
        ],
        [
            " Roxas"
        ],
        [
            "Municipalities98Barangays3,209Cong.",
            "districts10LanguagesHiligaynonKinaray-aAklanon/MalaynonCapiznonTagalogEnglishGDP (2023)₱620.79 billion$10.55 billionHDI 0.761 (High)HDI rank5th in the Philippines (2019)"
        ],
        [
            "Western Visayas (Hiligaynon: Kabisay-an Nakatundan; Tagalog: Kanlurang Kabisayaan or Kanlurang Visayas) is an administrative region in the Philippines, numerically designated as Region VI.",
            "It consists of five provinces: Aklan, Antique, Capiz, Guimaras, and Iloilo.",
            "The region also includes one highly urbanized city, Iloilo City, which is the largest city and serves as the regional center."
        ],
        [
            "The Hiligaynon language, native to Iloilo City, is the region's lingua franca.",
            "The region is also dominated by the native speakers of three Visayan languages: Kinaray-a, Aklanon and Capiznon.",
            "The land area of the region is 12,750.63 km2 (4,923.05 sq mi), and with a population of 4,730,771 inhabitants."
        ],
        [
            "Etymology"
        ],
        [
            "The region's current name is in reference to its geographic position in the greater Visayas area."
        ],
        [
            "History"
        ],
        [
            "Satellite map of Western Visayas"
        ],
        [
            "Regions first came into existence on September 24, 1972, when the provinces of the Philippines were organized into 11 regions by Presidential Decree No.",
            "1 as part of the Integrated Reorganization Plan by President Ferdinand Marcos Sr.",
            "The provinces of Aklan, Antique, Capiz, Iloilo (including its then-subprovince of Guimaras), and Negros Occidental were grouped together to form the Western Visayas region."
        ],
        [
            "The province of Palawan was transferred to Region VI (Western Visayas) on May 23, 2005, by Executive Order 429."
        ],
        [
            "However, Palaweños criticized the move, citing a lack of consultation, with most residents in Puerto Princesa City and all municipalities but one preferring to stay with Region IV-B.",
            "Consequently, Administrative Order No.",
            "129 was issued on August 19, 2005, to address this backlash.",
            "This Order directed the abeyance of Executive Order 429 pending the approval of an implementation plan for the orderly transfer of Palawan from Region IV-B to Region VI.Hence, Palawan is currently still part of Region IV-B."
        ],
        [
            "By virtue of Executive Order No.",
            "183 issued on May 29, 2015, by President Benigno Aquino III, the province of Negros Occidental and its capital, Bacolod, were both removed from Western Visayas in order to form the Negros Island Region along with Negros Oriental."
        ],
        [
            "On June 13, 2024, the region again lost Negros Occidental and Bacolod when the Negros Island Region was reestablished under Republic Act No.",
            "12000 signed by President Ferdinand Marcos Jr."
        ],
        [
            "Geography"
        ],
        [
            "Western Visayas consists of the major island of Panay and the smaller Guimaras, as well as several outlying islands.",
            "Its land area is 12,750.63 km2 (4,923.05 sq mi), 4.25% of the country's total land area."
        ],
        [
            "The region is bordered to the north by the Sibuyan Sea, northeast by the Visayan Sea, southeast by the island of Negros, south by the Iloilo Strait and Panay Gulf, and west by the Sulu Sea."
        ],
        [
            "Map shows the Koppen-Geiger climate classification of the Western Visayas region, Philippines."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Provinces"
        ],
        [
            "Western Visayas consists of 5 provinces, 1 highly urbanized city, 2 component cities, 98 municipalities and 3,209 barangays."
        ],
        [
            "Province or HUC"
        ],
        [
            "Capital"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Cities"
        ],
        [
            "Muni."
        ],
        [
            "Barangay"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Aklan"
        ],
        [
            "Kalibo"
        ],
        [
            "7.7%"
        ],
        [
            "615,475"
        ],
        [
            "1,760.30"
        ],
        [
            "679.66"
        ],
        [
            "350"
        ],
        [
            "910"
        ],
        [
            "0"
        ],
        [
            "17"
        ],
        [
            "327"
        ],
        [
            "Antique"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "7.7%"
        ],
        [
            "612,974"
        ],
        [
            "2,730.67"
        ],
        [
            "1,054.32"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "0"
        ],
        [
            "18"
        ],
        [
            "590"
        ],
        [
            "Capiz"
        ],
        [
            "Roxas"
        ],
        [
            "10.1%"
        ],
        [
            "804,952"
        ],
        [
            "2,594.64"
        ],
        [
            "1,001.80"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "1"
        ],
        [
            "16"
        ],
        [
            "473"
        ],
        [
            "Guimaras"
        ],
        [
            "Jordan"
        ],
        [
            "2.4%"
        ],
        [
            "187,842"
        ],
        [
            "611.87"
        ],
        [
            "236.24"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "0"
        ],
        [
            "5"
        ],
        [
            "98"
        ],
        [
            "Iloilo"
        ],
        [
            "Iloilo City"
        ],
        [
            "25.8%"
        ],
        [
            "2,051,899"
        ],
        [
            "4,997.64"
        ],
        [
            "1,929.60"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "1"
        ],
        [
            "42"
        ],
        [
            "1,721"
        ],
        [
            "Iloilo City"
        ],
        [
            "†"
        ],
        [
            "—"
        ],
        [
            "5.8%"
        ],
        [
            "457,626"
        ],
        [
            "78.34"
        ],
        [
            "30.25"
        ],
        [
            "5,800"
        ],
        [
            "15,000"
        ],
        [
            "—"
        ],
        [
            "—"
        ],
        [
            "180"
        ],
        [
            "Total"
        ],
        [
            "4,730,771"
        ],
        [
            "12,750.63"
        ],
        [
            "4,923.05"
        ],
        [
            "370"
        ],
        [
            "960"
        ],
        [
            "2"
        ],
        [
            "98"
        ],
        [
            "3,209"
        ],
        [
            " †  Iloilo City is a highly urbanized city; figures are excluded from Iloilo province."
        ],
        [
            "Governors and vice governors"
        ],
        [
            "Province"
        ],
        [
            "Image"
        ],
        [
            "Governor"
        ],
        [
            "Political Party"
        ],
        [
            "Vice Governor"
        ],
        [
            "Aklan"
        ],
        [
            "Jose Enrique Miraflores"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Reynaldo Quimpo"
        ],
        [
            "Antique"
        ],
        [
            "Rhodora Cadiao"
        ],
        [
            "NUP"
        ],
        [
            "Edgar Denosta"
        ],
        [
            "Capiz"
        ],
        [
            "Fredenil Castro"
        ],
        [
            "Lakas"
        ],
        [
            "James Magbanua"
        ],
        [
            "Guimaras"
        ],
        [
            "Joaquin Carlos Rahman Nava"
        ],
        [
            "NUP"
        ],
        [
            "John Edward Gando"
        ],
        [
            "Iloilo"
        ],
        [
            "Arthur Defensor Jr."
        ],
        [
            "NUP"
        ],
        [
            "Christine Garin"
        ],
        [
            "Cities"
        ],
        [
            " †  Regional center"
        ],
        [
            "City"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "City class"
        ],
        [
            "Income class"
        ],
        [
            "Province"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "† Iloilo City"
        ],
        [
            "457,626"
        ],
        [
            "78.34"
        ],
        [
            "30.25"
        ],
        [
            "5,800"
        ],
        [
            "15,000"
        ],
        [
            "Highly urbanized"
        ],
        [
            "1st"
        ],
        [
            "Iloilo"
        ],
        [
            "Passi"
        ],
        [
            "88,873"
        ],
        [
            "251.39"
        ],
        [
            "97.06"
        ],
        [
            "350"
        ],
        [
            "910"
        ],
        [
            "Component"
        ],
        [
            "4th"
        ],
        [
            "Iloilo"
        ],
        [
            "Roxas"
        ],
        [
            "179,292"
        ],
        [
            "95.07"
        ],
        [
            "36.71"
        ],
        [
            "1,900"
        ],
        [
            "4,900"
        ],
        [
            "Component"
        ],
        [
            "1st"
        ],
        [
            "Capiz"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Western VisayasYearPop.±% p.a.1903 1,083,474—    1918 1,347,249+1.46%1939 2,173,579+2.30%1948 2,530,517+1.70%1960 3,078,305+1.65%1970 3,618,326+1.63%1975 4,146,390+2.77%1980 4,525,615+1.77%1990 5,393,333+1.77%1995 5,776,938+1.30%2000 6,211,038+1.57%2007 6,843,643+1.35%2010 7,102,438+1.36%2015 7,536,383+1.14%2020 7,954,723+1.07%Data in 2015 and 2020 includes Negros Occidental and Bacolod.Source: Philippine Statistics AuthorityAccording to the 2020 census, it has a population of 4,730,771.",
            "Before Negros Occidental and Bacolod separated from the region in 2024, it was 7,954,723."
        ],
        [
            "Languages"
        ],
        [
            "Western Visayas Language Map."
        ],
        [
            "The native languages of Western Visayas are:"
        ],
        [
            "Aklanon/Akeanon, spoken in Aklan and northwestern Capiz."
        ],
        [
            "Capiznon, spoken in Capiz, northeastern Iloilo, and eastern Aklan."
        ],
        [
            "Hiligaynon, spoken in Iloilo, Guimaras, Capiz, Antique, and Aklan.",
            "It is the regional lingua franca."
        ],
        [
            "Kinaray-a, spoken in Antique, southwestern half of Iloilo, Guimaras, western Capiz, and southwestern Aklan."
        ],
        [
            "Malaynon, spoken in northwestern Aklan including Boracay Island."
        ],
        [
            "Caluyanon, spoken in the Semirara Islands (Semirara, Caluya, and Sibay Islands)."
        ],
        [
            "Economy"
        ],
        [
            "A view of Iloilo City as seen in January 2019"
        ],
        [
            "Poverty incidence of Western Visayas"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  29.08"
        ],
        [
            "2009  30.80"
        ],
        [
            "2012  29.14"
        ],
        [
            "2015  24.60"
        ],
        [
            "2018  16.32"
        ],
        [
            "2021  13.80"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Western Visayas is the sixth largest economy in the Philippines.",
            "Iloilo City serves as the region's economic hub.",
            "Other major trading and commercial centers in the region include Roxas City for Capiz and entire Northern Panay.",
            "Provincial capitals such as Kalibo in Aklan, San Jose in Antique, and Jordan in Guimaras serve as the commercial centers for their respective provinces.",
            "Metro Iloilo, composed of Iloilo City and the municipalities of Oton, San Miguel, Pavia, Leganes, Santa Barbara, and Cabatuan, is the center for trading, commercial, financial, and industrial activities in the region."
        ],
        [
            "Tourism"
        ],
        [
            "White Beach in Boracay, one of the most popular beaches in the world"
        ],
        [
            "The region is known for its rich cultural heritage and natural beauty, features several key tourism highlights.",
            "Boracay Island, located in Malay, Aklan, is world-famous for its pristine white sand beaches, crystal-clear waters, and vibrant nightlife.",
            "Miag-ao Church in Miag-ao, Iloilo, a UNESCO World Heritage Site, showcases unique Baroque-Romanesque architecture and detailed designs.",
            "Iloilo City, a UNESCO Creative City of Gastronomy, is also known for its colonial-era heritage houses, churches, and buildings.",
            "The Gigantes Islands in Carles, Iloilo, are known for their white sand beaches, sandbars, limestone cliffs, and clear blue waters.",
            "Panay Church in Panay, Capiz hosts the biggest church bell in Asia.",
            "Mount Madja-as in Antique is the highest mountain in the region.",
            "Guimaras mangoes from Guimaras are known as some of the sweetest in the world.",
            "The region is also home to popular festivals such as the Dinagyang of Iloilo City and the Ati-Atihan of Kalibo, Aklan."
        ],
        [
            "Transportation"
        ],
        [
            "Ports"
        ],
        [
            "International Container Terminal in Port of Iloilo"
        ],
        [
            "The Port of Iloilo is the primary seaport serving the region.",
            "Other seaports include Dumangas Port in Dumangas, Iloilo, serves ro-ro and fastcraft to Negros Island and vice versa; Jordan Port in Guimaras, serves ferries from Iloilo City and vice versa; Culasi Port in Roxas, Capiz, serves ferry routes to Batangas and Caticlan and vice versa; Caticlan Port in Malay, Aklan, serves ferries to Boracay Island and vice versa; and the Port of San Jose de Buenavista in Antique, which serves ferries to Palawan and Iloilo City and vice versa."
        ],
        [
            "Airports"
        ],
        [
            "Iloilo International AirportKalibo International Airport"
        ],
        [
            "Western Visayas is served by two international airports and three domestic airports.",
            "Iloilo International Airport, located in Cabatuan, Iloilo, serves the general area of Metro Iloilo–Guimaras as well as the entire province of Iloilo, and a gateway into the region.",
            "Kalibo International Airport serves the general area of Aklan and is one of the two airports serving Boracay, the other being the domestic Godofredo P. Ramos Airport in Caticlan, Malay, Aklan.",
            "The other domestic airports are Roxas Airport, serving the general area of area of Roxas City and the province of Capiz, and Evelio B. Javier Airport, serving the general area of the province of Antique."
        ],
        [
            "The other airports and airstrips in the region include Semirara Airport on Semirara Island in Caluya, Antique; Sicogon Airport on Sicogon Island in Carles, Iloilo; and Guimaras Airstrip."
        ],
        [
            "Rail"
        ],
        [
            "Proposals to re-connect again Iloilo-Roxas, Iloilo-Kalibo, Iloilo-Malay (Aklan) and Iloilo-San Jose (Antique) from the Iloilo City via rail was included in the revival of the currently defunct Panay Railways network which has a station in Santa Barbara town proper."
        ],
        [
            "References"
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ a b \"2021 to 2023 Gross Regional Domestic Product (GRDP)\".",
            "openstat.psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ \"History of Urban Growth of Iloilo City\".",
            "Iloilo City Government.",
            "Archived from the original on June 30, 2012.",
            "Retrieved June 28, 2012."
        ],
        [
            "^ President of the Philippines.",
            "\"Executive order No.",
            "429\".",
            "Office of the Press Secretary.",
            "Archived from the original on July 7, 2007."
        ],
        [
            "^ \"Palawan, Puerto Princesa Transfer to Region VI\" (Press release).",
            "Government of the Philippines.",
            "June 3, 2005."
        ],
        [
            "^ President of the Philippines (August 19, 2005).",
            "\"Administrative Order No.",
            "129\".",
            "Office of the Press Secretary.",
            "Archived from the original on July 13, 2006."
        ],
        [
            "^ \"Executive Order No.",
            "183, s. 2015\".",
            "Official Gazette (Philippines).",
            "May 29, 2015.",
            "Retrieved June 5, 2015."
        ],
        [
            "^ \"Duterte dissolves Negros Island Region\".",
            "Rappler.",
            "August 9, 2017.",
            "Retrieved August 10, 2017."
        ],
        [
            "^ \"Marcos signs law creating Negros Island Region\".",
            "ABS-CBN.",
            "June 13, 2024.",
            "Retrieved June 13, 2024."
        ],
        [
            "^ \"PSGC Interactive; List of Provinces\".",
            "Philippine Statistics Authority.",
            "Archived from the original on July 11, 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ \"Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities\" (PDF).",
            "2010 Census and Housing Population.",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on September 28, 2013.",
            "Retrieved August 9, 2013."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Tables | Philippine Statistics Authority | Republic of the Philippines\".",
            "psa.gov.ph.",
            "Retrieved June 14, 2024."
        ],
        [
            "^ Salvilla, Rex S. (July 28, 2006).",
            "\"Anything Under the Sun: Panay Railways\".",
            "The News Today.",
            "TNT Publishing, Inc. Retrieved June 12, 2008."
        ],
        [
            "External links"
        ],
        [
            " Media related to Western Visayas at Wikimedia Commons"
        ],
        [
            " Western Visayas travel guide from Wikivoyage"
        ],
        [
            " Geographic data related to Western Visayas at OpenStreetMap"
        ],
        [
            "Places adjacent to Western Visayas"
        ],
        [
            "Mimaropa / Tablas Strait"
        ],
        [
            "MimaropaSibuyan Sea"
        ],
        [
            "Bicol RegionJintotolo Channel"
        ],
        [
            "Sulu Sea"
        ],
        [
            "Western Visayas"
        ],
        [
            "Central Visayas"
        ],
        [
            "Sulu Sea"
        ],
        [
            "Negros Island Region"
        ],
        [
            "vteWestern Visayas (Region VI)Regional center"
        ],
        [
            "Iloilo City"
        ],
        [
            "Provinces"
        ],
        [
            "Aklan"
        ],
        [
            "Antique"
        ],
        [
            "Capiz"
        ],
        [
            "Guimaras"
        ],
        [
            "Iloilo"
        ],
        [
            "Metropolitan Area"
        ],
        [
            "Metro Iloilo–Guimaras"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City"
        ],
        [
            "Component cities"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Iloilo City"
        ],
        [
            "Jordan"
        ],
        [
            "Kalibo"
        ],
        [
            "Roxas"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Altavas"
        ],
        [
            "Anilao"
        ],
        [
            "Anini-y"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Balete"
        ],
        [
            "Banate"
        ],
        [
            "Banga"
        ],
        [
            "Barbaza"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Batan"
        ],
        [
            "Belison"
        ],
        [
            "Bingawan"
        ],
        [
            "Buenavista"
        ],
        [
            "Bugasong"
        ],
        [
            "Buruanga"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Caluya"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuartero"
        ],
        [
            "Culasi"
        ],
        [
            "Dao"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumalag"
        ],
        [
            "Dumangas"
        ],
        [
            "Dumarao"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Hamtic"
        ],
        [
            "Ibajay"
        ],
        [
            "Igbaras"
        ],
        [
            "Ivisan"
        ],
        [
            "Jamindan"
        ],
        [
            "Janiuay"
        ],
        [
            "Jordan"
        ],
        [
            "Kalibo"
        ],
        [
            "Lambunao"
        ],
        [
            "Laua-an"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Lezo"
        ],
        [
            "Libacao"
        ],
        [
            "Libertad"
        ],
        [
            "Maasin"
        ],
        [
            "Ma-ayon"
        ],
        [
            "Madalag"
        ],
        [
            "Makato"
        ],
        [
            "Malay"
        ],
        [
            "Malinao"
        ],
        [
            "Mambusao"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "Nabas"
        ],
        [
            "New Lucena"
        ],
        [
            "New Washington"
        ],
        [
            "Nueva Valencia"
        ],
        [
            "Numancia"
        ],
        [
            "Oton"
        ],
        [
            "Panay"
        ],
        [
            "Pandan"
        ],
        [
            "Panitan"
        ],
        [
            "Patnongon"
        ],
        [
            "Pavia"
        ],
        [
            "Pilar"
        ],
        [
            "Pontevedra"
        ],
        [
            "Pototan"
        ],
        [
            "President Roxas"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "San Lorenzo"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "San Remigio"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sapian"
        ],
        [
            "Sara"
        ],
        [
            "Sebaste"
        ],
        [
            "Sibalom"
        ],
        [
            "Sibunag"
        ],
        [
            "Sigma"
        ],
        [
            "Tangalan"
        ],
        [
            "Tapaz"
        ],
        [
            "Tibiao"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tobias Fornier"
        ],
        [
            "Tubungan"
        ],
        [
            "Valderrama"
        ],
        [
            "Zarraga"
        ],
        [
            "Visayas, Republic of the Philippines"
        ],
        [
            "vteRegions of the PhilippinesLuzon"
        ],
        [
            "NCR – National Capital Region"
        ],
        [
            "CAR – Cordillera Administrative Region"
        ],
        [
            "I – Ilocos Region"
        ],
        [
            "II – Cagayan Valley"
        ],
        [
            "III – Central Luzon"
        ],
        [
            "IV-A – Calabarzon"
        ],
        [
            "Mimaropa – Southwestern Tagalog Region"
        ],
        [
            "V – Bicol Region"
        ],
        [
            "Visayas"
        ],
        [
            "VI – Western Visayas"
        ],
        [
            "NIR – Negros Island Region"
        ],
        [
            "VII – Central Visayas"
        ],
        [
            "VIII – Eastern Visayas"
        ],
        [
            "Mindanao"
        ],
        [
            "IX – Zamboanga Peninsula"
        ],
        [
            "X – Northern Mindanao"
        ],
        [
            "XI – Davao Region"
        ],
        [
            "XII – Soccsksargen"
        ],
        [
            "XIII – Caraga Region"
        ],
        [
            "BARMM – Bangsamoro Autonomous Region in Muslim Mindanao"
        ],
        [
            "Former regions"
        ],
        [
            "ARMM – Autonomous Region in Muslim Mindanao"
        ],
        [
            "IV – Southern Tagalog"
        ],
        [
            "Authority control databases: Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Western_Visayas&oldid=1233221141\""
        ],
        [
            "Categories: Western VisayasRegions of the PhilippinesVisayasSulu Sea1972 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasArticles with short descriptionShort description is different from WikidataWikipedia articles in need of updating from June 2024All Wikipedia articles in need of updatingUse mdy dates from March 2020Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishPages using multiple image with auto scaled imagesCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Tagalog-language textCommons category link from WikidataArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}