{
    "name": "Abucay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Abucay"
        ],
        [
            "23 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSimple EnglishSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°43′20″N 120°32′08″E﻿ / ﻿14.722214°N 120.535433°E﻿ / 14.722214; 120.535433"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bataan, Philippines"
        ],
        [
            "Municipality in Central Luzon, PhilippinesAbucayMunicipalityMunicipality of Abucay"
        ],
        [
            "FlagSealMap of Bataan with Abucay highlightedOpenStreetMapAbucayLocation in the PhilippinesCoordinates: 14°43′20″N 120°32′08″E﻿ / ﻿14.722214°N 120.535433°E﻿ / 14.722214; 120.535433CountryPhilippinesRegionCentral LuzonProvinceBataanDistrict"
        ],
        [
            "1st districtFounded1587Barangays9"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRuben C. Tagle • Vice MayorRoberto \"Wangbu\" Pasbustan • RepresentativeGeraldine B. Roman • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Roy C. SamsonDante M. BaluyotMercedita R. CanareRuben O. ValenciaJayson M. MarceloEdwin R. BernalesDanilo R. GanzonJayjay M. Sacdalan"
        ],
        [
            " • Electorate28,142 voters (2022)Area • Revenue₱ 165.1 million (2020) • Assets₱ 494.6 million (2020) • Expenditure₱ 120.8 million (2020) • Liabilities₱ 103 million (2020)Service provider • ElectricityPeninsula Electric Cooperative (PENELCO)Time zoneUTC+8 (PST)ZIP code2114PSGC030801000IDD : area code +63 (0)47Native languagesMariveleño Tagalog"
        ],
        [
            "Abucay, officially the Municipality of Abucay,  (Tagalog: Bayan ng Abucay),  is a 3rd class municipality in the province of  Bataan , Philippines.",
            "According to the 2020 census, it has a population of 42,984 people."
        ],
        [
            "It is 5 kilometres (3.1 mi) from Balanga and 119 kilometres (74 mi) from Manila, accessible via the Bataan Provincial Expressway, off Exit 25, or the parallel National Road in Bataan.",
            "Its westernmost elevated section is located within the Bataan National Park."
        ],
        [
            "History"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(November 2016)"
        ],
        [
            "The first printing press in the Archipelago was found in this town.",
            "Tomas Pinpin, the first Filipino printer, learned the art from Fray Francisco Blanca de San Jose and Juan de Vera, a Chinese printer at the University of Santo Tomas."
        ],
        [
            "On June 23, 1647, a fierce battle was fought between the Dutch invaders and the Pampango defenders in the near the Abucay church area.",
            "Nearly 200 Pampangos were put to death and 40 others together with Pampanga’s Spanish alcalde mayor (town mayor) Antonio de Cabrera.",
            "Dominican priests Father Geronimo Sotomayor and Father Tomas Ramos were taken to Batavia."
        ],
        [
            "Geography"
        ],
        [
            "Abucay borders Balanga (the capital city) to the south, Samal to the north and northwest, Morong to the west, and Manila Bay to the east."
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 79.72 square kilometres (30.78 sq mi) constituting 5.81% of the 1,372.98-square-kilometre- (530.11 sq mi) total area of Bataan."
        ],
        [
            "Topography of Abucay varies from the mountainous terrain of Mount Natib caldera in the west to the coastal areas of the province along the shore of Manila Bay.",
            "Six rivers with a combined length of 37 kilometres (23 mi) originate from the mountain flowing in the west-to-east direction."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Abucay, Bataan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "35(95)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "7(0.3)"
        ],
        [
            "8(0.3)"
        ],
        [
            "14(0.6)"
        ],
        [
            "26(1.0)"
        ],
        [
            "127(5.0)"
        ],
        [
            "210(8.3)"
        ],
        [
            "263(10.4)"
        ],
        [
            "272(10.7)"
        ],
        [
            "218(8.6)"
        ],
        [
            "114(4.5)"
        ],
        [
            "46(1.8)"
        ],
        [
            "21(0.8)"
        ],
        [
            "1,326(52.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "4.0"
        ],
        [
            "4.0"
        ],
        [
            "6.9"
        ],
        [
            "11.2"
        ],
        [
            "21.0"
        ],
        [
            "24.5"
        ],
        [
            "27.4"
        ],
        [
            "26.9"
        ],
        [
            "25.9"
        ],
        [
            "21.9"
        ],
        [
            "13.4"
        ],
        [
            "6.3"
        ],
        [
            "193.4"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Barangays"
        ],
        [
            "Abucay is politically subdivided into 9 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 030801001   Bangkal"
        ],
        [
            " 1.6%"
        ],
        [
            " 695"
        ],
        [
            " 634"
        ],
        [
            "  ▴"
        ],
        [
            " 0.92%"
        ],
        [
            " 030801002   Calaylayan (Poblacion)"
        ],
        [
            " 11.2%"
        ],
        [
            " 4,833"
        ],
        [
            " 4,391"
        ],
        [
            "  ▴"
        ],
        [
            " 0.96%"
        ],
        [
            " 030801003   Capitangan"
        ],
        [
            " 15.7%"
        ],
        [
            " 6,742"
        ],
        [
            " 6,041"
        ],
        [
            "  ▴"
        ],
        [
            " 1.10%"
        ],
        [
            " 030801004   Gabon"
        ],
        [
            " 12.6%"
        ],
        [
            " 5,405"
        ],
        [
            " 5,241"
        ],
        [
            "  ▴"
        ],
        [
            " 0.31%"
        ],
        [
            " 030801006   Laon (Poblacion)"
        ],
        [
            " 5.4%"
        ],
        [
            " 2,303"
        ],
        [
            " 2,245"
        ],
        [
            "  ▴"
        ],
        [
            " 0.26%"
        ],
        [
            " 030801007   Mabatang"
        ],
        [
            " 21.3%"
        ],
        [
            " 9,165"
        ],
        [
            " 8,571"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 030801008   Omboy"
        ],
        [
            " 7.3%"
        ],
        [
            " 3,149"
        ],
        [
            " 3,219"
        ],
        [
            "  ▾"
        ],
        [
            " −0.22%"
        ],
        [
            " 030801010   Salian"
        ],
        [
            " 7.4%"
        ],
        [
            " 3,199"
        ],
        [
            " 2,885"
        ],
        [
            "  ▴"
        ],
        [
            " 1.04%"
        ],
        [
            " 030801011   Wawa (Poblacion)"
        ],
        [
            " 10.2%"
        ],
        [
            " 4,389"
        ],
        [
            " 4,492"
        ],
        [
            "  ▾"
        ],
        [
            " −0.23%"
        ],
        [
            "Total"
        ],
        [
            "42,984"
        ],
        [
            "37,719"
        ],
        [
            " ▴"
        ],
        [
            "1.31%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of AbucayYearPop.±% p.a.1903 6,320—    1918 7,485+1.13%1939 10,216+1.49%1948 8,453−2.08%1960 12,900+3.58%1970 18,140+3.46%1975 20,437+2.42%1980 22,692+2.11%YearPop.±% p.a.1990 26,708+1.64%1995 29,270+1.73%2000 31,801+1.79%2007 38,554+2.69%2010 37,719−0.79%2015 39,880+1.07%2020 42,984+1.48%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Abucay had a population of 42,984.",
            "The population density was 540 inhabitants per square kilometre (1,400/sq mi)."
        ],
        [
            "Most of the people of Abucay speak the Tagalog language.",
            "There are also residents who speak \"Kapampangang Hilaw,\" a dialect variation of the Kapampangan language, in Barangay Mabatang."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Abucay"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  8.70"
        ],
        [
            "2009  7.02"
        ],
        [
            "2012  3.96"
        ],
        [
            "2015  14.52"
        ],
        [
            "2018  5.30"
        ],
        [
            "2021  7.84"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Bamboos for mussel culture"
        ],
        [
            "The mainly agricultural and fishing town is situated on the northeastern portion of the Bataan Peninsula, along Manila Bay, with a total land area of 79.72 square kilometres (30.78 sq mi)."
        ],
        [
            "It is basically an agricultural and fishing town.",
            "Besides Manila Bay, existing fishponds cover an area of 1,521 hectares (3,760 acres) of which 319 hectares (790 acres) are under intensive use while the rest are non-functioning but available for utilization.",
            "These fishponds are rich with commercial species like milkfish, tilapia, pla-pla and shrimps."
        ],
        [
            "Agricultural lands in Abucay produces rice, corn, root crops, legumes, vegetable and various kinds of fruits as well as forest-grown bamboo and buho.",
            "Most of the walis tambo (local brooms) sold in Baguio come from Abucay."
        ],
        [
            "Government"
        ],
        [
            "See also: Sangguniang Bayan"
        ],
        [
            "The old Municipal Hall"
        ],
        [
            "The political seat of the municipal government is located at the Municipal Hall (also called Town Hall).",
            "During the Spanish colonial period, the Gobernadorcillo was the chief executive who held office at the town hall, then called the Presidencia."
        ],
        [
            "During the American period from 1898 to 1946, the elected Mayor and local officials, including the appointed ones hold office at the Municipal Town Hall.",
            "The executive and legislative departments perform their functions at the Sangguniang Bayan (Session Hall) and Municipal Trial Court, respectively, which are located at the Municipal Hall."
        ],
        [
            "Members of the Abucay Municipal Council (2022-2025):"
        ],
        [
            "District Representative (1st Legislative District, Bataan): Geraldine B. Roman"
        ],
        [
            "Municipal Mayor: Ruben C. Tagle"
        ],
        [
            "Municipal Vice Mayor: Roberto \"Wangbu\" Pasbustan"
        ],
        [
            "Municipal Councilors:"
        ],
        [
            "Dante Baluyot"
        ],
        [
            "Tikboy Soriano"
        ],
        [
            "Ato Dulay"
        ],
        [
            "Khristine Dela Fuente"
        ],
        [
            "Mer Canare"
        ],
        [
            "Arturo Mungcal"
        ],
        [
            "Gil Lingad"
        ],
        [
            "Ruben Valencia"
        ],
        [
            "The eight Sangguniang Bayan members led by the Vice Mayor hold office at the Abucay Sangguniang Bayan Session Hall."
        ],
        [
            "Tourism"
        ],
        [
            "Saint Dominic de Guzman Parish Church"
        ],
        [
            "Main article: Abucay Church"
        ],
        [
            "Parish Church of Saint Dominic de Guzman"
        ],
        [
            "One of the oldest in the Philippines, the first Abucay Church was established in 1587 and was administered by the Dominicans in 1588.",
            "The present church was built sometime in the early 1600s, the exact year is still unknown.",
            "The Church was badly damaged by the earthquake of September 16, 1852, and again by a fire in 1870.",
            "Father Jose Diego Pelaez rebuilt the church."
        ],
        [
            "The church still houses the bells donated in 1839 and 1859.",
            "The five bells of the Abucay Church were restored on January 17, 1978, by U.S.",
            "Naval Base Facility in Subic Bay, Zambales province according to a historical marker in the church."
        ],
        [
            "The Parish of Saint Dominic de Guzman has a population of 19,501 Catholics.",
            "Its patron saint is Saint Dominic de Guzman and the town's feast day is August 8.",
            "The present parish priest is Rev.",
            "Fr.",
            "Milver R. Cruz succeeding Rev.",
            "Fr.",
            "Josue Enero in June 5, 2023."
        ],
        [
            "Other attractions"
        ],
        [
            "Landmarks include the following:"
        ],
        [
            "Tomas Pinpin Monument — a memorial to Tomas Pinpin, the \"Patriarch of Filipino Printing\" in barangay Ibayo.",
            "The monument stands at the center of Tomas Pinpin Memorial Elementary School, the central and the biggest public elementary school in Abucay."
        ],
        [
            "Maria Canon Statue — In Barangay Sibul, a tower was erected by the Mie-ken Daiichi Shiēseo of the Japanese Sohyōshin Sports in 1978 to invoke the repose of dead souls from the World War II period."
        ],
        [
            "Pasukulan Falls — located in west Abucay in the forested valley of Mount Natib.",
            "The place is ideal for picnics."
        ],
        [
            "Sibul Springs — located in western Abucay featuring sulfuric swimming pools with a wide area for outdoor recreation.",
            "Its main attraction is the natural spring believed to provide muscle pain relief."
        ],
        [
            "Christmas Village in Mabatang — Christmas celebration in Mabatang extends to the streets of every sitio in the barangay, which are lavishly adorned to rejoice the season."
        ],
        [
            "Abucay Cockpit"
        ],
        [
            "Infrastructure"
        ],
        [
            "Electric power for Abucay is served by the Peninsula Electric Cooperative (PENELCO)."
        ],
        [
            "A 10-hectare (25-acre) sanitary landfill in Sitio Macao in Barangay Capitangan is the first of its kind in the province of Bataan."
        ],
        [
            "Education"
        ],
        [
            "Universities and colleges"
        ],
        [
            "Colegio de San Juan de Letran-Abucay - the Abucay campus of the Colegio de San Juan de Letran is situated in Dominican Hills, 8 kilometres (5.0 mi) west of town center of Abucay, on the slopes of Mount Natib at about 840 feet (260 m) in elevation."
        ],
        [
            "Bataan Peninsula State University-Abucay campus - formerly the Bataan National Agricultural School (BNAS) now part of the state university in Bataan."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Abucay |  (DILG)"
        ],
        [
            "^ a b \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b admin (2012-06-25).",
            "\"Abucay Church (Parish of St. Dominic de Guzman), Bataan\" Archived 2016-10-27 at the Wayback Machine.",
            "Philippine Churches.",
            "Retrieved on 2014-12-18."
        ],
        [
            "^ a b \"Abucay, Bataan - Discover Bataan Peninsula\".",
            "My Bataan.",
            "Retrieved on 2014-12-25."
        ],
        [
            "^"
        ],
        [
            "\"Abucay: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ a b \"Municipal: Abucay\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bataan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Philippines: Gov.Ph: About the Philippines\".",
            "Gov.ph.",
            "Archived from the original on 2009-01-22.",
            "Retrieved 2009-03-28."
        ],
        [
            "^ \"The Local Government Code Of The Philippines - Chan Robles Virtual Law Library\".",
            "Chanrobles.com.",
            "Retrieved 2016-11-11."
        ],
        [
            "^ \"2013 Candidates in Abucay | List of Candidates for Abucay, Bataan\".",
            "Know Your Candidates.",
            "Retrieved 2016-11-11."
        ],
        [
            "^ \"Newlyordained\".",
            "Balangadiocese.com.",
            "Retrieved 2016-11-11."
        ],
        [
            "^ a b \"Diocese of Balanga\".",
            "Archived from the original on 2012-09-06.",
            "Retrieved 2013-01-27."
        ],
        [
            "^ \"Santo Domingo Church – Abucay, Bataan\".",
            "Mybataan.com.",
            "2008-11-08.",
            "Archived from the original on 2016-11-11.",
            "Retrieved 2016-11-11."
        ],
        [
            "^ \"ParishesV1\".",
            "Balangadiocese.com.",
            "Retrieved 2016-11-11."
        ],
        [
            "^ \"Diocese of Balanga\".",
            "Archived from the original on 2014-05-17.",
            "Retrieved 2013-01-27."
        ],
        [
            "^ \"Abucay town builds first sanitary landfill in Bataan\".",
            "The Philippine Star.",
            "2011-06-07.",
            "Retrieved 2016-11-11."
        ],
        [
            "^ Sibug, Fr.",
            "Joemar L. (2008-02-17).",
            "\"An emerging university town in Abucay, Bataan\" Archived March 17, 2013, at the Wayback Machine.",
            "Inquirer.net, Philippine News for Filipinos."
        ],
        [
            "^ \"College of Business and Accountancy\".",
            "Bpsu.edu.ph.",
            "Retrieved 2016-11-11."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Abucay."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Abucay"
        ],
        [
            "Samal"
        ],
        [
            "Morong"
        ],
        [
            "Abucay"
        ],
        [
            "Manila Bay"
        ],
        [
            "Balanga"
        ],
        [
            "vte Province of BataanBalanga (capital)  Mariveles (largest LGU)Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Bagac"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Hermosa"
        ],
        [
            "Limay"
        ],
        [
            "Mariveles"
        ],
        [
            "Morong"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Pilar"
        ],
        [
            "Samal"
        ],
        [
            "Component city"
        ],
        [
            "Balanga"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Abucay&oldid=1210175194\""
        ],
        [
            "Categories: Municipalities of BataanPopulated places on Manila Bay1587 establishments in the PhilippinesPopulated places established in 1587Hidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles to be expanded from November 2016All articles to be expandedArticles using small message boxesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}