{
    "name": "Agoo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Agoo"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°19′19″N 120°21′53″E﻿ / ﻿16.321961°N 120.364675°E﻿ / 16.321961; 120.364675"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in La Union, Philippines"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesAgooMunicipalityMunicipality of AgooAgoo town center along the National Highway with the steeple of Basilica Minore of Our Lady of Charity on the right"
        ],
        [
            "FlagSealNickname: Origin of DinengdengMotto: Agoo Kay GandaAnthem: Agoo HymnMap of La Union with Agoo highlightedOpenStreetMapAgooLocation within the PhilippinesCoordinates: 16°19′19″N 120°21′53″E﻿ / ﻿16.321961°N 120.364675°E﻿ / 16.321961; 120.364675CountryPhilippinesRegionIlocos RegionProvinceLa UnionDistrict"
        ],
        [
            "2nd districtFoundedDecember 8, 1578Barangays49"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorHon.Frank Sibuma • Vice MayorHon.",
            "Tony Eslao • RepresentativeHon.",
            "Dante S. Garcia • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Antonio A. EslaoVioleta L. BalbinJosephus D. KomiyaRogelio R. de VeraReynaldo V. OllerVictor I. RiveraDominador P. RiveraRicardo P. Fronda"
        ],
        [
            " • Electorate44,058 voters (2022)Area • Revenue 2021 PHP 449,680,789.46 million  • Assets 2021 PHP 1,374,182,114.06 billion  • Expenditure 2021 PHP 315,552,246.76 million  • Liabilities 2021 PHP 184,804,460.81 million Service provider • ElectricityLa Union Electric Cooperative (LUELCO)Time zoneUTC+8 (PST)ZIP code2504PSGC013301000IDD : area code +63 (0)72Native languagesIlocano Pangasinan TagalogMajor religionsRoman CatholicNotable FestivalDinengdeng FestivalWebsiteagoolaunion.gov.ph"
        ],
        [
            "Agoo ("
        ],
        [
            "Agoo is 235 kilometres (146 mi) from Metro Manila, 34 kilometres (21 mi) from the provincial capital San Fernando, and 52 kilometres (32 mi) from Baguio via Marcos Highway."
        ],
        [
            "Etymology"
        ],
        [
            "The name agoo is usually attributed to \"aroo\" a pine-like evergreen tree (Casuarina equisetifolia or whistling pine) that thrived in the western coast during the pre-Spanish period."
        ],
        [
            "History"
        ],
        [
            "Agoo's administrative dates back further than most Philippine municipalities, with the town being established within the same decade that the Spanish colonizers arrived on the Island of Luzon."
        ],
        [
            "Early history"
        ],
        [
            "Before the arrival of European colonizers, Agoo, a trading port of Luyag na Caboloan (modern day-Pangasinan), was already a coastal maritime trading center for Northwestern Luzon,"
        ],
        [
            "Evidence of trade between Agoo and China has been excavated in the form of porcelain and pottery pieces unearthed at the site of the Catholic church during its renovation, - which are now kept in the Museo de Iloko."
        ],
        [
            "Japanese fishermen eventually established their first settlement in the Philippines at Agoo, passing on their fishing skills and technologies to the local populace."
        ],
        [
            "By the time the Spanish first arrived to colonize Luzon, they noted that Agoo was inhabited by people of the \"same race as those of Pangasinan,\""
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Sighting by Juan de Salcedo"
        ],
        [
            "In 1572, Juan de Salcedo, fresh from his conquest of Southern Luzon,  was ordered by Miguel Lopez de Legazpi to explore Northern Luzon and \"pacify the people in it\"."
        ],
        [
            "In June 1572, he was traversing the Angalakan River, when he saw and attacked three Japanese ships.",
            "When they fled, Salcedo followed them until they landed at a Japanese settlement.",
            "After paying tributes, the Japanese were allowed to remain.",
            "These Japanese would leave when the port of Agoo was later closed, but not without first teaching the natives their methods of fish culture, rice cultivation, deerskin tanning, duck breeding, and weapons manufacturing."
        ],
        [
            "Establishment by the Franciscans"
        ],
        [
            "A permanent settlement was established in Agoo in 1578 when two Franciscan Missionaries, Fray Juan Bautista Lucarelli of Italy and Fray Sebastian de Baeza of Spain, constructed a thatch and bamboo church in honor of Saint Francis of Assisi.",
            "Agoo encompassed a vast land area that spanned the modern-day towns of Rosario, Santo Tomas, Tubao, Pugo, Aringay, Caba, Bauang, and the place called \"Atuley\" or present-day San Juan.",
            "Agoo became the center of the campaign of pacification and conquest, not only of the surrounding towns that would later become La Union but of the mountain tribes in the Cordilleras as well."
        ],
        [
            "The two missionaries formally proclaimed Agoo as a civic unit.",
            "naming it after the river along whose banks it was built.",
            "At the time, the riverbank was forested with pine-like trees locally called \"aroo\" or \"agoho\" (Casuarina equisetifolia, or Whistling Pine)."
        ],
        [
            "El Puerto de Japon"
        ],
        [
            "During the early years of the Spanish colonial period, Agoo continued to be an important point of trade with Japan.",
            "Miguel De Loarca referred to Agoo as \"El Puerto de Japon\"  - the Japanese Port."
        ],
        [
            "Rosario Mendoza-Cortes, in her book \"Pangasinan 1572-1800\" notes that Agoo was the region's primary port of call for Japanese and Chinese traders - with the only other contender for the honor being Sual, Pangasinan.",
            "This was because there was a Japanese colony there.",
            "After all, traders at Agoo would have access to a greater number of people, and it was nearer to China and Japan.",
            "The main product traded from the area was the deer pelt, which was shipped to Japan."
        ],
        [
            "Agoo's role as a port deteriorated when the Spanish closed the Philippines to foreign trade.",
            "When foreign trade was allowed again, the shape of the gulf had changed and it was thus Sual that became the dominant port."
        ],
        [
            "Development by the Augustinians"
        ],
        [
            "Most of the town's early development can be attributed to the efforts of the Augustinian Order.",
            "They took over from the Franciscans and administered the town off and on throughout the Spanish occupation until the secular priests took over in 1898."
        ],
        [
            "Basilica Minore of Our Lady of Charity"
        ],
        [
            "They changed the town's patron saint to Santa Monica.",
            "They established a school where reading, writing, industrial works, and catechism were taught.",
            "They relocated the town center, laid out the streets and public buildings, and established roads leading to the nearby towns."
        ],
        [
            "To facilitate the construction of churches, public buildings, and bridges, they taught the people brick and lime making, brick-laying, and stone-quarrying.",
            "They introduced the \"moro-moro\", the singing of \"pasyon\", new farm implement, and new plants."
        ],
        [
            "Father Aquilino Garcia constructed a church, and by the end of the 15th century, the image of Nuestra Señora de Caridad (Our Lady of Charity) was installed in it.",
            "This church was destroyed in 1796 and a new one was built when the original settlement was moved to what has ever since been the town center.",
            "The church was then claimed to be the largest and grandest in northern Luzon during that time.",
            "Ruins are scattered throughout the town's center and some are visible at this point."
        ],
        [
            "Battle of Agoo (1661)"
        ],
        [
            "Main article: Malong Revolt"
        ],
        [
            "In 1661, Andres Malong of Pangasinan failed to recover La Union from the Spaniards after the Battle of Agoo."
        ],
        [
            "1849 Integration into La Union"
        ],
        [
            "On October 29, 1849, Governor General Claveria issued a promovido to fuse the Pangasinan-Ilocos-Cordillera areas into La Union.",
            "On March 2, 1850, Governor General Antonio Maria Blanco signed the Superior Decreto of La Union  (34th province from Cebu-1565), with Captain Toribio Ruiz de la Escalera as the first Gobernador Military y Politico.",
            "Isabella II of Spain decreed the province's creation on April 18, 1854."
        ],
        [
            "The new province comprised the north-western towns of Pangasinan and the towns of Ilocos Sur south of the Amburayan river.",
            "Agoo was the oldest town to be integrated and was listed as having a population of 6,936 people."
        ],
        [
            "World War II"
        ],
        [
            "Main article: Japanese Invasion of Lingayen Gulf"
        ],
        [
            "Agoo, along with the towns of Caba, La Union and Bauang, La Union were the first places the Japanese invasion force sought to control  during the main effort to capture Luzon at the beginning of World War 2 - now known as the Japanese Invasion of Lingayen Gulf.",
            "Capturing the three towns which were connected by a high quality road, but protected on one side by the ocean and the other by the sea, meant that the Japanese forces were easily able to establish a secure beachhead.",
            "Once they had done so, they launched attacks against defense forces at San Fernando, La Union and Rosario, La Union, and from there they deployed southwards across the plains of Pangasinan and Tarlac to take Fort Stotsenburg in Pampanga, then Bulacan, and finally Manila."
        ],
        [
            "In the early morning of 22 December 1941, Agoo was one of three beachheads taken by the invasion force of General Masaharu Homma during the Japanese Invasion of Lingayen Gulf."
        ],
        [
            "The Japanese' 47th Infantry Regiment under the command of Col Isamu Yanagi, accompanied by the 4th Tank Regiment and supported by a flotilla of the Imperial Japanese Navy led by Vice Admiral Kenzaburo Hara (consisting of the light cruiser Natori , destroyers Fumizuki, Nagatsuki, Satsuki, Minazuki, Harukaze,  Hatakaze, three minesweepers, six anti-submarine craft and six transports) was supposed to land on the beaches of Agoo beginning 5:00 A.M. on December 22, 1941, having left Takao on Taiwan the evening of December 18."
        ],
        [
            "The Japanese 47th Infantry and 4th Tank Regiment were confronted by heavy weather, however, and were thus delayed and dispersed.",
            "They landed at about 7:30 A.M. on a four-mile stretch of beach all the way from Agoo to just north of Damortis."
        ],
        [
            "Agoo is thus recorded in WWII annals as one of the Japanese staging points for the Battle of Rosario."
        ],
        [
            "Martial law"
        ],
        [
            "Main article: Martial law under Ferdinand Marcos"
        ],
        [
            "See also: Jose D. Aspiras and Antonio L. Mabutas"
        ],
        [
            "The beginning of the 1970s marked a period of turmoil and change in the Philippines because Ferdinand Marcos had used foreign debt to fund too many public works projects just before his 1969 reelection campaign,"
        ],
        [
            "Marcos' efforts to consolidate political power did not get much resistance in the La Union,"
        ],
        [
            "But there were some Agoo natives, such as then-Davao Archbishop Antonio L. Mabutas, who spoke against the human rights abuses during martial law."
        ],
        [
            "1980s and 1990s"
        ],
        [
            "Establishment of High School and University"
        ],
        [
            "Main article: Don Mariano Marcos Memorial State University"
        ],
        [
            "On July 23, 1945, the Municipal government, then led by Mayor Miguel Fontanilla, established South Provincial High School in response to education-oriented citizen Ramon Mabutas' calls for the establishment of a public high school.",
            "South Provincial High School turned Agoo into a center of education for Southern La Union and became one of the constituent state-run schools that were combined by Presidential Decree 1778 to create the Don Mariano Marcos Memorial State University in 1981."
        ],
        [
            "After the 1986 EDSA Revolution"
        ],
        [
            "See also: Provisional Government of the Philippines (1986–1987)"
        ],
        [
            "After the February 1986 People Power Revolution, President Corazon Aquino placed the Philippines under a revolutionary government until the 1987 Constitution of the Philippines could be ratified.",
            "During this time, the Municipality of Agoo was placed under the administration of OIC Mayor Antonio Q. Estrada."
        ],
        [
            "1990 Luzon Earthquake"
        ],
        [
            "Main article: 1990 Luzon earthquake"
        ],
        [
            "At 4.26 P.M. on July 16, 1990, Agoo was hit by the 1990 Luzon earthquake, and was one of the most severely affected locales."
        ],
        [
            "The Basilica Minore of Our Lady of Charity was badly damaged, and the bell tower which was then the only remaining structure from the 1893 church, crashed completely."
        ],
        [
            "Alleged Marian Apparitions"
        ],
        [
            "Main article: Judiel Nieva"
        ],
        [
            "The town gained media attention in the early 1990s for the alleged Marian apparitions of the Blessed Virgin Mary to Judiel Nieva.",
            "Nieva reported seeing the Virgin Mary, popularly known as Our Lady of Agoo atop a Guava tree, a statue weeping with blood became highly sensationalized.",
            "Religious pilgrimages among Filipino Catholics increased by the millions as people flocked to see the phenomenon.",
            "The alleged apparition and healing events came into the attention of the Catholic Bishops' Conference of the Philippines, who in turn began an investigation and later released an ecclesiastical ruling that the apparitions were non-supernatural in origin in 1993."
        ],
        [
            "Recent history"
        ],
        [
            "Failed proposed merger of Agoo and Aringay"
        ],
        [
            "On June 11, 2014, then-representative Eufranio Eriguel filed House Bill 4644 to establish the first city in the second district by merging the municipalities of Agoo and Aringay.",
            "The bill was co-authored by La Union first district Rep. Victor Ortega and Abono party-list Rep. Francisco Emmanuel Ortega III, and was deemed necessary because neither Aringay nor Agoo alone could meet the requirements to create a Philippine city: a population of 150,000; an annual income of P100 million minimum a year; and a land area of 100 square kilometers.",
            "(As of 2014, the national census showed that Agoo and Aringay have about 65,000 and 47,500 residents, respectively.",
            "Agoo posted more than P90 million, and Aringay made P15,000 million in annual earnings, respectively)"
        ],
        [
            "The proposed city would have two districts under a city mayor and city vice mayor along with 14 councilors in the Sangguniang Panlungsod,"
        ],
        [
            "The proposed bill sparked protests from the people of both Agoo and Aringay who did not want the merger because it would subject them to the same high local taxes as Agoo and because of concerns that Agoo and Aringay would lose their cultural identities."
        ],
        [
            "Election and Drug Related Violence (2010-2018)"
        ],
        [
            "Since 2010,"
        ],
        [
            "Media"
        ],
        [
            "In 2013, the declaration of the towns Tubao, Agoo, Caba, and Aringay as election hotspots compelled the Philippine National Police to temporarily remove the police chiefs of the four towns during the election period,"
        ],
        [
            "Also during the 2010s, a number of drug-related incidents in Agoo came to national attention."
        ],
        [
            "On August 16, 2016, former Congressman Eriguel was included by Philippine President Rodrigo Duterte as one of the local government officials and legislators allegedly involved in illegal drug trade"
        ],
        [
            "On May 12, 2018, Eriguel and two others were gunned down by unknown assailants in an ambush during an event for the 2018 Barangay elections."
        ],
        [
            "Reforestation efforts and establishment of Ecopark (2021-present)"
        ],
        [
            "In 2021, the Philippines' Department of Environment and Natural Resources (DENR) established"
        ],
        [
            "A 2023 vegetation survey of the land area alone found thriving populations of 17 plants, or which 7 were native and 4 were naturalized while only 6 were exotic, cultivated or unclassified."
        ],
        [
            "Election of Mayor Sibuma"
        ],
        [
            "After local tensions leading up to the 2022 Philippine local elections, Frank Ong Sibuma was elected as the Municipal Mayor of Agoo.",
            "Sibuma's candidacy was questioned on technicalities regarding his residency, and a long dispute had to be resolved by the Supreme Court of the Philippines in a January 24, 2023 decision which upheld Sibuma's election."
        ],
        [
            "Geography"
        ],
        [
            "Agoo and La Union are part of the Ilocos Region, which is located on the narrow plain between the Cordillera Central and the West Philippine Sea.",
            "Agoo itself is one of the southern municipalities and is bounded on the north by Aringay, on the east by the municipality of Tubao further up the foothills of the Cordilleras, and on the south by Santo Tomas.",
            "Agoo's western shores consist of a long beach facing Lingayen Gulf and West Philippine Sea."
        ],
        [
            "The Agoo River, which is sometimes referred by the locals as the Principe River after the Taytay Principe Bridge which traverses it along the main highway, flows through the town from uphill in the east to where it meets the West Philippine Sea in the west."
        ],
        [
            "Barangays"
        ],
        [
            "Agoo is divided into 49 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Ambitacay"
        ],
        [
            "Balawarte"
        ],
        [
            "Capas"
        ],
        [
            "Consolacion (Poblacion)"
        ],
        [
            "Macalva Central"
        ],
        [
            "Macalva Norte"
        ],
        [
            "Macalva Sur"
        ],
        [
            "Nazareno"
        ],
        [
            "Purok"
        ],
        [
            "San Agustin East"
        ],
        [
            "San Agustin Norte"
        ],
        [
            "San Agustin Sur"
        ],
        [
            "San Antonino"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro"
        ],
        [
            "San Joaquin Norte"
        ],
        [
            "San Joaquin Sur"
        ],
        [
            "San Jose Norte"
        ],
        [
            "San Jose Sur"
        ],
        [
            "San Juan"
        ],
        [
            "San Julian Central"
        ],
        [
            "San Julian East"
        ],
        [
            "San Julian Norte"
        ],
        [
            "San Julian West"
        ],
        [
            "San Manuel Norte"
        ],
        [
            "San Manuel Sur"
        ],
        [
            "San Marcos"
        ],
        [
            "San Miguel"
        ],
        [
            "San Nicolas Central (Poblacion)"
        ],
        [
            "San Nicolas East"
        ],
        [
            "San Nicolas Norte (Poblacion)"
        ],
        [
            "San Nicolas Sur (Poblacion)"
        ],
        [
            "San Nicolas West"
        ],
        [
            "San Pedro"
        ],
        [
            "San Roque East"
        ],
        [
            "San Vicente Norte"
        ],
        [
            "San Vicente Sur"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Barbara (Poblacion)"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Monica"
        ],
        [
            "Santa Rita (Nalinac)"
        ],
        [
            "Santa Rita East"
        ],
        [
            "Santa Rita Norte"
        ],
        [
            "Santa Rita Sur"
        ],
        [
            "Santa Rita West"
        ],
        [
            "San Roque West"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Agoo, La Union"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "15(0.6)"
        ],
        [
            "16(0.6)"
        ],
        [
            "24(0.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "102(4.0)"
        ],
        [
            "121(4.8)"
        ],
        [
            "177(7.0)"
        ],
        [
            "165(6.5)"
        ],
        [
            "144(5.7)"
        ],
        [
            "170(6.7)"
        ],
        [
            "56(2.2)"
        ],
        [
            "23(0.9)"
        ],
        [
            "1,046(41.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "6.3"
        ],
        [
            "6.6"
        ],
        [
            "9.5"
        ],
        [
            "12.8"
        ],
        [
            "20.6"
        ],
        [
            "23.5"
        ],
        [
            "25.4"
        ],
        [
            "23.4"
        ],
        [
            "23.2"
        ],
        [
            "21.4"
        ],
        [
            "14.0"
        ],
        [
            "8.2"
        ],
        [
            "194.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Geology"
        ],
        [
            "According to findings of the Philippine Rice Research Institute, Agoo's land consists mostly of the San Manuel (a dark grayish brown sandy loam characterized by medium compactness and a Ph ranging from highly acidic to slightly alkaline), Maligaya (dark grayish brown clay loam with course fragments of soft powdery red and black concretions, characterized by medium compactness and a neutral to slightly alkaline Ph), Bauang (dark grayish brown clay loam with course fragments of highly weathered stratified shales and sandstones characterized by strongly acidic to slightly acidic Ph), and Annam (brown clay loam with course fragments of partially and highly weathered rock or gravel and yellowish brown Iron and Magnesium concretions, characterized by an extremely to slightly acidic Ph) type soils."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of AgooYearPop.±% p.a.1903 10,653—    1918 12,517+1.08%1939 13,938+0.51%1948 16,638+1.99%1960 21,093+2.00%1970 28,696+3.12%1975 32,450+2.50%1980 34,849+1.44%1990 42,698+2.05%1995 47,721+2.11%2000 51,923+1.83%2007 57,952+1.53%2010 60,596+1.64%2015 63,692+0.95%2020 66,028+0.71%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Agoo was 66,028 people, with a density of 1,200 inhabitants per square kilometre or 3,100 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Agoo"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  23.20"
        ],
        [
            "2009  21.29"
        ],
        [
            "2012  8.50"
        ],
        [
            "2015  6.67"
        ],
        [
            "2018  3.26"
        ],
        [
            "2021  8.67"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Just as the national government, the municipal government of Agoo, is divided into three branches: executive, legislative, and judiciary.",
            "The judicial branch is administered solely by the Supreme Court of the Philippines.",
            "The LGUs have control of the executive and legislative branches."
        ],
        [
            "The executive branch is composed of the mayor and the barangay captain for the barangays.Local Government Code of the Philippines, Book III, Department of the Interior and Local Government official website."
        ],
        [
            "The legislative branch is composed of the Sangguniang Bayan (town assembly), Sangguniang Barangay (barangay council), and the Sangguniang Kabataan for the youth sector."
        ],
        [
            "The seat of Government is vested upon the Mayor and other elected officers who hold office at the Townhall.",
            "The Sangguniang Bayan is the center of legislation, stationed in Agoo Municipio."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Dante S. Garcia"
        ],
        [
            "Mayor"
        ],
        [
            "Frank O. Sibuma"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Antonio A. Eslao"
        ],
        [
            "Councilors"
        ],
        [
            "Jun Alba"
        ],
        [
            "Christian Rivera"
        ],
        [
            "Mark Anthony Refugia"
        ],
        [
            "Ron Boado"
        ],
        [
            "Infinity Sambolledo"
        ],
        [
            "Precy Komiya"
        ],
        [
            "Wina Eriguel"
        ],
        [
            "Florent Bulatao"
        ],
        [
            "Tourism"
        ],
        [
            "The redeveloped Imelda Garden"
        ],
        [
            "Jose D. Aspiras ancestral house"
        ],
        [
            "Agoo has interesting attractions and main festival/events:"
        ],
        [
            "Cultural and Architectural Attractions"
        ],
        [
            "Basilica Minore of Our Lady of Charity"
        ],
        [
            "Museo de Iloko -  The 1979 Museo de La Union or Museo Iloko was the former Presidencia of Agoo (restored by the Philippine Tourism Authority in 1981)."
        ],
        [
            "Eagle of the North Park - a giant eagle structure designed by Arch.",
            "Anselmo Day-ag as a Symbol of Marcoses' power."
        ],
        [
            "Agoo Presidencia and New Town Hall"
        ],
        [
            "Agoo Welcome Arch (1578)"
        ],
        [
            "Plaza de la Virgen"
        ],
        [
            "Don Mariano Marcos Memorial State University (Marcos Sports Center) DMMMSU-South La Union Campus"
        ],
        [
            "Imelda Garden (fishermen sculpture, Agoo Town Square and Town Plaza)"
        ],
        [
            "Jose D. Aspiras ancestral house"
        ],
        [
            "Jose D. Aspiras Civic Center"
        ],
        [
            "Our Lady of Lourdes Grotto"
        ],
        [
            "Nature Attractions"
        ],
        [
            "Agoo–Damortis Protected Landscape and Seascape"
        ],
        [
            "Agoo Ecopark (Sta.",
            "Rita West/Central)"
        ],
        [
            "Agoo beach (San Nicolas East)"
        ],
        [
            "Camp Wagi (Brgy.",
            "Capas)"
        ],
        [
            "San Antonio-San Miguel Eco-Mountain Trail"
        ],
        [
            "Festivals"
        ],
        [
            "Dinengdeng festival and Patronal Town Fiesta (8th, April 26 to May 4, 2012 - \"Lifting Agoo to New Heights Through Dynamic, Dedicated and Visionary Leadership.\"",
            "101 Dinengdeng recipes, an Agoo/Ilocano vegetable delicacy of Ilocanos festivity meant DMMMSU-South La Union Campus Grandstand, Agoo)"
        ],
        [
            "Agoo Kilawin (Ceviche) Festival, December 28, 2011"
        ],
        [
            "Other Attractions"
        ],
        [
            "San Roque West-San Roque East fish ponds"
        ],
        [
            "Aspiras-Palispis Highway (formerly the Marcos Highway and Agoo-Baguio Road), connecting Agoo to Baguio City"
        ],
        [
            "Notable personalities"
        ],
        [
            "Juan de Salcedo - Spanish Conquistador whose arrival marked the first presence of the Spanish colonizers in Agoo"
        ],
        [
            "Fray Juan Bautista Lucarelli and Fray Sebastian de Baeza - Franciscan priests who established the Town of Agoo after De Salcedo"
        ],
        [
            "Congressman Jose D. Aspiras - Resident of Agoo, Former Secretary of Tourism (Philippines) official during the Marcos administration."
        ],
        [
            "Former Congressman and Former Mayor Eufranio Eriguel"
        ],
        [
            "Former Congresswoman and Former Mayor Sandra Eriguel"
        ],
        [
            "Archbishop Antonio L. Mabutas - Native of Agoo who was eventually designated Bishop of the Roman Catholic Archdiocese of Davao from (1972–1996), noted as one of the first Catholic Bishops to officially criticize the Human rights abuses of the Marcos dictatorship."
        ],
        [
            "Judiel Nieva (also known as Angel de la Vega) - Resident of Agoo who is a transgender actress and businesswoman notable for her claims of seeing a vision of the Virgin Mary atop a guava tree in Agoo, La Union, Philippines in what was labeled as the \"Miracle of Agoo\" from 1989 until 1993."
        ],
        [
            "Kyla Romero - Native of Agoo who is a film Director and Screenwriter known for Directing the short film Dosena which became a 2023 FAMAS nominee for Best Short Film, and for writing the screenplay of Dosena and another short film Hinakdal; winner of the Best Screenplay for Short Film for Hinakdal (with Cowriter Alvin Belarmino)."
        ],
        [
            "Jessica Soho - Native of Agoo who is a Filipino broadcast journalist affiliated with GMA Network."
        ],
        [
            "Mayor Frank Sibuma"
        ],
        [
            "Image gallery"
        ],
        [
            "Agoo Public Market"
        ],
        [
            "Town Plaza"
        ],
        [
            "San Roque West fish ponds at Sitio Banaoang"
        ],
        [
            "Agoo beach (San Nicolas East)"
        ],
        [
            " Panorama of Agoo hills and rice-fields"
        ],
        [
            "References"
        ],
        [
            "^ a b c de Loarca, Miguel (1582).",
            "Relacion de Las Yslas Filipinas."
        ],
        [
            "^ a b c d e f g h i j k l m n o Mendoza-Cortes, Rosario (1974).",
            "Pangasinan, 1572-1800.",
            "Quezon City: University of the Philippines Press."
        ],
        [
            "^ a b c d e f g h i Sals, Florent Joseph (2005).",
            "The History of Agoo: 1578-2005.",
            "La Union: Limbagan Printhouse.",
            "p. 80."
        ],
        [
            "^  Municipality of Agoo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ General Information Archived 2012-10-11 at the Wayback Machine"
        ],
        [
            "^ \"Agoo\"."
        ],
        [
            "^ a b Panela, Shaira (2017-03-19).",
            "\"Looking into the past through the eyes of the future\".",
            "Rappler.",
            "Archived from the original on 2022-01-03.",
            "Retrieved 2022-01-03."
        ],
        [
            "^ Scott, William (1974).",
            "The Discovery of the Igorots.",
            "Quezon City: New Day Publishers.",
            "p. 58.",
            "ISBN 9711000873."
        ],
        [
            "^ a b \"La Union Profile: La Union History - Province of La Union :: Official Website\".",
            "Archived from the original on 2015-09-27.",
            "Retrieved 2014-04-25."
        ],
        [
            "^ \"The Main Landings\".",
            "Retrieved 18 March 2014."
        ],
        [
            "^ a b c d Dull, Paul S. (1978).",
            "A Battle History of the Imperial Japanese Navy, 1941- 1945.",
            "Naval Institute Press.",
            "pp. 29–31.",
            "ISBN 1299324614."
        ],
        [
            "^ Balbosa, Joven Zamoras (1992).",
            "\"IMF Stabilization Program and Economic Growth: The Case of the Philippines\" (PDF).",
            "Journal of Philippine Development.",
            "XIX (35).",
            "Archived from the original (PDF) on September 21, 2021.",
            "Retrieved November 6, 2022."
        ],
        [
            "^ Balisacan, A. M.; Hill, Hal (2003).",
            "The Philippine Economy: Development, Policies, and Challenges.",
            "Oxford University Press.",
            "ISBN 9780195158984."
        ],
        [
            "^ Celoza, Albert F. (1997).",
            "Ferdinand Marcos and the Philippines: The Political Economy of Authoritarianism.",
            "Greenwood Publishing Group.",
            "ISBN 9780275941376."
        ],
        [
            "^ Schirmer, Daniel B.",
            "(1987).",
            "The Philippines reader : a history of colonialism, neocolonialism, dictatorship, and resistance (1st ed.).",
            "Boston: South End Press.",
            "ISBN 0896082768.",
            "OCLC 14214735."
        ],
        [
            "^ Kessler, Richard J.",
            "(1989).",
            "Rebellion and repression in the Philippines.",
            "New Haven: Yale University Press.",
            "ISBN 0300044062.",
            "OCLC 19266663."
        ],
        [
            "^ a b Cortes, Rosario Mendoza.",
            "(1990) Pangasinan, 1901-1986: A Political, Socioeconomic, and Cultural History.",
            "New Day Publishers."
        ],
        [
            "^ a b Turner, Mark M. (1989) Elites and Power in a Philippine Town.",
            "Under Martial Law, 1972-76.",
            "Philippine Studies 37: 283-300."
        ],
        [
            "^ a b \"Honoring Davao's Contributions to the Struggle for Rights, Freedom\".",
            "Bantayog ng mga Bayani.",
            "23 February 2018.",
            "Archived from the original on 2018-02-28.",
            "Retrieved 8 February 2020."
        ],
        [
            "^ Maglana, MAgz (2017-07-10).",
            "\"VOICES FROM MINDANAO: Fear is not a good foundation for getting Mindanao out of the rut\".",
            "MindaNews.",
            "Archived from the original on 2020-02-08.",
            "Retrieved 8 February 2020."
        ],
        [
            "^ a b Youngblood, Robert L. (1993).",
            "Marcos against the church : economic development and political repression in the Philippines.",
            "Quezon City: New Day Publ.",
            "ISBN 971-10-0512-3.",
            "OCLC 312239945."
        ],
        [
            "^ \"History\".",
            "21 June 2019."
        ],
        [
            "^ a b Bankoff, Greg (2003).",
            "Cultures of Disaster: Society and Natural Hazards in the Philippines.",
            "Psychology Press.",
            "ISBN 978-0-7007-1761-3."
        ],
        [
            "^ \"Basilica Minore of our Lady of Charity - Agoo\"."
        ],
        [
            "^ a b c d Lazaro, Freddie G. (2014-08-23).",
            "\"Agoo-Aringay merger, mariing tinututulan\".",
            "Balita.",
            "Archived from the original on 2017-02-20.",
            "Retrieved 2017-02-14."
        ],
        [
            "^ Capuno, Joseph J.",
            "(2013).",
            "\"Fiscal transfers and gerrymandering under decentralization in the Philippines\" (PDF).",
            "UP School of Economics Discussion Papers.",
            "2013–4."
        ],
        [
            "^ a b Cantos, Joy (January 8, 2010).",
            "\"5 pang lalawigan 'hotspot'\".",
            "The Philippine Star.",
            "Archived from the original on March 12, 2017.",
            "Retrieved February 14, 2017."
        ],
        [
            "^ a b c d e f \"Cops eye 'hot spot' tags on 2 towns in La Union\".",
            "Philippine Daily Inquirer.",
            "Retrieved 2017-03-09."
        ],
        [
            "^ a b c d e f g \"Police chiefs pulled out of La Union hot spots\".",
            "Rappler.",
            "Retrieved 2017-03-09."
        ],
        [
            "^ a b Aquino, Miriam (2012-11-23).",
            "\"Civic groups hold peace rally in La Union\".",
            "Philippine Information Agency.",
            "Archived from the original on 2013-04-16.",
            "Retrieved 2012-12-13."
        ],
        [
            "^ \"PIA | Philippine Information Agency | Civic groups hold peace rally in La Union\".",
            "Philippine Information Agency.",
            "Archived from the original on 2013-04-16.",
            "Retrieved 2012-12-13."
        ],
        [
            "^ \"Binay supporter Eriguel survives attack in San Fernando, La Union\".",
            "InterAksyon.com.",
            "2016-04-30.",
            "Archived from the original on 2017-02-16.",
            "Retrieved 2017-02-16."
        ],
        [
            "^ a b c PALISADA, THE REGIONAL DRIFT | STANLEY.",
            "\"2010 Elections: The Battles of Luzon - Stanley Palisada (Part 1 of 3)\".",
            "ABS-CBN News.",
            "Retrieved 2017-03-09."
        ],
        [
            "^ Fuente, Stacy Dela.",
            "\"This elementary teacher in La Union sells drugs for unbelievable reasons\".",
            "Kami.com.ph - Philippines news.",
            "Retrieved 2017-03-09."
        ],
        [
            "^ Jimenez, Carmela.",
            "\"Thousands of drug users, pushers face La Union governor\".",
            "ABS-CBN News.",
            "Retrieved 2017-03-09."
        ],
        [
            "^ \"5 suspected drug dealers arrested in La Union\".",
            "GMA News.",
            "Retrieved 2017-03-09."
        ],
        [
            "^ \"Top cops in 4 La Union towns sacked amid probe of 'drug' mayors\".",
            "Rappler.",
            "Retrieved 2017-03-09."
        ],
        [
            "^ \"FULL TEXT: Duterte's speech linking government officials to illegal drugs\".",
            "The Philippine Star.",
            "August 7, 2016.",
            "Archived from the original on 2016-09-21.",
            "Retrieved August 24, 2016."
        ],
        [
            "^ \"Duterte names officials linked to drugs\".",
            "Rappler.",
            "7 August 2016.",
            "Archived from the original on 2017-02-09.",
            "Retrieved 24 August 2016."
        ],
        [
            "^ \"FULL TRANSCRIPT: Duterte's exposé vs drug-tagged officials\".",
            "ABS-CBN News.",
            "7 August 2016.",
            "Archived from the original on 2017-02-06.",
            "Retrieved 24 August 2016."
        ],
        [
            "^ \"'Narco mayors': Politics behind supposed links to illegal drugs\".",
            "Rappler.",
            "Archived from the original on 2017-02-16.",
            "Retrieved 2017-02-16."
        ],
        [
            "^ \"Former La Union congressman, 2 bodyguards shot dead\".",
            "GMA News Online.",
            "Retrieved 2018-05-12."
        ],
        [
            "^ a b c d Lizardo, Robelyn S.; Laron, Ginalyn G.; Boado, Derick T.; Aspiras, Beatriz E. (2023-08-05).",
            "\"Quantitative vegetation analysis of Agoo Eco-park in Sta.",
            "Rita West Agoo, La, Union using grid-based mapping\".",
            "Journal of Biodiversity and Environmental Sciences.",
            "23 (2): 47–55.",
            "{{cite journal}}:  CS1 maint: date and year (link)"
        ],
        [
            "^ Sotelo, Yolanda (2020-02-23).",
            "\"Nature retreat in Agoo ecopark\".",
            "Philippine Daily Inquirer.",
            "Retrieved 2024-01-23."
        ],
        [
            "^ Trinidad, Chester (2023-09-01).",
            "\"A haven of biodiversity in the heart of La Union\".",
            "Philippine Information Agency Website.",
            "Archived from the original on 2024-01-23.",
            "Retrieved 2024-01-23."
        ],
        [
            "^ Public Information Office, Supreme Court of the Philippines (2023-01-25).",
            "\"Supreme Court Upholds Election of Agoo Mayor Sibuma\".",
            "Supreme Court of the Philippines Website."
        ],
        [
            "^"
        ],
        [
            "\"Agoo: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Wilfredo B. Collado; et al.",
            "(2017).",
            "\"Simplified keys to soil series.",
            "La union\" (PDF).",
            "pinoyrice.com.",
            "Retrieved 25 April 2023."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of La Union\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Brief History Archived 2012-10-11 at the Wayback Machine"
        ],
        [
            "^ \"2022 National and Local Elections\".",
            "Commission on Elections.",
            "Retrieved March 6, 2022."
        ],
        [
            "^ \"National Commission for Culture and the Arts\".",
            "Archived from the original on 2012-11-01.",
            "Retrieved 2012-12-13."
        ],
        [
            "^ Land Bank Of The Philippines, Petitioner, V. Eduardo M. Cacayuran, Respondent, Municipality Of Agoo, La Union, Intervenor., G.R.",
            "No.",
            "191667 (2015-04-22)."
        ],
        [
            "^ \"Supreme Court affirms former Agoo mayor guilty in loan scam\".",
            "Northern Philippines Times.",
            "2010-04-26."
        ],
        [
            "^ Major Tourist Spots Archived 2012-10-11 at the Wayback Machine"
        ],
        [
            "^ 8th Dinengdeng Festival & Patronal Town Fiesta"
        ],
        [
            "^ \"Iti Mapukpukaw, Rookie are top winners at the 19th Cinemalaya\".",
            "BusinessWorld.",
            "14 August 2023."
        ],
        [
            "^ \"Kyla Romero - Awards\".",
            "IMDb."
        ],
        [
            "^ Raquel, Butch S. (November 21, 2014).",
            "\"The treasures of Jessica Soho\".",
            "Philstar.com.",
            "Retrieved 2024-06-03."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Agoo."
        ],
        [
            "The History and founding of Agoo, La Union (Facebook)"
        ],
        [
            "Free Public Domain Images of Agoo beaches and surrounds (Facebook)"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Lingayen Gulf"
        ],
        [
            "Agoo"
        ],
        [
            "Tubao"
        ],
        [
            "Santo Tomas"
        ],
        [
            "vteProvince of La UnionSan Fernando (capital and largest city)Municipalities"
        ],
        [
            "Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Bacnotan"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Bangar"
        ],
        [
            "Bauang"
        ],
        [
            "Burgos"
        ],
        [
            "Caba"
        ],
        [
            "Luna"
        ],
        [
            "Naguilian"
        ],
        [
            "Pugo"
        ],
        [
            "Rosario"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santol"
        ],
        [
            "Sudipen"
        ],
        [
            "Tubao"
        ],
        [
            "Component city"
        ],
        [
            "San Fernando"
        ],
        [
            "BarangaysSee: List of barangays in La Union"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Agoo&oldid=1233227148\""
        ],
        [
            "Category: Municipalities of La UnionHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsWebarchive template wayback linksCS1: long volume valueCS1 maint: date and yearCS1 maint: numeric names: authors listPages using cite court with unknown parametersArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Tagalog IPAArticles containing Ilocano-language textArticles containing Pangasinan-language textArticles containing Filipino-language textAll articles that may have off-topic sectionsWikipedia articles that may have off-topic sections from January 2024Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}