{
    "name": "Alabat",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Alabat, Quezon"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCatalàCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°06′08″N 122°00′49″E﻿ / ﻿14.102261°N 122.013569°E﻿ / 14.102261; 122.013569"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Quezon, Philippines"
        ],
        [
            "For the island, see Alabat Island."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Alabat, Quezon\" – news · newspapers · books · scholar · JSTOR (November 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesAlabatMunicipalityMunicipality of Alabat"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "\"The Hidden Gem of Quezon\""
        ],
        [
            "\"Gateway Municipality to the Pacific\""
        ],
        [
            "\"Alabat: The Hidden Paradise\""
        ],
        [
            "Motto(s): Mapayapa, Maunlad, Maganda at Masayang Bayan ng AlabatMap of Quezon with Alabat highlightedOpenStreetMapAlabatLocation within the PhilippinesCoordinates: 14°06′08″N 122°00′49″E﻿ / ﻿14.102261°N 122.013569°E﻿ / 14.102261; 122.013569CountryPhilippinesRegionCalabarzonProvinceQuezonDistrict"
        ],
        [
            "4th districtFoundedMay 15, 1900Barangays19"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJose Ramil R. Arquiza • Vice MayorIreneo R. Layosa Jr. • RepresentativeKeith Micah DL.",
            "Tan • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Eldin Fren A. CanimoMarriz M. VerzoRaul U. DeclaroKhem Wenbert M. HerveraRichard C. LopezLidio S. EspañolaJayson D. PascuhinGrant Buena Joy C. Mesa"
        ],
        [
            " • Electorate11,711 voters (2022)Area • Revenue₱ 89.32 million (2020) • Assets₱ 136.4 million (2020) • Expenditure₱ 83.84 million (2020) • Liabilities₱ 51.38 million (2020)Service provider • ElectricityQuezon 1 Electric Cooperative (QUEZELCO 1)Time zoneUTC+8 (PST)ZIP code4333PSGC0405602000IDD : area code +63 (0)42Native languagesTagalogWebsitewww.alabat.gov.ph"
        ],
        [
            "Alabat, officially the Municipality of Alabat (Tagalog: Bayan ng Alabat),  is a 5th class municipality in the province of Quezon, Philippines.",
            "According to the 2020 census, it has a population of 15,936 people."
        ],
        [
            "The name Alabat came from the local Tagalog word Alabat, meaning \"balustrade\"."
        ],
        [
            "The town is home to a few speakers of the critically endangered Inagta Alabat language, one of the most endangered languages in the world as listed by UNESCO."
        ],
        [
            "Etymology"
        ],
        [
            "Long before the colonial Spanish, Japanese, or Americans set foot on Alabat Island, the mountains were already inhabited by the “Baluga” (aborigines).",
            "Nomadic by nature, they would clean patches of land, plant rice and vegetables and hunt.",
            "After harvest, they would migrate to another part of the forest and repeat the cycle.",
            "The elder of the community was their leader and adviser.",
            "During drought, they made temporary houses near the shore and used fishing as their primary means of livelihood."
        ],
        [
            "Local folklore says that a Spanish priest from the mainland saw the Island from across Lamon Bay.",
            "He was curious as to what lay in that island and its inhabitants.",
            "The Spanish priest crossed the bay on the boat and founded a church at what is today barangay Gordon.",
            "The church today is underwater but the cross can still be seen."
        ],
        [
            "The name Alabat which has been used as it is now, came from the word Alâbât (local Tagalog word for balustrade or balcony).",
            "The early inhabitants of this place made balustrades across their doors to prevent small children from walking out of the house or falling from the stairwells."
        ],
        [
            "Local history says that a platoon of American soldiers came to Lupac after the Philippine independence to conduct a survey.",
            "They entered a native's hut and asked the person what the name of the place was.",
            "The owner of the house at that time was holding the balustrade that he was making.",
            "Unable to understand the English language, he thought they were asking what he was doing so the native replied alâbât!",
            "The leader took his diary and wrote the word A L A B A T without any accent."
        ],
        [
            "Another local folklore says that the name 'Alabat' was from Muslim origins where Alabat comes from Allah-bat, and if the word is mixed up actually means bat-ala or bathala which is the local word for god."
        ],
        [
            "But according to the RA 956, Alabat was founded on Oct. 23, 1903.",
            "Meanwhile, the legal basis of creation is May 15, 1900"
        ],
        [
            "The separation of Silangan (now Quezon) as an independent municipality was declared in 1914.",
            "This municipality was named in honor of President Manuel L Quezon.",
            "In 1929, the inhabitants of Sangirin (now Perez) clamored also for separation from Alabat.",
            "By the end of the same year, Sangirin was granted freedom and became an independent municipality named in honor of then Felimon Perez, who was the Governor of the Province."
        ],
        [
            "Today, Alabat island is composed of 3 towns, Perez in the northern tip, Alabat town proper at the center and Quezon in the south.",
            "The town of Alabat saw new development in the early 21st century: a modern port was built to replace the old one, more paved roads are being constructed, telephone service, cellphone sites, wireless internet and local government projects to improve the lives of Alabateños."
        ],
        [
            "Alabat, Quezon has been featured several times in various television programs in the country such as Tapatan Ni Tunyin, Kapuso Mo, Jessica Soho, Motorcycle Diaries and more, because of its natural beauty.",
            "In an article published in Inquirer, written by Lester Villegas Alabat, Quezon was dubbed as the \"Hidden Paradise of Quezon Province\"."
        ],
        [
            "Geography"
        ],
        [
            "Located centrally on the eponymous Alabat Island, It is between the Pacific Ocean and Lamon Bay, with good fishing grounds, fertile soil, wide plains and near to a river and safe landing shore."
        ],
        [
            "Barangays"
        ],
        [
            "Alabat is politically subdivided into 19 barangays, 5 of which are urban and 14 rural.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Angeles"
        ],
        [
            "Bacong"
        ],
        [
            "Balungay"
        ],
        [
            "Buenavista"
        ],
        [
            "Caglate"
        ],
        [
            "Camagong"
        ],
        [
            "Gordon"
        ],
        [
            "Pambilan Norte"
        ],
        [
            "Pambilan Sur"
        ],
        [
            "Barangay 1 (Poblacion)"
        ],
        [
            "Barangay 2 (Poblacion)"
        ],
        [
            "Barangay 3 (Poblacion)"
        ],
        [
            "Barangay 4 (Poblacion)"
        ],
        [
            "Barangay 5 (Poblacion)"
        ],
        [
            "Villa Esperanza"
        ],
        [
            "Villa Jesus Este"
        ],
        [
            "Villa Jesus Weste"
        ],
        [
            "Villa Norte"
        ],
        [
            "Villa Victoria"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Alabat, Philippines (1991–2020, extremes 1962–2020)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "34.4(93.9)"
        ],
        [
            "33.4(92.1)"
        ],
        [
            "35.6(96.1)"
        ],
        [
            "36.4(97.5)"
        ],
        [
            "37.8(100.0)"
        ],
        [
            "37.0(98.6)"
        ],
        [
            "36.1(97.0)"
        ],
        [
            "37.2(99.0)"
        ],
        [
            "36.2(97.2)"
        ],
        [
            "35.1(95.2)"
        ],
        [
            "35.0(95.0)"
        ],
        [
            "34.0(93.2)"
        ],
        [
            "37.8(100.0)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28.4(83.1)"
        ],
        [
            "28.8(83.8)"
        ],
        [
            "30.0(86.0)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "32.7(90.9)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "32.0(89.6)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "30.7(87.3)"
        ],
        [
            "29.9(85.8)"
        ],
        [
            "28.7(83.7)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "25.3(77.5)"
        ],
        [
            "25.5(77.9)"
        ],
        [
            "26.4(79.5)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "27.8(82.0)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "25.8(78.4)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.2(72.0)"
        ],
        [
            "22.2(72.0)"
        ],
        [
            "22.8(73.0)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "22.8(73.0)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "17.1(62.8)"
        ],
        [
            "17.0(62.6)"
        ],
        [
            "17.8(64.0)"
        ],
        [
            "18.9(66.0)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "21.0(69.8)"
        ],
        [
            "19.0(66.2)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "20.7(69.3)"
        ],
        [
            "19.8(67.6)"
        ],
        [
            "18.0(64.4)"
        ],
        [
            "18.0(64.4)"
        ],
        [
            "17.0(62.6)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "249.0(9.80)"
        ],
        [
            "192.7(7.59)"
        ],
        [
            "146.9(5.78)"
        ],
        [
            "84.3(3.32)"
        ],
        [
            "128.2(5.05)"
        ],
        [
            "175.4(6.91)"
        ],
        [
            "229.5(9.04)"
        ],
        [
            "144.4(5.69)"
        ],
        [
            "266.9(10.51)"
        ],
        [
            "456.5(17.97)"
        ],
        [
            "567.0(22.32)"
        ],
        [
            "722.1(28.43)"
        ],
        [
            "3,362.9(132.40)"
        ],
        [
            "Average rainy days (≥ 1.0 mm)"
        ],
        [
            "18"
        ],
        [
            "13"
        ],
        [
            "9"
        ],
        [
            "6"
        ],
        [
            "9"
        ],
        [
            "11"
        ],
        [
            "15"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "21"
        ],
        [
            "23"
        ],
        [
            "23"
        ],
        [
            "175"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "84"
        ],
        [
            "82"
        ],
        [
            "81"
        ],
        [
            "82"
        ],
        [
            "83"
        ],
        [
            "82"
        ],
        [
            "84"
        ],
        [
            "84"
        ],
        [
            "85"
        ],
        [
            "86"
        ],
        [
            "84"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Alabat experiences tropical rainforest climate (Af) as rainfall in all months exceeds 60 mm (2 in)."
        ],
        [
            "History"
        ],
        [
            "The first inhabitants of the town were the indigenous Inagta Alabat people who are Negritos, the earliest settlers in the Philippines.",
            "The indigenous people spoke the Inagta Alabat language, one of the most endangered languages in the world."
        ],
        [
            "During the Spanish colonial period, Alabat was inhabited by the family of Caparros because of its safe landing shore and overflowing natural resources.",
            "Other immigrants from Gumaca came pouring in upon hearing the suitability of this place from human habitation.",
            "They named the place \"CAMAGONG\".",
            "Perhaps this name was taken from trees which bore edible fruits called Camagong or Mabulo which grow abundantly in Camagong Mountain, the highest mountain in Alabat Island."
        ],
        [
            "It was said that Rev.",
            "Father Jesus, in charge of the parish of Gumaca possessed a telescope.",
            "Almost every time he looked through his telescope to see whether Moro Vintas were coming.",
            "He reached out a focus on the sandy shore of Ilangin, the present sitio of the barrio of Gordon.",
            "It came to his mind that an Ermita should be built in that place.",
            "So he summoned the leaders of the settlers to congregate and encouraged them to settle at Ilangin in order to make a vesita and build on Ermita."
        ],
        [
            "The growth was so abrupt that a village sprang.",
            "Father Jesus called this village \"GORDO\" (meaning fat) and afterwards he named it Gordon in memory of his town in Spain."
        ],
        [
            "Then came Don Pedro Pica and his brother Don Nicolas, who wanted to establish a home in Gorden.",
            "Upon reaching the place they found out that anchorage was difficult on account of the shallow coral reefs and absence of navigable river.",
            "Inquiries were made among the villagers and Don Pedro learned the suitability of Lupac, the present site of Alabat.",
            "He ordered Francisco Mercado, Modesto Arcaya, Casimero Caparros, Luciano Caparros, Cayetano Caparros, Pedro Caparros, Juan Caparros, Venancio Mascariña, Valentin Lisardo, Camilo Febrer, Antonio Montañez, Mariano Silva, Eusebio Baranta, Cayetano Olivares, Jose Canata and many others to clean a site in Lupac for a new village."
        ],
        [
            "When Rev.",
            "Father Jesus heard about this act of Don Pedro Pica, he was neatly infuriated.",
            "He accused these two men and by the order of Capitang Totoy of Gumaca, they were taken to prison until Don Pedro Pica secured freedom from the gobernadorcillos of Tayabas.",
            "The Gobernadorcillo also pardoned his brother Don Nicolas Pica the following year.",
            "The interest of these two brothers in Lupac did not fade away so they returned to the place and established a lumber industry.",
            "The Gobernadorcillo learned of their success in their industry and their able leadership to settlers of the place so Don Pedro, the elder, gained influence from the Gobernadorcillo and was appointed sub-Captain of Lupac under Capitan Totoy of Gumaca.",
            "Through the order of Father Jesus, Don Pedro Pica changed the name Lupac to BARCELONA in memory of the beautiful coastal town in Spain."
        ],
        [
            "When the American Expeditionary forces occupied Tayabas Province and appointed Carpenter as Military Governor, the name BARCELONA was changed to ALABAT."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of AlabatYearPop.±% p.a.1903 4,516—    1918 4,567+0.07%1939 4,306−0.28%1948 5,607+2.98%1960 8,529+3.56%1970 9,830+1.43%1975 10,939+2.17%1980 11,385+0.80%1990 11,785+0.35%1995 13,787+2.98%2000 14,204+0.64%2007 14,789+0.56%2010 16,120+3.19%2015 15,630−0.59%2020 15,936+0.38%Source: Philippine Statistics Authority"
        ],
        [
            "Alabat Island Agta Language"
        ],
        [
            "In 2010, UNESCO released its 3rd world volume of Endangered Languages in the World, where 3 critically endangered languages were in the Philippines.",
            "One of these languages in the Alabat Island Agta language which has an estimated speaker of 30 people in the year 2000.",
            "The language was classified as Critically Endangered, meaning the youngest speakers are grandparents and older, and they speak the language partially and infrequently and hardly pass the language to their children and grandchildren anymore.",
            "If the remaining 30 people do not pass their native language to the next generation of Alabat Agta people, their indigenous language will be extinct within a period of 1 to 2 decades."
        ],
        [
            "The Alabat Agta people live only on the island of Alabat in Quezon province.",
            "They are one of the original Negrito settlers in the entire Philippines.",
            "They belong to the Aeta people classification, but have distinct language and belief systems unique to their own culture and heritage."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Alabat"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  30.00"
        ],
        [
            "2009  17.03"
        ],
        [
            "2012  13.41"
        ],
        [
            "2015  7.63"
        ],
        [
            "2018  15.45"
        ],
        [
            "2021  15.59"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Economic activities in Alabat are heavily concentrated in the poblacion and other sub-urban barangays.",
            "Improved road network provides access from all towns in the island of Alabat to this partially urbanized town.",
            "Well-paved radial routes criss-crossing in and out of the town facilitate the transport of unlimited assortment of merchandise, supplies, and raw materials to and from the town on a round-the-clock basis.",
            "The major crops of the town are rice, coconut and calamansi."
        ],
        [
            "Port of Alabat"
        ],
        [
            "Alabat is considered one of the most important commercial and trading point in the island and in the whole Lamon Bay Area.",
            "This town are nested among a wide expanse of coconut trees, rice-land and moderately rolling hills of gross and shrinks for pleasure.",
            "It has a rich fishing ground which supplies fish and other seafoods to neighboring towns."
        ],
        [
            "Port of Alabat is considered one of the longest port in the province."
        ],
        [
            "Agriculture"
        ],
        [
            "Total Number of Fishermen and farmers- 3000 (estimate)"
        ],
        [
            "Area of Irrigated Lands- 150 hectares (unofficial)"
        ],
        [
            "Culture"
        ],
        [
            "Events and festivals"
        ],
        [
            "Santo Niño Festival\t- (3rd Sunday of January)"
        ],
        [
            "Coconut Festival\t- May 15"
        ],
        [
            "Flores De Mayo\t- (Last Sunday of May)"
        ],
        [
            "Feast of Our Lady of Mt.",
            "Carmel (Town Fiesta)\t- July 16"
        ],
        [
            "Government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Elected officials"
        ],
        [
            "Municipal council (2019-2022):"
        ],
        [
            "Mayor:"
        ],
        [
            "Vice Mayor: Raul U. Declaro"
        ],
        [
            "Councilors:"
        ],
        [
            "Jorge Roito N. Hirang Jr."
        ],
        [
            "Khem Wenbert M. Hervera"
        ],
        [
            "Hubert B. Ursolino"
        ],
        [
            "Ireneo R. Layosa Jr."
        ],
        [
            "Lidio S. Española"
        ],
        [
            "Patricio L. Sasis Jr."
        ],
        [
            "Dante M. Surreda"
        ],
        [
            "Florante B. Bantoc"
        ],
        [
            "Perlito L. Sasis - PPLB"
        ],
        [
            "Marriz M. Verzo- PPSK"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Alabat is accessible by land where tricycles are administered by Alabat Tricycle Operators and Drivers Association (ALTODA) and jeepneys travelling in and out of the town; and water transportation via Atimonan-Alabat Route through the Alabat Feeder Port.",
            "Traveling around the town proper is no problem since there are hundreds of tricycles circling the Town Proper."
        ],
        [
            "Communication"
        ],
        [
            "Alabat is served by a landline company like SANTELCOR, while the wireless phones and internet are provided by national communications companies Smart, Globe and Sun Cellular and a postal service is served by PHILPost."
        ],
        [
            "Utilities"
        ],
        [
            "The Alabat Cable TV System operates and covers most of the town while Quezon I Electric Cooperative provides Electricity to Alabat and nearby-towns.",
            "Alabat Municipal Waterworks System provide the waterworks."
        ],
        [
            "Healthcare"
        ],
        [
            "Alabat has a public hospital that is capable of providing most common medical services, as well as in handling medical emergencies.",
            "Alabat Island District Hospital, the institution which are considered to provide the same standard of healthcare and services, differing mainly with the medical and diagnostic facilities at hand."
        ],
        [
            "These are staffed with qualified medical practitioners.",
            "The doctors are graduates of the many top reputable medical schools in the Philippines.",
            "Likewise, the nurses are the products of the many credible nursing schools in the country."
        ],
        [
            "Education"
        ],
        [
            "Alabat has one tertiary school and numerous secondary and primary schools, including public and private."
        ],
        [
            "The tertiary education system in Alabat provides instruction and training in fields of study, both for baccalaureate degrees and vocational courses.",
            "Southern Luzon State University- Alabat Campus - the only university in the island offers degree programs including education, information technology and fisheries."
        ],
        [
            "Aside from tertiary school, the town also has an expanse footprint on the pre-school, primary and secondary levels of education, both in private and public schools.",
            "There are numerous day-care centers found all over the town."
        ],
        [
            "Alabat Island National High School (Formerly Alabat Municipal High School)"
        ],
        [
            "Alabat Central Elementary School"
        ],
        [
            "Angeles-Caglate Elementary School"
        ],
        [
            "Pambilan Elementary School"
        ],
        [
            "R.T. Camacho Elementary School"
        ],
        [
            "C.B.",
            "Encarnado Elementary School"
        ],
        [
            "Mater Carmelli Catholic School (Parochial School)"
        ],
        [
            "The Island Concept Dancers found in 2016, plays an important role on shaping the dance and performing arts scene of the municipality."
        ],
        [
            "Sister cities"
        ],
        [
            "Makati City"
        ],
        [
            "Valenzuela City"
        ],
        [
            "Notable personalities"
        ],
        [
            "Kat Galang - an actress known as \"Tassel Girl\".",
            "She is no stranger to the limelight, having appeared in short films, commercials, TV series and theater plays.",
            "Her first big break is her portrayal on Kadenang Ginto."
        ],
        [
            "Gionna Cabrera - was crowned Binibining Pilipinas - Universe 2005 who competed for the Miss Universe pageant in Thailand during the same year, representing the Philippines.",
            "She was awarded as Ms. Photogenic.",
            "Gionna is daughter of former Alabat Vice Mayor Nida J. Cabrera."
        ],
        [
            "References"
        ],
        [
            "^ https://m.facebook.com/story.php?story_fbid=2088845594727426&id=100008060167173"
        ],
        [
            "^  Municipality of Alabat |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ http://www.alabatisland.com/History.html"
        ],
        [
            "^ \"Isla ng Alabat: Tagong paraiso ng Quezon Bandera | Bandera\".",
            "Bandera.",
            "26 June 2016."
        ],
        [
            "^ a b c"
        ],
        [
            "\"Alabat, Quezon Climatological Normal Values 1991–2020\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on March 8, 2022.",
            "Retrieved May 3, 2022."
        ],
        [
            "^"
        ],
        [
            "\"Alabat, Quezon Climatological Extremes\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on March 7, 2022.",
            "Retrieved May 3, 2022."
        ],
        [
            "^ Peel, M. C.; Finlayson B. L.; McMahon, T. A.",
            "(2007).",
            "\"Updated world map of the Köppen−Geiger climate classification\" (PDF).",
            "Hydrol.",
            "Earth Syst.",
            "Sci.",
            "11 (5): 1633–1644.",
            "Bibcode:2007HESS...11.1633P.",
            "doi:10.5194/hess-11-1633-2007.",
            "ISSN 1027-5606.",
            "Archived (PDF) from the original on 3 February 2012.",
            "Retrieved 22 February 2013."
        ],
        [
            "^ \"Province of Quezon - Cities and Municipalities (ALABAT)\".",
            "Archived from the original on 2012-07-10.",
            "Retrieved 2013-01-04."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Alabat Profile at PhilAtlas.com"
        ],
        [
            "Alabat municipality official page"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Alabat Island Tambayan Page"
        ],
        [
            "Places adjacent to Alabat, Quezon"
        ],
        [
            "Perez"
        ],
        [
            "Lamon Bay"
        ],
        [
            "Alabat"
        ],
        [
            "Atimonan / Lamon Bay"
        ],
        [
            "Quezon"
        ],
        [
            "vte Province of QuezonLucena (capital and largest city)Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Alabat"
        ],
        [
            "Atimonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Calauag"
        ],
        [
            "Candelaria"
        ],
        [
            "Catanauan"
        ],
        [
            "Dolores"
        ],
        [
            "General Luna"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Infanta"
        ],
        [
            "Jomalig"
        ],
        [
            "Lopez"
        ],
        [
            "Lucban"
        ],
        [
            "Macalelon"
        ],
        [
            "Mauban"
        ],
        [
            "Mulanay"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagbilao"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Narciso"
        ],
        [
            "Sariaya"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Tiaong"
        ],
        [
            "Unisan"
        ],
        [
            "Component city"
        ],
        [
            "Tayabas"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Lucena (Administratively independent from the province but grouped under Quezon by the Philippine Statistics Authority.",
            "However, qualified voters of this city are still allowed to participate in the election of provincial officials as part of Quezon’s 2nd Sangguniang Panlalawigan district.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Alabat,_Quezon&oldid=1188076889\""
        ],
        [
            "Category: Municipalities of QuezonHidden categories: Pages using gadget WikiMiniAtlasAccuracy disputes from March 2022All articles with dead external linksArticles with dead external links from October 2018Articles with permanently dead external linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from November 2013All articles needing additional referencesPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textAll articles with unidentified wordsArticles with unidentified words from November 2019Pages using the Kartographer extension"
        ]
    ]
}