{
    "name": "Alicia",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Alicia, Isabela"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°46′43″N 121°41′50″E﻿ / ﻿16.778686°N 121.697181°E﻿ / 16.778686; 121.697181"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesAlicia"
        ],
        [
            "Angadanan ViejoMunicipalityMunicipality of AliciaOur Lady of Atocha Church"
        ],
        [
            "FlagSealMap of Isabela with Alicia highlightedOpenStreetMapAliciaLocation within the PhilippinesCoordinates: 16°46′43″N 121°41′50″E﻿ / ﻿16.778686°N 121.697181°E﻿ / 16.778686; 121.697181CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "3rd districtFoundedSeptember 28, 1949Named forAlicia Syquia QuirinoBarangays34"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJoel Amos P. Alejandro • Vice MayorAndy Bonn B. Velasco • RepresentativeIan Paul L. Dy • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Mila L. PaguilaJason Manuel P. Alejandro Jr.Rom-Mikhail E. GoGayzle S. ReyesJonathan B. ValienteChristian Hezron A. MendozaVicton G. BumatayDandrige Jayson S. Co"
        ],
        [
            " • Electorate47,975 voters (2022)Area • Revenue₱ 292.4 million (2020) • Assets₱ 421.1 million (2020) • Expenditure₱ 292.1 million (2020) • Liabilities₱ 116 million (2020)Service provider • ElectricityIsabela 1 Electric Cooperative (ISELCO 1)Time zoneUTC+8 (PST)ZIP code3306PSGC023101000IDD : area code +63 (0)78Native languagesIlocano Gaddang TagalogWebsitealicia-isabela.gov.ph"
        ],
        [
            "Alicia, officially the Municipality of Alicia (Ilocano: Ili ti Alicia; Tagalog: Bayan ng Alicia; formerly known as Angadanan Viejo), is a 1st class municipality in the province of Isabela, Philippines.",
            "According to the 2020 census, it has a population of 73,874 people."
        ],
        [
            "The municipality is located in an area of predominantly flat and fertile land in the Cagayan Valley that is surrounded by the Caraballo Mountains to the south, the Great Sierra Madre to the east, and the Cordillera Mountain Range to the west.",
            "It is the largest rice producer in the entire Cagayan Valley and has the largest irrigated rice field in the whole Region II of the Philippines."
        ],
        [
            "Alicia, the old town of Angadanan, is known for the Pagay Festival Balitok Ti Alicia and its famous historical landmark, the Our Lady of Atocha Church completed and inaugurated in 1849 which was officially declared by the Philippine Department of Tourism as a national religious tourist destination in the Philippines."
        ],
        [
            "Etymology"
        ],
        [
            "When President Elpidio Quirino signed Executive Order No.",
            "268 on 28 September 1949, Old Angadanan was formally created and renamed Alicia after his late wife, Doña Alicia Syquía Quirino.",
            "Along with three of their children (except Tomás, a soldier, and Victoria, who later became First Lady for her father), Doña Alicia was one of many civilians massacred by Japanese occupiers on 9 February 1945 during the Battle of Manila."
        ],
        [
            "History"
        ],
        [
            "Alicia was the second site of the town of Angadanan, which was initially founded in the mid-18th century as a settlement in present-day Nueva Vizcaya, between the towns of Bagabag and Bayombong.",
            "The town took its name from the nearby Angaranan Creek.",
            "In 1776, the Spaniards decided to move the settlement further north to Alicia's present location along the Ganano river, a tributary of the Cagayan River.",
            "In the 19th century, the Spaniards decided to move Angadanan again six kilometers further east along the Cagayan River to facilitate better transportation links and to secure the town from repeated raids by the Igorots and Gaddangs.",
            "The second site was subsequently known as Angadanan Viejo (Old Angadanan) to distinguish it from its third site called Angadanan Nuevo (New Angadanan), to which the former was a part of until Angadanan Viejo was converted into the separate municipality of Alicia in 1949.",
            "Part of the reason for the separation was that Alicia lay alongside the national highway network, which led to a more flourishing economy than its mother settlement."
        ],
        [
            "Both the second and third Angadanans were part of the Cagayan Valley province.",
            "The entire Cagayan Valley was one large province which the Spaniards called La Provincia del Valle de Cagayan, but divided into two new provinces in 1839 by the Spanish conquistadors.",
            "One retained the old name Cagayan which comprised all towns from Aparri to Tumauini; while a new province of Nueva Vizcaya was created composed of all towns from Ilagan to the Caraballo del Sur."
        ],
        [
            "A Royal Decree was created on 1 May 1856 creating Isabela de Luzon to distinguish it from other Isabelas in the Philippines, to which both Angadanans were added.",
            "It was placed under the jurisdiction of a governor with the capital seat at Ilagan City, where it remains at the present."
        ],
        [
            "Geography"
        ],
        [
            "Alicia has a total land area of 15,410 hectares and 64,339 total population as of 2009.",
            "71% of the total land area is an agricultural land which makes Alicia primarily an agricultural municipality best suited for the intensive production of rice and corn.",
            "Farming is its major livelihood and rice its major product and resource."
        ],
        [
            "Alicia is 50 kilometres (31 mi) from Ilagan and 348 kilometres (216 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Alicia is politically subdivided into 34 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "There are seven barangays that are currently considered urban (highlighted in bold)."
        ],
        [
            "Amistad"
        ],
        [
            "Antonino (Poblacion)"
        ],
        [
            "Apanay"
        ],
        [
            "Aurora"
        ],
        [
            "Bagnos"
        ],
        [
            "Bagong Sikat"
        ],
        [
            "Bantug-Petines"
        ],
        [
            "Bonifacio"
        ],
        [
            "Burgos"
        ],
        [
            "Calaocan (Poblacion)"
        ],
        [
            "Callao"
        ],
        [
            "Dagupan"
        ],
        [
            "Inanama"
        ],
        [
            "Linglingay"
        ],
        [
            "M.H.",
            "del Pilar"
        ],
        [
            "Mabini"
        ],
        [
            "Magsaysay (Poblacion)"
        ],
        [
            "Mataas na Kahoy"
        ],
        [
            "Paddad"
        ],
        [
            "Rizal"
        ],
        [
            "Rizaluna"
        ],
        [
            "Salvacion"
        ],
        [
            "San Antonio (Poblacion)"
        ],
        [
            "San Fernando"
        ],
        [
            "San Francisco"
        ],
        [
            "San Juan"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Victoria"
        ],
        [
            "Zamora"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Alicia, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31.2(1.23)"
        ],
        [
            "23(0.9)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "28.1(1.11)"
        ],
        [
            "113.5(4.47)"
        ],
        [
            "141.4(5.57)"
        ],
        [
            "176.4(6.94)"
        ],
        [
            "236.6(9.31)"
        ],
        [
            "224.9(8.85)"
        ],
        [
            "247.7(9.75)"
        ],
        [
            "222.9(8.78)"
        ],
        [
            "178(7.0)"
        ],
        [
            "1,651.4(65)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "144"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of AliciaYearPop.±% p.a.1960 14,281—    1970 24,220+5.42%1975 28,904+3.61%1980 36,634+4.85%1990 47,674+2.67%1995 52,666+1.88%YearPop.±% p.a.2000 57,178+1.78%2007 61,447+1.00%2010 64,687+1.89%2015 71,504+1.93%2020 73,874+0.64%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Alicia, Isabela, was 73,874 people, with a density of 480 inhabitants per square kilometre or 1,200 inhabitants per square mile."
        ],
        [
            "Language"
        ],
        [
            "The population is a combination of different ethnic group dominated by Ilocano speaking people which make Ilocano the common language used in the municipality.",
            "English, being one of the official languages is used primarily in communication for government publications, local newsprints, road signs, commercial signs and in doing official business transactions.",
            "Tagalog, another official language and is also considered the national language is used as verbal communication channel between residents."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Alicia"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  18.30"
        ],
        [
            "2009  17.17"
        ],
        [
            "2012  15.19"
        ],
        [
            "2015  12.39"
        ],
        [
            "2018  12.61"
        ],
        [
            "2021  14.07"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Alicia, as a suburb of a progressive city, Cauayan, Isabela, is also showing signs of progress.",
            "Various banking institutions like Landbank of the Philippines, Security Bank, etc.",
            "are already present in Alicia."
        ],
        [
            "Tourism"
        ],
        [
            "Our Lady of Atocha Church"
        ],
        [
            "The Our Lady of Atocha Church in Alicia is known for having an old Spanish church architecture.",
            "It is one of the best churches to visit for a pilgrimage in the Philippines during the Holy Week."
        ],
        [
            "The structure of the church was original built by the Spaniards in the 18th century, but not finished.",
            "Passing by Angadanan town on 12 February 1805, Fr.",
            "Manuel Mora, OP wrote that \"Angadanan has a convent of bricks, though not totally finished.",
            "Its church is timber, wood, and bamboo.",
            "The number of inhabitants is 791.\"",
            "The church and convent as seen today in the town of Alicia, beautiful and antique, was built by Fr.",
            "Tomas Calderon, OP and inaugurated in 1849, with Fr.",
            "Francisco Gainza, OP, then vicar of Carig (now Santiago City).",
            "The church was dedicated to the Nuestra Señora de Atocha, more popularly known today as Our Lady of Atocha.",
            "The church is known for its antique Castilian architectural design and can be found along the Maharlika Highway and is accessible by land transport."
        ],
        [
            "The Catholic churches in Alicia, Gamu, and Cauayan, are examples of what is called as the \"Cagayan Style\" of Spanish churches that was inspired by the Tuguegarao church."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipality of Alicia is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "The first municipal mayor of the town was Glicerio Acosta who was appointed to office by the President of the Philippines upon the creation of Alicia as a municipality in 1949.",
            "The mayor and other elective officials are restricted to three consecutive terms, totaling nine years, although a mayor can be elected again after an interruption of one term."
        ],
        [
            "Members of the Alicia Municipal Council (2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative(3rd Legislative District of the Province of Isabela)"
        ],
        [
            "Ian Paul L. Dy"
        ],
        [
            "Chief Executive of the Municipality of Alicia"
        ],
        [
            "Mayor Joel Amos P. Alejandro"
        ],
        [
            "Presiding Officer of the Municipal Council of Alicia"
        ],
        [
            "Vice Mayor Andy Bonn B. Velasco"
        ],
        [
            "Councilors of the Municipality of Alicia"
        ],
        [
            "Miko Go"
        ],
        [
            "Mila L. Paguila"
        ],
        [
            "Gayzle Reyes"
        ],
        [
            "Dandrige Jayson Co"
        ],
        [
            "Christian Hezron Mendoza"
        ],
        [
            "Joel Felipe P. Alejandro"
        ],
        [
            "Victon G. Bumatay"
        ],
        [
            "Maxell Mapili"
        ],
        [
            "Congress representation"
        ],
        [
            "Alicia, belonging to the third legislative district of the province of Isabela, currently represented by Hon.",
            "Ian Paul L. Dy."
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Alicia has two universities that cater to the people of the municipality and other neighboring municipalities and provinces.",
            "Alicia is also noted for having the most high-tech school in the region."
        ],
        [
            "College and University"
        ],
        [
            "Northeast Luzon Adventist College"
        ],
        [
            "Philippine Normal University- Northern Luzon Campus"
        ],
        [
            "High schools"
        ],
        [
            "Private:"
        ],
        [
            "Odizee School of Achievers"
        ],
        [
            "School of Our Lady of Atocha"
        ],
        [
            "Dalton Academy"
        ],
        [
            "Northeast Luzon Adventist College"
        ],
        [
            "Taps Alicia Private School"
        ],
        [
            "Xavier's School for Gifted Youngsters"
        ],
        [
            "Public:"
        ],
        [
            "Alicia National High School"
        ],
        [
            "Alicia Vocational School"
        ],
        [
            "Palayan Region High School"
        ],
        [
            "Rizal Region National High School, Alicia, Isabela"
        ],
        [
            "Elementary schools"
        ],
        [
            "Private:"
        ],
        [
            "Adventist School Alicia Campus"
        ],
        [
            "Faith Christian Academy"
        ],
        [
            "Northeast Luzon Adventist College"
        ],
        [
            "Odizee School of Achievers"
        ],
        [
            "School of Our Lady of Atocha"
        ],
        [
            "St. Francis School Foundation"
        ],
        [
            "St. John Adaptive Montessori School"
        ],
        [
            "Top Achievers Private School"
        ],
        [
            "Ay Kun School"
        ],
        [
            "Public:"
        ],
        [
            "Alicia South Central School"
        ],
        [
            "Alicia North Central School"
        ],
        [
            "Alicia West Central School"
        ],
        [
            "Amistad Elementary School"
        ],
        [
            "Apanay Public School"
        ],
        [
            "Aurora Elementary School"
        ],
        [
            "Bagnos Elementary School"
        ],
        [
            "Bagong Sikat Elementary School"
        ],
        [
            "Bantug Petines Elementary School"
        ],
        [
            "Bonifacio Elementary School"
        ],
        [
            "Burgos Elementary School"
        ],
        [
            "Callao Elementary School"
        ],
        [
            "Dagupan Elementary School"
        ],
        [
            "Inanama Elementary School"
        ],
        [
            "Linglingay Elementary School"
        ],
        [
            "Mabini Elementary School"
        ],
        [
            "Mataas na Kahoy Elementary School"
        ],
        [
            "MH del Pilar Elementary School"
        ],
        [
            "Paddad Elementary School"
        ],
        [
            "Rizal Elementary School"
        ],
        [
            "Rizaluna Elementary School"
        ],
        [
            "Salvacion Elementary School"
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "San Fernando Elementary School"
        ],
        [
            "San Francisco Elementary School"
        ],
        [
            "San Juan Elementary School"
        ],
        [
            "San Pablo Elementary School"
        ],
        [
            "San Pedro Elementary School"
        ],
        [
            "Santa Cruz Elementary School"
        ],
        [
            "Santa Maria Elementary School"
        ],
        [
            "Santo Domingo Elementary School"
        ],
        [
            "Santo Tomas Elementary School"
        ],
        [
            "Victoria Elementary School"
        ],
        [
            "Zamora Elementary School"
        ],
        [
            "Wizard Elementary Schhool"
        ],
        [
            "Media"
        ],
        [
            "There is one FM radio station that operates in the municipality which is 107.1 TAPS Radio."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Alicia |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on 25 May 2021.",
            "Retrieved 16 July 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Isabela History\".",
            "Archived from the original on 28 August 2009.",
            "Retrieved 19 January 2008."
        ],
        [
            "^ Salgado, Pedro.",
            "\"Formation of Christian Towns in Diffun (Southern Isabela)\".",
            "Cagayan Valley and Easter Cordillera: 1581-1898, Volume I. Rex Publishing.",
            "pp.",
            "551–557."
        ],
        [
            "^ a b c \"Isabela Travel Information\".",
            "Archived from the original on 3 January 2010.",
            "Retrieved 16 January 2010."
        ],
        [
            "^"
        ],
        [
            "\"Province: Isabela\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Municipality of Alicia - Code:023101000\".",
            "Philippine Standard Geographic Code (PSGC) | Philippine Statistics Authority.",
            "30 June 2021.",
            "Archived from the original on 20 October 2021.",
            "Retrieved 20 October 2021."
        ],
        [
            "^"
        ],
        [
            "\"Alicia, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 31 October 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved 28 December 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ 26 December 2013 \"Security Bank Branches in Northern Luzon\".",
            "Securitybank.com."
        ],
        [
            "^ Martinez-Clemente, Jo (23 April 2011).",
            "\"Relic of Christ's cross a must for Visita Iglesia\".",
            "Inquirer.net Philippine Daily Inquirer.",
            "Archived from the original on 14 November 2012.",
            "Retrieved 17 June 2011."
        ],
        [
            "^ Reyes-Estrope, Carmela (26 March 2013).",
            "\"Churches to visit north of Manila\".",
            "Philippine Daily Inquirer.",
            "Retrieved 18 April 2014."
        ],
        [
            "^ Rumpon, Danijay.",
            "\"Province of Isabela Tourists Attractions and Destinations\".",
            "Cagayan Valley Region.",
            "dotregion2.com.ph.",
            "Archived from the original on 16 December 2011.",
            "Retrieved 17 June 2011."
        ],
        [
            "^ \"Tourists Attractions\".",
            "MyPhilippines.com The Ultimate Travel Guide for Tourists.",
            "Department of Tourism (Philippines).",
            "Retrieved 17 June 2011."
        ],
        [
            "^ \"Alicia, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved 13 May 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved 15 May 2022."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved 13 March 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02.",
            "Archived from the original on 12 April 2022.",
            "Retrieved 12 March 2022."
        ],
        [
            "^ \"Cagayan Valley Region, Philippines Radio Stations\".",
            "Radio Station World.",
            "Retrieved 2 April 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Alicia, Isabela."
        ],
        [
            "Local Government of Alicia Isabela"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Alicia at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Alicia, Isabela"
        ],
        [
            "San Mateo"
        ],
        [
            "Cauayan"
        ],
        [
            "Ramon"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "San Isidro"
        ],
        [
            "Echague"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Alicia,_Isabela&oldid=1217913034\""
        ],
        [
            "Categories: Municipalities of Isabela (province)Populated places on the Rio Grande de CagayanPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse dmy dates from February 2021Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}