{
    "name": "Amai Manabilang",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Amai Manabilang"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°47′07″N 124°40′56″E﻿ / ﻿7.785219°N 124.682339°E﻿ / 7.785219; 124.682339"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Lanao del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Amai Manabilang\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bangsamoro Autonomous Region in Muslim Mindanao, PhilippinesAmai Manabilang"
        ],
        [
            "أماي مانابيلانجMunicipality"
        ],
        [
            "FlagSealMap of Lanao del Sur with Amai Manabilang highlightedOpenStreetMapAmai ManabilangLocation within the PhilippinesCoordinates: 7°47′07″N 124°40′56″E﻿ / ﻿7.785219°N 124.682339°E﻿ / 7.785219; 124.682339CountryPhilippinesRegionBangsamoro Autonomous Region in Muslim MindanaoProvinceLanao del SurDistrict"
        ],
        [
            "1st districtBarangays17"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorSaidamen Leo E. Manabilang • Vice MayorJamal E. Manabilang • RepresentativeZiaur-Rahman A. Adiong • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Hedjarah Lydia E. ManabilangNoel C. BaldonasaJaime S. MabitazanNabilah T. DimaocorSowaib P. PadoMaimay P. AminoJasmine S. MacabantogAbel B. Pacasum"
        ],
        [
            " • Electorate5,975 voters (2022)Area • Revenue₱ 156.9 million (2020) • Assets₱ 122.8 million (2020) • Expenditure₱ 172.6 million (2020) • Liabilities₱ 61.41 million (2020)Service provider • ElectricityFirst Bukidnon Electric Cooperative (FIBECO)Time zoneUTC+8 (PST)ZIP code9320PSGC153637000IDD : area code +63 (0)63Native languagesMaranao TagalogWebsitewww.bumbaran-lds.gov.ph"
        ],
        [
            "Amai Manabilang, officially the Municipality of Amai Manabilang (Maranao: Inged a Amai Manabilang; Tagalog: Bayan ng Amai Manabilang), is a 3rd class municipality in the province of Lanao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 12,124 people."
        ],
        [
            "The municipality, formerly Bumbaran, was changed to Amai Manabilang under Muslim Mindanao Act No.",
            "316 on January 22, 2015."
        ],
        [
            "Etymology"
        ],
        [
            "Bumbaran is named after the legendary city of Magalinday Bembaran in the Darangen, a Meranau (Maranao) epic.",
            "The scenic beauty of the town resembles the beauty of Magalinday Bembaran."
        ],
        [
            "After the political efforts of Mayor James Manabilang, Bumbaran was renamed into Amai Manabilang, in honor of his own personal ancestor."
        ],
        [
            "History"
        ],
        [
            "Bumbaran was commonly known before as “Aparport” its seat of government.",
            "Its existence came into being when President Ferdinand E. Marcos signed into law on November 17, 1977, Presidential Decree No.",
            "1243 creating Aparport a separate and independent municipality and naming it the Municipality of Bumbaran, separate from the Municipality of Wao, its mother municipality.",
            "This was necessary in order to maximize the enforcement of law and order and expedite optimum and sustainable development."
        ],
        [
            "At that time, the municipality consisted of 21 barangays namely: Sumogot, Francfort, Lambanogan, Punud, Comara, Aparport, Paglamatan, Natangcopan, Mansilano, Salam, Bandara-Ingud, Ranao-Ibaning, Bagumbayan, Pagonayan, Piagma, Lico, Siuan, Lama, Borntacan, Miorod, and Someorang."
        ],
        [
            "History of Barangay Francfort"
        ],
        [
            "The Municipality of Amai Manabilang is composed of two major groups – 99% Muslim Bangsamoro and 1% Catholic.",
            "Catholics inhabited barangays Sumogot and Francfort.",
            "The Muslim Bangsamoros occupied the rest of the 17 barangays.",
            "Due to the aftereffect of the Settler Program, in spite of Meranau protestations dividing their once united province, on the excuse of geographical and cultural reasons, the Sangguniang Bayan, thru Resolution designated Barangay Francfort as Poblacion (Center) for Catholic populace and Barangay Natangcopan as poblacion for the Muslim Bangsamoros.",
            "Barangay Natangcopan is an extension of Barangay Aparport, the original seat of government."
        ],
        [
            "Barangay Francfort, together with barangays Sumogot, Aparport and Mansilano were regular barangays of Wao before Bumbaran was created a municipality."
        ],
        [
            "Francfort is named after Mr. Franco and Mr. Fortich, the organizers of the National Reconstruction and Rehabilitation Administrator (NARRA) Settlements Project in the Municipality of Wao.",
            "It was created as a regular barangay of Wao in 1965.",
            "The first settlers of these barangays were the Ilocanos and Ivatans, followed from 1967 by the Ilongos, Visaya, Kapampangan and other smaller Catholic converted ethnic groups.",
            "As anticipated through the Settlements pushing the indigenous away from their land and opportunities, peace and order in the area was interrupted by the Catholic militia ILAGA and the response of the Moro Blackshirts from 1972 to 1976 which caused the evacuation of some residents and damage to properties including the burning of houses."
        ],
        [
            "By November 17, 1977, the Municipality of Bumbaran was created into a separate municipality by virtue of Presidential Decree No.",
            "1234 signed by then President Ferdinand Edralin Marcos, and barangay Francfort was included as one of its regular barangays.",
            "Consequently, in the mid1980s, the people returned little by little."
        ],
        [
            "Before Bumbaran was created as a separate municipality, Hadji Acob was the Barangay Chairman of Barangay Francfort; on his death, Efren Vaso succeeded him.",
            "In the following barangay election, Columbus Kalaw was elected Barangay Chairman until he was defeated by Wilfredo Barcelona.",
            "In 1993, Oscar Baldonasa was elected chairman and he was re-elected in the 1996 and 2002 barangay elections."
        ],
        [
            "Barangay Francfort is bounded on the East by Maridugao/Maridgaw River; West by Barangay Sumogot; On the south Sumogot river; and on the North by Barangay Lambanogan."
        ],
        [
            "Mountain ranges, hills, plateaus, and flatland characterize the topography of the barangay.",
            "It has a vast agricultural land suited for crops like rice, corn, carrots, sugar cane.",
            "Its hydrological features comprise rivers like the Maridugao and Sumogot, streams, swamps, creeks and springs."
        ],
        [
            "Barangay Francfort has a total land area of 1,304 hectares.",
            "The soil is loam and the climate is temperate.",
            "The population is 1,491 according to the 2000 Census, with 298 households."
        ],
        [
            "Geography"
        ],
        [
            "The municipal boundaries are defined as follows: on the east by the municipality of Wao, separated by a straight line 13.65 kilometres (8.48 mi) long, drawn northward from Point 1 to Point 2 on the bank of the Maladugao river 1.5 km.",
            "East Sumogot on the Lanao–Bukidnon boundary as point 3; then by straight line following the Lumba - a Bayabao–Wao boundary line.",
            "Southward of the intersection of the Lana–Cotabato boundary as point 4; then finally 1.72 km.",
            "Eastward following the Lanao–Cotabato boundary to the starting point."
        ],
        [
            "Barangays"
        ],
        [
            "Amai Manabilang is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Bagumbayan"
        ],
        [
            "Bandara-Ingud"
        ],
        [
            "Comara (Potre Maamor)"
        ],
        [
            "Francfort"
        ],
        [
            "Lambanogan"
        ],
        [
            "Lico"
        ],
        [
            "Mansilano"
        ],
        [
            "Natangcopan"
        ],
        [
            "Pagalamatan"
        ],
        [
            "Pagonayan"
        ],
        [
            "Penud"
        ],
        [
            "Piagma"
        ],
        [
            "Poblacion (Apartfort)"
        ],
        [
            "Ranao-Baning"
        ],
        [
            "Salam"
        ],
        [
            "Sigu-an"
        ],
        [
            "SumOGOT"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Amai Manabilang, Lanao de Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(74)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "16(61)"
        ],
        [
            "16(61)"
        ],
        [
            "17(63)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "17(63)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "17(63)"
        ],
        [
            "17(63)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "174(6.9)"
        ],
        [
            "145(5.7)"
        ],
        [
            "159(6.3)"
        ],
        [
            "192(7.6)"
        ],
        [
            "302(11.9)"
        ],
        [
            "343(13.5)"
        ],
        [
            "297(11.7)"
        ],
        [
            "265(10.4)"
        ],
        [
            "244(9.6)"
        ],
        [
            "293(11.5)"
        ],
        [
            "306(12.0)"
        ],
        [
            "188(7.4)"
        ],
        [
            "2,908(114.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.4"
        ],
        [
            "14.4"
        ],
        [
            "17.4"
        ],
        [
            "21.3"
        ],
        [
            "27.6"
        ],
        [
            "28.0"
        ],
        [
            "27.9"
        ],
        [
            "26.9"
        ],
        [
            "25.0"
        ],
        [
            "26.9"
        ],
        [
            "26.0"
        ],
        [
            "21.1"
        ],
        [
            "279.9"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "The town's climate is similar to that of Baguio."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Amai ManabilangYearPop.±% p.a.1980 3,401—    1990 4,341+2.47%1995 6,001+6.26%2000 6,589+2.02%2007 13,297+10.17%2010 8,734−14.18%2015 10,401+3.38%2020 12,124+3.06%Source: Philippine Statistics Authority"
        ],
        [
            "Ethnic groups"
        ],
        [
            "The Municipality of Amai Manabilang is inhabited by settlers of different origins, like Ilonggos, Ivatans, Ilocano, Bisaya and other smaller ethnic groups that dominated barangays Francfort and Sumugot.",
            "This is due to the Settlement Program and Land Tenure Laws of the Republic of the Philippines.",
            "The Moro Maranaws who came from the different municipalities of Lanao del Sur and Lanao del Norte inhabited the rest of the seventeen barangays of this municipality.",
            "Their source of livelihood is farming, mainly crop production.",
            "Having rich soil, the municipality is one of the largest corn producers in the province, only second to its mother municipality of Wao for having vast agricultural land capable of producing variable crops which could give sufficient food and income to the population."
        ],
        [
            "Economy"
        ],
        [
            "Poverty Incidence of Amai Manabilang"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "80"
        ],
        [
            "2000  77.16"
        ],
        [
            "2003  58.90"
        ],
        [
            "2006  34.10"
        ],
        [
            "2009  37.76"
        ],
        [
            "2012  62.68"
        ],
        [
            "2015  53.67"
        ],
        [
            "2018  75.74"
        ],
        [
            "2021  31.97"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Amai Manabilang |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Bangsamoro (BARMM)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Muslim Mindanao Autonomy Act No.",
            "316; An Act Changing the Name of the Municipality of Bumbaran in the Province of Lanao del Sur into Municipality of Amai Manabilang, and for Other Purposes\" (PDF).",
            "Regional Legislative Assembly, Autonomous Region in Muslim Mindanao.",
            "Retrieved January 27, 2016."
        ],
        [
            "^ a b c \"Presidential Decree No.",
            "1243: Creating the Municipality of Amai Manabilang in the Province of Lanao Del Sur\".",
            "Official Gazette of the Republic of the Philippines.",
            "Republic of the Philippines.",
            "November 17, 1977.",
            "Retrieved June 19, 2014."
        ],
        [
            "^ a b \"Land Tenure Stories in Central Mindanao\".",
            "October 23, 2010."
        ],
        [
            "^"
        ],
        [
            "\"Amai Manabilang, Lanao del Sur : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved January 19, 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Lanao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Amai Manabilang Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Amai Manabilang"
        ],
        [
            "Lumba-Bayabao"
        ],
        [
            "Kalilangan, Bukidnon"
        ],
        [
            "Bumbaran"
        ],
        [
            "Alamada, Cotabato"
        ],
        [
            "Wao"
        ],
        [
            "vte Province of Lanao del SurMarawi (capital)Municipalities"
        ],
        [
            "Amai Manabilang"
        ],
        [
            "Bacolod-Kalawi"
        ],
        [
            "Balabagan"
        ],
        [
            "Balindong"
        ],
        [
            "Bayang"
        ],
        [
            "Binidayan"
        ],
        [
            "Buadiposo-Buntong"
        ],
        [
            "Bubong"
        ],
        [
            "Butig"
        ],
        [
            "Calanogas"
        ],
        [
            "Ditsaan-Ramain"
        ],
        [
            "Ganassi"
        ],
        [
            "Kapai"
        ],
        [
            "Kapatagan"
        ],
        [
            "Lumba-Bayabao"
        ],
        [
            "Lumbaca-Unayan"
        ],
        [
            "Lumbatan"
        ],
        [
            "Lumbayanague"
        ],
        [
            "Madalum"
        ],
        [
            "Royal Sultanate of Madamba"
        ],
        [
            "Maguing"
        ],
        [
            "Malabang"
        ],
        [
            "Marantao"
        ],
        [
            "Marogong"
        ],
        [
            "Masiu"
        ],
        [
            "Mulondo"
        ],
        [
            "Pagayawan"
        ],
        [
            "Piagapo"
        ],
        [
            "Picong"
        ],
        [
            "Poona Bayabao"
        ],
        [
            "Pualas"
        ],
        [
            "Saguiaran"
        ],
        [
            "Sultan Dumalondong"
        ],
        [
            "Tagoloan"
        ],
        [
            "Tamparan"
        ],
        [
            "Taraka"
        ],
        [
            "Tubaran"
        ],
        [
            "Tugaya"
        ],
        [
            "Wao"
        ],
        [
            "Component city"
        ],
        [
            "Marawi"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Amai_Manabilang&oldid=1232985515\""
        ],
        [
            "Categories: Municipalities of Lanao del SurEstablishments by Philippine presidential decreeHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from March 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from March 2023Articles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from June 2017Pages using the Kartographer extension"
        ]
    ]
}