{
    "name": "Anda",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Anda, Bohol"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTürkçeاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°44′38″N 124°34′34″E﻿ / ﻿9.744°N 124.576°E﻿ / 9.744; 124.576"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bohol, Philippines"
        ],
        [
            "Municipality in Central Visayas, PhilippinesAndaMunicipalityMunicipality of AndaPoblacion of Anda"
        ],
        [
            "FlagSealMap of Bohol with Anda highlightedOpenStreetMapAndaLocation within the PhilippinesCoordinates: 9°44′38″N 124°34′34″E﻿ / ﻿9.744°N 124.576°E﻿ / 9.744; 124.576CountryPhilippinesRegionCentral VisayasProvinceBoholDistrict"
        ],
        [
            "3rd districtFoundedMarch 12, 1875Named forSimón de Anda y SalazarBarangays16"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAngelina B. Simacio • Vice MayorNilo J. Bersabal • RepresentativeKristine Alexie B. Tutor • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Mario G. AlonsoAbsalon T. DeloyMa.",
            "Aura A. LoquiasJohn Luis DeligeroAdobaling TinioDolor AmoraRey AmperJhing Reoja"
        ],
        [
            " • Electorate13,817 voters (2022)Area • Revenue₱ 96.77 million (2020) • Assets₱ 186.6 million (2020) • Expenditure₱ 98.79 million (2020) • Liabilities₱ 64.82 million (2020)Service provider • ElectricityBohol 2 Electric Cooperative (BOHECO 2)Time zoneUTC+8 (PST)ZIP code6311PSGC0701203000IDD : area code +63 (0)38Native languagesBoholano dialect Cebuano TagalogWebsitewww.andabohol.gov.ph"
        ],
        [
            "Anda, officially the Municipality of Anda (Cebuano: Munisipyo sa Anda; Tagalog: Bayan ng Anda),  is a 3rd class municipality in the province of Bohol, Philippines.",
            "According to the 2020 census, it has a population of 17,778 people."
        ],
        [
            "In 2006, the Anda red hermatite print petroglyphs of Bohol were included in the tentative list of the Philippines for UNESCO World Heritage Site under the name of Petroglyphs and Petrographs of the Philippines, which also includes the Singnapan charcoal-drawn petrographs of southern Palawan, Angono Petroglyphs of Rizal province, Alab petroglyphs of Mountain province, and charcoal-drawn Penablanca petrographs of Cagayan."
        ],
        [
            "Anda is 98 kilometres (61 mi) from Tagbilaran."
        ],
        [
            "Etymology"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(September 2012) (Learn how and when to remove this message)"
        ],
        [
            "The decree in 1875 on the separation of Quinale from Guindulman did not explain why the name \"Anda\" was chosen.",
            "It was presumed that the name referred to Governor General Simón de Anda y Salazar who was Governor General of the Philippines from 1769 to 1770.",
            "Simon de Anda was a member of the Royal Audiencia in the Philippines who did not surrender to the British in 1762.",
            "But considering a century gap between de Anda and the time of the town's creation and also taking into account the poor literacy of the populace at that time, the naming of the town after him may not be the case.",
            "A more acceptable reason from oral history, is that \"Anda\" is a reference to the land that moves forward, as in Spanish \"el lugar anda\" – the land walks or moves.",
            "This was a rough attempt to translate \"Quinale\" into Spanish.",
            "The word \"quinale\" or \"gui kale\", is a colloquial local term for a pile of sand dunes caused by the waves enhancing a new land mass.",
            "Hence, Anda, which means \"it walks.\""
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Anda, Bohol\" – news · newspapers · books · scholar · JSTOR (October 2023) (Learn how and when to remove this message)"
        ],
        [
            "Prehistory"
        ],
        [
            "The first inhabitants of the area were migrant Negritos, who were eventually replaced by Austronesians.",
            "The new migrants established the red hematite petrographs in the Anda peninsula and would become a sacred site for ethnic communities."
        ],
        [
            "The region of Southeastern Bohol and Anda Peninsula are known as the \"cradle of civilization of Bohol\" from archaeological findings of pre-colonial, ancient bodies from burial sites which were housed in boat-shaped wooden-coffins.",
            "Today, local healers and shaman still practice pagdiwata rituals, or offerings to the spirits for good fortune, located in Lamanok Point in Anda."
        ],
        [
            "Unfortunately, theft and extraction of sacred burial sites of human remains by U.S. universities occurred during the American colonial area, particularly from the University of Michigan and Bucknell University."
        ],
        [
            "Ternatean Invasion of Bohol"
        ],
        [
            "During the first half of the 16th century, the Sultanate of Ternate ransacked the area, along with the communities of western Bohol, specifically, the Dapitan Kingdom.",
            "When the Spanish arrived during the later half of the 16th century, the Anda communities were easily subjugated as they have already been ravaged by the Ternate people."
        ],
        [
            "Spanish Colonial Period"
        ],
        [
            "The municipality of Anda was formerly known as Quinale and was a barrio of the municipality of Guindulman from the early part of its civilization up to the later decades of the 19th century.",
            "At the onset, Quinale was basically uninhabited with plenty of uncultivated lands and its shores were swampy with many mangroves and hardwood trees."
        ],
        [
            "Through the years the population of Quinale grew and the people sought independence from Guindulman.",
            "On 8 July 1856 they petitioned for independence and the petition was endorsed by the Assessor General of the government to the Governor General of the Philippines on 3 September 1856.",
            "Yet their petition was denied for the reason that they could not meet the required number of 500 tributes or taxpayers."
        ],
        [
            "Quinale petitioned for the second time to become an independent town on 30 December 1872.",
            "The petition was addressed to the Provincial Governor of Bohol and was eventually endorsed by him to the \"Consejo de Administracion de Filipinas (Council for Administration of the Philippines), the Provincial Father of the Recollects and the Archbishop of Manila\"."
        ],
        [
            "The town progressed at the time.",
            "Public buildings and the church were improved, and roads were created leading to Guindulman.",
            "However, in spite of these developments, the petition was again denied on the grounds that their total taxpayers only reached 400 people."
        ],
        [
            "Still persistent, the people of Quinale again filed their petition on 27 March 1874 which was subsequently declined due to the same reason.",
            "A few months later, on 23 September 1874, the people again made another petition but now used a different approach and reasoning."
        ],
        [
            "They were repeatedly denied for the same reason, yet it was indicated that births in the town of Quinale far exceeded the number of deaths, but the people migrated to other places because of lack of supervision and opportunities.",
            "To answer this need, the officials wanted their barrio to be made into a town to have proper supervision and leadership.",
            "With these, the people would not leave, and the number of taxpayers would've reach 500."
        ],
        [
            "Provincial politico-military governor Don Joaquin Bengoechea (June 1872 – 1878), was amenable to their line of reasoning and suggested that the people make a petition for separation of Quinale in only in the civil aspect as becoming a separate parish required 500 taxpayers.",
            "Hence, on 23 September 1874, they only petitioned for becoming a town in the civil aspect."
        ],
        [
            "More than six months passed before the Consejo de Administration finally recommended that Quinale be separated in its civil aspect only.",
            "Delay was due to the religious authorities' reluctance to approve it."
        ],
        [
            "Finally on 12 March 1875, the governor general Don Jose de Malcampo y Monje issued the decree creating the new town of Anda and its being separated from the town of Guindulman in civil aspect only, consonant with the desire of the religious authorities.",
            "Confirmed by the archbishop of Manila, the order of the separation was published on 1 April 1875."
        ],
        [
            "With this approval, the local officials of the new town of Anda and the mother town of Guindulman gathered to discuss and determine the boundaries of the two towns on 3 May 1875.",
            "With the decree, the people were still given the opportunity to till their lands wherever they may be located, in Anda or Guindulman."
        ],
        [
            "An image of a beach in Anda, Bohol."
        ],
        [
            "As the new town was established with its defined boundaries, a practical concern of the local officials arose as they had no knowledge of running the local government.",
            "Hence, they requested an educated person from the mother town of Guindulman to assist the local officials run the local government.",
            "That person was Pablo Juliano Castro, an illegitimate son of a Spanish priest in Guindulman who had a privileged education in Manila.",
            "He was given a prime lot in the center of the town, near the proposed Municipal Hall and the proposed school building.",
            "Pablo Castro not only acted as advisor of the local administration but also acted as the first Justice of Peace and Anda's first schoolteacher.",
            "He served sometime later also as the town's \"Capitan Municipal\" or town's chief executive at the turn of the century."
        ],
        [
            "Subsequent years saw Anda's growth in terms of population.",
            "People no longer migrated and eventually the number of taxpayers increased until they were able to qualify to be a separate town in the religious aspect.",
            "On 18 July 1885, Anda became an independent parish from Guindulman and become a Diocesan parish on 19 March 1885, dedicated to the Santo Niño or the Holy Child.",
            "Royal approval was given on 6 January 1885 and finally implemented on 18 July 1885 with Fr.",
            "Julian Cisnero as the first parish priest."
        ],
        [
            "The line of Spanish priests serving the Parish of Anda was not broken from 1885 up to 1937, even after the end of the Spanish regime and through the American era.",
            "At the end of the Spanish regime, many Spanish priests fled but not Fr.",
            "Hilario Lopez.",
            "Even after the American era, priests from the Order of the Augustinian Recollects continued to serve the people until 1937.",
            "The last Spanish priest was Fr.",
            "Luis Llorente."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Former flag of Anda, used until 2024."
        ],
        [
            "Anda is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 071203001   Almaria"
        ],
        [
            " 2.1%"
        ],
        [
            " 370"
        ],
        [
            " 392"
        ],
        [
            "  ▾"
        ],
        [
            " −0.58%"
        ],
        [
            " 071203002   Bacong"
        ],
        [
            " 13.1%"
        ],
        [
            " 2,323"
        ],
        [
            " 2,289"
        ],
        [
            "  ▴"
        ],
        [
            " 0.15%"
        ],
        [
            " 071203003   Badiang"
        ],
        [
            " 7.2%"
        ],
        [
            " 1,281"
        ],
        [
            " 1,277"
        ],
        [
            "  ▴"
        ],
        [
            " 0.03%"
        ],
        [
            " 071203004   Buenasuerte"
        ],
        [
            " 1.8%"
        ],
        [
            " 321"
        ],
        [
            " 398"
        ],
        [
            "  ▾"
        ],
        [
            " −2.13%"
        ],
        [
            " 071203005   Candabong"
        ],
        [
            " 12.3%"
        ],
        [
            " 2,193"
        ],
        [
            " 2,297"
        ],
        [
            "  ▾"
        ],
        [
            " −0.46%"
        ],
        [
            " 071203006   Casica"
        ],
        [
            " 2.6%"
        ],
        [
            " 464"
        ],
        [
            " 406"
        ],
        [
            "  ▴"
        ],
        [
            " 1.34%"
        ],
        [
            " 071203007   Katipunan"
        ],
        [
            " 2.6%"
        ],
        [
            " 467"
        ],
        [
            " 503"
        ],
        [
            "  ▾"
        ],
        [
            " −0.74%"
        ],
        [
            " 071203008   Linawan"
        ],
        [
            " 5.2%"
        ],
        [
            " 918"
        ],
        [
            " 987"
        ],
        [
            "  ▾"
        ],
        [
            " −0.72%"
        ],
        [
            " 071203009   Lundag"
        ],
        [
            " 5.5%"
        ],
        [
            " 980"
        ],
        [
            " 1,029"
        ],
        [
            "  ▾"
        ],
        [
            " −0.49%"
        ],
        [
            " 071203010   Poblacion"
        ],
        [
            " 7.4%"
        ],
        [
            " 1,312"
        ],
        [
            " 1,295"
        ],
        [
            "  ▴"
        ],
        [
            " 0.13%"
        ],
        [
            " 071203011   Santa Cruz"
        ],
        [
            " 6.0%"
        ],
        [
            " 1,073"
        ],
        [
            " 1,123"
        ],
        [
            "  ▾"
        ],
        [
            " −0.45%"
        ],
        [
            " 071203012   Suba"
        ],
        [
            " 6.2%"
        ],
        [
            " 1,103"
        ],
        [
            " 1,125"
        ],
        [
            "  ▾"
        ],
        [
            " −0.20%"
        ],
        [
            " 071203013   Talisay"
        ],
        [
            " 5.3%"
        ],
        [
            " 936"
        ],
        [
            " 1,048"
        ],
        [
            "  ▾"
        ],
        [
            " −1.12%"
        ],
        [
            " 071203014   Tanod"
        ],
        [
            " 2.4%"
        ],
        [
            " 421"
        ],
        [
            " 487"
        ],
        [
            "  ▾"
        ],
        [
            " −1.45%"
        ],
        [
            " 071203015   Tawid"
        ],
        [
            " 4.4%"
        ],
        [
            " 789"
        ],
        [
            " 825"
        ],
        [
            "  ▾"
        ],
        [
            " −0.45%"
        ],
        [
            " 071203016   Virgen"
        ],
        [
            " 8.5%"
        ],
        [
            " 1,512"
        ],
        [
            " 1,428"
        ],
        [
            "  ▴"
        ],
        [
            " 0.57%"
        ],
        [
            "Total"
        ],
        [
            "17,778"
        ],
        [
            "16,909"
        ],
        [
            " ▴"
        ],
        [
            "0.50%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Anda, Bohol"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "102(4.0)"
        ],
        [
            "85(3.3)"
        ],
        [
            "91(3.6)"
        ],
        [
            "75(3.0)"
        ],
        [
            "110(4.3)"
        ],
        [
            "141(5.6)"
        ],
        [
            "121(4.8)"
        ],
        [
            "107(4.2)"
        ],
        [
            "111(4.4)"
        ],
        [
            "144(5.7)"
        ],
        [
            "169(6.7)"
        ],
        [
            "139(5.5)"
        ],
        [
            "1,395(55.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.6"
        ],
        [
            "14.8"
        ],
        [
            "16.5"
        ],
        [
            "16.7"
        ],
        [
            "23.9"
        ],
        [
            "26.4"
        ],
        [
            "25.6"
        ],
        [
            "24.1"
        ],
        [
            "24.4"
        ],
        [
            "26.3"
        ],
        [
            "23.7"
        ],
        [
            "20.5"
        ],
        [
            "261.5"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of AndaYearPop.±% p.a.1903 4,938—    1918 6,712+2.07%1939 9,751+1.79%1948 11,688+2.03%1960 11,730+0.03%1970 12,535+0.67%1975 12,658+0.20%1980 12,625−0.05%YearPop.±% p.a.1990 13,497+0.67%1995 16,108+3.37%2000 17,863+2.24%2007 16,616−0.99%2010 16,909+0.64%2015 16,462−0.51%2020 17,778+1.52%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Anda public market"
        ],
        [
            "Poverty incidence of Anda"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  47.40"
        ],
        [
            "2009  49.62"
        ],
        [
            "2012  30.94"
        ],
        [
            "2015  30.08"
        ],
        [
            "2018  25.40"
        ],
        [
            "2021  26.06"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(September 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipal Hall of Anda"
        ],
        [
            "During the Spanish period the town chief executive was called \"Capitan Municipal\", then some time during the American regime, the title was changed to \"Presidente Municipal\".",
            "It was only during wartime time that the town chief executive was called a \"Municipal Mayor\"."
        ],
        [
            "In the earliest time, the town chief executive was chosen by drawing of lots among prominent persons of the town, those considered to have ample land properties and adequate education.",
            "The sequence or order of tenure of the early town executives could not easily be determined.",
            "It was only during the American regime that regular elections were held every three years, and then later reduced to four years.",
            "For a short period from 1986 to 1988, right after the EDSA Revolution, there were no elections for mayor but only officer-in-charge to act as mayor ad interim."
        ],
        [
            "List of former chief executives"
        ],
        [
            "Capitan Municipal (from 1885 to 1919):"
        ],
        [
            "Silverio Escobido"
        ],
        [
            "Gabriel Escobido"
        ],
        [
            "Perfecto Paguia"
        ],
        [
            "Benedicto Amper"
        ],
        [
            "Pablo Castro"
        ],
        [
            "Esteban Escobido"
        ],
        [
            "Esteban Escobal"
        ],
        [
            "Lucio Felisarta"
        ],
        [
            "Ramon Escobia"
        ],
        [
            "Victor Paguia"
        ],
        [
            "Hipolito Paguia"
        ],
        [
            "Cipriano Bernido"
        ],
        [
            "Eulogio Dagondon"
        ],
        [
            "Valentin Timaan"
        ],
        [
            "Bernabe Amper"
        ],
        [
            "Presidente Municipal (from 1919 to 1934):"
        ],
        [
            "Victor Felicita (1919–1921)"
        ],
        [
            "Diosdado Paguia (1922–1925)"
        ],
        [
            "Victor Felicita (1926–1931)"
        ],
        [
            "Alfonso Castillo (1931–1934)"
        ],
        [
            "Diosdado Paguia (1934–1937)"
        ],
        [
            "Municipal Mayor (from 1938 up to the present):"
        ],
        [
            "Alfonso Castillo (1938–1940)"
        ],
        [
            "Vicente de los Angeles (1941–1945)"
        ],
        [
            "Aquilino Deligero (1945–1955)"
        ],
        [
            "Alfonso Castillo (1956–1959)"
        ],
        [
            "Simeon Escobia (1960–1963)"
        ],
        [
            "Teodulfo Amora (1964–1971)"
        ],
        [
            "Concordia Makinano (1972–1980)"
        ],
        [
            "Teodulfo Amora (1980–1986)"
        ],
        [
            "Gaudioso Amora (Mar 1986–Nov 1987)"
        ],
        [
            "Edilberto Llido (1–14 Dec 1987)"
        ],
        [
            "Aquilino Deligero (15 Dec 1987–6 Feb 1988)"
        ],
        [
            "Paulino Amper (7 Feb 1988–May 1996)"
        ],
        [
            "Angelina Simacio (May 1996–May 2000)"
        ],
        [
            "Paulino Amper (May 2000 – 2010)"
        ],
        [
            "Angelina Simacio (May 2010–May 2013)"
        ],
        [
            "Metodio Amper (May 2013–present)"
        ],
        [
            "^ a b c Mayor ad interim"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Anda |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^  https://www.philatlas.com/visayas/r07/bohol/anda.html.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Petroglyphs and Petrographs of the Philippines\".",
            "whc.unesco.org.",
            "UNESCO World Heritage Centre.",
            "Retrieved 23 March 2018."
        ],
        [
            "^ Centre, UNESCO World Heritage.",
            "\"Petroglyphs and Petrographs of the Philippines\".",
            "UNESCO World Heritage Centre.",
            "Retrieved 2023-10-06."
        ],
        [
            "^ Tenazas, Rosa CP (1973).",
            "\"The Boat-Coffin Burial Complex in the Philippines and ITS Relation to Similar Practices in Southeast Asia\".",
            "Philippine Quarterly of Culture and Society.",
            "1 (1): 19–25.",
            "JSTOR 29791037.",
            "Retrieved 2024-04-01."
        ],
        [
            "^ Ronquillo, Wilfredo P. (1995).",
            "\"Anthropological and Cultural Values of Caves\".",
            "Philippine Quarterly of Culture and Society.",
            "23 (2): 138–150.",
            "JSTOR 29792183.",
            "Retrieved 2024-04-01."
        ],
        [
            "^ \"Repatriating A Skull From the Philippines\".",
            "GALLERY TALK Connecting Museums & Society.",
            "18 October 2021."
        ],
        [
            "^ \"EXPLORING ETHICAL STEWARDSHIP OF HUMAN REMAINS\".",
            "ReConnect/ReCollect.",
            "Retrieved 2024-04-01."
        ],
        [
            "^ \"Significant battles in Bohol: Battle of the Bo-ol Kingdom\".",
            "BOHOLCHRONICLE.COM.PH.",
            "2019-10-20.",
            "Retrieved 2023-10-06."
        ],
        [
            "^ Jonathan B. Catubig (2003).",
            "\"Dapitan Kingdom: A Historical Study on the Bisayan Migration and Settlement in Mindanao, circa 1563\".",
            "The Journal of History.",
            "49 (1–4): 1."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Anda: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Anda."
        ],
        [
            " Media related to Anda, Bohol at Wikimedia Commons"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Bohol.gov.ph: Municipality of Anda"
        ],
        [
            "Dive Sites of Anda"
        ],
        [
            "Places adjacent to Anda, Bohol"
        ],
        [
            "Candijay"
        ],
        [
            "Cogtong Bay (Bohol Sea)"
        ],
        [
            "Guindulman"
        ],
        [
            "Anda"
        ],
        [
            "Bohol Sea"
        ],
        [
            "Bohol Sea"
        ],
        [
            "vte Province of BoholTagbilaran (capital and largest city)Municipalities"
        ],
        [
            "Alburquerque"
        ],
        [
            "Alicia"
        ],
        [
            "Anda"
        ],
        [
            "Antequera"
        ],
        [
            "Baclayon"
        ],
        [
            "Balilihan"
        ],
        [
            "Batuan"
        ],
        [
            "Bien Unido"
        ],
        [
            "Bilar"
        ],
        [
            "Buenavista"
        ],
        [
            "Calape"
        ],
        [
            "Candijay"
        ],
        [
            "Carmen"
        ],
        [
            "Catigbian"
        ],
        [
            "Clarin"
        ],
        [
            "Corella"
        ],
        [
            "Cortes"
        ],
        [
            "Dagohoy"
        ],
        [
            "Danao"
        ],
        [
            "Dauis"
        ],
        [
            "Dimiao"
        ],
        [
            "Duero"
        ],
        [
            "Garcia Hernandez"
        ],
        [
            "Getafe"
        ],
        [
            "Guindulman"
        ],
        [
            "Inabanga"
        ],
        [
            "Jagna"
        ],
        [
            "Lila"
        ],
        [
            "Loay"
        ],
        [
            "Loboc"
        ],
        [
            "Loon"
        ],
        [
            "Mabini"
        ],
        [
            "Maribojoc"
        ],
        [
            "Panglao"
        ],
        [
            "Pilar"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Sagbayan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Sevilla"
        ],
        [
            "Sierra Bullones"
        ],
        [
            "Sikatuna"
        ],
        [
            "Talibon"
        ],
        [
            "Trinidad"
        ],
        [
            "Tubigon"
        ],
        [
            "Ubay"
        ],
        [
            "Valencia"
        ],
        [
            "Component city"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Islands"
        ],
        [
            "Balicasag"
        ],
        [
            "Banacon"
        ],
        [
            "Bansaan"
        ],
        [
            "Bilangbilangan"
        ],
        [
            "Bohol"
        ],
        [
            "Cabilao"
        ],
        [
            "Cabulan"
        ],
        [
            "Hingotanan"
        ],
        [
            "Jandayan"
        ],
        [
            "Jao"
        ],
        [
            "Juagdan"
        ],
        [
            "Lapinig"
        ],
        [
            "Mahanay"
        ],
        [
            "Malingin"
        ],
        [
            "Mantatao"
        ],
        [
            "Maomawan"
        ],
        [
            "Pamilacan"
        ],
        [
            "Pangangan"
        ],
        [
            "Panglao"
        ],
        [
            "Sagasa"
        ],
        [
            "Sandingan"
        ],
        [
            "Tintinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Anda,_Bohol&oldid=1217994464\""
        ],
        [
            "Categories: Municipalities of BoholBeaches of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: missing titleCS1 errors: bare URLCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textArticles needing additional references from September 2012All articles needing additional referencesArticles needing additional references from October 2023Commons category link from WikidataAll articles with dead external linksArticles with dead external links from August 2023Articles with permanently dead external linksPages using the Kartographer extension"
        ]
    ]
}