{
    "name": "Angono",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Angono"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°31′24″N 121°09′13″E﻿ / ﻿14.523375°N 121.153625°E﻿ / 14.523375; 121.153625"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Rizal, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Angono\" – news · newspapers · books · scholar · JSTOR (September 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesAngonoMunicipalityMunicipality of AngonoAngono Municipal Hall"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "Art Capital of the Philippines"
        ],
        [
            "Home of the Higantes Festival"
        ],
        [
            "Motto(s): Angono: An Artist's Paradise, A Tourist's HavenMap of Rizal with Angono highlightedOpenStreetMapAngonoLocation within the PhilippinesCoordinates: 14°31′24″N 121°09′13″E﻿ / ﻿14.523375°N 121.153625°E﻿ / 14.523375; 121.153625CountryPhilippinesRegionCalabarzonProvinceRizalDistrict"
        ],
        [
            "1st districtFoundedAugust 19, 1938Barangays10"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJeri Mae Calderon • Vice MayorGerardo Calderon • RepresentativeMichael John Duavit • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Arvin L. VillamayorPatnubay B. TiamsonRoberto R. Sison Jr.Ma Jhoana G. DuranAurea B. NatividadFlorinio F. MatusocMa Elena D. IbañezAgustin B. Canlas"
        ],
        [
            " • Electorate70,448 voters (2022)Area • Revenue₱ 452.4 million (2020) • Assets₱ 680.7 million (2020) • Expenditure₱ 455.7 million (2020) • Liabilities₱ 276.2 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code1930PSGC0405801000IDD : area code +63 (0)2Native languagesTagalogPatron saintSaint Clement IWebsitewww.angono.gov.ph"
        ],
        [
            "Angono (pronounced"
        ],
        [
            "It is best known as the Art Capital of the Philippines, being the hometown of national artist for music Lucio San Pedro and national artist for visual arts Carlos \"Botong\" Francisco, as well as the site of the Angono Petroglyphs, the oldest known work of art in the Philippines.",
            "It is currently campaigning for its inclusion in the UNESCO Creative Cities Network as it is a center for visual arts.",
            "It is also campaigning for the inclusion of the Angono Petroglyphs (1 of 5 properties of the Petroglyphs and Petrographs of the Philippines UNESCO tentative site) in the World Heritage List."
        ],
        [
            "First created as a pueblo in 1766, Angono was a barrio of its neighboring town Taytay and Binangonan before it was legally proclaimed an independent municipality in 1938 by then President Manuel L. Quezon."
        ],
        [
            "Etymology"
        ],
        [
            "The Name \"Angono\" was derived from the myth of Panguno which Comes from the word \"Ang nuno\" which means \"The Dwarf\""
        ],
        [
            "Geography"
        ],
        [
            "Located 12 kilometres (7.5 mi) from Antipolo and 29 kilometres (18 mi) east of Manila.",
            "With the continuous expansion of Metro Manila, the municipality is considered part of Greater Manila Area.",
            "Angono is boundaried by Taytay in the north, Antipolo in the northeast, Teresa in the east, and Binangonan in the south."
        ],
        [
            "Barangays"
        ],
        [
            "Political map of Angono"
        ],
        [
            "Angono is politically subdivided into 10 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bagumbayan"
        ],
        [
            "Kalayaan"
        ],
        [
            "Mahabang Parang"
        ],
        [
            "Poblacion Ibaba"
        ],
        [
            "Poblacion Itaas"
        ],
        [
            "San Isidro"
        ],
        [
            "Santo Niño"
        ],
        [
            "San Pedro"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Etymology"
        ],
        [
            "Bagumbayan – This barangay came from the Filipino word \"bagong bayan\" which means \"new town\"."
        ],
        [
            "Kalayaan – This barangay's name came from the Filipino word kalayaan, meaning \"freedom\"."
        ],
        [
            "Mahabang Parang – The word \"mahaba\" means \"long\" and \"parang\" is a type of \"machete\", so the name of this barangay roughly translates to \"long machete\"."
        ],
        [
            "Poblacion Ibaba – The name of this barangay came from the Spanish word \"población\" meaning \"town\" and from the Filipino word \"ibaba\" which means \"below\".",
            "Therefore, this barangay means \"town below\"."
        ],
        [
            "Poblacion Itaas – This is the least populous barangay with a population of 583 people.",
            "The name roughly translates to \"town above\"."
        ],
        [
            "San Isidro – The largest and most populous barangay with a population of 31,339 people.",
            "This is also one of the largest and most populous barangays in the Philippines.",
            "This barangay is named after the Catholic patron saint of farmers named \"Isidore the Farm Labourer\" or \"Isidore the Laborer\"."
        ],
        [
            "Santo Niño – This barangay's name was inspired by the image of Jesus Christ as a child garbed in royal clothing known as the \"Sto.",
            "Niño\""
        ],
        [
            "San Pedro – This barangay's name came from the apostle of Jesus Christ \"Saint Peter\"."
        ],
        [
            "San Roque – The name of this barangay came from the patron saint of the sick and invalids known as \"Saint Roch\"."
        ],
        [
            "San Vicente – This barangay's name came from the Dominican saint Saint Vincent Ferrer."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Angono, Rizal"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "7(0.3)"
        ],
        [
            "7(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "21(0.8)"
        ],
        [
            "101(4.0)"
        ],
        [
            "152(6.0)"
        ],
        [
            "188(7.4)"
        ],
        [
            "170(6.7)"
        ],
        [
            "159(6.3)"
        ],
        [
            "115(4.5)"
        ],
        [
            "47(1.9)"
        ],
        [
            "29(1.1)"
        ],
        [
            "1,005(39.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "3.5"
        ],
        [
            "4.8"
        ],
        [
            "8.1"
        ],
        [
            "18.9"
        ],
        [
            "23.5"
        ],
        [
            "26.4"
        ],
        [
            "25.5"
        ],
        [
            "24.5"
        ],
        [
            "19.6"
        ],
        [
            "10.4"
        ],
        [
            "6.4"
        ],
        [
            "174.9"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of AngonoYearPop.±% p.a.1903 2,231—    1939 3,896+1.56%1948 5,255+3.38%1960 7,093+2.53%1970 12,127+5.50%1975 17,574+7.72%1980 26,571+8.62%YearPop.±% p.a.1990 46,014+5.65%1995 59,444+4.92%2000 74,668+5.01%2007 97,209+3.71%2010 102,407+1.91%2015 113,283+1.94%2020 130,494+2.82%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Angono, Rizal, was 130,494 people, with a density of 5,000 inhabitants per square kilometre or 13,000 inhabitants per square mile."
        ],
        [
            "Religion"
        ],
        [
            "Diocesan Shrine and Parish of St. Clement"
        ],
        [
            "Christianity is the major religion in the town, and the majority of all Christian denomination is Catholicism and a minority of Iglesia ni Cristo, Members Church of God International Born Again, Jehovah's Witnesses and more."
        ],
        [
            "Catholic Churches:"
        ],
        [
            "Diocesan Shrine and Parish of St. Clement, Barangay Poblacion Ibaba"
        ],
        [
            "St. Joseph the Worker Parish, Barangay Mahabang Parang"
        ],
        [
            "Christ the King Chapel, Exodusville Subdivision"
        ],
        [
            "San Vicente Chapel, Brgy.",
            "San Vicente."
        ],
        [
            "Sto.",
            "Niño Chapel, Constellation Homes Subdivision"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Angono"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "2006  2.50"
        ],
        [
            "2009  2.41"
        ],
        [
            "2012  3.32"
        ],
        [
            "2015  4.31"
        ],
        [
            "2018  4.07"
        ],
        [
            "2021  6.10"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "SM Center Angono"
        ],
        [
            "There are several business establishments present in the booming town of Angono.",
            "The SM Center Angono is considered one of the major businesses in town.",
            "Trade and commerce are active, such data processing, pawnshops and banks as well.",
            "With nearly 100,000 inhabitants in this urbanized town, progress is at its peak.",
            "The proposed Angono Fish Port to be constructed at the lakeside shore of Laguna de Bay will soon boost more business opportunities and easier access from the nearby towns situated at the shores of the said lake."
        ],
        [
            "Angono is known as the Arts Capital of the Philippines.",
            "With the existence of numerous business establishments and leisure hubs/historical sites, this town is surely a tourist destination."
        ],
        [
            "Culture"
        ],
        [
            "World War II Monument, Junction"
        ],
        [
            "One of the numerous public artworks in Angono"
        ],
        [
            "Angono is the hometown of two national artists, Lucio San Pedro for music and Carlos \"Botong\" Francisco for visual arts.",
            "One of the public schools in Barangay Mahabang Parang is named Carlos \"Botong\" V. Francisco Memorial National High School in honor of the said artist.",
            "The town also boasts of other artists like Nemi Miranda (also known as Nemiranda), Perdigon Vocalan, Jose \"Pitok\" Blanco and the Blanco Family.",
            "Around the town are artworks such as various sculptures and murals."
        ],
        [
            "Angono also boasts of several actors/actresses Joey Hipolito, Freddie Reynoso, Zoraida Sanchez, Mike Tan, Nikki Gil, and BJ Tolits Forbes; GMA TV Host Herlene \"Hipon\" Budol; news anchor Sandra Aguinaldo and film director Cathy Garcia-Molina."
        ],
        [
            "The artistic town of Angono celebrates the feast of Pope Clement I every November 22 to 23 of each year.",
            "There are times that this coincides with the feast of Christ the King.",
            "The celebration starts with the novena mass on the 14th till 22nd day of November, where devotees in prayer and thanksgiving dance in the church patio after each novena mass.",
            "The dancing is often accompanied by the symphonic/marching bands of Angono while church bells ring."
        ],
        [
            "The town is currently campaigning for its inclusion in the UNESCO Creative Cities Network as a center for visual arts.",
            "It is also campaigning for the inclusion of the Angono Petroglyphs (1 of 5 properties of the Petroglyphs and Petrographs of the Philippines UNESCO tentative site) in the World Heritage List."
        ],
        [
            "Bisperas Mayores"
        ],
        [
            "The Bisperas Mayores or the day before the feast day is celebrated with a parade of marching bands, drum and lyres sponsored by each barangay of Angono held in the morning and early afternoon.",
            "The morning parade usually starts in Rainbow Village and ends at the church patio where the devotees again dance in praise and thanksgiving while the marching bands play.",
            "The afternoon parade is also joined by papier-mâché higantes, local government officials and employees, commercial establishments in Angono, schools and other Angono socio and civic groups."
        ],
        [
            "The celebration on the morning of November 23 starts with a concelebrated mass with the Bishop of Antipolo.",
            "The procession follows after the mass with parehadoras, higantes and devotees joining the image of St. Isidore the Laborer, Pope Clement I and the Virgin Mary in a procession leading to the banks of Laguna de Bay in Barangay San Vicente for the fluvial procession, fishes like kanduli, tilapia and bangus which are caught by the fishermen devotees during the fluvial procession are displayed near the image of Pope Clement I.",
            "The images, devotees and members of the band ride the pagoda for the procession in the lake which will disembark at another part of the Angono shoreline side of the lake in Barangay Poblacion Ibaba.",
            "The road procession will again start with merry making of parehadoras, higantes and wet devotees which will culminate in the church.",
            "Filipino artistry is truly alive in every celebration in Angono."
        ],
        [
            "Cristo Rey"
        ],
        [
            "The feast of Christ the King which is held on the Sunday before the 1st Sunday of Advent usually coincides with the feast of Pope Clement I.",
            "The Viva San Clemente!",
            "celebration banners usually include “Mabuhay ang Kristong Hari!” slogans to remind the people that Christ is the Lord and to proclaim Christ as the King of all nations.",
            "This is also a reminder that Pope Clement I is only a servant of God which somehow does not need adoration of the people because our Lord has already given him the highest honor – a blessing of a Saint – Angono's patron and inspiration."
        ],
        [
            "Pope Clement I was the fourth pope of the Catholic Church after Pope Peter the prince of the apostles, Pope Linus, and Pope Anacletus.",
            "He faithfully proclaimed Christ during his time and until his martyrdom by being thrown into the sea attached to an iron anchor.",
            "The people of Angono celebrate Pope Clement I's feast day with a fluvial procession in the waters of Laguna de Bay as a reminder and inspiration of his faith in God."
        ],
        [
            "Higantes Festival"
        ],
        [
            "Main article: Higantes Festival"
        ],
        [
            "Higantes, along Angono Municipal Hall"
        ],
        [
            "Angono's joyous fiesta in honor of Pope Clement I whose image, resplendent in papal vestments, is held November 22–23, and involves a procession accompanied by parehadoras devotees dressed in colorful local costumes, wooden shoes and carrying boat paddles and higantes, giant papier-mâché effigies.",
            "The street event culminates in fluvial procession at Laguna de Bay amidst revelry that continues until the image is brought back to its sanctuary."
        ],
        [
            "Higantes Festival is now promoted as tourism-generating event in the country.",
            "This attracts numerous tourists from all over the world."
        ],
        [
            "It was said that the higantes started during the Spanish colonial times.",
            "When Angono was once a hacienda and ruled by Spanish hacienderos The Guido.",
            "The Angono land tillers' way of protesting their struggle was by making giant effigies of their landlords whose hands are usually high up on their waist."
        ],
        [
            "The body of the traditional higante is made of bamboo and colorful cloth and its faces of papier-mâché.",
            "The three oldest higantes of Angono consists of a family of giants – the father, mother and child higante, they traditionally add color and fun during the fiesta celebration.",
            "It was in the 80s when then Angono artist Perdigon Vocalan brought the idea of the Higantes Festival by going out of the traditional family of giants and advocating having more higantes in the fiesta by coordinating with the barangays of Angono to come up with Higantes that will represent their barangay.",
            "At present, the Higantes of Angono can be seen in fiesta celebrations around the Philippines and in national cultural presentations, a highlight being the Centennial Parade in the Quirino Grandstand for the Philippine Centennial celebration in 1998."
        ],
        [
            "The higantes are made of papier-mâché.",
            "Higantes measures four to five feet in diameter and ten to twelve feet in height.",
            "Traditionally, it began in the last century when Angono was a Spanish hacienda.",
            "These higantes were influenced by the Mexican art form of papier-mâché brought by the Spanish priests to the Philippines."
        ],
        [
            "Parehadora"
        ],
        [
            "The traditional parehadoras are group of young girls holding paddles and wearing bakya or wooden slippers and dressed in a colorful outfit which joins the procession in the feast day of Pope Clement I.",
            "They usually march at the beat of the band playing alongside them.",
            "Now with a dying lake, the tradition of the Parehadora is now just a reminder that Angono was once a fishing village and thrives at the harvest of Laguna Lake."
        ],
        [
            "Salubong"
        ],
        [
            "Black Saturday is highlighted by 3-hour presentation of “Vigilia na Muling Pagkabuhay” at the patio of the church.",
            "On Easter Sunday, a celebration is held as the reunion of the Risen Christ with Virgin Mary is reenacted.",
            "It is facilitated by a young girl inside an inverted giant paper flower suspended from a bamboo trellis who removes the mourning veil from Mary's head.",
            "The petals of the suspended flower are mechanically opened by giant birds attached to strings to reveal the girl inside.",
            "It is then followed by a religious dancing of young ladies called “Kapitana” and “Tenyenta”, to the tune of “Bati”."
        ],
        [
            "Government"
        ],
        [
            "Angono Municipal Hall"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "The municipality is governed by a municipal mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Sangguniang Bayan 2022-2025:"
        ],
        [
            "Mayor: Jeri Mae Calderon (NPC)"
        ],
        [
            "Vice Mayor: Gerardo Calderon (NPC)"
        ],
        [
            "Councilors:"
        ],
        [
            "Arvin Villamayor (NPC)"
        ],
        [
            "Patnubay Tiamson (NP)"
        ],
        [
            "Roberto Sison, Jr. (NPC)"
        ],
        [
            "Jhoana Duran (NPC)"
        ],
        [
            "Aurea Natividad (NPC)"
        ],
        [
            "Florinio Matusoc (NPC)"
        ],
        [
            "Maria Elena Ibañez (NPC)"
        ],
        [
            "Agustin Canlas (NPC)"
        ],
        [
            "ABC / LNB President: Jonathan V. Hernandez"
        ],
        [
            "SK President: Ivan Jeyo R. Ang"
        ],
        [
            "List of local chief executives"
        ],
        [
            "No."
        ],
        [
            "Name"
        ],
        [
            "Title"
        ],
        [
            "Served (From)"
        ],
        [
            "Until"
        ],
        [
            "1"
        ],
        [
            "Antonio P. Ibañez"
        ],
        [
            "Mayor"
        ],
        [
            "1938"
        ],
        [
            "1940"
        ],
        [
            "2"
        ],
        [
            "Domingo S. Villamayor"
        ],
        [
            "Mayor"
        ],
        [
            "1940"
        ],
        [
            "1946"
        ],
        [
            "3"
        ],
        [
            "Demetrio Tolentino"
        ],
        [
            "Mayor"
        ],
        [
            "1946"
        ],
        [
            "1947"
        ],
        [
            "(1)"
        ],
        [
            "Antonio P. Ibañez"
        ],
        [
            "Mayor"
        ],
        [
            "1947"
        ],
        [
            "1950"
        ],
        [
            "4"
        ],
        [
            "Ponciano A. Rivera"
        ],
        [
            "Mayor"
        ],
        [
            "1950"
        ],
        [
            "1951"
        ],
        [
            "5"
        ],
        [
            "Roman S. Reyes"
        ],
        [
            "Mayor"
        ],
        [
            "1951"
        ],
        [
            "1955"
        ],
        [
            "6"
        ],
        [
            "Saturnino V. Tiamson"
        ],
        [
            "Mayor"
        ],
        [
            "1955"
        ],
        [
            "1968"
        ],
        [
            "(4)"
        ],
        [
            "Ponciano A. Rivera"
        ],
        [
            "Mayor"
        ],
        [
            "1968"
        ],
        [
            "1972"
        ],
        [
            "(6)"
        ],
        [
            "Saturnino V. Tiamson"
        ],
        [
            "Mayor"
        ],
        [
            "1972"
        ],
        [
            "1986"
        ],
        [
            "-"
        ],
        [
            "Nemesio B. Miranda"
        ],
        [
            "OIC"
        ],
        [
            "1986"
        ],
        [
            "1988"
        ],
        [
            "7"
        ],
        [
            "Vivencio B. Villamayor"
        ],
        [
            "Mayor"
        ],
        [
            "1988"
        ],
        [
            "1995"
        ],
        [
            "(6)"
        ],
        [
            "Saturnino V. Tiamson"
        ],
        [
            "Mayor"
        ],
        [
            "1995"
        ],
        [
            "1998"
        ],
        [
            "8"
        ],
        [
            "Gerardo V. Calderon"
        ],
        [
            "Mayor"
        ],
        [
            "1998"
        ],
        [
            "2007"
        ],
        [
            "9"
        ],
        [
            "Aurora A. Villamayor"
        ],
        [
            "Mayor"
        ],
        [
            "2007"
        ],
        [
            "2010"
        ],
        [
            "(8)"
        ],
        [
            "Gerardo V. Calderon"
        ],
        [
            "Mayor"
        ],
        [
            "2010"
        ],
        [
            "2019"
        ],
        [
            "10"
        ],
        [
            "Jeri Mae E. Calderon"
        ],
        [
            "Mayor"
        ],
        [
            "2019"
        ],
        [
            "present"
        ],
        [
            "Education"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2018) (Learn how and when to remove this message)"
        ],
        [
            "Schools:"
        ],
        [
            "ALC High School"
        ],
        [
            "Angono Christian School"
        ],
        [
            "Angono Elementary School"
        ],
        [
            "Angono National High School"
        ],
        [
            "Angono Private High School"
        ],
        [
            "Baby Jesus Chrissamore Learning Center"
        ],
        [
            "Blanco Family Academy"
        ],
        [
            "Charis Praise Christian Academy"
        ],
        [
            "Christ the King College of Angono"
        ],
        [
            "Colegio De San Clemente"
        ],
        [
            "Crossmount School of Arts and Trades"
        ],
        [
            "Eastern Light College"
        ],
        [
            "Faderoga's Learning Center"
        ],
        [
            "Gingergrace Academe"
        ],
        [
            "Holy Deliverance Integrated Christian School"
        ],
        [
            "Hope Academy"
        ],
        [
            "Jason Harvey Academy"
        ],
        [
            "Joaquin Guido Elementary School"
        ],
        [
            "Jonathan T.M.",
            "Caballero Academy of Special Needs"
        ],
        [
            "Joyland Playschool Childcare and Learning Center"
        ],
        [
            "Lakeside Hills Learning School"
        ],
        [
            "Little Footprints Playschool and Tutorial Center"
        ],
        [
            "Little Lambs Learning Center"
        ],
        [
            "Maranatha Christian Academy"
        ],
        [
            "Marrieve of Light School"
        ],
        [
            "Mind Slot Integrated School"
        ],
        [
            "Carlos \"Botong\" V. Francisco Memorial National High School"
        ],
        [
            "New Hope in Faith School"
        ],
        [
            "Nuestra Senora De Guia Academy - East Rizal"
        ],
        [
            "Praise Christian Academy"
        ],
        [
            "Raises Academy"
        ],
        [
            "Regional Lead School for the Arts in Angono"
        ],
        [
            "Seven Angels College"
        ],
        [
            "Shinil Cristian Academy"
        ],
        [
            "St. Catherine Learning Center"
        ],
        [
            "St. Martin Montessori School"
        ],
        [
            "Santo Entiero Learning Center"
        ],
        [
            "San Vicente Elementary School"
        ],
        [
            "Teensy Weensy Child Development Christian School"
        ],
        [
            "Healthcare"
        ],
        [
            "Angono Medics Hospital"
        ],
        [
            "St. Clement Medical, Inc."
        ],
        [
            "Rizal Provincial Hospital (Angono Annex)"
        ],
        [
            "San Isidro Hospital"
        ],
        [
            "San Isidro Hospital (Angono Annex)"
        ],
        [
            "Mikko Medics Medical Maternity & Lying-in Clinic"
        ],
        [
            "Notable person"
        ],
        [
            "Mike Tan, actor"
        ],
        [
            "Herlene Budol, actress-comedian"
        ],
        [
            "Christian Standhardinger, Basketball Player"
        ],
        [
            "Arvin Tolentino, Basketball Player"
        ],
        [
            "Rowgien Stimpson Unigo, MLBB Pro Player, MLBB World Champion"
        ],
        [
            "See also"
        ],
        [
            "List of Cultural Properties of the Philippines in Angono, Rizal"
        ],
        [
            "References"
        ],
        [
            "^ https://m.facebook.com/notes/ang-nuno/kasaysayan-ng-angono-rizal-mula-sa-panahon-ng-mga-espanyol-hanggang-sa-panahon-n/134643163253506/"
        ],
        [
            "^  Municipality of Angono |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"'Higantes': Art engraved in Angono | Inquirer News\"."
        ],
        [
            "^"
        ],
        [
            "\"Province:\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Angono: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 11 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Halalan 2022 Results\"."
        ],
        [
            "^ \"Angono goes Nacionalista\".",
            "The Manila Times.",
            "The Manila Times Publishing Company, Inc. November 18, 1959. p. 11-A.",
            "Re-elected to the mayorship is the incumbent mayor, Saturnino Tiamson."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Angono."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "https://web.archive.org/web/20131029195219/http://www.tourism.gov.ph/sitepages/FestivitiesList.aspx?festivityCode=205&monthCode=04"
        ],
        [
            "Places adjacent to Angono"
        ],
        [
            "Antipolo"
        ],
        [
            "Teresa"
        ],
        [
            "Taytay"
        ],
        [
            "Angono"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "Binangonan"
        ],
        [
            "vte Province of RizalAntipolo (capital and largest city)Municipalities"
        ],
        [
            "Angono"
        ],
        [
            "Baras"
        ],
        [
            "Binangonan"
        ],
        [
            "Cainta"
        ],
        [
            "Cardona"
        ],
        [
            "Jalajala"
        ],
        [
            "Morong"
        ],
        [
            "Pililla"
        ],
        [
            "Rodriguez"
        ],
        [
            "San Mateo"
        ],
        [
            "Tanay"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Component City"
        ],
        [
            "Antipolo"
        ],
        [
            "Authority control databases: Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Angono&oldid=1230453679\""
        ],
        [
            "Categories: Municipalities of RizalPopulated places on Laguna de BayPopulated places established in 19381938 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsAccuracy disputes from March 2022CS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2014All articles needing additional referencesPages using infobox settlement with possible motto listCoordinates on WikidataPages with Tagalog IPAArticles containing Tagalog-language textArticles needing additional references from July 2018Commons category link from WikidataArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}