{
    "name": "Aparri",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Aparri"
        ],
        [
            "24 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschΕλληνικάEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 18°21′27″N 121°38′14″E﻿ / ﻿18.3575°N 121.6372°E﻿ / 18.3575; 121.6372"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cagayan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Aparri\" – news · newspapers · books · scholar · JSTOR (January 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesAparriMunicipalityMunicipality of AparriAparri Beach"
        ],
        [
            "FlagSealMap of Cagayan with Aparri highlightedOpenStreetMapAparriLocation within the PhilippinesCoordinates: 18°21′27″N 121°38′14″E﻿ / ﻿18.3575°N 121.6372°E﻿ / 18.3575; 121.6372CountryPhilippinesRegionCagayan ValleyProvinceCagayanDistrict"
        ],
        [
            "1st districtBarangays42"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorBryan Dale G. Chan • Vice MayorIreneo R. Chan • RepresentativeRamon C. Nolasco Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Joevan AlbanioCesar F. MabbaguRichelle E. ChanIsmael D. Tumaru IIIDian Jaycerett A. DayagJoylyn F. EslabonCharles CastilloTBA"
        ],
        [
            " • Electorate38,402 voters (2022)Area • Revenue₱ 256.2 million (2020) • Assets₱ 945 million (2020) • Expenditure₱ 198.5 million (2020) • Liabilities₱ 198.8 million (2020)Service provider • ElectricityCagayan 2 Electric Cooperative (CAGELCO 2)Time zoneUTC+8 (PST)ZIP code3515PSGC021505000IDD : area code +63 (0)78Native languagesIlocano Ibanag TagalogWebsiteweb.archive.org/web/20090913053212/http://lguaparri.org/index.htm"
        ],
        [
            "Aparri (Ibanag: Ili nat Aparri; Ilocano: Ili ti Aparri; Tagalog: Bayan ng Aparri), officially the Municipality of Aparri,  is a 1st class municipality in the province of  Cagayan, Philippines.",
            "According to the 2020 census, it has a population of 68,839 people."
        ],
        [
            "It sits at the mouth of the Cagayan River, the longest river in the Philippines.",
            "Aparri is 101 kilometres (63 mi) from Tuguegarao and 582 kilometres (362 mi) from Manila."
        ],
        [
            "Aparri is a bustling municipality and the primary growth center of Northern Cagayan.",
            "It serves as the center of education, commerce and culture in the northern part of the Region which includes towns of the first and second districts of Cagayan as well as the towns of Apayao and some towns of Ilocos Norte.",
            "It serves as the show window of commerce and finance,economic transformation, information technology, livelihood development, fashion and culture, leisure and entertainment, agricultural modernization, and course good local governance."
        ],
        [
            "Aparri has an approximate income of ₱250 million.",
            "The valley has been one of the largest tobacco-producing sections in the Philippines, and the town has a considerable coastwise trade."
        ],
        [
            "It has a meteorological station located in Barangay Punta where the Cagayan River meets the Babuyan Channel."
        ],
        [
            "It also administers Fuga Island, which is part of the Babuyan Group and is much closer to Claveria.",
            "In the near future, it will become the next city in the province of Cagayan."
        ],
        [
            "Etymology"
        ],
        [
            "The origin of the name Aparri has been disputed.",
            "One version says that the town was named by Spanish conquistador Juan Pablo Carreron, who upon landing there in 1581, named the town after the colloquial word for supper in his hometown.",
            "Another version claims that the name comes from the Spanish word aparte, or \"separate\", referring to the town's separation from Camalaniugan and Buguey in 1680.",
            "Yet another version says that the town's name comes from the Ibanag word apparian, a place where there are many priests."
        ],
        [
            "History"
        ],
        [
            "Aerial view of Aparri, 1923"
        ],
        [
            "Aparri was formerly Japanese trading post because of its location at the northern tip of Luzon at the mouth of the Cagayan River.",
            "It was the main area for trade for Japan on the island of Luzon.",
            "Much of the area was once home to the native Ibanag people, who were at the time in alliance with Japan as an early form of an informal protectorate city-state.",
            "It was formally established under Spanish rule in 1605 after the Spanish Crown seized the Philippines and made it part of the Spanish East Indies.",
            "The river where Aparri is in was the site of the famed 1582 Cagayan battles, the only major skirmish between Spanish Tercios and Japanese ronin (masterless samurai).",
            "Since it was on the route of Spanish Galleons during the great tobacco monopoly in the 16th to the 17th centuries, Aparri was therefore made one of the major Spanish ports of the Galleon Trade on May 11, 1680.",
            "The original inhabitants of this town were the Ybanags.",
            "Later, as the Spaniards settled and because of its strategic location, Ilocanos and Chinese people settled in the area.",
            "In 1771 it was raided by Moro vessels from Jolo.",
            "Towards the end of the Spanish occupation and in 1901, at the start of the American occupation, attempts were made to make Aparri the provincial capital of Cagayan, all of which were unsuccessful."
        ],
        [
            "During the Philippine Revolution, Aparri was the site of the landing of soldiers of the Philippine Revolutionary Army led by Daniel Tirona, which marked the beginning of the end of Spanish rule in Cagayan Valley, on 25 August 1898."
        ],
        [
            "In 11 May 1926 Joaquín Loriga  and Eduardo Gallarza landed on his first-ever long way in autogyro from Spain to Manila.",
            "Before the outbreak of World War II, it became a transshipment point for smuggled goods from China, Taiwan, and other neighboring Southeast Asian nations.",
            "Aparri was one of the first places occupied by the Japanese in their invasion of the Philippines during the war, landing there on December 10, 1941.",
            "Donald Blackburn's guerrilla forces and the local troops of the Philippine Commonwealth Army and Philippine Constabulary supported the Sixth United States Army Force B, in the capture of Aparri on 20 June 1945.: 295–304"
        ],
        [
            "On February 19, 2023, Vice Mayor Rommel Alameda was shot and killed along with five others in an ambush in Bagabag, Nueva Vizcaya."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Aparri is politically subdivided into 42 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Backiling"
        ],
        [
            "Bangag"
        ],
        [
            "Binalan"
        ],
        [
            "Bisagu"
        ],
        [
            "Bukig"
        ],
        [
            "Bulala Norte"
        ],
        [
            "Bulala Sur"
        ],
        [
            "Caagaman"
        ],
        [
            "Centro 1 (Poblacion)"
        ],
        [
            "Centro 2 (Poblacion)"
        ],
        [
            "Centro 3 (Poblacion)"
        ],
        [
            "Centro 4 (Poblacion)"
        ],
        [
            "Centro 5 (Poblacion)"
        ],
        [
            "Centro 6 (Poblacion)"
        ],
        [
            "Centro 7 (Poblacion)"
        ],
        [
            "Centro 8 (Poblacion)"
        ],
        [
            "Centro 9 (Poblacion)"
        ],
        [
            "Centro 10 (Poblacion)"
        ],
        [
            "Centro 11 (Poblacion)"
        ],
        [
            "Centro 12 (Poblacion)"
        ],
        [
            "Centro 13 (Poblacion)"
        ],
        [
            "Centro 14 (Poblacion)"
        ],
        [
            "Centro 15 (Poblacion)"
        ],
        [
            "Dodan"
        ],
        [
            "Fuga Island"
        ],
        [
            "Gaddang"
        ],
        [
            "Linao"
        ],
        [
            "Mabanguc"
        ],
        [
            "Macanaya (Pescaria)"
        ],
        [
            "Maura"
        ],
        [
            "Minanga"
        ],
        [
            "Navagan"
        ],
        [
            "Paddaya"
        ],
        [
            "Paruddun Norte"
        ],
        [
            "Paruddun Sur"
        ],
        [
            "Plaza"
        ],
        [
            "Punta"
        ],
        [
            "San Antonio"
        ],
        [
            "Sanja"
        ],
        [
            "Tallungan"
        ],
        [
            "Toran"
        ],
        [
            "Zinarag"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Aparri (1991–2020, extremes 1903–2020)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "33.9(93.0)"
        ],
        [
            "35.8(96.4)"
        ],
        [
            "36.1(97.0)"
        ],
        [
            "38.4(101.1)"
        ],
        [
            "39.0(102.2)"
        ],
        [
            "38.0(100.4)"
        ],
        [
            "37.2(99.0)"
        ],
        [
            "37.5(99.5)"
        ],
        [
            "36.1(97.0)"
        ],
        [
            "36.2(97.2)"
        ],
        [
            "35.5(95.9)"
        ],
        [
            "33.2(91.8)"
        ],
        [
            "39.0(102.2)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "28.4(83.1)"
        ],
        [
            "30.3(86.5)"
        ],
        [
            "32.2(90.0)"
        ],
        [
            "33.2(91.8)"
        ],
        [
            "33.7(92.7)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "32.3(90.1)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "29.9(85.8)"
        ],
        [
            "28.0(82.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "24.3(75.7)"
        ],
        [
            "24.8(76.6)"
        ],
        [
            "26.4(79.5)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "29.4(84.9)"
        ],
        [
            "29.0(84.2)"
        ],
        [
            "28.7(83.7)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "27.3(81.1)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21.0(69.8)"
        ],
        [
            "21.2(70.2)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "25.0(77.0)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "21.8(71.2)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "15.0(59.0)"
        ],
        [
            "13.7(56.7)"
        ],
        [
            "15.0(59.0)"
        ],
        [
            "16.0(60.8)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "17.8(64.0)"
        ],
        [
            "17.0(62.6)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "21.0(69.8)"
        ],
        [
            "19.0(66.2)"
        ],
        [
            "16.3(61.3)"
        ],
        [
            "15.0(59.0)"
        ],
        [
            "13.7(56.7)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "95.5(3.76)"
        ],
        [
            "62.2(2.45)"
        ],
        [
            "35.5(1.40)"
        ],
        [
            "38.1(1.50)"
        ],
        [
            "110.6(4.35)"
        ],
        [
            "114.9(4.52)"
        ],
        [
            "196.1(7.72)"
        ],
        [
            "195.0(7.68)"
        ],
        [
            "224.5(8.84)"
        ],
        [
            "280.9(11.06)"
        ],
        [
            "309.9(12.20)"
        ],
        [
            "229.5(9.04)"
        ],
        [
            "1,892.7(74.52)"
        ],
        [
            "Average rainy days (≥ 1.0 mm)"
        ],
        [
            "11"
        ],
        [
            "8"
        ],
        [
            "4"
        ],
        [
            "4"
        ],
        [
            "8"
        ],
        [
            "8"
        ],
        [
            "10"
        ],
        [
            "11"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "121"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "87"
        ],
        [
            "85"
        ],
        [
            "84"
        ],
        [
            "83"
        ],
        [
            "82"
        ],
        [
            "81"
        ],
        [
            "82"
        ],
        [
            "83"
        ],
        [
            "84"
        ],
        [
            "85"
        ],
        [
            "87"
        ],
        [
            "88"
        ],
        [
            "84"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of AparriYearPop.±% p.a.1903 18,252—    1918 20,912+0.91%1939 26,409+1.12%1948 24,974−0.62%1960 33,424+2.46%1970 40,307+1.89%1975 42,419+1.03%1980 45,070+1.22%YearPop.±% p.a.1990 51,635+1.37%1995 53,639+0.72%2000 59,046+2.08%2007 61,024+0.46%2010 61,199+0.10%2015 65,649+1.35%2020 68,839+0.94%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Aparri, was 68,839 people, with a density of 240 inhabitants per square kilometre or 620 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Aparri"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  17.10"
        ],
        [
            "2009  15.43"
        ],
        [
            "2012  21.85"
        ],
        [
            "2015  15.44"
        ],
        [
            "2018  13.28"
        ],
        [
            "2021  14.44"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Archdiocesan Shrine of Our Lady of the Most Holy Rosary"
        ],
        [
            "Aparri is known for its foods such as the \"bulung-unas\", or Ribbon Fish (aka Belt Fish), which are in abundance during January and early February.",
            "\"Kilawin naguilas-asan\" is a fillet of smaller \"bulung-unas\" which are leftover baits, soaked in Ilocos vinegar, seasoned with salt and pepper, finely cut onions and ginger.",
            "Ludong, a variety of Pacific salmon, is the Philippines' most expensive fish, ranging from 4,000 pesos to 5,000 per kilo.",
            "Because of its price and its distinct taste and smell, it is also nicknamed \"President Fish\".",
            "Caught only in the Aparri delta when, after a heavy rainfall, these fish are washed down by the fast raging water from the south, down to the mouth of the Cagayan River where it meets the Babuyan Sea.",
            "Freshwater fish by nature, the salt water contributes to their super delicious taste.",
            "Ludong is available only in the rainy months of October and early November."
        ],
        [
            "Aparri's attractions also include its sandy beaches and town fiesta.",
            "May 1 to 12 of every year, the town's fiesta celebrates the patron saint San Pedro Gonzales of Thelmo with nightly festivities at the auditorium, crowning of Miss Aparri beauty pageant and the \"Comparza.\""
        ],
        [
            "It is home to the Archdiocesan Shrine of Our Lady of the Most Holy Rosary and the Shrine of San Lorenzo Ruiz de Manila.",
            "Holy Week is celebrated in Aparri with the observance of Holy Thursday and Good Friday in the town churches.",
            "On the early hours of Easter Sunday, the \"Domingo Sabet\" celebrates the meeting of Jesus and the Holy Mother after the resurrection."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Aparri, belonging to the first legislative district of the province of Cagayan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Ramon C. Nolasco Jr."
        ],
        [
            "Mayor"
        ],
        [
            "Bryan Dale G. Chan"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Ireneo R. Chan"
        ],
        [
            "Councilors"
        ],
        [
            "Joevan Albanio"
        ],
        [
            "Cesar F. Mabbagu"
        ],
        [
            "Richelle E. Chan"
        ],
        [
            "Ismael D. Tumaru III"
        ],
        [
            "Dian Jaycerette A. Dayag"
        ],
        [
            "Joylyn F. Eslabon"
        ],
        [
            "Charles Castillo"
        ],
        [
            "TBA"
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Cagayan governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Aparri East National High School"
        ],
        [
            "Cagayan State University (Aparri Campus)"
        ],
        [
            "Aparri West National High School"
        ],
        [
            "Aparri East Central School"
        ],
        [
            "Aparri South Central School"
        ],
        [
            "Aparri School of Arts and Trades"
        ],
        [
            "Lyceum of Aparri"
        ],
        [
            "Cagayan Valley Institute Incorporated"
        ],
        [
            "St. Paul School of Aparri"
        ],
        [
            "Aparri Kete Chinese School"
        ],
        [
            "Maura Elementary School"
        ],
        [
            "Punta Elementary School"
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "Dodan Elementary School"
        ],
        [
            "Backiling Elementary School"
        ],
        [
            "Bulala Sur Elementary School"
        ],
        [
            "Paruddun Norte Elementary School"
        ],
        [
            "Minanga Elementary School"
        ],
        [
            "Sanja Elementary School"
        ],
        [
            "Gaddang Elementary School"
        ],
        [
            "Linao Elementary School"
        ],
        [
            "Navagan Elementary School"
        ],
        [
            "Aparri West Central School"
        ],
        [
            "Caroronan Primary School"
        ],
        [
            "Binalan Elementary School"
        ],
        [
            "Bangag Elementary School"
        ],
        [
            "Nanappatan Elementary School"
        ],
        [
            "Zinarag Elementary School"
        ],
        [
            "Plaza Primary School"
        ],
        [
            "Bukig National Agricultural and Technical School"
        ],
        [
            "Media"
        ],
        [
            "Aparri's main media outlet is radio.",
            "The following are radio and TV stations in the town"
        ],
        [
            "Radio"
        ],
        [
            "Radyo Natin FM 102.1 (Manila Broadcasting Company)"
        ],
        [
            "Radyo Kidlat FM 103.9 (Philippine Broadcasting Service)"
        ],
        [
            "TV Stations"
        ],
        [
            "GMA TV-13 Aparri"
        ],
        [
            "ABS-CBN TV-9 Aparri (defunct)"
        ],
        [
            "Notable personalities"
        ],
        [
            "Aparri as a birthplace has produced a number of famous personalities of various fields (e.g.",
            "Filipino actress, Filipino diplomat (1939-2016), Filipino actor and comedian):"
        ],
        [
            "Maja Ross Andres Salvador - is a Filipino actress, endorser, dancer, singer, host, producer, and talent manager."
        ],
        [
            "Domingo Lim Siazon Jr. - was a Filipino diplomat.",
            "He served as the Director-General of the United Nations Industrial Development Organization from 1985 to 1992, the 18th Philippine Secretary of Foreign Affairs from 1995 to 2001, and the Philippine Ambassador to Japan from 1993 to 1995 (1st term) and 2001 to 2010 (2nd term)."
        ],
        [
            "Kakai Bautista - is a Filipina actress, host, singer, and comedienne."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Aparri |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^  One or more of the preceding sentences incorporates text from a publication now in the public domain: Chisholm, Hugh, ed.",
            "(1911).",
            "\"Aparri\".",
            "Encyclopædia Britannica.",
            "Vol.",
            "2 (11th ed.).",
            "Cambridge University Press.",
            "p. 159."
        ],
        [
            "^ a b de Rivera Castillet, Ed.",
            "Cagayan Province and her People.",
            "Community Publishers."
        ],
        [
            "^ Salgado, Pedro.",
            "\"Ibanag Missions in Cagayan Province\".",
            "Cagayan Valley and Easter Cordillera: 1581-1898, Volume I. Rex Publishing.",
            "pp.",
            "230–235."
        ],
        [
            "^ Harkins, P., 1956, Blackburn's Headhunters, London: Cassell & Co. LTD"
        ],
        [
            "^ \"Aparri vice mayor, 5 others killed in Nueva Vizcaya ambush\".",
            "Inquirer.",
            "Retrieved 19 February 2023."
        ],
        [
            "^"
        ],
        [
            "\"Aparri, Cagayan Climatological Normal Values 1991–2020\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on March 1, 2022.",
            "Retrieved May 5, 2022."
        ],
        [
            "^"
        ],
        [
            "\"Aparri, Cagayan Climatological Extremes\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on March 8, 2022.",
            "Retrieved May 5, 2022."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cagayan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 10, 2022."
        ],
        [
            "^ \"History of DepED SDO Cagayan\".",
            "DepED SDO Cagayan | Official Website of DepED SDO Cagayan.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02.",
            "Archived from the original on 2022-04-12.",
            "Retrieved 2022-03-12."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Aparri."
        ],
        [
            "Government"
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "General information"
        ],
        [
            "Aparri | Philippines | Britannica"
        ],
        [
            "Aparri Profile - Cities and Municipalities Competitive Index (dti.gov.ph)"
        ],
        [
            "Adjacent jurisdictions to mainland part"
        ],
        [
            "Babuyan Channel (Luzon Strait)"
        ],
        [
            "Ballesteros"
        ],
        [
            "Aparri"
        ],
        [
            "Buguey"
        ],
        [
            "Allacapan / Camalaniugan"
        ],
        [
            "Adjacent jurisdictions to Fuga Island"
        ],
        [
            "Calayan (Dalupiri Island)"
        ],
        [
            "South China Sea"
        ],
        [
            "Aparri (Fuga Island)"
        ],
        [
            "Calayan (Camiguin Island)"
        ],
        [
            "Babuyan Channel (Luzon Strait)Sanchez-Mira / Pamplona"
        ],
        [
            "vte Province of CagayanTuguegarao (capital and largest city)Municipalities"
        ],
        [
            "Abulug"
        ],
        [
            "Alcala"
        ],
        [
            "Allacapan"
        ],
        [
            "Amulung"
        ],
        [
            "Aparri"
        ],
        [
            "Baggao"
        ],
        [
            "Ballesteros"
        ],
        [
            "Buguey"
        ],
        [
            "Calayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "Claveria"
        ],
        [
            "Enrile"
        ],
        [
            "Gattaran"
        ],
        [
            "Gonzaga"
        ],
        [
            "Iguig"
        ],
        [
            "Lal-lo"
        ],
        [
            "Lasam"
        ],
        [
            "Pamplona"
        ],
        [
            "Peñablanca"
        ],
        [
            "Piat"
        ],
        [
            "Rizal"
        ],
        [
            "Sanchez Mira"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Solana"
        ],
        [
            "Tuao"
        ],
        [
            "Component city"
        ],
        [
            "Tuguegarao"
        ],
        [
            "BarangaysSee: List of barangays in Cagayan"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Other"
        ],
        [
            "NARA"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Aparri&oldid=1228275657\""
        ],
        [
            "Categories: Municipalities of CagayanPopulated places on the Rio Grande de CagayanHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsWikipedia articles incorporating a citation from the 1911 Encyclopaedia Britannica with Wikisource referenceWikipedia articles incorporating text from the 1911 Encyclopædia BritannicaCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2014All articles needing additional referencesCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textWikipedia articles needing clarification from June 2024Commons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with NARA identifiersPages using the Kartographer extension"
        ]
    ]
}