{
    "name": "Babatngon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Babatngon"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°25′15″N 124°50′36″E﻿ / ﻿11.420733°N 124.843425°E﻿ / 11.420733; 124.843425"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Leyte, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Babatngon\" – news · newspapers · books · scholar · JSTOR (June 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesBabatngonMunicipalityMunicipality of BabatngonRice field in Pagsulhugon"
        ],
        [
            "FlagMap of Leyte with Babatngon highlightedOpenStreetMapBabatngonLocation within the PhilippinesCoordinates: 11°25′15″N 124°50′36″E﻿ / ﻿11.420733°N 124.843425°E﻿ / 11.420733; 124.843425CountryPhilippinesRegionEastern VisayasProvinceLeyteDistrict"
        ],
        [
            "1st districtBarangays25"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorElenor B. Lugnasin (PDP-Laban) • Vice MayorRosary Pearl G. Catudio (PDP-Laban) • RepresentativeFerdinand Martin G. Romualdez • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Cesar V. Bergula• Rosary Pearl G. Catudio• Federico O. Dimpas• Edgardo Y. Morden• Jake Tristan M. Chan• Rogelio B. Fabi• Benjamin D. Cale• Joel R. RondinaDILG Masterlist of Officials"
        ],
        [
            " • Electorate19,766 voters (2022)Area • Revenue₱ 117.2 million (2020) • Assets₱ 289.3 million (2020) • Expenditure₱ 128.6 million (2020) • Liabilities₱ 84.29 million (2020)Service provider • ElectricityLeyte 2 Electric Cooperative (LEYECO 2)Time zoneUTC+8 (PST)ZIP code6520PSGC0803705000IDD : area code +63 (0)53Native languagesWaray TagalogWebsitewww.babatngon-leyte.gov.ph"
        ],
        [
            "Babatngon (IPA:"
        ],
        [
            "Babatngon is located in the northern part of the island of Leyte, along the shore of Carigara Bay.",
            "It is situated on a small plain set in a semicircle of mountain ranges and nestles in the northern mouth of the San Juanico Strait, which separates Samar from Leyte.",
            "Boats coming in or going out of Tacloban City have to pass by it through the pilot station of Canaway, one of the islets along the strait.",
            "It is 33 kilometres (21 mi) north-west of Tacloban City and about 10 kilometres (6.2 mi) north of the town of San Miguel.",
            "Small coconut covered islets fringe its coast along San Juanico Strait, the most important of which are Rizal, Magsaigad, Tabigue, almost all of which extend from east to west."
        ],
        [
            "Etymology"
        ],
        [
            "The place got its name from the word batong, a large trap made of abaca fibers used for hunting by the early Boholano settlers.",
            "Later on named as \"Babatngon,\" which means hunting ground with the use of a net."
        ],
        [
            "History"
        ],
        [
            "Historical Location"
        ],
        [
            "There are divergent versions as to the first municipal site of Babatngon.",
            "Some say that the first settlement was called San Juanico in Bacod Island from which the name San Juanico strait was derived.",
            "Another version says that the first settlement was San Vicente, which was part of Bacod Island, while still others say that the first municipal site was in the present barangay of Malibago.",
            "The most favored version, however, is that Babatngon and Malibago existed as separate settlements along the San Juanico strait during the 17th century and then in the process of growth, Babatngon became a municipality earlier than the other settlements."
        ],
        [
            "Another version claims that Babatngon was founded as an outpost.",
            "This version may be proven by the presence of two \"baluartes\" or watchtowers at Bijuco and Magsaigad."
        ],
        [
            "Settlement"
        ],
        [
            "Babatngon was first settled in 1540 by natives of Carigara, Catbalogan (Samar) and migrants from Bohol.",
            "The Boholanos traded mats, abacá cloths, bolos and other goods.",
            "One day, near the end of the year 1600, the Boholano traders were stranded in the present site of Babatngon because of unfavorable winds.",
            "The town at the time was covered by thick forests from the shore to the uplands with undergrowth of pandans and guava trees.",
            "Greatly in need of food, they hunted for wild animals and found wild game to be rich.",
            "Inspired by their first abundant catch, they went home and told their home folks about the rich hunting ground.",
            "Encouraged by the news and inspired by their desire to settle in fertile lands which they can call their own, many Boholanos came equipped with large traps called \"batong\" made of abacá fibers."
        ],
        [
            "From \"batong\", the place was called \"Babatngon\" - hunting ground with the use of a net.",
            "The early Spaniards called the town \"Babagnon\" but the natives changed the original name into \"Babatngon\" for easier diction."
        ],
        [
            "Colonial Period"
        ],
        [
            "The conquistadors' first concern was religion, thus it was Fr.",
            "Juan Quimbo who constructed the first church.",
            "At the turn of the century, the friars turned over the parish to the secular priests.",
            "Remembered for the contributions to the parish are:"
        ],
        [
            "Fr.",
            "Masecampo who established the first \"campo santo\" which has lived to the present; Fr.",
            "F. Langteco who reconstructed the church after it was destroyed by typhoons; Fr.",
            "A Colasito who constructed the belfry; Fr.",
            "F. Rostata who began the reconstruction of the church after the war; and finally, Fr.",
            "A. Alve to whom belongs the distinction of giving Babatngon Church the finishing touches.",
            "Fr.",
            "Alve was also responsible for constructing the first convent."
        ],
        [
            "Today there are ten religious organizations all dedicated to St. Vincent Ferrer, Babatngon's patron saint.",
            "According to a census, out of a population of 12,000 inhabitants, only 98 are non-Catholics."
        ],
        [
            "Expansion"
        ],
        [
            "The expansion of the town was sparked by the establishment of a British trading post - called \"Almacen\" in Soledad street.",
            "Soon after the trading post was organized, huge brick and adobe commercial houses were constructed across the street.",
            "The trade name of the establishment was Smith Bell."
        ],
        [
            "Immigrants from Japan, Carigara, Barugo, San Miguel and from the coastal towns of Western Samar and other countries flocked to Babatngon which had grown into a commercial district."
        ],
        [
            "Farming and fishing became the chief industries of the new and thriving town.",
            "Rice, corn, abacá and coconuts grew in abundance.",
            "The manufacture of wooden sandals (bakya) inevitably developed from the presence of an almost inexhaustible source of soft wood, the material from which sandals are patiently carved.",
            "The sandals have reached far and wide and have found a market even in Surigao."
        ],
        [
            "Revolutionary Period"
        ],
        [
            "In 1901, when the uprising rocked the entire archipelago from end to end, a band of revolucionarios led by Domingo Inbrua fought openly with the guardias civiles and caused havoc in the garrisons of Carigara and Barugo.",
            "The revolucionarios, armed with bolos and other crude weapons struck fear in the hearts of their better-trained armed adversaries."
        ],
        [
            "However, Babatngon had its share of misfortune.",
            "The stone buildings were ruined when the Spaniards made their last stand during the revolution within the town proper.",
            "No sooner had the people recovered from the devastation when another war razed the school building, the town hall, recreational centers and countless residential houses to the ground."
        ],
        [
            "WW II and Japanese Occupation"
        ],
        [
            "During the Second World War, Mayor Melchor Cañete guided the townspeople through the difficulties of food shortage and unsettled times.",
            "Mayor Cañete kept the peace in Babatngon so well during the Japanese occupation that the seat of provincial government was temporarily transferred to the town.",
            "Moreover, Many evacuees found refuge in the town from the dangers of their own municipalities."
        ],
        [
            "In 1944 to 1945, an attack by combined American and the Philippine Commonwealth troops took the town of Babatngon, Leyte."
        ],
        [
            "Today"
        ],
        [
            "Banditry created a ripple of unrest in Babatngon's history for a time.",
            "Bandit lairs in Poro, Kalangawan Island, and Toyong on Kalkagan Island hid two of the fiercest leaders of organized piracy.",
            "Punitive forces under the leadership of Capitan Cecilio Serrano raided the bandits' lair and in a hand-to-hand encounter succeeded in killing the two bandits and many of their followers.",
            "The imprisonment of the bandits and the death of their leaders disorganized the others so that again, peace came to the town."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Babatngon is politically subdivided into 25 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "In 1957, sitios Biasong, Lube, Ubayan, Calcagan, Cancamaoy, and Opong was constituted into barrio Biasong while sitio Nababoy was converted into barrio San Ricardo."
        ],
        [
            "Bacong"
        ],
        [
            "Bagong Silang"
        ],
        [
            "Biasong"
        ],
        [
            "Guintigui-an"
        ],
        [
            "Gov.",
            "E. Jaro (Bagahupi)"
        ],
        [
            "Lukay"
        ],
        [
            "Malibago"
        ],
        [
            "Magcasuang"
        ],
        [
            "Naga-asan"
        ],
        [
            "Pagsulhugon"
        ],
        [
            "Planza"
        ],
        [
            "Poblacion District I"
        ],
        [
            "Poblacion District II"
        ],
        [
            "Poblacion District III"
        ],
        [
            "Poblacion District IV"
        ],
        [
            "Rizal I"
        ],
        [
            "Rizal II"
        ],
        [
            "San Agustin"
        ],
        [
            "San Isidro"
        ],
        [
            "San Ricardo"
        ],
        [
            "Sangputan"
        ],
        [
            "Taguite"
        ],
        [
            "Uban"
        ],
        [
            "Victory"
        ],
        [
            "Villa Magsaysay"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Babatngon, Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "73(2.9)"
        ],
        [
            "56(2.2)"
        ],
        [
            "75(3.0)"
        ],
        [
            "71(2.8)"
        ],
        [
            "114(4.5)"
        ],
        [
            "174(6.9)"
        ],
        [
            "172(6.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "167(6.6)"
        ],
        [
            "161(6.3)"
        ],
        [
            "158(6.2)"
        ],
        [
            "125(4.9)"
        ],
        [
            "1,509(59.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "15.2"
        ],
        [
            "12.5"
        ],
        [
            "16.2"
        ],
        [
            "17.3"
        ],
        [
            "23.9"
        ],
        [
            "27.3"
        ],
        [
            "28.4"
        ],
        [
            "26.9"
        ],
        [
            "26.9"
        ],
        [
            "27.1"
        ],
        [
            "23.8"
        ],
        [
            "19.3"
        ],
        [
            "264.8"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BabatngonYearPop.±% p.a.1903 5,159—    1918 4,716−0.60%1939 8,000+2.55%1948 9,992+2.50%1960 11,476+1.16%1970 14,927+2.66%1975 16,316+1.80%1980 16,449+0.16%1990 17,400+0.56%1995 19,653+2.31%2000 20,946+1.38%2007 24,067+1.93%2010 25,575+2.24%2015 27,797+1.60%2020 28,823+0.72%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Babatngon, Leyte, was 28,823 people, with a density of 250 inhabitants per square kilometre or 650 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Babatngon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  38.60"
        ],
        [
            "2009  38.61"
        ],
        [
            "2012  44.10"
        ],
        [
            "2015  37.26"
        ],
        [
            "2018  33.12"
        ],
        [
            "2021  34.30"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Babatngon is known for Busay Falls, a three-tiered cataract which is an attraction for picnickers who flock to Babatngon during the summer months.",
            "A massive bowl of solid, moss-covered rock catches the cool waters of the third fall."
        ],
        [
            "Infrastructure"
        ],
        [
            "There are 11 barrios linked to the town proper with \"vecinal\" roads.",
            "These are provided with artesian wells.",
            "Barrio Bagahupi has been made a pilot barrio in the study of schistosomiasis as the area has been suspected of being positive for the parasite."
        ],
        [
            "Although some of the buildings burned down during the war have not been reconstructed, several pre-fabricated buildings have taken care of the needs of the children."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Babatngon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province:\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"An Act Creating Certain Barrios in the Municipality of Babatngon, Province of Leyte\".",
            "LawPH.com.",
            "Archived from the original on 2012-07-12.",
            "Retrieved 2011-04-12."
        ],
        [
            "^"
        ],
        [
            "\"Babatngon: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 February 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Babatngon."
        ],
        [
            "Wikivoyage has a travel guide for Babatngon."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Babatngon"
        ],
        [
            "Talalora, Samar / Santa Rita, SamarSan Juanico Strait"
        ],
        [
            "Carigara Bay"
        ],
        [
            "Babatngon"
        ],
        [
            "San Juanico Strait / Santa Rita, Samar"
        ],
        [
            "San Miguel / Tacloban"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Babatngon&oldid=1164034549\""
        ],
        [
            "Category: Municipalities of Leyte (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2013All articles needing additional referencesCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from April 2019Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}