{
    "name": "Bacnotan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bacnotan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°43′11″N 120°20′53″E﻿ / ﻿16.719689°N 120.348086°E﻿ / 16.719689; 120.348086"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in La Union, Philippines"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesBacnotanMunicipalityMunicipality of BacnotanBacnotan town center"
        ],
        [
            "FlagSealNicknames: Honey Capital of the North  Cement Capital of the NorthMap of La Union with Bacnotan highlightedOpenStreetMapBacnotanLocation within the PhilippinesCoordinates: 16°43′11″N 120°20′53″E﻿ / ﻿16.719689°N 120.348086°E﻿ / 16.719689; 120.348086CountryPhilippinesRegionIlocos RegionProvinceLa UnionDistrict"
        ],
        [
            "1st districtFounded1599Barangays47"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFrancisco Angelito L. Fontanilla • Vice MayorDivina C. Fontanilla • RepresentativePablo C. Ortega • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jane A. GonzalesEdijer F. ValmonteOlga Jane C. PaneloVirgilio C. AntolinFranklin N. AlmodovarFrancisco H. Fontanilla Jr.Federico R. CorpuzTomas Joaquin B. Ortega"
        ],
        [
            " • Electorate27,909 voters (2022)Area • Revenue₱ 236.5 million (2020) • Assets₱ 1,216 million (2020) • Expenditure₱ 201.5 million (2020) • Liabilities₱ 112.7 million (2020)Service provider • ElectricityLa Union Electric Cooperative (LUELCO)Time zoneUTC+8 (PST)ZIP code2515PSGC013303000IDD : area code +63 (0)72Native languagesIlocano TagalogWebsitewww.bacnotan.gov.ph"
        ],
        [
            "Bacnotan, officially the Municipality of Bacnotan (Ilocano: Ili ti Bacnotan; Filipino: Bayan ng Bacnotan), is a 1st class municipality in the province of La Union, Philippines.",
            "According to the 2020 census, it has a population of 44,388 people."
        ],
        [
            "Economic activities in Bacnotan mostly involve farming, fishing, bee-keeping, pebble extraction, tourism, and Portland cement manufacture.",
            "Bacnotan is the seat of the beekeeping industry in La Union.",
            "A mining engineer from Bacnotan who saw the limestone deposits in Dumarang (renamed Quirino) also saw deposits of coal and traces of gas."
        ],
        [
            "Surfing has become quite popular as well, surfers having discovered that there is a surfable break beside the Holcim Cement Factory.",
            "While there are no surfboard rentals yet, instructors from the nearby town of Urbiztondo have been known to bring their students to Bacnotan for lessons.",
            "The sand bottom causes an inconsistency in wave quality but is usually reliable for learning."
        ],
        [
            "Schools in Bacnotan include the Don Mariano Marcos Memorial State University, the North Provincial High School (now Bacnotan National High School), the Bacnotan Elementary School, other elementary schools located in various barangays, and a prep school operated by the United Church of Christ in the Philippines in Bacnotan."
        ],
        [
            "History"
        ],
        [
            "The town of Bacnotan was formally founded in 1599 as part of Ilocos Sur.",
            "In 1785, during the administration of the Governor-General Jose Basco, Bacnotan became a part of Pangasinan.",
            "When La Union was created in 1850, Bacnotan was one of the 12 towns that formed the province."
        ],
        [
            "In the past, Bacnotan was only a vast expanse of wilderness inhabited by natives with a rudimentary form of government.",
            "There was a time when it was ruled by a despotic chieftain who had absolute control over all his constituents.",
            "Disobedience to his directives meant severe flogging of the culprit.",
            "After several years under the tyrannical rule of the chieftain, the people overthrew him and flogged their chieftain to death.",
            "The word \"basnutan\" means \"flog\" in the local dialect, and become a byword among the inhabitants, hence the name of the town.",
            "During the Spanish period, the name of the town was changed from \"basnutan\" to \"Bacnotan\" as shown by documents that are still kept intact at the National Archives in Manila."
        ],
        [
            "The town's history is linked with the deeds of heroic men who fought, bled, and died for their own native land.",
            "At the turn of the century, during the Spanish–American War, Dumarang (now known as Quirino), was a scene of carnage and plunder."
        ],
        [
            "During the first days of World War II, invading Japanese forces reached Bacnotan on December 21, 1941."
        ],
        [
            "On January 4, 1945, the tides of war changed in La Union as Filipino and American soldiers captured the strategic Baroro Bridge in Bacnotan, which connects the rest of Northern Luzon to San Fernando.",
            "It was followed by the historic Battle of San Fernando and Bacsil Bridge.",
            "The victory ensured the liberation of La Union Province by joint Filipino and American troops at the end of World War II."
        ],
        [
            "After the war, Bacnotan became the provisional seat of the provincial government, since San Fernando was then in ruins.",
            "As a consequence of this transfer, the La Union National High School was also moved to Bacnotan.",
            "When things went back to normal, the provincial government was again moved to San Fernando and the La Union National High School followed afterward.",
            "The transfer of the provincial high school in Bacnotan resulted in the establishment of the North Provincial High School (now Bacnotan National High School.)"
        ],
        [
            "In 1949, the vast mineral deposits of limestone used in portland cement production were noticed in Barrio Dumarang (now Quirino) by a mining engineer who was then a municipal councilor at that time.",
            "Because of the desire to create economic activity, the municipal council, through the efforts of this mining engineer, invited potential investors to set up a Portland cement plant.",
            "Within a year, a cement plant called Cebu Portland Cement (CEPOC), was established.",
            "On May 11, 1957, CEPOC, a government-owned corporation, was sold to the privately owned Bacnotan Consolidated Industries (BCI).",
            "BCI is the manufacturer of \"Union Cement\".",
            "In 2004, BCI was sold to Holcim Cement."
        ],
        [
            "On June 18, 1960, the La Union Agricultural School was established.",
            "Nestling at the foot of the mountains of Barangay Sapilang, the agricultural school progressed and was later named Don Mariano Marcos Memorial State University.",
            "Its campus occupies an area of about 6 square kilometers."
        ],
        [
            "Geography"
        ],
        [
            "Bacnotan is bounded on the north by Balaoan, on the east by San Gabriel, on the south by San Juan, and on the west by the South China Sea."
        ],
        [
            "The western side of Bacnotan faces the South China Sea and has a long stretch of black sand beaches, indicating a large amount of magnetite.",
            "Some portions of the seashore have pebble and limestone deposits.",
            "The beaches, stretching about 16 kilometers, are suitable for fishing, boating, swimming, snorkeling, diving, and surfing."
        ],
        [
            "Although San Juan is a favorite place among serious surfers, the waves in Quirino have been discovered to be likewise excellent for surfing."
        ],
        [
            "The Baroro River, located at the southern boundary of Bacnotan, provides freshwater fishing, aquaculture farming, and recreation."
        ],
        [
            "Bacnotan is 283 kilometres (176 mi) from Metro Manila and 14 kilometres (8.7 mi) from San Fernando, the provincial capital."
        ],
        [
            "Barangays"
        ],
        [
            "Bacnotan is politically subdivided into 47 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Agtipal"
        ],
        [
            "Arosip"
        ],
        [
            "Bacqui"
        ],
        [
            "Bacsil"
        ],
        [
            "Bagutot"
        ],
        [
            "Ballogo"
        ],
        [
            "Baroro"
        ],
        [
            "Bitalag"
        ],
        [
            "Bulala"
        ],
        [
            "Burayoc"
        ],
        [
            "Bussaoit"
        ],
        [
            "Cabaroan"
        ],
        [
            "Cabarsican"
        ],
        [
            "Cabugao"
        ],
        [
            "Calautit"
        ],
        [
            "Carcarmay"
        ],
        [
            "Casiaman"
        ],
        [
            "Galongen"
        ],
        [
            "Guinabang"
        ],
        [
            "Legleg"
        ],
        [
            "Lisqueb"
        ],
        [
            "Mabanengbeng 1st"
        ],
        [
            "Mabanengbeng 2nd"
        ],
        [
            "Maragayap"
        ],
        [
            "Nangalisan"
        ],
        [
            "Nagatiran"
        ],
        [
            "Nagsaraboan"
        ],
        [
            "Nagsimbaanan"
        ],
        [
            "Narra"
        ],
        [
            "Ortega"
        ],
        [
            "Paagan"
        ],
        [
            "Pandan"
        ],
        [
            "Pang-pang"
        ],
        [
            "Poblacion"
        ],
        [
            "Quirino"
        ],
        [
            "Raois"
        ],
        [
            "Salincob"
        ],
        [
            "San Martin"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Rita"
        ],
        [
            "Sapilang"
        ],
        [
            "Sayoan"
        ],
        [
            "Sipulo"
        ],
        [
            "Tammocalao"
        ],
        [
            "Ubbog"
        ],
        [
            "Oya-oy"
        ],
        [
            "Zaragosa"
        ],
        [
            "Climate"
        ],
        [
            "The climate in Bacnotan is dry from November to May and wet from mid-May to October.",
            "The south-west monsoon brings an abundant rainfall experienced during the wet season.",
            "The relatively dry season is caused by the north-east monsoon passing over the Cordillera Mountain Range.",
            "Average temperature is 27.2 °C (81.0 °F)."
        ],
        [
            "Climate data for Bacnotan, La Union"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "42(1.7)"
        ],
        [
            "48(1.9)"
        ],
        [
            "74(2.9)"
        ],
        [
            "110(4.3)"
        ],
        [
            "269(10.6)"
        ],
        [
            "275(10.8)"
        ],
        [
            "362(14.3)"
        ],
        [
            "325(12.8)"
        ],
        [
            "330(13.0)"
        ],
        [
            "306(12.0)"
        ],
        [
            "126(5.0)"
        ],
        [
            "61(2.4)"
        ],
        [
            "2,328(91.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.2"
        ],
        [
            "12.0"
        ],
        [
            "17.1"
        ],
        [
            "21.2"
        ],
        [
            "27.1"
        ],
        [
            "26.8"
        ],
        [
            "28.1"
        ],
        [
            "27.0"
        ],
        [
            "26.0"
        ],
        [
            "24.5"
        ],
        [
            "17.7"
        ],
        [
            "12.4"
        ],
        [
            "251.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BacnotanYearPop.±% p.a.1903 8,883—    1918 11,619+1.81%1939 11,678+0.02%1948 13,793+1.87%1960 15,859+1.17%1970 21,031+2.86%1975 23,126+1.92%1980 24,800+1.41%1990 29,568+1.77%1995 32,634+1.87%2000 35,419+1.77%2007 38,743+1.24%2010 40,307+1.45%2015 42,078+0.82%2020 44,388+1.06%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Bacnotan was 44,388 people, with a density of 580 inhabitants per square kilometre or 1,500 inhabitants per square mile."
        ],
        [
            "Ilocano is the primary language spoken.",
            "English and Filipino are the languages used in government and business while English is the medium of instruction in schools."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bacnotan"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  18.60"
        ],
        [
            "2009  21.07"
        ],
        [
            "2012  8.95"
        ],
        [
            "2015  5.26"
        ],
        [
            "2018  1.46"
        ],
        [
            "2021  6.52"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Bacnotan, belonging to the first congressional district of the province of La Union, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Pablo C. Ortega"
        ],
        [
            "Mayor"
        ],
        [
            "Francisco Angelito L. Fontanilla"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Divina C. Fontanilla"
        ],
        [
            "Councilors"
        ],
        [
            "Jane A. Gonzales"
        ],
        [
            "Edijer F. Valmonte"
        ],
        [
            "Olga Jane C. Panelo"
        ],
        [
            "Virgilio C. Antolin"
        ],
        [
            "Franklin N. Almodovar"
        ],
        [
            "Francisco H. Fontanilla Jr."
        ],
        [
            "Federico R. Corpuz"
        ],
        [
            "Tomas Joaquin B. Ortega"
        ],
        [
            "Notable personalities"
        ],
        [
            "Bacnotan has produced notable personalities in various endeavors.",
            "Some of them are as follows:"
        ],
        [
            "Erlinda Fadera-Basilio — Ambassador and Permanent Representative of the Philippines to the United Nations and other International Organizations in Geneva, Switzerland; first woman Vice President of the UN Human Rights Council.",
            "Currently Philippine ambassador to China, Mongolia and North Korea."
        ],
        [
            "Fr.",
            "Bienvenido Nebres — longest-serving university president of Ateneo de Manila University"
        ],
        [
            "Gallery"
        ],
        [
            "Municipal hall"
        ],
        [
            "Town plaza"
        ],
        [
            "Town center"
        ],
        [
            "Saint Michael the Archangel Parish Church"
        ],
        [
            "Street view"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bacnotan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"24 Hours in la Union: A Mini Surf and Travel Guide\".",
            "7 July 2015."
        ],
        [
            "^"
        ],
        [
            "\"Bacnotan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of La Union\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 5, 2022."
        ],
        [
            "^ Bacnotan, PRA.gov.ph, Retrieved 17 March 2016"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Bacnotan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Bacnotan"
        ],
        [
            "Balaoan"
        ],
        [
            "Santol"
        ],
        [
            "South China Sea"
        ],
        [
            "Bacnotan"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "vteProvince of La UnionSan Fernando (capital and largest city)Municipalities"
        ],
        [
            "Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Bacnotan"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Bangar"
        ],
        [
            "Bauang"
        ],
        [
            "Burgos"
        ],
        [
            "Caba"
        ],
        [
            "Luna"
        ],
        [
            "Naguilian"
        ],
        [
            "Pugo"
        ],
        [
            "Rosario"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santol"
        ],
        [
            "Sudipen"
        ],
        [
            "Tubao"
        ],
        [
            "Component city"
        ],
        [
            "San Fernando"
        ],
        [
            "BarangaysSee: List of barangays in La Union"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bacnotan&oldid=1213559306\""
        ],
        [
            "Category: Municipalities of La UnionHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}