{
    "name": "Bacolor",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bacolor"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°59′54″N 120°39′10″E﻿ / ﻿14.998428°N 120.65265°E﻿ / 14.998428; 120.65265"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pampanga, Philippines"
        ],
        [
            "Not to be confused with Bacolod or Bacoor."
        ],
        [
            "Municipality in Central Luzon, PhilippinesBacolorMunicipalityMunicipality of BacolorThe half-buried San Guillermo Parish Church"
        ],
        [
            "FlagSealEtymology: Level groundNickname: Athens of PampangaMotto: \"Non Plus Ultra\""
        ],
        [
            "(English: \"No Further Beyond\")Map of Pampanga with Bacolor highlightedOpenStreetMapBacolorLocation within the PhilippinesCoordinates: 14°59′54″N 120°39′10″E﻿ / ﻿14.998428°N 120.65265°E﻿ / 14.998428; 120.65265CountryPhilippinesRegionCentral LuzonProvincePampangaDistrict"
        ],
        [
            "3rd districtFoundedOctober 8, 1762Barangays21"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEduardo \"Diman\" G. Datu • Vice MayorRon Earvin E. Dungca • RepresentativeAurelio D. Gonzales Jr. • Councilors"
        ],
        [
            "List"
        ],
        [
            "Darwin M. AngelesJo Derek P. HizonAiza Mae K. CunananJoel D. SamiaRenz Louie M. CanlasCynthia G. DavidEfren S. BlancoCarlito T. Laxa"
        ],
        [
            " • Electorate49,843 voters (2022)Area • Revenue₱ 240.8 million (2020) • Assets₱ 505.4 million (2020) • Expenditure₱ 155.5 million (2020) • Liabilities₱ 192.6 million (2020)Service provider • ElectricityPampanga 2 Electric Cooperative (PELCO 2)Time zoneUTC+8 (PST)ZIP code2001PSGC035404000IDD : area code +63 (0)45Native languagesKapampangan TagalogWebsitewww.bacolorpampanga.gov.ph"
        ],
        [
            "Bacolor, officially the Municipality of Bacolor (Kapampangan: Balen ning Bakúlud; Tagalog: Bayan ng Bacolor), is a 3rd class municipality in the province of Pampanga, Philippines.",
            "According to the 2020 census, it has a population of 48,066 people."
        ],
        [
            "Bacolor is the birthplace of Father Anselmo Jorge de Fajardo, considered the \"Father of Kapampangan literature\" for writing the 1831 Kapampangan \"kumidya\" Don Gonzalo de Cordova."
        ],
        [
            "History"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Historical records show that Bacolor has been in existence as a proposed settlement as early as 1571, the same year Manila was founded by the Spanish.",
            "The original name of the settlement was Bakúlud, which became Hispanicized as \"Bacolor\" (cf.",
            "Bacolod and Bacoor).",
            "The original name is Kapampangan for \"high level rocky place\" or \"plateau.\""
        ],
        [
            "Bacolor officially became the capital of Pampanga in 1755.",
            "According to Spanish chronicler Fray Gaspar de San Agustin, before 1755, Mexico town “es la corte de Pampanga,” while Bacolor “es la capital” and Guagua “es igualmente.” Historian Dr. Luciano Santiago theorizes that"
        ],
        [
            "before Bacolor was formally recognized as provincial capital, it was already informally functioning as capital although other provincial administrative offices were elsewhere in Mexico and Guagua."
        ],
        [
            "Monument to Simón de Anda y Salazar in Bacolor"
        ],
        [
            "During the British occupation of Manila, when Manila fell to the British, it became capital of the exiled government of Governor General Simón de Anda y Salazar from October 6, 1762, to May 30, 1764.",
            "The provincial offices were temporarily moved to Factoría (now San Isidro, Nueva Ecija).",
            "Through a decree of the King of Spain on November 9, 1765, Bacolor became Villa de Bacólor, one of the only three villas in the Philippines and was granted a special coat of arms.",
            "Simón de Anda organized an army of natives for the defense of Bacolor and with the aim of recapturing Manila."
        ],
        [
            "American invasion era"
        ],
        [
            "Bacolor remained the capital of Pampanga until the provincial seat of government was transferred to neighboring San Fernando in 1904.",
            "Moves to transfer the provincial capital to San Fernando actually began as early as 1852 with an expediente from the alcalde mayor.",
            "The King of Spain granted the request in a real cedula dated September 11, 1881."
        ],
        [
            "The coming of the American colonizers broke up the military form of government and instead political and economic reforms were introduced.",
            "A civil form of government was organized and was inaugurated on February 13, 1901, by Com.",
            "William H. Taft which took place in the old Escuela de Artes y Oficios de Bacólor, later known as the Pampanga School of Arts and Trade and now the Don Honorio Ventura State University, the first state university in Pampanga."
        ],
        [
            "The first provincial Civil Governor was Don Ceferino Joven and the first Municipal President of Bacolor was Don Estanislao Santos.",
            "Pampanga was acknowledged as the first province to have organized civil government in the Philippines by General Grant, the then President of the United States of America."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "When the Second World War broke out, Japanese fighter and bomber planes invaded the municipal town in Bacolor in December 1941 until the town was occupied by the Imperial Japanese forces in 1942.",
            "Pampangan guerrillas and Hukbalahap Communist groups joined in an insurgency centered around the municipality of Bacolor, supported by local soldiers and military officers of the Philippine Commonwealth Army.",
            "Their attacks against the Japanese occupation continued until 1945, when Filipino and American forces liberated the municipality of Bacolor."
        ],
        [
            "Philippine independence"
        ],
        [
            "In 1956, the sitio of Mesalipit was converted into a barrio."
        ],
        [
            "Due to the eruption of Mount Pinatubo on June 15, 1991, the municipality was hit by lahar flows from 1991 to 1995 which buried the town by 20 feet (6.1 m), killing hundreds of people and destroying livelihood.",
            "18 out of the 21 barangays of Bacolor were buried.",
            "The lahar from Mount Pinatubo raised the town to its current level of an approximate 37 meters above sea level.",
            "Subsidence caused the constant reclaiming of parts of Pampanga by the sea."
        ],
        [
            "Geography"
        ],
        [
            "Bacolor is 9 kilometres (5.6 mi) from San Fernando, 26 kilometres (16 mi) from Angeles, and 75 kilometres (47 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Bacolor is politically subdivided into 21 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Balas"
        ],
        [
            "Cabalantian"
        ],
        [
            "Cabambangan (Poblacion)"
        ],
        [
            "Cabetican"
        ],
        [
            "Calibutbut"
        ],
        [
            "Concepcion"
        ],
        [
            "Dolores"
        ],
        [
            "Duat"
        ],
        [
            "Macabacle"
        ],
        [
            "Magliman"
        ],
        [
            "Maliwalu"
        ],
        [
            "Mesalipit"
        ],
        [
            "Parulog"
        ],
        [
            "Potrero"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Ines"
        ],
        [
            "Talba"
        ],
        [
            "Tinajero"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bacolor, Pampanga"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "8(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "15(0.6)"
        ],
        [
            "34(1.3)"
        ],
        [
            "138(5.4)"
        ],
        [
            "203(8.0)"
        ],
        [
            "242(9.5)"
        ],
        [
            "233(9.2)"
        ],
        [
            "201(7.9)"
        ],
        [
            "126(5.0)"
        ],
        [
            "50(2.0)"
        ],
        [
            "21(0.8)"
        ],
        [
            "1,280(50.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.7"
        ],
        [
            "4.1"
        ],
        [
            "6.5"
        ],
        [
            "11.2"
        ],
        [
            "21.2"
        ],
        [
            "24.9"
        ],
        [
            "27.7"
        ],
        [
            "26.5"
        ],
        [
            "25.5"
        ],
        [
            "21.8"
        ],
        [
            "12.6"
        ],
        [
            "5.6"
        ],
        [
            "191.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BacolorYearPop.±% p.a.1903 13,493—    1918 15,302+0.84%1939 19,129+1.07%1948 22,920+2.03%1960 29,634+2.16%1970 40,212+3.10%1975 46,044+2.75%1980 50,942+2.04%YearPop.±% p.a.1990 67,259+2.82%1995 13,097−26.40%2000 16,147+4.59%2007 25,238+6.35%2010 31,508+8.41%2015 39,460+4.38%2020 48,066+3.96%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Bacolor, Pampanga, was 48,066 people, with a density of 670 inhabitants per square kilometre or 1,700 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bacolor"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "9"
        ],
        [
            "10"
        ],
        [
            "2006  5.50"
        ],
        [
            "2009  6.23"
        ],
        [
            "2012  4.36"
        ],
        [
            "2015  9.39"
        ],
        [
            "2018  3.63"
        ],
        [
            "2021  6.48"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Façade of the town hall"
        ],
        [
            "Like other towns in the Philippines, Bacolor is governed by a mayor and vice mayor who are elected to three-year terms.",
            "The mayor is the executive head and leads the town's departments in executing the ordinances and improving public services.",
            "The vice mayor heads a legislative council (Sangguniang Bayan) consisting of councilors from the barangays or barrios."
        ],
        [
            "Town hall"
        ],
        [
            "The municipal building is the former site of the Venturas house, one of Bacolor's most prominent families.",
            "On July 8, 1953, the new town hall was completed during the tenure of Mayor Manuel de Jesus.",
            "Its construction was a project of Senator Pablo Ángeles y David, a native of Bacolor."
        ],
        [
            "Tourism"
        ],
        [
            "Welcome arch"
        ],
        [
            "The main landmark of the town is the San Guillermo Parish Church known as the 'sunken church', one of the structures that was half-buried by the lava flow from the eruption of Mount Pinatubo in 1991.",
            "The church has since been renovated and is currently operational and may be accessed through what were once the second floor windows, now converted into doorways.",
            "The sunken church and town of Bacolor served as the main production location of the 2009–2010 ABS-CBN religious-oriented primetime television series May Bukas Pa from January 15, 2009, to February 5, 2010.",
            "The municipality also made an appearance in various films such as the 1996 movie Istokwa, 2006 movie Summer Heat and 2008 movie Jay, and in the music video of the song Promise Me by J Brothers.",
            "The Shrine of Our Lady of Lourdes in Cabetican is also famous for its annual pilgrimage and barrio fiestas."
        ],
        [
            "Other notable landmarks in Bacolor include Memorial Kilometer Posts of the Bataan Death March along the MacArthur Highway; the oldest trade school in Far East, the Don Honorio Ventura Technological State University; the Simón de Anda y Salazar monument at the town hall; monument to the Kapampangan writer and revolutionary leader Juan Crisostomo Soto (1867–1918); and Monument to Felix Galura Y Napao."
        ],
        [
            "Bacolor's festivals are the Feast of San Guillermo and Nuestra Senora del Santissimo Rosario (La Naval) which are celebrated every 10th day of February and 3rd Sunday of November, respectively."
        ],
        [
            "The Sunken Shrine"
        ],
        [
            "Original Archdiocesan Shrine of Our Lady of Lourdes (the Sunken Shrine is to the right, not in photo)."
        ],
        [
            "Buried by the devastating lahar flows of Mount Pinatubo eruption in June 1991, the Archdiocesan Shrine of Our Lady of Lourdes of Cabetican (abbreviated as \"Maluca\") remains at the center of Marian Concordia Pilgrimages and Healing in Pampanga.",
            "Originally built as an annexe to the older, smaller shrine, it is under the care of Fr.",
            "Ronnie Cao, Healing Priest and Rector of the Archdiocesan Shrine."
        ],
        [
            "Notable personalities"
        ],
        [
            "Mamerto Natividad, Filipino military leader"
        ],
        [
            "Pablo Ángeles y David, was a Filipino magistrate and statesman.",
            "During his career, he became a judge, a member of the Philippine House of Representatives, Governor of Pampanga and a member of the Senate of the Philippines."
        ],
        [
            "Francisco Tongio Liongson, former Senator of the Philippines"
        ],
        [
            "Francisco Alonso Liongson, the son of Francisco Tongio Liongson"
        ],
        [
            "Pedro Tongio Liongson, Filipino lawyer and member of the Malolos Congress"
        ],
        [
            "Práxedes Fajardo, Filipina revolutionary"
        ],
        [
            "Jayson Castro, is a Filipino professional basketball player currently playing in the Philippine Basketball Association."
        ],
        [
            "Zoilo Galang, Filipino writer from Pampanga"
        ],
        [
            "Jordan Clarkson, Filipino-American professional basketball player"
        ],
        [
            "References"
        ],
        [
            "^ Baluyut, Joelyn G. (October 10, 2012).",
            "\"Bacolor celebrates 250th anniversary with unveiling of statue of Spanish official\".",
            "PIA Gitnang Luzon.",
            "Retrieved December 4, 2022."
        ],
        [
            "^  Municipality of Bacolor |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Santiago, Luciano (2002).",
            "Laying the Foundations: Kapampangan Pioneers in the Philippine Church, 1592-2001.",
            "Angeles City: The Juan D. Nepomuceno Center for Kapampangan Studies.",
            "ISBN 971-92417-1-3.",
            "Retrieved October 14, 2019."
        ],
        [
            "^ Forman, Michael Lawrence (2019).",
            "Kapampangan Dictionary.",
            "University of Hawaii Press.",
            "p. 20.",
            "ISBN 9780824881122."
        ],
        [
            "^ \"Tantingco, Robby P. The Moveable Capital of Pampanga.",
            "Singsing, Vol.",
            "4 No.",
            "1\" (PDF).",
            "Center for Kapampangan Studies."
        ],
        [
            "^ Orejas, Tonette (November 18, 2016).",
            "\"Pampanga town that survived Mt.",
            "Pinatubo reclaims Spanish name and seal\".",
            "Philippine Daily Inquirer.",
            "Retrieved July 24, 2023."
        ],
        [
            "^ \"Henares, Ivan Anthony.",
            "1881-1904: How San Fernando Became Capital of Pampanga.",
            "Singsing, Vol.",
            "4 No.",
            "1\" (PDF).",
            "Center for Kapampangan Studies."
        ],
        [
            "^ \"Henares, Ivan Anthony.",
            "Timeline of San Fernando History.",
            "Singsing, Vol.",
            "4 No.",
            "1\" (PDF).",
            "Center for Kapampangan Studies."
        ],
        [
            "^ \"An Act Creating the Barrio of Mesalipit in the Municipality of Bacolor, Province of Pampanga\".",
            "LawPH.com.",
            "Archived from the original on July 19, 2012.",
            "Retrieved April 12, 2011."
        ],
        [
            "^"
        ],
        [
            "\"Bacolor: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 5, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Pampanga\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Municipal building\".",
            "Baculud.com.",
            "Archived from the original on January 17, 2013.",
            "Retrieved December 12, 2012."
        ],
        [
            "^ \"Historical sites\".",
            "Baculud.com.",
            "Archived from the original on January 17, 2013.",
            "Retrieved December 12, 2012."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Bacolor."
        ],
        [
            "Bacolor Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Bacolor"
        ],
        [
            "Angeles City"
        ],
        [
            "PoracSanta Rita"
        ],
        [
            "Bacolor"
        ],
        [
            "San Fernando"
        ],
        [
            "Guagua"
        ],
        [
            "Minalin"
        ],
        [
            "Santo Tomas"
        ],
        [
            "vte Province of PampangaSan Fernando (capital)  Angeles City (largest city)Municipalities"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Candaba"
        ],
        [
            "Floridablanca"
        ],
        [
            "Guagua"
        ],
        [
            "Lubao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Masantol"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Porac"
        ],
        [
            "San Luis"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Component cities"
        ],
        [
            "Mabalacat"
        ],
        [
            "San Fernando"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Angeles (Administratively independent from the province but grouped under Pampanga by the Philippine Statistics Authority.)"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bacolor&oldid=1220111310\""
        ],
        [
            "Categories: Municipalities of PampangaFormer national capitalsFormer provincial capitals of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Kapampangan-language textArticles containing Tagalog-language textWikipedia articles needing clarification from January 2018Commons category link is on WikidataArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}