{
    "name": "Baco",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Baco, Oriental Mindoro"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°21′30″N 121°05′52″E﻿ / ﻿13.358394°N 121.097664°E﻿ / 13.358394; 121.097664"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality of the Philippines in the province of Oriental Mindoro"
        ],
        [
            "Municipality in Mimaropa, PhilippinesMunicipality of BacoMunicipalityMunicipal Compound Gate"
        ],
        [
            "FlagSealMap of Oriental Mindoro with Baco highlightedOpenStreetMapMunicipality of BacoLocation within the PhilippinesCoordinates: 13°21′30″N 121°05′52″E﻿ / ﻿13.358394°N 121.097664°E﻿ / 13.358394; 121.097664CountryPhilippinesRegionMimaropaProvinceOriental MindoroDistrict"
        ],
        [
            "1st districtBarangays27"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 169.6 million (2020) • Assets₱ 338.6 million (2020) • Expenditure₱ 163.8 million (2020) • Liabilities₱ 40.1 million (2020)Service provider • ElectricityOriental Mindoro Electric Cooperative (ORMECO)Time zoneUTC+8 (PST)ZIP code5201PSGC175201000IDD : area code +63 (0)43Native languagesTagalog"
        ],
        [
            "Baco, officially the Municipality of Baco (Tagalog: Bayan ng Baco),  is a 3rd class municipality in the province of Oriental Mindoro, Philippines.",
            "According to the 2020 census, it has a population of 39,817 people."
        ],
        [
            "History"
        ],
        [
            "The name “Baco” of the municipality rooted from two different Filipino words.",
            "The first is its origin from the word, “paco”, an edible fern reported to be abundant in the municipality.",
            "Its second origin, as told from folk stories by the elders, was from the word “baku-bako”, which means rough road.",
            "It used to describe the municipality for its road potholes due to frequent flooding calamities.",
            "Folk stories would claim that heavy rains would last in a span of three to four days."
        ],
        [
            "Folktales"
        ],
        [
            "Baco is frequently affected by heavy rains and floods.",
            "There are several existing folktales to explain the frequent occurrence of floods in the municipality.",
            "One folktale consists of an old man who was denied of his request for water to drink.",
            "There was once a story of an area in Baco wherein an old thirsty man roamed looking for drinking water.",
            "He continually begged for water however no one came to his assistance to relieve him of his thirst.",
            "He was denied and instead chased him away.",
            "As he was about to leave, he cursed the locals saying, “You will be having water abundantly.” As time continued to pass, Baco has been a frequent catch basin of heavy rainfalls."
        ],
        [
            "Another famous folktale of the municipality is about the early church of Baco and a priest who cursed the town.",
            "After the church was established, a Moro named Magyawi arrived.",
            "The convent was his residence and asked the priest to officiate masses only whenever he was around.",
            "Magyawi decided one day to go for hunting.",
            "As Magyawi enjoyed hunting for wild animals, his stay in the forest was extended.",
            "Due to this, the priest grew weary of waiting for Magyawi and decided on his own will to officiate the mass without him.",
            "On the arrival of Magyawi, he was furious with the violation of the priest.",
            "He then tied up the priest and placed him inside the crate.",
            "The missionary was confined without food.",
            "Unsatisfied with this punishment, Magyawi tied a big bell to the crate and threw it into the river.",
            "However, before being thrown into the river, the priest vowed and said, “This town will never prosper unless one natural born Bacoeño becomes a priest.”"
        ],
        [
            "First Capital of Oriental Mindoro"
        ],
        [
            "In a story told by anthropologist and missionary, Rev.",
            "Antoon Postma, the first parochial church in Oriental Mindoro was established in Baco in the year 1567.",
            "Due to this, it was declared the first official capital of Oriental Mindoro in 1575.",
            "Baco was considered the cabecera town.",
            "However, when Corregidor Joseph de Chavez became Governor of Oriental Mindoro in the year 1678, Calapan was declared the new capital of the province."
        ],
        [
            "Spanish Colonization"
        ],
        [
            "As early as 1692, Baco had been the first to be under the Spanish mission, claiming it to be the oldest town in Mindoro.",
            "The Spanish regime began as Spanish friars settled along the shore of Tabon Tabon.",
            "Transferring to San Andres soon thereafter and were forced to relocate to Lumang Bayan due to the constant depredation of Muslim Pirates in the area.",
            "In Lumang Bayan, the first Gomahan Church was established.",
            "However, several years later in 1733, it was transferred to Calapan foreboding the first ecclesiastical jurisdiction over Mindoro."
        ],
        [
            "Spanish Revolution"
        ],
        [
            "From years 1896 to 1900, the barrio captains of Baco were namely Juan Aceveda Sr., Pedro Quiambao, Quintin Villar, Gonzalo Aceveda, Bartolome Garcia and Cerbulo Leuterio.",
            "Honorary officials shifted from barrio captains to municipal presidents thereafter.",
            "The declared presidents of Baco were Benito R. Villar, Herminigildo Atienza, Jose Samaco, Jose Lopez, Juan Aceveda, Braulio Aceveda, Froilan Aceveda and Paterno Sanchez.",
            "During the Spanish revolution in the year 1898, the locals of Baco under the leadership of Captain Cervulo Leuterio joined the uprising.",
            "In the succeeding years 1899 to 1901, they subsequently joined the Americans."
        ],
        [
            "Baco was under the jurisdiction of Calapan by the virtue of Act 1824 in the year 1902.",
            "Under the Act 3498, Baco regained its jurisdiction as a distinct municipality upon the representation of Mariano Leuterio, a legislative representative of Oriental Mindoro."
        ],
        [
            "Foundation Day"
        ],
        [
            "The foundation day of Baco is being commemorated every 25th of January.",
            "Based on Executive Order No.",
            "4 signed in Manila on January 25, 1921, by Francis Burton Harrison, Governor General of Philippine Islands, with the approval of the Chief Executive Bureau concurred by the Secretary of the Interior, Baco was recognized as a distinct municipality from Calapan.",
            "In addition to this is its accordance with article Six Chapter 64 of the Administrative Code of 1917 elaborated on the barrio of Baco and its separation from the Municipality of Calapan.",
            "It was organized as an independent district in Poblacion.",
            "The town proper was transferred to Alag in the year 1945.",
            "Later, it was transferred to San Andres.",
            "However, San Andres continued to be affected by soil erosion which forced people to relocate the town to the lot donated by Mr. Catalino Calderon.",
            "The town fiesta is being celebrated every 19th of March in honor of the municipal patron, Saint Joseph, Patron of the Worker."
        ],
        [
            "Geography"
        ],
        [
            "Baco, Oriental Mindoro is a third-class municipality situated in the northern part of Oriental Mindoro approximately 120.93° East to 13.49° North and 121.19° West to 13.14° South.",
            "It is bounded by Subaan Bay in the North, Municipality of San Teodoro on the West, City of Calapan on the East, and Municipality of Santa Cruz, Occidental Mindoro on the South.",
            "The Municipality of Baco is a fifteen-minute drive away from the City of Calapan by land."
        ],
        [
            "The municipality of Baco is composed of 27 barangays with a total land area of 31,126.023 hectares.",
            "The three largest barangays are San Ignacio, Lantuyang, and Bayanan which cover 22.75 percent, 22.40 percent, and 22.12 percent of the total land area, respectively.",
            "These barangays comprise most of the forestland area of the municipality.",
            "The smallest barangay with only 0.26 percent of the total land area of the municipality is Pulang Tubig."
        ],
        [
            "Topography"
        ],
        [
            "Elevation"
        ],
        [
            "Majority of the barangays of the municipality are in lowland areas or below 500 meters above sea level (MASL) and cover 41.88 percent of the total land area (13,035.58 ha).",
            "The three largest barangays, which cover most of the forestland, have an elevation that ranges from 500-1,000 and greater than 1,000 meters above sea level.",
            "Moreover, Mount Halcon, which is found in Bayanan and Lantuyang, has the highest elevation in the entire province of Oriental Mindoro with an estimated height of 2,590 meters above sea level."
        ],
        [
            "Slope"
        ],
        [
            "The slope of the municipality varies from 0 percent to 278 percent and there are six slope ranges identified in the Municipality of Baco.",
            "The zero to three percent slope category which is described as flat is found in lowlands, beach ridges, wetlands, broad and narrow alluvial plains, valleys and river terraces.",
            "Areas under this slope category have minimal land limitations wherein agricultural and other economic activities are done."
        ],
        [
            "The slope category of three to eight percent, level to undulating areas, is found in residual terraces wherein fruit-bearing trees and terraced rice paddies are located.",
            "Slight land limitations such as soil erosion may be present in these areas."
        ],
        [
            "There is a total area of 8,436.19 hectares under the zero to eight percent slope category in the municipality.",
            "These areas can be planted with a variety of lowland crops and are suitable for the development of commercial areas."
        ],
        [
            "For the slope category of eight to 18 percent, undulating to rolling slope areas is suitable for the cultivation of fruit-bearing trees and other perennial high value commercial crops.",
            "Baco has total land area of 1,899.21 hectares under this category.",
            "Limitations and constraints are present in these areas.",
            "Thus, utilizing these lands requires slight to moderate land development costs."
        ],
        [
            "Meanwhile, 18 to 30 percent slope is categorized as rolling to moderately steep hills, and 30 to 50 percent, moderately to steeply mountainous, are found in the hilly and mountainous area of the municipality and have a combined land area of 10,444.32 hectares.",
            "Soil erosion is common in these areas."
        ],
        [
            "More than 50 percent, very steeply mountainous, are in rugged terrain of hilly and mountainous region of the municipality and has a total land area of 10,346.31 hectares.",
            "Severe land limitations are present in this slope range."
        ],
        [
            "Barangay Pulantubig, San Andres, Pambisan, Putican Cabulo, Malapad, Tabon-Tabon, Catwiran I, Catwiran II, Poblacion, Alag, and Dulangan I have a slope range of zero to 18 percent.",
            "Barangay Tagumpay and Dulangan II have a slope range that varies from zero to 50 percent while barangay Water, Lumangbayan, Santa Cruz, Burbuli, Santa Rosa I, Santa Rosa II, Mangangan I, Mangangan II, Mayabig, Baras, Bangkatan, and San Ignacio have a slope range that varies from zero to 50 percent.",
            "Barangay Lantuyang and Bayanan have a slope range of 18 to 50 percent."
        ],
        [
            "Overall, 20,790.63 hectares or more than half of the total land area of the municipality have a slope of 18 percent and above making the municipality more susceptible to soil erosion, rain-induced landslide, and excessive water run-off.",
            "Future plans of the municipality should consider the topographical characteristics in the selection of the locations of future investments.",
            "Most infrastructure investments in mountainous barangays are highly susceptible to landslide given its topographical location.",
            "Thus, this should be taken into consideration accompanied with the assessment of susceptible barangays to landslide."
        ],
        [
            "Tourism"
        ],
        [
            "Mount Halcon, as one of the tourist sites in Baco, covers the largest area and pegged to be one of the “best hiking destination” in the country as stated in their promotional materials.",
            "All timberlands in the country are owned by the national government and so does Mt.",
            "Halcon.",
            "However, it does not offer any accommodation facilities at present (year 2018), however the hikers are accommodated in the evacuation center at Barangay Bayanan.",
            "In the area of barangay Lantuyang on the other hand, the climbers sometimes set up tents for days and nights prior to climbing up the mountain.",
            "Other houses in Lantuyang allow the hikers to stay with them when they are still waiting for the go-signal to climb.",
            "In exchange, some climbers have goods (i.e.",
            "school supplies, clothes, groceries) that they brought with them which they give to the host community.",
            "Bayanan and Lantuyang are the gateway barangays for the climbers of Mount Halcon."
        ],
        [
            "Barangays"
        ],
        [
            "Alag"
        ],
        [
            "Bangkatan"
        ],
        [
            "Baras (Mangyan Minority)"
        ],
        [
            "Bayanan"
        ],
        [
            "Burbuli"
        ],
        [
            "Catwiran I"
        ],
        [
            "Catwiran II"
        ],
        [
            "Dulangan I"
        ],
        [
            "Dulangan II"
        ],
        [
            "Lantuyang (Mangyan Minority)"
        ],
        [
            "Lumang Bayan"
        ],
        [
            "Malapad"
        ],
        [
            "Mangangan I"
        ],
        [
            "Mangangan II"
        ],
        [
            "Mayabig"
        ],
        [
            "Pambisan"
        ],
        [
            "Poblacion"
        ],
        [
            "Pulang-Tubig"
        ],
        [
            "Putican-Cabulo"
        ],
        [
            "San Andres"
        ],
        [
            "San Ignacio (Dulangan)"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Rosa I"
        ],
        [
            "Santa Rosa II"
        ],
        [
            "Tabon-tabon"
        ],
        [
            "Tagumpay"
        ],
        [
            "Water"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Baco, Oriental Mindoro"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "48(1.9)"
        ],
        [
            "32(1.3)"
        ],
        [
            "41(1.6)"
        ],
        [
            "54(2.1)"
        ],
        [
            "257(10.1)"
        ],
        [
            "410(16.1)"
        ],
        [
            "466(18.3)"
        ],
        [
            "422(16.6)"
        ],
        [
            "429(16.9)"
        ],
        [
            "300(11.8)"
        ],
        [
            "137(5.4)"
        ],
        [
            "92(3.6)"
        ],
        [
            "2,688(105.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.8"
        ],
        [
            "8.0"
        ],
        [
            "9.8"
        ],
        [
            "11.7"
        ],
        [
            "23.1"
        ],
        [
            "27.5"
        ],
        [
            "29.2"
        ],
        [
            "28.7"
        ],
        [
            "28.7"
        ],
        [
            "25.5"
        ],
        [
            "18.2"
        ],
        [
            "12.8"
        ],
        [
            "234"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BacoYearPop.±% p.a.1939 5,111—    1948 5,751+1.32%1960 10,213+4.90%1970 13,687+2.97%1975 15,738+2.84%1980 18,607+3.40%1990 23,800+2.49%1995 25,915+1.61%2000 30,167+3.31%2007 34,127+1.72%2010 35,060+0.99%2015 37,215+1.14%2020 39,817+1.34%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Baco"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  57.20"
        ],
        [
            "2009  44.47"
        ],
        [
            "2012  22.76"
        ],
        [
            "2015  25.31"
        ],
        [
            "2018  16.82"
        ],
        [
            "2021  34.45"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Baco |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Baco: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 27 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Oriental Mindoro\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Baco Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Baco, Oriental Mindoro"
        ],
        [
            "Isla Verde Passage"
        ],
        [
            "San Teodoro"
        ],
        [
            "Baco"
        ],
        [
            "CalapanNaujan"
        ],
        [
            "Santa Cruz, Occidental Mindoro"
        ],
        [
            "Sablayan, Occidental Mindoro"
        ],
        [
            "vte Province of Oriental MindoroCalapan (capital and largest city)Municipalities"
        ],
        [
            "Baco"
        ],
        [
            "Bansud"
        ],
        [
            "Bongabong"
        ],
        [
            "Bulalacao"
        ],
        [
            "Gloria"
        ],
        [
            "Mansalay"
        ],
        [
            "Naujan"
        ],
        [
            "Pinamalayan"
        ],
        [
            "Pola"
        ],
        [
            "Puerto Galera"
        ],
        [
            "Roxas"
        ],
        [
            "San Teodoro"
        ],
        [
            "Socorro"
        ],
        [
            "Victoria"
        ],
        [
            "Component city"
        ],
        [
            "Calapan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Baco,_Oriental_Mindoro&oldid=1224305855\""
        ],
        [
            "Category: Municipalities of Oriental MindoroHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description matches WikidataShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}