{
    "name": "Badoc",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Badoc"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsРусскийSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°55′36″N 120°28′31″E﻿ / ﻿17.926711°N 120.475369°E﻿ / 17.926711; 120.475369"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Norte, Philippines"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesBadocMunicipalityMunicipality of BadocJuan Luna Shrine"
        ],
        [
            "FlagSealMap of Ilocos Norte with Badoc highlightedOpenStreetMapBadocLocation within the PhilippinesCoordinates: 17°55′36″N 120°28′31″E﻿ / ﻿17.926711°N 120.475369°E﻿ / 17.926711; 120.475369CountryPhilippinesRegionIlocos RegionProvinceIlocos NorteDistrict"
        ],
        [
            "2nd districtBarangays31"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMaximo D. Cajigal • Vice MayorAlwyn G. Rubio • RepresentativeEugenio Angelo M. Barba • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Romnick James M. TorralbaJayson G. RubioDivina Gracia B. dela CruzCielito B. LacuestaJonathan O. TorralbaZenaida A. IdnayRichard G. CajigalEfren Y. Calonge"
        ],
        [
            " • Electorate22,194 voters (2022)Area • Revenue₱ 133.2 million (2020) • Assets₱ 849.1 million (2020) • Expenditure₱ 119.9 million (2020) • Liabilities₱ 129.4 million (2020)Service provider • ElectricityIlocos Norte Electric Cooperative (INEC)Time zoneUTC+8 (PST)ZIP code2904PSGC012803000IDD : area code +63 (0)77Native languagesIlocano TagalogWebsitewww.badoc.gov.ph"
        ],
        [
            "Badoc, officially the Municipality of Badoc (Ilocano: Ili ti Badoc; Tagalog: Bayan ng Badoc), is a 3rd class municipality in the province of Ilocos Norte, Philippines.",
            "According to the 2020 census, it has a population of 32,530 people."
        ],
        [
            "It is the birthplace of Filipino painter, Juan Luna.",
            "The tourist spots in this town are Luna Shrine, Luna Park, Badoc Island, Badoc Church and La Virgen Milagrosa Shrine, and the beautiful beaches of La Virgen Migrosa, Gabut Norte, Pagsanahan, Aring and Saud."
        ],
        [
            "Etymology"
        ],
        [
            "The derivation of the town's name is a strange tale.",
            "In 1572, during the intensive Christianization of the Ilocos Regime, a boatload of Spanish missionaries and soldiers topped at the mouth of the Badoc River to establish camp in the area which is now the town proper.",
            "It was the only cleared site of which portion was occupied by fifteen families of natives known as the Isneg.",
            "Around the settlement was a thick growth of tall flowering reed plants called bado-badoc (phleumpratense).",
            "Seeing some fishermen lingering at a distance, the Spaniards walked up to them to inquire about the name of the place pointing to the spot which they thought was a settlement.",
            "The men, not being able to understand what was asked to them, simply thought that the Spaniards wanted to know the name of the plant around the area and thus the answered: 'bado-badoc'.",
            "The leader of the expedition recorded the word, hence the town was called Badoc."
        ],
        [
            "Geography"
        ],
        [
            "Badoc is 448 kilometres (278 mi) from Metro Manila and 39 kilometres (24 mi) from Laoag City, the provincial capital.",
            "It is also the westernmost municipality in Ilocos Norte."
        ],
        [
            "Barangays"
        ],
        [
            "Badoc is politically subdivided into 31 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alay-Nangbabaan (Alay 15-B) (15-B)"
        ],
        [
            "Alogoog (3)"
        ],
        [
            "Ar-arusip (13-A)"
        ],
        [
            "Aring (4-B)"
        ],
        [
            "Balbaldez (15-A)"
        ],
        [
            "Bato (13-B)"
        ],
        [
            "Camanga (16-B)"
        ],
        [
            "Canaan (Poblacion) (1)"
        ],
        [
            "Caraitan (8)"
        ],
        [
            "Gabut Norte (20-A)"
        ],
        [
            "Gabut Sur (20-B)"
        ],
        [
            "Garreta (Poblacion) (2)"
        ],
        [
            "La Virgen Milagrosa (Paguetpet) (6-B)"
        ],
        [
            "Labut (11)"
        ],
        [
            "Lacuben (21)"
        ],
        [
            "Lubigan (10)"
        ],
        [
            "Mabusag Norte (18-A)"
        ],
        [
            "Mabusag Sur (18-B)"
        ],
        [
            "Madupayas (16-A) (Sitio Malasin, Palacapac, Surgagao, Amianan)"
        ],
        [
            "Morong (6-A)"
        ],
        [
            "Nagrebcan (14)"
        ],
        [
            "Napu (19)"
        ],
        [
            "Pagsanahan Norte (5-A)"
        ],
        [
            "Pagsanahan Sur (5-B)"
        ],
        [
            "Paltit (9)"
        ],
        [
            "Parang (17-A)"
        ],
        [
            "Pasuc (17-B)"
        ],
        [
            "Santa Cruz Norte (7-A)"
        ],
        [
            "Santa Cruz Sur (7-B)"
        ],
        [
            "Saud (4-A)"
        ],
        [
            "Turod (12)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Badoc, Ilocos Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "19(66)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "9(0.4)"
        ],
        [
            "11(0.4)"
        ],
        [
            "13(0.5)"
        ],
        [
            "23(0.9)"
        ],
        [
            "92(3.6)"
        ],
        [
            "122(4.8)"
        ],
        [
            "153(6.0)"
        ],
        [
            "137(5.4)"
        ],
        [
            "139(5.5)"
        ],
        [
            "141(5.6)"
        ],
        [
            "42(1.7)"
        ],
        [
            "14(0.6)"
        ],
        [
            "896(35.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "4.6"
        ],
        [
            "4.0"
        ],
        [
            "6.2"
        ],
        [
            "9.1"
        ],
        [
            "19.5"
        ],
        [
            "23.2"
        ],
        [
            "24.0"
        ],
        [
            "22.5"
        ],
        [
            "21.5"
        ],
        [
            "15.2"
        ],
        [
            "10.5"
        ],
        [
            "6.0"
        ],
        [
            "166.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BadocYearPop.±% p.a.1903 12,564—    1918 17,598+2.27%1939 13,231−1.35%1948 13,573+0.28%1960 12,210−0.88%1970 19,000+4.52%1975 20,805+1.84%1980 22,330+1.42%YearPop.±% p.a.1990 25,627+1.39%1995 26,737+0.80%2000 27,862+0.89%2007 30,063+1.05%2010 30,708+0.78%2015 31,616+0.56%2020 32,530+0.56%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Badoc was 32,530 people, with a density of 420 inhabitants per square kilometre or 1,100 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Badoc"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  19.60"
        ],
        [
            "2009  19.55"
        ],
        [
            "2012  17.51"
        ],
        [
            "2015  10.70"
        ],
        [
            "2018  5.67"
        ],
        [
            "2021  8.77"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(October 2014) (Learn how and when to remove this message)"
        ],
        [
            "La Virgen Milagrosa"
        ],
        [
            "Badoc houses the Sanctuary of the Miraculous Statue of the Blessed Virgin Mary, the La Virgen Milagrosa.",
            "History traces the life-sized statue to Nagasaki, Japan.",
            "It was sent floating in the sea by missionaries operating in secret in Japan (for fear of persecution during the Tokugawa Bakufu), along with the Miraculous Statue of the Black Nazarene (Sinait's Santo Cristo Milagroso).",
            "It was first found by local fishermen in the shores of Barangay Dadalaquiten of Sinait, Ilocos Sur and Barangay Paguetpet of Badoc (on the present-day boundary between Ilocos Norte and Ilocos Sur) in the year 1620.",
            "Only fishermen from Sinait were able to move the Statue of the Black Nazarene.",
            "The fishermen from Badoc, unable to move the Black Nazarene, were able to move the La Virgen Milagrosa that came with it—which was, in turn, unable to be moved by the fishermen from Sinait.",
            "They took the statues to their respective towns, hence becoming their patron saints.",
            "Today The La Virgen Milagrosa is enshrined at the Badoc Church, as Barangay Paguetpet was renamed in honor of the La Virgen Milagrosa.",
            "A chapel was erected near the site where the image landed, which is a stone's throw from the chapel marking the landing site of the Santo Cristo Milagroso."
        ],
        [
            "Juan Luna Shrine"
        ],
        [
            "Luna Shrine"
        ],
        [
            "The Juan Luna Shrine is the reconstructed two storey ancestral house of the painter Juan Luna, the revolutionary general Antonio Luna, and the violinist Manuel Luna.",
            "Built in the typical middle class fashion, the house was burned down in 1861 and was rebuilt using clay bricks and molave wood.",
            "Now a museum, the shrine houses photos of the Luna family and reproductions of Luna's paintings.",
            "The second floor retains the living room, bedrooms, azotea, and chapel, all furnished with period furniture and accessories."
        ],
        [
            "Minor Basilica of Saint John the Baptist"
        ],
        [
            "Badoc Church front"
        ],
        [
            "Also known as Badoc Basilica, St. John the Baptist Parish Church was constructed in 1591 and was once a chapel under the jurisdiction of Sinait.",
            "It was formally recognized as a parish in 1714 with St. John the Baptist as patron saint.",
            "The baroque church made of stone blocks and brick tiles is credited to Reverend Father Valentin Blovide.",
            "It was occupied by the Sambals during the revolution headed by Andres Malong in 1660–61."
        ],
        [
            "The celebrated Philippine painter Juan Luna was baptized in Badoc Church on 27 October 1857.",
            "At present, the church houses the miraculous statue of the Blessed Virgin Mary venerated under the title Virgin of Miracles, crowned by Catholic bishops in 1980, and was granted a Canonical coronation by Pope Francis on 31 May 2018.",
            "On November 30, 2018, the parish was elevated to the level of a Minor Basilica.",
            "The elevation rites took place on February 5, 2019."
        ],
        [
            "Floating Cottages at La Virgen Milagrosa"
        ],
        [
            "Another tourist attraction of this place is the floating cottage that is made out of bamboos and hays, with plastic drums as its floaters.",
            "Rentals for the floating cottages are about P500 for every 4 hours, and P100 for every one-hour extension.",
            "15-20 persons are the maximum capacity per floating cottage."
        ],
        [
            "Badoc Island"
        ],
        [
            "Badoc Island is an uninhabited island located about 1 kilometre (0.62 mi) off the shore of Barangay Pagsanahan in Badoc, Ilocos Norte, Philippines.",
            "The island is a popular surfing spot in northern Philippines."
        ],
        [
            "Beaches"
        ],
        [
            "There are five popular public beaches in Badoc."
        ],
        [
            "1) La Virgen Milagrosa Beach"
        ],
        [
            "2) Gabut Norte Beach"
        ],
        [
            "3) Pagsanahan Beach"
        ],
        [
            "4) Aring and Saud Beach"
        ],
        [
            "5) Pagsanahan Secret Beach"
        ],
        [
            "Food"
        ],
        [
            "Miki (Comfort Noodle Soup Dish), Ilocos Empanada, Longanisa and Iloco Vinegar are the local foods you can find in this town."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Badoc, belonging to the second congressional district of the province of Ilocos Norte, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Eugenio Angelo M. Barba"
        ],
        [
            "Mayor"
        ],
        [
            "Maximo D. Cajigal"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Alwyn G. Rubio"
        ],
        [
            "Councilors"
        ],
        [
            "Romnick James M. Torralba"
        ],
        [
            "Jayson G. Rubio"
        ],
        [
            "Divina Gracia B. dela Cruz"
        ],
        [
            "Cielito B. Lacuesta"
        ],
        [
            "Jonathan O. Torralba"
        ],
        [
            "Zenaida A. Idnay"
        ],
        [
            "Richard G. Cajigal"
        ],
        [
            "Efren Y. Calonge"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Badoc |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Ilocos Norte\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Badoc: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 4 March 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 10, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Badoc."
        ],
        [
            "Official Website of Badoc, Ilocos Norte"
        ],
        [
            "Badoc Information Guide - Badoc Municipal Officials Archived 2022-04-15 at the Wayback Machine"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Badoc"
        ],
        [
            "Pinili"
        ],
        [
            "South China Sea"
        ],
        [
            "Badoc"
        ],
        [
            "Nueva Era"
        ],
        [
            "Sinait, Ilocos Sur"
        ],
        [
            "vte Province of Ilocos NorteLaoag (capital and largest city)Municipalities"
        ],
        [
            "Adams"
        ],
        [
            "Bacarra"
        ],
        [
            "Badoc"
        ],
        [
            "Bangui"
        ],
        [
            "Banna"
        ],
        [
            "Burgos"
        ],
        [
            "Carasi"
        ],
        [
            "Currimao"
        ],
        [
            "Dingras"
        ],
        [
            "Dumalneg"
        ],
        [
            "Marcos"
        ],
        [
            "Nueva Era"
        ],
        [
            "Pagudpud"
        ],
        [
            "Paoay"
        ],
        [
            "Pasuquin"
        ],
        [
            "Piddig"
        ],
        [
            "Pinili"
        ],
        [
            "San Nicolas"
        ],
        [
            "Sarrat"
        ],
        [
            "Solsona"
        ],
        [
            "Vintar"
        ],
        [
            "Component cities"
        ],
        [
            "Batac"
        ],
        [
            "Laoag"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Norte"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Badoc&oldid=1223211386\""
        ],
        [
            "Category: Municipalities of Ilocos NorteHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textArticles needing additional references from October 2014All articles needing additional referencesCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}