{
    "name": "Bagamanoc",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bagamanoc"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°56′27″N 124°17′20″E﻿ / ﻿13.940753°N 124.288764°E﻿ / 13.940753; 124.288764"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Catanduanes, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Bagamanoc\" – news · newspapers · books · scholar · JSTOR (January 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bicol Region, PhilippinesBagamanocMunicipalityMunicipality of Bagamanoc"
        ],
        [
            "FlagMap of Catanduanes with Bagamanoc highlightedOpenStreetMapBagamanocLocation within the PhilippinesCoordinates: 13°56′27″N 124°17′20″E﻿ / ﻿13.940753°N 124.288764°E﻿ / 13.940753; 124.288764CountryPhilippinesRegionBicol RegionProvinceCatanduanesDistrict"
        ],
        [
            "Lone districtFoundedJune 12, 1950Barangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorOdilon F. Pascua • Vice MayorJuan A. Velchez • RepresentativeHector S. Sanchez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jorge V. VitalicioJoepete C. VillegasKresnamajal A. GonzalesRizalito P. AyalaAmadeo D. AlcantaraDanilo V. PenaRey S. VillarinoJoven R. Pelagio"
        ],
        [
            " • Electorate8,616 voters (2022)Area • Revenue₱ 77.56 million (2020) • Assets₱ 213 million (2020) • Expenditure₱ 65.98 million (2020) • Liabilities₱ 66.92 million (2020)Service provider • ElectricityFirst Catanduanes Electric Cooperative (FICELCO)Time zoneUTC+8 (PST)ZIP code4807PSGC052001000IDD : area code +63 (0)52Native languagesTagalogWebsitewww.bagamanoc-catanduanes.gov.ph"
        ],
        [
            "Bagamanoc, officially the Municipality of Bagamanoc,  is a 5th class municipality in the province of Catanduanes, Philippines.",
            "According to the 2020 census, it has a population of 11,086 people."
        ],
        [
            "History"
        ],
        [
            "At what is known as Bagatabao, but more island of the swamp, Bagamanocnons now called Taraga, there was already a chicken raising settlement place on the inhospitable plateau of Panay Island (Catanduanes)."
        ],
        [
            "The settlement was bounded on the east and north by the sea, blocked by a swamp and a hostile hill on the south and pressed by the crocodile-infested mouth of what is now known as the Bagamanoc River on the west.",
            "Confined to a limited territory by natural forces, the settlement could hardly feed and shelter itself.",
            "Moreover, frequent raids by corsairs from Mindanao, Jolo or Borneo for slaves posed a serious problem to their existence."
        ],
        [
            "One day, a daring and adventurous young man from the tribe forced his way across the mouth of the river to look for rattan needed for the repair of his future bride's family house.",
            "Going westward by the shoreline, he finally turned left for the business of venture but before he cut an uphill distance, he saw what appeared to be a chicken flying along just above the tallest leaves of pandan shrubs festooning the sea.",
            "Back in his tribe, he told the clan on what he saw of the beauty of the place, its abundance with food and building materials and the defense is offered from the pirate's raid.",
            "But as the place has no name to say when referring to that “discovered land” every time anybody talk of the place, they would call it “BAGAMANOC” which means the place was like a “chicken” the very meaning of Bagamanoc."
        ],
        [
            "To detect the coming of the Moro raids, the people erected a watchtower where the sea laps at the shore nearest the present Municipal Hall.",
            "In spite of the tower, many Bagamanocnons still fell into the corsairs’ hand.",
            "When the Spaniards came, they found the place a thriving community.",
            "They converted the people into Christianity and made a settlement into a municipality under a governadorcillo.",
            "Under Spain, the town people constructed a concrete church and municipal hall of stones, limes, molasses and eggs.",
            "However, even under the Spaniard rule, Bagamanocnons did not fully submit to the Spanish dominion, although fully sold out to Christianity.",
            "During the revolution of 1898–1901, the Bagamanocnon relied their support to the Filipino Revolutionist.",
            "In fact, a bloody skirmish took place at Mapulang Labo, where then Apolonio Cueva skillfully beheaded an American Officer mounted on a horse.",
            "When the Americans reorganized the municipal government, the town was reduced to a mere town of Viga, later of Payo, until Bagamanoc became a municipality again in 1950."
        ],
        [
            "Bagamanoc is used to be called a small town of big people and properly so.",
            "She had produced a hundred of professionals scattered all over the archipelago who in their modest way are making a name for themselves and for their birthplace.",
            "The country's representative to the “Tokyo Olympic Games” in 1924. in the discus throwing event came from this town and the second Catanduanes congressman under an independent Philippines hails from here.",
            "As of lately and during the time where the American Bases are still here in the Philippines,Bagamanoc has also been the site of the LORAN ( Long Range Navigation Facilities ) Station primarily installed to protect the country from external threats, among others."
        ],
        [
            "Bagamanoc was created from barrios of Quigaray, Hinipagan, Sukhan in the island of Panay; Lati, in the island of Lati; Bacac, Hinipaan, Bugao, Minaili and Bagamanoc of the municipality of Panganiban by virtue of Republic Act No.",
            "491 which was approved on June 12, 1950."
        ],
        [
            "The municipal councils of Bagamanoc and Panganiban agreed on the boundary of the two towns on June 12, 1952.",
            "The agreement was approved by the provincial council of Catanduanes on July 12, 1952.",
            "The Congress formalized the agreement by passing Republic Act No.",
            "1038 which was approved on June 12, 1954.",
            "The boundary was stated thus:"
        ],
        [
            "The boundary of Panay Island between the municipalities of Bagamanoc and Panganiban is a straight line from Amontol Point to Tubigmanoc.",
            "The territory west of the line belongs to the former municipality and the territory east of the line belongs to the latter.",
            "The boundary in Panganiban Bay is a straight line from Amontol Point to the mouth of the Pangcayanan Creek.",
            "The territory north-west of the line belongs to the former and the territory south-west of the line belongs to the latter.",
            "The boundary in the mainland of said municipalities extends from the mouth of Pangcayanan Creek following the natural course of said creek up to the concrete culvert and from that point of straight line to sitio Inacban: Provided, That sitio Inacban belongs to the municipality of Panganiban."
        ],
        [
            "Geography"
        ],
        [
            "The municipality of Bagamanoc is located at the north-eastern part of the province of Catanduanes directly facing the vast Pacific Ocean.",
            "Its total land is 80.74 square kilometres (31.17 sq mi), and is 60 kilometres (37 mi) north from the capital town of Virac.",
            "Its location is somewhat disadvantageous in its quest for development because of its distance form the capital town and most in particular it is open to the sea, whereby typhoon surge often wrought havoc to the shorelines particularly to the built-up areas during typhoons."
        ],
        [
            "Bagamanoc is located between latitude 13*53’00” and longitude 124*11’00” to 124*23’00”.",
            "It is bounded on the eastern side by the Pacific Ocean, on the north-western side by the municipality of Pandan, western side by the municipality of Caramoran, and on the south by the municipality of Panganiban."
        ],
        [
            "Barangays"
        ],
        [
            "Bagamanoc is politically subdivided into 18 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Antipolo"
        ],
        [
            "Bacak"
        ],
        [
            "Bagatabao"
        ],
        [
            "Bugao"
        ],
        [
            "Cahan"
        ],
        [
            "Hinipaan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Poblacion"
        ],
        [
            "Quigaray"
        ],
        [
            "Quezon (Pancayanan)"
        ],
        [
            "Sagrada"
        ],
        [
            "Salvacion (Panuto)"
        ],
        [
            "San Isidro"
        ],
        [
            "San Rafael (Mahantod)"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Mesa"
        ],
        [
            "Santa Teresa"
        ],
        [
            "Suchan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bagamanoc"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.1(84.4)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "30.3(86.5)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "32.3(90.1)"
        ],
        [
            "32.5(90.5)"
        ],
        [
            "32.2(90.0)"
        ],
        [
            "32.3(90.1)"
        ],
        [
            "32.1(89.8)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "30.6(87.1)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "31.1(87.9)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "25.5(77.9)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "26.2(79.2)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "27.8(82.0)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "26.1(79.0)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.0(71.6)"
        ],
        [
            "21.9(71.4)"
        ],
        [
            "22.2(72.0)"
        ],
        [
            "23.0(73.4)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "22.8(73.0)"
        ],
        [
            "23.2(73.7)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "388(15.3)"
        ],
        [
            "301(11.9)"
        ],
        [
            "287(11.3)"
        ],
        [
            "148(5.8)"
        ],
        [
            "198(7.8)"
        ],
        [
            "220(8.7)"
        ],
        [
            "293(11.5)"
        ],
        [
            "206(8.1)"
        ],
        [
            "313(12.3)"
        ],
        [
            "628(24.7)"
        ],
        [
            "859(33.8)"
        ],
        [
            "694(27.3)"
        ],
        [
            "4,535(178.5)"
        ],
        [
            "Source: Climate-Data.org"
        ],
        [
            "Bagamanoc has a tropical rainforest climate (Af) with heavy to very heavy rainfall year-round and with extremely heavy rainfall in November and December."
        ],
        [
            "Geological features"
        ],
        [
            "The structure of the earth's surface of the town is composed predominantly of upper Miocene-Pliocene (shale and sandstone sequence) located along the western and northern part of the municipality.",
            "Likewise Recent (Alluvium) layers is found along the coastal river bank areas and Cretaceous Paleocene (metamorphic rock) and Pliocene Pleistocene (conglomerate formation) are found at Late and Panay island."
        ],
        [
            "Soil classification"
        ],
        [
            "The municipal soil is composed of four (4) types, namely: Undifferential Mountain soil, Louisiana Clay, Hydrosol, Bantog Clay and traces of Beach Sand mostly along the coastal areas."
        ],
        [
            "Topography"
        ],
        [
            "Almost 83% of the entire land area of the municipality are mountainous and hilly wherein 56% (43.65 square kilometers) of it is covered by thick forest and 44% or 34.30 square kilometers are planted with abaca, coconut, root crops and perennial trees.",
            "The lowland or plain area is about 17% of the total land are or 15.96 square kilometers which comprises the built-up areas, rice land, diversified agricultural lands and others.",
            "The mountainous area is located at the western part of the municipality and the hilly or rolling terrain lies eastward to the coastal areas, while the lowland or plain areas are situated along the coastal and river banks."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BagamanocYearPop.±% p.a.1903 1,813—    1960 8,706+2.79%1970 8,812+0.12%1975 9,456+1.42%1980 9,469+0.03%1990 10,179+0.73%1995 10,407+0.42%2000 9,684−1.53%2007 10,183+0.70%2010 11,370+4.09%2015 11,551+0.30%2020 11,086−0.80%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Bagamanoc was 11,086 people, with a density of 140 inhabitants per square kilometre or 360 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bagamanoc"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  38.80"
        ],
        [
            "2009  38.01"
        ],
        [
            "2012  37.44"
        ],
        [
            "2015  45.45"
        ],
        [
            "2018  22.71"
        ],
        [
            "2021  29.98"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agriculture sector"
        ],
        [
            "The major crops in the municipality are food crops (rice, corn, root crops, vegetables and legumes) and cash crops (abaca and coconut).",
            "Large parcel of riceland are situated at barangays Quezon, Santa Tersa, Antipolo and Bagatabao Magsaysay, and Bugao.",
            "Abaca and coconut plantation are found inn all barangay, except barangays Poblacion, Santa Mesa and Santa Teresa."
        ],
        [
            "The municipality is not identified as a key Livestock Development Area but there are areas in some barangays which are conducive to livestock raising particularly carabao and cattle.",
            "These are barangays San Isidro and Suchan.",
            "Livestock raising in the municipality are mostly backyard and as work animals."
        ],
        [
            "Identified fishing development areas are the barangays of Quezon, Batabao, Quigaray and Suchan.",
            "Most of these fishponds are now for family subsistence and not for commercial production due to its physical state.",
            "Asides from the fishponds, large fishing ground abounds in the locality being a coastal area.",
            "These are the Bagamanoc Bay.",
            "Loroman, Late and Quigaray Cove."
        ],
        [
            "Commerce and trade sector"
        ],
        [
            "The municipality does not have any big commercial establishment nor have much trade and commercial activities to speak of.",
            "Existing are about 96 locally registered and license commercial establishment throughout the municipality ranging from a small eatery to retail and wholesale stores.",
            "Most of the bigger stores are found at the municipal commercial strip or commercial business district."
        ],
        [
            "Besides from the commercial strip, the municipality has the Municipal Public Market, which is strategically located near the slaughterhouse, Municipal Training Hall and the Bus and Jeepney Terminal."
        ],
        [
            "Almost all the commercial consumers products are being bought at commercial establishments at Virac, which are brought home daily loaded on a passenger's jeepney/bus or a cargo truck.",
            "Agricultural crops are sold directly to buying commercial establishment at Virac."
        ],
        [
            "Tourism"
        ],
        [
            "There are no specific tourism activities in the municipality, although there are potential areas endowed with natural attributes and resources that are conducive to recreation, leisure and other wholesome experiences which can provide the purpose for visitors, excursionist and vacationist.",
            "Basically, the locality is coastal, thus there sprawling beaches, lagoons, shoals, coves wherein one can frolics and do some fishing.",
            "There are also some rivers and falls where in anybody could have some picnic or excursion.",
            "There is also the former LORAN Station Buildings (US Coast Guard Station) located atop a hill and overlooking coastal strips of beaches and the Pacific Ocean."
        ],
        [
            "Among those potential sites are the falls at Paday along Panuto and Maragkiw River at Bacak, Pantalan at Caningan River, Quezon and Cagnipa at Barangay San Vicente overlooking the sea and a nsilet.",
            "Included are the strip of beaches like Bugao-Pogtangan Beach, Late Beach and Cabusiw-Dayhagan Beaches along the blue seas and corals where in one can do swimming and scuba diving."
        ],
        [
            "Industry"
        ],
        [
            "The municipality is an agricultural base community whereby necessary resources for agro-industrial undertakings are available.",
            "Abundant raw materials from the forest and other agricultural products could be utilized for a cottage or home industry.",
            "The vast seas could be tapped as source for raw materials for fish and marine processing business and other livelihood activities for the local fisher folks.",
            "Besides form the abundant raw materials, adequate labor force is readily available."
        ],
        [
            "There are no established industry in the locality, what present are small scale rice mills, an off and on small home furniture, leather wear and nipa shingle making."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bagamanoc |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An act creating the municipality of Bagamanoc in the province of Catanduanes\".",
            "LawPH.com.",
            "Archived from the original on 2012-07-11.",
            "Retrieved 2011-04-09."
        ],
        [
            "^ \"An Act Fixing the Boundary of the Municipalities of Bagamanoc and Panganiban, Province of Catanduanes, in Accordance with the Agreement Between Said Municipalities Made on June 12, 1952, and Approved by the Provincial Board of Said Province on July 12, 1952 in Its Resolution Numbered One Hundred Twenty-three\".",
            "LawPH.com.",
            "Archived from the original on 2012-07-10.",
            "Retrieved 2011-04-11."
        ],
        [
            "^"
        ],
        [
            "\"Province: Catanduanes\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Climate: Bagamanoc\".",
            "Climate-Data.org.",
            "Retrieved 27 October 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Catanduanes\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Municipality of Bagamanoc"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Bagamanoc"
        ],
        [
            "Pandan"
        ],
        [
            "Caramoran"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Panganiban"
        ],
        [
            "vte Province of CatanduanesVirac (capital and largest municipality)Municipalities"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Baras"
        ],
        [
            "Bato"
        ],
        [
            "Caramoran"
        ],
        [
            "Gigmoto"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "San Andres"
        ],
        [
            "San Miguel"
        ],
        [
            "Viga"
        ],
        [
            "Virac"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bagamanoc&oldid=1188762329\""
        ],
        [
            "Category: Municipalities of CatanduanesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using the Kartographer extension"
        ]
    ]
}