{
    "name": "Balasan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Balasan"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsŚlůnskiSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°28′22″N 123°05′16″E﻿ / ﻿11.4728°N 123.0878°E﻿ / 11.4728; 123.0878"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "This article is about the Philippine municipality.",
            "For the river in Romania, see Balasan (river)."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Balasan\" – news · newspapers · books · scholar · JSTOR (December 2016) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Western Visayas, PhilippinesBalasanMunicipalityMunicipality of BalasanAerial view of Balasan"
        ],
        [
            "FlagEtymology: Balas (sand)Map of Iloilo with Balasan highlightedOpenStreetMapBalasanLocation within the PhilippinesCoordinates: 11°28′22″N 123°05′16″E﻿ / ﻿11.4728°N 123.0878°E﻿ / 11.4728; 123.0878CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "5th districtBarangays23"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorManuel C. Ganzon • Vice MayorFilomeno V. Ganzon • RepresentativeRaul C. Tupas • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Susana C. GanzonMark Rey O. GolinganFarridah Paz A. AgrasadaJose G. Abdallah Jr.Sonia T. AlarconCelia L. MorenoArnold A. de la RosaPatricia B. Abdallah"
        ],
        [
            " • Electorate22,797 voters (2022)Area • Revenue₱ 134 million (2020) • Assets₱ 379.9 million (2020) • Expenditure₱ 102.5 million (2020) • Liabilities₱ 60.98 million (2020)Service provider • ElectricityIloilo 3 Electric Cooperative (ILECO 3)Time zoneUTC+8 (PST)ZIP code5018PSGC063005000IDD : area code +63 (0)33Native languagesHiligaynon Capisnon TagalogWebsitewww.balasan.gov.ph"
        ],
        [
            "Balasan, officially the Municipality of Balasan (Hiligaynon: Banwa sang Balasan, Tagalog: Bayan ng Balasan),  is a 4th class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 35,064 people."
        ],
        [
            "The business and shopping centre of northern Iloilo, Balasan is a compact town and easy to get around on foot, by bicycle, or by public transport."
        ],
        [
            "Buses arrive at Balasan bus station, a kilometre to the Balasan's town centre, every fifteen minutes.",
            "Taking a tricycle is the most convenient way for newcomers to travel around Balasan."
        ],
        [
            "In 1950, the barrio of Zarragoza was transferred from the town of Batad."
        ],
        [
            "Etymology"
        ],
        [
            "Balasan derived its name from \"Balas\" meaning sand which are still found in abundance along the Banks of Bangon River where the first settlement was founded."
        ],
        [
            "History"
        ],
        [
            "Sometime in 1846, Francisco Ariola, son of the datu from Jolo, together with his men, found themselves in the shores of Carles.",
            "He immediately organized the early settlers who later mingled with his men at Punta Bulakawe, a plateau just 330 meters north of the Poblacion (town proper).",
            "The settlers extended their clearing up the jungles and virgin lands for development.",
            "The Provincial Governor of Capiz commissioned Ariola to facilitate transportation of families recruited from Antique and Aklan.",
            "Soon afterwards, more settlers came.",
            "The Punta Bulakawe settlement, thus formed was included under the Pueblo de Pilar, Capiz."
        ],
        [
            "It was in 1857 when Don Juan Silverio granted Francisco Ariola permission together with 50 families to go in a boat southeastwards from Barrio Sumagbong Cogon, Nabas, Capiz (Aklan) to the unfamiliar lands in the eastern portions of Panay Island.",
            "They soon landed in what was then known to be Punta Bulukawe, Capiz (Punta Badaiang, Carles).",
            "They were granted a full tax exemption for three years if they cultivated the new land."
        ],
        [
            "Towards 1856, as the general clearing progressed, Francisco transferred Bulakawe to the lowland south of the settlement.",
            "The settlement was named BADIANG, which means \"wild giant gabi variety\" because of the abundance of this plant in the vicinity of the new site.",
            "As streets were laid out Ariola, caused the equal distribution of the home lots to settlers alongside the new created streets.",
            "Some settlers however, built their homes near farms.",
            "This later led to the formation of other barrio settlements."
        ],
        [
            "After making a settlement, Francisco Ariola quickly appointed an exploration team to survey the new land further south.",
            "The team was led by Vicente Navales-the existing perpetual index of the leaders of Balasan started with the first teniente del barrio absolute, Vicente Navales in 1852.",
            "They immediately set forth southeastward to a river where they rested for the night.",
            "The morning was when the river got its name when the first man to awaken called out: ‘Bangon!’ which meant ‘Arise!’ The land after the river was a beautiful grassland full of sparrows – probably the Paser montanus (maya bongol), Lochura malacca (maya pula), or the Padda oryzivora (maya costa) which was from which the place got its name, Maya.",
            "They went further off to such places which are now known as Barangay Bulac, Batad, and Lanubo (Estancia).",
            "After being gone for quite some time, the folks in the settlement began to worry so a search party was formed to bring them back.",
            "They met with the former party in a place which was from then on known to be Tabuan (a place where people meet)."
        ],
        [
            "The accounts of Vicente Navales made some of the folks decide to make a sister-settlement in Maya.",
            "The place did prove promising and it expanded northeastward to a place with a river which was very ideal as a channel for sea trade and source of industrial sand (baras).",
            "The place was from then until such a time was known as Barasan.",
            "It eventually expanded and soon such area which was once the extension of the maya settlement became known until now as Mamhut."
        ],
        [
            "In January 1860, the leaders of the Barrio Badiang headed by Francisco Ariola went to Capiz to petition the provincial government to make Barrio Badiang a municipality.",
            "The governor denied the petition on the ground that Barrio Badiang was only newly created and was not yet capable of becoming a pueblo.",
            "Not discouraged by their first failure, the petitioners traveled for days to Iloilo City, to bring this petition to Governor Jose Maria Carles, a Spanish Governor.",
            "After studying the case, Governor Carles approved the petition and thus, Barrio Badiang became a \"pueblo\"."
        ],
        [
            "The jubilant people of Badiang, in gratitude to Governor Carles for his approval of this petition, presented another petition to change the name Badiang to Carles in honor of the Governor.",
            "This petition was approved and on July 1, 1862, Carles was inaugurated as a new Pueblo with Alenjandro Buaya as the first Gobernadorcillo del Pueblo made Carles."
        ],
        [
            "On January 1, 1904, the Municipio de Carles was demoted from a status of a Barrio to the status of a Barrio Balasan.",
            "This incident disheartened some Carleseños who migrated to other towns and provinces.",
            "But among those who stayed on were the strong willed ones who struggled hard to make Carles an independent municipality.",
            "Headed by Casimiro Andrada, the Carles Separation Movement succeeded in getting the approval of the Carleseños petition for separation from Balasan on January 1, 1920."
        ],
        [
            "The records show that former Badiang (Carles) then later known as Balasan became large enough that it even covered the areas which now are separate districts such as Carles, Balasan, Estancia, and Batad."
        ],
        [
            "The writings of Douglas Malunda tell about a treasure that the settlers of Ariola stored in one wooden chest to make it easier to protect from thieves from both land and sea.",
            "It was said such chest of silver, gold and pearls was buried in a dried well somewhere in Balasan with only a large tree to mark its location.",
            "The most accurate knowledge of its location was known by Ariola's only son who unfortunately became one of the casualties of a cholera epidemic.",
            "With his death, the knowledge of the location of the treasure vanished.",
            "As yet, the treasure awaits its very fortunate hunter."
        ],
        [
            "Geography"
        ],
        [
            "Balasan is in northeast Iloilo, 129 kilometres (80 mi) from the provincial capital, Iloilo City, and 58 kilometres (36 mi) from Roxas City, with a regular bus service from these 2 cities."
        ],
        [
            "Barangays"
        ],
        [
            "Balasan is politically subdivided into 23 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aranjuez"
        ],
        [
            "Bacolod"
        ],
        [
            "Balanti-an"
        ],
        [
            "Batuan"
        ],
        [
            "Cabalic"
        ],
        [
            "Camambugan"
        ],
        [
            "Dolores"
        ],
        [
            "Gimamanay"
        ],
        [
            "Ipil"
        ],
        [
            "Kinalkalan"
        ],
        [
            "Lawis"
        ],
        [
            "Malapoc"
        ],
        [
            "Mamhut Norte"
        ],
        [
            "Mamhut Sur"
        ],
        [
            "Maya"
        ],
        [
            "Pani-an"
        ],
        [
            "Poblacion Norte"
        ],
        [
            "Poblacion Sur"
        ],
        [
            "Quiasan"
        ],
        [
            "Salong"
        ],
        [
            "Salvacion"
        ],
        [
            "Tingui-an"
        ],
        [
            "Zaragosa"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Balasan, Iloilo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "27(81)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "61(2.4)"
        ],
        [
            "39(1.5)"
        ],
        [
            "46(1.8)"
        ],
        [
            "48(1.9)"
        ],
        [
            "90(3.5)"
        ],
        [
            "144(5.7)"
        ],
        [
            "152(6.0)"
        ],
        [
            "145(5.7)"
        ],
        [
            "163(6.4)"
        ],
        [
            "160(6.3)"
        ],
        [
            "120(4.7)"
        ],
        [
            "90(3.5)"
        ],
        [
            "1,258(49.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.3"
        ],
        [
            "9.0"
        ],
        [
            "9.9"
        ],
        [
            "10.0"
        ],
        [
            "18.5"
        ],
        [
            "25.0"
        ],
        [
            "27.4"
        ],
        [
            "26.0"
        ],
        [
            "25.9"
        ],
        [
            "24.9"
        ],
        [
            "17.9"
        ],
        [
            "14.2"
        ],
        [
            "221"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BalasanYearPop.±% p.a.1903 3,223—    1918 22,214+13.73%1939 12,840−2.58%1948 15,490+2.11%1960 10,967−2.84%1970 13,490+2.09%1975 15,588+2.94%1980 17,979+2.89%1990 22,013+2.05%1995 22,949+0.78%2000 25,474+2.26%2007 27,384+1.00%2010 29,724+3.03%2015 33,088+2.06%2020 35,064+1.15%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Balasan, Iloilo, was 35,064 people, with a density of 650 inhabitants per square kilometre or 1,700 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Balasan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  24.00"
        ],
        [
            "2009  30.43"
        ],
        [
            "2012  24.10"
        ],
        [
            "2015  24.17"
        ],
        [
            "2018  20.74"
        ],
        [
            "2021  24.21"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Healthcare"
        ],
        [
            "The town has two hospitals: Jesus M Colmenares District Hospital (government-owned, bed capacity 283) and Loida Sterner Hospital Facility (privately owned by a foundation, bed capacity about 100); and a Diagnostic centers: Medicus and Health Link."
        ],
        [
            "Notable"
        ],
        [
            "Rabiya Mateo, Beauty queen, host"
        ],
        [
            "Kapawa Performing Arts, Northern Iloilo's Premiere Performing Arts Group.",
            "It is a non-profit organization which gives free dance trainings, uniforms, and costumes to almost 90 scholar artists."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Balasan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An act to transfer a certain barrio from the territorial jurisdiction of the municipality of Batad, province of Iloilo to the municipality of Balasan, same province\".",
            "LawPH.com.",
            "Retrieved 2011-04-09."
        ],
        [
            "^ \"Province of Iloilo Homepage\"."
        ],
        [
            "^ \"Province of Iloilo Homepage\"."
        ],
        [
            "^ \"Province of Iloilo Homepage\"."
        ],
        [
            "^ \"Province of Iloilo Homepage\"."
        ],
        [
            "^ \"Province of Iloilo Homepage\"."
        ],
        [
            "^"
        ],
        [
            "\"Province: Iloilo\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Balasan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 3 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Balasan, Iloilo."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Balasan"
        ],
        [
            "Carles"
        ],
        [
            "Visayan Sea"
        ],
        [
            "Pilar, Capiz"
        ],
        [
            "Balasan"
        ],
        [
            "Estancia"
        ],
        [
            "Batad"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Balasan&oldid=1195196406\""
        ],
        [
            "Category: Municipalities of IloiloHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from December 2016All articles needing additional referencesCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}