{
    "name": "Balindong",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Balindong"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°55′N 124°12′E﻿ / ﻿7.92°N 124.2°E﻿ / 7.92; 124.2"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Lanao del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Balindong\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bangsamoro Autonomous Region in Muslim Mindanao, PhilippinesBalindong"
        ],
        [
            "واتو باليندونجWatuMunicipalityMunicipality of Balindong"
        ],
        [
            "FlagSealMap of Lanao del Sur with Balindong highlightedOpenStreetMapBalindongLocation within the PhilippinesCoordinates: 7°55′N 124°12′E﻿ / ﻿7.92°N 124.2°E﻿ / 7.92; 124.2CountryPhilippinesRegionBangsamoro Autonomous Region in Muslim MindanaoProvinceLanao del SurDistrict"
        ],
        [
            "2nd districtBarangays38"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAmer-Reggie L. Bagul • Vice MayorBenjamin M. Bagul • RepresentativeYasser A. Balindong • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Hasanul Bimbas A. SaripNasif M. MacarompunAlioden C. MacagaanAbdul-Azis M. MabaKadaffe R. SaripHasher B. MalaBankie S. AmairomagMac A. Ayaon Jr."
        ],
        [
            " • Electorate19,168 voters (2022)Area • Revenue₱ 145 million (2020) • Assets₱ 87.36 million (2020) • Expenditure₱ 152.7 million (2020) • Liabilities₱ 17.29 million (2020)Service provider • ElectricityLanao del Sur Electric Cooperative (LASURECO)Time zoneUTC+8 (PST)ZIP code9318PSGC153603000IDD : area code +63 (0)63Native languagesMaranao TagalogWebsitewww.balindog-lds.gov.ph"
        ],
        [
            "Balindong, officially the Municipality of Balindong (Maranao and Iranun: Inged a Balindong; Tagalog: Bayan ng Balindong), is a 4th class municipality in the province of Lanao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 32,573 people."
        ],
        [
            "It is formerly known as Watu."
        ],
        [
            "History"
        ],
        [
            "Wato was the original municipality name as the time passed it was renamed to Balindong.",
            "It is now popularly known and called as municipality of Balindong."
        ],
        [
            "The people of Wato (west Masiu) claim descent from Bataraan di kilaten, the first founding ancestor of Masiu Pangampong, his Later descendant were Pondag and Amaloya Thopaan.",
            "Thopaan was married to Potri Kaizadan daughter of Aloyodan son of Sarip Kabunsuan of Johore (Malaysia) who in turn descended from Fatima, the daughter of the Islamic Prophet Muhammad.",
            "Thopaan and Kaizadan begot, Angkaya of Masiu, Manzang of Molondo, Dayansalong of Binidayan and Ambo of Lumba a Bayabao,"
        ],
        [
            "Angkaya married to Potre Ayowa of Taraka and begot Datu Onggor (father of Balindong bsar), Bayora and Bae Kayowa.",
            "Bae Kayowa was married to Datu Sandor of Baloi son of Sarip Bato Lakongan begot Panimbang in Talagian of Maguindanao from a Baloi royal princess, Datu Sandor and Bae Kayowa bore Maruhom Kaharoden and Samar known as Datumaas of Watu and Taraka municipality,"
        ],
        [
            "Maruhom Kaharoden first married to Omera in Unayan daughter of Datu Calipa and second married to Gunup sister of Alanak of Baloi and bore Olan (wife of Pagayawan in Sedepan a Unayan) and his brother Radia Palawan, first Sultan of Raya and the famous saber sa Radapan, who died a martyr in 1759 in Radapan Linamon Lanao del norte, in defense of freedom, homeland and Islam against the Spanish invaders,"
        ],
        [
            "Radia Palawan a Maranao hero, married to the grand daughter of Balindong bsar and begot, four Maruhoms (Pat a Datu sa Raya) namely; Maruhom Salam, Maruhom Bsar, Maruhom Datu a Simban, Maruhom Sidic, and the Bae sa Raya who was married to Maruhom Sidic son of Diwan of Bayang.",
            "According to the \"Taritib\" system of Raya, handed down through well-remembered oral traditions, only male descendants of the lines of this four “Maruhoms” could ascend to the titles and thrones of Sultan sa Raya under a rule of alternate succession (idal).",
            "The reigning Sultan of Raya Ex Vice Governor, Atty Dimapuno Ramos Datu (Pangnal) enthroned as Sultan of Raya from the turn of Maruhom Sidic of Raya, younger among the four Maruhom.",
            "He is the incumbent General Secretary of the original 28 Lanao Sultanate Legislative Council of the four Pangampong of Lanao \"28 SULTAN AMBABAYA KO TARITIB SA RANAO\"."
        ],
        [
            "Originally there was no Wato and Malaig sultanates, the two sons of Samar Datumaas asked permission to their uncle Kaharoden to build their own Sultanate, Maruhom Kahar agreed, Datu sa Malaig married to a Bayabao royal princess and found the Malaig Sultanate, while Datu sa Wato found Wato Sultanate, he was married to Bae sa Marigay daughter of Nanak of Bayang from Potre Nining, daughter of Datu sa Kalodan Gantar son of Sultan Barahaman Aman of Maguindanao,"
        ],
        [
            "The territory of these three minor sultanates, from Raya to other side of the lake, Salipongan, to west portion of the municipality is considered territory of Raya sultanate, from Lilod to the east portion of the municipality, including Selangan Island and Nosa island is considered territory of the Wato Sultanate, from the bridge between Malaig and Salipongan to the boundary of Marantao and Wato Balindong is considered territory of Malaig Sultanate, the upper portion of Malaig is Pagayawan, which is extension territory of Pagayawan royal Sultanate of Sedepan a Unayan, Pagayawan was married to Potre Olan (daughter of Maruhom Kahar of Raya) begot a son, and named his place Pagayawan in honor of his father, and to make known that Pagayawan in Wato belongs to the royal Sultanate of Pagayawan (Municipality).",
            "The current sultan of Pagayawan is Engr.",
            "Sharief Ali Darangina grandson of Alag who is known to be the former Cabugatan sa Pagayawan.",
            "Only those royal blood can be proclaimed as Cabugatan or Sultan.",
            "Most of the descendants of the royal bloods in Pagayawan was scattered into different places from Baloi to Pantao Ragat up to Poona Piagapo."
        ],
        [
            "Political history"
        ],
        [
            "The Municipality of Balindong was known as Uato or Wato from 1918 to 1948.",
            "Wato, the lower western portion of the present day municipality is surprisingly rocky.",
            "In 1956 by virtue of Republic Act 1419 dated June 10, 1956, Wato was renamed Balindong in honor of a great ruler of the Pangampong fame who ruled the Pangampong of Masiu from Wato."
        ],
        [
            "On April 29, 1963, Balindong was converted into a regular Municipality under Executive Order no.",
            "42.",
            "Balindong is comprised by 38 barangays.",
            "During the martial regime, there were 54 barangays in the municipality.",
            "When Corazon C. Aquino came into the presidency, the number of barangays was reduced to 38."
        ],
        [
            "Geography"
        ],
        [
            "Balindong is one of thirty nine (39) municipalities comprising the Province of Lanao del Sur.",
            "It lies on the western part of the province.",
            "It is bounded on the north by the Municipality of Marantao, on the south by the municipality of Tugaya.",
            "On the east and western side, it is bounded by Lake Lanao and Lanao del Norte respectively."
        ],
        [
            "The Municipality is only 16 kilometres (9.9 mi) from Marawi City, and 53 kilometres (33 mi) from the nearest seaport of Iligan City."
        ],
        [
            "The total land area of Balindong is approximately 28,650 hectares (70,800 acres).",
            "Of this figure, only about 25% is plain or flat suitable for rice farming.",
            "By classification, some 37% of the total land area is forest land."
        ],
        [
            "Barangays"
        ],
        [
            "Balindong is politically subdivided into 38 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Abaga (Mapantao)"
        ],
        [
            "Poblacion (Balindong)"
        ],
        [
            "Pantaragoo"
        ],
        [
            "Bantogan Wato"
        ],
        [
            "Barit"
        ],
        [
            "Bubong"
        ],
        [
            "Bubong Cadapaan"
        ],
        [
            "Borakis"
        ],
        [
            "Bualan"
        ],
        [
            "Cadapaan"
        ],
        [
            "Cadayonan"
        ],
        [
            "Kaluntay"
        ],
        [
            "Dadayag"
        ],
        [
            "Dado"
        ],
        [
            "Dibarusan"
        ],
        [
            "Dilausan"
        ],
        [
            "Dimarao"
        ],
        [
            "Ingud"
        ],
        [
            "Lalabuan"
        ],
        [
            "Lilod (Capital of the Sultanate of Watu)"
        ],
        [
            "Lumbayao"
        ],
        [
            "Limbo"
        ],
        [
            "Lumbaca Lalan"
        ],
        [
            "Lumbac Wato"
        ],
        [
            "Magarang"
        ],
        [
            "Nusa Lumba Ranao"
        ],
        [
            "Padila"
        ],
        [
            "Pagayawan"
        ],
        [
            "Paigoay"
        ],
        [
            "Raya"
        ],
        [
            "Salipongan"
        ],
        [
            "Talub"
        ],
        [
            "Tomarompong"
        ],
        [
            "Tantua Raya"
        ],
        [
            "Tuka Bubong"
        ],
        [
            "Bolinsong"
        ],
        [
            "Lati"
        ],
        [
            "Mala-ig"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Balindong, Lanao de Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "159(6.3)"
        ],
        [
            "143(5.6)"
        ],
        [
            "166(6.5)"
        ],
        [
            "183(7.2)"
        ],
        [
            "357(14.1)"
        ],
        [
            "414(16.3)"
        ],
        [
            "333(13.1)"
        ],
        [
            "309(12.2)"
        ],
        [
            "289(11.4)"
        ],
        [
            "285(11.2)"
        ],
        [
            "253(10.0)"
        ],
        [
            "166(6.5)"
        ],
        [
            "3,057(120.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.4"
        ],
        [
            "17.2"
        ],
        [
            "20.6"
        ],
        [
            "23.4"
        ],
        [
            "29.3"
        ],
        [
            "29.2"
        ],
        [
            "29.9"
        ],
        [
            "29.4"
        ],
        [
            "27.7"
        ],
        [
            "28.7"
        ],
        [
            "25.5"
        ],
        [
            "19.9"
        ],
        [
            "299.2"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Climate is classified as Type IV characterized by the absence of distinct dry or wet season.",
            "Its coldest period is usually during rainy days when temperature dips down to a low 15 °C (59 °F) while the average temperature rises to 27 °C (81 °F) during dry season."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BalindongYearPop.±% p.a.1918 3,827—    1939 5,418+1.67%1948 8,280+4.83%1960 14,820+4.97%1970 14,678−0.10%1975 16,917+2.89%1980 12,927−5.24%1990 19,635+4.27%1995 21,825+2.00%2000 24,470+2.48%2007 30,295+2.99%2010 26,007−5.40%2015 29,180+2.22%2020 32,573+2.19%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty Incidence of Balindong"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "2000  52.61"
        ],
        [
            "2003  41.41"
        ],
        [
            "2006  36.80"
        ],
        [
            "2009  42.93"
        ],
        [
            "2012  63.55"
        ],
        [
            "2015  61.42"
        ],
        [
            "2018  67.37"
        ],
        [
            "2021  25.45"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Its geographical local plays a major role in the development of agro-industrial potential in the province and region.",
            "Balindong contributes raw materials including forest products.",
            "While cottage industry had been home-based for most part, it has high development potentials given sufficient inputs including market access."
        ],
        [
            "Incidence of poverty"
        ],
        [
            "The 1995 survey of Family Income And Expenditures (FIES) indicate that an average Balinndong household earns an annual income of P33,660.00 or P2,805.00 a month.",
            "In the same period, Poverty Threshold Income  (PTI) in the Province of Lanao del Sur was estimated at P9,364 or a poverty incidence of about 52%.",
            "PTI implies that households earning below the rate are considered poor or in the poverty group."
        ],
        [
            "Labor force participation"
        ],
        [
            "Of the 2000 population of 24,470, 51% of this (12,524) are in the labor force, meaning those aged 14 to 64 years old which are classified as economically active sector.",
            "However, viewed from the provincial labor force participation rate of 50%, it can be deduced that Balindong's situation is not far from that reality."
        ],
        [
            "Income and expenditure"
        ],
        [
            "The Municipality of Balindong is a 5th class in terms of income.",
            "Its revenue is derived mainly from its share of Internal Revenue Allotment (IRA) from the national government.",
            "Currently, the municipality receives an annual IRA of Php28,892,000.",
            "Of this revenue, some php5,784,000.00 or 20% of the revenue is earmarked for development activities."
        ],
        [
            "Agriculture"
        ],
        [
            "Crop production"
        ],
        [
            "While total agricultural area in the municipality stands at 7,024 hectares, representing 24% of the total land area, only about 832 hectares or 12% is effectively utilized for rice (203 has.)",
            "and corn (632 has.)",
            "farming.",
            "Rice farms are mainly rain fed (153 has.)",
            "as there is absence of a developed irrigation system in the municipality."
        ],
        [
            "Livestock and poultry production"
        ],
        [
            "Due to the existence of a wide tract of land for grazing and pasture, Balindong is one of the Province source for cattle and carabao and other livestock products.",
            "Inventory of livestock indicate that there exist (2002): cattle – 145 heads, carabao – 131 heads, goat – 135, chicken 417, ducks – 210.",
            "The data indicate a decreasing inventory of animals, therefore, a need to replenish the stock."
        ],
        [
            "Aqua-culture production"
        ],
        [
            "A survey of annual fish catch from the lake and inland fish-ponds in the municipality from 1997 to 2002 indicate reduction of catch from 17% metric ton to only 8.02 metric tons.",
            "Fish species in the lake include Tilapia, Mudfish, Sirung, Carp,  Gaby, and Catfish."
        ],
        [
            "Infrastructure"
        ],
        [
            "Housing"
        ],
        [
            "Data culled out from the 2000 Census indicate that the history of Balindong's housing trend is one of decreasing from 1960 at 2,236 units to as low as 1,332 dwelling units in 1980.",
            "In 1990, Balindong's dwelling units numbered 1,807 and in 2000 the dwelling units increased to 2,145."
        ],
        [
            "Ninety-seven percent of the dwelling units in Balindong are of single house type.",
            "The average number of households occupying a single dwelling unit stands at 1.5 with a household population of 11.41 persons per dwelling unit."
        ],
        [
            "Healthcare"
        ],
        [
            "Balindong, other than having its own rural health unit, is a site of the District Hospital.",
            "Currently, Balindong's Rural Health unit has a staff of 1 physician, 1 public health nurse, 3 midwives, and twelve Barangay Health Workers."
        ],
        [
            "Health records indicate that leading causes of morbidity, especially among children, include acute respiratory tract infection, influenza, acute gastroenteritis, hypertension, measles with bronchopneumonia, severe dehydration, cancer, and diabetes mellitus."
        ],
        [
            "On the other hand, the leading causes of mortality for both adults and children include cardiovascular diseases, pulmonary tuberculosis, vehicular accidents, measles with bronchopneumonia, severe dehydration, cancer and diabetes mellitus."
        ],
        [
            "Education"
        ],
        [
            "Census data of 2000 reports that the literacy rate of Balindong stands at 86.02% while the Province’ literacy rate was at 80.12%.",
            "There are seven (7) elementary schools and two (2) secondary schools in Balindong which caters to the education needs of its population."
        ],
        [
            "Elementary"
        ],
        [
            "Balindong Central Elementary School - Barangay Salipongan"
        ],
        [
            "Lombayao Elementary School - Barangay Lombayao"
        ],
        [
            "Malaig Elementary School - Barangay Malaig"
        ],
        [
            "Bubong Elementary School - Barangay Bubong"
        ],
        [
            "Raya Elementary School - Barangay Raya"
        ],
        [
            "Lilod Elementary School - Barangay Lilod"
        ],
        [
            "Dilausan Elementary School - Barangay Dilausan"
        ],
        [
            "Secondary"
        ],
        [
            "MSU Balindong Comm.",
            "High School - Barangay Tomarompong"
        ],
        [
            "Balindong national High School - Barangay Salipongan"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Balindong |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Bangsamoro (BARMM)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Balindong, Lanao del Sur : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 19 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Lanao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Balindong Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Balindong"
        ],
        [
            "Marantao"
        ],
        [
            "Munai, Lanao del Norte"
        ],
        [
            "Balindong"
        ],
        [
            "Lake Lanao"
        ],
        [
            "Tugaya"
        ],
        [
            "vte Province of Lanao del SurMarawi (capital)Municipalities"
        ],
        [
            "Amai Manabilang"
        ],
        [
            "Bacolod-Kalawi"
        ],
        [
            "Balabagan"
        ],
        [
            "Balindong"
        ],
        [
            "Bayang"
        ],
        [
            "Binidayan"
        ],
        [
            "Buadiposo-Buntong"
        ],
        [
            "Bubong"
        ],
        [
            "Butig"
        ],
        [
            "Calanogas"
        ],
        [
            "Ditsaan-Ramain"
        ],
        [
            "Ganassi"
        ],
        [
            "Kapai"
        ],
        [
            "Kapatagan"
        ],
        [
            "Lumba-Bayabao"
        ],
        [
            "Lumbaca-Unayan"
        ],
        [
            "Lumbatan"
        ],
        [
            "Lumbayanague"
        ],
        [
            "Madalum"
        ],
        [
            "Royal Sultanate of Madamba"
        ],
        [
            "Maguing"
        ],
        [
            "Malabang"
        ],
        [
            "Marantao"
        ],
        [
            "Marogong"
        ],
        [
            "Masiu"
        ],
        [
            "Mulondo"
        ],
        [
            "Pagayawan"
        ],
        [
            "Piagapo"
        ],
        [
            "Picong"
        ],
        [
            "Poona Bayabao"
        ],
        [
            "Pualas"
        ],
        [
            "Saguiaran"
        ],
        [
            "Sultan Dumalondong"
        ],
        [
            "Tagoloan"
        ],
        [
            "Tamparan"
        ],
        [
            "Taraka"
        ],
        [
            "Tubaran"
        ],
        [
            "Tugaya"
        ],
        [
            "Wao"
        ],
        [
            "Component city"
        ],
        [
            "Marawi"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Balindong&oldid=1222310194\""
        ],
        [
            "Categories: Municipalities of Lanao del SurPopulated places on Lake LanaoPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}