{
    "name": "Balilihan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Balilihan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°45′N 123°58′E﻿ / ﻿9.75°N 123.97°E﻿ / 9.75; 123.97"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bohol, Philippines"
        ],
        [
            "Municipality in Central Visayas, PhilippinesBalilihanMunicipalityMunicipality of BalilihanBalilihan Municipal Hall"
        ],
        [
            "FlagMap of Bohol with Balilihan highlightedOpenStreetMapBalilihanLocation within the PhilippinesCoordinates: 9°45′N 123°58′E﻿ / ﻿9.75°N 123.97°E﻿ / 9.75; 123.97CountryPhilippinesRegionCentral VisayasProvinceBoholDistrict"
        ],
        [
            "1st districtFounded29 September 1828"
        ],
        [
            "previously part of Baclayon town.Barangays31"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMaria Puresa V. Chatto • Vice MayorEsther Patricia V. Chatto • RepresentativeEdgar M. Chatto"
        ],
        [
            " • Municipal CouncilSB Members/CouncilorsCalipes, MayanAsilo, EdgarBaliong, Lorenzo Jr.Libatona, DodongLansang, BernieAle, NickRacho, StephenPabe, Elesio Jr. • Electorate14,669 voters (2022)Area • Revenue₱ 107.6 million (2020) • Assets₱ 310.4 million (2020) • Expenditure₱ 111.7 million (2020) • Liabilities₱ 55.36 million (2020)Service Providers • ElectricityBohol 1 Electric Cooperative (BOHECO 1) • WaterBalilihan Municipal Waterworks • TelecommunicationsSmart Communications, Globe Telecom (cellular) PLDT (fixed-line)Time zoneUTC+8 (PHT)ZIP code6342PSGC071206000Native languagesBoholano dialect Cebuano TagalogMajor ReligionsRoman Catholicism (majority) and othersFeast DateJuly 16 - Our Lady of Mt.",
            "Carmel Parish (Balilihan town proper)January 16 - Santo Niño Parish (Hanopol)September 29 - Sumad (Foundation Day)Catholic DioceseDiocese of TagbilaranPatron SaintOur Lady of Mt.",
            "Carmel (Nuestra Señora del Carmen)Holy Child Jesus (Señor Santo Niño)Websitebalilihan.gov.ph"
        ],
        [
            "Balilihan, officially the Municipality of Balilihan (Cebuano: Lungsod sa Balilihan; Tagalog: Bayan ng Balilihan), is a 4th class rural municipality in the province of Bohol, Philippines.",
            "According to the 2020 census, it has a population of 18,694 people."
        ],
        [
            "Balilihan is a landlocked town located 22 kilometres (14 mi) northeast of Tagbilaran through Cortes town (via CPG North Avenue), or 20 kilometres (12 mi) through the town of Corella (via JA Clarin Street).",
            "The inland municipality has a land area of 127.27 km2 (49.14 sq.",
            "mi)."
        ],
        [
            "History"
        ],
        [
            "The place is a panorama of verdant hills, rugged mountains and green fields.",
            "It is said to have been so named because of the grass \"balili\" which grew in abundance."
        ],
        [
            "Before the beginning of the 19th century, Balilihan was a barrio of Baclayon and an old settlement.",
            "When the Dagohoy revolt was suppressed by the Spaniards, the authorities established a garrison in Datag (one of its barrios) to discourage and stamp out further uprisings on the part of the natives.",
            "When Balilihan was separated from Baclayon on the 29th of September 1828, the Spanish government formally established a settlement or pueblo in the sitio \"Bay sa Iring\" (named so for the network of caves where cats hide) which was about two kilometres (1.2 mi) from the Spanish garrison."
        ],
        [
            "The Spanish Belfry in Del Carmen Norte, Balilihan served as a watch tower during Spanish regime."
        ],
        [
            "Later, due to the scarcity of water, the seat of government was transferred to its present site which is amply supplied with water from various springs.",
            "The elevated land also made a good viewing point to keep watch over all nearby towns.",
            "Thus the construction of a Spanish belfry similar to the watch towers of the shores atop the hill.",
            "This tower is made of adobe stones gathered from the rock deposits of Baclayon.",
            "It was erected in the year 1835.",
            "It was inaugurated in 1846 by the gobernadorcillo.",
            "In 1888, Friar Benito Grayoa, who at that time exercised control over local governments, ordered the transfer of the municipio to Cabad, a barrio four kilometres (2.5 mi) west of the poblacion.",
            "The padre's plan met vigorous opposition from the people and through the able leadership of Capitan Bartolome Racho, they filed the protest before the Spanish Military Governor Linares who disapproved the proposal causing Friar Grayoa's ire who then plotted for the consequent punishment of the captain by dragging him with the friar's horse through the streets causing his death in jail.",
            "Fearing reprisals from the clergy, some of the people migrated to Surigao, Leyte and Misamis.",
            "Not long afterwards, Friar Grayoa was transferred to Siquijor.",
            "The Spanish era flourished with the construction of Spanish church at the foot of the Spanish watchtower where a large patio became the hall for social affairs and the friar's convent a school for the cartilla, with the municipio across.",
            "With the guidance of the local appointed leaders under the control of the Spanish friar, the town slowly progressed peacefully until the outbreak of the revolution in 1898."
        ],
        [
            "On 12 November 1900, American soldiers were known to be coming from Antequera.",
            "All officials of the town led by Capitan Antonio Racho came out to meet the soldiers with a brass band, but when the Americans arrived, they gathered all the officials in the municipal hall building and placed them under guard, for the Americans had heard that the town officials had been supporting the insurgents.",
            "The supplications of spokesman Segundo Racho not to burn the town was of no avail and the sounds of the welcoming brass band turned into volleys of gunshots.",
            "The officials were ordered to move towards Sevilla while the civilians ran for safety to the outskirts of the town.",
            "The town was razed to the ground.",
            "The Americans burned the church, the convent, the municipal building, the school building for boys and girls as well as private houses.",
            "The only structure that was spared was the belfry on the top of the hill."
        ],
        [
            "By 1904, there was a move to fuse Balilihan with Antequera in order to meet the requirements of a municipality under the American regime.",
            "The people objected to the plan, so the following year the Philippine Commission finally ruled in its Act.",
            "No.",
            "350 abolishing the municipality of Catigbian and instead annexing it to Balilihan as one of its barrios."
        ],
        [
            "During World War II, the town residents went into hiding in their mountain hideouts for fear of the Japanese.",
            "Balilihan was a haven of refugees from other places who lived a life of privation in the mountains.",
            "Many innocent civilians were either tortured or put into death by the enemies on mere suspicions of guerilla activities.",
            "Ex-mayor Patricio Ibarra was put up by the people as war time mayor to defend them from their enemies."
        ],
        [
            "The Japanese atrocities gave rise to the organizations of the guerrillas into full combat force under the supreme command of Mayor Ismael Ingeniero.",
            "The people helped the guerilla movement by feeding the troops in the front lines as well as those in the headquarters in Behind the Clouds, in Maitum which was the famous concentration camp of the war.",
            "Enemy collaborators were tried here and those found guilty of high crimes were liquidated.",
            "Those with slight offenses were imprisoned for the duration of the war.",
            "Another concentration camp was at Hanopol where prisoners were kept."
        ],
        [
            "In 1948, Balilihan suffered a great loss of territory when the biggest barrio, Catigbian, was given its town charter in spite of the strong representation against the move by town mayor Balbino Chatto and Gerardo Racho who personally went to Malacañang to see President Elpidio Quirino."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Balilihan is politically subdivided into 31 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 071206001   Baucan Norte"
        ],
        [
            " 3.6%"
        ],
        [
            " 666"
        ],
        [
            " 688"
        ],
        [
            "  ▾"
        ],
        [
            " −0.32%"
        ],
        [
            " 071206002   Baucan Sur"
        ],
        [
            " 4.3%"
        ],
        [
            " 799"
        ],
        [
            " 852"
        ],
        [
            "  ▾"
        ],
        [
            " −0.64%"
        ],
        [
            " 071206003   Boctol"
        ],
        [
            " 7.1%"
        ],
        [
            " 1,322"
        ],
        [
            " 1,094"
        ],
        [
            "  ▴"
        ],
        [
            " 1.91%"
        ],
        [
            " 071206004   Boyog Norte"
        ],
        [
            " 1.2%"
        ],
        [
            " 227"
        ],
        [
            " 212"
        ],
        [
            "  ▴"
        ],
        [
            " 0.69%"
        ],
        [
            " 071206005   Boyog Proper"
        ],
        [
            " 1.5%"
        ],
        [
            " 281"
        ],
        [
            " 199"
        ],
        [
            "  ▴"
        ],
        [
            " 3.51%"
        ],
        [
            " 071206006   Boyog Sur"
        ],
        [
            " 1.9%"
        ],
        [
            " 348"
        ],
        [
            " 329"
        ],
        [
            "  ▴"
        ],
        [
            " 0.56%"
        ],
        [
            " 071206007   Cabad"
        ],
        [
            " 3.6%"
        ],
        [
            " 677"
        ],
        [
            " 570"
        ],
        [
            "  ▴"
        ],
        [
            " 1.73%"
        ],
        [
            " 071206008   Candasig"
        ],
        [
            " 3.3%"
        ],
        [
            " 609"
        ],
        [
            " 591"
        ],
        [
            "  ▴"
        ],
        [
            " 0.30%"
        ],
        [
            " 071206009   Cantalid"
        ],
        [
            " 2.1%"
        ],
        [
            " 400"
        ],
        [
            " 387"
        ],
        [
            "  ▴"
        ],
        [
            " 0.33%"
        ],
        [
            " 071206010   Cantomimbo"
        ],
        [
            " 2.9%"
        ],
        [
            " 539"
        ],
        [
            " 537"
        ],
        [
            "  ▴"
        ],
        [
            " 0.04%"
        ],
        [
            " 071206011   Cogon"
        ],
        [
            " 4.1%"
        ],
        [
            " 774"
        ],
        [
            " 835"
        ],
        [
            "  ▾"
        ],
        [
            " −0.76%"
        ],
        [
            " 071206012   Datag Norte"
        ],
        [
            " 3.2%"
        ],
        [
            " 604"
        ],
        [
            " 540"
        ],
        [
            "  ▴"
        ],
        [
            " 1.13%"
        ],
        [
            " 071206013   Datag Sur"
        ],
        [
            " 2.7%"
        ],
        [
            " 498"
        ],
        [
            " 414"
        ],
        [
            "  ▴"
        ],
        [
            " 1.86%"
        ],
        [
            " 071206014   Del Carmen Este (DCE) (Poblacion)"
        ],
        [
            " 3.6%"
        ],
        [
            " 669"
        ],
        [
            " 672"
        ],
        [
            "  ▾"
        ],
        [
            " −0.04%"
        ],
        [
            " 071206015   Del Carmen Norte (DCN) (Poblacion)"
        ],
        [
            " 4.0%"
        ],
        [
            " 746"
        ],
        [
            " 720"
        ],
        [
            "  ▴"
        ],
        [
            " 0.36%"
        ],
        [
            " 071206017   Del Carmen Sur (DCS) (Poblacion)"
        ],
        [
            " 3.3%"
        ],
        [
            " 615"
        ],
        [
            " 600"
        ],
        [
            "  ▴"
        ],
        [
            " 0.25%"
        ],
        [
            " 071206016   Del Carmen Weste (DCW) (Poblacion)"
        ],
        [
            " 4.4%"
        ],
        [
            " 827"
        ],
        [
            " 865"
        ],
        [
            "  ▾"
        ],
        [
            " −0.45%"
        ],
        [
            " 071206018   Del Rosario"
        ],
        [
            " 1.2%"
        ],
        [
            " 230"
        ],
        [
            " 260"
        ],
        [
            "  ▾"
        ],
        [
            " −1.22%"
        ],
        [
            " 071206019   Dorol"
        ],
        [
            " 4.0%"
        ],
        [
            " 746"
        ],
        [
            " 751"
        ],
        [
            "  ▾"
        ],
        [
            " −0.07%"
        ],
        [
            " 071206020   Haguilanan Grande"
        ],
        [
            " 3.7%"
        ],
        [
            " 686"
        ],
        [
            " 836"
        ],
        [
            "  ▾"
        ],
        [
            " −1.96%"
        ],
        [
            " 071206021   Hanopol Este"
        ],
        [
            " 1.8%"
        ],
        [
            " 345"
        ],
        [
            " 337"
        ],
        [
            "  ▴"
        ],
        [
            " 0.23%"
        ],
        [
            " 071206022   Hanopol Norte"
        ],
        [
            " 2.1%"
        ],
        [
            " 384"
        ],
        [
            " 349"
        ],
        [
            "  ▴"
        ],
        [
            " 0.96%"
        ],
        [
            " 071206023   Hanopol Weste"
        ],
        [
            " 1.3%"
        ],
        [
            " 245"
        ],
        [
            " 272"
        ],
        [
            "  ▾"
        ],
        [
            " −1.04%"
        ],
        [
            " 071206024   Magsija"
        ],
        [
            " 3.3%"
        ],
        [
            " 611"
        ],
        [
            " 477"
        ],
        [
            "  ▴"
        ],
        [
            " 2.51%"
        ],
        [
            " 071206025   Maslog"
        ],
        [
            " 2.8%"
        ],
        [
            " 524"
        ],
        [
            " 428"
        ],
        [
            "  ▴"
        ],
        [
            " 2.04%"
        ],
        [
            " 071206026   Sagasa"
        ],
        [
            " 3.3%"
        ],
        [
            " 613"
        ],
        [
            " 512"
        ],
        [
            "  ▴"
        ],
        [
            " 1.82%"
        ],
        [
            " 071206027   Sal‑ing"
        ],
        [
            " 3.6%"
        ],
        [
            " 672"
        ],
        [
            " 697"
        ],
        [
            "  ▾"
        ],
        [
            " −0.36%"
        ],
        [
            " 071206028   San Isidro"
        ],
        [
            " 2.4%"
        ],
        [
            " 455"
        ],
        [
            " 458"
        ],
        [
            "  ▾"
        ],
        [
            " −0.07%"
        ],
        [
            " 071206029   San Roque"
        ],
        [
            " 2.9%"
        ],
        [
            " 546"
        ],
        [
            " 519"
        ],
        [
            "  ▴"
        ],
        [
            " 0.51%"
        ],
        [
            " 071206030   Santo Niño"
        ],
        [
            " 2.8%"
        ],
        [
            " 532"
        ],
        [
            " 494"
        ],
        [
            "  ▴"
        ],
        [
            " 0.74%"
        ],
        [
            " 071206031   Tagustusan"
        ],
        [
            " 3.8%"
        ],
        [
            " 713"
        ],
        [
            " 652"
        ],
        [
            "  ▴"
        ],
        [
            " 0.90%"
        ],
        [
            "Total"
        ],
        [
            "18,694"
        ],
        [
            "17,147"
        ],
        [
            " ▴"
        ],
        [
            "0.87%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Balilihan, Bohol"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "102(4.0)"
        ],
        [
            "85(3.3)"
        ],
        [
            "91(3.6)"
        ],
        [
            "75(3.0)"
        ],
        [
            "110(4.3)"
        ],
        [
            "141(5.6)"
        ],
        [
            "121(4.8)"
        ],
        [
            "107(4.2)"
        ],
        [
            "111(4.4)"
        ],
        [
            "144(5.7)"
        ],
        [
            "169(6.7)"
        ],
        [
            "139(5.5)"
        ],
        [
            "1,395(55.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.6"
        ],
        [
            "14.8"
        ],
        [
            "16.5"
        ],
        [
            "16.7"
        ],
        [
            "23.9"
        ],
        [
            "26.4"
        ],
        [
            "25.6"
        ],
        [
            "24.1"
        ],
        [
            "24.4"
        ],
        [
            "26.3"
        ],
        [
            "23.7"
        ],
        [
            "20.5"
        ],
        [
            "261.5"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BalilihanYearPop.±% p.a.1903 6,590—    1918 9,973+2.80%1939 18,991+3.11%1948 23,937+2.61%1960 11,161−6.16%1970 14,533+2.67%1975 13,912−0.87%1980 13,925+0.02%1990 14,850+0.65%1995 14,400−0.57%2000 16,837+3.41%2007 17,131+0.24%2010 17,147+0.03%2015 17,903+0.83%2020 18,694+0.85%Source: Philippine Statistics Authority"
        ],
        [
            "Number of households: 3,101Average household size: 6.0"
        ],
        [
            "Culture"
        ],
        [
            "Town Festival"
        ],
        [
            "The municipality of Balilihan holds its annual town fiesta (town proper) every July 16 in honor of Our Lady of Mount Carmel.",
            "Barrios or barangays around Hanopol area - (a parish composed of 10 barrios) celebrate their annual town fiesta every January 16 in honor of Santo Niño.",
            "Another event takes place every last week of the month of September to celebrate the creation of Balilihan as a separate municipality on September 29, 1828."
        ],
        [
            "Education"
        ],
        [
            "Elementary and primary schools"
        ],
        [
            "Balilihan Central Elementary School"
        ],
        [
            "Baucan Elementary School"
        ],
        [
            "Boctol Elementary School"
        ],
        [
            "Boyog Elementary School"
        ],
        [
            "Cabad-Candasig Elementary School"
        ],
        [
            "Cantalid Primary School"
        ],
        [
            "Cantomimbo Primary School"
        ],
        [
            "Cogon-Tagustusan  School"
        ],
        [
            "Datag Elementary School"
        ],
        [
            "Dorol Elementary School"
        ],
        [
            "Haguilanan Grande Elementary School"
        ],
        [
            "Hanopol Elementary School"
        ],
        [
            "Magsija-Maslog Elementary School"
        ],
        [
            "Sagasa Elementary School"
        ],
        [
            "Sal-ing Elementary School"
        ],
        [
            "San Isidro Primary School"
        ],
        [
            "San Roque Integrated School (elementary and high school)"
        ],
        [
            "Secondary schools"
        ],
        [
            "Carmel Academy (CA)"
        ],
        [
            "Congressman Pablo Malasarte National High School (CPMNHS)"
        ],
        [
            "Hanopol National High School (HNHS)"
        ],
        [
            "San Roque Integrated School (SRIS)"
        ],
        [
            "Tertiary schools"
        ],
        [
            "Bohol Island State University (BISU) – Balilihan Campus"
        ],
        [
            "Gallery"
        ],
        [
            "Camugao Falls located in northwestern Balilihan, near the Abatan River"
        ],
        [
            "Abatan River"
        ],
        [
            "Making of baskets"
        ],
        [
            "Ceiling paintings of Balilihan Roman Catholic Church"
        ],
        [
            "Festival in Balilihan, held every last week of September"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Balilihan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Balilihan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bohol\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Municipality of Balilihan\".",
            "Province of Bohol.",
            "Archived from the original on 2013-09-06.",
            "Retrieved 2012-09-10."
        ],
        [
            "^ \"Fiesta Time\".",
            "Bohol.",
            "Retrieved February 13, 2019."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Balilihan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Municipality of Balilihan"
        ],
        [
            "Tirol, Jes (1 October 2006).",
            "\"Establishment of Balilihan town\".",
            "The Bohol Chronicle.",
            "LII (40).",
            "Archived from the original on 28 September 2007."
        ],
        [
            "Tirol, Jes (23 October 2005).",
            "\"The Creation of the Municipality of Eva, Bohol (Janopol)\".",
            "The Bohol Chronicle.",
            "LI (40).",
            "Archived from the original on 28 September 2007."
        ],
        [
            "Balilihan"
        ],
        [
            "Places adjacent to Balilihan"
        ],
        [
            "Catigbian"
        ],
        [
            "Batuan"
        ],
        [
            "Antequera"
        ],
        [
            "Balilihan"
        ],
        [
            "BilarSevilla"
        ],
        [
            "Cortes"
        ],
        [
            "Corella | Sikatuna"
        ],
        [
            "vte Province of BoholTagbilaran (capital and largest city)Municipalities"
        ],
        [
            "Alburquerque"
        ],
        [
            "Alicia"
        ],
        [
            "Anda"
        ],
        [
            "Antequera"
        ],
        [
            "Baclayon"
        ],
        [
            "Balilihan"
        ],
        [
            "Batuan"
        ],
        [
            "Bien Unido"
        ],
        [
            "Bilar"
        ],
        [
            "Buenavista"
        ],
        [
            "Calape"
        ],
        [
            "Candijay"
        ],
        [
            "Carmen"
        ],
        [
            "Catigbian"
        ],
        [
            "Clarin"
        ],
        [
            "Corella"
        ],
        [
            "Cortes"
        ],
        [
            "Dagohoy"
        ],
        [
            "Danao"
        ],
        [
            "Dauis"
        ],
        [
            "Dimiao"
        ],
        [
            "Duero"
        ],
        [
            "Garcia Hernandez"
        ],
        [
            "Getafe"
        ],
        [
            "Guindulman"
        ],
        [
            "Inabanga"
        ],
        [
            "Jagna"
        ],
        [
            "Lila"
        ],
        [
            "Loay"
        ],
        [
            "Loboc"
        ],
        [
            "Loon"
        ],
        [
            "Mabini"
        ],
        [
            "Maribojoc"
        ],
        [
            "Panglao"
        ],
        [
            "Pilar"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Sagbayan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Sevilla"
        ],
        [
            "Sierra Bullones"
        ],
        [
            "Sikatuna"
        ],
        [
            "Talibon"
        ],
        [
            "Trinidad"
        ],
        [
            "Tubigon"
        ],
        [
            "Ubay"
        ],
        [
            "Valencia"
        ],
        [
            "Component city"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Islands"
        ],
        [
            "Balicasag"
        ],
        [
            "Banacon"
        ],
        [
            "Bansaan"
        ],
        [
            "Bilangbilangan"
        ],
        [
            "Bohol"
        ],
        [
            "Cabilao"
        ],
        [
            "Cabulan"
        ],
        [
            "Hingotanan"
        ],
        [
            "Jandayan"
        ],
        [
            "Jao"
        ],
        [
            "Juagdan"
        ],
        [
            "Lapinig"
        ],
        [
            "Mahanay"
        ],
        [
            "Malingin"
        ],
        [
            "Mantatao"
        ],
        [
            "Maomawan"
        ],
        [
            "Pamilacan"
        ],
        [
            "Pangangan"
        ],
        [
            "Panglao"
        ],
        [
            "Sagasa"
        ],
        [
            "Sandingan"
        ],
        [
            "Tintinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Balilihan&oldid=1190013192\""
        ],
        [
            "Category: Municipalities of BoholHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using infobox settlement with unknown parametersArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}