{
    "name": "Banate",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Banate, Iloilo"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°03′N 122°47′E﻿ / ﻿11.05°N 122.78°E﻿ / 11.05; 122.78"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "\"Banate\" redirects here.",
            "For other uses, see Banate (disambiguation)."
        ],
        [
            "Municipality in Western Visayas, PhilippinesBanateMunicipalityMunicipality of BanateBanate Farmland"
        ],
        [
            "FlagSealMotto: Abante Banate!Map of Iloilo with Banate highlightedOpenStreetMapBanateLocation within the PhilippinesCoordinates: 11°03′N 122°47′E﻿ / ﻿11.05°N 122.78°E﻿ / 11.05; 122.78CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "4th districtFounded1763Re-established1843Barangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPeter Paul T. Gonzales • Vice MayorFilemon M. Iran, Jr. • RepresentativeFerjenel G. Biron • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Mario E. BactungMa.",
            "Victoria B. DaraugRyan A. VillaruelMary Ann B. AcejoVincent C. BustamanteCarlo Louise S. CabangalMark Lawrence T. PalecRenerose B. Caborubias"
        ],
        [
            " • Electorate23,179 voters (2022)Area • Revenue₱ 133.6 million (2020) • Assets₱ 279.4 million (2020) • Expenditure₱ 100.7 million (2020) • Liabilities₱ 39.61 million (2020)Service provider • ElectricityIloilo 3 Electric Cooperative (ILECO 3)Time zoneUTC+8 (PST)ZIP code5010PSGC063006000IDD : area code +63 (0)33Native languagesHiligaynon TagalogWebsitewww.banate.gov.ph"
        ],
        [
            "Banate, officially the Municipality of Banate (Hiligaynon: Banwa sang Banate, Tagalog: Bayan ng Banate),  is a 4th class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 33,376 people."
        ],
        [
            "The town is primarily a fishing and agricultural municipality, with large areas planted with rice, sugarcane, vegetables, beans, coconut and bananas.",
            "Banate is well known for Kasag (crabs), krill or shimp paste called ginamos, and the fresh fish, which local entrepreneurs take to and sell in the capital of the province, in many of the non-coastal towns, and even in Manila."
        ],
        [
            "History"
        ],
        [
            "Banate during the Pre-conquest Period"
        ],
        [
            "Images from the Boxer Codex (c. 1595), illustrating an ancient Visayans of Panay during their first contact with the Spaniards."
        ],
        [
            "The settlement in Banate is of ancient origin.",
            "It was among the ancient organized territories of the Confederation of Madja-as in Panay (also called by the ancient Bornean migrants, the island of \"Madya-as\"),"
        ],
        [
            "Precolonial map of Panay and Negros showing the ancient polities belonging to the Confederation of Madja-as.",
            "Ancient Bobog and Alakaygan are what form the present day Banate."
        ],
        [
            "There are theories that settlers from the powerful ancient thalassocratic Malay empire based on the island of Sumatra, modern-day Indonesia (which influenced much of Southeast Asia)"
        ],
        [
            "The Maragtas of Pedro Alcantara Monteclaro mentions that the area near the Alakaygan River was among the first areas to be exploited by the early Malay settlers for agriculture.",
            "In these places they cultivated the land, planting kauayan, mabulo, hidiok, bagtikan, sibukao, buri, niog, kulo, kalamansi, paray, batad, kahangkugui and other seed, which they brought from Borneo."
        ],
        [
            "As a side note, Alakaygan is the only place in Banate where, until recent years, Tapukal (krill or hipon smoked in the bark of a native tree) was produced.",
            "It is a delicacy that can be found only in Banate."
        ],
        [
            "Banate during the Spanish Regime"
        ],
        [
            "Fr.",
            "Murillo Velarde's 1734 Map of the Philippines showing Banate as one of the ancient towns on the island of Panay."
        ],
        [
            "Origin of the Town's Name"
        ],
        [
            "At the beginning of the Christianisation of Panay, Bobog was a visita"
        ],
        [
            "To the inhabitants, the town's modern name is commonly attributed to the presence of many Bangate trees in the area.",
            "According to a local legend, when the Spaniards arrived, all the inhabitants of Banate fled away for safety.",
            "An old man, however, failed to escape because he was of advanced age and was already so weak.",
            "It was raining then.",
            "So, the old man took shelter under the Bangate tree where a Spanish officer found him later on.",
            "The white man asked the native; \"Come se llama esto pueblo?",
            "\",  The old man, uncertain what to say, merely said \"Bangate\" thinking that the Spaniard was asking him about the name of the tree.",
            "Unable to understand clearly what the old man mumbled, the Spaniard thought the native had said \"Banate\".",
            "While such legend sounds too absurd to be true, it is the only explanation often given by people when asked why their town is called Banate.",
            "Indeed, 'Bangate' trees still abound within the territorial limits of the municipality."
        ],
        [
            "Banate at the Beginning of the Colonial Period"
        ],
        [
            "The Map of Panay, with data about the bastions of its coastlines, c. 1797, drawn under the direction of Don Santiago Salaverria, Teniente Coronel graduado de Batallon de Milicias de la Laguna de Bay, y Corregidor de la Provincia de Tondo.",
            "The map shows the three bastions of Banate."
        ],
        [
            "Bobog, in the early part of its history as a Christian settlement and a Visita of Dumangas, was placed under the advocation of St. John the Evangelist.",
            "The appellative \"Viejo\", which the Spaniards attached to the early hispanized name of the town, indicates the ancient origin of Banate."
        ],
        [
            "Fr.",
            "Juan Fernandez says that Banate was formally established as a municipality in 1763.",
            "By then, it acquired as its Visita the settlement of Sinaba-an."
        ],
        [
            "Being a coastal village with a rich fishing ground, Banate is naturally inclined to flourish.",
            "However, it was also a natural target to invaders.",
            "In 1764, many people would leave the town because of a disastrous incursion and pillage of the Moros from Mindanao.",
            "R. P. Fray Arias, O.S.A., the town's priest who was at the same time the parish priest of Guimbal,"
        ],
        [
            "Consequently, after the Muslim pillage, Banate was re-annexed to Dumangas.",
            "The three stone structures are prominent in the 1797 Map of Panay drawn under the direction of Don Santiago Salaverria, Teniente Coronel graduado de Batallon de Milicias de la Laguna de Bay, y Corregidor de la Provincia de Tondo (cf.",
            "Illustration)."
        ],
        [
            "By beginning of the 1800s, the Spaniards noted that Banate profited from the benefit of its good bastions that the native residents built to defend themselves from the moro pirates.",
            "Because of this advantageous situation, in a short time, the town was developing again.",
            "The Spanish observers foresaw that soon Banate would be a notable town again.",
            "It enjoyed good ventilation and healthy climate.",
            "Though the houses were of simple construction, but the community had good defenses to protect itself against the frequent Moro incursions.",
            "People were engaged in agriculture, which constituted their main occupation.",
            "Fishing was also a very important trade because of the abundance of the harvest from Banate Bay."
        ],
        [
            "Erection as a Town and Parish"
        ],
        [
            "Depiction of Banate and its history in heraldic art."
        ],
        [
            "There is no extant document or act of legislation recording the date of the formal reestablishment of Banate as a municipality in the year 1843.",
            "It could be noted, however, that the town had its first duly appointed Gobernadorcillo in the person of Don Felix Baviera, in 1837."
        ],
        [
            "An extant record published by the Augustinians Friars states that in the year 1845, the town had 1,464 tributaries.",
            "It was described as follows:"
        ],
        [
            "\"It is located by the shore, and has three stone bastions that defend it.",
            "Its climate is one of the best in the province.",
            "In addition to agriculture, the natives devote themselves to fishing, and export fish to many towns in the province; and women engage themselves in making fine fabrics from pineapple fiber.",
            "Its interim parish priest is R. P. Fray Bartolomé Villa,O.S.A., 27 years of age and 4 years in the ministry.\""
        ],
        [
            "Decree of Governor General Antonio Blanco, dated 5 April 1850, separating the towns of Banate and Anilao from the jurisdiction of Barotac Nuevo in Iloilo (Philippines).",
            "The original document is in the custody of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain."
        ],
        [
            "Fray Villa, the interim parish priest, came to manage Banate in 1843.",
            "According to Fr.",
            "Juan Fernández, O.S.A., it was declared an independent parish under the advocation of St. John the Baptist, as its titutlar."
        ],
        [
            "The official local election results record for the year 1844–45 found in the National Archives (in Manila) entitled Relacion nominal de los Gobernadorcillos, tenientes, juezes, y alguaciles del año corriente con exposicion de sus Pueblos lists Don Pascual Baylon as the Gobernadorcillo of Banate, and that the other town officials during his incumbency were Julian Fuentes- Primer Teniente, Victoriano Bonifacio- Segundo Teniente, Ynesanio Domingo- Primer Juez, Ruberto Cayetano- Segundo Juez, Lucas Espinosa- Primer Alguacil, Juan Mateo- Segundo Alguacil, Juan Ygnacio- Tercer Alguacil."
        ],
        [
            "The original manuscript of the report of R.P.",
            "Fray Bernardo Arquero, O.S.A., dated 1 January 1897, on the statistical data and historical information of the Parish of St. John the Baptist in Banate, Iloilo (Philippines).",
            "The document can be found in the Archives of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain."
        ],
        [
            "Thirteen years after the first Gobernadorcillo of Banate was appointed, Governor General Antonio Blanco declared Banate as an independent parish on 5 April 1850, at the same time as that of Anilao."
        ],
        [
            "In 1854,  R. P. Fray Nicolas Calvo, O.S.A., the first full-time parish priest was assigned in Banate.",
            "The election of Don Tomas Juanico and other officials of the town in 1855 confirmed furthermore the implementation of Banate's erection as a pueblo."
        ],
        [
            "Because of the benefit of good bastions, the inhabitants benefited more and more from its advantageous internal situation.",
            "Within very short years after the resettlement of the town, Banate recovered to be a notable community with plenty of rice, sugar, tobacco, and pineapple fiber fabrics, which the women produced."
        ],
        [
            "The present Church of the parish was built in 1870 by R. P. Eustaqiuo Torés, O.S.A."
        ],
        [
            "On 28 October 1898, during the Revolution for Philippine Independence, Banate (which remained loyal to Spain) was reduced to ashes by the rebels under the ill-mannered Juan Maraingan -"
        ],
        [
            "Towards the end of the Spanish rule, Banate had 6,285 residents.",
            "All of whom were baptized Catholics, except for 5 of the 6 Chinese residents.",
            "At that time, there were 3,145 persons paying tribute (\"de pago\"), and 256 or around 12.29% classified as exempted or \"de privilegio y gratis\" (principales)."
        ],
        [
            "The Spanish Friars Who Evangelized Banate"
        ],
        [
            "The Parish Priests played important roles in the life of towns of the Philippines during the Spanish Regime.",
            "Many of them were the builders of public structures and defenses of colonial towns.",
            "Having its own parish priest added prestige to the status of a municipality during that period.",
            "Banate had its first priest in 1763.",
            "Below is the list of Spanish Augustinian Friars who served the town during the colonial era:"
        ],
        [
            "R. P. Fray Alejandro Arias, O.S.A."
        ],
        [
            "This religious was a native of Villarodrigo, province of Leon.",
            "He entered the convent of Valladolid in 1734, at the age of seventeen.",
            "He was a missionary of the Italones in 1740, and Minister of Pórac (1744), Magalan and Tarlac (1747), S. Miguel de Mayumo (1747), S. José de los Montes (1750), Anilao (1759), and Guimbál with Banate (1763).",
            "He was captured by the Moros in 1764, in the port of Tayabas, and was killed by them."
        ],
        [
            "R. P. Fray Bartolome Villa, O.S.A.",
            "(1843)"
        ],
        [
            "He was born in Castañeda in the Province of Oviedo in Asturias, in 1817.",
            "He received the Augustinian habit in the Colegio de Valladolid in 1832."
        ],
        [
            "R. P. Fray Nicolas Calvo, O.S.A.",
            "(1854)"
        ],
        [
            "A native of Villasarracino, in the province of Palencia; son of Zoilo and Benita Andrés."
        ],
        [
            "Fray Calvo was among the 13 Augustinian priests and 7 friars in minors orders, who were given the Royal permission by Queen Isabela II, on 20 January 1845, to embark from the port of Santander, for Philippine mission."
        ],
        [
            "R. P. Fray Julián Alonso, O.S.A.",
            "(1859)"
        ],
        [
            "He was born in Valladolid in 1833; and son of Felipe Benicio Alonso and Patricia Barriuso.",
            "After having taken religious profession in the Colegio de los Agustinos of the aforementioned city on 13 May 1851 and, having received the Royal mandate of Queen Isabela II earlier, on 25 September 1854 (No.",
            "131), he moved to Manila in 1855 to begin his missionary work in the Philippines."
        ],
        [
            "R. P. Fray Eustaqiuo Torés, O.S.A.",
            "(1870)"
        ],
        [
            "Fray Eustaqiuo Torés was a native of Olmedo, Province of Valladolid; son of Nemesio and Lorenza Sanz."
        ],
        [
            "The young Augustinian went to the Philippines, already a deacon, in 1868, having received earlier, on 4 December 1867, the Royal Order of Queen Isabela II (No.",
            "59), to embark on mission to the Archipelago.",
            "He administered in the province of Iloilo the curates of Banate and Barotac Nuevo in 1870 and 1882 respectively.",
            "In these towns, he built churches made of stone blocks and of wood.",
            "He died in Barotac Nuevo, on May 4, 1888."
        ],
        [
            "R. P. Fray Manuel Santos, O.S.A.",
            "(1882)"
        ],
        [
            "Report regarding the description of the Parish of St. John the Baptist in Banate, Iloilo (Philippines), as well as its people and the properties of the Church in the town.",
            "The report was made by of R. P. Fray Agapito Lope, O.S.A., parish priest of Banate in 1893.",
            "The document was written and signed in Cornago, La Rioja, Spain, and dated 4 August 1911.",
            "The original is in the custody of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain."
        ],
        [
            "He was born in Iglesias (Burgos) in 1853; son of Ruperto an Bonifacio González.",
            "He made his religious profession in the Colegio de Valladolid, on 21 September 1870."
        ],
        [
            "On 13 November 1873, Fray Santos and 9 other Augustinian friars received the permission of the Government of the First Spanish Republic, to embark for mission in the Philippines."
        ],
        [
            "R. P. Fray Lazaro Ramirez, O.S.A.",
            "(1890)"
        ],
        [
            "This religious was born in Bergüenda (Alava).",
            "After embracing the monastic life in the Colegio de Valladolid in 1879 at the age of seventeen, he arrived in the Philippine Archipelago, already a deacon, in 1886.",
            "Ordained as a priest in December of this same year, he studied the Panay dialect in the town of Santa Bárbara.",
            "He served the parishes of Mina in 1888, Banate 1890, Ajui in 1892, and Pavia from 1895 to 1898.",
            "It was from Pavia where, full of the spirit of God and eager to preach the Gospel to the pagans, he went to the missions of Hun-Nan (China) where he continued to work in such a glorious zeal.",
            "He finished building the beautiful church of Pavia and prepared it for sacred cult."
        ],
        [
            "R. P. Fray Agapito Lope, O.S.A.",
            "(1893)"
        ],
        [
            "Native of Cornago in La Rioja.",
            "He was born on 24 March 1859.",
            "He did his first religious profession in the Colegio de Valladolid, on 25 October 1877.",
            "Fulfilling the mandate of his superiors, he left Spain for the Philippines, to whose capital he arrived on 10 September 1884.",
            "In the Philippines, after completing his regular studies, he was assigned as parish priest of Barotac Viejo (1886), S. Miguel (1890), Bánate (1892), Dingle (1893), Igbarás (1894), Librarian of the convent of the Santo Niño de Cebú (1895), parish priest of Dueñas (1897) and associate of the parish priest of Maasin (from the month of September of that year until November 1898.)",
            "He died in Spain in the early 1900s."
        ],
        [
            "An extant document of the Report made by Fray Lope regarding the description of the Parish and its people, as well as describing the Church properties in Banate, exists in the custody of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain."
        ],
        [
            "R. P. Fray Bernardo Arquero, O.S.A.",
            "(1893)"
        ],
        [
            "He was born in the town of Ocaña, province of Toledo, on August 20, 1864.",
            "He was professed in Valladolid in 1880, and was ordained a priest in the following year upon his arrival in the Philippine Archipelago.",
            "He was parish priest of Dueñas in 1889, and of Banate from 1893 to 1898.",
            "Afterwards he served as professor of the Seminary of Manaus, of the State and Diocese of Amazons (Brazil).",
            "His name is cast on the largest bell of Banate."
        ],
        [
            "Fray Arquero is also known for the manuscript he redacted on 1 January 1897, regarding the statistical data and historical information of the Parish of St. John the Baptist in Banate, Iloilo (Philippines)at the later part of the Spanish rule.",
            "The document can be found in the Archives of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain."
        ],
        [
            "Banate during the American Regime"
        ],
        [
            "Ludovico Arroyo Bañas, (standing in the middle) with his staff at the Office of the Telecommunications Bureau, Region IV, in Iloilo City, c. late 1950s."
        ],
        [
            "When the Americans seized control of Panay at the later part of 1899, Banate was among the first settlements they bombarded and chosen as landing spot for their forces.",
            "On October 27, 1899, General Diocno informed General Delgado of the docking at Iloilo of the USS Concord.",
            "On board were 3,000 troops and 200 horses.",
            "On November 2, two American gunboats bombarded the town of Banate.",
            "On the 5th, American forces began their advance outside the frontlines toward San Miguel.",
            "Landings were made in Banate on November 25, in Capiz and Calivo in December, and in San Jose de Buenavista in January 1900.",
            "Unable to resist the American advance, the Filipino revolutionaries retreated to the mountains of Panay.",
            "Delgado retreated to the mountains of Lambunao, Diocno to the hills of Aclan, and Fullon to the vicinity of Mt.",
            "Madia-as.",
            "By July 1, 1900, the Panay defenders had opted to shift to guerrilla tactics."
        ],
        [
            "By the beginning of 1901, the disenchanted revolutionaries had run out of men, ammunition, and food.",
            "In February, Delgado surrendered to the Americans.",
            "On March 1, Fullon followed suit, and on March 21, Diocno signed the Paz de Aclan.",
            "Colonel Salas continued the fight until October."
        ],
        [
            "When the American rule was established, the town's population was 6,250 (2973 males and 3277 females)."
        ],
        [
            "When the Revolution broke out in 1898, Ciriaco Fuentes, more popularly known as Capitan Takong, was the Gobernadorcillo.",
            "He was succeeded by Don Eugenio Badilla as the first local President shortly after the town became part of the United States territory in 1901, upon the arrival and takeover of the American soldiers under the command of Commander Brunnel, who established the American rule in Banate."
        ],
        [
            "The town's first officials under the American Regime were the following:"
        ],
        [
            "Don Eugenio Badilla, President"
        ],
        [
            "Don Marcelo Madrid"
        ],
        [
            "Don Florencio Villaluz"
        ],
        [
            "Don Ciriaco Fuentes"
        ],
        [
            "Don Fortunato Perez"
        ],
        [
            "Don Nemesic Badilla"
        ],
        [
            "N. B.",
            "Don Eugenio Badilla, Don Marcelo Madrid, Don Florencio Villaluz were also listed by the second to the last Spanish Friar assigned in Banate as among the distinguished residents of the town during the last years of the Spanish Era."
        ],
        [
            "From 1 October 1901, an American teacher was also stationed in Banate."
        ],
        [
            "During this American, Barotac Viejo and Anilao were reduced as districts under Banate.",
            "The Administrative Act No.",
            "2657 of the Insular Government of the Philippine Islands, dated 31 December 1916, shows Banate as one of the 24 Municipalities in Iloilo, During the term of Benjamin Buyco as President of the town (1936–1939), Anilao was separated from Banate.",
            "Afterwards, Benjamin Buyco also became the first Mayor of Anilao."
        ],
        [
            "During this period, a Banatenhon - Ludovico Arroyo Bañas - was chosen as one of the ten personnel of the American government telegraph service in the Philippines to compose the first and only group of Filipino pensionados who, in 1919, underwent advanced training in wireless telegraphy (radio), at the US Naval Radio School in Cavite.",
            "The training of the ten Filipinos was made possible through a special arrangement between the U. S. Naval Authorities in the Philippines and the Insular Government.",
            "To select the trainees, a special examination was conducted among the 398 students of the Post-Telegraph School."
        ],
        [
            "Geography"
        ],
        [
            "Banate is 51 kilometres (32 mi) from Iloilo City."
        ],
        [
            "Barangays"
        ],
        [
            "Banate is politically subdivided into 18 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "There are 7 barangays which are along the coast and the rest are in the interior uplands."
        ],
        [
            "Alacaygan"
        ],
        [
            "Bariga"
        ],
        [
            "Belen"
        ],
        [
            "Bobon"
        ],
        [
            "Bularan"
        ],
        [
            "Carmelo"
        ],
        [
            "De La Paz"
        ],
        [
            "Dugwakan"
        ],
        [
            "Fuentes"
        ],
        [
            "Juanico"
        ],
        [
            "Libertad"
        ],
        [
            "Magdalo"
        ],
        [
            "Managopaya"
        ],
        [
            "Merced"
        ],
        [
            "Poblacion"
        ],
        [
            "San Salvador"
        ],
        [
            "Talokgangan"
        ],
        [
            "Zona Sur"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Banate, Iloilo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "57(2.2)"
        ],
        [
            "37(1.5)"
        ],
        [
            "41(1.6)"
        ],
        [
            "42(1.7)"
        ],
        [
            "98(3.9)"
        ],
        [
            "155(6.1)"
        ],
        [
            "187(7.4)"
        ],
        [
            "162(6.4)"
        ],
        [
            "179(7.0)"
        ],
        [
            "188(7.4)"
        ],
        [
            "114(4.5)"
        ],
        [
            "78(3.1)"
        ],
        [
            "1,338(52.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.0"
        ],
        [
            "7.7"
        ],
        [
            "9.2"
        ],
        [
            "10.2"
        ],
        [
            "19.5"
        ],
        [
            "24.6"
        ],
        [
            "26.9"
        ],
        [
            "25.1"
        ],
        [
            "25.5"
        ],
        [
            "25.2"
        ],
        [
            "18.0"
        ],
        [
            "13.0"
        ],
        [
            "216.9"
        ],
        [
            "Source: Meteoblue  (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BanateYearPop.±% p.a.1903 5,272—    1918 8,871+3.53%1939 16,210+2.91%1948 10,932−4.28%1960 11,995+0.78%1970 14,179+1.68%1975 16,270+2.80%1980 17,710+1.71%1990 23,364+2.81%1995 24,976+1.26%2000 27,263+1.90%2007 28,714+0.72%2010 29,543+1.04%2015 32,532+1.85%2020 33,376+0.50%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Banate, Iloilo, was 33,376 people, with a density of 320 inhabitants per square kilometre or 830 inhabitants per square mile."
        ],
        [
            "The 1995 National Census on Population and Housing shows that Banate had a total population of 24,976 excluding those residing in Fuentes (a contested barangay between Banate and Anilao).",
            "However, if Fuentes is included, the total population would be 25,597.",
            "Banate has average annual population growth rate of 1.21% based on the population change within the years 1990–1995.",
            "In the year 2010, the town's population reached 29,543."
        ],
        [
            "The Natives of Banate"
        ],
        [
            "Sunrise at Banate Bay"
        ],
        [
            "As any other old Spanish town in the province of Iloilo, the natives of Banate were given surnames starting usually with the letter BA, BAL, BAS, etc.",
            "after the name of the town itself.",
            "This is also true for Barotac Viejo which was once a part of the pueblo which is why one can notice even up to the present that both towns share some families/clans with the same surnames."
        ],
        [
            "Household"
        ],
        [
            "Barangay Carmelo, Banate"
        ],
        [
            "The 1995 Census of Population and Housing (which includes Fuentes) recorded a total of 4,761 households with an average household size of 6 person per household for the urban area, and 5 persons per household for the rural area.",
            "The urban area, comprising Poblacion, Alacaygan, Bularan, Carmelo, Talokgangan and Zona Sur, had a total household of 1,653.",
            "The 12 rural barangays had a total of 2,908 households with San Salvador having the highest number households (480)."
        ],
        [
            "The 12 barangays belonging to the rural area had a population of 15,772 or about 62% of the total population of Banate.",
            "Of the 12 barangays, San Salvador had the highest population (2,380 or 9.31%), while Fuentes, (a disputed barangay between Banate and Anilao) had the least population of only 621 persons or 4% of the rural population, since some residents considered themselves residents of Anilao."
        ],
        [
            "Population density"
        ],
        [
            "Banate has an A & D area of 5,240.849 and a population of 25,597 as of 1995.",
            "The municipal gross density is 500 people/km2.",
            "Urban density is 1600 people/km2, of which Bularan is the highest having a density of 15,700 people/km2.",
            "In the rural area, population density is 300 people/km2.",
            "As projected, within the twelve (12) year period (1999–2010), the municipal gross population density will increase from 500 to 600 people/km2."
        ],
        [
            "Age-sex distribution"
        ],
        [
            "Of the 25,597 (as of 1995), the male population has numbered 12,949 or 50.59% with those in the age bracket of 5 – 9 years old having the highest population (1,743 or 13%).",
            "The age bracket with the lowest percentage are those with the age ranging from 85 years old and above (30 or 0.23%).On the other hand, female population has reached to 12,648 or 49.41% with those in the age range of 5 – 9 years old having the highest number (1,649 or 13%).",
            "The female residents with age range of 85 and above number 48 or 0.38%.",
            "The date of the census of 1995 shows that the ratio of male and female residents is 102:100."
        ],
        [
            "Religion"
        ],
        [
            "Devotion to the Blessed Virgin Mary is popular among the Roman Catholics who compose the majority of the residents in Banate, as well as among the members of the Aglipayan denomination, which has a considerable number of followers in the town."
        ],
        [
            "Based on the 1990 record, the majority of the Banatenhon's are Roman Catholics (16,338 or 70%); the next religious denomination with the second highest number of adherence are the Aglipayans or the members of the Philippine Independent Church (5,057 or 22%); there are 750 Protestants who comprise 3% of the population; Iglesia ni Kristo has 203 churchgoers or 1% of the population; and members of other religious sects like United Church of Christ in the Philippines, Jehovah's Witnesses, Seventh Day Adventist, Muslims, etc.",
            "number 1,012 or 4% of the local population."
        ],
        [
            "Statistics on marriage"
        ],
        [
            "A greater percentage of the population 10 years old and over are single (49.32%) than married (45.75%).",
            "About 3.73% are widowed; 0.37% are separated; and 0.82% are common law partners and unknown.",
            "The number of unmarried persons is higher among the adult males (4,840) as compared with those who are married (4,174).",
            "Among adult females the proportion of married persons is higher (4,253 or 23.09%) than those who are unmarried (4,245 or 23.05%)."
        ],
        [
            "Language"
        ],
        [
            "Majority of the people living in Banate speak Hiligaynon or 99.54% and 0.46% of the population speaks other Visayan dialects.",
            "English and Tagalog are also understood and spoken, and are also used in school, business, and government day to day transactions."
        ],
        [
            "It is notable that when Banatenhons speak Hiligaynon, people from other places could easily distinguish the accent, most of the time dismissing the Banatenhons as Dumangasanons.",
            "Among the towns in the surrounding area, only Banate and Dumangas speak pure Hiligaynon, as opposed to other towns whose native tongue is Kinaray-a."
        ],
        [
            "Labor force"
        ],
        [
            "As of 1990 the labor force numbered 13,643 persons or 57% of the total population.",
            "Of these, there are 6,747 or 49.45%  male and 6,896 or 50.55% female ranging the age 15 years old and above.",
            "Of the 13,643, 7,886 have stable employment.",
            "5,239 of these are male and 2,647 are female.",
            "Population projection shows that from 1995 to the year 2010, the population growth rate is 1.21%.",
            "This means an additional potential work force for the municipality, which when properly exploited will generate a maximum income to the town of Banate.",
            "The labor force within the twelve (12) year period (1999–2010) will reach to 18,683 and 11,527 of these, will be economically active labor force (15 years old and over)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Banate"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  26.60"
        ],
        [
            "2009  19.77"
        ],
        [
            "2012  24.17"
        ],
        [
            "2015  22.65"
        ],
        [
            "2018  18.80"
        ],
        [
            "2021  21.40"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Economic dependency ratio"
        ],
        [
            "As of 1995, a total of 10,711 persons with ages below 15 and over 64 years old are considered dependents; 14,625 belong to the working population with ages 15–65 years old.",
            "Hence, there are 7 dependents out of 10 working persons."
        ],
        [
            "Municipal income"
        ],
        [
            "Being a very versatile town with livelihood income both coming from the sea and the farmlands, Banate has generated actual income from calendar year 1995 to calendar year 1999 reaching up to P82,167,999.30.",
            "The increase of the town's income was mainly due to the increase in revenue allotment, tax, and operating revenue of the municipality.",
            "It could be observed that Banate is increasingly growing in commerce and industry."
        ],
        [
            "Historical landmarks"
        ],
        [
            "Two historical landmarks in Banate dating back to the Spanish colonial period.",
            "Left to right:  Ancestral tomb of the Balderas-Baviera Clan of Banate at the Roman Catholic Cemetery of the town."
        ],
        [
            "Landmarks during the Colonial Period"
        ],
        [
            "Three Stone Bastions located at the shore that defended the town of Banate, from marauding Muslims of Mindanao."
        ],
        [
            "Municipal Hall made of wood."
        ],
        [
            "Parochial Church  made of strong materials up to the tower, with zinc and galvanized steel roof.",
            "It has three naves with a transept and three altars;"
        ],
        [
            "School made of (bamboo) cane."
        ],
        [
            "Parochial House made of chosen woods.",
            "The aforementioned parish house was supported by a dozen molave harigues of extraordinary enormity of eighty centimeters in diameter.",
            "It had zinc roof.",
            "Until the year one thousand eight hundred and ninety and nine, there was another parish house that existed next to the beach.",
            "That, too, was made of strong materials until the upper floor, and the roof was made of wood with covered of nipa.",
            "From this house the harigues or pillars were removed to build the new parochial house."
        ],
        [
            "Cemetery about five hundred meters distant from the Poblacion settlement; and located on the road that leads to the mountain near the hill called \"Cambang-bato\", which was enclosed by a short wall"
        ],
        [
            "The Municipal Hall, Church, School, and the Cemetery were made under the supervision of R.P.",
            "Fray Eustaquio Torés, O.S.A., while the Parochial House was made by R.P.",
            "Fray Manuel Santos, O.S.A."
        ],
        [
            "Roman Catholic Church"
        ],
        [
            "The Roman Catholic Parish Church of Saint John the Baptist of Banate, in Iloilo, Philippines.",
            "It has had several renovations since it was built in 1870."
        ],
        [
            "Bells cast by Hilario Sunico for St. John the Baptist Parish in Banate, Iloilo (Philippines) during the incumbency of the Fray Bernardo Arquero, O.S.A.",
            "as parish priest (1893-1898).",
            "Left to right:  the smallest bell."
        ],
        [
            "The Catholic parish of Banate celebrated its 250th foundation anniversary in 2013.",
            "The Catholic community was established in Banate by the friars of the Augustinian Order in 1763, when Fray Alejandro Arias was assigned to in the town."
        ],
        [
            "The present church was erected under the supervision of Fray Eustaqio Torés, OSA in 1870.",
            "But was left unfinished when Fray Torés was transferred to Barotac Nuevo, where he also built another church."
        ],
        [
            "Sample of entries in old Canonical Books of St. John the Baptist Roman Catholic Church.",
            "Left to right:  Registry of the matrimony of Josefina Madrid, daughter of Don Marcelo Madrid and Doña Maria Balderas, to Francisco Brillantes, son of Aquilino Brillantes y Juanico (grandson of Doña Lucia Balderas and Don Tomas Juanico, Gobernadorcillo of Banate in 1855-1856, by their daughter Doña Andrea Juanico y Balderas and Don Vicente Brillantes y Blancaflor) and Francisca Pelagio, on 7 January 1923."
        ],
        [
            "The last Augustinian curate of Banate, Fray Bernardo Arquero, OSA, commissioned the three bells donated by Doña Carmen Baban and cast by the renowned bell caster Hilario Sunico.",
            "The campana mayor is one of the largest in the island but it is, unfortunately, broken.",
            "It is the last existing old Augustinian-built church in the north.",
            "It was built under forced labor.",
            "The parish also boasts of having complete old baptismal, marriage and death records dating back to the early 1900s which can be found in the parish office."
        ],
        [
            "Parish and Assistant Priests who served the Parish of Banate from 19-present (records from 1763–1898, 1899–1909, 1941–44"
        ],
        [
            "Reverendo Padre Ezequiel Pioquinto"
        ],
        [
            "RP Mayolo Silva"
        ],
        [
            "RP Doroteo Imperial - Parroco Interino (Acting Parish Priest)"
        ],
        [
            "RP Mayolo Silva"
        ],
        [
            "RP Ramon Declaro - Parroco Interino"
        ],
        [
            "RP Mayolo Silva"
        ],
        [
            "RP Carlos Legislador - Cura Parroco de Barotac Viejo y encargado de la parroquia de Banate"
        ],
        [
            "RP Tomas Paguntalan"
        ],
        [
            "RP Gregorio Rosaldes"
        ],
        [
            "RP Pedro Sedantes"
        ],
        [
            "RP Miguel Tadifa - Parroco Interino"
        ],
        [
            "RP Pedro Sedantes"
        ],
        [
            "RP Vicente Silloras"
        ],
        [
            "RP Jose Villasis"
        ],
        [
            "RP Ireneo Pontiliano"
        ],
        [
            "RP Francisco Garcisto"
        ],
        [
            "RP Policarpio Parcon"
        ],
        [
            "N.B."
        ],
        [
            "During the time of Fr.",
            "Parcon, the Congregation of the Most Holy Redeemer (Redemptorist Fathers) had a mission in Banate, during which a number of Aglipayans converted to Catholicism, as noted in the parish register of Baptisms.",
            "The Redemptorists fathers were: RP Patrick Scott, CSsr, and RP William Daley, CSsr."
        ],
        [
            "RP Ramon Declaro"
        ],
        [
            "RP Mons.",
            "Panfilo Brazil"
        ],
        [
            "RP Amadeo Escanan - Parroco Auxiliar"
        ],
        [
            "RP Francisco Celda"
        ],
        [
            "RP Agapito Sumbong"
        ],
        [
            "RP Quirino Palma, Jr. (1980-1996)"
        ],
        [
            "RP Elmer Tababa - Parroco Auxiliar"
        ],
        [
            "RP Ramon Sequito - Parroco Auxiliar"
        ],
        [
            "RP Ildefonso Tagamolila - Parroco Auxuliar"
        ],
        [
            "RP William Villalobos - Parroco Auxiliar"
        ],
        [
            "RP Francisco Gabriel - Parroco Auxilar"
        ],
        [
            "RP Francisco Apologista (1996-2001)"
        ],
        [
            "RP Nicasio Lesondra (2001-2003)"
        ],
        [
            "RP Lorenzo Camacho (2003-2005)"
        ],
        [
            "RP Winifredo Losaria (2005-2011)"
        ],
        [
            "RP Edgar Palmos (2011-2017)"
        ],
        [
            "RP Franklin Pilaspilas (2017–2023)"
        ],
        [
            "RP Jerry Recabar-Locsin (2023-present)"
        ],
        [
            "Culture"
        ],
        [
            "The centuries-old ivory image of Mater Dolorosa belonging to the descendants of Capitan Don Martin Balderas, Gobernadorcillo of Banate in the 19th century.",
            "The Dolorosa is one of the centuries-old cultural patrimony icons of Banate, seen only during the Good Friday procession."
        ],
        [
            "The Christian faithful waiting their turn to venerate the Santo Entierro after the Good Friday Procession.",
            "Duaw, as it is commonly known in Banate, is one of the customs of Banatenhons during the Semana Santa Celebration."
        ],
        [
            "San Juan Fiesta"
        ],
        [
            "Every year, since 1855, the town of Banate celebrates the feast of its Patron St. John the Baptist, on the 24th of June."
        ],
        [
            "Semana Santa Celebration"
        ],
        [
            "Banate has, for centuries, also observed the Holy Week celebration in the traditional Catholic custom.",
            "The town boasts of antique ivory religious images, which are only seen displayed during the Easter Triduum celebrations and processions.",
            "Both the Roman Catholic and the Aglipayan Communities in this town have preserved the Western and Catholic way of making the memory of the passion, death and resurrection of Jesus Christ alive through the heritage received from the Spaniards, who evangelized the town for centuries.",
            "The meditation on the seven last words of Jesus and the re-enactment of his last moments on calvary attract devotees from neighboring towns on Good Fridays."
        ],
        [
            "Kasag Festival"
        ],
        [
            "Members of \"Tribu Kurusan\" performed a dance number for the Kasag Festival Cultural Dance Drama 2022 championship in December of 2022."
        ],
        [
            "For over 17 years in the making, the Kasag festival came as an offshoot of the Annual Street Dancing Competition as the highlight of the Annual Town Fiesta, and the promotion of the town's famed product, the Blue Crabs  (scientific name: Portunus Pelagicus which translates to “savory beautiful swimmer”), through as the Municipality's One Town One Product (OTOP) project.",
            "The idea of the Kasag Festival as a vessel for the promotion and marketing of the town product sprung from the OTOP Coordinator during the OTOP presentation at Passi City,"
        ],
        [
            "Previous Street Dancing Competitions were held every 24th day of June, as one of the highlights of the final day of the Annual Town Fiesta honoring and thanking God through the intercession of St. John the Baptist for the fruitful year spent.",
            "However, the activities meant at integrating Kasag Festival with the Feast of St. John the Baptist proved to be such a tedious endeavor for Banatenhons, requiring much of their time and effort.",
            "Most often, this results in distractions, if not deviations, from the original essence and spirit of the religious fiesta which is about the devotion to St. John the Baptist and thanksgiving to the Almighty God."
        ],
        [
            "With the implementation of the DTI's One Town One Product (OTOP), Banate identified Kasag (Blue Crab) as the prevalent and flourishing fishery-based industry thus making it Banate's OTOP.",
            "Promoting the new product and incorporating the product with the festival was conceptualized by the people in charge of OTOP."
        ],
        [
            "With the positive response from the Local Chief Executive, all systems go for the First Kasag Festival Celebration; with \"young blood\" from the newly elected public officials and the desire to promote Banate's One Town One Product as well as Banate's Tourism Development the First Kasag Festival came into celebration in December 2007."
        ],
        [
            "Food Courts of various mouth-watering and native delicacies were there to give justice to the ever-craving and discriminating taste of Ilonggos.",
            "A nightly Singing contest to entertain and showcase the singing prowess of Banatenhons was staged.",
            "Daily entertaining activities like Laro ng Lahi (old Filipino games), Basketball Tournaments and search for Mutya sang Kasag were organized topped by the eagerly anticipated all-new Street Dancing Competition based on the idea of Kasag's preservation for future generations and Kasag's nature and thanksgiving to the bountiful season of fishing."
        ],
        [
            "Participation in Other Festivals"
        ],
        [
            "Selected Kasag performers regularly compete in other festivals.",
            "Banate is represented by Tribu Kasag in the Kasadyahan portion of the Dinagyang Festival every January in Iloilo City.",
            "The Kasag festival also competes in the Aliwan Fiesta held every April in Metro Manila.",
            "Both Tribu Kasag and the Kasag Festival have won several awards, including the Kasadyahan championship trophy in 2009"
        ],
        [
            "Nota Bene: History of \"Tribu Kasag\" and its antecedent Tribes."
        ],
        [
            "Since 1987, Banate has participated in the well-known Kasadyahan Festival which takes place before Iloilo City's Dinagyang Festival.",
            "Tribu Kasway has represented the town from the year 1987 to 1993.",
            "After then, from 1995 to 1999, the town changed the group's name to Tribu Hugyaw.",
            "They won 2nd Place in 1999.",
            "Tribu Panagat, the newly adapted name, was Kasadyan Festival's winning group in the year 2000.",
            "It continued to represent the town of Banate until 2003.",
            "From 2004 to 2005, the name \"Tribu Hugyaw\" was re-adapted by the group."
        ],
        [
            "Later and until the present, \"Tribu Kasag\" represents Banate at the Dinagyang Festival as well as at other festivals in the Province of Iloilo and national competitions of the same kind.",
            "The current \"cultural ambassadors of Banate\" are known for their merry and lively dance which depicts the townpeople's livelihood as fishermen, and the town's famed product: \"Kasag\" or crab(s)."
        ],
        [
            "Awards (of Tribu Kasag):"
        ],
        [
            "Kasadyahan Competition 2008 - 1st Runner-up, Best in Demonstration, Best in Choreography."
        ],
        [
            "Kasadyahan Competition 2009 - Grand Champion, Best in Production Design, Best in Choreography, Best in Performance."
        ],
        [
            "Aliwan Festival 2009 (National Competition)- 2nd Place."
        ],
        [
            "Kasadyahan Competition 2010 - Grand Champion, Best in Performance, Best in Choreography, Best in Music, Best in Costume."
        ],
        [
            "Government"
        ],
        [
            "List of former chief executives"
        ],
        [
            "Record found in the National Archives in Manila showing the election of Don Tomas Juanico as Gobernadorcillo of Banate, whose name is written on the 17th line from the bottom."
        ],
        [
            "Gobernadorcillos of Banate since 1837:"
        ],
        [
            "Felix Baviera (1837)"
        ],
        [
            "Alfonso Arroyo"
        ],
        [
            "Eustaquio Fuentes"
        ],
        [
            "Pasqual Baylon (1844–45)"
        ],
        [
            "Ricardo Baban"
        ],
        [
            "Tomas Juanico (1855–56)"
        ],
        [
            "Apolinario Arroyo"
        ],
        [
            "Mariano Fuentes"
        ],
        [
            "Martin Balderas"
        ],
        [
            "Nepomuceno Fuentes"
        ],
        [
            "Apolinario Juanico"
        ],
        [
            "Mateo Baban"
        ],
        [
            "Julian Bactung"
        ],
        [
            "Sotero Fuentes (1889–91)"
        ],
        [
            "Feliciano Espinosa"
        ],
        [
            "Ciriaco Fuentes (1898–1900)"
        ],
        [
            "Presidents elected for Banate during the American regime:"
        ],
        [
            "Eugenio Badilla (1901–03)"
        ],
        [
            "Mauricio Tupas (1903–05)"
        ],
        [
            "Florencio Villaluz (1905–07)"
        ],
        [
            "Victorio Vargas (1907–09)"
        ],
        [
            "Juanito Balleza (1910–12)"
        ],
        [
            "Alejandro Baban (acting/appointed–1918)"
        ],
        [
            "Felix Tarrosa  (acting/appointed–1918)"
        ],
        [
            "Elpidio Padilla (1918–20)"
        ],
        [
            "Fernando Banaria(1921–23)"
        ],
        [
            "Elpidio Baylen (1924–26)"
        ],
        [
            "Paulo Badilla (1927–29)"
        ],
        [
            "Fortunato Perez (1930–32)"
        ],
        [
            "Mayors of Banate during the U.S. commonwealth government:"
        ],
        [
            "Manuel Bacabac (1933–35)"
        ],
        [
            "Benjamin Buyco (1936–39), during whose term Anilao was separated from Banate.",
            "Afterwards, Benjamin Buyco also became the first Mayor of Anilao."
        ],
        [
            "Paulo Badilla (1939–40)"
        ],
        [
            "Mayors of Banate during the Japanese occupation and after the liberation:"
        ],
        [
            "Exequiel Palec (1941)"
        ],
        [
            "Simeon Balladares (1941–liberation)"
        ],
        [
            "Exequiel Palec (liberation–1947)"
        ],
        [
            "Banate Municipal Hall"
        ],
        [
            "Mayors of Banate during the time of the republic:"
        ],
        [
            "Exequiel Palec (1948–51)"
        ],
        [
            "Jose Babayo (1952–55)"
        ],
        [
            "Nicolas Tarrosa (1955–59)"
        ],
        [
            "Exequiel Palec (1959–63)"
        ],
        [
            "Marcelino Bacabac (1964–67)"
        ],
        [
            "Antonio T. Seyan (1968–82)"
        ],
        [
            "Leonardo A. Cabangal (1982–86)"
        ],
        [
            "Jonathan V. Sanico (1986–88)"
        ],
        [
            "Jonathan V. Sanico (1988–92)"
        ],
        [
            "Vicente V. Bacos (1992–2001)"
        ],
        [
            "Renerose B. Caborubias (1 July 2010–13 May 2013)"
        ],
        [
            "Carlos O. Cabangal, Jr. (2001–2010, 2013–2022)"
        ],
        [
            "Peter Paul T. Gonzales (2022–present"
        ],
        [
            "Transportation"
        ],
        [
            "Banate has a port for boats that transport passengers and local products, like rice and bananas, to the island of Negros, which in turn, exports sugar and organic produce to this town."
        ],
        [
            "Banate-Negros Occidental Bridge"
        ],
        [
            "On July 30, 2006, governors from 16 provinces of the Visayas met at the Provincial Capitol of Negros Occidental in Bacolod City to discuss the construction of bridges linking Panay, Negros, Cebu, Bohol, and Leyte.",
            "They call these bridges the Trans-Visayas Friendship Bridges.",
            "Among these bridges would be the Banate-Negros Occidental Bridge, which would link the Island of Negros to the Island of Panay."
        ],
        [
            "Notes"
        ],
        [
            "^ The logical location of \"Sinabaan\" would be what is now Barotac Viejo.",
            "The fact that this town had a history of being attached to Banate, also during the American period, as well as its proximity to Banate support to this theory.",
            "Besides, Fr.",
            "Murillo Velarde's 1734 Map shows the name \"Banate Viejo\" extending also over areas where the present Barotac Viejo is located.",
            "Another possibility could be San Rafael or San Enrique.",
            "However, in Banate's history, there seems to be no reference to this old town's close interaction during the previous centuries with the other two new towns in Iloilo."
        ],
        [
            "^ After the World War II, significant renovations and repairs of the Church were made possible through the efforts of several parish priests, like Rt.",
            "Rev.",
            "Mons.",
            "Panfilo T. Brazil, H.P., J.C.D., and Rev.",
            "Fr.",
            "Quirino Palma, Jr., who succeeded to complete the roof project in 1996.",
            "The Bell tower on the right was constructed by Fr.",
            "Celda in 1975; and the bigger one on the left, by Rev.",
            "Fr.",
            "(Col.) Nicasio Lisondra (former Chief of the Philippine Army Chaplains, who became acting parish priest of Banate from 2000–2002) and by the current pastor, Fr.",
            "Winifredo H. Losaria, who also led the Banatenhons in building the present parish rectory."
        ],
        [
            "^ This section was transferred from what was before the introductory part for the section about the Presidents of Banate during the American Regime."
        ],
        [
            "^ The free-standing belfry on the right of the Church façade was constructed during the time of Fr.",
            "Celda, through the contribution of parishioners and of their relatives working in other cities in the Philippines and abroad."
        ],
        [
            "^ Fr.",
            "Palma was known in Bnate for his active involvement in the Neocatechumenal Way and has known and worked with Kiko Argüello and other priests in the Archdiocese of Jaro in establishing the first Communities of this movement in the Philippines.",
            "The Neocatechumenal Communities in Banate were among the first three in the Philippines.",
            "They trace their roots in the Parish of Santa Ana in Molo (Iloilo City), which was founded by Argüello himself in the early 1980s.",
            "The other parish which has the second oldest Community in the Philippines is the Santo Niño Parish of Arevalo, Iloilo City."
        ],
        [
            "^ Fr.",
            "Palma is also remembered for his tireless work of encouraging the parishioners (of this once sleepy parish) at taking more active roles in the life of the Church.",
            "He was the first parish priest to have introduced a Parish Pastoral Council in this town.",
            "He also labored toward the renovation of the Church, including the replacement of the old roof with the new one with steel trusses, while sacrificing and choosing to live in an old rectory."
        ],
        [
            "^ Fr.",
            "Palma celebrated his Silver Sacerdotal Anniversary in Banate in 1987.",
            "Twenty-five years later, while already assigned in another parish, he returned to Banate to celebrate his Golden Sacerdotal Anniversary, which was participated enthusiastically by his devoted friends and former parishioners, who contributed food and expenses in order to make this special occasion a memorable one, and in order to express their gratitude and love for Fr.",
            "Palma."
        ],
        [
            "^ Fr.",
            "Sequito was known in Banate for his active apostolate in the Charismatic movement.",
            "Later in his ministry, he founded a group of lay evangelists, which paved the way for the establishment of \"Diyos Gugma\" - a popular lay apostolate in the Archdiocese of Jaro, which is engaged in spiritual healing."
        ],
        [
            "^ Fr.",
            "Villalobos later joined the military service as a Chaplain in the Philippine Army."
        ],
        [
            "^ Rev.",
            "Fr.",
            "Nicasio Lisondra spent most of his life as a military chaplain.",
            "He retired in 1996 with the rank of Colonel, serving as the Chief Chaplain of the Philippine Army.",
            "His retirement years were spent as parish priest of Banate."
        ],
        [
            "^ The current concrete rectory was completed during the time of Fr.",
            "Losaria.",
            "Generous contributions from parishioners and their families poured in, also for the construction of the concrete fence of the Church property."
        ],
        [
            "^ There was no agreement among sources as to who was the last Gobernadorcillo of Banate.",
            "Some say, the last Gobernadorcillo was Feliciano Espinosa.",
            "Others would say that it was Ciriaco Fuentes who was known to the inhabitants as Capitan Takong.",
            "However, no extant official records has been found so far to support these claims since the municipal archives was burnt by the Japanese soldiers during their occupation of the town in World War II."
        ],
        [
            "^ During the outbreak of World War II, the Provincial Governor of Iloilo,  Tomas Confesor, appointed Simeon Balladares as Mayor.",
            "Consequently, Exequiel Palec was impeded to govern.",
            "However, he resumed his office as Mayor after the War."
        ],
        [
            "^ On November 6, 1986, after the EDSA I Revolution, President Corazon C. Aquino appointed Jonathan V. Sanico as Mayor of Banate."
        ],
        [
            "^ Caborubias is the first female Mayor of Banate."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Banate |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Cf, Sebastian Santa Cruz Serag, The Remnants of the Great Ilonggo Nation, Sampaloc, Manila: Rex Book Store, 1997, p. 21."
        ],
        [
            "^ a b Ilongo, Vic.",
            "\"Iloilo History Part 1\".",
            "Research Center for Iloilo.",
            "Archived from the original on 2016-03-04."
        ],
        [
            "^ Cf.",
            "Archivo Histórico Hispano-Agustiniano y Boletin Oficial de la Provincia del Smo.",
            "Nombre de Jesús de Filipinas, 1922: Imprenta del Monasterio de El Escorial, Vol.",
            "XVII (Enero-Junio de 1922), pp.",
            "292-293."
        ],
        [
            "^ a b \"También fundó convento el Padre Fray Martin de Rada en Araut- que ahora se llama el convento de Dumangas- con la advocación de nuestro Padre San Agustín… Está fundado este pueblo casi a los fines del río de Halaur, que naciendo en unos altos montes en el centro de esta isla (Panay)… Es el pueblo muy hermoso, ameno y muy lleno de palmares de cocos.",
            "Antiguamente era el emporio y corte de la más lucida nobleza de toda aquella isla...Hay en dicho pueblo algunos buenos cristianos… Las visitas que tiene son ocho: tres en el monte, dos en el río y tres en el mar...Las que están al mar son: Santa Ana de Anilao, San Juan Evangelista de Bobog, y otra visita más en el monte, entitulada Santa Rosa de Hapitan.\"",
            "Gaspar de San Agustin, O.S.A., Conquistas de las Islas Filipinas (1565–1615), Manuel Merino, O.S.A., ed., Consejo Superior de Investigaciones Cientificas: Madrid 1975, pp.",
            "374-375."
        ],
        [
            "^ Munoz, Paul Michel (2006).",
            "Early Kingdoms of the Indonesian Archipelago and the Malay Peninsula.",
            "Singapore: Editions Didier Millet.",
            "p. 171.",
            "ISBN 981-4155-67-5."
        ],
        [
            "^ Pedro Alcantara Monteclaro, Maragtas.",
            "Janiuay: 1854 (translated in English by Esther Abiera, et al., and currently in the Library of the University of Michigan), pp.",
            "17-18."
        ],
        [
            "^ Pedro Alcantara Monteclaro, Maragtas.",
            "Janiuay: 1854 (translated in English by Esther Abiera, et al., and currently in the Library of the University of Michigan), pp.",
            "21-22."
        ],
        [
            "^ Cf.",
            "Sub-section \"The Residencia and The Visita\" of the History of the Philippines (1521–1898)."
        ],
        [
            "^ Cf.",
            "Fr.",
            "Juan Fernandez, O.S.A, Monografias de los pueblos de la isla de Panay in Monographs of the Towns of Panay, Jose Espinosa, Jr., trans., Iloilo City: University of San Augustine, 2006, pp.",
            "---."
        ],
        [
            "^ Gaspar de San Agustin, O.S.A., Conquistas de las Islas Filipinas (1565–1615), Manuel Merino, O.S.A., ed., Consejo Superior de Investigaciones Cientificas: Madrid 1975, pp.",
            "374-375."
        ],
        [
            "^ The ancient towns and their visitas explicitly illustrated in the map are: Arevalo, Iloilo (extends to Pavia Santa Barbara , Cabatuan and Maasin), Molo, Jaro ( stretching to current Lapaz and Leganes), Guimbal, Tigbaun, Oton, Dumangas, Anilao, Banate, Barotac (Nuevo), Ajuy Dulano, Laglag, Pase, Alimodian.",
            "Cf.",
            "Inset for Fr.",
            "Murillo Velarde's 1734 Map."
        ],
        [
            "^ a b c d e Cf.",
            "Archivo Histórico Hispano-Agustiniano y Boletin Oficial de la Provincia del Smo.",
            "Nombre de Jesús de Filipinas, 1922: Imprenta del Monasterio de El Escorial, Vol.",
            "XVII (Enero-Junio de 1922), p. 293."
        ],
        [
            "^ Cf.",
            "Libro de Gobierno de la Provincia del Santissimo Nombre de Jesús de Filipinas, Augustinian Archives in Valladolid and Madrid, Spain, VI, fol.",
            "75v."
        ],
        [
            "^ a b c Cf.",
            "Fr.",
            "Juan Fernandez, O.S.A, Monografias de los pueblos de la isla de Panay (Monographs of the Towns of Panay), Jose G. Espinosa, Jr.",
            "(trans.",
            "), with Introduction of Fr.",
            "Policarpio Hernandez, O.S.A., Iloilo City: Panorama Printing, 2006, pp.",
            "64 and 158."
        ],
        [
            "^ Cf.",
            "Elviro J. Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 262."
        ],
        [
            "^ a b c Fr.",
            "Juan Fernandez, O.S.A, Monografias de los pueblos de la isla de Panay (Monographs of the Towns of Panay), Jose G. Espinosa, Jr.",
            "(trans.",
            "), with Introduction of Fr.",
            "Policarpio Hernandez, O.S.A., Iloilo City: Panorama Printing, 2006, p. 64."
        ],
        [
            "^ As of 1833, Banate was still a visita of Dumangas.",
            "Cf.",
            "Fr.",
            "Francisco Villacorta, Administracion espiritual de los Padres Agustinos calzados de la provincia del dulce Nombre de Jesus de las Islas Filipinas (con la especificacion de todos los Religiosos individuos de ella, numero de almas que estan a su cargo, conventos que tienen en el dia, Missiones y Curatos que administran, anos de la fundacion de unos y otros, y Estadistica de ellos), Imprenta de H. Roldan, Valladolid: 1833, pp.",
            "164-165."
        ],
        [
            "^ Manuel Buzeta y Felipe Bravo, Diccionario geografico, estadistico, historico de las Islas Filipinas, Madrid: 1850, Vol.",
            "I, p. 339."
        ],
        [
            "^ \"Está situado en la playa, y tiene tres baluartes de piedra que le defienden.",
            "Su temperamento es de los mejores de la provincia.",
            "Ademas de la agricutura los naturales se dedican á la pesca, de la que extrae para muchos pueblos de la provincia; y las mujeres al finítisimo tejido de la piña.",
            "Es su cura interino el R. P. Fr.",
            "Bartolomé Villa, de 27 años de edad y 4 de ministerio.\"",
            "Padres Agustinos Calzados, Mapa General de las Almas que Administran los PP.",
            "Agustinos Calzados en estas Islas Filipinas, con espresion de los Religiosos Conventos,Situacion Topógrafica de los Pueblos, Industria de sus Habitantes, y Años de su Fundacion.",
            "Manila: 1845, Imprenta de D. Miguel Sanchez, p. 64."
        ],
        [
            "^ a b \"Banate - una visita bastante considerable con su teniente de justicia, en la isla de Panay, provincia de Iloilo, diócesis de Cebu, dependiente en lo civil y eclesial de Barotac Nuevo, hallase situada en la playa del mar, en la parte oriental de la isla... disfruta de buena ventilación, y clima saludable.",
            "Tiene casas de sencilla construcción y buenos baluartes para su defensa de las incursiones de los moros.",
            "sus habitantes si dedican a la agricultura, constituyendo, no obstante, su principal ocupación la pesca para los cuales es esta un ramo de industria considerable por su abundancia.",
            "Antiguamente esta visita y la de Anilao formaban un pueblo considerable que se deshizo por motivo de las frecuentes incursiones de los piratas moros.",
            "En la actualidad, a beneficio de los nuevos baluartes que sus naturales han levantado para defenderse de aquellos vuelven a tomar incremento, y es de esperar que aprovechándose de su ventajosa situación dentro de muy breves anos sera otra vez un pueblo notable.",
            "Productos: abundante arroz, azúcar, tabaco.",
            "Industria: el beneficio de los productos agrícolas y pesca; las mujeres se ocupan en los finos tejidos de pina.",
            "Comercio: la exportación del sobrante de sus artículos agrícolas y industriales.",
            "Población: 4,558 almas, 685 tributos que ascienden a 6,850 reales de plata.\"",
            "Manuel Buzeta y Felipe Bravo, Diccionario geografico, estadistico, historico de las Islas Filipinas, Madrid : , 1850-1851 (Imprenta de José C. de la Peña), Vol.",
            "I, p. 339."
        ],
        [
            "^ a b Cf.",
            "Official Website of the Municipality of Banate, Iloilo, Philippines (retrieved 3 November 2006).",
            "Archived 12 March 2007 at the Wayback Machine"
        ],
        [
            "^ a b \"Está situado en la playa, y tiene tres baluartes de piedra que le defienden.",
            "Su temperamento es de los mejores de la provincia.",
            "Ademas de la agricutura los naturales se dedican á la pesca, de la que e extrae para muchos pueblos de la provincia; y las mujeres al finítisimo tejido de la piña.",
            "Es su cura interino el R. P. Fr.",
            "Bartolomé Villa, de 27 años de edad y 4 de ministerio.\"",
            "Padres Agustinos Calzados, Mapa General de las Almas que Administran los PP.",
            "Agustinos Calzados en estas Islas Filipinas, con espresion de los Religiosos Conventos,Situacion Topógrafica de los Pueblos, Industria de sus Habitantes, y Años de su Fundacion.",
            "Manila: 1845, Imprenta de D. Miguel Sanchez, p. 64."
        ],
        [
            "^ a b c Cf.",
            "Archivo Histórico Hispano-Agustiniano y Boletin Oficial de la Provincia del Smo.",
            "Nombre de Jesús de Filipinas, 1922: Imprenta del Monasterio de El Escorial, Vol.",
            "XVII (Enero-Junio de 1922), p. 293."
        ],
        [
            "^ \"Terminada su carrera literaria en Manila, pasó á Bisayas, donde regentó las parroaquias de Banate y Antique en 1843 y 1847 respectivamente.\"",
            "Elviro J. Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 447."
        ],
        [
            "^ Cf.",
            "Official local election results record for the year 1844–45 found in the National Archives entitled Relacion nominal de los Gobernadorcillos, tenientes, juezes, y alguaciles del año corriente con exposicion de sus Pueblos, p. 8."
        ],
        [
            "^ The text of the Decree reads: “Instruido espediente en el Gobierno Yntendencia de Visayas sobre separacion espiritual de las visitas de Anilao y Banate de su matres Barotac nuevo de la Provincia de Yloilo;he decretado en el con esta fecha lo que sigue.",
            "En vista de lo consultado por ellos Gobernador Militar y Político de la provincia de Yloilo acerca de la utilidad y conveniencia de separare en lo espiritual las visitas de Anilao y Banate de su matres Barotac nuevo, las cuales lo están ya en lo temporal, erigiendose cada uno de ellas en Parroquia, dandoles Cura propria que los administre; con presencia de lo informado por el Exmo.",
            "e Yllmo.",
            "Sór.",
            "Obispo del Cebu, Sór.",
            "Gobernador Yntendente de Visayas, el Devoto Cura Parroco de aquel pueblo de cuanto resulta de este espediente, y de conformidad con el parecer que antecede del Sór.",
            "Asesor General del Gobierno; venga en decretar dicha segregación, constituyendose cada una de las expresadas visitas en Parroquia puesto que ambas de poner reúnen el suficiente numero de tributos para congrua sustentación de un Cura, y tienen Yglesia, Casa Parroquial, y demás edificios que se requieren, procediendose con antelación por el Sór.",
            "Gobernador de la provincia a la demarcación de limites jurisdiccionales entre los dos pueblos que se separan y sus colindantes, a fin de evitase cuestiones que en esta parte pudiera ocurrir.",
            "Comuniquese este Decreto al Exmo.",
            "e Yllmo.",
            "Sór.",
            "Obispo del Cebu, Sór.",
            "Gobernador Yntendente de Visayas, el Sór.",
            "Superintendente, el Subdelegado de Hacienda, y al M. R. P Provincial de Agustinos Calsados para los fines convenientes en los que a cada una de dichas Autoridades corresponda, archivandos el después el expediente.\"",
            "Lo traslade a V.R.",
            "para su conocimiento y a fin de que se sirva proponer las ternas de Religiosos para la provision de los nuevos Curatos.",
            "Dio que a V.R.ma.",
            "Manila 5 Abril de 1850.",
            "Antonio M. Blanco"
        ],
        [
            "^ Cf.",
            "Elviro J. Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 468."
        ],
        [
            "^ Cf.",
            "Report of R. P. Fray Bernardo Arquero, O.S.A, Parish Priest of Banate, dated 1 January 1897.",
            "The document was signed in the Parish Rectory and was later sent to the Augustinian Archives in Valladolid, Spain.",
            "After mentioning the year 1854 in the previous clause referring to the establishment of the town as parish, Fr.",
            "Arquero says:  \"... y fue erigido en parroquia bajo la advocacion de San Juan Bautista en el siguente año\".",
            "The clause \"en el siguente año\" (the following year) indicates the establishment of the patronage in the year 1855."
        ],
        [
            "^ Cf.",
            "Official local election results record for the year 1855 found in the National Archives entitled: Relacion nominal de los Gobernadorcillos y demas Ministros de Justicia que quedan en ejercicio en el año coriente y el entrante de 1856 y con titulos del Superior Gobierno in Elecciones de Gobernadorcillos: Iloilo (1838–1893), p. 51."
        ],
        [
            "^ Fr.",
            "Eustaqiuo Torés took the Augustinian habit in Valladolid in 1861 and professed his simple vows in 1862.",
            "He went to the Philippines in 1868 while still a deacon.",
            "He exercised his ministry in Iloilo in the curates of Banate and Baotac Nuevo in 1870 and 1882 respectively.",
            "Fr.",
            "Torés constructed in these towns the Churches of stone bases and of wood.",
            "He died in Barotac Nuevo on May 4, 1888.",
            "Cf.",
            "Elviro J. Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 535."
        ],
        [
            "^ Fr.",
            "Manuel Santos was born in Burgos in 1853 and professed his vows in the college of Valladolid in 1870.",
            "He was parish associate in Santa Barbara in 1878 and became parish priest of Banate in 1882.",
            "He was constructing the parish rectory of Banate from 1883 until his death on June 29, 1889.",
            "Cf.",
            "Elviro J. Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 595-596."
        ],
        [
            "^ Galente, Pedro G., O.S.A., Angels in Stone: Augustinian Churches in the Philippines, Manila: San Augustine Museum, 1996, p----"
        ],
        [
            "^ Cf.",
            "R. Morales Maza, The Augustinians in Panay, Iloilo City: University of San Augustine, 1987, p. 332."
        ],
        [
            "^ Velmonte, Jose Manuel (1998).",
            "\"Ethnicity and the Revolution in Panay\".",
            "Kasarinlan.",
            "14 (1).",
            "Archived from the original on September 21, 2013 – via Center for Integrative and Development Studies - University of the Philippines."
        ],
        [
            "^ The original manuscript of the report of R.P.",
            "Fray Bernardo Arquero, O.S.A., dated 1 January 1897, on the statistical data and historical information of the Parish of St. John the Baptist in Banate, Iloilo (Philippines).",
            "The first column of the document (Personas con Cedula Personal) identifies the number of persons paying tribute (\"de pago\") and the number of exempted Principales (\"de privilegio y gratis\")."
        ],
        [
            "^ Cf.",
            "Elviro J. Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 595-596."
        ],
        [
            "^ The Archivo Histórico Hispano-Agustiniano y Boletin Oficial de la Provincia del Smo.",
            "Nombre de Jesús de Filipinas of 1922 (p. 293) identifies the first name of Fr.",
            "Arias as “Alejandro”.",
            "However, the more detailed work of Fr.",
            "Elviro Jorde Perez, the Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, published in Manila in 1901, gives “Miguel” as the first name of Fr.",
            "Arias.",
            "This is also the name used by Manuel Buzeta y Felipe Bravo in their Diccionario geografico, estadistico, historico de las Islas Filipinas, which was published in Madrid, in 1850-1851.",
            "(1763)"
        ],
        [
            "^ \"ARIAS (Fray Miguel).",
            "Fué este religioso natural de Villarodrigo, provincia de Léon, é ingresó en el convento de Valladolid el 1734, á la edad de diez y siete años.",
            "Fué misionero de los Italones el 1740, y ministro de Pórac (1744), Magalan y Tarlac (1747), S. Miguel de Mayumo (1747), S. José de los Montes (1750), Anilao (1759), y Guimbál con Banate (1763) y quedó cautivo de los moros el 1764, en el puerto de Tayabas, y fué asesinado por los mismos.\"",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 262."
        ],
        [
            "^ Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 447."
        ],
        [
            "^ Isacio Rodriguez Rodriguez, OSA, Historia de la Provincia Agustiniana del Santissimo Nombre de Jesus de Filipinas, Manila: 1980, p. 195."
        ],
        [
            "^ \"VILLA, (Fr.",
            "Bartolomé).",
            "Nació en Castañeda en la provincia de Oviedo, el año de 1817, vistió el santo hábito en el colegio de Valladolid en 1832, y arribó á estas Islas en Noviembre 1836.",
            "Terminata su carrera literaria en Manila, pasó á Bisayas, donde regentó las parroquias de Banate y Antique el 1843 y 1847 respectivamente.",
            "En 1856 vino á Manila y, habiendo pasado por enfermo al pueblo de Gapán, murió el 2 de Mayo del mencionado año de 1856.\"",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 447."
        ],
        [
            "^ Isacio Rodriguez Rodriguez, OSA, Historia de la Provincia Agustiniana del Santissimo Nombre de Jesus de Filipinas, Manila: 1980, p. 229."
        ],
        [
            "^ \"CALVO (Fr.",
            "Nicolás).",
            "Natural de Villasarracino, de la provincia de Palencia; nació el 1819, emitió sus votos en el Colegio de Valladolid en 1844, y administró en Bisayas las parroquias de San Pedro (1850), Banate (1854) é Igbaras (1858), falleciendo en este últmo pueblo el13 de junio de 1861.\"",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 468."
        ],
        [
            "^ Isacio Rodriguez Rodriguez, OSA, Historia de la Provincia Agustiniana del Santissimo Nombre de Jesus de Filipinas, Manila: 1980, pp.",
            "228-229."
        ],
        [
            "^ Isacio Rodriguez Rodriguez, OSA, Historia de la Provincia Agustiniana del Santissimo Nombre de Jesus de Filipinas, Manila: 1980, pp.",
            "331-333."
        ],
        [
            "^ \"ALONSO (Fr.",
            "Julián).",
            "Nació in Valladolid el 1833, y habiendo profesado en el colegio de la precitada ciudad en 1851, se trasladó a Manila el 1855.",
            "Aquí se le ordenó de presbítero y al poco tiempo le destinó la obediencia á la provincia de Iloilo, donde administró los pueblos de Banate en 1859 y Barotac Nuevo desde el 1865 al 2 deJulio de 1878, fecha de su fallecimiento.\"",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 504."
        ],
        [
            "^ Isacio Rodriguez Rodriguez, OSA, Historia de la Provincia Agustiniana del Santissimo Nombre de Jesus de Filipinas, Manila: 1980, p. 390."
        ],
        [
            "^ Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 535."
        ],
        [
            "^ a b Isacio Rodriguez Rodriguez, OSA, Historia de la Provincia Agustiniana del Santissimo Nombre de Jesus de Filipinas, Manila: 1980, p. 763."
        ],
        [
            "^ \"TORÉS (Fr.",
            "Eustaquio) Tomó el hábito en Valladolid el 1861, y profesó de votos simples el 1862, pasando á Filipinas, ya diácono, en 1868.",
            "Administró , en la provincia de Iloilo, los curatos de Banate y Barotac Nuevo en 1870 and 1882 respectively, y construyó en dichos pueblos las iglesias de piedra silleriá y tabla.",
            "Falleció en Barotac Nuevo el 4 de Mayo de 1888.\"",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 535."
        ],
        [
            "^ Isacio Rodriguez Rodriguez, OSA, Historia de la Provincia Agustiniana del Santissimo Nombre de Jesus de Filipinas, Manila: 1980, p. 409."
        ],
        [
            "^ Isacio Rodriguez Rodriguez, OSA, Historia de la Provincia Agustiniana del Santissimo Nombre de Jesus de Filipinas, Manila: 1980, pp.",
            "408-409."
        ],
        [
            "^ \"SANTOS (Fr.",
            "Manuel).",
            "Nacido en Iglesias (Burgos)el 1853, y profeso en el colegio de Valladolid en 1870.",
            "Fué socio del párroco de Santa Barbara en 1878 y párroco de Banate, (en cuyo pueblo constuyó la casa parroquial) desde 1883 al 29 de Junio 1889, día de su fallecimiento.\"",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, pp.",
            "595-596."
        ],
        [
            "^ \"RAMÍREZ (Fr.",
            "Lázaro).",
            "En Bergüenda (Alava) nació este religioso, que después de abrazar la vida monastica en el precitado colegio de Valladolid el 1879 á los diecisiete años de edad, arribó á este Archipiélago, ya diácono, el 1886.",
            "Ordenado de presbítero en Diciembre de este mismo año, estudió el dialecto panayano en el pueblo de Sta, Bárbara , sirviendo las parroquias de Mina el 1888, Banate 1890, Ajui el 1892 y Pavia desde 1895 al 1898 en que, lleno del espíritu de Dios y deseoso de predicar el Evangelio á cuantos viven en la infidelidad pasó á las misiones de Hun-Nan (China) donde continua trabajando en tan gloriosa tarea.",
            "Terminóla preciosa iglesia de Pavia y la habilitó para culto.\"",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 632."
        ],
        [
            "^ \"LOPE (Fr.",
            "Agapito).",
            "Riojano de Cornago, nacido en 24 de Marzo de 1859, y profeso de votos simples en nuestro colegio de Valladolid el 25 de Octubre de 1877.",
            "Cumpliendo el mandato de sus Superiores salió de España con rumbo á Filipinas, á cuya Capital arribó en 10 de Septiembre de 1884.",
            "Aquí, terminados los estudios regulares, fué párroco de Barotac Viejo (1886), S. Miguel (1890), Bánate (1892), Dingle (1893), Igbarás (1894); Bibliotecario del convento del Santo Niño de Cebú Í1895), cura de Dueñas (1897) y socio del párroco de Maasin (desde el mes de Septiembre de dicho año hasta Noviembre de 1898).",
            "Pasó á España en Mayo de 19--?\"",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 617."
        ],
        [
            "^ The Report says: Brief report about the parish of Banate (Philippines) The undersigned Fr.",
            "Agapito Lope, Augustinian, who was parish priest of the town of Banate, Province of Yloilo (Philippines) at the time of the Spanish Government declares the following: 1˚ That time in this town of Banate, there was a parochial church of strong materials up to the tower, with zinc and galvanized iron cover; it had three naves with a transept and three altars.",
            "It had lands that could serve as an orchard and, in fact, a part of these was used for vegetables and for forage during the time when this writer held the honor of governing the said parish.",
            "They did not have any fence.",
            "These lands covered an extension of some two hundred meters long by a hundred and twenty wide, from the beach following a drain and outlet next to the house of Doña Vicenta Baban and crossing the royal road until behind the church.",
            "The aforementioned parish house held a dozen molave harigues of extraordinary magnitude of eighty centimeters in diameter; the zinc cover.",
            "Up to the year one thousand eight hundred ninety and nine, there was a parish house by the beach made of strong materials (up to the upper floor) and wood, with Nipa roof.",
            "From this house the harigues or pillars were taken to raise the new parish house.",
            "2˚ There was no chapel in the neighborhoods.",
            "3˚ There was a fenced cemetery with a short wall about five hundred meters distant from the housing of the Poblacion, on the road that leads to the mountain near the hill called Cambang-bató.",
            "4˚ That time, the church had no other known assets than those mentioned above.",
            "5) There was above all (I say in order to inform if asked about the truth), the distinguished residents of the said town: Don Eugenio Badilla, Doña Carmen Baban, Don Marcelo (La) Madrid, Don F. Villaluz, Doña Nicolasa Badilla, Doña Apolonia Baban.",
            "And in truth I sign in Cornago, on August 4, 1911.",
            "Fr.",
            "Agapito Lope"
        ],
        [
            "^ Fray Agapito Lope Manuscript 1911, p. 1."
        ],
        [
            "^ Fray Agapito Lope Manuscript 1911, p. 2."
        ],
        [
            "^ In the context of the colonial rule in municipalities of the Spanish Empire, the phrase \"vecinos distinguidos\" were attributed to residents to whom the honorific address \"Don\" and Doña were strictly limited.",
            "In the colonial Philippine context, this phrase refers to the Principalía.",
            "The authors Schröter and Büschges say: \"También en este sector, el uso de las palabras doña y don se limito estrechamente a vecinas y vecinos distinguidos.\"",
            "Beneméritos, aristócratas y empresarios: Identidades y estructuras sociales de las capas altas urbanas en América hispánica, BERND SCHRÖTER and CHRISTIAN BÜSCHGES, eds., Acta Coloniensia: Estudios Ibéricos y Latinoamericanos, no.",
            "4.",
            "Frankfurt: Vervuert Verlag; Madrid: Iberoamericana, 1999, p, 114."
        ],
        [
            "^ The presence of the document indicates that Fray Lope was still alive in 1911, and was still in good health 18 years after his mandate in Banate, as manifested by his hand-writing and signature.",
            "However, as regards his memory of the names of distinguished town residents, the Report shows that he was beginning to forget certain details of information: He wrote the surname of Don Marcelo Madrid as \"Lamadrid\".",
            "He also forgot the first name of Don Florencio Villaluz, simply writing \"D. F. Villaluz\".",
            "Both persons were, together with Don Eugenio Badilla (also mentioned by the Friar), among the town's officials, when order was restored after the Filipino-American War in 1901.",
            "Cf.Annual report of the Philippine Commission / Bureau of Insular Affairs, War Department to the President of the United States, Washington D.C.: 1901, Vol.",
            "I, p. 587."
        ],
        [
            "^ \"ARQUERO (Fr.",
            "Bernardo).",
            "Vió la primera luz en la villa de Ocaña, provincia de Toledo, el 20 Agosto de 1864, profesó en Valladolid el 1880, y fué ordenado de sacerdote en el siguiente año de su arribo á este Archipiélago.",
            "Párroco de Dueñas en 1889, y de Banate desde el 1893 al 1898, es hoy profesor del Seminario de Manaos, del Estado y Diócesis de Amazonas (Brasil).\"",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 634-635."
        ],
        [
            "^ Fray Bernardo Arquero Manuscript 1897."
        ],
        [
            "^ Folio 886/11, Francisco Jalandoni describes formation of the guerrilla bands in Iloilo Province, July 1, 1900, Selected Documents, Philippine Revolutionary Records (PRR), National Library."
        ],
        [
            "^ a b Cf.",
            "Jose Manuel Velmonte, Ethnicity and the Revolution in Panay in Kasarinlan, Volume 14 No.",
            "1.",
            "The author is an Associate Researcher at the UP-Center for Integrative and Development Studies."
        ],
        [
            "^ Annual report of the Philippine Commission / Bureau of Insular Affairs, War Department to the President of the United States, Washington D.C.: 1901, Vol.",
            "I, p. 587."
        ],
        [
            "^ Annual report of the Philippine Commission / Bureau of Insular Affairs, War Department to the President of the United States, Washington D.C.: 1901, Vol.",
            "I, p. 130."
        ],
        [
            "^ \"Fue sobre todo lo dicho pueden informar, si quieren decir verdad los vecinos distinguidos de dicho pueblo; Don Eugenio Badilla, Doña Carmen Baban, Don Marcelo (La)Madrid, Don F. Villaluz, Doña Nicolasa Badilla, Doña Apolonia Baban.\"",
            "R.P.",
            "Fray Agapito Lope, O.S.A., Report on the Statistical information and State of the Parish of Banate (The document can be found in the Archives of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain.",
            "), Cornago (La Rioja, Spain): 4 August 1911, p. 2."
        ],
        [
            "^ Annual report of the Philippine Commission / Bureau of Insular Affairs, War Department to the President of the United States, Washington D.C.: 1901, Vol.",
            "I, p. 514."
        ],
        [
            "^ The Province of Iloilo consists of territory on the southeastern part of the Island of Panay and includes the Island of Guimaras and other adjacent islands.",
            "It comprises the following municipalities: Arevalo, Balasan, Banate, Barotac Nuevo, Buenavista, Cabatuan, Dingle, Dueñas, Dumangas, Guimbal, Iloilo (the capital of the province), Janiuay, Jaro, Lambunao, Leon, Miagao, Oton, Passi, Pototan, San Joaquin, San Miguel, Santa Barbara, Sara, and Tigbauan.",
            "Administrative Act No.",
            "2657, dated 31 December 1916"
        ],
        [
            "^ Iloilo: First district – Composed of the municipalities of Guimbal, Miagao, Oton, San Joaquin, and Tigbauan.",
            "Second district – Composed of the municipalities of Arevalo, Buenavista, Iloilo, and Jaro.",
            "Third district – Composed of the municipalities of Cabatuan, Leon, San Miguel, and Santa Barbara.",
            "Fourth district – Composed of the municipalities of Barotac Nuevo, Dumangas, Dingle, Janiuay, Lambunao, and Pototan.",
            "Fifth district – Composed of the municipalities of Balasan, Banate, Dueñas, Passi, and Sara.",
            "Administrative Act No.",
            "2657, dated 31 December 1916"
        ],
        [
            "^ Telecom Standout in The Telecom News, Philippines: 31 March 1959, p.2."
        ],
        [
            "^ Policarpio Y. Cuanico, Bañas in Personality Section, The Telecom News, Philippines: 31 March 1959, p.missing."
        ],
        [
            "^ Telecom Standout in The Telecom News, Philippines: 31 March 1959, p.2."
        ],
        [
            "^ Policarpio Y. Cuanico, Bañas in Personality Section, The Telecom News, Philippines: 31 March 1959, p.missing."
        ],
        [
            "^"
        ],
        [
            "\"Banate: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 3 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Fue en dicho pueblo de Banate habia una iglesia parroquial de materiales fuertes hasta la torre, con cubierta de zinc y hiero galvanizado; tenia tres naves con crucero y tres altares.\"",
            "R.P.",
            "Fray Agapito Lope, O.S.A., Report on the description of the Parish of Banate and of its people, as well as of the Church properties in the town.",
            "(The document can be found in the Archives of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain.",
            "), Cornago (La Rioja, Spain): 4 August 1911, p. 1."
        ],
        [
            "^ \"Tenia una casa parroquial nueva de maderas escogidas.",
            "Sustentan dicha casa parroquial una docena de harigues de molave de extraordinario grandor de ochenta centimetros de diametro.",
            "La cubierta de zinc.",
            "Hasta el año mil ochocientos noventa y nueve existió junto a la playa una casa parroquial de materiales fuertes hasta el piso superior y maderas con cubierto de nipa - de esta casa se sacaron los harigues ó pilares para levantar la nueva casa parroquial.\"",
            "R.P.",
            "Fray Agapito Lope, O.S.A., Report on the Statistical information and State of the Parish of Banate, Cornago (La Rioja, Spain): 4 August 1911, p. 1.",
            "(The document can be found in the Archives of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain.)"
        ],
        [
            "^ \"Fue habia un cementerio cercado de pequeña tapia a unos quinientos metros distante del caseo de población en el camino vecinal que conduce al monte cerca de la loma llamada Cambang-bato.\"",
            "R.P.",
            "Fray Agapito Lope, O.S.A., Report on the Statistical information and State of the Parish of Banate, Cornago (La Rioja, Spain): 4 August 1911, pp.",
            "1-2.",
            "(The document can be found in the Archives of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain."
        ],
        [
            "^ \"Edificios públicos: iglesia de madera con zócalo de piedra; convento de madera; cemeterio con cerco de caña; escuelas de caña; municipio de madera, todo obra del P. Eustaquio Torés, menos el convento que lo hizo el P. Manuel Santos.\"",
            "Archivo Histórico Hispano-Agustiniano y Boletin Oficial de la Provincia del Smo.",
            "Nombre de Jesús de Filipinas, 1922: Imprenta del Monasterio de El Escorial, Vol.",
            "XVII (Enero-Junio de 1922), p. 293."
        ],
        [
            "^ Cf.",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 262."
        ],
        [
            "^ Cf.",
            "Elviro Jorde Perez, Catalogo Bio-Bibliografico de los religiosos Agustinianos de la Provincia del Santissimo Nombre de Jesus de las Islas Filipinas, Manila: Colegio de Santo Tomas, 1901, p. 535."
        ],
        [
            "^ Fray Agapito Lope Manuscript 1911, p. 1."
        ],
        [
            "^ Fray Agapito Lope Manuscript 1911, p. 2."
        ],
        [
            "^ Cf.",
            "St. John the Baptist Roman Catholic Church, Banate, Iloilo (Philippines), Canonical Books (Baptismal Register, Registry of Marriage) covering the years 1910 to 1940 and 1945 to 2015."
        ],
        [
            "^ Rev.",
            "Tababa was later promoted to the rank of Papal Chaplain with the title of \"Monsignor\"."
        ],
        [
            "^ \"Papal Chaplain (P.C.)",
            "– Invested Filipino Monsignori\".",
            "Archived from the original on 2015-04-02.",
            "Retrieved 2015-03-07."
        ],
        [
            "^ Military Ordinariate of the Philippines in Claretian Communications Foundation, Inc. Archived 2015-04-02 at the Wayback Machine"
        ],
        [
            "^ Directory of Priests of the Archdiocese of Jaro, c.2009."
        ],
        [
            "^ Archdiocese of Jaro c. 2016."
        ],
        [
            "^ News: Mga Pari sa siyudad kag Probinsya sang Iloilo sa Idalum sang Archdiocese sang Jaro, gin-reshuffle, 7 November 2017."
        ],
        [
            "^ Cf.",
            "Report of R.P.",
            "Fray Bernardo Arquero, O.S.A., dated 1 January 1897, on the statistical data and historical information of the Parish of St. John the Baptist in Banate, Iloilo (Philippines).",
            "The document can be found in the Archives of the Monastery of the Augustinian Province of the Most Holy Name of Jesus of the Philippines in Valladolid, Spain."
        ],
        [
            "^ Search for Miss Banate, Banate Town Fiesta 2015.",
            "YouTube.",
            "Published on 30 June 2015.",
            "Retrieved 5 January 2017."
        ],
        [
            "^ Banate Holy Week Procession."
        ],
        [
            "^ Garcia, Jennifer (January 26, 2009).",
            "\"Dinagyang Festival 2009 Draws Thousands of Tourists\".",
            "ABS-CBN News.",
            "ABS-CBN Corporation.",
            "Retrieved August 22, 2011."
        ],
        [
            "^ Jumayao, Glen.",
            "\"Snapshots of Kasadyahan 2010\".",
            "The News Today.",
            "Retrieved August 22, 2011."
        ],
        [
            "^ Mendoza, E. (April 26, 2010).",
            "\"Dinagyang Festival Emerged as the Aliwan 2010 Grand Champion\".",
            "Gigs Ilonggo.",
            "Archived from the original on 2011-08-29.",
            "Retrieved August 22, 2011."
        ],
        [
            "^ \"Explore Iloilo Photoblog\".",
            "Exploreiloilo.com.",
            "Archived from the original on 2012-07-22.",
            "Retrieved June 6, 2012."
        ],
        [
            "^ Kasag Festival 2015."
        ],
        [
            "^ \"Aliwan 2009 - Tribu Kasag (Banate, Iloilo)\".",
            "YouTube.",
            "26 April 2009.",
            "Archived from the original on 2021-12-21.",
            "Retrieved June 6, 2012."
        ],
        [
            "^ Cf.",
            "Official election document for the year 1844–45 found in the National Archives entitled: Relacion nominal de los Gobernadorcillos, tenientes, juezes, y alguaciles del año corriente con exposicion de sus Pueblos, p. 8.",
            "In the said document the other town officials during the incumbency of Don Pascual Baylon were as follows: Julian Fuentes- Primer Teniente, Victoriano Bonifacio- Segundo Teniente, Ynesanio Domingo- Primer Juez, Ruberto Cayetano- Segundo Juez, Lucas Espinosa- Primer Alguacil, Juan Mateo- Segundo Alguacil, Juan Ygnacio- Tercer Alguacil."
        ],
        [
            "^ Cf.",
            "Official election document for the year 1855 found in the National Archives entitled: Relacion nominal de los Gobernadorcillos y demas Ministros de Justicia que quedan en ejercicio en el año coriente y el entrante de 1856 y con titulos del Superior Gobierno in Elecciones de Gobernadorcillos: Iloilo (1838–1893), p. 51.",
            "In the said document the other town officials during the incumbency of Capitan Don Tomas Juanico were as follows: D. Alfonso Arroyo- Primer Teniente, Pablo Becenra- Segundo Teniente y Juez mayor de Ganados, Sabino Apacible- Juez mayor de Sementeras, Claudio Juanico- Juez de Policia, Fabiano Baquisal- Primer Alguacil, Tobias Bacabac- Segundo Alguacil, Luis Banbeno-Tercer Alguacil."
        ],
        [
            "^ The canonical book of the Roman Catholic Parish of Banate, the Burial Registry (1910-1935), page 7, indicates that Don Apolinario Juanico is one of the children of Don Tomas Juanico and Doña Lucia Balderas.",
            "He died on 30 June 1910, at the age of 80 years old.",
            "His maternal grandparents were Vicente and Tiburcia Balderas.",
            "Page 52 of the same canonical book records the burial of his maternal cousin Matea Balderas, buried in the same cemetery, on 27 October 1918, at the age of 51 years old, daughter of Don Martin Balderas and Doña Apolonia Baviera.",
            "Matea's paternal grandparents were also Vicente and Tiburcia Balderas.",
            "This indicates that Apolinario Juanico was a son of a Gobernadorcillo and a nephew of another Gobernadorcillo."
        ],
        [
            "^ Cf.",
            "official election document for the year 1889 found in the National Archives entitled: Relacion nominal de los Gobernadorcillos y demas Ministros de Justicia nombrados por este Gobierno en los pueblos de este Distrito (Yloilo) para el ejercicio del bienio economico de 1889 al 90 y del 90 al 91 in Elecciones de Gobernadorcillos: Iloilo (1838–1893), p. 269.",
            "In the said document the other town officials during the incumbency of Sotero Juanico were as follows: Julian Bactin- Primer Teniente, Gregorio Arroyo- Segundo Teniente, Guillermo Juanico- Juez mayor de Sementeros, Faustino Velasco- Juez de Policia, Tomas Caliston- Juez de Ganados, Simeon Babac-  Primer Alguacil, Faustino Gipay- Segundo Alguacil, Vicente Babayen-on- Tercer Alguacil."
        ],
        [
            "^ The other town officials that time were: Don Marcelo Madrid, Don Florencio Villaluz, Don Ciriaco Fuentes, Don Fortunato Perez and Don Nemesic Badilla.",
            "Annual report of the Philippine Commission / Bureau of Insular Affairs, War Department to the President of the United States, Washington D.C.: 1901, Vol.",
            "I, p. 130."
        ],
        [
            "^ Manila Bulletin Online"
        ],
        [
            "^ \"Proposed Trans-Visayas Friendship Bridges Get RDC 6 Nod\".",
            "The News Today.",
            "December 11, 2006.",
            "Retrieved June 6, 2012."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Banate, Iloilo."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Official Website of the Municipality of Banate, Iloilo, Philippines"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Banate, Iloilo"
        ],
        [
            "San Enrique"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Banate"
        ],
        [
            "Anilao"
        ],
        [
            "Guimaras Strait"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Banate,_Iloilo&oldid=1229369670\""
        ],
        [
            "Category: Municipalities of IloiloHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}