{
    "name": "Banayoyo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Banayoyo"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°14′12″N 120°28′45″E﻿ / ﻿17.2367°N 120.4792°E﻿ / 17.2367; 120.4792"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Banayoyo\" – news · newspapers · books · scholar · JSTOR (September 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesBanayoyoMunicipalityMunicipality of Banayoyo"
        ],
        [
            "FlagSealMotto(s): Binnuyog, Banayoyo!Anthem: Banayoyo HymnMap of Ilocos Sur with Banayoyo highlightedOpenStreetMapBanayoyoLocation within the PhilippinesCoordinates: 17°14′12″N 120°28′45″E﻿ / ﻿17.2367°N 120.4792°E﻿ / 17.2367; 120.4792CountryPhilippinesRegionIlocos RegionProvinceIlocos SurDistrict"
        ],
        [
            "2nd districtFounded1912Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorVirgilio G. Galanga • Vice MayorOscar S. Gandalera Sr. • RepresentativeKristine Singson-Meehan • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Alexander G. GalangaFlorentino B. GarrigaFilemon A. MartinezMiguel G. Garcia Jr.Ruthrella M. GacusanManuel G. GamboaRomulo B. RamosFelix G. Vecina"
        ],
        [
            " • Electorate6,246 voters (2022)Area • Revenue₱ 235.2 million (2020) • Assets₱ 1,255 million (2020) • Expenditure₱ 69.84 million (2020)Service provider • ElectricityIlocos Sur Electric Cooperative (ISECO)Time zoneUTC+8 (PST)ZIP code2708PSGC012902000IDD : area code +63 (0)77Native languagesIlocano TagalogWebsitehttp://banayoyo.gov.ph"
        ],
        [
            "Banayoyo, officially the Municipality of Banayoyo (Ilocano: Ili ti Banayoyo; Filipino: Bayan ng Banayoyo), is a 4th class municipality in the province of Ilocos Sur, Philippines.",
            "According to the 2020 census, it has a population of 7,931 people."
        ],
        [
            "Settlements in the municipality are mostly established along the roads and in the areas near the people's sources of livelihood.",
            "With limited economic opportunities in the municipality, some residents of the town have also left their town to seek higher education, better employment opportunities, better opportunities for trade and commerce not only to other more developed areas in the country but even abroad."
        ],
        [
            "Etymology"
        ],
        [
            "The municipality of Banayoyo was originally called \"Bacsayan\".",
            "According to legend, in the eastern part of Poblacion, there was a big tree, which was called \"Banayoyo\".",
            "The people built a \"Dap-ay\" under the shady branches of the big tree, where the old folks held their meetings and settled any disputes or criminal acts committed by the barangay folks.",
            "After every bountiful harvest, the people gathered around the “Banayoyo” tree and offered their thanksgiving in a festivity called “Kaniaw”, the rituals lasting for three days."
        ],
        [
            "Due to old age, the big \"Banayoyo\" tree died.",
            "The death of the big tree brought famine and drought.",
            "The calamity prompted the older folks to gather in the \"Dap-ay\" and change the name of the community.",
            "The people thought of a name so that the big \"Banayoyo\" tree will always be remembered, and called the place \"Banayoyo\" instead of \"Bacsayan\"."
        ],
        [
            "History"
        ],
        [
            "Creation of the municipality"
        ],
        [
            "In its earliest stage, Banayoyo was a “rancheria” (or a pasture land under the Spanish regime).",
            "But as more people from the highlands of Abra called \"Tinguians\" came to settle, it developed into a small community."
        ],
        [
            "Before Banayoyo became a township, during the 18th century, it was part of the municipalities of Candon and Santiago.",
            "Sources indicate that lands existing in the southern part of the town, particularly from Barangay Cadanglaan in the southwest to the Barangay Lopez in the southeast, were registered in the civil registrar at Candon, while lands in the northern part were also registered in the registrar at Santiago before they were given new declarations by the registrar of Banayoyo.",
            "It was only in the year 1907 when Banayoyo gained its township, separating itself from Candon and Santiago.",
            "In 1912, it became a Municipality under Ilocos Sur."
        ],
        [
            "World War II"
        ],
        [
            "During World War II, Banayoyo was once the seat of ongoing local Philippine Commonwealth Military and Ilocano Guerilla Resistance Outfit, under the command of Army Major Walter M. Cushing, a fearless American fighter.",
            "The closeness of the residents to the Guerilla Outfit by way of provisions and financial assistance irked the Japanese Imperial Army, who were then garrisoned at an old Sugar Central in nearby Bucong, a barrio of Candon.",
            "Angry patrols of the Japanese Imperial Army burned down some barrios of Banayoyo.",
            "Barangay Elefante, which was the bivouac area of the elements of the “M” Company, 121st Infantry Regiment, Philippine Commonwealth Army, USAFIP NL, suffered the worst atrocities.",
            "On October 16, 1944, one half of the barrio was burned down and on November 14, 1944, the other half met the same fate.",
            "During the same dates, not only Elefante was set on fire but the whole town.",
            "The Banayoyo Catholic Church was not spared nor the Municipal Hall."
        ],
        [
            "Geography"
        ],
        [
            "The municipality of Banayoyo is one of the 32 municipalities of Ilocos Sur.",
            "It is bounded on the south by the Bucong River, also called “Carayan a Bassit”; on the west by a small canal called “Calip”; on the east by the Cabcaburao Hills, and on the north by Bay-asan Hills.",
            "Municipalities abutting the town area are: on the east by Lidlidda; on the south by Candon; on the west by Santiago; and on the north by Burgos."
        ],
        [
            "Banayoyo is 58 kilometres (36 mi) south of the provincial capital Vigan, 9 kilometres (5.6 mi) north-east of Candon; 86 kilometres (53 mi) from the regional capital San Fernando, La Union, and 355 kilometres (221 mi) from Manila."
        ],
        [
            "The municipality can be reached by jeepneys going to Lidlidda and San Emilio or tricycles from Candon."
        ],
        [
            "Barangays"
        ],
        [
            "Banayoyo is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bagbagotot"
        ],
        [
            "Banbanaal"
        ],
        [
            "Bisangol"
        ],
        [
            "Cadanglaan"
        ],
        [
            "Casilagan Norte"
        ],
        [
            "Casilagan Sur"
        ],
        [
            "Elefante"
        ],
        [
            "Guardia"
        ],
        [
            "Lintic"
        ],
        [
            "Lopez"
        ],
        [
            "Montero"
        ],
        [
            "Naguimba"
        ],
        [
            "Pila"
        ],
        [
            "Poblacion"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Banayoyo, Ilocos Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "18(64)"
        ],
        [
            "19(66)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "19(66)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "10(0.4)"
        ],
        [
            "10(0.4)"
        ],
        [
            "14(0.6)"
        ],
        [
            "23(0.9)"
        ],
        [
            "80(3.1)"
        ],
        [
            "103(4.1)"
        ],
        [
            "121(4.8)"
        ],
        [
            "111(4.4)"
        ],
        [
            "119(4.7)"
        ],
        [
            "144(5.7)"
        ],
        [
            "39(1.5)"
        ],
        [
            "15(0.6)"
        ],
        [
            "789(31.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5.2"
        ],
        [
            "3.9"
        ],
        [
            "6.2"
        ],
        [
            "9.1"
        ],
        [
            "18.5"
        ],
        [
            "21.4"
        ],
        [
            "22.9"
        ],
        [
            "19.8"
        ],
        [
            "19.8"
        ],
        [
            "16.2"
        ],
        [
            "10.5"
        ],
        [
            "6.1"
        ],
        [
            "159.6"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BanayoyoYearPop.±% p.a.1918 2,313—    1939 2,443+0.26%1948 2,572+0.57%1960 3,252+1.97%1970 3,970+2.01%YearPop.±% p.a.1975 4,585+2.93%1980 5,037+1.90%1990 5,864+1.53%1995 6,140+0.87%2000 6,728+1.98%YearPop.±% p.a.2007 7,149+0.84%2010 7,694+2.71%2015 7,748+0.13%2020 7,931+0.46%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Banayoyo had a population of 7,931.",
            "The population density was 320 inhabitants per square kilometre (830/sq mi)."
        ],
        [
            "Religion"
        ],
        [
            "Our Lady of Lourdes Parish Church"
        ],
        [
            "Many religions have been established in the municipality like Protestantism, Catholicism, Iglesia ni Cristo, Aglipayan, Jehovah's Witnesses.",
            "Many residents have been given elementary and secondary education with the establishment of several elementary schools."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Banayoyo"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  19.20"
        ],
        [
            "2009  20.90"
        ],
        [
            "2012  23.10"
        ],
        [
            "2015  12.00"
        ],
        [
            "2018  6.05"
        ],
        [
            "2021  12.51"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Banayoyo, belonging to the second congressional district of the province of Ilocos Sur, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Kristine Singson-Meehan"
        ],
        [
            "Mayor"
        ],
        [
            "Virgilio G. Galanga"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Oscar S. Gandalera Sr."
        ],
        [
            "Councilors"
        ],
        [
            "Alexander G. Galanga"
        ],
        [
            "Florentino B. Garriga"
        ],
        [
            "Filemon A. Martinez"
        ],
        [
            "Miguel G. Garcia Jr."
        ],
        [
            "Ruthrella M. Gacusan"
        ],
        [
            "Manuel G. Gamboa"
        ],
        [
            "Romulo B. Ramos"
        ],
        [
            "Felix G. Vecina"
        ],
        [
            "Socio-Economic-Cultural Development"
        ],
        [
            "Tinguians were the foremost inhabitants of the place, who came down from the highlands of Abra.",
            "With the coming of the Spaniards, Americans, Japanese, Chinese and other foreigners and people from nearby provinces of Ilocos Norte, La Union and Mountain Province, the original settlers intermingled with and intermarried with them,.",
            "At present, however, remnants of the Tinguian tribe still reside in the town."
        ],
        [
            "Like before, farming is the major source of livelihood of the people.",
            "During the early period, they used crude methods of farming like plowing by the use of cows and carabaos, and tilling the soil by the hands or sticks.",
            "But with the coming of the Westerners who brought with them modern technologies, the farmers of Banayoyo have already adopted semi-mechanized methods of farming like the use of tractors, threshers, commercial fertilizers, etc."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Banayoyo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Ilocos Sur\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Banayoyo: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 14 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 11, 2022."
        ],
        [
            "External links"
        ],
        [
            "Pasyalang Ilocos Sur"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Banayoyo"
        ],
        [
            "Santiago"
        ],
        [
            "Lidlidda"
        ],
        [
            "Banayoyo"
        ],
        [
            "Candon"
        ],
        [
            "Candon"
        ],
        [
            "vte Province of Ilocos SurVigan (capital)  Candon (largest city)Municipalities"
        ],
        [
            "Alilem"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bantay"
        ],
        [
            "Burgos"
        ],
        [
            "Cabugao"
        ],
        [
            "Caoayan"
        ],
        [
            "Cervantes"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Lidlidda"
        ],
        [
            "Magsingal"
        ],
        [
            "Nagbukel"
        ],
        [
            "Narvacan"
        ],
        [
            "Quirino"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Juan"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Component cities"
        ],
        [
            "Candon"
        ],
        [
            "Vigan"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Sur"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Banayoyo&oldid=1228314539\""
        ],
        [
            "Category: Municipalities of Ilocos SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2013All articles needing additional referencesPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textPages using the Kartographer extension"
        ]
    ]
}