{
    "name": "Bangar",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bangar, La Union"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°54′N 120°25′E﻿ / ﻿16.9°N 120.42°E﻿ / 16.9; 120.42"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in La Union, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Bangar, La Union\" – news · newspapers · books · scholar · JSTOR (August 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesBangarMunicipalityMunicipality of BangarStreet of Bangar"
        ],
        [
            "FlagSealMap of La Union with Bangar highlightedOpenStreetMapBangarLocation within the PhilippinesCoordinates: 16°54′N 120°25′E﻿ / ﻿16.9°N 120.42°E﻿ / 16.9; 120.42CountryPhilippinesRegionIlocos RegionProvinceLa UnionDistrict"
        ],
        [
            "1st districtFounded1700Barangays33"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJoy P. Merin • Vice MayorVirgelio M. Dabalos • RepresentativePablo C. Ortega • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Wilfredo R. MosuelaMichael M. VirayRogelio F. ColomaMario L. MakilingEmmanuel A. MantillaEduardo P. FloresAnthony J. TaguiamAnacleto L. Yukee"
        ],
        [
            " • Electorate23,673 voters (2022)Area • Revenue₱ 195.5 million (2020) • Assets₱ 712.7 million (2020) • Expenditure₱ 191.6 million (2020) • Liabilities₱ 52.12 million (2020)Service provider • ElectricityLa Union Electric Cooperative (LUELCO)Time zoneUTC+8 (PST)ZIP code2519PSGC013306000IDD : area code +63 (0)72Native languagesIlocano TagalogWebsitewww.bangar.gov.ph"
        ],
        [
            "Bangar, officially the Municipality of Bangar (Ilocano: Ili ti Bangar; Filipino: Bayan ng Bangar), is a 3rd class municipality in the province of La Union, Philippines.",
            "According to the 2020 census, it has a population of 38,041 people."
        ],
        [
            "Etymology"
        ],
        [
            "The name Bangar derives from the bangar tree (Sterculia foetida), which was once abundant in the general area of the present town.",
            "The bangar tree is notable for the foul odor that emanates from its flowers."
        ],
        [
            "History"
        ],
        [
            "1700 marked the official foundation of Bangar under the patronage of Saint Christopher when it became a mission field.",
            "However, Christianity was brought as early as the later part of 1500, when Bangar was still a visita (chapelry) of Tagudin, with a community of 2,800 inhabitants.",
            "The highly skilled, industrious, and peace-loving people were primarily engaged in rice and cotton planting.",
            "The beautiful and sturdy handwoven products made by the women of that time even found their way to Europe and it was said that some of these materials were used as boat sails by European seamen.",
            "Among the more famous handwoven products made by them were blankets bearing different designs, clothing materials, and mosquito nets.",
            "Since chemicals for coloring were very scarce those days, the bark of trees and fruit were used to dye those handwoven products."
        ],
        [
            "The old town was made of three pueblitos (small towns) namely: Villa-Cruz, San Rafael and San Anastacio.",
            "Near these pueblitos were small communities of Igorotes Infieles who paid tribute to the Governor."
        ],
        [
            "Through the Superior Decreto (Executive Decree) signed by Governor-General Antonio Maria Blanco on March 2, 1850, the town of Bangar was made part of the newly created province of La Union.",
            "Prior to this, Bangar, Purao (Balaoan) and Namacpacan (Luna) were part of Ilocos Sur.",
            "As the years passed by, barrios were formed."
        ],
        [
            "Education during Spanish times consisted of learning the Cartilla and the abecedario.",
            "Roman Catholic religion was taught hand-in-hand with good manners.",
            "However, formal education was given to students belonging to the upper class.",
            "Spanish social life had greatly affected the Indios and in no time, Castilian manners were very evident among them."
        ],
        [
            "The social class of an individual was easily distinguished by the kind of attire one wore.",
            "Male peasants were distinguished by their simple camisa de chino and loose pants tied to the waist by braided strings.",
            "Female peasants wore simple loose blouses and ankle-length skirts, with a camison, made from cotton fabric, worn underneath.",
            "The peasantry were usually barefooted, and if there was anything worn on the feet, it was the kammadang (wooden shoes) or a pair of slippers."
        ],
        [
            "Men of the upper class were distinguished by the barong and camisa de chino made of fine fabric, and trousers cut in the western style.",
            "He wore socks and leather shoes and on the head was a hat, which was usually plumed.",
            "A walking cane in various styles and colors and encased in gold, silver or bronze was indispensable.",
            "He never smoked without using a pipe."
        ],
        [
            "The upper-class lady was very fastidious.",
            "She had her hair done in a brushed up coiffure.",
            "They curled their hair by using the stem of the papaya leaf and iron rod which was heated over burning charcoal.",
            "However, so much care was given using this method.",
            "Other women preferred to tie their hair in curls in the evening and untie it in the morning.",
            "Ladies wore the \"Maria Clara\" or the camisa with embroidered and stitched butterfly sleeves and matching panuelo.",
            "They used alfiler (pins) made of gold or silver.",
            "A comb called peineta, usually fan-shaped and encrusted with silver or gold, adorned their hair.",
            "The skirt, which was usually billowy, was made from very fine fabric from China.",
            "Underneath she wore a long camison and over it the nuagas.",
            "The outer skirt was still topped by beautiful imported lace.",
            "A perfumed fan and a big handkerchief trimmed with lace, hanging on the right side of the skirt tucked to her waistline, was part of the attire.",
            "On Sundays and holidays of obligation, a mantilla made of lace, which covered the head down to the waist and tucked to the hair by a gold pin was obligatory for the Holy Mass.",
            "On the feet, the lady wore a zapatilla, usually half-heeled and adorned with artificial rhinestones.",
            "A gold pendant hanging from a gold necklace around the neck was also part of the attire.",
            "The tamborine, a gold necklace with intricate designs was also worn on special days."
        ],
        [
            "US-styled education was implemented with the coming of the Americans in 1898.",
            "Education had a very high standard then, such that one who finished the fourth grade could teach those who were in the lower years."
        ],
        [
            "The impact of World War II was first felt in Bangar on December 8, 1941, the feast of the Immaculate Conception.",
            "A lantern competition, which was sponsored by Rev.",
            "Jose Brillantes, the parish priest, was hastily canceled and churchgoers had to hurry home after the Holy Mass as they immediately prepared for evacuation.",
            "On December 20, 1941, the Japanese Army entered Bangar.",
            "They put up sentries along the national road and also had one at the Municipal building and another at the plaza.",
            "The Japanese occupation required all citizens to display and pin small Japanese flags outside the pocket of the shirt or blouse with the name of the holder written in Japanese.",
            "According to them, this was to distinguish peaceful citizens from guerrillas."
        ],
        [
            "Sometime in 1944, on the day Bangar was celebrating the birthday of Emperor Hirohito with a program at the town plaza, a truckload of Japanese soldiers arrived with a lone Filipino who was said to have been captured somewhere in Bacnotan.",
            "It was told that the Japanese took the Filipino behind the southern school building and ordered him to dig what was to be his own grave.",
            "Upon sensing that his hours on earth were counted, the Filipino suddenly grabbed and unsheathed the sword of an officer who was standing nearby and in one hit motion with the sword, the officer almost got beheaded.",
            "This stunned the Japanese soldiers and the Filipino was able to escape unhurt.",
            "The whole town was gripped in terror since this would mean Japanese reprisals—on December 28, 1944, the Japanese burned many houses in the town proper and raided the camp of the guerrillas in barrio San Cristobal."
        ],
        [
            "The Underground Movement was very strong during the Japanese occupation of Bangar.",
            "Many residents joined the guerrillas, who had put up camps in San Cristobal.",
            "Further in the mountains at Lonoy, they also joined \"Camp 121\".",
            "Colonel Volkman and Major Agtarap led the guerrilla movement.",
            "The arms that were supplied to the guerrillas landed at Paraoir and men had to carry bolos at nighttime."
        ],
        [
            "The first Americans to reach Bangar during its liberation were a certain Captain Roberts with his men."
        ],
        [
            "During the Northern Luzon Campaign, Filipino soldiers and guerrillas of the 121st Infantry Regiment, Philippine Commonwealth Army, USAFIP-NL  are started the liberation campaign in Bangar in 1945 and helped by the U.S. liberation forces against Japanese Imperial Army forces towards the end of the war."
        ],
        [
            "Today, Bangar is known for its handwoven cloth called abel and blacksmithing (panday).",
            "Its agricultural products include rice, corn, sugar cane, peanuts, sweet potatoes, vegetables, and Virginia tobacco."
        ],
        [
            "Geography"
        ],
        [
            "The northernmost town of La Union, alongside Sudipen, Bangar is also the smallest municipality in the province with an area of 3,736 hectares (9,230 acres).",
            "It is bounded by the South China Sea to the west, Sudipen to the east, and Balaoan and Luna to the south-west.",
            "The Amburayan River flows to the north of Bangar, separating it from Tagudin, Ilocos Sur."
        ],
        [
            "Bangar is 307 kilometres (191 mi) from Metro Manila and 38 kilometres (24 mi) from San Fernando, the provincial capital."
        ],
        [
            "Barangays"
        ],
        [
            "Bangar is politically subdivided into 33 baranngays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Agdeppa"
        ],
        [
            "Alzate"
        ],
        [
            "Bangaoilan East"
        ],
        [
            "Bangaoilan West"
        ],
        [
            "Barraca"
        ],
        [
            "Cadapli"
        ],
        [
            "Caggao"
        ],
        [
            "Central East No.",
            "1 (Poblacion)"
        ],
        [
            "Central East No.",
            "2 (Poblacion)"
        ],
        [
            "Central West No.",
            "1 (Poblacion)"
        ],
        [
            "Central West No.",
            "2 (Poblacion)"
        ],
        [
            "Central West No.",
            "3 (Poblacion)"
        ],
        [
            "Consuegra"
        ],
        [
            "General Prim East"
        ],
        [
            "General Prim West"
        ],
        [
            "General Terrero"
        ],
        [
            "Luzong Norte"
        ],
        [
            "Luzong Sur"
        ],
        [
            "Maria Cristina East"
        ],
        [
            "Maria Cristina West"
        ],
        [
            "Mindoro"
        ],
        [
            "Nagsabaran"
        ],
        [
            "Paratong No.",
            "3"
        ],
        [
            "Paratong No.",
            "4"
        ],
        [
            "Paratong Norte"
        ],
        [
            "Quintarong"
        ],
        [
            "Reyna Regente"
        ],
        [
            "Rissing"
        ],
        [
            "San Blas"
        ],
        [
            "San Cristobal"
        ],
        [
            "Sinapangan Norte"
        ],
        [
            "Sinapangan Sur"
        ],
        [
            "Ubbog"
        ],
        [
            "Etymology of Barangay names"
        ],
        [
            "Agdeppa – Notorious criminals were once often executed with their arms outstretched, and the place was thus called agdeppa, meaning outstretched arms."
        ],
        [
            "Alzate – Named after a Spanish colonial officer called General Alzate, who manned the garrison in that place against the local revolucionarios.",
            "It is said that the Amburayan River which partly flowed through Bangar was a favourite swimming hole for Spaniards and the early illustrados."
        ],
        [
            "Bangaoilan – Once called \"Anonang\", the town was renamed because of the abundance of a poisonous plant called bangaoil."
        ],
        [
            "Barraca – This barrio was formed from the two sitio of Binyadura and Nagpalcan.",
            "Barraca was adopted as the common name after residents of both hamlets signed a pact to end a violent feud."
        ],
        [
            "Cadapli – This was taken from the Ilokano words cadcadapa (\"crawling\") and apli (\"mat\").",
            "This name was adopted after several robbers hiding in the forests near this barrio were caught whilst sleeping on straw mats (apli).",
            "They were then severely flogged and punished until they were left crawling (cadapa)."
        ],
        [
            "Caggao – Named after a parasite called cagaw, which once infested the place."
        ],
        [
            "Luzong – This place was formerly three sitio: Pideng, Butak, and Dalimuno.",
            "Quicksand in the area caused the disappearance of working animals, hence the name \"Luzong\", derived from the Ilocano word lusong (\"stuck\")."
        ],
        [
            "María Cristina – It is said that a visiting American once asked the village's name from a beautiful girl.",
            "Thinking that the stranger was asking for her name, the maiden answered \"María Cristina\"."
        ],
        [
            "Mindoro – The name was derived from the Spanish Minas de Oro (\"gold mine\").",
            "At that time there were gold dust and nuggets in the river beside the village, and people used to pan these and sell them to the rich.",
            "General Alzate gave the village its present name."
        ],
        [
            "Nagsabaran – This name (meaning \"place where  branches out\") was given to the place because the national road branched out to this barrio.",
            "The root word is sabar, meaning \"to branch out\"."
        ],
        [
            "Paratong – The old name was Libtong, which means \"lagoon\".",
            "During the Spanish Era, the prefix \"lib\" was changed into \"para\" which literally means \"for\"."
        ],
        [
            "Quintarong – Once named Daya ti Sabangan (\"east of the mouth of the river\"), the place was a reputed hideout of native pirates called tirong whom villagers often saw running after one another (kinnamat in Ilocano)."
        ],
        [
            "Reyna Regente – The village was named after a certain pre-Colonial queen who once ruled the area.",
            "Called Reyna Regente by later generations, it is said that she was ruthless.",
            "Her unnamed youngest daughter succeeded her, and unlike her mother was a wise and benevolent monarch."
        ],
        [
            "Rissing – The old name Pa-o was taken from a big tree in the area; when and how it became Rissing is unknown."
        ],
        [
            "San Blas – The place was named after a man who was reputedly known for his wisdom and was named after Saint Blaise."
        ],
        [
            "San Cristobal – Named after the town's patron saint, Saint Christopher."
        ],
        [
            "Sinapangan – Named after the sapang tree which grew abundantly in the place."
        ],
        [
            "Ubbog – The term ubbog means \"spring\".",
            "Long ago, water would well up through the earth even with little effort."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bangar, La Union"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "27(1.1)"
        ],
        [
            "31(1.2)"
        ],
        [
            "40(1.6)"
        ],
        [
            "71(2.8)"
        ],
        [
            "207(8.1)"
        ],
        [
            "237(9.3)"
        ],
        [
            "286(11.3)"
        ],
        [
            "261(10.3)"
        ],
        [
            "261(10.3)"
        ],
        [
            "254(10.0)"
        ],
        [
            "88(3.5)"
        ],
        [
            "46(1.8)"
        ],
        [
            "1,809(71.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "9.4"
        ],
        [
            "9.3"
        ],
        [
            "12.7"
        ],
        [
            "17.0"
        ],
        [
            "25.4"
        ],
        [
            "26.8"
        ],
        [
            "27.4"
        ],
        [
            "26.1"
        ],
        [
            "25.0"
        ],
        [
            "21.0"
        ],
        [
            "15.5"
        ],
        [
            "10.6"
        ],
        [
            "226.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BangarYearPop.±% p.a.1903 9,851—    1918 10,923+0.69%1939 12,484+0.64%1948 14,988+2.05%1960 16,381+0.74%1970 19,761+1.89%1975 20,752+0.99%1980 23,715+2.70%1990 25,966+0.91%1995 28,374+1.68%2000 31,491+2.26%2007 33,335+0.79%2010 34,522+1.28%2015 35,947+0.77%2020 38,041+1.12%Source: Philippine Statistics Authority"
        ],
        [
            "Population"
        ],
        [
            "According to the 2020 census, the population of Bangar, La Union, was 38,041 people, with a density of 1,000 inhabitants per square kilometre or 2,600 inhabitants per square mile."
        ],
        [
            "Catholicism"
        ],
        [
            "Spanish-era curates of Bangar"
        ],
        [
            "Rev Francisco de Alvear, OSA – 1696-1698"
        ],
        [
            "Rev Manuel Miranda, OP – 1805-1809"
        ],
        [
            "Rev Benito Tesauro, OSA – 1853-1864"
        ],
        [
            "Rev Evaresto Guadalupe, OSA – 1866-1887"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bangar"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  27.30"
        ],
        [
            "2009  27.92"
        ],
        [
            "2012  14.93"
        ],
        [
            "2015  7.96"
        ],
        [
            "2018  3.83"
        ],
        [
            "2021  9.96"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Bangar, belonging to the first congressional district of the province of La Union, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Pablo C. Ortega"
        ],
        [
            "Mayor"
        ],
        [
            "Joy P. Merin"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Virgelio M. Dabalos"
        ],
        [
            "Councilors"
        ],
        [
            "Wilfredo R. Mosuela"
        ],
        [
            "Michael M. Viray"
        ],
        [
            "Rogelio F. Coloma"
        ],
        [
            "Mario L. Makiling"
        ],
        [
            "Emmanuel A. Mantilla"
        ],
        [
            "Eduardo P. Flores"
        ],
        [
            "Anthony J. Taguiam"
        ],
        [
            "Anacleto L. Yukee"
        ],
        [
            "Festivals"
        ],
        [
            "The feast of the patron saint of Bangar, St. Christopher, is celebrated every July 25."
        ],
        [
            "The town fiesta of Bangar is celebrated every December 26 and 27."
        ],
        [
            "The Abel-Panday festival was first celebrated during the 2005 town fiesta.",
            "However, it was discontinued, only for it to be revived during the 2008 fiesta."
        ],
        [
            "Places of interest"
        ],
        [
            "Saint Christopher Church – construction was started in 1696 by Fr.",
            "Francisco Alvear, a Spanish Augustinian priest born in Liaño, Santander, Spain who died in Bangar in 1698.",
            "It is the only church with three bell towers."
        ],
        [
            "Saint Christopher Convent – was built by Fr.",
            "Evaresto Guadalupe sometime between 1866 and 1887."
        ],
        [
            "Amburayan River – the setting of the Ilocano epic Biag ni Lam-ang, penned by the poet Pedro Bucaneg"
        ],
        [
            "Imelda Cultural Stage – a project done by then President Ferdinand E. Marcos, through the sponsorship of his Minister of Tourism Jose D. Aspiras and constructed by Engr.",
            "Bernardo Vergara, then General Manager of the Philippine Tourism Authority"
        ],
        [
            "Paratong Beach - located at the western part of the town.",
            "Locals experience the sunset view over the West Philippine Sea while enjoying the food served by emerging local restaurants in the vicinity."
        ],
        [
            "Education"
        ],
        [
            "The town has 16 public elementary schools, two national high schools, a private school (offering complete pre-elementary, elementary, and high school education), one specialized high school, one technical-vocational school, and one tertiary school."
        ],
        [
            "Public Elementary schools"
        ],
        [
            "Ag-Na Elementary School"
        ],
        [
            "Bangaoilan Elementary School"
        ],
        [
            "Bangar Central School"
        ],
        [
            "Cadapli Elementary School"
        ],
        [
            "Caggao Elementary School"
        ],
        [
            "Gen. Prim Elementary School"
        ],
        [
            "Luzong Norte Elementary School"
        ],
        [
            "Luzong Sur Elementary School"
        ],
        [
            "Ma.",
            "Cristina Elementary School"
        ],
        [
            "Paratong Elementary School"
        ],
        [
            "Pudoc Elementary School"
        ],
        [
            "Rissing Elementary School"
        ],
        [
            "RUS Elementary School"
        ],
        [
            "Sinapangan Elementary School"
        ],
        [
            "Ter-Con Elementary School"
        ],
        [
            "Saint Christopher Academy"
        ],
        [
            "Public High Schools"
        ],
        [
            "Dona Francisca Lacsamana de Ortega Memorial National High School"
        ],
        [
            "Casacristo National High School"
        ],
        [
            "Regional Science High School for Region 1"
        ],
        [
            "Mindoro Integrated School"
        ],
        [
            "Luzong Sur Integrated School"
        ],
        [
            "Private Schools"
        ],
        [
            "Saint Christopher Academy – the oldest school in Bangar, founded in 1945"
        ],
        [
            "Saint Bernard College La Union  – the only integrated school and Accredited TESDA training center in Bangar offering Basic Education, Secondary Education ( Senior High School Free tuition) &  tertiary education."
        ],
        [
            "Philippine Bethel Blessed Christian Academy"
        ],
        [
            "Specialized School"
        ],
        [
            "Regional Science High School for Region I – a magnet school established during the school year 1994-1995 by virtue of DECS Order No.",
            "69, s.1993.",
            "The school, with a curriculum that specializes in science and research (different from Special Science Program/ Engineering and Science Education Program schools), is operated and supervised by the Department of Education."
        ],
        [
            "Vocational schools"
        ],
        [
            "TSI Technical Institute – the only technical/vocational school in Bangar, located at Barangay Rissing."
        ],
        [
            "Notable personalities"
        ],
        [
            "John Leo Dato – is a Filipino-American professional boxer born in Rissing, Bangar, La Union."
        ],
        [
            "Gallery"
        ],
        [
            "Welcome arch"
        ],
        [
            "Municipal hall"
        ],
        [
            "Town center"
        ],
        [
            "Town plaza"
        ],
        [
            "Saint Christopher Church"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bangar |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: La Union\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Bangar: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of La Union\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 5, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Bangar, La Union."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Bangar, La Union"
        ],
        [
            "Tagudin, Ilocos Sur"
        ],
        [
            "South China Sea"
        ],
        [
            "Bangar"
        ],
        [
            "Sudipen"
        ],
        [
            "Luna"
        ],
        [
            "Balaoan"
        ],
        [
            "vteProvince of La UnionSan Fernando (capital and largest city)Municipalities"
        ],
        [
            "Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Bacnotan"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Bangar"
        ],
        [
            "Bauang"
        ],
        [
            "Burgos"
        ],
        [
            "Caba"
        ],
        [
            "Luna"
        ],
        [
            "Naguilian"
        ],
        [
            "Pugo"
        ],
        [
            "Rosario"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santol"
        ],
        [
            "Sudipen"
        ],
        [
            "Tubao"
        ],
        [
            "Component city"
        ],
        [
            "San Fernando"
        ],
        [
            "BarangaysSee: List of barangays in La Union"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bangar,_La_Union&oldid=1205209698\""
        ],
        [
            "Category: Municipalities of La UnionHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from August 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textAll articles with unsourced statementsArticles with unsourced statements from July 2017Wikipedia articles needing clarification from October 2016Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}