{
    "name": "Bansalan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bansalan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 6°47′N 125°13′E﻿ / ﻿6.78°N 125.22°E﻿ / 6.78; 125.22"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Davao del Sur, Philippines"
        ],
        [
            "Not to be confused with Dansalan, former name of Marawi."
        ],
        [
            "Municipality in Davao Region, PhilippinesBansalanMunicipalityMunicipality of BansalanPortion of Poblacion"
        ],
        [
            "FlagSealMotto: Wow!",
            "BansalanAnthem: Bansalan HymnMap of Davao del Sur with Bansalan highlightedOpenStreetMapBansalanLocation within the PhilippinesCoordinates: 6°47′N 125°13′E﻿ / ﻿6.78°N 125.22°E﻿ / 6.78; 125.22CountryPhilippinesRegionDavao RegionProvinceDavao del SurDistrict"
        ],
        [
            "Lone districtFoundedSeptember 18, 1952Barangays25"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEdwin Reyes • Vice MayorSamuel Gadingan • RepresentativeJohn Tracy Cagas • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Mindanito G. MabanagFe S. LaoPedro F. MinguitoSunday Wilan E. GranadaRodolfo M. CartinArmand Anthony M. GallardoSaripada D. MacarampatDominique L. Caballero"
        ],
        [
            " • Electorate47,130 voters (2022)Area • Revenue₱ 215.8 million (2020) • Assets₱ 547.9 million (2020) • Expenditure₱ 175.2 million (2020) • Liabilities₱ 236.7 million (2020)Service provider • ElectricityDavao del Sur Electric Cooperative (DASURECO)Time zoneUTC+8 (PST)ZIP code8005PSGC112401000IDD : area code +63 (0)82Native languagesDavawenyo Cebuano Kalagan Obo Tagalog Ata ManoboWebsitebansalan.gov.ph"
        ],
        [
            "Bansalan, officially the Municipality of Bansalan (Cebuano: Lungsod sa Bansalan; Tagalog: Bayan ng Bansalan), is a 1st class municipality in the province of Davao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 62,737 people."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(May 2014) (Learn how and when to remove this message)"
        ],
        [
            "Bansalan was a forest primeval and the aborigines were Bagobos.",
            "As they were nomadic, they traveled from one place to the other by hacking their way through the virgin forests.",
            "They also cultivated land for their staple food but soon left the place after harvest time in search of a better place to cultivate.",
            "They also had the wide area of hunting ground where at the end of the day, they brought home speared wild boar, deer or monkeys.",
            "The implements they had were crude but obviously the bow and arrow were used both in hunting and fishing.",
            "The waters then were crystal pure and were untarnished by the changing current ecology.",
            "In some certain sites, Bansalan had patches of cogonal land interspersed with tall trees demarcated by serene creeks and turbulent rivers gushing from the belly of Mount Apo, the highest mountain peak in the Philippines where according to legend, Apo Sandawa ruled as god."
        ],
        [
            "In early times, the Bagobo society was divided into datus or the chieftains, freemen, and slaves.",
            "The datus interpret customary laws.",
            "Marriages were arranged, the groom's parents selecting the bride and negotiating the match.",
            "A bride-price is paid according to their wealth, and the bride's parents also give a present equal to about half this amount to dispel the idea that they're selling their daughter.",
            "The groom has to serve the bride's family both before and after the wedding.",
            "The two-to three-day wedding ceremony takes place in the bride's home and ends with the bride and groom feeding each other a handful of rice.",
            "Young men strived to attain the rank of magani, a warrior class whose members had killed more than one enemy and were entitled to wear distinctive red clothing.",
            "A communal spirit prevailed, with everyone helping in house-building and cultivation."
        ],
        [
            "The inhabitants in this early settlement venerated the anitos and their religion is a pantheon of innumerable gimokods (spirits), knowledge of which resides in old men and women known as mabalian."
        ],
        [
            "The Bagobos celebrate Gin-Em festival which displays gratitude to the spirits for success in war or domestic matters, or for warding-off sickness, evil spirits, or danger.",
            "Two bamboo poles are erected in the house of a datu, then offerings are made, and a chicken is sacrificed.",
            "In former times, enemy skulls would be attached to the poles, and a slave sacrificed.",
            "Each magani relates his past exploits, and dancing, chanting of old songs and poems, feasting, and drinking fermented sugarcane wine continue till daybreak."
        ],
        [
            "The Bagobos produce baskets trimmed with beads and fibers, ornate weapons, and inlaid metal boxes finished with bells.",
            "A metal box where they kept betel nuts is inseparable."
        ],
        [
            "Bansalan was the name of the simple farmer who one day dug the earth in search of potable water to quench his thirst.",
            "Fortunately, he dug a well-spring, and did not only satisfy his thirst but also called his other companions to share his discovery.",
            "Rain widened the spring and the constant erosion of soil led its transformation into a creek, and later into a river.",
            "Unfortunately, Bansalan, the farmer did not live long.",
            "His companions who were the recipients of Bansalan's daring adventures named that the river after him and later also became the name of the fledgling village.",
            "President Elpidio Querino proclaimed Bansalan as a regular town on September 18, 1952, including two booming villages of Matanao and Kialeg in the south-west and western part of Bansalan which later became regular towns."
        ],
        [
            "Davao del Sur and parts of Northern Cotabato were established by good-natured relationships of the chieftains.",
            "In the beginning of the 20th century, Datu Tumunas of Bansalan launched feeder road constructions with the help of his own tribe people.",
            "Tumunas succeeded in linking Bansalan with Digos, ushering in the establishment of a harmonious relation between the Bagobos and the Kalagans, the natives of Digos.",
            "The friendship has expanded by leaps and bounds when they encouraged constant \"tabo\" or market following the old system of \"ukom\" or barter.",
            "Datus of neighboring places came to Bansalan to establish friendly relations with Datu Tumunas.",
            "Among them were Datu Julian and Datu Akwas.",
            "Later Datu Siman of Kidapawan succeeded in constructing a road linking the place with Bansalan.",
            "More friendly relations were established as the road construction increased.\""
        ],
        [
            "Bansalan is situated at the north-western part of the Province of Davao del Sur.",
            "Towards the south is the Municipality of Matanao, to the west is the Municipality of Magsaysay, to the southeast is the Municipality of Digos and on the north-east lies the Mt.",
            "Apo National Park.",
            "Its total land area is 48,548 hectares and divided into 23 villages or barrios where the Poblacion is the main center."
        ],
        [
            "The Poblacion serves as the nerve-center of the town where all the schools, churches of different denominations, market, cinema, sports facilities, and other amenities are located.",
            "It is highly agricultural and most of the active young people work in Digos which now became the capital town of Davao del Sur.",
            "There are about 55,000 people living in the whole town including the villages."
        ],
        [
            "In the early 1950s, a big number of migrants from other parts of the country but mainly from Cebu settled in Bansalan which drastically changed the lives of the Bagobos, the native inhabitants of the place.",
            "The Bagobos retreated to the hinterlands, and the settlers took over the running and further development of the town.",
            "At present, not one public official is a native Bagobo, the tribe which was responsible in the establishment of the town.",
            "What remained is the name of Datu Bansalan but his daring adventures are already long forgotten by the town people.",
            "Town anniversaries are celebrated with grand fiestas and parades but Datu Bansalan is no longer remembered in the history nor given an appropriate celebration in honor of his founding the town.",
            "People remember the date Pres.",
            "Quirino officially proclaimed Bansalan as a regular town as if the history of the town only started in September 1952."
        ],
        [
            "In 1957, the barrios of Kibao, San Vicente, Kibuaya, Managa Km.",
            "67, Sinawilan, New Visayas, Sacub, Upper Malabang, Temongbong, Sinaragan, Maliit Digos, Kapok, Tamlangon, Manga, Buas, New Katipunan, Da-Anama, Upper Kauswagan, Kagaulas, Kabasagan, Tuwak, Mal, Latian, Lanturi, Dongang-Pekong, La Union, Kauswagan and Paitan were separated from said municipality, and constituted into a new and independent municipality known as Matanao."
        ],
        [
            "In the same year, the following sitios were converted into barrios: Buas, Mabunga, Manga, Tacul, Kanapolo, San Isidro, San Miguel, Bacongan, Dalawinon, New Clarin, Kasuga, Rizal, Dalumay, Darapuay, Kinuskusan, Tubod, Bitaug, Libertad, Buenavista, Mabini, Pananag, Union, Upper Managa, Mabuhay, Bonifacio, San Vicente, Kibao, Tinongtongan, Kabasagan, Tuwak, Maliit Digos, Tamlangon, New Katipunan, Upper Sacub, Sinarangan, Kibuaya, and Managa."
        ],
        [
            "In 1959, barrio Kialeg was renamed Magsaysay."
        ],
        [
            "Geography"
        ],
        [
            "Bansalan is about 72 kilometres (45 mi) south of Davao City and is very accessible by land transportation mostly by buses going to Cotabato City, Kidapawan and Tacurong.",
            "Bansalan is about 12 kilometres (7.5 mi) north-west of the provincial capital city of Digos.",
            "The neighboring towns include Makilala in the north, Magsaysay in the west, Matanao in the south and Mount Apo and part of Digos in the east."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bansalan, Davao del Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "59(2.3)"
        ],
        [
            "46(1.8)"
        ],
        [
            "41(1.6)"
        ],
        [
            "54(2.1)"
        ],
        [
            "105(4.1)"
        ],
        [
            "159(6.3)"
        ],
        [
            "179(7.0)"
        ],
        [
            "197(7.8)"
        ],
        [
            "162(6.4)"
        ],
        [
            "147(5.8)"
        ],
        [
            "102(4.0)"
        ],
        [
            "65(2.6)"
        ],
        [
            "1,316(51.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.3"
        ],
        [
            "11.7"
        ],
        [
            "12.2"
        ],
        [
            "14.5"
        ],
        [
            "22.6"
        ],
        [
            "25.6"
        ],
        [
            "26.6"
        ],
        [
            "27.5"
        ],
        [
            "25.5"
        ],
        [
            "26.0"
        ],
        [
            "21.2"
        ],
        [
            "16.0"
        ],
        [
            "241.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Bansalan is politically subdivided into 25 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Alegre"
        ],
        [
            "Alta Vista"
        ],
        [
            "Anonang"
        ],
        [
            "Bitaug"
        ],
        [
            "Bonifacio"
        ],
        [
            "Buenavista"
        ],
        [
            "Darapuay"
        ],
        [
            "Dolo (Urban)"
        ],
        [
            "Eman"
        ],
        [
            "Kinuskusan"
        ],
        [
            "Libertad"
        ],
        [
            "Linawan"
        ],
        [
            "Mabuhay"
        ],
        [
            "Mabunga"
        ],
        [
            "Managa"
        ],
        [
            "Marber"
        ],
        [
            "New Clarin"
        ],
        [
            "Poblacion Uno (Urban)"
        ],
        [
            "Poblacion Dos (Urban)"
        ],
        [
            "Rizal (Urban)"
        ],
        [
            "Santo Niño"
        ],
        [
            "Sibayan"
        ],
        [
            "Tinongtongan"
        ],
        [
            "Tubod (Urban)"
        ],
        [
            "Union"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BansalanYearPop.±% p.a.1960 45,360—    1970 33,374−3.02%1975 35,558+1.28%1980 40,716+2.75%1990 46,691+1.38%1995 48,894+0.87%2000 51,781+1.24%2007 54,246+0.64%2010 56,496+1.49%2015 60,440+1.29%2020 62,737+0.74%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bansalan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  31.30"
        ],
        [
            "2009  21.34"
        ],
        [
            "2012  23.69"
        ],
        [
            "2015  19.82"
        ],
        [
            "2018  17.29"
        ],
        [
            "2021  14.00"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "Festivals"
        ],
        [
            "Bansaulog Festival - every 18th day of September"
        ],
        [
            "Immaculate Concepcion Fiesta - every 8th day of December"
        ],
        [
            "Sinulog Sa Bansalan - every 28th day of January"
        ],
        [
            "Education"
        ],
        [
            "Private"
        ],
        [
            "St. Mary's College of Bansalan - Dahlia Street"
        ],
        [
            "University of Mindanao Bansalan Campus - Ramon Delos Cientos Sr. Street, National Highway"
        ],
        [
            "Nazareth High School - Nazareno Street"
        ],
        [
            "St. Therese School of Bansalan - Nebrada Subdivision"
        ],
        [
            "Gracious Redeemer Accelerated Christian Education - Lily Street, Poblacion"
        ],
        [
            "Global System Institute of Technology - Ramon Delos Cientos Sr. Street, National Highway"
        ],
        [
            "GRS School of Bansalan - Lily Street"
        ],
        [
            "Mt.",
            "Carmel Development Academy - Kinuskusan"
        ],
        [
            "Brighter Beginnings Learning Center of Bansalan, Inc. (Pre-kinder, Kinder & Elementary) - Rose St., Poblacion Dos"
        ],
        [
            "Public"
        ],
        [
            "Alegre Elementary School - Barangay Alegre"
        ],
        [
            "Altavista Elementary School - Barangay Altavista"
        ],
        [
            "Anonang Elementary School - Barangay Anonang"
        ],
        [
            "Balagonon Elementary School- Barangay Managa"
        ],
        [
            "Balutakay Elementary School - Barangay Managa"
        ],
        [
            "Bansalan Central Elementary School - Barangay Poblacion Uno"
        ],
        [
            "Bitaug Elementary School - Barangay Bitaug"
        ],
        [
            "Bonifacio Elementary School - Barangay Bonifacio"
        ],
        [
            "Buenavista Elementary School - Barangay Buenavista"
        ],
        [
            "Darapuay Elementary School - Barangay Darapuay"
        ],
        [
            "Dolo Elementary School - Barangay Dolo"
        ],
        [
            "Dr. Pedro Arches National High School - Barangay Managa"
        ],
        [
            "Eman Elementary School - Barangay Eman"
        ],
        [
            "Kinuskusan Elementary School - Barangay Kinuskusan"
        ],
        [
            "Libertad Elementary School - Barangay Libertad"
        ],
        [
            "Linawan Elementary School - Barangay Linawan"
        ],
        [
            "Mabuhay Elementary School - Barangay Mabuhay"
        ],
        [
            "Mabunga Elementary School - Barangay Mabunga"
        ],
        [
            "Managa Elementary School - Barangay Managa"
        ],
        [
            "Marber Elementary School - Barangay Marber"
        ],
        [
            "Marber National High School - Barangay Marber"
        ],
        [
            "New Clarin Elementary School - Barangay New Clarin"
        ],
        [
            "Rizal Elementary School - Barangay Rizal"
        ],
        [
            "Sibayan Elementary School - Barangay Sibayan"
        ],
        [
            "Mabunga Elementary School - Barangay Mabunga"
        ],
        [
            "Tinongtogan Elementary School - Barangay Tinongtogan"
        ],
        [
            "Union Elementary School - Barangay Union"
        ],
        [
            "Villa Doneza Central Elem.",
            "School - Barangay Tubod"
        ],
        [
            "Vicente Duterte Elementary School - Barangay Sto Niño"
        ],
        [
            "      Public High school"
        ],
        [
            "Pedro A. Arches National High School"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bansalan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"R.A. No.",
            "1902, An Act Creating the Municipality of Matanao, Province of Davao\".",
            "LawPH.com.",
            "Archived from the original on July 10, 2012.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ \"R.A. No.",
            "1674, An Act Converting Certain Sitios in the Municipality of Bansalan, Province of Davao, into Barrios\".",
            "LawPH.com.",
            "Archived from the original on July 17, 2012.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ \"R.A. No.",
            "2106, An Act Changing the Name of the Barrio of Kialeg in the Municipality of Bansalan, Province of Davao, to Barrio Magsaysay\".",
            "LawPH.com.",
            "Archived from the original on July 10, 2012.",
            "Retrieved April 13, 2011."
        ],
        [
            "^"
        ],
        [
            "\"Bansalan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved January 28, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XI (Davao Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XI (Davao Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Davao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Bansalan."
        ],
        [
            "Bansalan Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "About Bansalan"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "WOWBANSALAN Website"
        ],
        [
            "Places adjacent to Bansalan"
        ],
        [
            "Makilala, Cotabato"
        ],
        [
            "Davao City"
        ],
        [
            "Magsaysay"
        ],
        [
            "Bansalan"
        ],
        [
            "Digos"
        ],
        [
            "Matanao"
        ],
        [
            "vte Province of Davao del SurDigos (capital)  Davao City (largest city)Municipalities"
        ],
        [
            "Bansalan"
        ],
        [
            "Hagonoy"
        ],
        [
            "Kiblawan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Malalag"
        ],
        [
            "Matanao"
        ],
        [
            "Padada"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Sulop"
        ],
        [
            "Component City"
        ],
        [
            "Digos"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Davao City (Administratively independent from the province but grouped under Davao del Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bansalan&oldid=1230834700\""
        ],
        [
            "Category: Municipalities of Davao del SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textArticles needing additional references from May 2014All articles needing additional referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}