{
    "name": "Bantay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bantay"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°35′02″N 120°23′27″E﻿ / ﻿17.5839°N 120.3908°E﻿ / 17.5839; 120.3908"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Bantay\" – news · newspapers · books · scholar · JSTOR (September 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesBantayMunicipalityMunicipality of Bantay"
        ],
        [
            "SealMotto: Dur-as Bantay (Progressive Bantay)Map of Ilocos Sur with Bantay highlightedOpenStreetMapBantayLocation within the PhilippinesCoordinates: 17°35′02″N 120°23′27″E﻿ / ﻿17.5839°N 120.3908°E﻿ / 17.5839; 120.3908CountryPhilippinesRegionIlocos RegionProvinceIlocos SurDistrict"
        ],
        [
            "1st districtFounded1593Barangays34"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorSamuel C. Parilla • Vice MayorWilliam A. Pre • RepresentativeDeogracias Victor B. Savellano • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Floro P. PeredoHipolito A. MadriagaHilario L. PaetAraceli S. NaborEdilberto P. MercurioIreneo P. QuintinitaAniceto P. RamosPercival J. Vicencio"
        ],
        [
            " • Electorate22,324 voters (2022)Area • Revenue₱ 173 million (2020) • Assets₱ 760.2 million (2020) • Expenditure₱ 127.3 million (2020) • Liabilities₱ 48.86 million (2020)Service provider • ElectricityIlocos Sur Electric Cooperative (ISECO)Time zoneUTC+8 (PST)ZIP code2727PSGC012903000IDD : area code +63 (0)77Native languagesIlocano Tagalog"
        ],
        [
            "Bantay, officially the Municipality of Bantay (Ilocano: Ili ti Bantay; Filipino: Bayan ng Bantay), is a 3rd class municipality in the province of Ilocos Sur, Philippines.",
            "According to the 2020 census, it has a population of 37,118 people.",
            "It is situated just north-east of Vigan, the provincial capital."
        ],
        [
            "History"
        ],
        [
            "Spanish colonization"
        ],
        [
            "Foundation"
        ],
        [
            "Spanish conquistador Juan de Salcedo first arrived in Ilocos in 1571 and began setting up tribunals that soon became the seat of municipal governance.",
            "Augustinian friars followed in 1572 built the convent and house of worship that later became Iglesia Parroquial de San Agustín (St. Augustine Parish Church).",
            "But it was only in 1591 that the parish was recognized or first established, while the town of Bantay was formally founded as a pueblo in 1593 because it was formerly part of Vigan.",
            "It is one of the thirty-four (34) towns of the Province of Ilocos Sur, the legal basis of its creation is the Maura Law of 1893 and, thus, was constituted as a separate political subdivision during the American Regime."
        ],
        [
            "Etymology"
        ],
        [
            "Bantay got its name from the Ilocano word, to guard, which was to guard the image of Our Lady of Charity (Apo Caridad) in her sanctuary."
        ],
        [
            "The early Spanish settlers made the town beautiful by building the 'tribunal', otherwise known as the town hall, the church, bell tower, roads and streets by forced labor.",
            "The St. Augustine Church was originally made of bamboo and cogon structure by Bantay residents to house the miraculous Image of Our Lady of Charity, but it was later-on changed into a permanent edifice (built and completed in 1590) because of the good fortune it brought to the people.",
            "The Augustinian friars chose St. Augustine de Hippo, the Doctor of Grace, as the Patron Saint and the town fiesta used to be celebrated every 28 August, but because of inclement weather during this month, Most Rev.",
            "Alfredo Verzosa (Parish Priest, 1912–1916) caused the transfer of the festivity to May 5 every year."
        ],
        [
            "The original inhabitants of the town have family names with letter \"P\" taken from the designated listing, as an adopted system of the Spanish rulers in all towns of Ilocos Sur, to easily identify and monitor movement of residents.",
            "In a report of Most Reverend Bishop Domingo de Soria on August 15, 1613, the population of Bantay was 4,000 souls while at that time, Vigan has only 2,000.",
            "This can be explained by the fact that by then, Bantay parish was very extensive and broad the inclusions of the parishes of Magsingal (separated in 1676), Santo Domingo (separated in 1742), San Ildefonso (separated in 1769), San Vicente(Separated in 1795), Santa Catalina de Baba (separated in 1795) and Santa Catalina de Alexandria within its coverage or \"visitas\"."
        ],
        [
            "One of the Augustinian friars, Rev.",
            "Francisco Lopez, a great Augustinian philologist, with the help of Pedro Bukaneg, the blind genius of the Ilocano tongue who was from this place and author of the epic - \"Biag Ni Lam-ang\", The Bellarmine Catechism was the first book in Ilocano to be printed and its influence on the morality, culture and language of the entire Ilocos is measurable."
        ],
        [
            "Several battles have spillovers in Bantay, one of which was the Ilocos Revolution (Dec. 24, 1762 to May 1763) led by Diego Silang.",
            "For the Spaniards, the treacherous Vicos was their savior and to his honor a commemorative monument was erected in 1763 which became the epitome of the Town Plaza.",
            "It is replaced later by a memorial to Diego Silang towards the end of the 19th century."
        ],
        [
            "Contemporary"
        ],
        [
            "Inspired with the common vision that it will strengthen and improve the totality of local governance, Municipal buildings  were blessed and inaugurated on December 23, 1999, and May 5, 2003, respectively.",
            "Considered as major breakthroughs and milestone feats in the History of Bantay, these massive structures were built to 'reinforce' the Old(Main) Building in order to meet the vast administrative demands and service requirements of the public clientele.",
            "Sourced from Provincial and Municipal funds, these expansion edifices are the lasting tributes of the municipal and administrators (1998-2001 and 2001–2004) showcasing local accomplishment and a legacy during their incumbency."
        ],
        [
            "Dur-as Bantay Era"
        ],
        [
            "The Municipality holds the distinction of being the first Local Government Unit in Ilocos Sur to use an Electronic Scoreboard in a sporting event (the first ever to do so in the province was the University of Northern Philippines); the first to open hiking trails; and the first municipality in Ilocos Sur to hold a National Shootfest."
        ],
        [
            "Geography"
        ],
        [
            "Bantay is 137 kilometres (85 mi) north of San Fernando City, La Union, the Regional Capital of Ilocos Region, 406 kilometres (252 mi) from Metro Manila, and 1 kilometre (0.62 mi) from Vigan City, the provincial capital.",
            "It is bordered by the municipalities of San Vicente, San Ildefonso, Santo Domingo, Magsingal, Santa and the city of Vigan"
        ],
        [
            "Bantay has an average elevation of 100 meters (328.08 feet), with a land area of 7,660 hectares (18,900 acres).",
            "It is an elevated and hilly municipality but some barangays, especially those near creeks, are prone to flooding during heavy typhoons."
        ],
        [
            "Barangays"
        ],
        [
            "Bantay is politically subdivided into 34 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aggay"
        ],
        [
            "An-annam"
        ],
        [
            "Balaleng"
        ],
        [
            "Banaoang"
        ],
        [
            "Barangay 1 (Poblacion)"
        ],
        [
            "Barangay 2 (Poblacion)"
        ],
        [
            "Barangay 3 (Poblacion)"
        ],
        [
            "Barangay 4 (Poblacion)"
        ],
        [
            "Barangay 5 (Poblacion)"
        ],
        [
            "Barangay 6 (Poblacion)"
        ],
        [
            "Bulag"
        ],
        [
            "Buquig"
        ],
        [
            "Cabalanggan"
        ],
        [
            "Cabaroan"
        ],
        [
            "Cabusligan"
        ],
        [
            "Capangdanan"
        ],
        [
            "Guimod"
        ],
        [
            "Lingsat"
        ],
        [
            "Malingeb"
        ],
        [
            "Mira"
        ],
        [
            "Naguiddayan"
        ],
        [
            "Ora"
        ],
        [
            "Paing"
        ],
        [
            "Puspus"
        ],
        [
            "Quimmarayan"
        ],
        [
            "Sagneb"
        ],
        [
            "Sagpat"
        ],
        [
            "San Isidro"
        ],
        [
            "San Julian"
        ],
        [
            "San Mariano (formerly Sallacong)"
        ],
        [
            "Sinabaan"
        ],
        [
            "Taguiporo"
        ],
        [
            "Taleb"
        ],
        [
            "Tay-ac"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bantay, Ilocos Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "19(66)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "9(0.4)"
        ],
        [
            "11(0.4)"
        ],
        [
            "13(0.5)"
        ],
        [
            "23(0.9)"
        ],
        [
            "92(3.6)"
        ],
        [
            "122(4.8)"
        ],
        [
            "153(6.0)"
        ],
        [
            "137(5.4)"
        ],
        [
            "139(5.5)"
        ],
        [
            "141(5.6)"
        ],
        [
            "42(1.7)"
        ],
        [
            "14(0.6)"
        ],
        [
            "896(35.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "4.6"
        ],
        [
            "4.0"
        ],
        [
            "6.2"
        ],
        [
            "9.1"
        ],
        [
            "19.5"
        ],
        [
            "23.2"
        ],
        [
            "24.0"
        ],
        [
            "22.5"
        ],
        [
            "21.5"
        ],
        [
            "15.2"
        ],
        [
            "10.5"
        ],
        [
            "6.0"
        ],
        [
            "166.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Flora and fauna"
        ],
        [
            "Bantay's reserved forests and farms make it home to a diverse range of plants, animals, and river creatures.",
            "Around more than 60 species can be found in Bantay including over 9 mammal, reptile (including monitor lizards), and amphibian species; 10 bird and fish species; several insects and plants are existing in the farms and wild."
        ],
        [
            "Typical of places all over the Philippines, cattle and water buffalo are domesticated.",
            "Herons are often sighted in rice paddies, and beetles (especially the \"aros-aros\" and the \"abal-abal\") and crickets come seasonally.",
            "Mudfish, carp, the Abra River eel, and other fish abound in its rivers and creeks, most of which are also seasonal.",
            "Monkeys, wild boar, and wild chickens can be seen in the mountains, but not as plentiful as before."
        ],
        [
            "Spanish plum trees (known locally as \"sarguelas\") abound in the municipality, especially in Barangays Paing and Banaoang.",
            "Valuable lumber trees such as mahogany and molave abound in its mountains, especially in Caniao.",
            "Bamboo also abound in the municipality, especially the \"bayug,\" \"bikal,\" and \"bulo\" (\"buho\") varieties."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BantayYearPop.±% p.a.1903 7,020—    1918 9,573+2.09%1939 12,105+1.12%1948 12,714+0.55%1960 15,833+1.84%YearPop.±% p.a.1970 19,164+1.93%1975 20,666+1.52%1980 22,282+1.52%1990 26,024+1.56%1995 28,128+1.47%YearPop.±% p.a.2000 30,519+1.76%2007 33,174+1.16%2010 34,323+1.25%2015 35,731+0.77%2020 37,118+0.75%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Bantay had a population of 37,118.",
            "The population density was 480 inhabitants per square kilometre (1,200/sq mi)."
        ],
        [
            "Religion"
        ],
        [
            "St Augustine Church, one of two parochial churches in Bantay (the other being in Barangay Paing)."
        ],
        [
            "About 94% of the total inhabitants are Christians, while the remaining 6% are Muslims or belong to other major religions/sects."
        ],
        [
            "In the total population of Christian Bantayenos, Roman Catholics are 99%.",
            "Since it was occupied by Spaniards during the Early Colonial Period."
        ],
        [
            "Language"
        ],
        [
            "Since the Ilocano language is the mother tongue of the Ilocanos, most of the Bantayeños especially the Muslims and Indians speak it alongside Tagalog.",
            "However, in schools and during Legislative Sessions (by the Sangguniang Bayan), they are required to speak English."
        ],
        [
            "Ilocano - 97%"
        ],
        [
            "Tagalog - 2%"
        ],
        [
            "English - 1%"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bantay"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  13.20"
        ],
        [
            "2009  16.42"
        ],
        [
            "2012  15.68"
        ],
        [
            "2015  11.22"
        ],
        [
            "2018  3.18"
        ],
        [
            "2021  12.00"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Bantay, belonging to the first congressional district of the province of Ilocos Sur, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "For the 2010–2013 term, Samuel C. Parilla was the elected mayor of the town (since 1988–1998; 2007–present), with Floro Jose P. Peredo, Sr. as the vice mayor.",
            "The municipality's Sangguniang Bayan members included William Pre, Roberto Reboroso, William Pacpaco, Ireneo Quintinita, Edilberto Mercurio, Nick Pamuspusan, Arnold Paz, and George Leones.",
            "Also in the Sangguniang Bayan were ABC President Gloria Ramirez and Sangguniang Kabataan Federated President Jonalyn Pre."
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Deogracias Victor B. Savellano"
        ],
        [
            "Mayor"
        ],
        [
            "Samuel C. Parilla"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "William Pre"
        ],
        [
            "Councilors"
        ],
        [
            "Floro P. Peredo"
        ],
        [
            "Hipolito A. Madriaga"
        ],
        [
            "Hilario L. Paet"
        ],
        [
            "Araceli S. Nabor"
        ],
        [
            "Edilberto P. Mercurio"
        ],
        [
            "Ireneo P. Quintinita"
        ],
        [
            "Aniceto P. Ramos"
        ],
        [
            "Percival J. Vicencio"
        ],
        [
            "Tourism"
        ],
        [
            "The bell tower was damaged by a 7.3 magnitude earthquake on July 27, 2022"
        ],
        [
            "The replacement of the Quirino Bridge above the Abra River between the towns of Santa and Bantay"
        ],
        [
            "Cultural and historical"
        ],
        [
            "Saint Augustine Parish Church"
        ],
        [
            "One of two parishes in the municipality.",
            "It serves as the Sanctuary of Nuestra Señora de La Caridad, the Queen of Ilocandia.",
            "The church and bell tower are considered to be the two of the oldest structures in the province, as the bell tower was built in 1590 and the church was in the following year.",
            "The place, especially the bell tower, is a tourist attraction mostly accessed from Vigan by means of horse-drawn carts called \"calesas.\"",
            "The original beauty of the structures are still preserved until today."
        ],
        [
            "Quirino Bridge"
        ],
        [
            "This scenic arch bridge traversing the Abra River is located between two beautiful mountains and is built to honor then-President Elpidio Quirino.",
            "It was once partly destroyed by Super Typhoon Feria, hence a different-looking third quarter portion.",
            "In December 2007, Chinese engineers and a local construction company started to build a new, 456 meter-long replacement, a stone's throw from the original bridge.",
            "It was officially opened by then-President Gloria Macapagal Arroyo on December 30, 2009.",
            "The old bridge, an iconic symbol of Ilocos Sur, is currently preserved as a tourist attraction, doubling as a backup in case the main bridge is damaged by typhoons.",
            "The old bridge was once again damaged during Super Typhoon Egay on July 24, 2023."
        ],
        [
            "Natural"
        ],
        [
            "Carballo Mountains"
        ],
        [
            "The municipality is home to a portion of this mountain range that overlooks the Cagayan Valley and portions of Babuyan Islands, and to which the municipality partly owes its name.",
            "The range has two popular mountain peaks, Caniao and Tupira.",
            "This is one of the few mountain ranges in Ilocos Sur and the only natural tourist spot of Bantay aside from the Abra River.",
            "It has forests and crystal-clear springs, which also supplies drinking water to most of Metro Vigan.",
            "It is a destination of the Philippine Army and habitat of unique species like wild pigs and monkeys.",
            "Today it is a location of firing ranges, some telecommunications relay facilities (often mistaken by locals as a radar array), and hiking trails.",
            "It also houses the headquarters and nursery for a reforestation project conducted by the Department of Environment and Natural Resources."
        ],
        [
            "Education"
        ],
        [
            "Colleges"
        ],
        [
            "There are two major educational institutions in Bantay:"
        ],
        [
            "St. Paul College of Ilocos Sur (formerly Rosary College) - The oldest privately funded school in Ilocos Sur, founded as an all-girls' educational institution by the Sisters of Saint Paul of Chartres in Vigan.",
            "Its former campus near the Vigan Cathedral is now the site of a shopping mall, having recently fully transferred to nearby Bantay.",
            "It has recently joined the Saint Paul University System."
        ],
        [
            "Ilocos Sur Community College (ISCC) - A college being operated by the provincial government, with its campus located near Quirino Stadium.",
            "The college was founded in 1975."
        ],
        [
            "High schools"
        ],
        [
            "Bantay National High School"
        ],
        [
            "Tay-ac National High School"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bantay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Bantay Ilocos Sur - History\".",
            "durasbantay.page.tl.",
            "Retrieved 2023-09-05."
        ],
        [
            "^ a b http://bantayilocossur.gov.ph/wp-content/uploads/2022/03/The-Insights-and-History.pdf"
        ],
        [
            "^ http://www.geocities.ws/sinupan/BukanegP.htm"
        ],
        [
            "^ Palanco, Fernando (January 2002).",
            "\"09.",
            "Diego Silang's Revolt: A New Approach.PDF\".",
            "Philippine Studies."
        ],
        [
            "^ Ahmod, Tanvir.",
            "\"treacherously - kannada Meaning - treacherously Meaning in kannada at wordmeaningindia.com | treacherously ಕನ್ನಡದಲ್ಲಿ ಅರ್ಥ\".",
            "wordmeaningindia.com.",
            "Retrieved 2023-09-05."
        ],
        [
            "^ \"137 Km - Distance from San Fernando La Union to bantay ilocos sur\".",
            "www.distancesfrom.com.",
            "Retrieved 2023-09-05."
        ],
        [
            "^"
        ],
        [
            "\"Province: Ilocos Sur\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Bantay: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 14 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 11, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Bantay, Ilocos Sur."
        ],
        [
            "Pasyalang Ilocos Sur"
        ],
        [
            "Places adjacent to Bantay"
        ],
        [
            "San Ildefonso / Santo Domingo"
        ],
        [
            "Magsingal"
        ],
        [
            "San Vicente"
        ],
        [
            "Bantay"
        ],
        [
            "Langiden, Abra"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Vigan / Santa"
        ],
        [
            "San Quintin, Abra"
        ],
        [
            "vte Province of Ilocos SurVigan (capital)  Candon (largest city)Municipalities"
        ],
        [
            "Alilem"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bantay"
        ],
        [
            "Burgos"
        ],
        [
            "Cabugao"
        ],
        [
            "Caoayan"
        ],
        [
            "Cervantes"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Lidlidda"
        ],
        [
            "Magsingal"
        ],
        [
            "Nagbukel"
        ],
        [
            "Narvacan"
        ],
        [
            "Quirino"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Juan"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Component cities"
        ],
        [
            "Candon"
        ],
        [
            "Vigan"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Sur"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bantay&oldid=1221275382\""
        ],
        [
            "Categories: Municipalities of Ilocos SurPopulated places on the Abra RiverHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}