{
    "name": "Baras",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Baras, Rizal"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°31′N 121°16′E﻿ / ﻿14.52°N 121.27°E﻿ / 14.52; 121.27"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Rizal, Philippines"
        ],
        [
            "Municipality in Calabarzon, PhilippinesBarasMunicipalityMunicipality of BarasWelcome arch"
        ],
        [
            "FlagSealMap of Rizal with Baras highlightedOpenStreetMapBarasLocation within the PhilippinesCoordinates: 14°31′N 121°16′E﻿ / ﻿14.52°N 121.27°E﻿ / 14.52; 121.27CountryPhilippinesRegionCalabarzonProvinceRizalDistrict"
        ],
        [
            "2nd districtFounded1595Annexation to MorongOctober 12, 1903Annexation to TanayJanuary 16, 1906CharteredNovember 24, 1920Barangays10"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorWilfredo C. Robles • Vice MayorKathrine B. Robles • RepresentativeEmigdio P. Tanjuatco III • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Carlo D. LlagasVergil F. RoblesArmingol D. Pilapil Jr.Johnwilmer C. ElagoJovita P. CawicaanEmmanuel R. OlañoMario P. MendozaBien A. Garrovillas"
        ],
        [
            " • Electorate46,282 voters (2022)Area • Revenue₱ 247.3 million (2020) • Assets₱ 438.1 million (2020) • Expenditure₱ 248.3 million (2020) • Liabilities₱ 156.9 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code1970PSGC045803000IDD : area code +63 (0)2Native languagesTagalogWebsitewww.barasrizal.gov.ph"
        ],
        [
            "Baras, officially the Municipality of Baras (Tagalog: Bayan ng Baras),  is a 4th class municipality in the province of Rizal, Philippines.",
            "According to the 2020 census, it has a population of 87,637 people."
        ],
        [
            "Baras is 32 kilometres (20 mi) from Antipolo and 49 kilometres (30 mi) from Manila."
        ],
        [
            "History"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "In 1595, the Franciscan missionaries under the leadership of Fr.",
            "Juan de Placencia and Fr.",
            "Diego de Oropesa, founded a “visita” for Morong on the present site of Bosoboso, south of Painaan with Apostol Santiago as its patron saint.",
            "It was known as “Visita de Santiago” or Santiago until such time that it became Baras.",
            "Baras was then inhabited by 400 Aetas and other mountain people."
        ],
        [
            "In 1636, the town was transferred to a place called Ibayo, one and one-half leagues southeast of the first site due to the hostility of the Aetas and the mountaineers who burned part of the town and church in 1635.",
            "San Salvador became their patron saint.",
            "However, the town and church of Baras was burned by Chinese rebels in 1639, who were retreating from Manila to the Sierra Madre mountains."
        ],
        [
            "The ecclesiastical administration of Baras was given back by the Jesuits to the Franciscan in 1679.",
            "Two years later In 1682, the town was transferred to its present site where they would not be menaced by marauding tribes of the mountaineers."
        ],
        [
            "Baras was under the jurisdiction of the province of Laguna from 1606 to 1853.",
            "Its administration was transferred to the newly created Distrito Politico-Militar de los Montes de San Mateo.",
            "This district was renamed to Distrito de Morong in 1857 whose capital was in Antipolo but was later transferred to Morong."
        ],
        [
            "In July 1895, the representatives of Katipunan came to inform the people of Morong, Tanay, Antipolo, Baras and Pililla about the cause of the secret society.",
            "The Katipunan of Baras established the Real or Military Camp at sitio of Gogo or Pamitinan.",
            "On November 21, 1896, the Katipunan attempted to capture the town of Morong but were driven by the Guardia Civil.",
            "By 1898, Baras had joined the Revolutionary Government of Emilio Aguinaldo."
        ],
        [
            "After the defeat of the Spaniards in Morong, the Aguinaldo Headquarters ordered the establishment of the municipal township.",
            "A special election was held.",
            "However, the Revolutionary Government of Aguinaldo did not last because of the outbreak of the Filipino-American War.",
            "On March 29, 1900, Military Order No.",
            "40, by Governor General Meritt came in effect.",
            "This order was for the election of an Alcalde Municipal, Vice Alcalde, and the Municipal Council.",
            "This was implemented in October of the same year."
        ],
        [
            "American invasion era"
        ],
        [
            "Act No.",
            "942 was passed by the Philippine Commission in 1901, providing the establishment of the Province of Rizal to be comprised in part of towns from the former Distrito de Morong.",
            "Baras effectively became part of the new province.",
            "However, on October 12, 1903, it was annexed to the town of Morong."
        ],
        [
            "On January 16, 1906, Baras was annexed to Tanay by virtue of Act No.",
            "1442."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "During the Second World War, the Imperial Japanese armed forces occupied and entered the municipal town of Baras in 1942.",
            "The local guerrillas of the General Marking Unit sieged and invaded the town of Baras and attacked the Japanese from 1942 to 1945.",
            "The local Filipino troops of the Philippine Commonwealth Army and the Philippine Constabulary units liberated the municipality of Baras in 1945.",
            "The guerrillas of the General Marking Units defeated the Japanese forces, and it ended World War II."
        ],
        [
            "The Military General Headquarters and Camp Bases of the 53rd Infantry Division of the Philippine Commonwealth Army was established and active from January 3, 1942, to June 30, 1946, and built Camp Caparas in Baras.",
            "The military engagements of the Anti-Japanese Operations in Manila and Southern Luzon aided the local guerrilla resistance fighters and U.S. military forces against the Japanese Imperial forces."
        ],
        [
            "The town of Baras was razed to the ground on March 10, 1945.",
            "This signified the liberation of the town but also left many homeless.",
            "The rehabilitation of the town began.",
            "War damage claims were filed to the amount of P 300,000 to be used for the construction of new houses.",
            "Then mayor, Mariano Golla, focused on the improvement of roads and the construction of a public dispensary.",
            "Under his term, Baras was elevated to a fourth-class municipality due to an increase in income."
        ],
        [
            "Under the succeeding administrations, improvements of road networks were implemented; seven liberty wells were constructed; the number of schoolhouses were increased; river controls in Barangay San Juan and San Jose were constructed; rehabilitation of the existing government building continued; and a reforestation program was launched."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Political subdivisions  (Subject for Correction)"
        ],
        [
            "Baras Municipal Hall"
        ],
        [
            "Baras is politically subdivided into 10 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "There is only one urban barangay (highlighted in bold) and the rest of the barangays are classified as rural."
        ],
        [
            "Evangelista"
        ],
        [
            "Rizal (Poblacion)"
        ],
        [
            "San Jose"
        ],
        [
            "San Salvador"
        ],
        [
            "Santiago"
        ],
        [
            "Concepcion"
        ],
        [
            "San Juan"
        ],
        [
            "San Miguel"
        ],
        [
            "Mabini"
        ],
        [
            "Pinugay"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Baras, Rizal"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "40(1.6)"
        ],
        [
            "33(1.3)"
        ],
        [
            "35(1.4)"
        ],
        [
            "38(1.5)"
        ],
        [
            "138(5.4)"
        ],
        [
            "190(7.5)"
        ],
        [
            "242(9.5)"
        ],
        [
            "216(8.5)"
        ],
        [
            "224(8.8)"
        ],
        [
            "200(7.9)"
        ],
        [
            "114(4.5)"
        ],
        [
            "94(3.7)"
        ],
        [
            "1,564(61.6)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.2"
        ],
        [
            "9.0"
        ],
        [
            "11.0"
        ],
        [
            "11.7"
        ],
        [
            "21.5"
        ],
        [
            "24.0"
        ],
        [
            "27.2"
        ],
        [
            "26.1"
        ],
        [
            "26.8"
        ],
        [
            "22.3"
        ],
        [
            "16.3"
        ],
        [
            "15.1"
        ],
        [
            "223.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BarasYearPop.±% p.a.1903 1,200—    1939 2,120+1.59%1948 2,745+2.91%1960 4,454+4.12%1970 7,166+4.86%1975 9,722+6.31%1980 11,196+2.86%1990 16,880+4.19%1995 20,060+3.29%2000 24,514+4.39%2007 31,524+3.53%2010 32,609+1.24%2015 69,300+15.44%2020 87,637+4.72%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Baras, Rizal, was 87,637 people, with a density of 1,000 inhabitants per square kilometre or 2,600 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Baras"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  9.00"
        ],
        [
            "2009  11.43"
        ],
        [
            "2012  9.13"
        ],
        [
            "2015  8.54"
        ],
        [
            "2018  6.40"
        ],
        [
            "2021  7.61"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Diocesan Shrine and Parish of Saint Joseph (Baras Church)"
        ],
        [
            "Diocesan Shrine and Parish of Saint Joseph"
        ],
        [
            "Main article: Diocesan Shrine and Parish of St. Joseph - Baras, Rizal"
        ],
        [
            "The oldest and most notable landmark in Baras is the Diocesan Shrine and Parish of Saint Joseph, it enshrines the miraculous venerated image of San Jose de Baras.",
            "The Church was built by the Franciscan missionaries in 1682, the same year the town was transferred to its present site.",
            "It was completed in 1686 and was dedicated to St. Joseph, the town's patron saint.",
            "It is known for having paniki in its ceiling.",
            "The Church has been seen in well-known international and local films, TV series and commercials."
        ],
        [
            "Palo Alto Falls"
        ],
        [
            "This breathtaking man-made falls in Palo Alto is just an hour drive from the town's population.",
            "Located in Marcos Highway (Marikina–Infanta Highway)"
        ],
        [
            "Kinamatayan Falls"
        ],
        [
            "Legend says two lovers who had family issues committed suicide at the falls so no one will be able to separate them.",
            "The Falls is now being managed by the Local Government Unit.",
            "Few minutes of hike will take you to the cold as ice falls of Kinamatayan."
        ],
        [
            "Masungi Georeserve"
        ],
        [
            "Main article: Masungi Georeserve"
        ],
        [
            "A conservation area adjacent to Garden Cottages located in the mountainous section Marcos Highway (Markina-Infanta Highway) of Baras by its border with Tanay, Rizal."
        ],
        [
            "Other places"
        ],
        [
            "Pillow basalt outcrop in Barangay Pinugay"
        ],
        [
            "The site of the 53rd Infantry Division of the Philippine Commonwealth Army, the military general headquarters, military camps and garrison was located at Camp Caparas in Concepcion, Baras, Rizal from January 3, 1942, to June 30, 1946.",
            "During the Battle for the Liberation of Manila in 1945, over 15,700 Filipino soldiers, tanks, armored fighting vehicles, military trucks, artilleries and many other equipment of the 53rd Infantry Division of the Philippine Commonwealth Army were sent from Military GHQ at Camp Caparas in Baras, Rizal to support military operations in Manila from February to March 1945."
        ],
        [
            "It was the site of the General Agustin Marking Guerrilla Unit which was founded in 1942 and disbanded in 1945."
        ],
        [
            "Sikaran"
        ],
        [
            "Baras is also the home of the Philippines' native martial arts', Sikaran.",
            "This ancient martial art was popular among the farmers in the village of Bara even before the Spanish conquest of the Philippine Archipelago in 1521."
        ],
        [
            "Hari Osias Banaag, founder of the Global Sikaran Federation and diplomat for the traditional game, attended and was warmly received at the UNESCO Collective Consultation Meeting on the Preservation and the Promotion of Traditional Sports and Game (TSG).",
            "Hari Osias Banaag is an appointed member of Ad hoc Advisory Committee Traditional Sports and Games, UNESCO(TSG)."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Baras |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c d \"History\".",
            "Official Website of the Municipal Government of Baras, Rizal.",
            "Archived from the original on 2014-05-23."
        ],
        [
            "^ Act No.",
            "942 (October 12, 1903), An Act Reducing the Thirty-Two Municipalities of the Province of Rizal to Fifteen, retrieved June 19, 2022"
        ],
        [
            "^ Act No.",
            "1442 (January 16, 1906), AN ACT Increasing the number of municipalities in the Province of Rizal from sixteen, as established by Act Numbered Nine hundred and forty-two, as amended, to seventeen, by making Malabon and Navotas separate municipalities, and transferring the former municipality of Baras from the municipality of Morong to the municipality of Tanay., retrieved April 24, 2022"
        ],
        [
            "^"
        ],
        [
            "\"Baras: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 11 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Rizal\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Ref"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Baras, Rizal."
        ],
        [
            "Baras Profile at PhilAtlas.com"
        ],
        [
            "Baras Rizal Online - Community website of the People of Baras, Rizal"
        ],
        [
            "Official Website of the Municipal Government of Baras, Rizal"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "vteMartial arts"
        ],
        [
            "List of styles"
        ],
        [
            "History"
        ],
        [
            "Timeline"
        ],
        [
            "Records"
        ],
        [
            "Hard and soft"
        ],
        [
            "ClassificationRegional origin"
        ],
        [
            "China"
        ],
        [
            "Europe"
        ],
        [
            "India"
        ],
        [
            "Indonesia"
        ],
        [
            "Italian"
        ],
        [
            "Ireland"
        ],
        [
            "Japan"
        ],
        [
            "Okinawa"
        ],
        [
            "Korea"
        ],
        [
            "Mainland Southeast Asia"
        ],
        [
            "Philippines"
        ],
        [
            "Russia"
        ],
        [
            "Vietnam"
        ],
        [
            "Unarmed techniques"
        ],
        [
            "Arm strikes"
        ],
        [
            "Chokehold"
        ],
        [
            "Punch"
        ],
        [
            "Elbow strike"
        ],
        [
            "Clinch"
        ],
        [
            "Ground"
        ],
        [
            "Headbutt"
        ],
        [
            "Leg strikes"
        ],
        [
            "Footwork"
        ],
        [
            "Kick"
        ],
        [
            "Flying"
        ],
        [
            "Knee strike"
        ],
        [
            "Stomp"
        ],
        [
            "Grappling"
        ],
        [
            "Hold"
        ],
        [
            "Joint lock"
        ],
        [
            "Sweep"
        ],
        [
            "Takedown"
        ],
        [
            "Throw"
        ],
        [
            "Stand-up"
        ],
        [
            "Weapons"
        ],
        [
            "Duel"
        ],
        [
            "Melee weapons"
        ],
        [
            "Knife fighting"
        ],
        [
            "Stick-fighting"
        ],
        [
            "Swordsmanship"
        ],
        [
            "Ranged weapons"
        ],
        [
            "Archery"
        ],
        [
            "Shooting"
        ],
        [
            "Training"
        ],
        [
            "Kata"
        ],
        [
            "Boxing glove"
        ],
        [
            "Practice weapon"
        ],
        [
            "Punching bag"
        ],
        [
            "Pushing hands"
        ],
        [
            "Randori"
        ],
        [
            "Sparring"
        ],
        [
            "Grappling"
        ],
        [
            "Barróg"
        ],
        [
            "Brazilian jiu-jitsu"
        ],
        [
            "Judo (Para judo)"
        ],
        [
            "Jujutsu"
        ],
        [
            "Luta Livre esportiva"
        ],
        [
            "Malla-yuddha"
        ],
        [
            "Pehlwani"
        ],
        [
            "Sambo"
        ],
        [
            "Shuai jiao"
        ],
        [
            "Sumo"
        ],
        [
            "Wrestling"
        ],
        [
            "catch"
        ],
        [
            "Cornish"
        ],
        [
            "folk"
        ],
        [
            "freestyle"
        ],
        [
            "Greco-Roman"
        ],
        [
            "Mongolian"
        ],
        [
            "oil"
        ],
        [
            "shoot"
        ],
        [
            "Striking"
        ],
        [
            "Bando"
        ],
        [
            "Boxing"
        ],
        [
            "Capoeira"
        ],
        [
            "Chess boxing"
        ],
        [
            "Choi Kwang-Do"
        ],
        [
            "Dambe"
        ],
        [
            "Karate"
        ],
        [
            "Kickboxing"
        ],
        [
            "Kun Khmer"
        ],
        [
            "Lethwei"
        ],
        [
            "Muay Thai"
        ],
        [
            "Northern Praying Mantis"
        ],
        [
            "Russian boxing"
        ],
        [
            "Sanda"
        ],
        [
            "Shaolin kung fu"
        ],
        [
            "Shoot boxing"
        ],
        [
            "Savate"
        ],
        [
            "Taekwondo"
        ],
        [
            "Tang Soo Do"
        ],
        [
            "Tien Shan Pai"
        ],
        [
            "Vovinam"
        ],
        [
            "Wudangquan"
        ],
        [
            "Yoshukai Karate"
        ],
        [
            "Internal"
        ],
        [
            "Aikido"
        ],
        [
            "Daitō-ryū Aiki-jūjutsu"
        ],
        [
            "Baguazhang"
        ],
        [
            "Tai chi"
        ],
        [
            "Xingyiquan"
        ],
        [
            "Full contact / combat sports"
        ],
        [
            "Professional boxing"
        ],
        [
            "Kickboxing"
        ],
        [
            "Full contact karate"
        ],
        [
            "Mixed martial arts"
        ],
        [
            "Pankration"
        ],
        [
            "Shootfighting"
        ],
        [
            "Submission wrestling"
        ],
        [
            "Vale Tudo"
        ],
        [
            "Self-defense / combatives"
        ],
        [
            "Arnis"
        ],
        [
            "Bartitsu"
        ],
        [
            "Hapkido"
        ],
        [
            "Kajukenbo"
        ],
        [
            "Jieitaikakutōjutsu"
        ],
        [
            "Krav Maga"
        ],
        [
            "MCMAP"
        ],
        [
            "Pencak silat"
        ],
        [
            "Pencak Silat Harimau"
        ],
        [
            "Suffrajitsu"
        ],
        [
            "Systema"
        ],
        [
            "Taekkyon"
        ],
        [
            "To-Shin Do"
        ],
        [
            "Wing Chun"
        ],
        [
            "Silat Melayu"
        ],
        [
            "Eclectic / hybrids"
        ],
        [
            "American Kenpo"
        ],
        [
            "Angampora"
        ],
        [
            "Chun Kuk Do"
        ],
        [
            "Hokutoryu Ju-Jutsu"
        ],
        [
            "Jeet Kune Do"
        ],
        [
            "Shooto"
        ],
        [
            "Shorinji Kempo"
        ],
        [
            "Unifight"
        ],
        [
            "Qwan Ki Do"
        ],
        [
            "Battlefield"
        ],
        [
            "Banshay"
        ],
        [
            "Bokator"
        ],
        [
            "Historical European martial arts"
        ],
        [
            "Huiyen Lallong"
        ],
        [
            "Jujutsu"
        ],
        [
            "Kalaripayattu"
        ],
        [
            "Krabi–krabong"
        ],
        [
            "Krav Maga"
        ],
        [
            "Mardani khel"
        ],
        [
            "Marine Corps Martial Arts Program"
        ],
        [
            "Pencak Silat Harimau"
        ],
        [
            "Entertainment"
        ],
        [
            "Fighting game"
        ],
        [
            "Martial arts film (Chanbara)"
        ],
        [
            "Professional wrestling"
        ],
        [
            "Stage combat"
        ],
        [
            "Tricking"
        ],
        [
            "Wuxia"
        ],
        [
            "International gamesMartial arts at the Summer Olympics"
        ],
        [
            "Boxing"
        ],
        [
            "Fencing"
        ],
        [
            "Judo"
        ],
        [
            "Karate"
        ],
        [
            "Taekwondo"
        ],
        [
            "Wrestling (freestyle, Greco-Roman)"
        ],
        [
            "Demonstration sports"
        ],
        [
            "Budō"
        ],
        [
            "Pistol dueling"
        ],
        [
            "Glima"
        ],
        [
            "Savate"
        ],
        [
            "Martial arts at the World Games"
        ],
        [
            "Ju-jitsu"
        ],
        [
            "Karate"
        ],
        [
            "Kickboxing"
        ],
        [
            "Muay Thai"
        ],
        [
            "Sumo"
        ],
        [
            "Former official sports"
        ],
        [
            "Sambo"
        ],
        [
            "Taekwondo"
        ],
        [
            "Invitational sports"
        ],
        [
            "Aikido"
        ],
        [
            "Wushu"
        ],
        [
            "Martial arts at the Pan American Games"
        ],
        [
            "Boxing"
        ],
        [
            "Fencing"
        ],
        [
            "Judo"
        ],
        [
            "Karate"
        ],
        [
            "Taekwondo"
        ],
        [
            "Wrestling"
        ],
        [
            "Martial arts at the Asian Games"
        ],
        [
            "Boxing"
        ],
        [
            "Judo"
        ],
        [
            "Jujutsu"
        ],
        [
            "Karate"
        ],
        [
            "Taekwondo"
        ],
        [
            "Wrestling"
        ],
        [
            "Wushu"
        ],
        [
            "2018 Only"
        ],
        [
            "Kurash"
        ],
        [
            "Pencak silat"
        ],
        [
            "Sambo"
        ],
        [
            "Martial arts at the African Games"
        ],
        [
            "Boxing"
        ],
        [
            "Fencing"
        ],
        [
            "Judo"
        ],
        [
            "Karate"
        ],
        [
            "Taekwondo"
        ],
        [
            "Wrestling"
        ],
        [
            "Martial arts at the European Games"
        ],
        [
            "Boxing"
        ],
        [
            "Fencing"
        ],
        [
            "Judo"
        ],
        [
            "Karate"
        ],
        [
            "Muaythai"
        ],
        [
            "Sambo"
        ],
        [
            "Taekwondo"
        ],
        [
            "Wrestling"
        ],
        [
            " Portal"
        ],
        [
            " Outline"
        ],
        [
            "Places adjacent to Baras, Rizal"
        ],
        [
            "Tanay"
        ],
        [
            "Morong"
        ],
        [
            "Baras"
        ],
        [
            "Tanay"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "vte Province of RizalAntipolo (capital and largest city)Municipalities"
        ],
        [
            "Angono"
        ],
        [
            "Baras"
        ],
        [
            "Binangonan"
        ],
        [
            "Cainta"
        ],
        [
            "Cardona"
        ],
        [
            "Jalajala"
        ],
        [
            "Morong"
        ],
        [
            "Pililla"
        ],
        [
            "Rodriguez"
        ],
        [
            "San Mateo"
        ],
        [
            "Tanay"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Component City"
        ],
        [
            "Antipolo"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Baras,_Rizal&oldid=1208733760\""
        ],
        [
            "Categories: Municipalities of RizalPopulated places on Laguna de BayHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}