{
    "name": "Baras",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Baras, Catanduanes"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°40′N 124°22′E﻿ / ﻿13.67°N 124.37°E﻿ / 13.67; 124.37"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Catanduanes, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Baras, Catanduanes\" – news · newspapers · books · scholar · JSTOR (January 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bicol Region, PhilippinesBarasMunicipalityMunicipality of BarasPuraran beach"
        ],
        [
            "FlagMap of Catanduanes with Baras highlightedOpenStreetMapBarasLocation within the PhilippinesCoordinates: 13°40′N 124°22′E﻿ / ﻿13.67°N 124.37°E﻿ / 13.67; 124.37CountryPhilippinesRegionBicol RegionProvinceCatanduanesDistrict"
        ],
        [
            "Lone districtFoundedMay 11, 1897Barangays29"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJose Paolo P. Teves III • Vice MayorRico T. Tating • RepresentativeHector S. Sanchez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Perfecto M. Guerrero Jr.Jose T. TayotoEmerson B. OlimanJesus B. Balunsay Jr.Salve S. BataanonJuan V. Timuat Jr.Edna S. TomaganFidelito T. Soledad"
        ],
        [
            " • Electorate11,158 voters (2022)Area • Revenue₱ 83.65 million (2020) • Assets₱ 204.4 million (2020) • Expenditure₱ 80.64 million (2020) • Liabilities₱ 52.32 million (2020)Service provider • ElectricityFirst Catanduanes Electric Cooperative (FICELCO)Time zoneUTC+8 (PST)ZIP code4803PSGC052002000IDD : area code +63 (0)52Native languagesTagalogWebsitewww.baras-catanduanes.gov.ph"
        ],
        [
            "Baras, officially the Municipality of Baras, is a 5th class municipality in the province of Catanduanes, Philippines.",
            "According to the 2020 census, it has a population of 13,484 people."
        ],
        [
            "Etymology"
        ],
        [
            "The name is derived from the \"badas\" plant, once abundant in this location.",
            "Yet, what kind of vegetation \"badas\" is, is a subject of conjecture.",
            "Some believed that it was a kind of bamboo, now called \"bagacay\".",
            "Others believed it to be some sturdy tree, but the majority believed that it is a wild rattan plant abounding in the surrounding mountains.",
            "Nevertheless, one common belief is the fact that this \"badas\" was a source of materials for making spears, a weapon used by the natives to repel the raiders and pirates."
        ],
        [
            "It is also believed that \"badas\" was a much in-demand material for building the native huts.",
            "Because of its abundance in the area, villagers called the place \"Cabadasan\""
        ],
        [
            "History"
        ],
        [
            "Baras Church, Catanduanes"
        ],
        [
            "Once called \"BADAS\" during the early Spanish Colonization of the archipelago.",
            "Some elders recall that Baras, centuries back were once a progressive fishing village located over a small mountain projecting towards the sea on the western side of Baras Bay.",
            "The poblacion was its cemetery and the cemetery now was its former poblacion site.",
            "The old site was chosen because it was an elevated area overlooking the sea."
        ],
        [
            "The villagers could easily see approaching pirates that occasionally plundered the sea, giving them ample time to evacuate their families and prepare for the encounter.",
            "Several Skirmishes had been taught in the present poblacion."
        ],
        [
            "Excavation in the Church Plaza reveals human remains of evaders.",
            "The pirates gone; the villagers later settled in what are now Baras.",
            "A splintered group of insurrecturs headed by a certain CATALINO CATAKUTAN who was facing the advantage of the insurrection taking place in the Southern Tagalog region, braved the rough seas to set a place in the long quest for Philippine Independence in the Island, forced by the gusty Southeast Monsoon wind they finally set anchor in the once rich fishing village called \"Cabadasan\" posing as fisherman."
        ],
        [
            "By befriending the villagers and at the same time working on the growing discontent among the people against the tyrannical rule of Capitan CARLOS MACAPUGAY who was then Bat's town executive, the rebel grouped the men folk of the village to form a fierce fighting bond."
        ],
        [
            "Out of this uprising led by Catalino Catakutan, the umbilical cord through which Cabadasan ruled was detached and the town of Baras was born."
        ],
        [
            "Married to Maria Timola from Bato, Capitan Catalino Catakutan, with the burning desire for independence, did not live long to set office in the entire province.",
            "The Spaniards caught up with him while attending a wedding feast.",
            "Tortured and chained by the neck, he was paraded around the Poblacion of Bato to serve as warning to the people."
        ],
        [
            "He was hanged near the church of Bato.",
            "In his stead, Capitan Mariano Teologo was installed as Bara's first town executive on May 11, 1897.",
            "Its original barrios were Tilod, Macutal, Paniquihan and Gigmoto."
        ],
        [
            "Baras - A Town and then a Barrio"
        ],
        [
            "Baras was founded as a town on May 11, 1897, and Capitan Mariano Teologo served as its first town executive until the end of 1897.",
            "To minister to the town's spiritual needs was Pablo Zuniega, Baras' first parish priest, whose tenure ended in the middle of 1904."
        ],
        [
            "The early year of Baras as a town was a period of difficult adjustment.",
            "In 1905, Capitan Quirico Arcilla, the town's fourth executive, started the construction of a semi-permanent municipal building called \"TRIBUNAL\".",
            "A dynamic and a dominant figure in Baras politics, his centering effort in the administration of local affairs as well as his proven integrity, he enabled the town to experience a period of prosperity.",
            "In 1906, Capitan Alvaro Vergara succeeded him.",
            "In 1907 due to financial difficulties the town was reverted to a barrio status.",
            "A few days later after its reversion into a barrio of Bato, its executive appointed Reymundo Tanael as Cabeza (barrio executive).",
            "Baras existed as a barrio up to the last days of 1909."
        ],
        [
            "In a period of 3 years as a barrio, cabezas ruled it, namely: Cabeza Raymundo Tanael, Agustin Tanael, Felix Teologo, Lucas Arcilla and Catalino Guerrero.",
            "Before the end of the year 1909, civic, religious and business leaders of Baras demanded from the ruling governing power that it be re-created back into a municipality."
        ],
        [
            "And, in 1910, Baras reverted into a town for the second time.",
            "Its first executive who was then called by the title of presidente municipal was Quirico Arcilla.",
            "Quirico Arcilla was succeeded by Alvaro Vergara in 1912.",
            "In 1914, appointed to steer the reign of government was Capitan Juan Pablo, a Tagalog immigrant who found a local belle for his life partner.",
            "In the election of 1915, he lost to Pedro Vergara, only to be elected again in 1918.",
            "From then, Baras moved on experiencing the test of time as a municipality.",
            "In 1927 Flaviano Camu, then constructed Camu Street connecting it to San Lorenzo Street.",
            "In 1929 the present sight of barrio Putsan was constructed."
        ],
        [
            "In May 1933, the Bato-Baras Road was opened to traffic.",
            "In 1935 the gold boom reached Baras, an American firm headed by a certain Mr. Torchand dug sitio Banog in Agban and started the gold mines in Agban, at the same time the abaca and copra industries, for which Baras had been famous, were at their peak.",
            "For some unknown reasons the firm had to close shop at the end of 1938."
        ],
        [
            "On 10 December 1941, or one year after typhoon \"Oguis\", a Japanese fleet, consisting of an aircraft carrier and a destroyer, landed at Batalay in Bato, swooped down on Barrio Guinsaanan in Baras, releasing three medium-sized bombs hitting Sayao rock off the coast of Guinsaanan, making Baras a ghost town overnight."
        ],
        [
            "After a month with no governing officials reporting to their office, the incumbent Mayor Victor Tanael returned from hiding and normalcy returned once again.",
            "Other municipal officials reported to their offices.",
            "In the early part of 1943, Mayor Tanael died of sickness and so, the Japanese occupation government appointed Mr. Dionisio Tolledo as Mayor, Atty.",
            "Severiano de Leon as Municipal Judge, Mr. Pedro Teston as Chief of Police, Mr. Reynato Magistrado and Jaime Templonuevo as Policemen.",
            "They were the only officials appointed."
        ],
        [
            "In the early morning of February 1944, the town folks were surprised by rain of bullets.",
            "Major Salvador Rodulfo aka \"PHANTOM\" of Barangay Tilod, Baras, fresh from his guerilla exploits in Albay, landed at Tilod with soldiers and started organizing independent guerilla outfit, later to be known as the Catanduanes Liberators Battalion.",
            "Baras became the sanctuary of the resistance movement in the province."
        ],
        [
            "It was his group who was responsible for the annihilation of all Japanese soldiers in the island, killing most of them and capturing the remaining that were caught alive and raising to the ground their garrisons and hideouts."
        ],
        [
            "Immediately after the liberation of the country from the Japanese warriors in 1945, President Osmeña appointed some Municipal Heads of the town."
        ],
        [
            "In 1951, the barrios of San Vicente, Gigmoto, Biong and Dororian were transferred to then newly created town of Gigmoto."
        ],
        [
            "Under the administration of Mayor Chito Chi,Baras town has just received a Certificate of Recognition for ranking number one in the collection of business taxes among the 5th income class municipalities in the entire Bicol Region that exceeded the target amount.",
            "Mayor Chito Chi was defeated by Rodel V. Abichuela, a lawyer by profession, in the elections of 2013."
        ],
        [
            "Geography"
        ],
        [
            "Baras is one of the eleven municipalities of the island province of Catanduanes.",
            "It is bordered on the north by Gigmoto, on the south by Bato, on the east by Kaladapan Bay and the Philippine Sea, and on the west by San Miguel.",
            "Baras is 24 kilometres (15 mi) from the capital town of Virac."
        ],
        [
            "Slope"
        ],
        [
            "The surface landscape within Baras is made up of varying slopes.",
            "It is dominated however by slopes ranging 18-30% (Rolling to hilly) with land area of 38.0700 square kilometers or 49.830% and 30-50% (Steep Hills and Mountains) with land area of 29.6200 square kilometers or 38.770%.",
            "comprising the last slope surfaces are slopes 0-3% (level to very gently sloping) with land area of 7.2600 square kilometers or 9.500% and 50%-Above (very steep hills and mountains)."
        ],
        [
            "Land classification"
        ],
        [
            "Based on the land classification, the Municipality of Baras is divided into Alienable and Disposable lands and Forest lands.",
            "Alienable and Disposable Lands occupy land area of about 57.600 square kilometers or 75.390%.",
            "On the other hand, Forest Lands occupy only about 18.800 square kilometers or 24.610%"
        ],
        [
            "Soil classification"
        ],
        [
            "The municipality of Baras possesses varying soil types particularly Bantog Clay, Mountain soil, Atimodian Clay, and Luciana Clay.",
            "Most dominant soil types are Luciana Clay occupying about 56.1700 square kilometers or 73.590% and mountain soil occupying about 17.2800 square kilometers or 22.620%.",
            "The least soil types are Bantog Clay with land area of only about 2.1900 square kilometers or 2.860% and Atimodian Clay with land area of only about 0.7600 square kilometers or 0.930%."
        ],
        [
            "Barangays"
        ],
        [
            "Baras is politically subdivided into 29 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Currently, there are 6 which considered urban barangays and 23 are rural barangays.",
            "Urban barangays have a total land area of only 1.0200 square kilometers or 1.332%, made up of Barangays Bagong Sirang, Buenavista, Eastern Poblacion, San Lorenzo, Quezon and Western Poblacion.",
            "On the other hand, rural barangays comprise the 96.668%, made up of Barangays Abihao, Agban, Batolinao, Benticayan, Caragumihan, Danao, Genitligan, Guinsaanan, J.M.",
            "Alberto, Macutal, Moning, Nagbarorong, Osmena, Paniquihan, P. Teston, Putsan, Sagrada, Rizal, Puraran, San Miguel, Salvacion, Santa Maria and Tilod."
        ],
        [
            "Barangays with smaller land area are Barangays Bagong Sirang, Buenavista, Eastern Poblacion, San Lorenzo, Quezon, Western Poblacion and Santa Maria.",
            "On the contrary, barangays with the largest land areas are Agban, Benticayan, Genitligan, J.M.",
            "Alberto, San Miguel and Tilod."
        ],
        [
            "Abihao"
        ],
        [
            "Agban"
        ],
        [
            "Bagong Sirang"
        ],
        [
            "Benticayan"
        ],
        [
            "Buenavista"
        ],
        [
            "Caragumihan"
        ],
        [
            "Batolinao"
        ],
        [
            "Danao"
        ],
        [
            "Sagrada"
        ],
        [
            "Ginitligan"
        ],
        [
            "Guinsaanan"
        ],
        [
            "J. M. Alberto"
        ],
        [
            "Macutal"
        ],
        [
            "Moning"
        ],
        [
            "Nagbarorong"
        ],
        [
            "Osmeña"
        ],
        [
            "P. Teston"
        ],
        [
            "Paniquihan"
        ],
        [
            "Eastern Poblacion"
        ],
        [
            "Puraran"
        ],
        [
            "Putsan"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Sagrada"
        ],
        [
            "Salvacion"
        ],
        [
            "San Lorenzo"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Maria"
        ],
        [
            "Tilod"
        ],
        [
            "Western Poblacion"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Baras"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.3(84.7)"
        ],
        [
            "29.7(85.5)"
        ],
        [
            "30.5(86.9)"
        ],
        [
            "31.5(88.7)"
        ],
        [
            "32.2(90.0)"
        ],
        [
            "32.4(90.3)"
        ],
        [
            "32.2(90.0)"
        ],
        [
            "32.2(90.0)"
        ],
        [
            "32.1(89.8)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "30.7(87.3)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "31.2(88.1)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "25.8(78.4)"
        ],
        [
            "26.3(79.3)"
        ],
        [
            "27.3(81.1)"
        ],
        [
            "28.0(82.4)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "27.8(82.0)"
        ],
        [
            "27.3(81.1)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "26.3(79.3)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.0(71.6)"
        ],
        [
            "21.9(71.4)"
        ],
        [
            "22.2(72.0)"
        ],
        [
            "23.1(73.6)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "22.9(73.2)"
        ],
        [
            "23.2(73.7)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "423(16.7)"
        ],
        [
            "356(14.0)"
        ],
        [
            "349(13.7)"
        ],
        [
            "146(5.7)"
        ],
        [
            "202(8.0)"
        ],
        [
            "224(8.8)"
        ],
        [
            "334(13.1)"
        ],
        [
            "212(8.3)"
        ],
        [
            "340(13.4)"
        ],
        [
            "708(27.9)"
        ],
        [
            "967(38.1)"
        ],
        [
            "738(29.1)"
        ],
        [
            "4,999(196.8)"
        ],
        [
            "Source: Climate-Data.org"
        ],
        [
            "Baras has a tropical rainforest climate (Af) with heavy to very heavy rainfall year-round and with extremely heavy rainfall from October to December.",
            "It is one of the wettest place in Philippines."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BarasYearPop.±% p.a.1903 2,777—    1918 6,244+5.55%1939 10,328+2.43%1948 10,275−0.06%1960 9,637−0.53%1970 9,918+0.29%1975 10,338+0.84%1980 10,273−0.13%1990 9,769−0.50%1995 11,843+3.67%2000 11,653−0.35%2007 11,787+0.16%2010 12,243+1.39%2015 12,848+0.92%2020 13,484+0.95%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Baras, Catanduanes, was 13,484 people, with a density of 120 inhabitants per square kilometre or 310 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Baras"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  48.20"
        ],
        [
            "2009  39.00"
        ],
        [
            "2012  31.95"
        ],
        [
            "2015  42.64"
        ],
        [
            "2018  25.67"
        ],
        [
            "2021  20.51"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "List of former chief executives"
        ],
        [
            "As a Town"
        ],
        [
            "Capitan Mariano Teologo ................... 1897-1898"
        ],
        [
            "Capitan Vicente Guerrero................... 1899-1900"
        ],
        [
            "Capitan Jose Patrocinio Rodulfo..........1901-1903"
        ],
        [
            "Capitan Quirico Arcilla .........................1904-1905"
        ],
        [
            "Capitan Alvaro Vergara ...................... 1906"
        ],
        [
            "As a Barrio (Reverted)"
        ],
        [
            "Cabeza Raymundo Tanael .................. January - July 1907"
        ],
        [
            "Cabeza Agustin Tanael ........................ August - December 1907"
        ],
        [
            "Cabeza Felix Teologo .......................... January - July 1908"
        ],
        [
            "Cabeza Lucas Arcilla ........................... August - December 1908"
        ],
        [
            "Cabeza Catalino Guerrero .................. January - December 1909"
        ],
        [
            "As a Town (Reverted as a Town)"
        ],
        [
            "Presidente Municipal Quirico Arcilla ........................... 1910-1911"
        ],
        [
            "Presidente Municipal Alvaro Vergara .......................... 1912-1913"
        ],
        [
            "Presidente Municipal Juan Pablo ................................ 1914-1915"
        ],
        [
            "Presidente Municipal Pedro Vergara ........................... 1916-1917"
        ],
        [
            "Presidente Municipal Juan Pablo ..................................1918-1919"
        ],
        [
            "Presidente Municipal Cristobal Guerrero ......................1920-1921"
        ],
        [
            "Presidente Municipal Pablo Tariman ............................ 1922-1923"
        ],
        [
            "Presidente Municipal Victoriano Tanael (Successor).....1923-1924"
        ],
        [
            "Presidente Municipal Martin Toledana ......................... 1924-1925"
        ],
        [
            "Presidente Municipal Antonio Tulay ............................. 1925-1926"
        ],
        [
            "Presidente Municipal Flaviano Camu ........................... 1926-1928"
        ],
        [
            "Presidente Municipal Roman Rodulfo .......................... 1928-1930"
        ],
        [
            "Presidente Municipal Martin Toledana .......................... 1930-1931"
        ],
        [
            "Presidente Municipal Honuario Dayawon ...................... 1931-1933"
        ],
        [
            "Presidente Municipal Pedro Beraquit ............................ 1934-1936"
        ],
        [
            "Municipal Mayor Ramon Templonuevo .......................... 1937-1941"
        ],
        [
            "Municipal Mayor Victor Tanael ....................................... 1941-1942"
        ],
        [
            "Municipal Mayor Dionisio Tolledo ................................... 1942-1944"
        ],
        [
            "Municipal Mayor Silvino Joson ....................................... 1945-1946"
        ],
        [
            "Municipal Mayor Placida Beraquit .................................. 1947-1948"
        ],
        [
            "Municipal Mayor Godofredo Tayam ................................ 1948-1951"
        ],
        [
            "Municipal Mayor Pedro Teston ....................................... 1952-1955"
        ],
        [
            "Municipal Mayor Alfredo Tanael ..................................... 1956-1959"
        ],
        [
            "Municipal Mayor Pedro Beraquit .................................... 1960-1963"
        ],
        [
            "Municipal Mayor Amador Teston .................................... 1964-1967"
        ],
        [
            "Municipal Mayor David Templonuevo(Successor)........... September–December, 1967"
        ],
        [
            "Municipal Mayor Temis Teves ......................................... 1968-1971"
        ],
        [
            "Municipal Mayor Serafin Sarmiento ................................ 1972-1986"
        ],
        [
            "Municipal Mayor Jesus Torrente (Officer-In-Charge)....... 1986-1987"
        ],
        [
            "Municipal Mayor Serafin Sarmiento ................................ 1988-1995"
        ],
        [
            "Municipal Mayor Jorge Tanael ........................................ 1995-1998"
        ],
        [
            "Municipal Mayor Serafin Sarmiento ................................ 1998-2001"
        ],
        [
            "Municipal Mayor Jose J. Teves, Jr. .................................. 2001-2010"
        ],
        [
            "Municipal Mayor Chito S. Chi .......................................... 2010-2013"
        ],
        [
            "Municipal Mayor Rodel V. Abichuela ..................................2013-2016"
        ],
        [
            "Municipal Mayor Chito S. Chi .......................................... 2016 – present"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Baras |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on 25 May 2021.",
            "Retrieved 16 July 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An act creating the municipality of Gigmoto in the province of Catanduanes\".",
            "LawPH.com.",
            "Retrieved 9 April 2011."
        ],
        [
            "^"
        ],
        [
            "\"Province: Catanduanes\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Climate: Baras\".",
            "Climate-Data.org.",
            "Retrieved 27 October 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Catanduanes\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved 28 December 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Baras, Catanduanes."
        ],
        [
            "Municipality of Baras"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Baras, Catanduanes"
        ],
        [
            "Gigmoto"
        ],
        [
            "San Miguel"
        ],
        [
            "Baras"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Bato"
        ],
        [
            "Philippine Sea"
        ],
        [
            "vte Province of CatanduanesVirac (capital and largest municipality)Municipalities"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Baras"
        ],
        [
            "Bato"
        ],
        [
            "Caramoran"
        ],
        [
            "Gigmoto"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "San Andres"
        ],
        [
            "San Miguel"
        ],
        [
            "Viga"
        ],
        [
            "Virac"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Baras,_Catanduanes&oldid=1188757698\""
        ],
        [
            "Category: Municipalities of CatanduanesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse dmy dates from September 2018Articles needing additional references from January 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}