{
    "name": "Batuan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Batuan, Bohol"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°48′N 124°08′E﻿ / ﻿9.8°N 124.13°E﻿ / 9.8; 124.13"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bohol, Philippines"
        ],
        [
            "Not to be confused with Butuan."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Batuan, Bohol\" – news · newspapers · books · scholar · JSTOR (September 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Visayas, PhilippinesBatuanMunicipalityMunicipality of Batuan"
        ],
        [
            "FlagSealMap of Bohol with Batuan highlightedOpenStreetMapBatuanLocation within the PhilippinesCoordinates: 9°48′N 124°08′E﻿ / ﻿9.8°N 124.13°E﻿ / 9.8; 124.13CountryPhilippinesRegionCentral VisayasProvinceBoholDistrict"
        ],
        [
            "3rd districtFounded31 October 1903Barangays15"
        ],
        [
            "  (see Barangays)Government Zeniza A. Bulalaque (acting) • Vice MayorSam Joseph L. Barril • RepresentativeKristine Alexie B. Tutor • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Sam Joseph L. BarrilMarvin P. PanchoJesus T. PalingcodJulito T. PanchoRonald T. DampogSegundo B. BautistaLuciano L. Bag-aoSixto T. Dano"
        ],
        [
            " • Electorate9,920 voters (2022)Area • Revenue₱ 76.91 million (2020) • Assets₱ 295.3 million (2020) • Expenditure₱ 82.63 million (2020) • Liabilities₱ 68.22 million (2020)Service provider • ElectricityBohol 1 Electric Cooperative (BOHECO 1)Time zoneUTC+8 (PST)ZIP code6318PSGC071207000IDD : area code +63 (0)38Native languagesBoholano dialect Cebuano Tagalog"
        ],
        [
            "Batuan, officially the Municipality of Batuan (Cebuano: Lungsod sa Batuan; Tagalog: Bayan ng Batuan),  is a 5th class municipality in the province of Bohol, Philippines.",
            "According to the 2020 census, it has a population of 13,845 people."
        ],
        [
            "Batuan is 52 kilometres (32 mi) from Tagbilaran, and is located in the interior part of the island.",
            "It is accessible via the Tagbilaran–Loay–Carmen national road or the Tagbilaran–Balilihan–Batuan provincial road.",
            "It marches with Sagbayan to the north, with Bilar to the south, with Carmen and Valencia to the east, and with Catigbian and Balilihan to the west."
        ],
        [
            "Batuan covers a total area of 7,908 hectares (19,540 acres) comprising fifteen barangays as per the Municipal Comprehensive Development Plan for 1983–1992.",
            "However, a certification of the land area of Batuan, issued by ARED for operations, DENR Regional Office Region No.",
            "7 Cebu City on 26 November 2001 at the instance of the LGU in connection with its Comprehensive Land Use Plan (CLUP) preparation work, showed a land area of only 4,878 hectares (12,050 acres), but that included only eleven barangays and excluded four—Quirino, Aloja, Behind the Clouds and Garcia."
        ],
        [
            "Located within the province's tourist area, Batuan is the gateway to the Chocolate Hills, being only about 3 kilometres (1.9 mi) from the Chocolate Hills complex in Carmen."
        ],
        [
            "Batuan celebrates its fiesta on July 25, to honor the town patron Saint James."
        ],
        [
            "History"
        ],
        [
            "This interior town used to be a barrio of Bilar during the Spanish regime and was called Lindugon.",
            "During the early years of the American regime, this barrio was made into a municipality by Act No.",
            "968 dated Oct 31, 1903 that provided the following: “The Municipality of Batuan shall consist of the territory of the barrio of Batuan in the present Municipality of Bilar, with the seat of the municipal government at the present barrio of Batuan.” (Acts of the Philippine Commission, Vol.",
            "XIV.",
            "Washington: Government Printing Office, 1904)."
        ],
        [
            "Batuan became a separate municipality through the efforts of some local leaders, such as Manuel Decasa, Alejandro Barril, Victor Tiongson, among others, who were put behind bars for strongly advocating the movement to cede Batuan from its mother town Bilar, and its subsequent creation as a distinct and separate town.",
            "Notwithstanding, those leaders pursued their aspirations after release from prison.",
            "Municipality of Batuan was created, originally comprising only five barangays namely: Lindugon, Cambacay, Rosariohan, Janlud and Cantigdas; but today comprising fifteen."
        ],
        [
            "The early years of local administration saw its seat at Lindugon, now Poblacion Vieja.",
            "In 1911 however, the Municipal Hall, the seat of local government, was transferred to sitio Tinagacan for reasons of accessibility.",
            "Eventually, the parish church was also relocated to its present site at the Poblacion."
        ],
        [
            "Batuan got its name from the edible fruit with the same name, which grew frequently in the locality.",
            "Today though these trees can hardly be found in the area."
        ],
        [
            "During the Japanese occupation, Batuan was a haven of evacuees from the other parts of Bohol as well as from the provinces of Cebu and Leyte.",
            "It was at the Batuan Central School site where the unification of the guerilla forces of Bohol was forged on 29 June 1942, paving the way for the creation of the Bohol Area Command (BAC) under the command of Major Ismael Ingeniero, whose election was hotly contested by rival factions.",
            "The command had its headquarters in Brgy Behind the Clouds.",
            "Major Ingeniero and his force played a pivotal role in the Battle of the Visayas and liberation of Bohol."
        ],
        [
            "Geography"
        ],
        [
            "Climate"
        ],
        [
            "Like most of the municipalities of the province, the climate in Batuan falls within Coronas climate type IV, characterized by not very pronounced maximum rainfall with a short dry season from one to three months and a wet season of nine to ten months.",
            "The dry season starts in February and lasts up to April sometimes extending to the middle of May.",
            "The heaviest rainfalls are from June to August.",
            "It is usually cold during the night in the area.",
            "Batuan is generally out of the typhoon belt area and very seldom experiences typhoons."
        ],
        [
            "Hydrogeology"
        ],
        [
            "The entire area of Batuan is covered by two sedimentary rock formations: Maribojoc Limestone, occupying 78.74 km2 (30.40 sq mi), 99.6% of its total land area, and Carmen formation, occupying 0.34 km2 (0.13 sq mi), 0.4%."
        ],
        [
            "Dominant slope of the area is 30 – 50% covering an estimated area of 29 km2 (11.2 sq mi), 37.1% of its total land area, with 21 km2 (8.1 sq mi), 26.9% in the 0 - 3% category (more or less level)."
        ],
        [
            "Batuan is entirely within the Loboc River Basin.",
            "Two tributaries of Loboc river – the Pagbathan and the Bayog – flow east–west into the main river course."
        ],
        [
            "Agriculture"
        ],
        [
            "Basically, Batuan is an agricultural town as more than half of its total land area is devoted to agriculture, about 4,952 ha (12,240 acres) or 63%.",
            "This is the main source of livelihood in the locality where a great portion of its income is derived from crop production, livestock and poultry raising.",
            "Rice and corn are the principal crops grown in the area.",
            "Coconut, fruits root crops and leafy vegetables come next.",
            "Despite the absence of effective irrigation facilities, 1,794 ha (4,430 acres) (36.2% of agricultural land) are devoted to rice production, with an average production of 60 cavans per hectare.",
            "1,313 ha (3,240 acres) (26.5%) are devoted to corn production.",
            "Coffee and cacao are among the industrial crops grown in the locality.",
            "Just launched by the LGU is the Fish Culture Farming program designed to encourage smallholders to develop small backyard fishponds to address the scarce supply and high costs of fish in the area."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Batuan, Bohol"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "102(4.0)"
        ],
        [
            "85(3.3)"
        ],
        [
            "91(3.6)"
        ],
        [
            "75(3.0)"
        ],
        [
            "110(4.3)"
        ],
        [
            "141(5.6)"
        ],
        [
            "121(4.8)"
        ],
        [
            "107(4.2)"
        ],
        [
            "111(4.4)"
        ],
        [
            "144(5.7)"
        ],
        [
            "169(6.7)"
        ],
        [
            "139(5.5)"
        ],
        [
            "1,395(55.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.6"
        ],
        [
            "14.8"
        ],
        [
            "16.5"
        ],
        [
            "16.7"
        ],
        [
            "23.9"
        ],
        [
            "26.4"
        ],
        [
            "25.6"
        ],
        [
            "24.1"
        ],
        [
            "24.4"
        ],
        [
            "26.3"
        ],
        [
            "23.7"
        ],
        [
            "20.5"
        ],
        [
            "261.5"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Batuan is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " Area"
        ],
        [
            " PD 2020"
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " ha"
        ],
        [
            " acre"
        ],
        [
            " /km2"
        ],
        [
            " /sq mi"
        ],
        [
            " 071207001   Aloja"
        ],
        [
            " 3.1%"
        ],
        [
            " 424"
        ],
        [
            " 437"
        ],
        [
            "  ▾"
        ],
        [
            " −0.30%"
        ],
        [
            " 385951"
        ],
        [
            " 110"
        ],
        [
            " 290"
        ],
        [
            " 071207016  Behind the Clouds (San Jose)"
        ],
        [
            " 1.7%"
        ],
        [
            " 234"
        ],
        [
            " 256"
        ],
        [
            "  ▾"
        ],
        [
            " −0.89%"
        ],
        [
            " 9752,409"
        ],
        [
            " 24"
        ],
        [
            " 62"
        ],
        [
            " 071207002   Cabacnitan"
        ],
        [
            " 5.1%"
        ],
        [
            " 701"
        ],
        [
            " 596"
        ],
        [
            "  ▴"
        ],
        [
            " 1.64%"
        ],
        [
            " 6371,574"
        ],
        [
            " 110"
        ],
        [
            " 290"
        ],
        [
            " 071207003   Cambacay"
        ],
        [
            " 4.9%"
        ],
        [
            " 673"
        ],
        [
            " 585"
        ],
        [
            "  ▴"
        ],
        [
            " 1.41%"
        ],
        [
            " 4791,184"
        ],
        [
            " 140"
        ],
        [
            " 360"
        ],
        [
            " 071207004   Cantigdas"
        ],
        [
            " 5.7%"
        ],
        [
            " 786"
        ],
        [
            " 735"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 380939"
        ],
        [
            " 210"
        ],
        [
            " 540"
        ],
        [
            " 071207005   Garcia"
        ],
        [
            " 3.4%"
        ],
        [
            " 476"
        ],
        [
            " 546"
        ],
        [
            "  ▾"
        ],
        [
            " −1.36%"
        ],
        [
            " 5801,433"
        ],
        [
            " 82"
        ],
        [
            " 210"
        ],
        [
            " 071207006   Janlud"
        ],
        [
            " 5.6%"
        ],
        [
            " 780"
        ],
        [
            " 703"
        ],
        [
            "  ▴"
        ],
        [
            " 1.04%"
        ],
        [
            " 5891,455"
        ],
        [
            " 130"
        ],
        [
            " 340"
        ],
        [
            " 071207008   Poblacion Norte"
        ],
        [
            " 14.4%"
        ],
        [
            " 1,988"
        ],
        [
            " 1,889"
        ],
        [
            "  ▴"
        ],
        [
            " 0.51%"
        ],
        [
            " 355877"
        ],
        [
            " 560"
        ],
        [
            " 1,500"
        ],
        [
            " 071207009   Poblacion Sur"
        ],
        [
            " 9.5%"
        ],
        [
            " 1,313"
        ],
        [
            " 1,353"
        ],
        [
            "  ▾"
        ],
        [
            " −0.30%"
        ],
        [
            " 5611,386"
        ],
        [
            " 230"
        ],
        [
            " 610"
        ],
        [
            " 071207010   Poblacion Vieja (Lungsodaan)"
        ],
        [
            " 6.5%"
        ],
        [
            " 899"
        ],
        [
            " 894"
        ],
        [
            "  ▴"
        ],
        [
            " 0.06%"
        ],
        [
            " 4281,058"
        ],
        [
            " 210"
        ],
        [
            " 540"
        ],
        [
            " 071207011   Quezon"
        ],
        [
            " 4.4%"
        ],
        [
            " 609"
        ],
        [
            " 603"
        ],
        [
            "  ▴"
        ],
        [
            " 0.10%"
        ],
        [
            " 398983"
        ],
        [
            " 150"
        ],
        [
            " 400"
        ],
        [
            " 071207012   Quirino"
        ],
        [
            " 3.5%"
        ],
        [
            " 480"
        ],
        [
            " 447"
        ],
        [
            "  ▴"
        ],
        [
            " 0.71%"
        ],
        [
            " 340840"
        ],
        [
            " 140"
        ],
        [
            " 370"
        ],
        [
            " 071207013   Rizal"
        ],
        [
            " 9.4%"
        ],
        [
            " 1,295"
        ],
        [
            " 1,277"
        ],
        [
            "  ▴"
        ],
        [
            " 0.14%"
        ],
        [
            " 5581,379"
        ],
        [
            " 230"
        ],
        [
            " 600"
        ],
        [
            " 071207014   Rosariohan"
        ],
        [
            " 6.7%"
        ],
        [
            " 929"
        ],
        [
            " 939"
        ],
        [
            "  ▾"
        ],
        [
            " −0.11%"
        ],
        [
            " 6991,727"
        ],
        [
            " 130"
        ],
        [
            " 340"
        ],
        [
            " 071207017   Santa Cruz"
        ],
        [
            " 8.5%"
        ],
        [
            " 1,180"
        ],
        [
            " 1,171"
        ],
        [
            "  ▴"
        ],
        [
            " 0.08%"
        ],
        [
            " 5441,344"
        ],
        [
            " 220"
        ],
        [
            " 560"
        ],
        [
            "Total"
        ],
        [
            "13,845"
        ],
        [
            "12,431"
        ],
        [
            " ▴"
        ],
        [
            "1.08%"
        ],
        [
            "7,908"
        ],
        [
            "19,541"
        ],
        [
            "180"
        ],
        [
            "450"
        ],
        [
            "Demographics"
        ],
        [
            "Main street"
        ],
        [
            "Population census of BatuanYearPop.±% p.a.1903 1,817—    1918 3,610+4.68%1939 5,982+2.43%1948 7,503+2.55%1960 7,758+0.28%1970 8,712+1.17%1975 9,940+2.68%1980 9,833−0.22%1990 11,438+1.52%1995 11,898+0.74%2000 11,835−0.11%2007 12,137+0.35%2010 12,431+0.87%2015 12,767+0.51%2020 13,845+1.61%Source: Philippine Statistics Authority"
        ],
        [
            "Batuan's working age or economically active population age 15–64, comprises 58% of its total population, while its dependent population, aged 0–14 and 65 years and above, comprises 42%."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Batuan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "80"
        ],
        [
            "2006  75.30"
        ],
        [
            "2009  46.82"
        ],
        [
            "2012  32.29"
        ],
        [
            "2015  24.07"
        ],
        [
            "2018  23.30"
        ],
        [
            "2021  30.52"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Transport"
        ],
        [
            "Batuan has a total road network of about 92.1 kilometres (57.2 mi) of which 65.5 kilometres (40.7 mi) are barangay roads, 15.8 kilometres (9.8 mi) are provincial roads, 3.2 kilometres (2.0 mi) national and 10.8 kilometres (6.7 mi) municipal roads.",
            "While the entire national road network is of either concrete or asphalt surface, only about 2.3 kilometres (1.4 mi) (21%) of its municipal roads, and about 2.5 kilometres (1.6 mi) (4%) of its barangay roads are concrete with the larger portion still earth and / or gravel.",
            "98% of its provincial roads are gravel.",
            "Bus companies present in Batuan such as Southern Star Bus Transit, Clynn Trans, Chatto Trans, and other companies, provide the town mass transportation within its boundaries and to other towns and city.",
            "Two major routes are present in Batuan, namely: Loay Interior Road and Balilihan-Hanopol-Batuan Road, which connects Batuan to adjacent towns and the provincial capital Tagbilaran."
        ],
        [
            "Trade, commerce and industry"
        ],
        [
            "Commercial and trading transactions in Batuan gravitate to the urban area, considered the town's Central Business District.",
            "However, commercial and trading activities in the area are brisk.",
            "Commercial activities in Batuan pass through a network of various commercial establishments.",
            "Sari-sari stores are the most common.",
            "Other are bakeries, eateries, drugstores, farm and poultry stores, and hardware stores.",
            "Service provider in the area include iron works, welding shops, repair shops, furniture factories & communication facilities.",
            "Among the ubiquitous industries of Batuan are the rice and corn mills located mainly in the Poblacion areas.",
            "Other than those, industrial activities are minimal."
        ],
        [
            "Although Batuan is only about 3 km (1.9 mi) from the Chocolate Hills complex, tourism activities in the municipality are very few.",
            "There are no facilities and establishments that cater to the needs and wants of the industry.",
            "Batuan also has the Camanayon Mountain."
        ],
        [
            "Government"
        ],
        [
            "Welfare"
        ],
        [
            "All barangays have their day care centers where services are provided by daycare workers on a regular basis, a program financially supported by the LGU aside from other programs like supplemental feeding, emergency assistance, and burial assistance."
        ],
        [
            "The Municipal Health Office (MHO) is staffed by one doctor, five midwives, a nurse, a medical (laboratory) technologist, a sanitary inspector, and a dentist who reports only twice a week due to budget constraints.",
            "A team of Barangay Health Workers has been organized in all barangays to help facilitate and speed up the delivery of basic health services even in the remote areas.",
            "There are only three Barangay Health stations in the whole area.",
            "An ambulance is on stand-by for emergency uses."
        ],
        [
            "Protective services"
        ],
        [
            "For the maintenance of peace and order in the area, the LGU has a local PNP station headed by a police chief with ten (10) junior PNP personnel, equipped with some high-powered firearms and two patrol cars.",
            "The local PNP force is assisted in this regard by tanod members of each composite barangay as far as law and order are concerned at barangay level.",
            "The LGU however has neither existing or available personnel nor equipment for fire protection purposes."
        ],
        [
            "Education"
        ],
        [
            "There are eighteen learning institutions in Batuan of which nine are primary schools, six elementary schools, four public and two private high schools, providing secondary education.",
            "Batuan Colleges Inc., a privately owned college school offering technical and short courses in a close tie-up with TESDA, has been in operation since mid‑2000s."
        ],
        [
            "Notes"
        ],
        [
            "^ Cavan is a fairly imprecise, variable measure.",
            "It means \"sack\" or \"box\" in Visayan dialects, and was originally a measure of volume not weight.",
            "For rice nowadays though it is about 50 ± 5 kilograms (110 ± 11 lb), so 60 cavans per hectare is about 3,000 ± 300 kg/ha (2,680 ± 270 lb/acre), giving a total annual yield around 5,380 metric tons (5,300 long tons)."
        ],
        [
            "References"
        ],
        [
            "^ \"Bohol governor, 68 others suspended over Chocolate Hills resort mess\".",
            "Philippine Daily Inquirer.",
            "28 May 2024.",
            "Retrieved 28 May 2024."
        ],
        [
            "^  Municipality of Batuan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Bohol Festivals Timetable\".",
            "www.bohol-philippines.com.",
            "Retrieved 2019-03-08."
        ],
        [
            "^ Coronas 1920."
        ],
        [
            "^ Faustino et al.",
            "2003."
        ],
        [
            "^"
        ],
        [
            "\"Balilihan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 May 2020."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bohol\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "Sources"
        ],
        [
            "Coronas, José (1920).",
            "The Climate and Weather of the Philippines, 1903 – 1918.",
            "Manila Observatory: Bureau of Philippines."
        ],
        [
            "Faustino, D. V.; Yumul, G. P. Jr.; de Jesus, J. V.; Dimalanta, C. B.; Aitchison, J. C.; Zhou, M-F.; Tamayo Jr, R. A.",
            "& de Leon, M. M. (2003).",
            "\"Geology of southeast Bohol, central Philippines: accretion and sedimentation in a marginal basin\" (online text).",
            "Australian Journal of Earth Sciences.",
            "50 (4): 571–583.",
            "doi:10.1046/j.1440-0952.2003.01015.x.",
            "S2CID 129924054.",
            "Retrieved 22 October 2014."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Batuan, Bohol."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Municipality of Batuan"
        ],
        [
            "Batuan"
        ],
        [
            "Places adjacent to Batuan, Bohol"
        ],
        [
            "Sagbayan"
        ],
        [
            "CatigbianBalilihan"
        ],
        [
            "Batuan"
        ],
        [
            "Carmen"
        ],
        [
            "Bilar"
        ],
        [
            "vte Province of BoholTagbilaran (capital and largest city)Municipalities"
        ],
        [
            "Alburquerque"
        ],
        [
            "Alicia"
        ],
        [
            "Anda"
        ],
        [
            "Antequera"
        ],
        [
            "Baclayon"
        ],
        [
            "Balilihan"
        ],
        [
            "Batuan"
        ],
        [
            "Bien Unido"
        ],
        [
            "Bilar"
        ],
        [
            "Buenavista"
        ],
        [
            "Calape"
        ],
        [
            "Candijay"
        ],
        [
            "Carmen"
        ],
        [
            "Catigbian"
        ],
        [
            "Clarin"
        ],
        [
            "Corella"
        ],
        [
            "Cortes"
        ],
        [
            "Dagohoy"
        ],
        [
            "Danao"
        ],
        [
            "Dauis"
        ],
        [
            "Dimiao"
        ],
        [
            "Duero"
        ],
        [
            "Garcia Hernandez"
        ],
        [
            "Getafe"
        ],
        [
            "Guindulman"
        ],
        [
            "Inabanga"
        ],
        [
            "Jagna"
        ],
        [
            "Lila"
        ],
        [
            "Loay"
        ],
        [
            "Loboc"
        ],
        [
            "Loon"
        ],
        [
            "Mabini"
        ],
        [
            "Maribojoc"
        ],
        [
            "Panglao"
        ],
        [
            "Pilar"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Sagbayan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Sevilla"
        ],
        [
            "Sierra Bullones"
        ],
        [
            "Sikatuna"
        ],
        [
            "Talibon"
        ],
        [
            "Trinidad"
        ],
        [
            "Tubigon"
        ],
        [
            "Ubay"
        ],
        [
            "Valencia"
        ],
        [
            "Component city"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Islands"
        ],
        [
            "Balicasag"
        ],
        [
            "Banacon"
        ],
        [
            "Bansaan"
        ],
        [
            "Bilangbilangan"
        ],
        [
            "Bohol"
        ],
        [
            "Cabilao"
        ],
        [
            "Cabulan"
        ],
        [
            "Hingotanan"
        ],
        [
            "Jandayan"
        ],
        [
            "Jao"
        ],
        [
            "Juagdan"
        ],
        [
            "Lapinig"
        ],
        [
            "Mahanay"
        ],
        [
            "Malingin"
        ],
        [
            "Mantatao"
        ],
        [
            "Maomawan"
        ],
        [
            "Pamilacan"
        ],
        [
            "Pangangan"
        ],
        [
            "Panglao"
        ],
        [
            "Sagasa"
        ],
        [
            "Sandingan"
        ],
        [
            "Tintinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Batuan,_Bohol&oldid=1226096511\""
        ],
        [
            "Category: Municipalities of BoholHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2012All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}