{
    "name": "Baungon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Baungon"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°18′46″N 124°41′14″E﻿ / ﻿8.312794°N 124.687325°E﻿ / 8.312794; 124.687325"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesBaungonMunicipalityMunicipality of Baungon"
        ],
        [
            "FlagSealMap of Bukidnon with Baungon highlightedOpenStreetMapBaungonLocation within the PhilippinesCoordinates: 8°18′46″N 124°41′14″E﻿ / ﻿8.312794°N 124.687325°E﻿ / 8.312794; 124.687325CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "1st districtBarangays16"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRogelio D. Jaraula • Vice MayorFelipe W. Ragudo • RepresentativeJose Manuel F. Alba • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jing J. BaigadJoseph O. BajuyoGoldie Mae Q. RavidasPaolo BejaArdan J. RoaJesus B. BasKoko PalananJulie Cual"
        ],
        [
            " • Electorate27,546 voters (2022)Area • Revenue₱ 177.8 million (2020) • Assets₱ 474.6 million (2020) • Expenditure₱ 132.5 million (2020) • Liabilities₱ 121.2 million (2020)Service provider • ElectricityBukidnon 2 Electric Cooperative (BUSECO)Time zoneUTC+8 (PST)ZIP code8707PSGC101301000IDD : area code +63 (0)88Native languagesBinukid Cebuano Ata Manobo TagalogWebsitewww.baungonbuk.gov.ph"
        ],
        [
            "Baungon, officially the Municipality of Baungon (Bukid and Higaonon: Banuwa ta Baungon; Cebuano: Lungsod sa Baungon; Tagalog: Bayan ng Baungon), is a 2nd class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 37,111 people."
        ],
        [
            "History"
        ],
        [
            "Baungon was converted from a municipal district to a municipality through Executive Order No.",
            "272 signed by President Carlos P. Garcia on October 4, 1957; the conversion took effect on July 1, 1956."
        ],
        [
            "Tribal History"
        ],
        [
            "1757 - Apo Mandapagun arrived from Lambaguhon, Kagayha-an (Cagayan de Oro City today) and resided in Buenavista.",
            "Apo Mandapagun's brothers and sisters came along with him, they were: Inay Quirenaw, Apo Man-utok, Apo Malughod and Inay Linda Dialangan."
        ],
        [
            "Apo Mandapagun is the father of Apo Dapagun.",
            "Apo Dapagun is the father of Apo Matulis.",
            "Apo Matulis' children are:"
        ],
        [
            "Apo Tolis"
        ],
        [
            "Apo Amay Tomas Lilangan"
        ],
        [
            "Apo Mandintuhan"
        ],
        [
            "Apo Ilumon"
        ],
        [
            "Inay Botis"
        ],
        [
            "Inay Miayana"
        ],
        [
            "Inay Musal"
        ],
        [
            "Apo Sungkayaw"
        ],
        [
            "Inay Laum"
        ],
        [
            "Apo Mateo Hukmayan"
        ],
        [
            "1902 - Old Imbatug was founded."
        ],
        [
            "1918 - an epidemic swept many lives in Old Imbatug"
        ],
        [
            "Due to this epidemic, the residents decided to cross back Cagayan river, some hid in the mountains.",
            "Those who decided to stay chose Apo Manlibanda as their leader.",
            "He called a meeting and proposed that they leave old Imbatug and transfer to Brgy.",
            "Imbatug which eventually became the Poblacion."
        ],
        [
            "On their way to Brgy.",
            "Imbatug, they stopped at a stream \"Pandaug\" (Pandahug today) and performed Panlitub - a ritual to drive away the evil spirits symbolizing the epidemic.",
            "\"Daug\" is Victory thus, Pandaug is named to commemorate their victory over the sickness.",
            "The land adjacent to the river they named \"Mando\".",
            "\"Mando\" is “TO COMMAND\" from the Latin word, \"Mandatum\".",
            "This symbolized their command over the evil spirits to leave them in peace."
        ],
        [
            "In those days, there were two Mando: Upper and Lower.",
            "Mansumina Lilo lived in lower Mando, the part across the mando river near the cemetery now.",
            "Upper Mando was the place under the direction of Apo Simbo.",
            "The chapel standing now in Mando was constructed by Apo Simbo."
        ],
        [
            "May 6, 1920 - New Poblacion, Imbatug at present is founded"
        ],
        [
            "Apo Amay Tomas Lilangan became the first Datu that ruled the New Poblacion.",
            "His offspring are:"
        ],
        [
            "Rosita Lilangan Malinawon (Inay Damit)"
        ],
        [
            "Maria Lilangan (Inay Bawi was married first to Amay Malaque of Talakag, but Apo Amay Tomas was not happy with the marriage “GI-BAWI SIYA” thus, she came to be known as Inay Bawi.",
            "The second husband of Inay Bawi was Marcos Layawan.)"
        ],
        [
            "Cipriano Lilangan (Apo Simbo)"
        ],
        [
            "Juliana Lilangan Oblad (Inay Ombad)"
        ],
        [
            "1940's the Jesuits came to do Missionary work in Baungon.",
            "Apo Simbo (CIPRIANO I) built a Chapel in Mando.",
            "It was said that in a dream, Apo Simbo saw an old woman emerged out of the river (Mando).",
            "This old woman identified herself as Fatima instructed Apo Simbo to construct a Chapel and to prepare his family to receive baptism from the Catholic missionaries that would come.",
            "The next day, the missionaries arrived and Apo Simbo had his children baptized to Christian faith."
        ],
        [
            "Many members of the tribe converted to Christianity.",
            "Soon, the Jesuit missionaries would start a Parish in Baungon.",
            "Since he had three wives, the Jesuits advised him to select only one in conformity with the Christian tradition of monogamy.",
            "He chose the second, Inay Apay Laque.",
            "Inay Apay had four children from Apo Simbo.",
            "These are:"
        ],
        [
            "Rufino Laque Lilangan who married Natividad Pabillaran"
        ],
        [
            "Felomina Laque Lilangan married Timoteo Bacarro"
        ],
        [
            "Leonora (Odeng) Laque Lilangan married Castor Cadete"
        ],
        [
            "Petronila Laque Lilangan married Alfonso Jaranilla"
        ],
        [
            "Rufino Laque Lilangan and Natividad Pabillaran children are:"
        ],
        [
            "Norma Pabillaran Lilangan"
        ],
        [
            "Dulcenia Pabillaran Lilangan married Olympio Rapirap"
        ],
        [
            "Agustin Pabillaran Lilangan married Belen Cabenta and upon the Death of the first wife married Charito Tenestrante"
        ],
        [
            "Roqueza Pabillaran Lilangan married Julius Sumile, Sr."
        ],
        [
            "Mercy Pabillaran Lilangan married Cocoy Rapirap"
        ],
        [
            "Clotilda Pabillaran Lilangan married Eleuterio Mesiona"
        ],
        [
            "Emerita Pabillaran Lilangan"
        ],
        [
            "Felomina Laque Lilangan and Timoteo Bacarro children are:"
        ],
        [
            "Evina who married Apolinario Bacarro"
        ],
        [
            "Irving Lilangan Bacarro married Victoria Balinas"
        ],
        [
            "Vilma Lilangan Bacarro who married Nemesio Sinayran"
        ],
        [
            "Nyoyen Lilangan Bacarro married Navarro"
        ],
        [
            "Arceli Lilangan Bacarro"
        ],
        [
            "Henedina Lilangan Bacarro married Rudolfo Amoguis"
        ],
        [
            "Phoebe Lilangan Bacarro married Rolly Libanta"
        ],
        [
            "Concepcion Lilangan Bacarro married Juny Buna"
        ],
        [
            "Glory Lilangan Bacarro who married Embate"
        ],
        [
            "Godie Lilangan Bacarro"
        ],
        [
            "The twin Reymar and Ramir"
        ],
        [
            "Mardy Lilangan Bacarro who married Erwel Asuncion"
        ],
        [
            "Leonora (Odeng) Laque Lilangan and Castor Cadete Sr. children are:"
        ],
        [
            "Pedro (Boy) Lilangan Cadete married to Linda Pastolero"
        ],
        [
            "Manuel (Nonoy) Lilangan Cadete married Elena Magbanua"
        ],
        [
            "Violeta (Tita) Lilangan Cadete married Roger Saludades"
        ],
        [
            "Ma.",
            "Fe (Chari) Lilangan Cadete married Johnny Juanito"
        ],
        [
            "Mansueto (Botoy) Lilangan Cadete"
        ],
        [
            "Castor Lilangan Cadete Jr. married Jing Garcia"
        ],
        [
            "Mary Cheryl (Pinky) Lilangan Cadete married to Andy Alday"
        ],
        [
            "Petronila Laque Lilangan and Alfonso Jaranilla children are:"
        ],
        [
            "Wildon Lilangan Jaranilla married Girlie Gamay"
        ],
        [
            "Leticia Lilangan Jaranilla married Villanueva"
        ],
        [
            "Teresita Lilangan Jaranilla married Anecito Capin"
        ],
        [
            "Rosemarie Lilangan Jaranilla married Raul Molinas"
        ],
        [
            "Adjutor Lilangan Jaranilla married Myrna Aranggo"
        ],
        [
            "Jimmy Lilangan Jaranilla married Minda"
        ],
        [
            "Milagros Lilangan Jaranilla married Dante Mabaylan"
        ],
        [
            "Joseph Lilangan Jaranilla"
        ],
        [
            "Rafael Lilangan Jaranilla married Merlene Dacan"
        ],
        [
            "Michael Lilangan Jaranilla"
        ],
        [
            "Roger Lilangan Jaranilla"
        ],
        [
            "Andrew Lilangan Jaranilla"
        ],
        [
            "Lucia Lilangan Jaranilla"
        ],
        [
            "(Important Note: Apo Simbo also adopted the son of his sister Inay Bawi.",
            "Adopted was his niece, Patricio Layawan, which later on kept the maiden name of his mother, thus he became known as Patricio Lilangan.)"
        ],
        [
            "Patricio Lilangan married Esperanza Nagac.",
            "Their children are:"
        ],
        [
            "Erma Nagac Lilangan married Hermetanio Lunaan"
        ],
        [
            "Erwina Nagac Lilangan married Watson"
        ],
        [
            "Ray Lilangan married Teresita Son"
        ],
        [
            "Paz Nagac Lilangan married Felicisimo Lozano Rosaciña"
        ],
        [
            "Alta Rita Nagac Lilangan married Rodolfo Lido Waban, Sr"
        ],
        [
            "Gemma Nagac Lilangan married Robert Corbin"
        ],
        [
            "Perla Nagac Lilangan married Apolinar Mangcawan Rara"
        ],
        [
            "Necthom Nagac Lilangan married Profetieza Tulop"
        ],
        [
            "Cipriano Nagac Lilangan II married Estelita Ypil Batulan Lilangan"
        ],
        [
            "Teresita Nagac Lilangan married Rogelio Sabio Lago"
        ],
        [
            "The inter-marriage from the tribe of Talakag can be presented this way:"
        ],
        [
            "Amay Kalinaw, a prominent family of Talakag was the father of Amay Lantungan, Amay Malaque (who became the first husband of Inay Bawi), and the third, Amay Salicobay."
        ],
        [
            "Amay Malaque and Inay Bawi had a son with the name of Juanito Laque.",
            "Juanito was the father of Remedios Laque who later on married Meling Catubo."
        ],
        [
            "The second husband of Inay Bawi was Marcos Layawan.",
            "Marcos Layawan had a first wife with 2 children:"
        ],
        [
            "Eusebio Layawan"
        ],
        [
            "A sister who married Caler"
        ],
        [
            "Marcos Layawan and Inay Bawi had two offspring:"
        ],
        [
            "Patricio Layawan (later on Lilangan).",
            "Patricio was adopted by Apo Simbo."
        ],
        [
            "Bernabe Layawan."
        ],
        [
            "On the other hand, Amay Salicobay married Carmen Bisang and they bore a son with the name Simeon Salicobay.",
            "Simeon married Martina Man-inotao and their children are:"
        ],
        [
            "Violeta Iway"
        ],
        [
            "Felomina Pacana"
        ],
        [
            "Anastacia Salicobay"
        ],
        [
            "Sonny Boy Salicobay"
        ],
        [
            "Derivatives of Imbatug (Town Proper)"
        ],
        [
            "Imba - Why"
        ],
        [
            "Tuga - Gifted, Given"
        ],
        [
            "Tugà - to flow in steady stream"
        ],
        [
            "Imbatug - Why are we gifted with flowing stream?"
        ],
        [
            "We are gifted with a gift of Faith"
        ],
        [
            "COMMUNING WITH THE SPIRITS"
        ],
        [
            "Even before Christianity arrived in Baungon, the elders already commune with the Spirit World.",
            "When sickness visited them, they would consult the spirits of the earth, the air, the balete tree, the forests, the river and all elements that have to do with nature.",
            "For example, Mansumina Lilo and Apo Simbo are called when children of the tribe suffer from ailments.",
            "They would consult their spear (bangkaw) and let it identify the spirits hurt by the child who is ill.",
            "They called this process “Bala-on” (Stopping the spirits from doing further damage).",
            "This is done by stretching both arms between the spear.",
            "It is said that if they identify the spirit who is giving suffering to the child, the spear can be arm stretched from tip to tip.",
            "If the fingers will not reach the two tips of the spear then the spirits are not yet identified.",
            "When the spirits are identified, for instance, the spirit of balete tree allows itself be identified as the cause of ailment, only then will they look for herbal medicines appropriate for those hounded by the spirits and cure will come to the ailing child."
        ],
        [
            "ANIMISM THE OLD WAY OF HIGAONONS"
        ],
        [
            "Animism ruled the land before the coming of the Christian Missionaries.",
            "Strange to say but they ascribe everything that is going on around them to the spirits that surround the people.",
            "When a child drowns, they say he/she was pulled by the spirits of the water.",
            "Spirits lurks in places not visited often by people.",
            "In fact, they say these spirits did not want to be disturbed that’s why they inflict misery to those who will disturb them."
        ],
        [
            "CHRISTIANIZATION BY THE JESUITS"
        ],
        [
            "The first missionaries to arrive in Baungon were the Jesuits (Society of Jesus).",
            "They helped a lot in the formation of the different Barrios and Barangays.",
            "They would travel to these Barrios riding on the back of horses and by these means converted the locals to Christianity.",
            "Much has been done by the Jesuits for it was through their efforts that the formation of barrios and the Christianization of Baungon came about.",
            "They should be mentioned with the history of Baungon.",
            "The Jesuits who had been assigned to the parish were:"
        ],
        [
            "1958-1966 Fr Gregory Horgan"
        ],
        [
            "1966-67 Fr Thomas Connolly"
        ],
        [
            "1967-74 Fr Eduard Van Groenendael"
        ],
        [
            "1974-75 Fr Jose Dacanay"
        ],
        [
            "1975-77 Fr Teodoro Urrutia"
        ],
        [
            "1977-1980 Fr Joseph Bittner"
        ],
        [
            "1980-85 Fr Romeo Serrato"
        ],
        [
            "1985-86 Fr Buddy Wee"
        ],
        [
            "But we need to take note that before the parish was even founded, the parish of Talakag helped in the missions.",
            "Frs.",
            "Neri, Dulalas, Martinez and Cebrero were invited to help in the sacramental work of Imbatug.",
            "Imbatug was declared a Parish on May 15, 1959.After the Jesuits, six filipino secular priests served the parish namely:"
        ],
        [
            "1986-89 Fr Gonzalo Pimentel"
        ],
        [
            "1989-92 Fr Danilo Paciente"
        ],
        [
            "1992-95 Fr Rudy Porras"
        ],
        [
            "1995-2000 Fr Flordelito Nazareno"
        ],
        [
            "2000-2001 Fr Cosme Almedilla"
        ],
        [
            "2001-2007 Fr Diomedes Brigoli"
        ],
        [
            "2007- Fr Efren Estaniel"
        ],
        [
            "2010 - Fr Charlo Maglunsod"
        ],
        [
            "2014 - Fr Joel Tuquib"
        ],
        [
            "2017 - Fr Neil Joy Molion"
        ],
        [
            "2022 - Fr Richard Carreon"
        ],
        [
            "From among the local residents, we have produced 3 women religious: Srs.",
            "Wilma Olango, MCJ; Ruth Linaac, RVM; Adie Vallecera, RVM and another three religious missionaries among the men; they are: Fr.",
            "Sirenio Jaranilla, O.Carm; Fr.",
            "Ransom Rapirap, OCD; and Fr.",
            "Ritche Catubo of the Military Diocese."
        ],
        [
            "(Historical Notes by Fr.",
            "Sirenio Jaranilla.",
            "Additional Historical Account by Datu Pantao  and Sonny Boy Salicobay.)"
        ],
        [
            "(Nota Bene: This historical narrative is focused on CIPRIANO LILANGAN I family tree being the FOUNDER of Imbatug and the Father of the First Mayor of Imbatug, Baungon, Bukidnon,PATRICIO L. LILANGAN)"
        ],
        [
            "——-+++——-"
        ],
        [
            "Geography"
        ],
        [
            "Baungon is located in the northern part of Bukidnon, about 132 kilometres (82 mi) north of Malaybalay City via Cagayan de Oro, which is about 30 kilometres (19 mi) from Imbatug, the town's poblacion.",
            "It is bounded on the north-east by the Libona, at the south by the Lantapan, and on the west by Talakag.",
            "It has a land area of 328.34 square kilometres based on the cadastral survey made by the DENR."
        ],
        [
            "Climate"
        ],
        [
            "Typical of the province environmental condition, Baungon belongs to the third type of climate which is relatively dry from March to April and wet from May to December.",
            "In 1997, the heaviest rainfall was recorded in January with 497.8 millimetres (19.60 in).",
            "April has the lowest amount of rainfall with 24.3 millimetres (0.96 in).",
            "The average temperature is 25 °C (77 °F) and the average humidity is 82.2%."
        ],
        [
            "Climate data for Baungon, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "271(10.7)"
        ],
        [
            "217(8.5)"
        ],
        [
            "193(7.6)"
        ],
        [
            "178(7.0)"
        ],
        [
            "344(13.5)"
        ],
        [
            "423(16.7)"
        ],
        [
            "362(14.3)"
        ],
        [
            "358(14.1)"
        ],
        [
            "329(13.0)"
        ],
        [
            "320(12.6)"
        ],
        [
            "322(12.7)"
        ],
        [
            "260(10.2)"
        ],
        [
            "3,577(140.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "23.2"
        ],
        [
            "19.5"
        ],
        [
            "22.0"
        ],
        [
            "22.8"
        ],
        [
            "29.6"
        ],
        [
            "28.9"
        ],
        [
            "30.3"
        ],
        [
            "29.8"
        ],
        [
            "28.1"
        ],
        [
            "28.8"
        ],
        [
            "26.1"
        ],
        [
            "24.1"
        ],
        [
            "313.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Topography"
        ],
        [
            "The bigger part of Baungon is located over plateau, the terrain of which is generally flat with slowly rising mountains and some canyons with a highest slope of 30%.",
            "In some parts, however, the terrain is strongly sloping to severely eroded.",
            "It has three (3) large rivers, namely; Bobonawan in the north, Tumalaong at the south, and Kalawaig at the west.",
            "These rivers and its tributaries serve as natural drainage system."
        ],
        [
            "Near the airport, one can find Kabula River, a favorite site for water rafting."
        ],
        [
            "Flora"
        ],
        [
            "Baungon is home to two of the world's rarest flowers: Rafflesia and Amorphophallus paeoniifolius.",
            "The Rafflesia that grows in Baungon was identified by one botanist, Ulysses Ferreras, as Rafflesia schadenbergiana, which was thought to be extinct.",
            "Such Rafflesia was last seen by the German Alex Schandenberg on Mount Apo in the year 1881, but found again in Bukidnon after 126 years."
        ],
        [
            "Barangays"
        ],
        [
            "A barangay map of Baungon, Bukidnon"
        ],
        [
            "Baungon is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101301001   Balintad"
        ],
        [
            " 1.5%"
        ],
        [
            " 539"
        ],
        [
            " 660"
        ],
        [
            "  ▾"
        ],
        [
            " −2.00%"
        ],
        [
            " 101301002   Buenavista"
        ],
        [
            " 2.5%"
        ],
        [
            " 916"
        ],
        [
            " 1,072"
        ],
        [
            "  ▾"
        ],
        [
            " −1.56%"
        ],
        [
            " 101301003   Danatag"
        ],
        [
            " 6.9%"
        ],
        [
            " 2,561"
        ],
        [
            " 2,585"
        ],
        [
            "  ▾"
        ],
        [
            " −0.09%"
        ],
        [
            " 101301004   Kalilangan"
        ],
        [
            " 1.8%"
        ],
        [
            " 680"
        ],
        [
            " 883"
        ],
        [
            "  ▾"
        ],
        [
            " −2.58%"
        ],
        [
            " 101301005   Lacolac"
        ],
        [
            " 1.6%"
        ],
        [
            " 608"
        ],
        [
            " 685"
        ],
        [
            "  ▾"
        ],
        [
            " −1.19%"
        ],
        [
            " 101301006   Langaon"
        ],
        [
            " 2.9%"
        ],
        [
            " 1,087"
        ],
        [
            " 1,044"
        ],
        [
            "  ▴"
        ],
        [
            " 0.40%"
        ],
        [
            " 101301007   Liboran"
        ],
        [
            " 9.0%"
        ],
        [
            " 3,358"
        ],
        [
            " 3,094"
        ],
        [
            "  ▴"
        ],
        [
            " 0.82%"
        ],
        [
            " 101301008   Lingating"
        ],
        [
            " 11.3%"
        ],
        [
            " 4,175"
        ],
        [
            " 4,726"
        ],
        [
            "  ▾"
        ],
        [
            " −1.23%"
        ],
        [
            " 101301009   Mabuhay"
        ],
        [
            " 4.1%"
        ],
        [
            " 1,529"
        ],
        [
            " 1,628"
        ],
        [
            "  ▾"
        ],
        [
            " −0.63%"
        ],
        [
            " 101301010   Mabunga"
        ],
        [
            " 3.4%"
        ],
        [
            " 1,272"
        ],
        [
            " 1,162"
        ],
        [
            "  ▴"
        ],
        [
            " 0.91%"
        ],
        [
            " 101301011   Nicdao"
        ],
        [
            " 5.8%"
        ],
        [
            " 2,159"
        ],
        [
            " 1,938"
        ],
        [
            "  ▴"
        ],
        [
            " 1.09%"
        ],
        [
            " 101301012   Imbatug (Poblacion)"
        ],
        [
            " 17.1%"
        ],
        [
            " 6,363"
        ],
        [
            " 5,231"
        ],
        [
            "  ▴"
        ],
        [
            " 1.98%"
        ],
        [
            " 101301013   Pualas"
        ],
        [
            " 6.8%"
        ],
        [
            " 2,524"
        ],
        [
            " 2,065"
        ],
        [
            "  ▴"
        ],
        [
            " 2.03%"
        ],
        [
            " 101301014   Salimbalan"
        ],
        [
            " 8.6%"
        ],
        [
            " 3,189"
        ],
        [
            " 2,915"
        ],
        [
            "  ▴"
        ],
        [
            " 0.90%"
        ],
        [
            " 101301015   San Vicente"
        ],
        [
            " 6.3%"
        ],
        [
            " 2,344"
        ],
        [
            " 2,143"
        ],
        [
            "  ▴"
        ],
        [
            " 0.90%"
        ],
        [
            " 101301016   San Miguel"
        ],
        [
            " 2.8%"
        ],
        [
            " 1,032"
        ],
        [
            " 1,037"
        ],
        [
            "  ▾"
        ],
        [
            " −0.05%"
        ],
        [
            "Total"
        ],
        [
            "37,111"
        ],
        [
            "32,868"
        ],
        [
            " ▴"
        ],
        [
            "1.22%"
        ],
        [
            "Demographics"
        ],
        [
            "Ultra Winds Mountain Resort located in Barangay Pualas is accessible in Cagayan de Oro via Convention Center Access Road"
        ],
        [
            "Population census of BaungonYearPop.±% p.a.1918 727—    1939 2,345+5.74%1948 3,927+5.90%1960 7,617+5.68%1970 11,251+3.97%1975 14,974+5.90%1980 18,320+4.11%1990 19,774+0.77%1995 22,617+2.55%2000 26,695+3.62%2007 29,757+1.51%2010 32,868+3.68%2015 34,336+0.84%2020 37,111+1.54%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Baungon was 37,111 people, with a density of 110 inhabitants per square kilometre or 280 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Baungon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  40.20"
        ],
        [
            "2009  49.06"
        ],
        [
            "2012  46.16"
        ],
        [
            "2015  49.73"
        ],
        [
            "2018  34.65"
        ],
        [
            "2021  39.01"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The town's economy is primarily agricultural.",
            "The main agricultural products of Baungon are corn, casava, banana, camote, fruits and vegetables, bamboo crafts, and abaca products.",
            "Mill products consist of the following: corn grits, rice, and casava starch."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Baungon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "272, s. 1957\".",
            "Official Gazette of the Republic of the Philippines.",
            "October 4, 1957.",
            "Archived from the original on 31 January 2023.",
            "Retrieved 31 January 2023.",
            "The conversion herein made shall take effect as of July 1, 1956."
        ],
        [
            "^"
        ],
        [
            "\"Baungon: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ Lays, P. (2006).",
            "Rediscovery of a floral jewel in the Philippine archipelago: Rafflesia schadenbergiana Göppert, 1885 (Rafflesiaceae).",
            "Lejeunia 182: 1–16."
        ],
        [
            "^ Barcelona, J. F.; P. B Pelser; D. S. Balete; L. L. Co (October 2009).",
            "\"Taxonomy, ecology, and conservation status of Philippine Rafflesia (Rafflesiaceae)\".",
            "Blumea.",
            "54: 77–94.",
            "doi:10.3767/000651909X474122."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Baungon"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Baungon"
        ],
        [
            "Libona"
        ],
        [
            "Talakag"
        ],
        [
            "Sumilao"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Baungon&oldid=1227732944\""
        ],
        [
            "Categories: Municipalities of BukidnonPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}