{
    "name": "Baybay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Baybay"
        ],
        [
            "23 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogТатарча / tatarçaاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°41′N 124°48′E﻿ / ﻿10.68°N 124.8°E﻿ / 10.68; 124.8"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Component city in Leyte, Philippines"
        ],
        [
            "Component city in Eastern Visayas, PhilippinesBaybayComponent cityCity of BaybayCity Hall"
        ],
        [
            "FlagSealMotto: Our City.",
            "Our Home.",
            "Our FutureMap of Leyte with Baybay highlightedOpenStreetMapBaybayLocation within the PhilippinesCoordinates: 10°41′N 124°48′E﻿ / ﻿10.68°N 124.8°E﻿ / 10.68; 124.8CountryPhilippinesRegionEastern VisayasProvinceLeyteDistrict"
        ],
        [
            "5th districtFounded1620Chartered1910CityhoodJune 16, 2007 (Lost cityhood in 2008 and 2010)Affirmed CityhoodFebruary 15, 2011Barangays92"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorJose Carlos L. Cari • Vice MayorErnesto M. Butawan • RepresentativeCarl Nicolas C. Cari • City Council"
        ],
        [
            "List"
        ],
        [
            "• Romulo B. Alcala• Fulton Ike C. Arradaza• Edgardo R. Ompoy• Rodulfo S. Palma• Vicente Victor G. Veloso• Dominador K. Murillo• Jorge V. Rebucas• Filemon F. Avila• Arturo Elisa O. Astorga• Jose Rommel A. Peñaranda"
        ],
        [
            " • Electorate70,431 voters (2022) • Revenue₱ 1,101 million (2020) • Assets₱ 4,073 million (2020) • Expenditure₱ 673.7 million (2020)Service provider • ElectricityLeyte 4 Electric Cooperative (LEYECO 4)Time zoneUTC+8 (PST)ZIP code6521PSGC0803708000IDD : area code +63 (0)53Native languagesBaybay Cebuano TagalogWebsitebaybaycity.gov.ph"
        ],
        [
            "Baybay (IPA:"
        ],
        [
            "With an area of 45,934 hectares (460 km2; 180 sq mi), it is the second largest city in the province after Ormoc.",
            "Formerly, Baybay was the biggest town in Leyte in terms of population and second in terms of land area, after Abuyog.",
            "The Baybay language, a Visayan language distinct from both Waray and Cebuano, is spoken in the city itself."
        ],
        [
            "Baybay houses a major port on the central west coast of Leyte, where ferries leave for and from Cebu and other islands.",
            "It has also the Baybay Public Terminal, serving routes from Tacloban, Ormoc, Maasin, Manila, Davao City, and other towns in Leyte, Southern Leyte, and Samar."
        ],
        [
            "Generally an agricultural city, the common means of livelihood are farming and fishing.",
            "Some are engaged in hunting and in forestal activities.",
            "The most common crops grown are rice, corn, abaca, root crops, fruits, and vegetables.",
            "Various cottage industries can also be found in Baybay such as bamboo and rattan craft, ceramics, dress-making, fiber craft, food preservation, mat weaving, metal craft, and Philippine furniture manufacturing and other related activities."
        ],
        [
            "It is the home of the Visayas State University, one of the leading schools in Southeast Asia on agricultural research, and was called as \"Resort University.\""
        ],
        [
            "Etymology"
        ],
        [
            "The place got its name from the statement Ang suba nagbaybay sa Pangasugan.",
            "The community was then named as Pangasugan, but when Spanish conquistadores asked a native about the name of the place, the native answered in Visayan, Ang suba nagbaybay sa Pangasugan, this is how Baybay got its name."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(March 2020) (Learn how and when to remove this message)"
        ],
        [
            "Baybay was believed to be the only settlement on the western coast of Leyte known to the first Spanish conquistadors that came with Magellan, as was Abuyog in the eastern part of the province, and Limasawa and Cabalian in the south.",
            "In 1620, the Jesuit fathers which belonged to the \"residencia\" of Carigara, the first and central station of the Society of Jesus in Leyte."
        ],
        [
            "By superior approbation, Baybay was created a parish on September 8, 1835, with the invocation of Our Lady of the Immaculate Conception.",
            "However, the town was erected and independent parish on February 27, 1836."
        ],
        [
            "The Immaculate Conception Church in Baybay, Leyte"
        ],
        [
            "When the Augustinians took over the administration of the parish after the expulsion of the Jesuits, they opened the first school in Baybay.",
            "During their time, the first road leading to Palompon was constructed, thus bringing Baybay closer to her neighboring municipalities.",
            "The Augustinian fathers stayed in the town for 75 years - all of which they devoted to the upliftment of the natives in education and in their economic standing."
        ],
        [
            "The first church of Baybay was built in Barrio Punta where it still stands today but is in need of repair.",
            "Punta is one of the seven original barrios of Baybay and was even believed to be the original site of Baybay itself, although there are others who say that it was actually in Kabkab, in the vicinity of Barrio Pangasugan."
        ],
        [
            "Chinese invaders attempted to conquer the community, but the brave and staunch natives foiled several attempts.",
            "When the Spanish conquistadors spread themselves out to the provinces, an expeditionary force under Felipe Segundo, evidently looking for a bigger settlement, landed in a barrio north of the town which was and still is called Pangasugan.",
            "Landing near the river, he pointed to a spot and asked a native in Spanish for the name of the place.",
            "Unable to understand Spanish and thinking that Felipe Segundo wanted to ask about the river, he answered in Visayan, \" Ang suba nagbaybay sa Pangasugan.\"",
            "This is how Baybay got its name."
        ],
        [
            "Baybay also suffered from Moro raids.",
            "On October 22, 1605, one such raid occurred and the pirates, after leaving countless dead, carried off 60 men as captives.",
            "Again, on November 4, 1663, moors under the dreaded Corralat took their toll of human lives and captives after mercilessly slaughtering the handful of men who defended the town with the aid of the parish priest."
        ],
        [
            "Baybay suffered a great setback in 1866 when a great fire practically reduced the town to ashes leaving only the chapel of the Holy Cross in a miraculous manner."
        ],
        [
            "The civil administration of the town during the Spanish era was placed in the hands of the gobernadorcillo, assisted by a teniente and the different jueces and cabezas.",
            "In 1892, in accordance with the provisions of the Mayura law, the head of the municipal government was given the designation of \"Capitan Municipal\" and his assistants in office were called \"teniente mayor indice\" and the \"teniente de policia.\"",
            "For the first time, a juez de paz was designated and a detachment of guardias civiles was placed in the town."
        ],
        [
            "The construction of the church, which still stands today, was begun under the engineering administration of Mariano Vasnillio during the term of Fr.",
            "Vicente E. Coronado in 1852.",
            "The construction lagged for ten years after which the work was resumed under Maestro Proceso, who came from Manila for the purpose of finishing the work.",
            "The church was finally finished in 1870 after Capitan Mateo Espinoso, a sculptor and painter of renown, put on the finishing touches.",
            "The altar and the rails as they stand today are a credit to his genius."
        ],
        [
            "As the Spanish residents moved away in the early months of 1898, the reins of local government passed completely into the hands of the Filipino officials.",
            "An election was held and Don Quirimon Alkuino was elected as the first Filipino presidente.",
            "However, after about four months, Gen. Vicente Lukban nullified the results of the election and ordered another one to be held, with the same results.",
            "Lukban ordered that the barrios of Baybay be named after the tenientes, thus Caridad was renamed \"Veloso,\" Plaridel became \"Alvarado,\" Bitanhuan was named \"Coronado.\"",
            "San Agustin \"Sabando,\" Punta \"Virgineza,\" Pomponan \"Montefolka,\" Gabas \"Bartolini\", etc."
        ],
        [
            "Throughout these years, Baybay developed into one of the biggest towns in Leyte."
        ],
        [
            "The port of Baybay was closed in 1899 by the American coast guards.",
            "The price of commodities soared and products like copra and hemp accumulated in the docks.",
            "The order was lifted, but only after 14 ships, the greatest number to dock in port at one time, had stayed in port for days waiting for the order to leave."
        ],
        [
            "On February 10, 1901, the first Americans arrived in Baybay on the ship \"Melliza\", their arrival caused great confusion and the people evacuated to the barrios.",
            "Only a few officials stayed in the town.",
            "The next day, soldiers scoured the countryside convincing the people to return to their homes."
        ],
        [
            "Even while the local government was under Don Quirimon Alkuino, he was under orders to follow Capt.",
            "Gilmore's (commander of the American attachment) advice.",
            "Eventually, this caused conflicts in the local government, and Filipinos took to the hills to join the fight against the Americans."
        ],
        [
            "There were several attempts to attack the American garrison in the town, but practically all of them failed because the Americans had superior arms.",
            "Don Guilermo Alkuino and Don Magdaleno Fernandez led the first attack with more than 200 men.",
            "The American soldiers fought another in Barrio Pomponan that resulted in the death of 30 men and the destruction of the barrio."
        ],
        [
            "A group of Hilongosnons under the renowned Francisco Flordelis made an attempt in 1901 but they were driven off in a battle at Barrio Punta."
        ],
        [
            "Filipino nationalist made Baybay one of the areas where they made their last stand against the Americans.",
            "Later, the surrender ceremonies were held in the town, but only after numerous conferences between American officers and Filipino pacifists were held to effect the surrender of the resistance leaders.",
            "The surrender of Capt.",
            "Florentino Penaranda who was the last to give up the fight was a colorful one.",
            "All his men and officers, thousands of them, gathered at the banks of the Pagbanganan River.",
            "From there, they marched to the plaza in front of the municipal hall where the American officers were waiting.",
            "Before the Filipinos laid down their arms, Penaranda delivered a speech that even today is considered one of the most stirring addresses made in the province.",
            "To commemorate the event, a sumptuous banquet was held for the Americans and the Filipino nationalists.",
            "The following day, the Filipino soldiers trekked home in their uniforms to start another life of peace and work."
        ],
        [
            "A sect of the Protestant religion entered Baybay for the first time sometime in 1900.",
            "They established their own church in the poblacion.",
            "In 1902, the Philippine Independent Church established itself in the barrio of Caridad; shortly afterwards, the Seventh Day Adventists came in."
        ],
        [
            "At the turn of the century, a provincial high school was founded in Baybay, one of the first high schools in Leyte.",
            "The government also established the Baybay National Agricultural School for young farmers of Visayas and Mindanao."
        ],
        [
            "The Japanese forces came to Baybay in two waves in 1942.",
            "A puppet government was established shortly after their arrival wherein Paterno Tan Sr. was the mayor."
        ],
        [
            "In 1944, American planes passed the town in bombing missions in Cebu.",
            "They bombed a ship at anchor in the port of Baybay and left it in flames.",
            "The Japanese Imperial Forces left the town on October 19, 1944."
        ],
        [
            "Baybay was used by liberation forces as a springboard for patrol units in the south and for forces that went north for the great battle of Ormoc, where a fierce battle was raging.",
            "The hospital was taken over by the provincial government and is still functioning today."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "For further information, see League of Cities of the Philippines v. COMELEC."
        ],
        [
            "On June 16, 2007, Baybay becomes a city in the province of Leyte after ratification of Republic Act 9389."
        ],
        [
            "The Supreme Court declared the cityhood law of Baybay and 15 other cities unconstitutional after a petition filed by the League of Cities of the Philippines in its ruling on November 18, 2008.",
            "On December 22, 2009, the cityhood law of Baybay and 15 other municipalities regain its status as cities again after the court reversed its ruling on November 18, 2008.",
            "On August 23, 2010, the court reinstated its ruling on November 18, 2008, causing Baybay and 15 cities to become regular municipalities.",
            "Finally, on February 15, 2011, Baybay becomes a city again including the 15 municipalities declaring that the conversion to cityhood met all legal requirements."
        ],
        [
            "After six years of legal battle, in its board resolution, the League of Cities of the Philippines acknowledged and recognized the cityhood of Baybay and 15 other cities."
        ],
        [
            "Geography"
        ],
        [
            "Baybay sunset in baywalk"
        ],
        [
            "Baybay is bounded by Camotes Sea to the west, Albuera to the north, Inopacan to the south, Burauen, La Paz and MacArthur to the northeast, Javier to the east, and Abuyog and Mahaplag to the southeast."
        ],
        [
            "The climate is of Coronas Climate type IV, which is generally wet with no particularly discernible seasons.",
            "Its topography is generally mountainous in the eastern portion as it slopes down west towards the shore line.",
            "Generally an agricultural city, the common means of livelihood are farming and fishing.",
            "Some are engaged in hunting and in forestal activities.",
            "The most common crops grown are rice, corn, abaca, root crops, fruits, and vegetables.",
            "Various cottage industries can also be found in Baybay such as bamboo and rattan craft, ceramics, dress-making, fiber craft, food preservation, mat weaving, metal craft, furniture manufacture and other related activities."
        ],
        [
            "Barangays"
        ],
        [
            "Baybay comprises 92 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "There are 23 barangays which are in the Poblacion, with one barangay jointly located.",
            "The remaining 68 are rural barangays."
        ],
        [
            "Altavista"
        ],
        [
            "Ambacan"
        ],
        [
            "Amguhan"
        ],
        [
            "Ampihanon"
        ],
        [
            "Balao"
        ],
        [
            "Banahao"
        ],
        [
            "Biasong"
        ],
        [
            "Bidlinan"
        ],
        [
            "Bitanhuan"
        ],
        [
            "Bubon"
        ],
        [
            "Buenavista"
        ],
        [
            "Bunga"
        ],
        [
            "Butigan"
        ],
        [
            "Candadam (Sitio Crossing Diversion Road)"
        ],
        [
            "Can-ipa"
        ],
        [
            "Caridad"
        ],
        [
            "Ciabu"
        ],
        [
            "Cogon"
        ],
        [
            "Gaas"
        ],
        [
            "Gabas"
        ],
        [
            "Gacat"
        ],
        [
            "Guadalupe (Utod)"
        ],
        [
            "Gubang"
        ],
        [
            "Hibunawan"
        ],
        [
            "Higulo-an"
        ],
        [
            "Hilapnitan"
        ],
        [
            "Hipusngo"
        ],
        [
            "Igang"
        ],
        [
            "Imelda"
        ],
        [
            "Jaena"
        ],
        [
            "Kabalasan"
        ],
        [
            "Kabatuan"
        ],
        [
            "Kabungaan"
        ],
        [
            "Kagumay"
        ],
        [
            "Kambonggan"
        ],
        [
            "Kansungka"
        ],
        [
            "Kantagnos"
        ],
        [
            "Kilim"
        ],
        [
            "Lintaon"
        ],
        [
            "Maganhan"
        ],
        [
            "Mahayahay"
        ],
        [
            "Mailhi"
        ],
        [
            "Maitum"
        ],
        [
            "Makinhas"
        ],
        [
            "Mapgap"
        ],
        [
            "Marcos"
        ],
        [
            "Maslug"
        ],
        [
            "Matam-is"
        ],
        [
            "Maybog"
        ],
        [
            "Maypatag"
        ],
        [
            "Monterico"
        ],
        [
            "Monteverde"
        ],
        [
            "Palhi"
        ],
        [
            "Pangasugan (Famously known as Visca)"
        ],
        [
            "Pansagan"
        ],
        [
            "Patag"
        ],
        [
            "Plaridel"
        ],
        [
            "Poblacion Zone 1 (Masagana ric)"
        ],
        [
            "Poblacion Zone 2"
        ],
        [
            "Poblacion Zone 3 ( Lope Montefolka)"
        ],
        [
            "Poblacion Zone 4 ( Domingo Torres )"
        ],
        [
            "Poblacion Zone 5"
        ],
        [
            "Poblacion Zone 6"
        ],
        [
            "Poblacion Zone 7 (Serafin Loreto)"
        ],
        [
            "Poblacion Zone 8"
        ],
        [
            "Poblacion Zone 9 (Eneribito Loretto)"
        ],
        [
            "Poblacion Zone 10 (Juan Galenzoga)"
        ],
        [
            "Poblacion Zone 11(Don Quirimon Alkuino) aka Tinago"
        ],
        [
            "Poblacion Zone 12 (Felomino"
        ],
        [
            "Mascarinas)"
        ],
        [
            "Poblacion Zone 13"
        ],
        [
            "Poblacion Zone 14"
        ],
        [
            "Poblacion Zone 15"
        ],
        [
            "Poblacion Zone 16 (Godfredo"
        ],
        [
            "Modina)"
        ],
        [
            "Poblacion Zone 17 (Zacarias Pancito)"
        ],
        [
            "Poblacion Zone 18 (Gregorio Loreto Sr.)"
        ],
        [
            "Poblacion Zone 19 (Julian Lacerna)"
        ],
        [
            "Poblacion Zone 20"
        ],
        [
            "Poblacion Zone 21(Alejandro"
        ],
        [
            "Avellana) aka Punong"
        ],
        [
            "Poblacion Zone 22 ( Juan Baquerfo)"
        ],
        [
            "Poblacion Zone 23 (Saturnino Abique) aka Lawis"
        ],
        [
            "Pomponan"
        ],
        [
            "Punta"
        ],
        [
            "Saban"
        ],
        [
            "Sapa"
        ],
        [
            "San Agustin"
        ],
        [
            "San Isidro"
        ],
        [
            "San Juan"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santo Rosario (located in poblacion), (also known as Cagnonoc)"
        ],
        [
            "Villa Mag-aso"
        ],
        [
            "Villa Solidaridad"
        ],
        [
            "Zacarito"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Baybay, Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "78(3.1)"
        ],
        [
            "57(2.2)"
        ],
        [
            "84(3.3)"
        ],
        [
            "79(3.1)"
        ],
        [
            "118(4.6)"
        ],
        [
            "181(7.1)"
        ],
        [
            "178(7.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "172(6.8)"
        ],
        [
            "180(7.1)"
        ],
        [
            "174(6.9)"
        ],
        [
            "128(5.0)"
        ],
        [
            "1,598(62.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.7"
        ],
        [
            "13.8"
        ],
        [
            "17.3"
        ],
        [
            "18.5"
        ],
        [
            "23.2"
        ],
        [
            "26.5"
        ],
        [
            "27.1"
        ],
        [
            "26.0"
        ],
        [
            "26.4"
        ],
        [
            "27.5"
        ],
        [
            "24.6"
        ],
        [
            "21.0"
        ],
        [
            "268.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BaybayYearPop.±% p.a.1903 22,990—    1918 36,917+3.21%1939 42,526+0.68%1948 50,725+1.98%1960 51,799+0.17%1970 63,782+2.10%1975 67,031+1.00%1980 74,640+2.17%1990 82,281+0.98%1995 86,179+0.87%2000 95,630+2.26%2007 102,526+0.96%2010 102,841+0.11%2015 109,432+1.19%2020 111,848+0.43%Source: Philippine Statistics Authority"
        ],
        [
            "The people of Baybay, known as Baybayanons or Baybayanos (depending on the usage) which are Cebuano-speaking.",
            "Most of the people are Roman Catholic with almost 90% of the whole population."
        ],
        [
            "Language"
        ],
        [
            "People of Baybay City are mostly Boholano-speaking and Cebuano-speaking Leyteños with some influences from the Waray-Waray language.",
            "Baybayanon is the language spoken by inhabitants of the original settlements of Baybay City before mass migration of Cebuanos and Boholanos into the area and widely recognized as predating the surrounding Cebuano communities.",
            "It is a more representative language reference name than the so-called \"Utodnon\" or \"Waya-Waya\" since it does not refer to a single barangay, but spoken in five barangays, namely Guadalupe (Utod), Gabas, Kilim, Patag and Pangasugan."
        ],
        [
            "It is a living language given an ISO 639-3 language code bvy and has an approximate 10,000 speakers (2009 J. Lobel).",
            "It has been listed by Ethnologue as a dialect of Waray-Waray, however, it is distinct from Waray-Waray, and is not mutually intelligible with that language.",
            "Furthermore, Baybayanon speakers do not consider themselves or their language to be Waray-Waray.",
            "No published works have argued that Baybayanon is a dialect of Waray-Waray; in fact, published works (by Rufino, as well as Lobel's forthcoming dissertation) have specifically referred to this as a distinct or separate language.",
            "Other languages spoken by few in the city include English, which is used as a second languages, as well as Spanish and Hokkien Chinese, mainly spoken by the remaining people of mestizo and Chinese descent."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Baybay"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  29.50"
        ],
        [
            "2009  31.00"
        ],
        [
            "2012  27.71"
        ],
        [
            "2015  30.77"
        ],
        [
            "2018  22.84"
        ],
        [
            "2021  26.02"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Local government"
        ],
        [
            "Baybay City Legislative Building and Convention Center."
        ],
        [
            "Executive power is vested in the mayor.",
            "The Sangguniang Panlungsod or the city council has the legislative power to create city ordinances.",
            "It is a unicameral body composed of ten elected councilors and certain numbers of ex officio and sectoral representatives.",
            "It is presided by the vice mayor, the City Mayor and the elected city councilors are elected-at-large every three years.",
            "Also, the city has also Regional Trial Court Branch 14 and Municipal Trial Court in Cities whose both located at the city proper in front of the Baybay Legislative Building and Convention Center."
        ],
        [
            "List of mayors"
        ],
        [
            "Chief Executives of Baybay"
        ],
        [
            "Capitan Municipal or Gobernadorcillos(Spanish Regime)"
        ],
        [
            "Capitan Bique"
        ],
        [
            "Marcelo Galenzoga"
        ],
        [
            "Paulino Avellana"
        ],
        [
            "Julian Lacerna"
        ],
        [
            "Pedro Valenzona"
        ],
        [
            "Gregorio Loreto"
        ],
        [
            "Bartolome Bartolini"
        ],
        [
            "Mariano Prado"
        ],
        [
            "Alejandro Avellana"
        ],
        [
            "Eustiquio Galenzoga"
        ],
        [
            "Juan Galenzoga"
        ],
        [
            "Presidentes Municipal"
        ],
        [
            "Quirimon V. Alkuino"
        ],
        [
            "1899–1903"
        ],
        [
            "Domingo Torres"
        ],
        [
            "1904–1905"
        ],
        [
            "Eriberto A. Loreto"
        ],
        [
            "1906–1907"
        ],
        [
            "Filemon Mascariñas"
        ],
        [
            "1908–1909"
        ],
        [
            "Teodoro Prado"
        ],
        [
            "1910–1911"
        ],
        [
            "Serafin Loreto"
        ],
        [
            "1912–1915"
        ],
        [
            "Apolinario Tavera"
        ],
        [
            "1916–1919"
        ],
        [
            "Pedro de Veyra"
        ],
        [
            "1920–1923"
        ],
        [
            "Lope Montefolka"
        ],
        [
            "1924–1927"
        ],
        [
            "Pedro de Veyra"
        ],
        [
            "1928–1931"
        ],
        [
            "Saturnino Abique"
        ],
        [
            "1932–1935"
        ],
        [
            "Town Mayors"
        ],
        [
            "Serafin Loreto"
        ],
        [
            "1935–1939"
        ],
        [
            "Juan Baquerfo"
        ],
        [
            "1940–1941"
        ],
        [
            "Godofredo Modina"
        ],
        [
            "1942–1947"
        ],
        [
            "Zacarias Pancito"
        ],
        [
            "1948–1949"
        ],
        [
            "Regino Palermo"
        ],
        [
            "1949–1950"
        ],
        [
            "Paterno M. Tan"
        ],
        [
            "1951–1959"
        ],
        [
            "Nello Y. Roa"
        ],
        [
            "1960–1963"
        ],
        [
            "Eriberto V. Loreto"
        ],
        [
            "1964–1979"
        ],
        [
            "Jose V. Loreto"
        ],
        [
            "1980–1986"
        ],
        [
            "Florencio Centino"
        ],
        [
            "1986"
        ],
        [
            "Marilyn V. de Leon"
        ],
        [
            "1986–1987"
        ],
        [
            "Rodulfo Torcende"
        ],
        [
            "1987"
        ],
        [
            "Ma.",
            "Cleofe Veloso"
        ],
        [
            "1987"
        ],
        [
            "Arturo Astorga"
        ],
        [
            "1987"
        ],
        [
            "Carmen L. Cari"
        ],
        [
            "1988–1998"
        ],
        [
            "Jose Carlos L. Cari"
        ],
        [
            "1998–2007"
        ],
        [
            "City Mayors"
        ],
        [
            "Michael L. Cari"
        ],
        [
            "2007–2010"
        ],
        [
            "Carmen L. Cari"
        ],
        [
            "2010–2019"
        ],
        [
            "Jose Carlos L. Cari"
        ],
        [
            "2019–Present"
        ],
        [
            "Culture"
        ],
        [
            "Baybay City Veteran's Park and Baywalk"
        ],
        [
            "Baybay is a hub of business and industry for the western coast of Leyte, with a commercial service sector in the city that includes banks, virtual assistance centers, restaurants, cafes, night spots, sports centers, as well as retail and wholesale stores.",
            "The city's seaside promenade is the most visited, especially at night-time."
        ],
        [
            "Festivals"
        ],
        [
            "Binaybayon Festival - is the city's Festival, is celebrated every 27th day of December (the city fiesta) in honor of the Patroness of Baybay, Our Lady of Immaculate Conception for the blessings that she gave every year.",
            "It also depicts the rich history of Baybay and also, showing the main source of livelihood of most Baybayanons like fishing and farming.Binaybayon Festival is located in Baybay City, Leyte.Travelers know that the destination is a major part of planning a trip, experiencing and delving deeper into unfamiliar places, people, and culture are paramount.According to traditional accounts, fete traces its origins during the arrival of the Spanish colonizers in the late 1500s, when they asked a native about the name of the place.",
            "Thinking he was being asked about the nearby river and beach, the local replied “ang suba kaynunuk nagabaybay sa Santa Kudos” which literally means “the river is meandering through the village of Santa Cruz”."
        ],
        [
            "The Spaniards were only able to pick up the word “baybay” thus they named the place as such."
        ],
        [
            "Tigbawanon Festival - is celebrated at Barangay Plaridel every 2nd Saturday of January in honor of Sr. Santo Niño.",
            "Like other festivals in Baybay, it is also shows the history of Barangay Plaridel and its main source of livelihood which is farming and weaving."
        ],
        [
            "Halaran Festival - is celebrated at Barangay Santo Rosario every month of October in honor of the Holy Rosary.",
            "It is also depicts the history of Barangay Santo Rosario and also, it shows the main source of livelihood among residents in the place which is fishing, because the barangay itself is resided beside the seashore."
        ],
        [
            "Sirong Festival - is celebrated at Barangay Pomponan every 13th day of June in honor of Saint Anthony of Padua.",
            "Like other festivals in Baybay, it also shows the history of Barangay Pomponan and its main source of livelihood which is farming."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "A rickshaw locally known as \"Potpot\" is one of the main transportation around the city of Baybay and of the east coast municipalities of Leyte all the way to Maasin City of Southern Leyte."
        ],
        [
            "Baybay City can be reached by different types of transportation:"
        ],
        [
            "It is 5 hours from Cebu City, 6 hours from Mindanao, and 20 hours from Manila by passenger vessels."
        ],
        [
            "There is no airport in Baybay, but domestic flights serve Tacloban airport, which is about 3 hours by road."
        ],
        [
            "Accredited Transport Cooperatives as of January 2021:"
        ],
        [
            "Baybay Leyte Transport Cooperative"
        ],
        [
            "Baybay North Transport Cooperative (BATRANS COOP)"
        ],
        [
            "Liloy Labason Gutalac Van Transport Cooperative"
        ],
        [
            "Healthcare"
        ],
        [
            "Name of the Healthcares"
        ],
        [
            "Location"
        ],
        [
            "Type"
        ],
        [
            "Western Leyte Provincial Hospital (WLPH)"
        ],
        [
            "G.H.",
            "Del Pilar St., Baybay City, Leyte"
        ],
        [
            "Public"
        ],
        [
            "Baybay Doctors' Hospital (BDH)"
        ],
        [
            "C.M.",
            "Recto Street corner 30 de Decembre Street, Baybay City, Leyte"
        ],
        [
            "Private"
        ],
        [
            "Baybay Rural Health Unit I"
        ],
        [
            "R. Magsaysay St., Baybay City, Leyte"
        ],
        [
            "Public"
        ],
        [
            "Baybay Rural Health Unit II"
        ],
        [
            "Public"
        ],
        [
            "Visayas State University Hospital"
        ],
        [
            "Visca, Baybay City, Leyte, Philippines"
        ],
        [
            "There are five Healthcares located at the city of Baybay."
        ],
        [
            "Media"
        ],
        [
            "Radio stations"
        ],
        [
            "There are two radio stations operating in Baybay: Groove FM (DYBK 92.5 FM), located at P&Q Subdivision, Barangay Cogon, Baybay City, Leyte, owned by the 5th Congressman District Leyte, Jose Carlos Cari, and the Radyo Natin Baybay (DYSA 102.9 FM) located at Tres Martires Street, 6521 Baybay, Leyte, one of the radio stations owned by Radyo Natin Network."
        ],
        [
            "Cable and satellite television"
        ],
        [
            "The Pioneer Cable Vision Incorporated or (PCVI) provides 51 channels in total.",
            "It has expanded its services in the towns of Inopacan, Hindang, Hilongos, Bato, and Matalom.",
            "Other subscribers prefer to use Cignal Digital TV, G Sat, and Sky Direct."
        ],
        [
            "Education"
        ],
        [
            "The city is home to various colleges and universities in the country."
        ],
        [
            "Tertiary education"
        ],
        [
            "Visayas State University (Main Campus)"
        ],
        [
            "a zonal agricultural university in the Visayas and one of the country's largest universities in terms of land area.",
            "VSU is also one of the premier universities in Southeast Asia in agricultural research.",
            "VSU is the only university in the entire Visayas region recognized by the Department of Tourism as a tourist site for its resorts, convention facilities, and most of all its 180‑degree view of Mount Pangasugan and the Camotes Sea.",
            "The Philippine Department of Tourism recognises its diverse flora and fauna bounding the mainland and sea from side to side."
        ],
        [
            "Franciscan College of the Immaculate Conception"
        ],
        [
            "Acedilla Technological Institute Foundation Inc."
        ],
        [
            "Secondary"
        ],
        [
            "The Baybay National High School Administration Building.",
            "Baybay NHS is the biggest high school in the city (in terms of land area and population) and also the oldest high school in the city, founded in 1945."
        ],
        [
            "Public"
        ],
        [
            "Banahao National High School"
        ],
        [
            "Baybay National High School"
        ],
        [
            "Baybay City National Night High School"
        ],
        [
            "Bitanhuan National High School"
        ],
        [
            "Bunga National High School"
        ],
        [
            "Caridad National High School"
        ],
        [
            "Ciabu National High School"
        ],
        [
            "Plaridel National High School"
        ],
        [
            "Pomponan National High School"
        ],
        [
            "Mailhi National High School"
        ],
        [
            "Makinhas National High School"
        ],
        [
            "Visayas State University Laboratory High School"
        ],
        [
            "Elementary"
        ],
        [
            "There are 71 elementary schools in the city, 3 are located in the poblacion and 68 in rural areas."
        ],
        [
            "Pre-elementary"
        ],
        [
            "There are several pre-elementary schools, i.e.",
            "kindergartens, as well as day care centers in various barangays."
        ],
        [
            "References"
        ],
        [
            "^ Commission on Elections"
        ],
        [
            "^  City of Baybay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^  https://elevation.maplogs.com/poi/baybay_city_leyte_philippines.524452.html.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ Highlights of the 2015 Census Results for the city of Baybay psa.gov.ph"
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Carl Rubino.",
            "2005.",
            "Utudnon, an Undescribed Language of Leyte Archived May 13, 2015, at the Wayback Machine.",
            "In Hsiu-chuan Liao and Carl R. Galvez Rubino (eds.",
            "), Current Issues in Philippine Linguistics and Anthropology: Parangal kay Lawrence A. Reid, 306-336.",
            "Manila, Philippines: Linguistic Society of the Philippines and SIL Philippines."
        ],
        [
            "^ \"Welcome to the City of Baybay\".",
            "www.vigattintourism.com.",
            "Retrieved January 29, 2019."
        ],
        [
            "^"
        ],
        [
            "\"Baybay: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved February 29, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Accredited Transport Cooperatives as of January 2021\" (PDF).",
            "Office of Transportation Cooperatives.",
            "January 2021."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Baybay, Leyte."
        ],
        [
            "Wikivoyage has a travel guide for Baybay."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Baybay"
        ],
        [
            "Albuera"
        ],
        [
            "BurauenLa PazMacArthur"
        ],
        [
            "Camotes Sea"
        ],
        [
            "Baybay"
        ],
        [
            "Javier"
        ],
        [
            "Inopacan"
        ],
        [
            "AbuyogMahaplag"
        ],
        [
            "Articles Related to Baybay"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "vteEastern Visayas (Region VIII)Regional center"
        ],
        [
            "Tacloban"
        ],
        [
            "Provinces"
        ],
        [
            "Biliran"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Leyte"
        ],
        [
            "Northern Samar"
        ],
        [
            "Samar"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc"
        ],
        [
            "Component cities"
        ],
        [
            "Baybay"
        ],
        [
            "Borongan"
        ],
        [
            "Calbayog"
        ],
        [
            "Catbalogan"
        ],
        [
            "Maasin"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Borongan"
        ],
        [
            "Catarman"
        ],
        [
            "Catbalogan"
        ],
        [
            "Maasin"
        ],
        [
            "Naval"
        ],
        [
            "Tacloban"
        ],
        [
            "Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Allen"
        ],
        [
            "Almagro"
        ],
        [
            "Almeria"
        ],
        [
            "Anahawan"
        ],
        [
            "Arteche"
        ],
        [
            "Babatngon"
        ],
        [
            "Balangiga"
        ],
        [
            "Balangkayan"
        ],
        [
            "Barugo"
        ],
        [
            "Basey"
        ],
        [
            "Bato"
        ],
        [
            "Biliran"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Bontoc"
        ],
        [
            "Burauen"
        ],
        [
            "Cabucgayan"
        ],
        [
            "Caibiran"
        ],
        [
            "Calbiga"
        ],
        [
            "Calubian"
        ],
        [
            "Can-avid"
        ],
        [
            "Capoocan"
        ],
        [
            "Capul"
        ],
        [
            "Carigara"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Culaba"
        ],
        [
            "Dagami"
        ],
        [
            "Daram"
        ],
        [
            "Dolores"
        ],
        [
            "Dulag"
        ],
        [
            "Gamay"
        ],
        [
            "Gandara"
        ],
        [
            "General MacArthur"
        ],
        [
            "Giporlos"
        ],
        [
            "Guiuan"
        ],
        [
            "Hernani"
        ],
        [
            "Hilongos"
        ],
        [
            "Hinabangan"
        ],
        [
            "Hindang"
        ],
        [
            "Hinunangan"
        ],
        [
            "Hinundayan"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Jiabong"
        ],
        [
            "Jipapad"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "Kawayan"
        ],
        [
            "La Paz"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lawaan"
        ],
        [
            "Leyte"
        ],
        [
            "Libagon"
        ],
        [
            "Liloan"
        ],
        [
            "Limasawa"
        ],
        [
            "Llorente"
        ],
        [
            "Lope de Vega"
        ],
        [
            "MacArthur"
        ],
        [
            "Macrohon"
        ],
        [
            "Mahaplag"
        ],
        [
            "Malitbog"
        ],
        [
            "Mapanas"
        ],
        [
            "Marabut"
        ],
        [
            "Maripipi"
        ],
        [
            "Maslog"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Matuguinao"
        ],
        [
            "Maydolong"
        ],
        [
            "Mayorga"
        ],
        [
            "Mercedes"
        ],
        [
            "Merida"
        ],
        [
            "Mondragon"
        ],
        [
            "Motiong"
        ],
        [
            "Naval"
        ],
        [
            "Oras"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagsanghan"
        ],
        [
            "Palapag"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pambujan"
        ],
        [
            "Paranas"
        ],
        [
            "Pastrana"
        ],
        [
            "Pinabacdao"
        ],
        [
            "Pintuyan"
        ],
        [
            "Quinapondan"
        ],
        [
            "Rosario"
        ],
        [
            "Saint Bernard"
        ],
        [
            "Salcedo"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro (Leyte)"
        ],
        [
            "San Isidro (Northern Samar)"
        ],
        [
            "San Jorge"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose de Buan"
        ],
        [
            "San Juan"
        ],
        [
            "San Julian"
        ],
        [
            "San Miguel"
        ],
        [
            "San Policarpo"
        ],
        [
            "San Ricardo"
        ],
        [
            "San Roque"
        ],
        [
            "San Sebastian"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Margarita"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Silago"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Sogod"
        ],
        [
            "Sulat"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Taft"
        ],
        [
            "Tagapul-an"
        ],
        [
            "Talalora"
        ],
        [
            "Tanauan"
        ],
        [
            "Tarangnan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tomas Oppus"
        ],
        [
            "Tunga"
        ],
        [
            "Victoria"
        ],
        [
            "Villaba"
        ],
        [
            "Villareal"
        ],
        [
            "Zumarraga"
        ],
        [
            "Visayas, Republic of the Philippines"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Baybay&oldid=1234111643\""
        ],
        [
            "Categories: BaybayCities in Leyte (province)Populated places established in 16201620 establishments in the PhilippinesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasAll articles with dead external linksArticles with dead external links from August 2023CS1 errors: missing titleCS1 errors: bare URLWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse mdy dates from July 2023Coordinates on WikidataPages using PH wikidata incorrectlyArticles containing Cebuano-language textArticles containing Waray (Philippines)-language textArticles needing additional references from March 2020All articles needing additional referencesAll articles with unsourced statementsArticles with unsourced statements from August 2013Commons category link from WikidataArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}