{
    "name": "Bayog",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bayog"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°50′51″N 123°02′32″E﻿ / ﻿7.847406°N 123.042258°E﻿ / 7.847406; 123.042258"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Zamboanga del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Bayog\" – news · newspapers · books · scholar · JSTOR (July 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Zamboanga Peninsula, PhilippinesBayogMunicipalityMunicipality of BayogAerial view"
        ],
        [
            "FlagSealMap of Zamboanga del Sur with Bayog highlightedOpenStreetMapBayogLocation within the PhilippinesCoordinates: 7°50′51″N 123°02′32″E﻿ / ﻿7.847406°N 123.042258°E﻿ / 7.847406; 123.042258CountryPhilippinesRegionZamboanga PeninsulaProvinceZamboanga del SurDistrict"
        ],
        [
            "2nd districtFoundedMay 8, 1967Barangays28"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorCelso A. Matias • Vice MayorJocel L. Babasa • RepresentativeLeonardo L. Babasa Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Horace Paul T. AnlapJunel P. BacbacBerly E. JateErnesto C. YagosNorelyn B. RodriguezCerilo B. CarcuevaRonilo A. YamaroGodofredo T. Compacion"
        ],
        [
            " • Electorate20,828 voters (2022)Area • Revenue₱ 188.7 million (2020) • Assets₱ 424.2 million (2020) • Expenditure₱ 158.9 million (2020) • Liabilities₱ 93.99 million (2020)Service provider • ElectricityZamboanga del Sur 2 Electric Cooperative (ZAMSURECO 2)Time zoneUTC+8 (PST)ZIP code7011PSGC097303000IDD : area code +63 (0)62Native languagesSubanon Cebuano Chavacano TagalogWebsitewww.zds-bayog.gov.ph"
        ],
        [
            "Bayog, officially the Municipality of Bayog (Cebuano: Lungsod sa Bayog; Subanen: Benwa Bayog; Chavacano: Municipalidad de Bayog; Tagalog: Bayan ng Bayog), is a 3rd class municipality in the province of Zamboanga del Sur, Philippines.",
            "According to the 2020 census, it has a population of 34,519 people."
        ],
        [
            "History"
        ],
        [
            "In 1953, large numbers of immigrants started settling permanently in this area which was then sparsely populated by the native Subanen.",
            "Barrio Bayog came into existence under the Municipality of Malangas.",
            "Bayog was adopted as the name of the barrio, as this place was known to the natives due to the abundance of the “Bayog” (pterospermum diversifolium) trees in the area."
        ],
        [
            "Opportunities in agriculture, business and employment attracted more settlers into the area, particularly during the year 1957 and 1958.",
            "The influx of settlers was given more impetus when the Samar Mining Company (SAMICO) constructed the existing 42 kilometres (26 mi) SAMICO road from Bobuan to its wharf in Pamintayan.",
            "By 1959, Bayog was already quite big for a barrio.",
            "So another barrio was created which is now the present barangay Kahayagan.",
            "When the municipality of Buug (also a former barrio of Malangas) was created in 1960, barangay Bayog and Kahayagan were among the barrios under it."
        ],
        [
            "As early as 1963, three years after the SAMICO road was completed and the company was in full-blast operation, the population of Bayog already warranted the creation of a new municipality.",
            "Thus, on November 14, 1964, Bayog started to function as a corporate municipality separate and distinct from the Municipality of Buug by virtue of Executive Order No.",
            "112 issued by the then President Diosdado Macapagal.",
            "However, on February 15, 1966, the infant municipality was dissolved and reverted into its former status as one of the barangays of the Municipality of Buug by virtue of a Supreme Court decision in the case of Pelaez vs.",
            "Auditor General.",
            "The then Senator Pealez contented that the creation of a new municipality through an executive Order was against the law as the same was a prerogative of Congress."
        ],
        [
            "In time, the town re-applied as a candidate for municipality.",
            "The Municipality of Bayog became the 29th municipality of the Province of Zamboanga del Sur on May 8, 1967, by virtue of Republic Act No.",
            "4872, authorized by then Congressman Vincenso Sagun.",
            "The new municipality was formed out of twenty barrios of the Municipality of Buug (at that time still Province of Zamboanga del Sur): Bayog (which became the poblacion), Bobuan, Datagan, Pulangbato, Dipili, Salawagan, Lamari, Damit, Depasi, Pangi (now San Isidro), Liba, Datagan I, Datagan II, Mataga, Dimalinao, Baking, Dipuri, Kwai, Maton-og and Kanipa-an.",
            "During the later part of the year, barangays Supon, Canoayan, Dagum, Camp Blessing, Conakon, Matin-ao, Balukbahan, Sigacad, Deporehan, Bantal and Balunbunan were created by virtue of a Provincial Board Resolution.",
            "To date, the Municipality has twenty-eight (28) barangays within its juridical boundaries."
        ],
        [
            "Geography"
        ],
        [
            "Bayog is the only town in Zamboanga del Sur that borders the provinces of Zamboanga del Norte and Zamboanga Sibugay.",
            "It is bounded on the north by Godod, Bacungan, Sindangan, and Siayan; on the east by Lakewood; on the south by Kumalarang, Buug, and Diplahan; and on the west by Kabasalan.",
            "It is the westernmost town in the province."
        ],
        [
            "The town is partly situated in the Sibougey Valley watered by the Sibuguey River, Dipili River, and Depore River.",
            "75% of the land lies on rugged terrain with elevation up to 300 metres (980 ft)."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bayog, Zamboanga del Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "48(1.9)"
        ],
        [
            "44(1.7)"
        ],
        [
            "56(2.2)"
        ],
        [
            "56(2.2)"
        ],
        [
            "112(4.4)"
        ],
        [
            "135(5.3)"
        ],
        [
            "124(4.9)"
        ],
        [
            "124(4.9)"
        ],
        [
            "115(4.5)"
        ],
        [
            "134(5.3)"
        ],
        [
            "90(3.5)"
        ],
        [
            "56(2.2)"
        ],
        [
            "1,094(43)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.0"
        ],
        [
            "11.7"
        ],
        [
            "15.6"
        ],
        [
            "18.1"
        ],
        [
            "25.6"
        ],
        [
            "25.7"
        ],
        [
            "25.2"
        ],
        [
            "24.1"
        ],
        [
            "23.8"
        ],
        [
            "26.1"
        ],
        [
            "22.3"
        ],
        [
            "16.5"
        ],
        [
            "247.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Bayog is politically subdivided into 28 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Baking"
        ],
        [
            "Balukbahan"
        ],
        [
            "Balumbunan"
        ],
        [
            "Bantal"
        ],
        [
            "Bobuan"
        ],
        [
            "Camp Blessing"
        ],
        [
            "Canoayan"
        ],
        [
            "Conacon"
        ],
        [
            "Dagum"
        ],
        [
            "Damit"
        ],
        [
            "Datagan"
        ],
        [
            "Depase"
        ],
        [
            "Dipili"
        ],
        [
            "Depore"
        ],
        [
            "Deporehan"
        ],
        [
            "Dimalinao"
        ],
        [
            "Kahayagan"
        ],
        [
            "Kanipaan"
        ],
        [
            "Lamare"
        ],
        [
            "Liba"
        ],
        [
            "Matin-ao"
        ],
        [
            "Matun-og"
        ],
        [
            "San Isidro (Pangi)"
        ],
        [
            "Poblacion"
        ],
        [
            "Pulang Bato"
        ],
        [
            "Salawagan"
        ],
        [
            "Sigacad"
        ],
        [
            "Supon"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BayogYearPop.±% p.a.1970 13,599—    1975 15,784+3.03%1980 16,782+1.23%1990 22,092+2.79%1995 25,231+2.52%2000 26,248+0.85%2007 28,707+1.24%2010 30,048+1.68%2015 33,591+2.15%2020 34,519+0.54%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bayog"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  29.20"
        ],
        [
            "2009  43.63"
        ],
        [
            "2012  44.48"
        ],
        [
            "2015  47.76"
        ],
        [
            "2018  37.86"
        ],
        [
            "2021  29.80"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Iron ore from Bayog"
        ],
        [
            "Bayog has one of the most bustling economies in the province, since it is one of the top revenue-producing municipalities in Zamboanga del Sur, with an annual income of over 25,000,000 which come mainly from mining, business establishments, and quarrying."
        ],
        [
            "As of now, there is one financial institution which operates in the town and numerous cooperatives which also contribute to the town's overall income.",
            "Two pawnshops have also started operations in the town - the Mlhuiller Pawnshop and the Bayog Pawnshop."
        ],
        [
            "Since Bayog is mainly agricultural, over 20 rice and corn mills can be found in the municipality.",
            "In addition, their products are also traded with neighbouring cities such as Zamboanga City and Pagadian City, which is why Bayog has also been considered as th \"Rice Granary Of Region IX\".",
            "The people of the town rely mainly on crop raising and animal husbandry.",
            "The town is situated in a wide plain fed by the Siboguey River and its tributaries.",
            "Two dams can be found in the municipality, namely, the Sibouguey Irrigation Dam and the Dipili River Irrigation Dam, which are responsible for irrigating some 100 square kilometres of ricefields.",
            "This dams were erected during the late 1970s with support from the Philippine-Australian Development Project.",
            "The dams are now under the management of the National Irrigation Administration through their office in the town center."
        ],
        [
            "Bayog has also been cited as the Livestock Center of the region because of the Western Mindanao Livestock Development Center in Barangay Kahayagan, which is responsible for the improvement of livestock products in Zamboanga Peninsula through right breedings."
        ],
        [
            "The people have also been engaged in logging due to the vast forest which were found in the area.",
            "In the past, Bayog was also referred as the Timbermines Country."
        ],
        [
            "Mining is a major industry in Bayog.",
            "Gold is concentrated in Barangay Depore while copper, lead and steel are mined in Barangay Bubuan and Barangay Liba.",
            "Several companies have already started their explorations here, i.e.",
            "Toronto Ventures Incorporated (TVI), Cebu Ore Mining Inc, Miki Trio Ore Mining Inc., and some small scale miners which have their own organization, the Monte de Oro Small Scale Mining Association (MOSSMA)."
        ],
        [
            "Public market"
        ],
        [
            "The new Public Market Building has 180 stalls occupied by different business groups.",
            "The Fish and Meat section has 40 stalls, fruit stand & old carenderia has 15 stalls, Dry Goods section 15 stalls, and new Carenderia building with 7 stalls.",
            "As of now there were already 6 stalls in the newly constructed night market.",
            "A new phase of the Public Market is under construction and will add new 25 stalls."
        ],
        [
            "Tourism"
        ],
        [
            "This section is written like a travel guide.",
            "Please help improve the section by introducing an encyclopedic style or move the content to Wikivoyage.",
            "(June 2018)"
        ],
        [
            "Bayog has a gymnasium with a seating capacity of 4500, considered as one of the largest in the province."
        ],
        [
            "The Dipili River - a tributary of the Sibuguey River and was awarded as the cleanest river in the Philippines."
        ],
        [
            "Western Mindanao Livestock Development Center - known for its buildings and guests house.",
            "It is situated in a hill which overlooks the town."
        ],
        [
            "Loading Point - an irrigation system that serves as haven for the young people during weekends."
        ],
        [
            "Supon Dam - a dam which is also an attraction"
        ],
        [
            "Bailey Bridge - a 55-meter modular bridge crossing the Sibuguey River."
        ],
        [
            "Escalante Caves - located in Barangay Lamare.",
            "Featured more or less 60 caves in just one setting."
        ],
        [
            "Buko Falls - located in barangay Kahayagan."
        ],
        [
            "Lupisan Falls - located in Barangay Datagan."
        ],
        [
            "Balumbonan Cave - located in barangay Balumbonan."
        ],
        [
            "Every summer, the town was always been the venue of different religious gatherings, including the Regional Youth Camp which is hosted by the Liberty Bible Baptist Church and draws approximately 600 youths from all over the region and several participants from Cebu, Lanao del Norte, and Misamis Occidental.",
            "Another is the GAYEM, hosted by the Seventh-Day Adventist Church and held participants from the Provinces of Zamboanga del Sur and Zamboanga Sibugay."
        ],
        [
            "Culture"
        ],
        [
            "Fiestas and festivals"
        ],
        [
            "Festival dates in Bayog include the following:"
        ],
        [
            "3rd Week of January for the Sinulog sa Kahayagan which features carnivals and street dancings in honor of Sr. Santo Niño."
        ],
        [
            "May 8–10 for the celebration of the Araw ng Bayog."
        ],
        [
            "May 8 for the Tribal Festival which features pageantry between the different tribes which resides in Bayog."
        ],
        [
            "May 9 for the Buklog Festival, a Subanen fertility ritual."
        ],
        [
            "September 17 for the celebration of the Araw ng Zamboanga del Sur."
        ],
        [
            "3rd Week of November for the Feast of St. Joseph the Worker."
        ],
        [
            "Infrastructure"
        ],
        [
            "Bailey Bridge, a 55-meter modular bridge which crosses the Sibuguey River"
        ],
        [
            "Roads"
        ],
        [
            "The total road network of the municipality is 195.42 kilometres (121.43 mi), of which 7.56 kilometres (4.70 mi) are concrete, 133.34 kilometres (82.85 mi) are gravel and 54.52 kilometres (33.88 mi) are dirt roads."
        ],
        [
            "Transport facilities"
        ],
        [
            "Municipal records show that there are 134 registered tricycles/Habal-Habal as of December 2005.",
            "There are 50 privately owned vehicles in the municipality.",
            "There are also passenger buses and jeepneys plying Bayog to Buug, Bayog-Pagadian routes.",
            "To date, there are two buses plying Bayog-Zamboanga Route."
        ],
        [
            "Out of the twenty eight barangays, only two barangays are not accessible by vehicles due to the very poor conditions of their farm to market roads.",
            "Residents utilized horses or carabaos to transport their farm products up to the point where transportation is accessible."
        ],
        [
            "Bridges"
        ],
        [
            "The municipality of Bayog has nine (9) Tulay ng Pangulo projects constructed at Barangays Dipili, Depase, Balunbunan, Depase, Canoayan, Lamare, Bobuan, Depore and Poblacion."
        ],
        [
            "Utilities"
        ],
        [
            "Power"
        ],
        [
            "The electric power of the municipality is supplied by the Zamboanga del Sur Electric Cooperative II (ZAMSURECO II) through its substation in the municipality of Buug, Zamboanga Sibugay.",
            "The municipality has 28 barangays that all are now energized."
        ],
        [
            "Water"
        ],
        [
            "The local government unit of Bayog has its level III water system that supplies the need of the people in the Poblacion & Kahayagan.",
            "The types of water system used in the different barangays are classified into Level 1 (shallow well, deep well & spring) Level II (spring development with communal faucets), and Level III (with individual households connections)."
        ],
        [
            "Government"
        ],
        [
            "Bayog Municipal Government Center"
        ],
        [
            "The municipal compound is located in the heart of the town.",
            "The charred municipal building is in the center, looking over Bayog Municipal Plaza, which featured a Children's Park; a twin fountain which has the town's map drawn on it; a flower field, a priority project of the recent administration; a statue of the National Hero; the famous 30 flagpoles, and the Bayog Trees, which is believed to be the burial site of a Subanen Datu which was considered as the first town's settler."
        ],
        [
            "On its right side, resides the Philippine National Police Headquarters, the Bayog Lawn Tennis Association Court, the Municipal Canteen, the Municipal Motorpool, the SIVAFA Midwife Clinic, and the AFUZS Headquarters."
        ],
        [
            "While on its left sides, stand the ABC Multi-purpose Building, the DILG Office, a session hall, the Bayog Municipal Health Center, and the 3500-seater Municipal Gymnasium."
        ],
        [
            "Along the side of the Municipal Hall, there you can find the Senior Citizen House, the post office, the Office of the Agriculturist, the Department of Transportation and Communication, the Department of Environment and Natural Resources, Department of Social Welfare and Development, the Municipal Day Care Center, the Newly constructed E-Center and the Municipal Swimming Pool."
        ],
        [
            "At its back is the Municipal Nursery, and the Municipal Guest House."
        ],
        [
            "List of former chief executives"
        ],
        [
            "Mayor"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Tenure"
        ],
        [
            "Juan Tagabuen"
        ],
        [
            "Antonio Ejudo"
        ],
        [
            "1967"
        ],
        [
            "Dominador Salomon"
        ],
        [
            "Alfonso Carballo"
        ],
        [
            "1967–1971"
        ],
        [
            "Valentin Cercado"
        ],
        [
            "Felipe Dulatre"
        ],
        [
            "1971–1975"
        ],
        [
            "Valentin Cercado"
        ],
        [
            "Felipe Dulatre"
        ],
        [
            "1971–1980"
        ],
        [
            "Valentin Cercado"
        ],
        [
            "Emercindo Fullo"
        ],
        [
            "1980–1986"
        ],
        [
            "Dominador Salomon"
        ],
        [
            "Frank Mabulay"
        ],
        [
            "1986–1987"
        ],
        [
            "Constantino Belza"
        ],
        [
            "Lydia Lucero"
        ],
        [
            "1987–1988"
        ],
        [
            "Emercindo Fullo"
        ],
        [
            "Melody Belza"
        ],
        [
            "1988–1992"
        ],
        [
            "Melody L. Belza"
        ],
        [
            "Nerrisa Lucero"
        ],
        [
            "1992–1995"
        ],
        [
            "Melody L. Belza"
        ],
        [
            "Frank Mabulay"
        ],
        [
            "1995–1998"
        ],
        [
            "Melody L. Belza"
        ],
        [
            "Baltazar Caberte"
        ],
        [
            "1998–2001"
        ],
        [
            "Mary Ann E. Lucero - Cartalla"
        ],
        [
            "Severo Opay"
        ],
        [
            "2001–2004"
        ],
        [
            "Mary Ann E. Lucero - Cartalla"
        ],
        [
            "Pedro Anlap"
        ],
        [
            "2004–2007"
        ],
        [
            "Mary Ann E. Lucero - Cartalla"
        ],
        [
            "Pedro Anlap"
        ],
        [
            "2007–2010"
        ],
        [
            "Leonardo L. Babasa, Jr."
        ],
        [
            "Romualdo S. Godin"
        ],
        [
            "2010-2013"
        ],
        [
            "Leonardo L. Babasa, Jr."
        ],
        [
            "Celso A. Matias"
        ],
        [
            "2013-2016"
        ],
        [
            "Leonardo L. Babasa, Jr."
        ],
        [
            "Celso A. Matias"
        ],
        [
            "2016-2019"
        ],
        [
            "Celso A. Matias"
        ],
        [
            "Jocel L. Babasa"
        ],
        [
            "2019 - 2022"
        ],
        [
            "Celso A. Matias"
        ],
        [
            "Jocel L. Babasa"
        ],
        [
            "2022 - 2025"
        ],
        [
            "Education"
        ],
        [
            "The town has a college, the Josefina H. Cerilles State College which caters the educational needs of the entire populace and of the neighboring towns.",
            "It offers cheap education to the townfolks.",
            "It has replaced the External Studies Unit of Western Mindanao State University, which for seven years have served the municipality of Bayog and provided the Bayoganos access to higher learning.",
            "Bayog has also four secondary schools, of which Bayog National High School is the most prominent.",
            "There are 33 elementary schools in this town, of which one is a private institution, the Siboguey SDA Elementary School owned by the Seventh-day Adventist Church.",
            "All of the public schools here are networked through an office situated at the Central School."
        ],
        [
            "Sister cities"
        ],
        [
            " Makati"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bayog |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "112: Creating the Municipality of Bayog in the Province of Zamboanga del Sur\".",
            "Official Gazette of the Republic of the Philippines.",
            "Presidential Communications Development and Strategic Planning Office.",
            "October 1, 1964.",
            "Retrieved 24 July 2014."
        ],
        [
            "^ \"R.A. No.",
            "4872: An Act Creating the Municipality of Bayog in the Province of Zamboanga del Sur\".",
            "PhilippineLaw.info.",
            "8 May 1967.",
            "Archived from the original on 30 July 2014.",
            "Retrieved 24 July 2014."
        ],
        [
            "^"
        ],
        [
            "\"Aurora: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 1 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IX (Zamboanga Peninsula)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Zamboanga del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Bayog Profile at PhilAtlas.com"
        ],
        [
            "Official Website of the Municipality of Bayog"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Official Website of the Province of Zamboanga del Sur"
        ],
        [
            "Places adjacent to Bayog"
        ],
        [
            "Godod, Zamboanga del Norte"
        ],
        [
            "Bacungan, Zamboanga del Norte"
        ],
        [
            "Siayan, Zamboanga del Norte"
        ],
        [
            "Kabasalan, Zamboanga Sibugay"
        ],
        [
            "Bayog"
        ],
        [
            "Lakewood"
        ],
        [
            "Siay, Zamboanga Sibugay"
        ],
        [
            "Diplahan, Zamboanga Sibugay / Buug, Zamboanga Sibugay"
        ],
        [
            "Kumalarang"
        ],
        [
            "vte Province of Zamboanga del SurPagadian (capital)  Zamboanga City (largest city)Municipalities"
        ],
        [
            "Aurora"
        ],
        [
            "Bayog"
        ],
        [
            "Dimataling"
        ],
        [
            "Dinas"
        ],
        [
            "Dumalinao"
        ],
        [
            "Dumingag"
        ],
        [
            "Guipos"
        ],
        [
            "Josefina"
        ],
        [
            "Kumalarang"
        ],
        [
            "Labangan"
        ],
        [
            "Lakewood"
        ],
        [
            "Lapuyan"
        ],
        [
            "Mahayag"
        ],
        [
            "Margosatubig"
        ],
        [
            "Midsalip"
        ],
        [
            "Molave"
        ],
        [
            "Pitogo"
        ],
        [
            "Ramon Magsaysay"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pablo"
        ],
        [
            "Sominot"
        ],
        [
            "Tabina"
        ],
        [
            "Tambulig"
        ],
        [
            "Tigbao"
        ],
        [
            "Tukuran"
        ],
        [
            "Vincenzo A. Sagun"
        ],
        [
            "Component city"
        ],
        [
            "Pagadian"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Zamboanga City (Administratively independent and geographically separate from the province but grouped under Zamboanga del Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bayog&oldid=1164184984\""
        ],
        [
            "Category: Municipalities of Zamboanga del SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from July 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textWikipedia articles with style issues from June 2018All articles with style issuesAll articles with unsourced statementsArticles with unsourced statements from January 2019Wikipedia articles with style issues from January 2019All articles with dead external linksArticles with dead external links from October 2016Articles with permanently dead external linksPages using the Kartographer extension"
        ]
    ]
}