{
    "name": "Bayugan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bayugan"
        ],
        [
            "28 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSimple EnglishSvenskaTagalogТатарча / tatarçaاردوTiếng ViệtWinarayDusun Bundu-liwan"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°43′N 125°45′E﻿ / ﻿8.71°N 125.75°E﻿ / 8.71; 125.75"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Component city in Agusan del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Bayugan\" – news · newspapers · books · scholar · JSTOR (April 2014) (Learn how and when to remove this message)"
        ],
        [
            "Component city in Caraga, PhilippinesBayuganComponent cityCity of BayuganNarra Avenue; Lope A. Asis Memorial Gymnasium at night"
        ],
        [
            "SealMap of Agusan del Sur with Bayugan highlightedOpenStreetMapBayuganLocation within the PhilippinesCoordinates: 8°43′N 125°45′E﻿ / ﻿8.71°N 125.75°E﻿ / 8.71; 125.75CountryPhilippinesRegionCaragaProvinceAgusan del SurDistrict"
        ],
        [
            "1st districtFoundedAugust 20, 1961CityhoodJune 21, 2007 (Lost cityhood in 2008 and 2010)Affirmed CityhoodFebruary 15, 2011Barangays43"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorKirk A. Asis • Vice MayorKim Lope A. Asis • RepresentativeAlfelito M. Bascug • City Council"
        ],
        [
            "Members"
        ],
        [
            "Kim A. AsisJonathan D. SayonRizalina B. ParbaAn Janette A. Alonde-RanaCharles P. AnggayongGilbert M. HonculadaCharles C. SalazarFortunato A. Paway IIPrimitivo N. AlimpoosOrlando A. Sevilla"
        ],
        [
            " • Electorate65,245 voters (2022)Area • Revenue₱ 1,208 million (2020) • Assets₱ 4,506 million (2020) • Expenditure₱ 740 million (2020) • Liabilities₱ 470.4 million (2020)Service provider • ElectricityAgusan del Sur Electric Cooperative (ASELCO)Time zoneUTC+8 (PST)ZIP code8502PSGC160301000IDD : area code +63 (0)85Native languagesAgusan Butuanon Cebuano Higaonon TagalogWebsitewww.bayugan.gov.ph"
        ],
        [
            "Bayugan, officially the City of Bayugan (Cebuano: Dakbayan sa Bayugan; Filipino: Lungsod ng Bayugan), is a 5th class component city in the province of Agusan del Sur, Philippines.",
            "According to the 2020 census, it has a population of 109,499 people.."
        ],
        [
            "Gained cityhood through Republic Act No.",
            "9405, it is the only city in the province of Agusan del Sur."
        ],
        [
            "Located at the northern part of Agusan del Sur, Bayugan is the \"cut-flower capital\" of the province owing to its lucrative cut flower industry.",
            "The city's climate, especially in the highland barangays, is conducive to high yield cut-flower production.",
            "The city is also one of the major producers of rice and vegetables in the province, even providing for neighboring municipalities and provinces."
        ],
        [
            "Etymology"
        ],
        [
            "The natives called the area Bayugan since the word bayugan is a Manobo term for pathway.",
            "Another version states that bayug trees used to grow abundantly in the area.",
            "It was also believed that the natives used to make this place their meeting spot and that the means of gathering the inhabitants was by knocking on a hollow piece of wood which they termed as the bayug."
        ],
        [
            "History"
        ],
        [
            "Bayugan was formerly a sitio of Barangay Maygatasan, Esperanza.",
            "Several versions abound on how the sitio got its name.",
            "First, the place was located along the river which served as the pathway of the natives in going to Esperanza."
        ],
        [
            "In 1942, Japanese troops entered Bayugan during the second World War."
        ],
        [
            "In 1945, the town of Bayugan in Southern Agusan was liberated by Filipino soldiers and guerrillas from the Japanese forces occupying the town."
        ],
        [
            "In 1948, the Department of Public Works and Highways conducted a survey for a National Highway that would connect Butuan with Davao City.",
            "Simultaneously, the Bureau of Lands surveyed the places that would be traversed by the proposed road.",
            "Possible town sites were identified and among them was Barangay Maygatasan.",
            "However, part of the National Highway (now the Narra Avenue) passed through the sitio of Bayugan instead of Barangay Maygatasan.",
            "Migrants started settling in the sitio of Bayugan, thus, prompting the transfer of the proposed town site."
        ],
        [
            "In the early part of 1960, the inhabitants led by Mr. Jose Joson passed a resolution creating the sitio of Bayugan into a regular barrio.",
            "In April of that year, Barangay Bayugan was inaugurated with Joson as the Teniente del Barrio.",
            "Brought about by the construction of the National Highway which traversed the place, business activity sprouted rapidly in the area."
        ],
        [
            "A year later, barangay officials led by then Sergio Mullaneda worked out the creation of Bayugan into a regular municipality through the assistance of Governor Democrito O. Plaza, Governor of Agusan.",
            "By virtue of Executive Order No.",
            "440 of then President Carlos P. Garcia, the petition to create the municipality of Bayugan was granted on August 6, 1961.",
            "Mr. Mullaneda, the first appointed Municipal Mayor of Bayugan assumed into office on August 6, 1962, during the term of President Diosdado Macapagal.",
            "In the year 2007 Bayugan was converted to a city."
        ],
        [
            "Bayugan is a transportation highway nexus for the eastern part of Mindanao Island.",
            "Bayugan is now one if not the fastest growing component city in North Eastern Mindanao."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "For further information, see League of Cities of the Philippines v. COMELEC."
        ],
        [
            "Downtown Bayugan"
        ],
        [
            "On July 24, 2006, the congress approved R.A. 9405, an act converting the Municipality of Bayugan into a component city to be known as the City of Bayugan."
        ],
        [
            "But in 2008, the Supreme Court of the Philippines declared the law unconstitutional.",
            "The court ruled that Bayugan, along with the other fifteen cities covered by the law did not meet the requirements for cityhood."
        ],
        [
            "More than a year later, on December 22, 2009, acting favorably on the appeal of the sixteen affected cities, the Supreme Court reversed its earlier ruling.",
            "It deemed that the passage of the amendatory law regarding the criteria for cityhood as set by congress specifically exempting a particular political subdivision therefrom was constitutional.",
            "The court further ruled that congress, in enacting the exempting law, effectively decreased the already codified indicators.",
            "As such, the cityhood status of Bayugan, and the rest of the fifteen local government units was restored."
        ],
        [
            "But again on August 24, 2010, in a 16-page resolution, the court reinstated its November 18, 2008 decision striking down the constitutionality of Republic Act 9405.",
            "Voting 7–6, with two justices abstaining, the court reinstated its decision declaring RA 9405 as unconstitutional."
        ],
        [
            "However, in another twist of fate for Bayugan, the court once again upheld for the third and final time the constitutionality of RA 9405 on February 15, 2011, thereby finalizing the cityhood of Bayugan and the other fifteen municipalities affected by the law.",
            "On July 3, 2011, the court ordered its clerk of court to issue an entry of judgment on the cityhood case, sealing with finality the constitutionality of the law."
        ],
        [
            "After six years of legal battle, in its board resolution, the League of Cities of the Philippines acknowledged and recognized the cityhood of Bayugan and 15 other cities."
        ],
        [
            "Geography"
        ],
        [
            "Bayugan is bordered by the Municipality of Sibagat and the province of Surigao del Sur to the north; the Municipality of Prosperidad to the east; the Municipality of Esperanza to the south; and the Municipality of Las Nieves, Agusan del Norte, to the west."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bayugan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "259.1(10.20)"
        ],
        [
            "236.7(9.32)"
        ],
        [
            "131.5(5.18)"
        ],
        [
            "102.6(4.04)"
        ],
        [
            "104.9(4.13)"
        ],
        [
            "155.8(6.13)"
        ],
        [
            "146.4(5.76)"
        ],
        [
            "103.6(4.08)"
        ],
        [
            "123.1(4.85)"
        ],
        [
            "166.8(6.57)"
        ],
        [
            "166.5(6.56)"
        ],
        [
            "242.7(9.56)"
        ],
        [
            "1,939.7(76.37)"
        ],
        [
            "Average precipitation days"
        ],
        [
            "22"
        ],
        [
            "19"
        ],
        [
            "18"
        ],
        [
            "13"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "18"
        ],
        [
            "16"
        ],
        [
            "16"
        ],
        [
            "19"
        ],
        [
            "21"
        ],
        [
            "24"
        ],
        [
            "221"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "The city is geographically situated below the typhoon belt but is usually affected by depressions forming in the typhoon regions of Visayas and the province of Surigao del Norte.",
            "The climate map of the Philippines based on the modified coronas classification shows that the city falls under Type II.",
            "Which also is the weather classification of the province of Agusan del Sur."
        ],
        [
            "Type II climate has no dry season with very pronounced wet season of heavy precipitation.",
            "Maximum rainfall generally occurs from December to January although there is no single dry month.",
            "Its average monthly rainfall is 161.6 millimetres (6.36 in) and average temperature is 32 °C (90 °F).",
            "Areas characterized by this climate type are generally along or very near the eastern coast thus are open to the north-east monsoon."
        ],
        [
            "Barangays"
        ],
        [
            "Bayugan is politically subdivided into 43 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Currently, there are 3 barangays which classified as urban and 40 are rural."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 160301028   Berseba"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,585"
        ],
        [
            " 1,688"
        ],
        [
            "  ▾"
        ],
        [
            " −0.63%"
        ],
        [
            " 160301029   Bucac"
        ],
        [
            " 3.6%"
        ],
        [
            " 3,918"
        ],
        [
            " 3,367"
        ],
        [
            "  ▴"
        ],
        [
            " 1.53%"
        ],
        [
            " 160301030   Cagbas"
        ],
        [
            " 1.8%"
        ],
        [
            " 1,923"
        ],
        [
            " 1,757"
        ],
        [
            "  ▴"
        ],
        [
            " 0.91%"
        ],
        [
            " 160301001   Calaitan"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,913"
        ],
        [
            " 2,385"
        ],
        [
            "  ▾"
        ],
        [
            " −2.18%"
        ],
        [
            " 160301031   Canayugan"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,156"
        ],
        [
            " 1,167"
        ],
        [
            "  ▾"
        ],
        [
            " −0.09%"
        ],
        [
            " 160301002   Charito"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,549"
        ],
        [
            " 1,529"
        ],
        [
            "  ▴"
        ],
        [
            " 0.13%"
        ],
        [
            " 160301032   Claro Cortez"
        ],
        [
            " 0.7%"
        ],
        [
            " 819"
        ],
        [
            " 654"
        ],
        [
            "  ▴"
        ],
        [
            " 2.27%"
        ],
        [
            " 160301003   Fili"
        ],
        [
            " 2.7%"
        ],
        [
            " 2,949"
        ],
        [
            " 2,923"
        ],
        [
            "  ▴"
        ],
        [
            " 0.09%"
        ],
        [
            " 160301033   Gamao"
        ],
        [
            " 1.0%"
        ],
        [
            " 1,096"
        ],
        [
            " 1,035"
        ],
        [
            "  ▴"
        ],
        [
            " 0.57%"
        ],
        [
            " 160301034   Getsemane"
        ],
        [
            " 0.4%"
        ],
        [
            " 398"
        ],
        [
            " 436"
        ],
        [
            "  ▾"
        ],
        [
            " −0.91%"
        ],
        [
            " 160301035   Grace Estate"
        ],
        [
            " 0.6%"
        ],
        [
            " 677"
        ],
        [
            " 651"
        ],
        [
            "  ▴"
        ],
        [
            " 0.39%"
        ],
        [
            " 160301004   Hamogaway"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,508"
        ],
        [
            " 1,568"
        ],
        [
            "  ▾"
        ],
        [
            " −0.39%"
        ],
        [
            " 160301006   Katipunan"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,225"
        ],
        [
            " 1,135"
        ],
        [
            "  ▴"
        ],
        [
            " 0.77%"
        ],
        [
            " 160301007   Mabuhay"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,730"
        ],
        [
            " 1,750"
        ],
        [
            "  ▾"
        ],
        [
            " −0.11%"
        ],
        [
            " 160301036   Magkiangkang"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,801"
        ],
        [
            " 1,628"
        ],
        [
            "  ▴"
        ],
        [
            " 1.01%"
        ],
        [
            " 160301037   Mahayag"
        ],
        [
            " 0.6%"
        ],
        [
            " 629"
        ],
        [
            " 554"
        ],
        [
            "  ▴"
        ],
        [
            " 1.28%"
        ],
        [
            " 160301009   Marcelina"
        ],
        [
            " 3.5%"
        ],
        [
            " 3,789"
        ],
        [
            " 3,508"
        ],
        [
            "  ▴"
        ],
        [
            " 0.77%"
        ],
        [
            " 160301010   Maygatasan"
        ],
        [
            " 4.4%"
        ],
        [
            " 4,818"
        ],
        [
            " 4,148"
        ],
        [
            "  ▴"
        ],
        [
            " 1.51%"
        ],
        [
            " 160301038   Montivesta"
        ],
        [
            " 0.6%"
        ],
        [
            " 709"
        ],
        [
            " 602"
        ],
        [
            "  ▴"
        ],
        [
            " 1.65%"
        ],
        [
            " 160301039   Mt.",
            "Ararat"
        ],
        [
            " 0.6%"
        ],
        [
            " 684"
        ],
        [
            " 821"
        ],
        [
            "  ▾"
        ],
        [
            " −1.81%"
        ],
        [
            " 160301040   Mt.",
            "Carmel"
        ],
        [
            " 2.2%"
        ],
        [
            " 2,387"
        ],
        [
            " 2,047"
        ],
        [
            "  ▴"
        ],
        [
            " 1.55%"
        ],
        [
            " 160301041   Mt.",
            "Olive"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,509"
        ],
        [
            " 1,501"
        ],
        [
            "  ▴"
        ],
        [
            " 0.05%"
        ],
        [
            " 160301042   New Salem"
        ],
        [
            " 0.5%"
        ],
        [
            " 569"
        ],
        [
            " 663"
        ],
        [
            "  ▾"
        ],
        [
            " −1.52%"
        ],
        [
            " 160301011   Noli"
        ],
        [
            " 3.4%"
        ],
        [
            " 3,712"
        ],
        [
            " 3,380"
        ],
        [
            "  ▴"
        ],
        [
            " 0.94%"
        ],
        [
            " 160301013   Osmeña"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,589"
        ],
        [
            " 1,573"
        ],
        [
            "  ▴"
        ],
        [
            " 0.10%"
        ],
        [
            " 160301014   Panaytay"
        ],
        [
            " 0.6%"
        ],
        [
            " 695"
        ],
        [
            " 624"
        ],
        [
            "  ▴"
        ],
        [
            " 1.08%"
        ],
        [
            " 160301043   Pinagalaan"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,411"
        ],
        [
            " 1,108"
        ],
        [
            "  ▴"
        ],
        [
            " 2.45%"
        ],
        [
            " 160301016   Poblacion"
        ],
        [
            " 14.6%"
        ],
        [
            " 16,010"
        ],
        [
            " 17,596"
        ],
        [
            "  ▾"
        ],
        [
            " −0.94%"
        ],
        [
            " 160301017   Sagmone"
        ],
        [
            " 1.2%"
        ],
        [
            " 1,301"
        ],
        [
            " 1,157"
        ],
        [
            "  ▴"
        ],
        [
            " 1.18%"
        ],
        [
            " 160301018   Saguma"
        ],
        [
            " 2.0%"
        ],
        [
            " 2,215"
        ],
        [
            " 1,937"
        ],
        [
            "  ▴"
        ],
        [
            " 1.35%"
        ],
        [
            " 160301019   Salvacion"
        ],
        [
            " 5.4%"
        ],
        [
            " 5,886"
        ],
        [
            " 5,079"
        ],
        [
            "  ▴"
        ],
        [
            " 1.49%"
        ],
        [
            " 160301044   San Agustin"
        ],
        [
            " 0.6%"
        ],
        [
            " 679"
        ],
        [
            " 613"
        ],
        [
            "  ▴"
        ],
        [
            " 1.03%"
        ],
        [
            " 160301020   San Isidro"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,206"
        ],
        [
            " 1,046"
        ],
        [
            "  ▴"
        ],
        [
            " 1.43%"
        ],
        [
            " 160301045   San Juan"
        ],
        [
            " 3.0%"
        ],
        [
            " 3,307"
        ],
        [
            " 3,391"
        ],
        [
            "  ▾"
        ],
        [
            " −0.25%"
        ],
        [
            " 160301023   Santa Irene"
        ],
        [
            " 3.3%"
        ],
        [
            " 3,651"
        ],
        [
            " 2,820"
        ],
        [
            "  ▴"
        ],
        [
            " 2.62%"
        ],
        [
            " 160301046   Santa Teresita"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,828"
        ],
        [
            " 1,668"
        ],
        [
            "  ▴"
        ],
        [
            " 0.92%"
        ],
        [
            " 160301047   Santo Niño"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,606"
        ],
        [
            " 1,643"
        ],
        [
            "  ▾"
        ],
        [
            " −0.23%"
        ],
        [
            " 160301024   Taglatawan"
        ],
        [
            " 11.7%"
        ],
        [
            " 12,838"
        ],
        [
            " 12,976"
        ],
        [
            "  ▾"
        ],
        [
            " −0.11%"
        ],
        [
            " 160301048   Taglibas"
        ],
        [
            " 0.4%"
        ],
        [
            " 402"
        ],
        [
            " 386"
        ],
        [
            "  ▴"
        ],
        [
            " 0.41%"
        ],
        [
            " 160301049   Tagubay"
        ],
        [
            " 0.8%"
        ],
        [
            " 930"
        ],
        [
            " 749"
        ],
        [
            "  ▴"
        ],
        [
            " 2.19%"
        ],
        [
            " 160301025   Verdu"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,562"
        ],
        [
            " 1,373"
        ],
        [
            "  ▴"
        ],
        [
            " 1.30%"
        ],
        [
            " 160301050   Villa Undayon"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,609"
        ],
        [
            " 1,312"
        ],
        [
            "  ▴"
        ],
        [
            " 2.06%"
        ],
        [
            " 160301027   Wawa"
        ],
        [
            " 1.2%"
        ],
        [
            " 1,334"
        ],
        [
            " 1,413"
        ],
        [
            "  ▾"
        ],
        [
            " −0.57%"
        ],
        [
            "Total"
        ],
        [
            "109,499"
        ],
        [
            "99,361"
        ],
        [
            " ▴"
        ],
        [
            "0.98%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BayuganYearPop.±% p.a.1970 37,816—    1975 43,603+2.90%1980 56,367+5.27%1990 78,725+3.40%1995 89,999+2.54%2000 93,623+0.85%2007 95,032+0.21%2010 99,361+1.63%2015 103,202+0.72%2020 109,499+1.17%Source: Philippine Statistics Authority"
        ],
        [
            "Indigenous people:"
        ],
        [
            "Manobo"
        ],
        [
            "Higaonon"
        ],
        [
            "Banwaon"
        ],
        [
            "Kamayo/Mandaya"
        ],
        [
            "Talaandig"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bayugan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  46.10"
        ],
        [
            "2009  48.43"
        ],
        [
            "2012  35.85"
        ],
        [
            "2015  38.10"
        ],
        [
            "2018  31.50"
        ],
        [
            "2021  31.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The Gaisano Grand Market Place Bayugan"
        ],
        [
            "Products:"
        ],
        [
            "Rice / palay (the major rice production site of Agusan del Sur)"
        ],
        [
            "Cut flowers (abundant in the city making it the cut flower capital of Agusan del Sur)"
        ],
        [
            "Corn"
        ],
        [
            "Coconut"
        ],
        [
            "Banana"
        ],
        [
            "Rubber"
        ],
        [
            "Vegetables"
        ],
        [
            "Legumes"
        ],
        [
            "Cacao"
        ],
        [
            "Coffee"
        ],
        [
            "Citrus"
        ],
        [
            "Root Crops"
        ],
        [
            "Fruits"
        ],
        [
            "Fertile soil suitable for agricultural, Protection Forest About 26,107.163 Hectares = 51.697% in land classifications.",
            "Gold, silver, sand and gravel."
        ],
        [
            "Government"
        ],
        [
            "Bayugan City Hall in the background"
        ],
        [
            "City officials"
        ],
        [
            "Elected city officials 2019–present:"
        ],
        [
            "Executive:"
        ],
        [
            "Mayor: Kirk A. Asis"
        ],
        [
            "Vice Mayor: Kim Lope A. Asis"
        ],
        [
            "Legislative:"
        ],
        [
            "City councilors:"
        ],
        [
            "Kim \"Tata\" Asis"
        ],
        [
            "Dionril \"Balong\" Salvan"
        ],
        [
            "Rizalina B. Parba"
        ],
        [
            "Anjannette \"Badat\" Alonde-Rana"
        ],
        [
            "Charles P. Anggayong"
        ],
        [
            "Fortunato \"Jun\" Paway II"
        ],
        [
            "Jonathan D. Sayon"
        ],
        [
            "Teresito \"Terry\" Abastillas"
        ],
        [
            "Allan R. Cogollodo"
        ],
        [
            "Primitivo N. Alimpoos"
        ],
        [
            "Barangay council"
        ],
        [
            "Association of Baragay Councils (Liga ng mga Barangay):"
        ],
        [
            "President - Eleony G. Estrera (Barangay Gethsemane)"
        ],
        [
            "Vice President - Vacant position"
        ],
        [
            "Tourism"
        ],
        [
            "Bayugan Rotunda"
        ],
        [
            "Pinagalaan (Bayug/Hamogaway) Falls"
        ],
        [
            "Narra Avenue"
        ],
        [
            "Wawa Bridge"
        ],
        [
            "Meteor Garden"
        ],
        [
            "Gethsemane Falls"
        ],
        [
            "Santa Irene Overview"
        ],
        [
            "Andanan/Wawa River and Irrigation System"
        ],
        [
            "Family Place Resort"
        ],
        [
            "Green Haven Adventure Farm"
        ],
        [
            "Mangrove Base Park"
        ],
        [
            "ARC Bayugan"
        ],
        [
            "Graceland Cold Spring"
        ],
        [
            "Magkiangkang Cave"
        ],
        [
            "New Loon Cave"
        ],
        [
            "San Agustin Lake"
        ],
        [
            "Putting Bato Cave"
        ],
        [
            "Katipunan Lake"
        ],
        [
            "Vising/Sisimon Cave"
        ],
        [
            "Rizal Park Plaza"
        ],
        [
            "Bayugan City Hall"
        ],
        [
            "Sacred Heart of Jesus Parish Church"
        ],
        [
            "San Lorenzo Ruiz Diocesan Shrine"
        ],
        [
            "Ziram Garden"
        ],
        [
            "Sisa Theme Nature Park"
        ],
        [
            "Culture"
        ],
        [
            "Local festivals and events"
        ],
        [
            "Kahimunan tu Bayugan Festival, Holy Child - A local version of the Sinulog Festival of Cebu, it is highlighted by street dancing focusing on the indigenous tribes' of Bayugan and their way of life.",
            "Celebrated every Last Sunday of January."
        ],
        [
            "Sacred Heart of Jesus Festival – Popularly known as the town fiesta or \"pista\", celebrated every June 30."
        ],
        [
            "Rice Corn and Flower Festival - A new born festival replacing the traditional \"Araw ng Bayugan\" and is a celebration of the abundant harvest of crops of farmers in the city.",
            "The name of the festival is coined from the nickname of the city (City of Rice, Corn, and Flowers).",
            "It highlights street dancing and float contests."
        ],
        [
            "Charter Day Celebration- Held every June 21 to commemorate the city-hood of Bayugan."
        ],
        [
            "Infrastructure"
        ],
        [
            "Communications"
        ],
        [
            "The Philippine Long Distance Telephone Company provides fixed line services.",
            "Wireless mobile communications services are provided by Smart Communications and Globe Telecommunications."
        ],
        [
            "Transportation"
        ],
        [
            "Major transportation around the vicinity of the city are Motorela/Tricycle and some multicabs which travel to remote barangays.",
            "\"Habal-habal\" is also used as a transport to the mountain barangays of Bayugan."
        ],
        [
            "Accessibility"
        ],
        [
            "By air"
        ],
        [
            "Butuan Airport: Butuan has the nearest airport from Bayugan."
        ],
        [
            "Davao Airport: From Manila or Cebu to Davao City as transit point."
        ],
        [
            "Surigao Airport: From Manila or Cebu to Surigao City as transit point."
        ],
        [
            "By land"
        ],
        [
            "Bayugan can be reached via land transport.",
            "Davao Metro Shuttle, Bachelor Express, Land Car Inc., and Surigao Express are only few bus companies travelling to and from the city.",
            "Buses are serving routes from Davao City, Butuan, Surigao City, and Bislig.",
            "Philtranco and PP Bus Line serving Pasay/Cubao via Butuan or Davao are also available."
        ],
        [
            "Accredited Transport Cooperative as of January 2021:"
        ],
        [
            "Agusan Sur Transport Service Cooperative"
        ],
        [
            "By sea"
        ],
        [
            "Inter-island vessels Cokaliong Shipping Lines, 2-Go and TransAsia Shipping Lines ply the Cebu-Nasipit routes on regular schedules with Nasipit Port as transit point.",
            "Multi-cabs and buses are available at the wharf going to Butuan Integrated Terminal for the regular bus trips to Bayugan."
        ],
        [
            "Education"
        ],
        [
            "Agusan del Sur College, a private college institution in Bayugan."
        ],
        [
            "Agusan del Sur Pilot Laboratory School, or commonly known as ADSPILS, is a Public Elementary School.",
            "ADSPILS is the only Special Science Elementary School in the city.",
            "The school has about 600 pupils with over 3 sections in each grade, Science Class, Best Class and Crack."
        ],
        [
            "Bayugan National Comprehensive High School, or BNCHS, is a comprehensive high school with a population of about six thousand students, and is located on a site that has an area of 5 hectares.",
            "The school is currently recognized for its research program in science related topics.",
            "\"Comprehensive\" it is because it offers different curricula such as ESEP (Engineering and Science Education Program), Special Program in Journalism (pilot school for journalism in Caraga Region), Special Program in the Arts (with the specialization of Visual Arts, Creative Writing, Dancing, Music, Media Arts and Theater Arts), Technical Vocational Courses, Special Program in Sports and Revised Basic Education Curriculum."
        ],
        [
            "Agusan del Sur College or ADSCO established in 1966, is the only private educational institution in the city offering Preparatory, Elementary, High School, College (CHED) degree courses i.e.",
            "Bachelor of Science in Business Administration (BSBA) major in : Marketing Management, Financial Management, Operation Management, Bachelor of Secondary Education, Bachelor of Elementary Education, Bachelor of Arts major in English, Associate in Computer Secretarial, Bachelor of Science in Hotel and Restaurant Management (by year 2011) and TESDA programs like Health Care Services NC II, Computer Hardware Servicing NC II, Shielded Metal Arc Welding (SMAW) NC II, Driving NC II, Security Services NC II, Massage Therapy NC II, Housekeeping, Commercial Cooking NC II, Bookkeeping NC II."
        ],
        [
            "Father Saturnino Urios University (formerly Father Urios Technical Institute of Bayugan Inc. or FUTIBI), is the oldest private educational institution in the city.",
            "Located at the heart of the city making it one of the most populous school in Bayugan.",
            "Created in the year 1959, Urios caters elementary and secondary basic education.",
            "By school year 2010–2011, Urios will be putting up its technical courses.",
            "The school was founded by a Jesuit priest Father Atanasio B.",
            "De Castro in 1959.",
            "The school is currently headed by Mrs. Chereil C. Martel (Principal) and Fr.",
            "Roberto Butawan (School Director)."
        ],
        [
            "Sister cities"
        ],
        [
            " Butuan, Philippines"
        ],
        [
            " Davao City, Philippines"
        ],
        [
            " Makati, Philippines"
        ],
        [
            " Cebu City, Philippines"
        ],
        [
            "Gallery"
        ],
        [
            "A flower float during the float contest of the Rice Corn and Flower Festival."
        ],
        [
            "Narra Avenue has been a transportation nexus in Mindanao"
        ],
        [
            "The highlands of Bayugan.",
            "This is seen from the Santa Irene Overview."
        ],
        [
            "Bayugan City Division of the Department of Education."
        ],
        [
            "Bayugan Rizal Park Plaza"
        ],
        [
            "References"
        ],
        [
            "^  City of Bayugan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Republic Act No.",
            "9405\".",
            "officialgazette."
        ],
        [
            "^ \"City of Bayugan\"."
        ],
        [
            "^ Republic Act 9405"
        ],
        [
            "^ \"Municipal: Bayugan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Caraga\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Caraga\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Agusan del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Accredited Transport Cooperatives as of January 2021\" (PDF).",
            "Office of Transportation Cooperatives.",
            "January 2021."
        ],
        [
            "External links"
        ],
        [
            "Philippines portal"
        ],
        [
            "Wikimedia Commons has media related to Bayugan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "A History of Bayugan at the Agusan–Surigao Historical Archive"
        ],
        [
            " Archived August 7, 2016, at the Wayback Machine"
        ],
        [
            "Municipality of Bayugan Official Website"
        ],
        [
            "Places adjacent to Bayugan"
        ],
        [
            "Sibagat"
        ],
        [
            "Lanuza, Surigao del SurTandag, Surigao del Sur"
        ],
        [
            "SibagatButuan"
        ],
        [
            "Bayugan"
        ],
        [
            "San Miguel, Surigao del Sur"
        ],
        [
            "Las Nieves, Agusan del Norte"
        ],
        [
            "Esperanza"
        ],
        [
            "Prosperidad"
        ],
        [
            "Articles Related to Bayugan"
        ],
        [
            "vte Province of Agusan del SurProsperidad (capital)Municipalities"
        ],
        [
            "Bunawan"
        ],
        [
            "Esperanza"
        ],
        [
            "La Paz"
        ],
        [
            "Loreto"
        ],
        [
            "Prosperidad"
        ],
        [
            "Rosario"
        ],
        [
            "San Francisco"
        ],
        [
            "San Luis"
        ],
        [
            "Santa Josefa"
        ],
        [
            "Sibagat"
        ],
        [
            "Talacogon"
        ],
        [
            "Trento"
        ],
        [
            "Veruela"
        ],
        [
            "Component city"
        ],
        [
            "Bayugan"
        ],
        [
            "vteCaraga Administrative Region (Region XIII)Regional center"
        ],
        [
            "Butuan"
        ],
        [
            "Provinces"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Butuan"
        ],
        [
            "Component cities"
        ],
        [
            "Bayugan"
        ],
        [
            "Bislig"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Surigao City"
        ],
        [
            "Tandag"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Prosperidad"
        ],
        [
            "San Jose"
        ],
        [
            "Surigao City"
        ],
        [
            "Tandag"
        ],
        [
            "Municipalities"
        ],
        [
            "Alegria"
        ],
        [
            "Bacuag"
        ],
        [
            "Barobo"
        ],
        [
            "Basilisa"
        ],
        [
            "Bayabas"
        ],
        [
            "Buenavista"
        ],
        [
            "Bunawan"
        ],
        [
            "Burgos"
        ],
        [
            "Cagdianao"
        ],
        [
            "Cagwait"
        ],
        [
            "Cantilan"
        ],
        [
            "Carmen (Agusan del Norte)"
        ],
        [
            "Carmen (Surigao del Sur)"
        ],
        [
            "Carrascal"
        ],
        [
            "Claver"
        ],
        [
            "Cortes"
        ],
        [
            "Dapa"
        ],
        [
            "Del Carmen"
        ],
        [
            "Dinagat"
        ],
        [
            "Esperanza"
        ],
        [
            "General Luna"
        ],
        [
            "Gigaquit"
        ],
        [
            "Hinatuan"
        ],
        [
            "Jabonga"
        ],
        [
            "Kitcharao"
        ],
        [
            "La Paz"
        ],
        [
            "Lanuza"
        ],
        [
            "Las Nieves"
        ],
        [
            "Lianga"
        ],
        [
            "Libjo"
        ],
        [
            "Lingig"
        ],
        [
            "Loreto (Agusan del Sur)"
        ],
        [
            "Loreto (Dinagat Islands)"
        ],
        [
            "Madrid"
        ],
        [
            "Magallanes"
        ],
        [
            "Mainit"
        ],
        [
            "Malimono"
        ],
        [
            "Marihatag"
        ],
        [
            "Nasipit"
        ],
        [
            "Pilar"
        ],
        [
            "Placer"
        ],
        [
            "Prosperidad"
        ],
        [
            "Remedios T. Romualdez"
        ],
        [
            "Rosario"
        ],
        [
            "San Agustin"
        ],
        [
            "San Benito"
        ],
        [
            "San Francisco (Agusan del Sur)"
        ],
        [
            "San Francisco (Surigao del Norte)"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Luis"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Josefa"
        ],
        [
            "Santa Monica"
        ],
        [
            "Santiago"
        ],
        [
            "Sibagat"
        ],
        [
            "Sison"
        ],
        [
            "Socorro"
        ],
        [
            "Tagana-an"
        ],
        [
            "Tagbina"
        ],
        [
            "Tago"
        ],
        [
            "Talacogon"
        ],
        [
            "Trento"
        ],
        [
            "Tubajon"
        ],
        [
            "Tubay"
        ],
        [
            "Tubod"
        ],
        [
            "Veruela"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bayugan&oldid=1234126163\""
        ],
        [
            "Categories: Cities in CaragaPopulated places in Agusan del SurPopulated places established in 19611961 establishments in the PhilippinesComponent cities in the PhilippinesPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse mdy dates from July 2022Articles needing additional references from April 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Filipino-language textAll articles with unsourced statementsArticles with unsourced statements from November 2014Commons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}