{
    "name": "Binalonan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Binalonan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°03′N 120°36′E﻿ / ﻿16.05°N 120.6°E﻿ / 16.05; 120.6"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pangasinan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Binalonan\" – news · newspapers · books · scholar · JSTOR (November 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesBinalonanMunicipalityMunicipality of BinalonanTown hall"
        ],
        [
            "FlagSealAnthem: Binalonan HymnMap of Pangasinan with Binalonan highlightedOpenStreetMapBinalonanLocation within the PhilippinesCoordinates: 16°03′N 120°36′E﻿ / ﻿16.05°N 120.6°E﻿ / 16.05; 120.6CountryPhilippinesRegionIlocos RegionProvincePangasinanDistrict"
        ],
        [
            "5th districtFoundedFebruary 18, 1872Barangays24"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRamon Ronald V. Guico IV • Vice MayorBryan Louie Ramirez Balangue • RepresentativeRamon Guico Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Glory Jovelyn G. ManaoisJosephine D. CaburnayNoel Apolinario O. BautistaBryan Louie R. BalangueBryan B. GotocJerry J. AradanasLorenzo R. TamboErnesto T. Buquing"
        ],
        [
            " • Electorate40,141 voters (2022)Area • Revenue₱ 274.5 million (2020) • Assets₱ 864.6 million (2020) • Expenditure₱ 207.3 million (2020) • Liabilities₱ 251.4 million (2020)Service provider • ElectricityPangasinan 3 Electric Cooperative (PANELCO 3)Time zoneUTC+8 (PST)ZIP code2436PSGC015512000IDD : area code +63 (0)75Native languagesPangasinan Ilocano TagalogWebsitewww.binalonan.gov.ph"
        ],
        [
            "Binalonan, officially the Municipality of Binalonan (Pangasinan: Baley na Binalonan; Ilocano: Ili ti Binalonan; Tagalog: Bayan ng Binalonan), is a 1st class municipality in the province of Pangasinan, Philippines.",
            "According to the 2020 census, it has a population of 56,382 people."
        ],
        [
            "One of Binalonan's natives is the Filipino-American writer Carlos Bulosan, who wrote brief descriptions of the town's history and people in his semi-autobiographical novel entitled America is in the Heart.",
            "The town has a memorial and street named after him just north of the municipal hall and town market.",
            "It is also the hometown of Evangelina Guico Macaraeg Macapagal, spouse of 9th President Diosdado Macapagal, and mother of 14th President Gloria Macapagal Arroyo."
        ],
        [
            "History"
        ],
        [
            "According to historians, the town's name is an evolution of the Pangasinan Language term balon, which means \"packed lunch\", or in Tagalog, baon."
        ],
        [
            "In a traditional story, which now plays an important role in the town's history, the area was originally owned by a Spaniard named Don Salvador.",
            "It was told that he instructed his men to put up crude wooden fences along the property to establish his ownership.",
            "During the course of their work, Don Salvador's men used to have their lunch and rest under Camachile trees located in the center of the land mainly due to its breezy shades."
        ],
        [
            "Don Salvador offered his pastureland to several immigrants from Ilocos.",
            "When they asked Don Salcador how they were going to find the said land, the owner answered: \"It is the place where people bring their balon to eat\".",
            "Hence the term Binnalonan, which in Ilocano and Pangasinan means \"a place where people bring and eat their baon\", was born.",
            "At present, the town is called Binalonan while its people are known as Binalonians."
        ],
        [
            "Ilocano herdsmen and laborers composed the first town which was founded in 1838, in San Felipe, which was later transferred to Santa Catalina, then returned to the present site."
        ],
        [
            "Geography"
        ],
        [
            "Binalonan is located in the eastern part of the province of Pangasinan.",
            "The Municipality is bordered on the north by the municipalities of Pozorrubio and Sison, on the south by Urdaneta, on the east by San Manuel and Asingan and on the west by Laoac."
        ],
        [
            "It is 51 kilometres (32 mi) from Lingayen and 190 kilometres (120 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Binalonan is subdivided into 24 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Balangobong"
        ],
        [
            "Bued"
        ],
        [
            "Bugayong"
        ],
        [
            "Camangaan"
        ],
        [
            "Canarvacanan"
        ],
        [
            "Capas"
        ],
        [
            "Cili"
        ],
        [
            "Dumayat"
        ],
        [
            "Linmansangan"
        ],
        [
            "Mangcasuy"
        ],
        [
            "Moreno"
        ],
        [
            "Pasileng Norte"
        ],
        [
            "Pasileng Sur"
        ],
        [
            "Poblacion"
        ],
        [
            "San Felipe Central"
        ],
        [
            "San Felipe Sur"
        ],
        [
            "San Pablo"
        ],
        [
            "Sta.",
            "Catalina"
        ],
        [
            "Sta.",
            "Maria Norte"
        ],
        [
            "Santiago"
        ],
        [
            "Sto.",
            "Niño"
        ],
        [
            "Sumabnit"
        ],
        [
            "Tabuyoc"
        ],
        [
            "Vacante"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Binalonan, Pangasinan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "13.6(0.54)"
        ],
        [
            "10.4(0.41)"
        ],
        [
            "18.2(0.72)"
        ],
        [
            "15.7(0.62)"
        ],
        [
            "178.4(7.02)"
        ],
        [
            "227.9(8.97)"
        ],
        [
            "368(14.5)"
        ],
        [
            "306.6(12.07)"
        ],
        [
            "310.6(12.23)"
        ],
        [
            "215.7(8.49)"
        ],
        [
            "70.3(2.77)"
        ],
        [
            "31.1(1.22)"
        ],
        [
            "1,766.5(69.56)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3"
        ],
        [
            "2"
        ],
        [
            "2"
        ],
        [
            "4"
        ],
        [
            "14"
        ],
        [
            "16"
        ],
        [
            "23"
        ],
        [
            "21"
        ],
        [
            "24"
        ],
        [
            "15"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "140"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Land classification"
        ],
        [
            "The municipality's total land area, estimated at 8,400 hectares (84 km2), is classified as alienable and disposable land."
        ],
        [
            "Rivers"
        ],
        [
            "Binalonan has two major rivers:"
        ],
        [
            "Aloragat River"
        ],
        [
            "Tagamusing River"
        ],
        [
            "It also has minor rivers, including the San Pablo Creek, Tuboy River, Palma Creek, the Camambogan Creek and Balisa Creek."
        ],
        [
            "Soil type"
        ],
        [
            "There are five types of soil which can be found in Binalonan:  the San Manuel fine sandy loam, San Manuel loam, San Manuel sandy loam, San Manuel clay, and Umingan sandy loam."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BinalonanYearPop.±% p.a.1903 14,603—    1918 17,392+1.17%1939 19,736+0.60%1948 23,361+1.89%1960 25,651+0.78%1970 32,441+2.37%1975 34,726+1.37%1980 35,574+0.48%1990 43,839+2.11%1995 44,490+0.28%2000 48,967+2.08%2007 52,722+1.02%2010 52,832+0.08%2015 54,555+0.61%2020 56,382+0.65%Source: Philippine Statistics Authority"
        ],
        [
            "The urban population is recorded at 7,634 while the rural population is at 45,088.",
            "The urban-rural population ratio is estimated at 15/100.",
            "The male-to-female ratio is 1.029."
        ],
        [
            "RELIGIONS in the MUNICIPALITY"
        ],
        [
            "Roman Catholic,"
        ],
        [
            "IFI The Philippine Independent Church ,"
        ],
        [
            "IGLESIA NI CRISTO  the increasing members   throughout the municipality (3 locale chapels one biggest at Binalonan Crossing , at San Felipe Central , Sitio Riverside at Brgy.Sumabnit , one at Moreno and San Pablo )"
        ],
        [
            "and Other Protestant denominations"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Binalonan"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  17.30"
        ],
        [
            "2009  14.80"
        ],
        [
            "2012  7.78"
        ],
        [
            "2015  8.82"
        ],
        [
            "2018  6.92"
        ],
        [
            "2021  13.50"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Binalonan, belonging to the fifth congressional district of the province of Pangasinan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Municipal seal"
        ],
        [
            "The Binalonan Municipal Seal"
        ],
        [
            "The topmost structure depicted on the municipal seal is an image of the municipality's Municipal Hall.",
            "Below it on the left is a depiction of the antenna of Digital Communications, the center of communications for Regions I, II and CAR."
        ],
        [
            "Beside the antenna is a representation of a subsidiary source of income in Binalonan: the raising of chickens and hogs.",
            "At the bottom, the left image is that of rice stalks, the municipality's main product.",
            "Beside it is the picture of a sugar cane, which is the main ingredient for Binalonan's top products — basi, suka and muskuvado (brown sugar).",
            "The shield encasing these images means that Binalonan is under the province of Pangasinan."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Ramon V. Guico III"
        ],
        [
            "Mayor"
        ],
        [
            "Ramon N. Guico Jr."
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Melicio F. Patague II"
        ],
        [
            "Councilors"
        ],
        [
            "Glory Jovelyn G. Manaois"
        ],
        [
            "Josephine D. Caburnay"
        ],
        [
            "Noel Apolinario O. Bautista"
        ],
        [
            "Bryan Louie R. Balangue"
        ],
        [
            "Ryan G. Gotoc"
        ],
        [
            "Jerry J. Aradanas"
        ],
        [
            "Lorenzo R. Tambo"
        ],
        [
            "Ernesto T. Buquing"
        ],
        [
            "Tourism"
        ],
        [
            "Binalonan Rock Garden defines the town with century-old acacia trees guarding the walking pavements, benches, Balikbayan Hall, basketball court and the pathway towards the historic Santo Niño Parish Church."
        ],
        [
            "The town's interesting points include:"
        ],
        [
            "The Santo Niño Parish Church is the town's landmark and Spanish colonial architectural legacy"
        ],
        [
            "Mount Paldingan Stations of the Cross in Barangay Santa Catalina"
        ],
        [
            "The town has a central transport terminal, a Bagsakan Center (wholesale trade) library and community eCenter"
        ],
        [
            "The New Market Shed and Food Terminal were opened on 27 September 2012"
        ],
        [
            "The Binalonan Airfield and Binalonan airport"
        ],
        [
            "Balon-Balon Festival and Fiesta"
        ],
        [
            "Rupertos Inland Resort"
        ],
        [
            "Balangobong field"
        ],
        [
            "Binalonan Fiesta - vibrant festival with various activities and street performers"
        ],
        [
            "Parish of the Holy Child Church"
        ],
        [
            "1841 Parish of the Holy Child Church"
        ],
        [
            "The 1841 (19th century architecture) Santo Niño Parish Church, in under the jurisdiction of the Roman Catholic Archdiocese of Lingayen-Dagupan, Roman Catholic Diocese of Urdaneta.",
            "Its Feast Day is 3rd Sunday of January, with Parish Priest, Father Elisar Christopher M. Itchon and Parochial Vicar, Father Jun G. Laya and Vicar Forane, Father Elpidio F. Silva Jr."
        ],
        [
            "Fr.",
            "Julian Izaga founded San Felipe, the origin of the Church and town freed from Manaoag since 1834, and moved to Santa Catalina, where he built church and a convent of light materials.",
            "Fr.",
            "Ramon Fernandez transferred the town in 1938 to the present site.."
        ],
        [
            "The Dominicans founded Binalonan Parish in 1841, under Kura Paroko, Fr.",
            "Domingo Llue and then, by Fr,.",
            "Policarpio Illana who began construction of the Church in 1842."
        ],
        [
            "Fr.",
            "Antonio Vinelas erected in 1855 a bigger church, with Fr.",
            "Ruperto Alarcon's construction in 1861.",
            "Fr.",
            "Juan Fernandez (1861-1865) built a provisional church.",
            "In 1866–1873, Fr.",
            "Felix Cantador added old convent walls, while Fr.",
            "P.del Campo finished the Church.",
            "In 1879,"
        ],
        [
            "The October 19, 1881 typhoon destroyed the 1879 Church.",
            "Father Silvestre Fernandez added the 3 naves rehabilitation due to the earthquake of 1882.",
            "The Church was placed under the ecclesiastical jurisdiction of El Santisimo Nombre de Jesus.",
            "In the Hispano-American War the church was destroyed."
        ],
        [
            "After the 1898 Revolution, Fr.",
            "Mariano Pacis became the Pastor of Manaoag and Binalonan, but it was Fr.",
            "Pio Mabutas who finished the Church in 1930.",
            "The Japanese destroyed the Church except the miraculous image of Santo Niño."
        ],
        [
            "Fr.",
            "Pablo Evangelista rehabilitated the Church in 1946 and Fr.",
            "Leon Bitanga reconstructed in until 1961, founding the Holy Child Academy."
        ],
        [
            "It was only on January 30, 2008, that the Church's marker was imposed upon generous donations of New York and New Jersey Binalonans (Joey and Remy Castelo-Sellona and Drs.",
            "Jose and Violy Quintos.",
            "(Source: Church marker, 2008)."
        ],
        [
            "Infrastructure"
        ],
        [
            "Healthcare"
        ],
        [
            "Hospitals:"
        ],
        [
            "Rural Health Unit/Centers: 8"
        ],
        [
            "Barangay Health Stations: 24"
        ],
        [
            "Malnutrition Rate: 9.06%"
        ],
        [
            "Severely Underweight: 1.17%"
        ],
        [
            "Moderately Underweight: 7.88%"
        ],
        [
            "No.",
            "of Day Care Workers: 29"
        ],
        [
            "No.",
            "of Day Care Centers: 29"
        ],
        [
            "No.",
            "of Day Care Children: 544"
        ],
        [
            "Contraceptive Prevalence Rate: 51%"
        ],
        [
            "Sanitation"
        ],
        [
            "Surveys show that 8,238 homes in Binalonan have water-sealed sewer/septic tank toilets which are used exclusively by members of the household."
        ],
        [
            "Garbage is disposed of through burning."
        ],
        [
            "Education"
        ],
        [
            "Elementary"
        ],
        [
            "Secondary"
        ],
        [
            "Number of schools"
        ],
        [
            "Government"
        ],
        [
            "22"
        ],
        [
            "6"
        ],
        [
            "Private"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "Total enrollment"
        ],
        [
            "Government"
        ],
        [
            "7,376"
        ],
        [
            "3,729"
        ],
        [
            "Private"
        ],
        [
            "919"
        ],
        [
            "113"
        ],
        [
            "Number of teachers"
        ],
        [
            "287"
        ],
        [
            "169"
        ],
        [
            "Number of classrooms"
        ],
        [
            "295"
        ],
        [
            "109"
        ],
        [
            "Other education centers include the WCC Aeronautical and Technological College (World Citi Colleges, (WCC) Aviation Company), an expansive facility which contains the Binalonan Airfield), St. Michael de Archangel College, Manantan Technical School, Holy Child Academy parochial school and Juan G. Macaraeg National High School."
        ],
        [
            "WCC Aeronautical and Technological College, the aeronautical school that sits at the heart of Binalonan, Pangasinan."
        ],
        [
            "Culture"
        ],
        [
            "See also: Carlos Bulosan and America is in the Heart"
        ],
        [
            "Binalonan figures prominently in the novel America is in the Heart by Filipino-American writer Carlos Bulosan, who was born in Binalonan.",
            "The first part of the semi-autobiographical novel features the struggles of Allos, the novel's main character, as he grows up as the son of a peasant farmer in Binalonan.",
            "The town has a memorial and street named after Bulosan just north of the municipal hall and town market."
        ],
        [
            "Notable personalities"
        ],
        [
            "Notable people who either were born or resided in Binalonan include:"
        ],
        [
            "Carlos Bulosan, Filipino-American writer best known for the novel America is in the Heart"
        ],
        [
            "Eva Macapagal, spouse of 9th President Diosdado Macapagal, and mother of 14th President Gloria Macapagal Arroyo."
        ],
        [
            "Leo Soriano - former bishop of United Methodist Church in the Philippines (2000-2012)."
        ],
        [
            "Gallery"
        ],
        [
            "1960 Gate and the Town Hall"
        ],
        [
            "Most beautiful Park, 1968"
        ],
        [
            "Highway"
        ],
        [
            "Public Market"
        ],
        [
            "Business Center"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Binalonan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c Binalonan, the next university town"
        ],
        [
            "^ \"Binalonan | The Official Website of the Province of Pangasinan and its People\".",
            "Archived from the original on 2017-03-02.",
            "Retrieved 2012-12-20."
        ],
        [
            "^"
        ],
        [
            "\"Binalonan, Pangasinan: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 26 September 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Pangasinan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 7, 2022."
        ],
        [
            "^ \"List of Parishes of the Roman Catholic Diocese of Urdaneta | Philippine Churches\".",
            "Archived from the original on 2014-10-06.",
            "Retrieved 2012-12-20."
        ],
        [
            "^ Capital of Pangasinan: All Churches in Pangasinan"
        ],
        [
            "^ Santo Niño Parish Church"
        ],
        [
            "^ a b List of Catholic Dioceses in Asia | Asian Catholic Directory | Ucanews Archived September 4, 2012, at the Wayback Machine"
        ],
        [
            "^ Archdiocese of Lingayen-Dagupan Archived February 2, 2014, at the Wayback Machine"
        ],
        [
            "^ \"Archdiocese of Lingayen-Dagupan: Vicariate of Santo Tomas de Aquino\".",
            "Archived from the original on 2016-03-10.",
            "Retrieved 2012-12-20."
        ],
        [
            "^ \"Archdiocese of Lingayen-Dagupan\".",
            "Archived from the original on 2016-05-15.",
            "Retrieved 2012-12-20."
        ],
        [
            "^ Cathedral of Our Lady of the Immaculate Conception, Urdaneta City, Pangasinan, Philippines"
        ],
        [
            "^ \"Diocese of Urdaneta\".",
            "Archived from the original on 2004-03-27.",
            "Retrieved 2012-12-20."
        ],
        [
            "^ \"Mayor flies high - Manila Standard Today\".",
            "Archived from the original on 28 January 2013."
        ],
        [
            "^ Town mayor leads dynamic business with heart for public service | Business As Usual, Business Features, The Philippine Star | philstar.com"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Binalonan."
        ],
        [
            "Official website"
        ],
        [
            "Binalonan Profile at PhilAtlas.com"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Binalonan at the Pangasinan Government Website Archived 2017-03-02 at the Wayback Machine"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Binalonan"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Sison"
        ],
        [
            "Laoac"
        ],
        [
            "Binalonan"
        ],
        [
            "San Manuel"
        ],
        [
            "Urdaneta"
        ],
        [
            "Asingan"
        ],
        [
            "vte Province of PangasinanLingayen (capital)  San Carlos City (largest city)Municipalities"
        ],
        [
            "Agno"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Anda"
        ],
        [
            "Asingan"
        ],
        [
            "Balungao"
        ],
        [
            "Bani"
        ],
        [
            "Basista"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos"
        ],
        [
            "Calasiao"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lingayen"
        ],
        [
            "Mabini"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Natividad"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Rosales"
        ],
        [
            "San Fabian"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Quintin"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sison"
        ],
        [
            "Sual"
        ],
        [
            "Tayug"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "San Carlos"
        ],
        [
            "Urdaneta"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan (Administratively independent from the province but grouped under Pangasinan by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Pangasinan"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Binalonan&oldid=1223183286\""
        ],
        [
            "Category: Municipalities of PangasinanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataArticles needing additional references from November 2012All articles needing additional referencesCoordinates on WikidataArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textCommons category link from WikidataArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}