{
    "name": "Bingawan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bingawan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°14′N 122°34′E﻿ / ﻿11.23°N 122.57°E﻿ / 11.23; 122.57"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "Municipality in Western Visayas, PhilippinesBingawanMunicipalityMunicipality of Bingawan"
        ],
        [
            "FlagMap of Iloilo with Bingawan highlightedOpenStreetMapBingawanLocation within the PhilippinesCoordinates: 11°14′N 122°34′E﻿ / ﻿11.23°N 122.57°E﻿ / 11.23; 122.57CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "3rd districtBarangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMark P. Palabrica • Vice MayorTed Peter P. Plagata • RepresentativeLorenz R. Defensor • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Elizabeth C. OcceñaJoy L. QuimbaWennie P. JavellanaLonylon F. FaldasEleuterio C. Patriarca Jr.Juliet P. PatronaLucia S. PendiodayEduardo A. Dalipe"
        ],
        [
            " • Electorate10,083 voters (2022)Area • Revenue₱ 92.31 million (2020) • Assets₱ 231 million (2020) • Expenditure₱ 90.23 million (2020) • Liabilities₱ 61.44 million (2020)Service provider • ElectricityIloilo 2 Electric Cooperative (ILECO 2)Time zoneUTC+8 (PST)ZIP code5041PSGC063010000IDD : area code +63 (0)33Native languagesKaray-a Hiligaynon Capisnon TagalogWebsitewww.bingawan.gov.ph"
        ],
        [
            "Bingawan, officially the Municipality of Bingawan (Hiligaynon: Banwa sang Bingawan, Tagalog: Bayan ng Bingawan),  is a fifth class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 16,164 people, making it the least populated municipality in the province."
        ],
        [
            "Bingawan is 72 kilometres (45 mi) from Iloilo City and 61 kilometres (38 mi) from Roxas City."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(February 2013) (Learn how and when to remove this message)"
        ],
        [
            "During the decade of the Spanish regime, many Filipinos who fled from the Spanish atrocities retreated to remote places to hide.",
            "Particular places worthy of note were the hillsides of Quinangyana (along its creek), Maldespina and Kinalyan.",
            "In order for the people to survive, they made farms using the kaingin system and hunted animals for food.",
            "Two settlements were established: one in Maldespina (now Bingawan Cemetery) and the other on the hilltop at Kinalyan near Quinangyana."
        ],
        [
            "When the revolution broke out in 1896, some Filipinos from Calinog, Dumalag, and Tapaz fled to the aforementioned places.",
            "In 1900, a big group of evacuees from Calinog arrived and joined those who were hiding.",
            "They escaped from the American soldiers, who were avenging the death of their fellow soldiers massacred by Filipinos.",
            "A year after, some returned to Calinog but others opted to stay and made farms."
        ],
        [
            "The two settlements wanted to unite and establish a community.",
            "So, the settlers led by Gregorio Plaga, known as “Pakuribot” an instrumental leader, surveyed the hilltops.",
            "A plateau in the southern part was chosen because of the presence of the number of springs.",
            "In 1901, the community known as “BINGAWAN” was established.",
            "The name Bingawan was derived from the creek which resembled a missing tooth (the term “BINGAW” used in the local dialect).",
            "This said creek is located west of the present site of Bingawan Central School."
        ],
        [
            "The early residents constructed a long building made of light materials.",
            "It accommodated forty families.",
            "They called it “Pagnahi-an” because the partition was made from materials sewed together.",
            "The building was located at the roadside east of where the Bingawan Baptist Church stands.",
            "Maria Rozhel Pradilla Cortel is from this town where she relocated to a different town when she was 10 years old."
        ],
        [
            "This new community was in need of capable leaders.",
            "So, twelve were chosen from the forty families (the twelve leaders represented the twelve apostles of the Lord).",
            "Those leaders were called by the early residents as “Founders of Bingawan”.",
            "The twelve leaders were Martin Celeste, Eusebio Plaga, Condrado Castroverde, Paulino Celestial, Andres Paren, Gregorio (Goyo) Plaga, Eugeni Celestial, Pablo Celebria, Eulogio Pormilda, Enrique Caspillo, Feliciano Gigare and Atanacio Gener."
        ],
        [
            "The council of elders had two consultants, they were Gregorio (Pakuribot) Plaga and Gregorio Lampeño (a rebel leader from Janiuay).",
            "According to the early residents, these two elders were the most illustrious among them all and were ascribed with high respect.",
            "Lampeño was believed to have possessed supernatural powers, have a talisman and the capability to beat his enemies very easily.",
            "They were accompanied by a brave man known as “Manding Beni”."
        ],
        [
            "With the founding of Barrio Bingawan in 1901, was also the establishment of the Bingawan Baptist Church.",
            "The early residents were disgusted with the Spaniards because of their tyranny and religious hypocrisy.",
            "The people responded to the preaching of the Gospel by the Protestant preachers and they gladly embraced the evangelical faith.",
            "Amando Zamora, an ex-soldier from Luzon who trained under the American missionaries, was brought to Bingawan by Gregorio Lampeño and became the first Pastor of the church."
        ],
        [
            "Later, Charles Briggs, an American missionary and Don Braulio Manikan, the first Filipino preacher who was converted in Spain by Dr. Eric Lund, came to Bingawan and baptized the early converts.",
            "The church building was not only used for religious services but also as a school house.",
            "Amando Zamora was both a pastor and an educator of the early residents."
        ],
        [
            "In 1904, a group of notable families from Santa Teresa, Dumalag, Capiz came and settled in Bingawan.",
            "The heads of these respectable families were Isidro Faldas, Clemente Ferasol and Alejandro Pamocol.",
            "These men were fine leaders.",
            "They contributed a lot to the development of the Barrio."
        ],
        [
            "There was a need for the maintenance of peace and order in this newly established community.",
            "Hence, in 1905, two elders namely Condrado Castroverde and Eulogio Pormilda were appointed as the first policemen of the place.",
            "They were later replaced by Bernabe Pagara and Felipe Porado as members of the council of elders."
        ],
        [
            "In the Summer of 1906, a great fire swept over the community which resulted in the great loss of properties and stored gains.",
            "Several months after the said fire, a great famine occurred.",
            "However, Mateo Casalmer, then barrio lieutenant, challenged the people to reconstruct their house and the church building.",
            "“ In a short period of time, houses sprang up like mushrooms and the church building stood up like magic”, an old resident once said after the call for cooperation was declared.",
            "All of those things were made possible due to the unparalleled cooperation and unity of the people."
        ],
        [
            "In August 1912, an energetic and intelligent leader came in the person of Rev.",
            "Antonio D. Plagata.",
            "He was educated in one the public schools in the City of Iloilo and later at the Jaro Industrial School now known as the Central Philippine University.",
            "He led the church and the school.",
            "He started the English instructions at school and it had made the school progress tremendously as years went by.",
            "The school was named Bingawan Institute in 1924.",
            "The classes in the High School Department were taught by Severo Catedral, Tranquilino Bergante and Delfin Dianala."
        ],
        [
            "Rev.",
            "Antonio Plagata was not only a pastor and a teacher but also a statesman.",
            "He was one of the Municipal Councilors of Passi, where Calinog, the mother municipality of Bingawan, was still a barrio.",
            "He and three other men from Calinog endeavored to make Calinog an independent municipality from Passi: Vicente Castronuevo, Francisco Casa and Eugenio Carbon.",
            "As a result, in 1926, Calinog became an independent municipality.",
            "Plagata served as Municipal Councilor of Calinog until World War II.",
            "Other residents from Bingawan who served in the Municipality of Calinog were Javier Celo and Macario Celestial."
        ],
        [
            "In 1929, the first public school in Bingawan was opened.",
            "This was made possible through the efforts of the following: Vidal Derecho, Florentino Faldas, Tranquilino Sorioso, Nicanor Cerbas, Fulgencio Catoera, Antonio Plagata, Rufino Pormilos, Esperidion Landero, Daniel Geretape, Jorge Lorca, Vicente Gallaza, Primo Catoera, Francisco Vargas, Leon Landero, Felix Sagotoy, Paulino Celestial, Casimiro Pagara, Antonio catolico, Valeriano Derecho and Condrado Castroverde.",
            "The school site was donated by Spouses Eusebio Palma and Maxima Celo Palma."
        ],
        [
            "After World War II, a complete elementary school was opened.",
            "The enrolment rapidly increased which resulted to the opening of the Bingawan High School in July 1966.",
            "Through the untiring efforts of Mrs. Sofia Paren and Mrs. Marcelina S. Castronuevo, both public school teachers of Bingawan Elementary School, the school was able to obtain 84 enrollees which comprised the first year high school class with two sections, thus meeting the requirements for the opening of a Barangay High School.",
            "The first two high school instructors assigned were Mrs. Myrna S. Jamili and Miss Nicolasa Quilarto.",
            "Through their sacrifices and the cooperation of the people of the Municipality, the school expanded and in July 1984, it was converted into a National High School which was then named as the Bingawan National High School.",
            "The papers and documents needed for such an upgrade were prepared and facilitated by Mr. Bonifacio Castronuevo, Sr. who was a high school teacher from Calinog.",
            "The processing of the papers was also undertaken by Dr. Victor S. Castronuevo and was approved by the Board through the help of Board Member Esperidion Jagunap, who was known as the “Father of the Barangay High School”."
        ],
        [
            "The Improvement of the community started in 1952, through the efforts of Victor C. Plagata, an elected councilor of Calinog.",
            "He paved the streets, improved the plaza and encouraged community beautification.",
            "Gradually, the residents built bigger houses.",
            "A public market was later constructed to cater to the needs of the people.",
            "This made marketing easier of the public.",
            "More improvements were made when Victor Plagata was elected Vice Mayor of Calinog in 1955.",
            "After a lapse of ten years, another Bingawan resident was elected Municipal Councilor in the person of Dr. Victor S. Castronuevo.",
            "His victory in 1967 elections added a name for Bingawan."
        ],
        [
            "The restless spirits of Victor S. Plagata and Consolador Faldas made possible the realization of the great dream of Bingawan to become an independent municipality.",
            "A bill was later passed that was authored by Congressman Ricardo Y. Ladrido, which later became R.A. 5511, to create Bingawan as a Municipality of the Province of Iloilo.",
            "The bill was approved by the Congress in May 1969.",
            "Bingawan became a new Municipality, independent from Calinog, its mother Municipality."
        ],
        [
            "On April 10, 1970, the first set of municipal officials were appointed led by Victor C. Plagata as Municipal Mayor and Concolador Faldas as Vice Mayor.",
            "The Municipal Councilors were Sulpicio Castronuevo, Ildelfonso Caras, Santos Laygan, Bernardo Girao, Aurelio Gargoles and Alepio Castillanes.",
            "Judge Lodrigio Lebaquin administered their Oath of Office.",
            "Under the leadership of Mayor Plagata, roads and streets were constructed connecting Bingawan to adjacent Municipalities.",
            "Barangay roads were also constructed to connect the barangays to Poblacion.",
            "School buildings and other development structures were constructed changing Bingawan into a nicer and better place to live in."
        ],
        [
            "On February 22, 1986, the EDSA revolution took place.",
            "Vice Mayor Consolador Faldas replaced incumbent Mayor Plagata on June 23, 1986.",
            "He then served as the OIC Mayor until November 30, 1987."
        ],
        [
            "On December 1, 1987, Victor C. Plagata was again appointed as the Officer-in-Charge until election time came.",
            "His Vice Mayor was Mr. Ildelfonso Caras and the following were the Councilors: Nicasio Castro, Ignacio Glory, Elma Celestial, Jose Rabago Sr., Reynaldo Labus, Wilhelm Sumagaysay, Jose Magbanua and Nemesio Seran."
        ],
        [
            "When the local elections was held on January 11, 1988, Zafiro S. Palabrica won over his opponent as the Municipal Mayor.",
            "Congressman Licurgo P. Tirador swore him into office together with Mr. Juanito Cerbo as his Vice Mayor.",
            "The Sangguniang Bayan Members were Felino Gardose, Merlie Cataluña, Ted Peter P. Plagata, Dioscoro C. Caras, Rex L. Celeste, Bonifacio Castronuevo Jr., Nonie Ysulan and Suplicio Morales Jr."
        ],
        [
            "Through Mayor Palabrica's leadership, roads and bridges were improved, a guest house was constructed beside the Municipal Hall, open markets were built in Poblacion, Alabidhan and Inamyungan.",
            "Local resource Management projects and Multi-Purpose pavements were made possible.",
            "Through his guidance and inspiration, cooperatives were established and primary schools were opened in Malitbog, Ilawod and Tapacon."
        ],
        [
            "On May 11, 1992, Zafiro S. Palabrica was re-elected by the people as Municipal Mayor together with Merlie C. Cataluña as Vice Mayor.",
            "The following are the Sangguniang Bayan Members : Lorna P. Tipsay, Ted Peter P. Plagata, Felino D. Gardose, Fred P. Para-on, Sammy T. Pormilos, Rex L. Celeste, Edwin S. Faldas, and Nonie V. Ysulan.",
            "In 1995, the people again re-elected Zafiro S. Palabrica as Municipal Mayor.",
            "His vice Mayor was Ted Peter P. Plagata and the Sangguniang Members were: Eduardo Dalipe, Sulpicio P. Morales, Leovigilda G. Castroverde, Julious Cerbo, Sammy T. Pormilos, Nonie V. Ysulan, Merlie C. Ocampo, Pedro M. Bacera and Freddie Q. Compas.",
            "Mayor Palabrica served as Municipal Mayor until May 10, 1998."
        ],
        [
            "Among Mayor Zafiro Palabrica's numerous accomplishments were : the establishment of 11 satellite schools, construction of Barangay Halls and Markets, Municipal Library and Covered Gym, concreting of three (3) major bridges, facilitated the classification of Barangay Road to National Road from Barangay Cairohan to Barangay Poblacion and the concreting of Barangay Poblacion Road to Alabidhan National Road.",
            "As a token for his excellence and outstanding performance, he was awarded as the Most Outstanding Mayor of the Philippines Fighting Cock National Award by the Progressive Alliance of Citizens for Democracy and Presidential Assistant on Community Development last January 6, 1991.",
            "During his term, the Municipality was a consistent Awardee of the Clean and Green Awards/GAWAD NG PANGULO SA KAPALIGIRAN.",
            "In 1995, the Municipality was awarded 1st Place in the Provincial, 1st Place in the Regional Level and a National Finalist.",
            "In 1996, 1st Place in the Provincial Level, 1st Place in the Regional Level and still a National Finalist.",
            "In 1997, 1st Place in the Provincial Level and 2nd Place in the Regional Level .",
            "Other awards that the community received during his term were: Champion for the National Recognition of Outstanding LGU- NGO/PO Partnership in Local Governance at PICC, Manila on July 10, 1993.",
            "Over-all Champion for the Boy Scout of the Philippines Iloilo Council for three (3) consecutive years in 1996 to 1998.",
            "4th Runner-Up Alabidhan Working Youth Organization 1996 Search for Outstanding Working Youth Organization of the Philippines in Malacañang Manila last February 1997.",
            "3rd Runner-Up Binagwan Working Youth Organization 1997 and 1998 Search for Outstanding Working Youth Organization of the Philippines in Manila last February 1998 and 1999."
        ],
        [
            "On January 18, 1993, Matt P. Palabrica, SK President of the Municipality was elected as SK President of the Province of Iloilo thus making him the first Bingawanon to sit in the Provincial Board of Iloilo.",
            "During his time, the SK Hall was constructed and established.",
            "In 1996, he was selected as Youth Ambassador of Goodwill to the 23rd Ship for Southeast Asian Program participated by the Philippines, Indonesia, Malaysia, Thailand, Singapore, Brunei, Vietnam and Japan."
        ],
        [
            "On May 11, 1998, newly elected Municipal Officials were sworn into office led by Mayor Ted Peter P. Plagata and Vice Mayor Eduardo A. Dalipe.",
            "The Sangguniang Bayan Members were : Lydia C. Lagarto, Felino D. Gardose, Lorna P. Tipsay, Jose C. RAbago Jr., Rosalie C. Plaga, Bonifacio L. Ilisan, Delia C, Celeste, and Sulpicio P. Morales Jr.",
            "The ABC President was Pedro M. Bacera and the Municipal SK Federation President was Mark P. Palabrica.",
            "The people re-elected Mayor Ted Peter P. Plagata during the May 2001 elections.",
            "His Vice Mayor was Lydia C. Lagarto and the SB Members were: Jose C. Rabago Jr., Merlie C. Ocampo, Sulpicio P. Morales Jr., Bonifacio L. Ilisan, Gladys Pearl P. Tipsay, and Hector Belloga.",
            "The ABC President was Pedro M. Bacera and the SK President was Mark Palabrica.",
            "In May 2004, Mayor Ted Peter Plagata won the elections again and his Vice Mayor was Rosalie C. Plaga.",
            "The SB members were : Merlie C. Ocampo, Jose C. Rabago Jr., Hector P. Belloga, Delia C. Celeste, Ronelo Q. Compas, Mark P. Palabrica, Edwin S. Faldas, Suplicio Morales Jr.",
            "The ABC President was Noel M. Pendioday and SK President was Roshely P. Cerbo."
        ],
        [
            "The administration of Mayor Ted Peter P. Plagata lasted until June 30, 2007.",
            "Among his many accomplishments were : concreting of Poblacion to Alabidhan National Road, concreting of Castillanes Street, Cataluña Street, Plaga Street, Derecho Street, Lampino Street, Pagara Street, and Castroverde Street.",
            "He also made possible the installation of Municipal streetlights, construction of BNHS Covered Gym, Solar Dyers in Barangays, construction of grand stand and oval of Bingawan Elementary School, acquisition of Payloader, Grader, Ambulance and Nissan Terrano Patrol Car, and the purchase of Lot for the Municipal Dump Site.",
            "The remarkable legislation of the Sangguniang Bayan was the Palamangkutanon Sang Banwa ( Citizen's Query) Ordinance."
        ],
        [
            "After the May 14, 2007 elections, a new set of Municipal Officials assumed office.",
            "This administration is called the “ Young Ones” led by a young, competent and energetic Mayor Matt P. Palabrica and his Vice Mayor Mark P. Palabrica.",
            "The SB members are: Wennie P. Javellana, Roger C. Genturo, Ronelo Q. Compas, Rosalie C. Plaga, Leovy C. Simora, Edwin S. Faldas, Eleuterio C. Patriarca Jr., and Delia C. Celeste, who resigned and was later replaced by Essie C. Palmejar."
        ],
        [
            "On September 6, 2007, when SB member Roger C. Genturo was doing a research at the Provincial Capitol of Iloilo, he got hold of a document, a DILG Memorandum Circular No.",
            "01 – M(50) -05 dated January 31, 2006 stating the reclassification of the Municipality of Bingawan from 5th Class to 4th Class Municipality effective June 29, 2005.",
            "Thereafter, Mayor Matt P. Palabrica immediately ordered a five percent (5%) salary increase for the Municipal Officials and employees.",
            "Today, the Municipality of Bingawan is struggling hard to be a third-class Municipality under his administration."
        ],
        [
            "This section contains content that is written like an advertisement.",
            "Please help improve it by removing promotional content and inappropriate external links, and by adding encyclopedic content written from a neutral point of view.",
            "(September 2015) (Learn how and when to remove this message)"
        ],
        [
            "In less than two years of governance, these are the accomplishments of Mayor Matt Palabrica's administration: On health: it has enrolled 2,120 households with 306.36% coverage under Philhealth Indigency Program and the accreditation of RHU for PhilHealth Programs.",
            "These accomplishments made Bingawan the No.",
            "1 municipality in the Province of Iloilo in terms of implementation of the Philhealth Programs.",
            "The award was given during the Annual Celebration of the Semana Sang Iloilo 2009.",
            "On Education: the establishment of Jovita Alfaras Rivera National High School in Barangay Tapacon and the computerization of Bingawan Central School.",
            "On infrastructure and transportation : the asphalting of Bingawan – Switch, Tapaz Road, construction of the New Public Market, the acquisition of the new PNP Toyota Innova Patrol Car and Isuzu Dump Truck and the implementation of the 11 Million Pesos worth of Kalahi Projects in 14 Barangays which includes : upgrading and opening of Barangay Roads, Water System Level II in Barangay Cairohan and Barangay Ngingi-an and construction of Health Center in Barangay Guinhulacan.",
            "On Agriculture : the repair of Small Farm Reservoir and Carabao and Vegetable Seeds Dispersal.",
            "The landmark Legislation of the Sangguniang Bayan were: The Amended Revenue Code of 2008, Market Code of 2008, Municipal Legislative-Executive Advisory Council Ordinance and the Bantay Bayan Law."
        ],
        [
            "After the May 13, 2013 election, Mayor Matt P. Palabrica won again in his last term as municipal mayor and Mark P. Palabrica is still the Vice Mayor with the following SB Members: Ted Pater P. Plagata, Jose Rabago, Jr., Lorens M. Belloga, Ronelo Q Compas, Nemesio A. Cachite, Wennie P. Javellana, Eduardo Dalipe and Eleuterio Patriarca Jr.",
            "The ABC President was Joenel Tabilla and SK President was Lalaine Chiva.",
            "Ronelo Q. Compas died 20 days after he assumed office and latter replaced by his only son Ross Mark R. Compas.",
            "After October 28, 2013, Barangay Election the new ABC President was Lucia S. Pendioday who resigned after a year and was replaced by Jerry U. Magbanua who also resigned a year after and replaced by Perceval T. Girao."
        ],
        [
            "After the May 9, 2016 elections, a new set of Municipal Officials assumed office.",
            "Mayor Mark P. Palabrica replaced his elder brother Matt who was also elected as the Vice Mayor with the following SB Members: Joy L. Quimba, Jose Rabago, Jr., Lorens M. Belloga, Ted Peter P. Plagata, Nemesio A. Cachite, Jofe C. Celeste, Eduardo Dalipe and Leovy C. Simora.",
            "The ABC President was Perceval T. Girao."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Bingawan is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Agba-o"
        ],
        [
            "Alabidhan"
        ],
        [
            "Bulabog"
        ],
        [
            "Cairohan"
        ],
        [
            "Guinhulacan"
        ],
        [
            "Inamyungan"
        ],
        [
            "Malitbog Ilawod"
        ],
        [
            "Malitbog Ilaya"
        ],
        [
            "Ngingi-an"
        ],
        [
            "Poblacion"
        ],
        [
            "Quinangyana"
        ],
        [
            "Quinar-Upan"
        ],
        [
            "Tapacon"
        ],
        [
            "Tubod"
        ],
        [
            "Miami"
        ],
        [
            "New York"
        ],
        [
            "Los Angeles"
        ],
        [
            "Canada"
        ],
        [
            "Barangays Bulabog has sitio Sinamungan, Malitbog Ilaya has sitio San Isidro, Poblacion has 4 Sitios, namely: Cubay, Inaquigan, Maganhop and Maldespina, Quinar-Upan has 4 sitios, namely: Dalusan, Kala-igang, Karuntingan and Nalundan), and Tapacon has sitio Fatima."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bingawan, Iloilo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "64(2.5)"
        ],
        [
            "44(1.7)"
        ],
        [
            "58(2.3)"
        ],
        [
            "83(3.3)"
        ],
        [
            "204(8.0)"
        ],
        [
            "304(12.0)"
        ],
        [
            "334(13.1)"
        ],
        [
            "291(11.5)"
        ],
        [
            "310(12.2)"
        ],
        [
            "281(11.1)"
        ],
        [
            "172(6.8)"
        ],
        [
            "97(3.8)"
        ],
        [
            "2,242(88.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.5"
        ],
        [
            "8.9"
        ],
        [
            "11.3"
        ],
        [
            "14.1"
        ],
        [
            "24.2"
        ],
        [
            "28.0"
        ],
        [
            "29.6"
        ],
        [
            "28.2"
        ],
        [
            "28.1"
        ],
        [
            "28.1"
        ],
        [
            "20.2"
        ],
        [
            "15.2"
        ],
        [
            "248.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Bingawan is relatively dry from November to April and wet during the rest of the year.",
            "The maximum rain periods are not very heavy with a short dry season lasting from one to three months.",
            "The climate is influenced by the southeast monsoons, one of the principal air streams affecting the country.",
            "Local topography affects its exposure to prevailing winds."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BingawanYearPop.±% p.a.1970 7,740—    1975 8,763+2.52%1980 9,229+1.04%1990 10,872+1.65%1995 11,494+1.05%2000 11,866+0.69%2007 12,259+0.45%2010 13,432+3.38%2015 15,199+2.38%2020 16,164+1.22%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Bingawan, Iloilo, was 16,164 people, with a density of 190 inhabitants per square kilometre or 490 inhabitants per square mile."
        ],
        [
            "Languages"
        ],
        [
            "Hiligaynon and Kinaray-a are the main languages of the town.",
            "Other languages spoken and understood by the residents are Capiznon, Tagalog, and English."
        ],
        [
            "Religion and culture"
        ],
        [
            "Major Denominations:  Baptist & Roman Catholic."
        ],
        [
            "Other Denominations: Jehovah’s Witnesses, Seventh Day Adventists and Iglesia ni Kristo."
        ],
        [
            "Festival: Annual Religious Fiesta in honor of Saint Paul's Conversion every 25th January & Bingawan Foundation Day / Pagnahi-an Festival every 21st June."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bingawan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Bingawan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 3 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Bingawan"
        ],
        [
            "Dumalag, Capiz"
        ],
        [
            "Dumarao, Capiz"
        ],
        [
            "Tapaz, Capiz"
        ],
        [
            "Bingawan"
        ],
        [
            "Passi City"
        ],
        [
            "Calinog"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bingawan&oldid=1228619140\""
        ],
        [
            "Category: Municipalities of IloiloHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Tagalog-language textArticles needing additional references from February 2013All articles needing additional referencesArticles with a promotional tone from September 2015All articles with a promotional tonePages using the Kartographer extension"
        ]
    ]
}