{
    "name": "Boac",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Boac, Marinduque"
        ],
        [
            "28 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançais한국어IlokanoBahasa IndonesiaItalianoKapampanganLatviešuBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSvenskaTagalogไทยУкраїнськаاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°27′N 121°50′E﻿ / ﻿13.45°N 121.83°E﻿ / 13.45; 121.83"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Capital of Marinduque, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesBoacMunicipalityMunicipality of BoacBoac Cathedral and Fortress"
        ],
        [
            "FlagSealNicknames: Montserrat de Marinduque, Ang Bayang BiakMap of Marinduque with Boac highlightedOpenStreetMapBoacLocation within the PhilippinesCoordinates: 13°27′N 121°50′E﻿ / ﻿13.45°N 121.83°E﻿ / 13.45; 121.83CountryPhilippinesRegionMimaropaProvinceMarinduqueDistrict"
        ],
        [
            "Lone districtFoundedDecember 8, 1622Barangays61"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorArmi D. Carrion • Vice MayorSonny L. Paglinawan • RepresentativeLord Allan Jay Q. Velasco • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Mark Anthony E. SeñoMark Angelo L. JinangLuisito S. LaylayAurelio J. Leva IIIDave Daniel M. LargaJustin Angelo J. ManriqueLuisito M. MajabaCarlos M. Palomares"
        ],
        [
            " • Electorate37,287 voters (2022)Area • Revenue₱ 243.8 million (2020) • Assets₱ 756.2 million (2020) • Expenditure₱ 196.7 million (2020) • Liabilities₱ 184.6 million (2020)Service provider • ElectricityMarinduque Electric Cooperative (MARELCO)Time zoneUTC+8 (PST)ZIP code4900PSGC174001000IDD : area code +63 (0)42Native languagesTagalogWebsitewww.boac.gov.ph"
        ],
        [
            "Boac, officially the Municipality of Boac (Tagalog: Bayan ng Boac), is a 1st class municipality and capital of the province of Marinduque, Philippines.",
            "According to the 2020 census, it has a population of 57,283 people making the most populous town in Marinduque."
        ],
        [
            "Situated in the western coast of Marinduque Island, the municipality is bordered in the north by the municipality of Mogpog, in the west by the Tayabas Bay and Sibuyan Sea, in the east by the municipality of Torrijos, and in the south by the municipalities of Gasan and Buenavista."
        ],
        [
            "Boac, a heritage town in its own right, is known as one of the main venues of the annual Moriones Festival and is the location of a number of historical sites in Marinduque including the Boac Cathedral fortress church, Casa Real and the Liwasan ng Kalayaan, Laylay Port, and the Battle of Paye site.",
            "The municipality is also home to the Marinduque Branch of the National Museum of the Philippines."
        ],
        [
            "Etymology"
        ],
        [
            "Boac town proper overlooking the Boac River"
        ],
        [
            "The toponym Boac is derived from the Cebuano word bu-ak, cognatic to the Tagalog word bi-ak and the southern Tagalog term ba-ak.",
            "This is in reference to the town being bisected by the Boac River which runs from the Central Marinduque and Balagbag Mountain Ranges to the west coast facing the Tayabas Bay and Sibuyan Sea.",
            "Other references suggest that the name Boac is derived from the Tagalog term bulwak referring to the gush of water at the estuaries and mouth of the Boac River."
        ],
        [
            "Other names"
        ],
        [
            "During the Spanish colonization, the first visita called Montserrat de Marinduque was established in the island in 1580 in what is now Boac."
        ],
        [
            "History"
        ],
        [
            "Aerial view of Boac, 1935"
        ],
        [
            "In the early years of Spanish colonization in Marinduque, it was first mentioned in Miguel de Loarca's Relacion de las Yslas Filipinas (1582-1583) that the natives of the island are Pintados or tattooed people resembling those from the Camarines Provinces and the Visayan Islands."
        ],
        [
            "In 1580, the first visita was established in the island of Marinduque and was called Montserrat de Marinduque in what is now the municipality of Boac; this visita was governed by Fray Alonzo Banol as minister."
        ],
        [
            "In 1621, Spanish Jesuit missionaries brought a three-foot Marian image to Boac which will later be known as the Mahal na Ina ng Biglang Awa.",
            "Notorious for their sea raids, a group of Muslim pirates from the southern Philippines sieged Boac in the mid-17th century along the shores of Laylay and eventually into the Poblacion located along the Boac River."
        ],
        [
            "In panic, the locals took refuge in the fortress church of Boac as able-bodied men defended the outer walls against the attacks.",
            "Many locals were killed and, by the third day of siege, the surviving locals began to run short on food and the capture of the fortress became imminent.",
            "As an act of faith, the survivors prayed fervently at the throne of Mary, asking her to deliver them from these enemies.",
            "According to legends, a very strong storm with torrential rain, thunder, and lightning engulfed the area and at its very height, it was reported that the image of a beautiful lady with outstretched arms appeared standing on the top of the fortress wall.",
            "Terrorized, the pirates fled in confusion to their vintas and left the island."
        ],
        [
            "Since then, the image of Mary has been honoured and given the title \"Biglang Awa.\"",
            "To commemorate this miracle,  the old image brought by the Jesuits in Boac was placed in a shrine erected on the portion of the wall where Mary is said to have appeared."
        ],
        [
            "Laylay Port"
        ],
        [
            "In 1942, Boac was occupied by Japanese troops.",
            "In 1945, the Battle of Marinduque began and the American-Philippine Commonwealth troops landed in Boac after the war was built of the general headquarters of the Philippine Commonwealth Army and Philippine Constabulary from 1945 to 1946 station in this municipality."
        ],
        [
            "The Provincial Government of Marinduque under Gov.",
            "Carmencita O. Reyes built a larger-than-life-size image of the Our Lady of Biglang Awa in cement and placed in the seashore in Balanacan Port to welcome travelers to the island."
        ],
        [
            "On May 10, 2008, the Diocese of Boac celebrated the 13th anniversary and the golden anniversary of the canonical coronation of Mahal na Birhen ng Biglang-Awa (1958–2008).",
            "Cebu Archbishop-Cardinal Ricardo Vidal of Mogpog, Marinduque, officiated at the consecrated mass."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "In the 19th Congress of the Philippines, house bills were filed by various representatives which seeks Boac including other capital towns of provinces with no current component cities, independent component cities or highly urbanized cities to automatically convert into cities."
        ],
        [
            "Geography"
        ],
        [
            "Boac is the third largest of the six municipalities of the province of Marinduque, after Santa Cruz and Torrijos.",
            "It borders all the municipalities of the province: Mogpog to the north, Santa Cruz to the Northeast, Torrijos to the East, Buenavista to the South and Gasan to the South Southwest."
        ],
        [
            "The municipality is generally hilly, rugged and mountainous in the south and eastern part with thin strips of flat and farm lands and long shoreline in the west.",
            "The longest and largest river, Boac River, which gets its source in the mountainous forest in the extreme southwest and spills off to the northern shore of Boac, divides the municipality into two geographical areas: north and south."
        ],
        [
            "The Boac River in Tumapon"
        ],
        [
            "The closest town-to-town reference to Boac is the municipality of Mogpog which is approximately 5 kilometers.",
            "Boac is connected to Mogpog and Gasan by the Marinduque Circumferential Highway or the Pan-Marinduque Highway.",
            "Two bridges connect the north and south area of the municipality: the narrow Tabi Bridge which connects Barangay Tabi and Barangay San Miguel and the said-to-be the longest bridge in the province, Biglang Awa Bridge (186m), which connects Barangay Tampus and Barangay Bantad.",
            "A narrow minor road connects Boac and Mogpog via Buliasnin-Nangka Road, and Boac and Gasan via Duyay-Tapuyan Trail.",
            "Boac has a total road network of 117.61 kilometers."
        ],
        [
            "Geopolitically, Boac is divided into six zones: Poblacion, Riverside, Ilaya I, Ilaya II, Seaside A and Seaside B. Boac's geographical center is roughly located between the border of Barangay Binunga and Barangay Can-at."
        ],
        [
            "Boac is home to most of the province's commercial businesses.",
            "Barangays San Miguel, Murallon, and Mercado are the town's business district where the public market, medium-rise buildings, sports arena and Boac Town Arena, now Moriones Arena are.",
            "Meanwhile, Barangay Isok is home to the town's education district.",
            "Marinduque National High School, St. Mary's College of Marinduque, Don Luis Hidalgo Memorial School, Barangay Day Care Centers, Boac North District Office and the Division of Marinduque DepED Office is in Barangay Isok.",
            "The Municipal Building Hall is at Barangay Tampus, adjacent is the Marinduque Museum at Barangay Malusak."
        ],
        [
            "The Marinduque Provincial Capitol is in Barangay Santol near the Dr. Damian Reyes Memorial Hospital (formerly Marinduque Provincial Hospital) and Camp Maximo Abad."
        ],
        [
            "Barangays"
        ],
        [
            "Boac is politically divided into 61 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Agot"
        ],
        [
            "Agumaymayan"
        ],
        [
            "Amoingon"
        ],
        [
            "Apitong"
        ],
        [
            "Balagasan"
        ],
        [
            "Balaring"
        ],
        [
            "Balimbing"
        ],
        [
            "Balogo"
        ],
        [
            "Bamban"
        ],
        [
            "Bangbangalon"
        ],
        [
            "Bantad"
        ],
        [
            "Bantay"
        ],
        [
            "Bayuti"
        ],
        [
            "Binunga"
        ],
        [
            "Boi"
        ],
        [
            "Boton"
        ],
        [
            "Buliasnin"
        ],
        [
            "Bunganay"
        ],
        [
            "Caganhao"
        ],
        [
            "Canat"
        ],
        [
            "Catubugan"
        ],
        [
            "Cawit"
        ],
        [
            "Daig"
        ],
        [
            "Daypay"
        ],
        [
            "Duyay"
        ],
        [
            "Hinapulan"
        ],
        [
            "Ihatub"
        ],
        [
            "Isok 1 (Poblacion)"
        ],
        [
            "Isok 2 (Poblacion)"
        ],
        [
            "Laylay"
        ],
        [
            "Lupac"
        ],
        [
            "Mahinhin"
        ],
        [
            "Mainit"
        ],
        [
            "Malbog"
        ],
        [
            "Maligaya"
        ],
        [
            "Malusak (Poblacion)"
        ],
        [
            "Mansiwat"
        ],
        [
            "Mataas na Bayan (Poblacion)"
        ],
        [
            "Maybo"
        ],
        [
            "Mercado (Poblacion)"
        ],
        [
            "Murallon (Poblacion)"
        ],
        [
            "Ogbac"
        ],
        [
            "Pawa"
        ],
        [
            "Pili"
        ],
        [
            "Poctoy"
        ],
        [
            "Poras"
        ],
        [
            "Putting Buhangin"
        ],
        [
            "Puyog"
        ],
        [
            "Sabong"
        ],
        [
            "San Miguel (Poblacion)"
        ],
        [
            "Santol"
        ],
        [
            "Sawi"
        ],
        [
            "Tabi"
        ],
        [
            "Tabigue"
        ],
        [
            "Tagwak"
        ],
        [
            "Tambunan"
        ],
        [
            "Tampus (Poblacion)"
        ],
        [
            "Tanza"
        ],
        [
            "Tugos"
        ],
        [
            "Tumagabok"
        ],
        [
            "Tumapon"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Boac, Marinduque"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "26(79)"
        ],
        [
            "29(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "83(3.3)"
        ],
        [
            "55(2.2)"
        ],
        [
            "44(1.7)"
        ],
        [
            "37(1.5)"
        ],
        [
            "90(3.5)"
        ],
        [
            "123(4.8)"
        ],
        [
            "145(5.7)"
        ],
        [
            "125(4.9)"
        ],
        [
            "135(5.3)"
        ],
        [
            "166(6.5)"
        ],
        [
            "163(6.4)"
        ],
        [
            "152(6.0)"
        ],
        [
            "1,318(51.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "15.1"
        ],
        [
            "10.8"
        ],
        [
            "11.9"
        ],
        [
            "11.4"
        ],
        [
            "19.9"
        ],
        [
            "23.7"
        ],
        [
            "26.3"
        ],
        [
            "23.9"
        ],
        [
            "23.9"
        ],
        [
            "22.1"
        ],
        [
            "20.2"
        ],
        [
            "18.6"
        ],
        [
            "227.8"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BoacYearPop.±% p.a.1903 15,823—    1918 17,656+0.73%1939 20,977+0.82%1948 19,687−0.70%1960 26,712+2.58%1970 32,402+1.95%1975 35,649+1.93%1980 37,005+0.75%1990 41,034+1.04%1995 44,609+1.58%2000 48,504+1.81%2007 50,823+0.65%2010 52,892+1.46%2015 54,730+0.65%2020 57,283+0.90%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2020 census, the population of Boac is 57,283 people, with a population density of 260 people per square kilometer.",
            "The most densely populated areas are in the Poblacion, northwest, and southwest barangays.",
            "Barangays in the eastern portions of the municipality are generally sparsely populated.",
            "Approximately 70% of the population lives along the national highways or within 5 kilometres (3.1 mi) from the national road.",
            "Furthermore, approximately 5% of the total population lives in the town proper and 10% lives in the sub-urban barangays."
        ],
        [
            "Religious Institutions"
        ],
        [
            "The Roman Catholic Diocese of Boac"
        ],
        [
            "Assemblies of God"
        ],
        [
            "Boac UNIDA Church"
        ],
        [
            "Boac Gospel Church"
        ],
        [
            "IRM Evangelical Church"
        ],
        [
            "Jesus the Lord of Lords Church"
        ],
        [
            "Potter's House Christian Fellowship"
        ],
        [
            "Iglesia ni Cristo"
        ],
        [
            "Jehovah's Witnesses"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Boac"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  24.70"
        ],
        [
            "2009  26.54"
        ],
        [
            "2012  7.50"
        ],
        [
            "2015  15.23"
        ],
        [
            "2018  13.44"
        ],
        [
            "2021  14.65"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Boac Business District view from Mercader Street"
        ],
        [
            "Boac Business District view from Gov.",
            "D. Reyes Street"
        ],
        [
            "In the centre of town, the Boac Public Market is one of the town's landmarks.",
            "Vendors sell dry and wet products in four air-conditioned buildings.",
            "Transport terminals near the market carry goods to other barangays.",
            "It is considered to be the mini-supermarket of the province."
        ],
        [
            "The poblacion area is called as Boac Central Business District (BCBD).",
            "The newly constructed two-floor Town Market with about 100 stores is in the heart of the poblacion."
        ],
        [
            "Transportation"
        ],
        [
            "Bus - linking Kamias in Quezon City and Makati to Boac via RO-RO ferry."
        ],
        [
            "Jeepneys - connecting to different municipalities of the province."
        ],
        [
            "Tricycle - serving commuters to and from interior barangays."
        ],
        [
            "Biglang-Awa Bridge is the longest bridge in the province, connecting Barangay Tampus to Barangay Bantad.",
            "Many people stand on the bridge to watch the sun set and to get a good view of the Boac Cathedral."
        ],
        [
            "Healthcare"
        ],
        [
            "Dr. Damian Reyes Memorial Hospital (formerly Marinduque Provincial Hospital) located at Brgy.",
            "Santol."
        ],
        [
            "Pablo N. Marquez Memorial Health & Diagnostic Center / Boac Rural Health Unit I located at Brgy.",
            "Isok I."
        ],
        [
            "Boac Rural Health Unit II located at Brgy.",
            "Bantay and serves areas in the Ilaya District."
        ],
        [
            "Education"
        ],
        [
            "Tertiary"
        ],
        [
            "Marinduque State University Main Campus - a public state college located in Brgy.",
            "Tanza; formerly known as Marinduque Institute of Science and Technology and Marinduque School of Arts and Trades."
        ],
        [
            "St. Mary's College of Marinduque (formerly Immaculate Conception College of Marinduque) - a private, Catholic school under the Religious of the Virgin Mary (RVM) located in Brgy.",
            "Isok I offering vocational and non-vocational courses including Teacher Education, Business Administration, and Hotel Management."
        ],
        [
            "Educational Systems Technological Institute (ESTI) - a private school located in Brgy.",
            "Murallon offering vocational and non-vocational courses including Criminology, Computer Science, Tourism Management, and Marine Transportation."
        ],
        [
            "Secondary"
        ],
        [
            "MSC Laboratory High School - a laboratory school located in Brgy.",
            "Tanza administered by the Marinduque State University."
        ],
        [
            "Marinduque National High School - the main public high school in the province.",
            "This institution was used as a camp for Japanese, American, and Filipino soldiers during World War II."
        ],
        [
            "Ilaya National High School - a public high school located in Brgy.",
            "Balimbing."
        ],
        [
            "Cawit National Comprehensive High School - a public high school located in Brgy Cawit."
        ],
        [
            "Saint Mary's College High School Department - a private high school located in Brgy.",
            "Isok I administered by the St. Mary's College of Marinduque."
        ],
        [
            "ESTI High School Department - a private high school located in Brgy.",
            "Murallon administered by the Educational Systems Technological Institute."
        ],
        [
            "Elementary"
        ],
        [
            "Agot Elementary School"
        ],
        [
            "Agumaymayan Elementary School"
        ],
        [
            "Amoingon Elementary School"
        ],
        [
            "Balagasan Elementary School"
        ],
        [
            "Balaring-Caganhao Elementary School"
        ],
        [
            "Balimbing Elementary School"
        ],
        [
            "Bamban Elementary School"
        ],
        [
            "Bangbangalon Elementary School"
        ],
        [
            "Bantauyan Public School"
        ],
        [
            "Bantay Elementary School"
        ],
        [
            "Binunga Elementary School"
        ],
        [
            "Boac South Central School"
        ],
        [
            "Boi Public School"
        ],
        [
            "Buliasnin Elementary School"
        ],
        [
            "Buliasnin Elementary School"
        ],
        [
            "Canat Elementary School"
        ],
        [
            "Catubugan Elementary School"
        ],
        [
            "Cawit Elementary School"
        ],
        [
            "Don Luis Hidalgo Memorial School, also known as Boac North Central School I & II- it is the premiere elementary in the municipality.",
            "Situated in the poblacion area and has about 1,500 students.",
            "It offers Science Curriculum for the grade school, and operates a Montesorri school and Head Start school program for nursery and kindergarten."
        ],
        [
            "Don Severino Lardizabal Memorial School"
        ],
        [
            "Duyay Elementary School"
        ],
        [
            "ESTI - Grade School Department"
        ],
        [
            "Hinapulan Elementary School"
        ],
        [
            "Lord of Lords Christian School (Barangay Cawit)"
        ],
        [
            "Lupac-Tabigue Elementary School"
        ],
        [
            "Mabuhay Primary School"
        ],
        [
            "Mahinhin Elementary School"
        ],
        [
            "Mainit Elementary School"
        ],
        [
            "Maligaya Elementary School"
        ],
        [
            "Mansiwat Public School"
        ],
        [
            "Maybo Elementary School"
        ],
        [
            "Pawa Elementary School"
        ],
        [
            "Pili Elementary School"
        ],
        [
            "Poctoy Elementary School"
        ],
        [
            "Poras Elementary School"
        ],
        [
            "Puting Buhangin Public School"
        ],
        [
            "Puyog Elementary School"
        ],
        [
            "Sawi Elementary School"
        ],
        [
            "St. Mary's College of Marinduque - Grade School Department"
        ],
        [
            "Tambunan Elementary School"
        ],
        [
            "Tanza Elementary School"
        ],
        [
            "Tugos Elementary School"
        ],
        [
            "Tumagabok Elementary School"
        ],
        [
            "Tourism"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(April 2020) (Learn how and when to remove this message)"
        ],
        [
            "Kabugsakan Falls in Barangay Tugos"
        ],
        [
            "Tahanan sa Isok in Barangay Isok"
        ],
        [
            "Villa Aplaya Beach Resort in Barangay Ihatub"
        ],
        [
            "Long beach shores from Maligaya to Cawit, mostly free"
        ],
        [
            "Boac Town Plaza, located in Barangay San Miguel, is where most major gatherings and festivals are held."
        ],
        [
            "The Boac Museum, beside the Boac Town Plaza and Rizal Park, is home to a collection of facts and information about the Island."
        ],
        [
            "The Boac Cathedral is Marinduque's central cathedral.",
            "In Barangay Mataas na Bayan, it is a historical church where the Katipunan Flag is said to have been baptized.",
            "Our Lady of Immaculate Conception is the patron saint of Boac, while Birhen ng Biglang-Awa is the patroness of the province."
        ],
        [
            "In Barangay San Miguel, the Boac Town Arena is where the famous senakulo (a part of the celebration of Moriones Festival) is held."
        ],
        [
            "Casa Real is a small museum, in the former site of Rizal Park in Barangay San Miguel."
        ],
        [
            "Freedom Park in Bunganay, Boac is the main eco-tourism theme park in the municipality with team building activities, zipline, etc."
        ],
        [
            "Laylay Port is a historical landmark in the municipality where the Japanese and American troops landed.",
            "It was once a commercial port where goods and products from other places embarked."
        ],
        [
            "Local heritage markers"
        ],
        [
            "Simbahan ng Boac - Installed at the Boac Cathedral, 1982."
        ],
        [
            "Padre Diego de Saura Marker - Installed at the Saura Shrine."
        ],
        [
            "Liwasan ng kalayaan - Installed at the park of the same name, December 6, 1975."
        ],
        [
            "Museo at Aklatan ng Boac - Installed at the Old Spanish Building, November 30, 1987/July 30, 2002."
        ],
        [
            "Maharlikang Tahanan ni Kapitan Piroko - Installed at the Lardizabal Ancestral home, February 23, 1973."
        ],
        [
            "Labanan sa Paye - Installed at the battle site, barangay Balimbing, July 31, 1986."
        ],
        [
            "Salvador del Mundo - Installed at the Pilar H. Lim Park, 1982."
        ],
        [
            "Pilar Hidalgo Lim - Installed at the Pilar H. Lim park, 1982."
        ],
        [
            "Boac Municipal Building - Installed at the municipal building, 1982."
        ],
        [
            "Boac Waterworks System - Installed at the Daig Chlorination tank, 1954."
        ],
        [
            "Marinduque National High School Centennial Marker, 2014"
        ],
        [
            "Historical markers"
        ],
        [
            "Site of Labanan sa Paye in Barangay Balimbing, Boac, Marinduque, the site of encounter between Filipino Revolutionary Forces and American soldiers during the Filipino-American War."
        ],
        [
            "Liwasang Kalayaan at Barangay Malusak, where Revolutionary heroes led by Hermenegildo Flores and Remigio Medina were massacred by Spanish soldiers on October 10, 1897, and November 1, 1897."
        ],
        [
            "Old Catholic Cemetery in Barangay Tampus, where in a common grave, remains of the victims of the October 10 and November 1, 1897, massacres were buried."
        ],
        [
            "Liwasan ng mga Nagtanggol sa Inang Bayan, the lower park in front of the municipal building which is hereby dedicated to perpetuate the heroism and patriotism of all heroes, heroines and veterans of World War II."
        ],
        [
            "Liwasang Pilar Hidalgo Lim, the upper park in front of the municipal building dedicated in memory and honor of Dr. Pilar Hidalgo Lim through Sangguniang Bayan Resolution No.",
            "53-74 dated August 2, 1974."
        ],
        [
            "Culture"
        ],
        [
            "Native Cuisine"
        ],
        [
            "Panganan rice cookies"
        ],
        [
            "Bibingkang lalaki"
        ],
        [
            "Marinaya pasta noodles made from squash"
        ],
        [
            "Sinulbot caramelized banana slices"
        ],
        [
            "panganan type of product make in galapong and in arrowroot who build by diego family"
        ],
        [
            "Events"
        ],
        [
            "The Annual Moriones Festival is held in Boac and surrounding areas of Marinduque Island during the Lenten season.",
            "This holy celebration is famed as one of the most colorful festivities in Marinduque and the Philippines."
        ],
        [
            "The Feast of the Immaculate Conception is celebrated every December 8."
        ],
        [
            "The Annual Bila-Bila (Butterfly) Festival is held on the Fest of the Immaculate Concepcion.",
            "It is composed of a festive competition between zones (purok) which includes the Poblacion, Riverside, Ilaya I, Ilaya II, and Seaside Zones.",
            "The municipal government of the capital town of Boac enshrined the butterfly in a municipal ordinance entitled \"Tree Farming and Butterfly Propagation Ordinance of 2002.\""
        ],
        [
            "Bulating Rites in Barangay Malbog, a similar practice to Quezon's Boling-boling Festival is said to have been started by one family in earlier years.",
            "It revived in 2001, as part of the municipality's tourism program.",
            "Called \"Bulating\" the practice is said to be an act of humility before God and/or another form of thanksgiving."
        ],
        [
            "Religion"
        ],
        [
            "Roman Catholicism is the major religion in Boac, with the see of the Diocese located in its town proper, the Immaculate Conception Cathedral."
        ],
        [
            "There are also several Christian denominations present, such as the Iglesia ni Cristo, which operates chapels in Boac.",
            "Born-Again groups are also active such as the Victory, Solid Rock, and Jesus the Lord of Lords Churches."
        ],
        [
            "Notable personalities"
        ],
        [
            "See also: List of mayors of Boac, Marinduque"
        ],
        [
            "Law and Academe"
        ],
        [
            "Ricardo Paras (February 17, 1891 - October 10, 1984) - Chief Justice of the Supreme Court of the Philippines from April 2, 1951, until February 17, 1961."
        ],
        [
            "Paz Latorena (January 17, 1908 – October 19, 1953) - one of the foremost writers of the first generation of Filipino English writers, in both literary writing and education was a poet, editor, author, and teacher."
        ],
        [
            "Pilar Hidalgo-Lim (May 24, 1893 - December 8, 1973) - Filipino educator and civic leader.",
            "She was married to Brig.",
            "General Vicente Lim, a World War II hero."
        ],
        [
            "Sports and Entertainment"
        ],
        [
            "Hayden Kho - Filipino celebrity and doctor with roots from Brgy.",
            "San Miguel, Boac."
        ],
        [
            "Gretchen Malalad - Filipina 2005 Southeast Asian Games karate gold medalist and a former beauty pageant contestant in Binibining Pilipinas 2002 with roots from Brgy.",
            "Tugos, Boac."
        ],
        [
            "Zaijian Jaranilla - Filipino actor best known for his role as the orphan Santino in the 2009–2010 ABS-CBN religious-themed teleserye, May Bukas Pa. A native of Gloria, Oriental Mindoro, he spends his vacation at Brgy.",
            "Amiongon, Boac."
        ],
        [
            "Zymic Jaranilla - Zaijian Jaranilla's sibling who is a GMA Network contract artist, and also a native of Gloria, Oriental Mindoro and spend his vacation at Brgy.",
            "Amoingon, Boac like his brother Zaijian."
        ],
        [
            "Sister cities"
        ],
        [
            " Tayabas City, Quezon, Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Boac |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"LGU Profile\".",
            "Municipality of Boac.",
            "Retrieved October 25, 2012."
        ],
        [
            "^ a b c showbizandstyle.inquirer.net, Biglang Awa of Boac marks golden jubilee Archived May 11, 2008, at the Wayback Machine"
        ],
        [
            "^ Yap, Eric (June 30, 2022).",
            "\"AN ACT AUTOMATICALLY CONVERTING THE CAPITAL TOWN OF PROVINCES WITH NO COMPONENT CITIES, INDEPENDENT COMPONENT CITIES OR HIGHLY URBANIZED CITIES WITHIN ITS TERRITORIAL JURISDICTION, INTO A COMPONENT CITY\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved April 1, 2023."
        ],
        [
            "^ Palma, Wilter (August 9, 2022).",
            "\"AN ACT AUTOMATICALLY CONVERTING THE CAPITAL TOWN OF PROVINCES WITH NO COMPONENT CITIES, INDEPENDENT COMPONENT CITIES, OR HIGHLY URBANIZED CITIES WITHIN ITS TERRITORIAL JURISDICTION, INTO A COMPONENT CITY\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved April 1, 2023."
        ],
        [
            "^ Daza, Paul (August 11, 2022).",
            "\"AN ACT CONVERING INTO COMPONENT CITIES THE CAPITAL TOWNS OF PROVINCES WITHOUT A CITY, AMENDING FOR THE PURPOSE SECTION 450 OF REPUBLIC ACT NO.",
            "7610, AS AMENDED BY REPUBLIC ACT NO.",
            "9009, OTHERWISE KNOWN AS THE LOCAL GOVERNMENT CODE OF 1991, AND FOR OTHER PURPOSES\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved April 1, 2023."
        ],
        [
            "^"
        ],
        [
            "\"Province: Marinduque\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Boac: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved April 28, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Marinduque\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Boac, Marinduque."
        ],
        [
            "Wikivoyage has a travel guide for Boac."
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "2000 Philippine Census Information"
        ],
        [
            "Total Population by Province, City, Municipality and Barangay as of August 1, 2007"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Boac, Marinduque"
        ],
        [
            "Mogpog"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Tayabas Bay,Sibuyan Sea"
        ],
        [
            "Boac"
        ],
        [
            "Torrijos"
        ],
        [
            "Gasan"
        ],
        [
            "Buenavista"
        ],
        [
            "vte Province of MarinduqueBoac (capital and largest municipality)Municipalities"
        ],
        [
            "Boac"
        ],
        [
            "Buenavista"
        ],
        [
            "Gasan"
        ],
        [
            "Mogpog"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Torrijos"
        ],
        [
            "vteSouthwestern Tagalog Region (Mimaropa)MIndoro, MArinduque, ROmblon, PAlawanRegional center"
        ],
        [
            "Calapan"
        ],
        [
            "Provinces"
        ],
        [
            "Marinduque"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Romblon"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Component city"
        ],
        [
            "Calapan"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Boac"
        ],
        [
            "Calapan"
        ],
        [
            "Mamburao"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Romblon"
        ],
        [
            "Municipalities"
        ],
        [
            "Aborlan"
        ],
        [
            "Abra de Ilog"
        ],
        [
            "Agutaya"
        ],
        [
            "Alcantara"
        ],
        [
            "Araceli"
        ],
        [
            "Baco"
        ],
        [
            "Balabac"
        ],
        [
            "Bansud"
        ],
        [
            "Banton"
        ],
        [
            "Bataraza"
        ],
        [
            "Boac"
        ],
        [
            "Bongabong"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Buenavista"
        ],
        [
            "Bulalacao"
        ],
        [
            "Busuanga"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Calatrava"
        ],
        [
            "Calintaan"
        ],
        [
            "Concepcion"
        ],
        [
            "Corcuera"
        ],
        [
            "Coron"
        ],
        [
            "Cuyo"
        ],
        [
            "Dumaran"
        ],
        [
            "El Nido"
        ],
        [
            "Ferrol"
        ],
        [
            "Gasan"
        ],
        [
            "Gloria"
        ],
        [
            "Kalayaan"
        ],
        [
            "Linapacan"
        ],
        [
            "Looc (Occidental Mindoro)"
        ],
        [
            "Looc (Romblon)"
        ],
        [
            "Lubang"
        ],
        [
            "Magdiwang"
        ],
        [
            "Magsaysay (Occidental Mindoro)"
        ],
        [
            "Magsaysay (Palawan)"
        ],
        [
            "Mamburao"
        ],
        [
            "Mansalay"
        ],
        [
            "Mogpog"
        ],
        [
            "Narra"
        ],
        [
            "Naujan"
        ],
        [
            "Odiongan"
        ],
        [
            "Paluan"
        ],
        [
            "Pinamalayan"
        ],
        [
            "Pola"
        ],
        [
            "Puerto Galera"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal (Occidental Mindoro)"
        ],
        [
            "Rizal (Palawan)"
        ],
        [
            "Romblon"
        ],
        [
            "Roxas (Oriental Mindoro)"
        ],
        [
            "Roxas (Palawan)"
        ],
        [
            "Sablayan"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose (Occidental Mindoro)"
        ],
        [
            "San Jose (Romblon)"
        ],
        [
            "San Teodoro"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Cruz (Marinduque)"
        ],
        [
            "Santa Cruz (Occidental Mindoro)"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Socorro"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Taytay"
        ],
        [
            "Torrijos"
        ],
        [
            "Victoria"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provincial capital cities and municipalities of the PhilippinesLuzon"
        ],
        [
            "Abra: Bangued"
        ],
        [
            "Albay: Legazpi"
        ],
        [
            "Apayao: Kabugao / Luna1"
        ],
        [
            "Aurora: Baler"
        ],
        [
            "Bataan: Balanga"
        ],
        [
            "Batanes: Basco"
        ],
        [
            "Batangas: Batangas City"
        ],
        [
            "Benguet: La Trinidad"
        ],
        [
            "Bulacan: Malolos"
        ],
        [
            "Cagayan: Tuguegarao"
        ],
        [
            "Camarines Norte: Daet"
        ],
        [
            "Camarines Sur: Pili"
        ],
        [
            "Catanduanes: Virac"
        ],
        [
            "Cavite: Imus / Trece Martires1"
        ],
        [
            "Ifugao: Lagawe"
        ],
        [
            "Ilocos Norte: Laoag"
        ],
        [
            "Ilocos Sur: Vigan"
        ],
        [
            "Isabela: Ilagan"
        ],
        [
            "Kalinga: Tabuk"
        ],
        [
            "La Union: San Fernando"
        ],
        [
            "Laguna: Santa Cruz"
        ],
        [
            "Marinduque: Boac"
        ],
        [
            "Masbate: Masbate City"
        ],
        [
            "Mountain Province: Bontoc"
        ],
        [
            "Nueva Ecija: Palayan"
        ],
        [
            "Nueva Vizcaya: Bayombong"
        ],
        [
            "Occidental Mindoro: Mamburao"
        ],
        [
            "Oriental Mindoro: Calapan"
        ],
        [
            "Palawan: Puerto Princesa"
        ],
        [
            "Pampanga: San Fernando"
        ],
        [
            "Pangasinan: Lingayen"
        ],
        [
            "Quezon: Lucena"
        ],
        [
            "Quirino: Cabarroguis"
        ],
        [
            "Rizal: Antipolo"
        ],
        [
            "Romblon: Romblon"
        ],
        [
            "Sorsogon: Sorsogon City"
        ],
        [
            "Tarlac: Tarlac City"
        ],
        [
            "Zambales: Iba"
        ],
        [
            "Visayas"
        ],
        [
            "Aklan: Kalibo"
        ],
        [
            "Antique: San Jose de Buenavista"
        ],
        [
            "Biliran: Naval"
        ],
        [
            "Bohol: Tagbilaran"
        ],
        [
            "Capiz: Roxas"
        ],
        [
            "Cebu: Cebu City"
        ],
        [
            "Eastern Samar: Borongan"
        ],
        [
            "Guimaras: Jordan"
        ],
        [
            "Iloilo: Iloilo City"
        ],
        [
            "Leyte: Tacloban"
        ],
        [
            "Negros Occidental: Bacolod"
        ],
        [
            "Negros Oriental: Dumaguete"
        ],
        [
            "Northern Samar: Catarman"
        ],
        [
            "Samar: Catbalogan"
        ],
        [
            "Siquijor: Siquijor"
        ],
        [
            "Southern Leyte: Maasin"
        ],
        [
            "Mindanao"
        ],
        [
            "Agusan del Norte: Cabadbaran / Butuan1"
        ],
        [
            "Agusan del Sur: Prosperidad"
        ],
        [
            "Basilan: Lamitan / Isabela1"
        ],
        [
            "Bukidnon: Malaybalay"
        ],
        [
            "Camiguin: Mambajao"
        ],
        [
            "Cotabato: Kidapawan"
        ],
        [
            "Davao de Oro: Nabunturan"
        ],
        [
            "Davao del Norte: Tagum"
        ],
        [
            "Davao del Sur: Digos"
        ],
        [
            "Davao Occidental: Malita"
        ],
        [
            "Davao Oriental: Mati"
        ],
        [
            "Dinagat Islands: San Jose"
        ],
        [
            "Lanao del Norte: Tubod"
        ],
        [
            "Lanao del Sur: Marawi"
        ],
        [
            "Maguindanao del Norte: Datu Odin Sinsuat"
        ],
        [
            "Maguindanao del Sur: Buluan"
        ],
        [
            "Misamis Occidental: Oroquieta"
        ],
        [
            "Misamis Oriental: Cagayan de Oro"
        ],
        [
            "Sarangani: Alabel"
        ],
        [
            "South Cotabato: Koronadal"
        ],
        [
            "Sultan Kudarat: Isulan"
        ],
        [
            "Sulu: Jolo"
        ],
        [
            "Surigao del Norte: Surigao City"
        ],
        [
            "Surigao del Sur: Tandag"
        ],
        [
            "Tawi-Tawi: Bongao"
        ],
        [
            "Zamboanga del Norte: Dipolog"
        ],
        [
            "Zamboanga del Sur: Pagadian"
        ],
        [
            "Zamboanga Sibugay: Ipil"
        ],
        [
            "1 de facto seat of provincial government"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Boac,_Marinduque&oldid=1226866709\""
        ],
        [
            "Categories: Municipalities of MarinduqueProvincial capitals of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Coordinates on WikidataArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from February 2022Articles with unsourced statements from May 2014Articles needing additional references from April 2020All articles needing additional referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}