{
    "name": "Bolinao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bolinao"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°23′17″N 119°53′41″E﻿ / ﻿16.3881°N 119.8947°E﻿ / 16.3881; 119.8947"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pangasinan, Philippines"
        ],
        [
            "For the language, see Bolinao language.",
            "For the common name for small edible fish, see Bolinaw."
        ],
        [
            "Municipality in Ilocos Region, PhilippinesBolinaoMunicipalityMunicipality of BolinaoClockwise from top:  Saint James the Great Parish Church, Silaki Island giant clams, a resort with scenic seascape, scattered rock formations across the shore, Cape Bolinao Lighthouse, Patar Beach, and Bolinao Municipal Hall."
        ],
        [
            "SealMotto: Bayan KoMap of Pangasinan with Bolinao highlightedOpenStreetMapBolinaoLocation within the PhilippinesCoordinates: 16°23′17″N 119°53′41″E﻿ / ﻿16.3881°N 119.8947°E﻿ / 16.3881; 119.8947CountryPhilippinesRegionIlocos RegionProvincePangasinanDistrict"
        ],
        [
            "1st districtFoundedJuly 25, 1575Barangays30"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAlfonso D. Celeste • Vice MayorRichard C. Celeste • RepresentativeArnold D. Celeste • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Gregorio C. CelesteCarolina M. AbadJasmin C. CambaJoven C. CaasiJesus E. dela Cruz Jr.Jonumer V. CaasiRey Carlo I. CelesteGabriel C. Castellano"
        ],
        [
            " • Electorate48,329 voters (2022)Area • Revenue₱ 293.7 million (2020) • Assets₱ 866.3 million (2020) • Expenditure₱ 227.3 million (2020) • Liabilities₱ 139.5 million (2020)Service provider • ElectricityPangasinan 1 Electric Cooperative (PANELCO 1)Time zoneUTC+8 (PST)ZIP code2406PSGC015514000IDD : area code +63 (0)75Native languagesBolinao Pangasinan Ilocano Tagalog Sambal"
        ],
        [
            "Bolinao, officially the Municipality of Bolinao (Bolinao: Babali nin Bolinao; Pangasinan: Baley na Bolinao; Ilocano: Ili ti Bolinao; Tagalog: Bayan ng Bolinao), is a 1st class municipality in the province of Pangasinan, Philippines.",
            "According to the 2020 census, it has a population of 83,979 people."
        ],
        [
            "Sea urchins are regularly harvested at Isla Silaki, Bolinao.",
            "The town, aside from being a fishing domain, is also a heritage site in the Philippines, possessing an olden church surrounded by heritage houses.",
            "The town is also the location of the cave where the gold-teeth Bolinao Skulls with fish scale designs were found.",
            "Scholars have been pushing for the town's cultural landscape into the UNESCO World Heritage List."
        ],
        [
            "Etymology"
        ],
        [
            "Folk etymology attributes the name \"Bolinao\", a remote fishing enclave, from the fish specie \"monamon\" commonly called \"bolinao\" by the Tagalogs, Bicolanos and the Visayans.",
            "A theory also points out that once upon a time \"pamulinawen\" trees grew luxuriantly along its shores, thus, the Ilocano migrants who crossed Lingayen Gulf named it phonetically similar to the name of the tree in their language.",
            "Nowadays, however, such tree does not exist in abundance in the area."
        ],
        [
            "History"
        ],
        [
            "Spanish colonization era"
        ],
        [
            "An account"
        ],
        [
            "According to oral history, the town of Bolinao used to be a small settlement in what is now Barrio Binabalian in Santiago Island, then having a population of just over a hundred families.",
            "It is said that Captain Pedro Lombi founded the town of Bolinao in 1575.",
            "A decade later, Dominican Friar Esteban Marin became the first Spanish missionary to evangelize the people of Bolinao.",
            "For two years, he worked in Bolinao before he was assigned as prior in Batac, Ilocos Norte."
        ],
        [
            "The Dominicans ended their service in 1607 to be replaced by the Augustinian Recollects headed by Fr.",
            "Jeronimo de Cristo and Dr. Andres del Espiritu Santo.",
            "At this time, the old town of Bolinao was still located along the coast of Pangasinan.",
            "Due to pirate attacks, the town was transferred to the mainland in 1609.",
            "Ilocano settlers from Paoay, Ilocos Norte moved & stayed in the town to increase the small population of the town."
        ],
        [
            "This town formerly included the neighboring town of Anda, but Anda became an independent municipality on May 26, 1849."
        ],
        [
            "American occupation era"
        ],
        [
            "In 1903, Bolinao was separated from Zambales and was annexed to Pangasinan by virtue of Act No.",
            "1004."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "Japanese forces landed and occupied Bolinao in December 1941 and established a military garrison.",
            "A joint military force of American, Australian and Philippine Commonwealth troops, including local resistance fighters, liberated Bolinao in January 1945."
        ],
        [
            "Contemporary"
        ],
        [
            "First Mass"
        ],
        [
            "On November 18, 2007, Bolinao challenged the belief that the first Mass in the Philippines was held on March 31, 1521, Easter Sunday, at Limasawa in Southern Leyte.",
            "Memorial markers (donated by Italian priest Luigi Malamocco, 62, from Odorico's hometown of Friuli, Italy) were set in the town's church and on Santiago Island, claiming that in 1324, Franciscan missionaries led by an Italian priest named Odorico celebrated a thanksgiving Mass thereat and also baptized natives."
        ],
        [
            "Hard coal spill"
        ],
        [
            "Bolinao Mayor Alfonso Celeste said the local government will file damage suit against Indonesian owners of the barge APOL 3003.",
            "The University of the Philippines Marine Science Institute (UPMSI) stated that the environmental damage was P 54.9 million ($1 =- P 40).",
            "The barge towed by a tug boat from Indonesia to the power plant in Sual, Pangasinan on November 27 when Typhoon \"Mina\"  winds destroyed its anchor and rope, then hurled to Ilog Malino reef, spilling 95% of its coal cargo.",
            "The hard coal spill spread to 330,000 square metres of coral and sea grass areas."
        ],
        [
            "Bolinao Skull"
        ],
        [
            "Main article: Bolinao Skull"
        ],
        [
            "The Bolinao Skull is a skull dated between the 14th and 15th centuries A.D. recovered in the Balingasay archeological site in Bolinao.",
            "The Bolinao Skull is the most well known artifact from the site, noted for the intricate gold ornamentation formed in the shape of scales on the surfaces of its teeth.",
            "However, 67 other skulls containing teeth with less extensive gold ornamentation were also found at the Balingasay site.",
            "The skull is now displayed within the National Museum of Anthropology in Manila."
        ],
        [
            "Santiago Island"
        ],
        [
            "This year's construction of the PHP1.95 billion 600 linear meter bridge, approaches and access roads will connect Santiago Island's Barangay Salud to Barangay Luciente 2nd, Bolinao.",
            "Municipal Administrator Blesilda Ramirez explained it takes 20 minutes travel time from Barangay Binabalian to Picucubuan Port, Luciente 1st, Bolinao.",
            "Department of Public Works and Highways Ilocos Region Director Engineer Ronnel Tan said the bridge is expected to be completed in 2028."
        ],
        [
            "Geography"
        ],
        [
            "Bolinao is the northernmost town in the province, with many white-sand beaches.",
            "It is 81 kilometers (50 mi) from Lingayen and 287 kilometers (178 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Bolinao is politically subdivided into 30 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Arnedo"
        ],
        [
            "Balingasay"
        ],
        [
            "Binabalian"
        ],
        [
            "Cabuyao"
        ],
        [
            "Catuday"
        ],
        [
            "Catungi"
        ],
        [
            "Concordia (Poblacion)"
        ],
        [
            "Culang"
        ],
        [
            "Dewey"
        ],
        [
            "Estanza"
        ],
        [
            "Germinal (Poblacion)"
        ],
        [
            "Goyoden"
        ],
        [
            "Ilog-Malino"
        ],
        [
            "Lambes"
        ],
        [
            "Liwa-liwa"
        ],
        [
            "Lucero"
        ],
        [
            "Luciente 1.0 (J.Celeste)"
        ],
        [
            "Luciente 2.0"
        ],
        [
            "Luna"
        ],
        [
            "Patar"
        ],
        [
            "Pilar"
        ],
        [
            "Salud"
        ],
        [
            "Samang Norte"
        ],
        [
            "Samang Sur"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Roque"
        ],
        [
            "Tara"
        ],
        [
            "Tupa"
        ],
        [
            "Victory"
        ],
        [
            "Zaragoza"
        ],
        [
            "NOTE: The barangays listed in italics indicate that they are located within Santiago Island."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bolinao, Pangasinan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(74)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "4.3(0.17)"
        ],
        [
            "19.1(0.75)"
        ],
        [
            "27.3(1.07)"
        ],
        [
            "45.2(1.78)"
        ],
        [
            "153.3(6.04)"
        ],
        [
            "271.3(10.68)"
        ],
        [
            "411.1(16.19)"
        ],
        [
            "532.0(20.94)"
        ],
        [
            "364.4(14.35)"
        ],
        [
            "182.5(7.19)"
        ],
        [
            "56.3(2.22)"
        ],
        [
            "24.4(0.96)"
        ],
        [
            "2,091.2(82.34)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "5"
        ],
        [
            "14"
        ],
        [
            "17"
        ],
        [
            "22"
        ],
        [
            "23"
        ],
        [
            "21"
        ],
        [
            "13"
        ],
        [
            "7"
        ],
        [
            "4"
        ],
        [
            "134"
        ],
        [
            "Source: World Weather Online (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BolinaoYearPop.±% p.a.1903 6,075—    1918 9,643+3.13%1939 14,914+2.10%1948 19,391+2.96%1960 26,005+2.48%1970 30,903+1.74%1975 34,408+2.18%1980 39,335+2.71%YearPop.±% p.a.1990 49,202+2.26%1995 53,127+1.45%2000 61,068+3.03%2007 69,568+1.81%2010 74,545+2.55%2015 82,084+1.85%2020 83,979+0.45%Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "Main article: Bolinao language"
        ],
        [
            "The word Bolinao is a term used for the name of the town, the people, and the language."
        ],
        [
            "The Bolinao people generally speak Pangasinan, Ilocano, Tagalog, and their own unique native language called Bolinao, which is also used in the nearby town of Anda, a former barangay of Bolinao.",
            "The Bolinao language is closely related to Sambal, both are Sambalic languages.",
            "Bolinao was part of the province of Zambales from the mid-18th century before being turned over to Pangasinan in 1903.",
            "Most locals generally understand and speak English."
        ],
        [
            "The Mother Tongue Policy of the Department of Education is enforced in the elementary schools of these barangays to empower the native languages in town."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bolinao"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  35.70"
        ],
        [
            "2009  28.67"
        ],
        [
            "2012  12.47"
        ],
        [
            "2015  16.87"
        ],
        [
            "2018  16.28"
        ],
        [
            "2021  23.80"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Bolinao, belonging to the first congressional district of the province of Pangasinan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Arnold F. Celeste"
        ],
        [
            "Mayor"
        ],
        [
            "Alfonso F. Celeste"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Richard C. Celeste"
        ],
        [
            "Councilors"
        ],
        [
            "Gregorio C. Celeste"
        ],
        [
            "Carolina M. Abad"
        ],
        [
            "Jasmin C. Camba"
        ],
        [
            "Joven C. Caasi"
        ],
        [
            "Jesus E. Dela Cruz Jr."
        ],
        [
            "Jonumber V. Caasi"
        ],
        [
            "Rey Carlo I. Celeste"
        ],
        [
            "Gabriel C. Castellano"
        ],
        [
            "Education"
        ],
        [
            "Tertiary schools"
        ],
        [
            "Bolinao Lighthouse School of Tourism and Learning Center Ilog-Malino Campus"
        ],
        [
            "Secondary"
        ],
        [
            "Public schools:"
        ],
        [
            "Arnedo National High School"
        ],
        [
            "Balingasay National High School"
        ],
        [
            "Binabalian National High School"
        ],
        [
            "Bolinao School of Fisheries"
        ],
        [
            "Catubig Integrated School"
        ],
        [
            "Catuday National High School"
        ],
        [
            "Dewey National High School"
        ],
        [
            "Ilog-Malino National High School"
        ],
        [
            "Liwa-liwa Integrated School"
        ],
        [
            "Luciente II National High School"
        ],
        [
            "Luna National High School"
        ],
        [
            "Pilar National High School"
        ],
        [
            "Sampaloc National High School"
        ],
        [
            "Tupa Integrated School"
        ],
        [
            "Zaragoza National High School"
        ],
        [
            "Private School"
        ],
        [
            "Cape Bolinao High School"
        ],
        [
            "Images"
        ],
        [
            "Sunny white beach at Rock Garden Resort, Bolinao"
        ],
        [
            "Patar White Beach, only walking distance to Cape Bolinao's Lighthouse"
        ],
        [
            "See also"
        ],
        [
            "Cape Bolinao Lighthouse"
        ],
        [
            "Bolinao 52, a 2007 documentary film"
        ],
        [
            "Saint James the Great Parish Church (Bolinao)"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bolinao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Sea creatures of Silaki\".",
            "GMA News.",
            "Archived from the original on March 12, 2009.",
            "Retrieved January 18, 2008."
        ],
        [
            "^ a b St. James the Great Parish, Bolinao, Pangasinan @405.",
            "Bolinao Church Parish Office.",
            "July 25, 2014."
        ],
        [
            "^ Act No.",
            "1004 (November 20, 1903), \"An Act Annexing the Northern Part of the Province of Zambales to the Province of Pangasinan and Providing That the Southern Part Thereof Shall Continue as Separate Province Under the Name of Zambales\", Senate of the Philippines Legislative Digital Resources, retrieved July 8, 2023"
        ],
        [
            "^ Inquirer.net, Bolinao stakes claim to Mass held in 1324 Archived March 12, 2009, at the Wayback Machine"
        ],
        [
            "^ Inquirer.net, Bolinao to sue barge owners for coal spill Archived March 12, 2009, at the Wayback Machine"
        ],
        [
            "^ \"VCM\".",
            "masterpieces.asemus.museum.",
            "Archived from the original on March 3, 2016.",
            "Retrieved May 16, 2016."
        ],
        [
            "^ Austria, Hilda (May 31, 2024).",
            "\"Bridge to boost mobility, economy of Santiago Island\".",
            "Philippine News Agency.",
            "Retrieved June 2, 2024."
        ],
        [
            "^ \"Bolinao, Philippines: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Archived from the original on October 6, 2014.",
            "Retrieved September 15, 2014."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Pangasinan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 6, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Bolinao."
        ],
        [
            "Official Bolinao tourism website Archived January 25, 2021, at the Wayback Machine"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Bolinao at the Pangasinan Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Cape Bolinao Lighthouse in Lighthouse Digest's Lighthouse Explorer Database"
        ],
        [
            "Places adjacent to Bolinao"
        ],
        [
            "South China Sea"
        ],
        [
            "Lingayen Gulf"
        ],
        [
            "South China Sea"
        ],
        [
            "Bolinao"
        ],
        [
            "Anda"
        ],
        [
            "Bani"
        ],
        [
            "vte Province of PangasinanLingayen (capital)  San Carlos City (largest city)Municipalities"
        ],
        [
            "Agno"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Anda"
        ],
        [
            "Asingan"
        ],
        [
            "Balungao"
        ],
        [
            "Bani"
        ],
        [
            "Basista"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos"
        ],
        [
            "Calasiao"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lingayen"
        ],
        [
            "Mabini"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Natividad"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Rosales"
        ],
        [
            "San Fabian"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Quintin"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sison"
        ],
        [
            "Sual"
        ],
        [
            "Tayug"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "San Carlos"
        ],
        [
            "Urdaneta"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan (Administratively independent from the province but grouped under Pangasinan by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Pangasinan"
        ],
        [
            "vte Local Government Units of One Pangasinan Alliance"
        ],
        [
            "Alaminos"
        ],
        [
            "Agno"
        ],
        [
            "Anda"
        ],
        [
            "Bani"
        ],
        [
            "Bolinao"
        ],
        [
            "Burgos"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Mabini"
        ],
        [
            "Sual"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bolinao&oldid=1226855961\""
        ],
        [
            "Categories: Municipalities of PangasinanBeaches of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from March 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from May 2019Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textArticles needing more detailed referencesAll articles with specifically marked weasel-worded phrasesArticles with specifically marked weasel-worded phrases from April 2018All articles with unsourced statementsArticles with unsourced statements from December 2021Commons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}