{
    "name": "Bongao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bongao"
        ],
        [
            "27 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuBahasa MelayuNederlands日本語Norsk bokmålPangasinanPortuguêsSimple EnglishSvenskaTagalogไทยاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 5°01′45″N 119°46′23″E﻿ / ﻿5.02917°N 119.77306°E﻿ / 5.02917; 119.77306"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Capital of Tawi-Tawi, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Bongao\" – news · newspapers · books · scholar · JSTOR (September 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bangsamoro Autonomous Region in Muslim Mindanao, PhilippinesBongao"
        ],
        [
            "بوڠااوMunicipalityMunicipality of BongaoAerial view of the Bongao Coast"
        ],
        [
            "FlagSealMap of Tawi-Tawi with Bongao highlightedOpenStreetMapBongaoLocation within the PhilippinesCoordinates: 5°01′45″N 119°46′23″E﻿ / ﻿5.02917°N 119.77306°E﻿ / 5.02917; 119.77306CountryPhilippinesRegionBangsamoro Autonomous Region in Muslim MindanaoProvinceTawi-TawiDistrict"
        ],
        [
            "Lone districtFoundedJuly 1, 1958Barangays35"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJimuel S. Que • Vice MayorJasper S. Que • RepresentativeDimszar M. Sali • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Talib Q. Ibbo Jr.Mon Harris T. SamsuyaRufaida S. AkipMidzfar H. PajijiAcmed H. KalbitHussin Lhong S. KaranainNagder A. SangkulaKhaizal A. Jumdail"
        ],
        [
            " • Electorate62,285 voters (2022)Area • Revenue₱ 291.9 million (2020) • Assets₱ 212 million (2020) • Expenditure₱ 259.5 million (2020) • Liabilities₱ 57.8 million (2020)Service provider • ElectricityTawi Tawi Electric Cooperative (TAWELCO)Time zoneUTC+8 (PST)ZIP code7500PSGC157002000IDD : area code +63 (0)68Native languagesSama Tagalog Sabah MalayWebsitewww.bongao.gov.ph"
        ],
        [
            "Bongao, officially the Municipality of Bongao (Tagalog: Bayan ng Bongao),  is a 2nd class municipality and capital of the province of Tawi-Tawi, Philippines.",
            "According to the 2020 census, it has a population of 116,118 people."
        ],
        [
            "History"
        ],
        [
            "Aerial view of Bongao Island, circa pre-1942"
        ],
        [
            "Bud Bongao, a 250-hectare (620-acre) mountain-forest located within the municipality"
        ],
        [
            "Evidence of human presence in Bongao was carbon-dated to be 8,810 to 5,190 years old, signifying one of the earliest known evidence of human presence in Southeast Asia.",
            "The bones, jars, shells, and other artifacts and fossils were found in the Bolobok Rock Shelter Cave Archaeological Site, which has been declared as an Important Cultural Treasure by the government in 2017."
        ],
        [
            "Much of the Bongao area was the center of Bajau culture and arts for hundreds of years.",
            "By the 14th century, Muslim missionaries from Arabia arrived and established the first ever mosque in the Philippines.",
            "The area was heavily converted to Islam, especially when the Sultanate of Sulu in nearby Sulu province was founded."
        ],
        [
            "The province of Tawi-tawi was never officially controlled directly by the Spanish as the Sultanate of Sulu was in a perpetual war with Spain, resulting to the preservation of its Muslim and Bajau cultures.",
            "However, the sultanate waned and was captured by Spain, only to be handed to American forces after a few years.",
            "Sibutu remained under Spanish rule until 1900."
        ],
        [
            "Bongao was formally incorporated as a municipality on July 1, 1958 under Executive Order No.",
            "355 signed by President Carlos P. Garcia."
        ],
        [
            "Before the armed rebellion of the MNLF in the early 1970s, Bongao was merely a backwater village ruled by the prominent noble Halun family, who used to own about three-quarters of the island.",
            "The capital of the province was Batu-Batu (in Panglima Sugala) in the mainland situated in a cove with deep waters suited for anchors of the Philippine Navy.",
            "At the height of the armed rebellion and fearing that the provincial capitol might be overrun, the government transferred it to Bongao.",
            "The white-washed, Taj Mahal-inspired provincial capitol building is located on a hill overlooking the bay and the whole town to the North of the Island against the backdrop of Mount Kabugan and the famous Bud Bongao (Bongao Peak)."
        ],
        [
            "The transfer of the seat of government ushered the rapid development of the island as the southernmost center of commerce and trade.",
            "Suddenly, the population swelled as individuals (and their families) who are in government service moved to the town."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "In the 19th Congress of the Philippines, house bills were filed by various representatives which seeks Bongao including other capital towns of provinces with no current component cities, independent component cities or highly urbanized cities to automatically convert into cities."
        ],
        [
            "Geography"
        ],
        [
            "The municipality's territory includes Bongao Island (where the poblacion is located), Sanga-Sanga Island, Pababag Island, as well as the western end of Tawi-Tawi Island."
        ],
        [
            "Barangays"
        ],
        [
            "Bongao is politically subdivided into 35 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "These barangays are split into two geographical regions: Mainland and Islands."
        ],
        [
            "Ipil - M"
        ],
        [
            "Kamagong - M"
        ],
        [
            "Karungdong- I"
        ],
        [
            "Lakit Lakit- I"
        ],
        [
            "Lamion- I"
        ],
        [
            "Lapid Lapid - M"
        ],
        [
            "Lato Lato- I"
        ],
        [
            "Luuk Pandan - I"
        ],
        [
            "Luuk Tulay - M"
        ],
        [
            "Malassa- I"
        ],
        [
            "Mandulan- I"
        ],
        [
            "Masantong - M"
        ],
        [
            "Montay Montay - M"
        ],
        [
            "Pababag - I"
        ],
        [
            "Pagasinan - I"
        ],
        [
            "Pahut- I"
        ],
        [
            "Pakias- I"
        ],
        [
            "Paniongan- I"
        ],
        [
            "Pasiagan - I"
        ],
        [
            "Bongao Poblacion- I"
        ],
        [
            "Sanga-Sanga- I"
        ],
        [
            "Silubog - M"
        ],
        [
            "Simandagit- I"
        ],
        [
            "Sumangat - M"
        ],
        [
            "Tarawakan - M"
        ],
        [
            "Tongsinah- I"
        ],
        [
            "Tubig Basag- I"
        ],
        [
            "Ungus-ungus - M"
        ],
        [
            "Lagasan- I"
        ],
        [
            "Nalil- I"
        ],
        [
            "Pagatpat - M"
        ],
        [
            "Pag-asa - I"
        ],
        [
            "Tubig Tanah- I"
        ],
        [
            "Tubig-Boh- I"
        ],
        [
            "Tubig-Mampallam- I"
        ],
        [
            "Climate"
        ],
        [
            "Bongao has a tropical rainforest climate (Af) with heavy rainfall year-round."
        ],
        [
            "Climate data for Bongao"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.6(85.3)"
        ],
        [
            "29.6(85.3)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "30.9(87.6)"
        ],
        [
            "31.5(88.7)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "31.0(87.8)"
        ],
        [
            "30.5(86.9)"
        ],
        [
            "30.0(86.0)"
        ],
        [
            "30.7(87.2)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.1(79.0)"
        ],
        [
            "26.1(79.0)"
        ],
        [
            "26.4(79.5)"
        ],
        [
            "26.7(80.1)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "26.7(80.1)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "26.7(80.1)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "26.3(79.3)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.9(73.2)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.4(72.3)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.4(72.3)"
        ],
        [
            "22.5(72.5)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "177(7.0)"
        ],
        [
            "146(5.7)"
        ],
        [
            "123(4.8)"
        ],
        [
            "126(5.0)"
        ],
        [
            "179(7.0)"
        ],
        [
            "178(7.0)"
        ],
        [
            "144(5.7)"
        ],
        [
            "118(4.6)"
        ],
        [
            "132(5.2)"
        ],
        [
            "183(7.2)"
        ],
        [
            "196(7.7)"
        ],
        [
            "172(6.8)"
        ],
        [
            "1,874(73.7)"
        ],
        [
            "Source: Climate-Data.org"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BongaoYearPop.±% p.a.1903 1,854—    1918 3,486+4.30%1939 4,510+1.23%1948 5,626+2.49%1960 10,822+5.60%1970 20,983+6.84%1975 20,560−0.41%1980 27,884+6.28%1990 37,932+3.13%1995 46,672+3.96%2000 58,174+4.84%2007 95,055+7.01%2010 79,362−6.36%2015 100,527+4.61%2020 116,118+2.88%Source: Philippine Statistics Authority"
        ],
        [
            "Bongao poblacion"
        ],
        [
            "Culture"
        ],
        [
            "Today, Bongao is a minuscule cosmopolitan site that is becoming a model of multicultural society.",
            "In downtown Bongao, there are mosques for the majority Muslim population, a Catholic church, a church for Protestant inhabitants, and a Chinese temple."
        ],
        [
            "The municipality is the home of the Balobok Rock Shelter-Cave Archaeological Site, which carbon dates the existence of humans on Tawi-Tawi for 5,000-8,000 years, making it one of the earliest human settlement site in Southeast Asia.",
            "The entire archaeological site has been declared as an Important Cultural Property by the National Government in 2017."
        ],
        [
            "Economy"
        ],
        [
            "Poverty Incidence of Bongao"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2000  48.47"
        ],
        [
            "2003  34.60"
        ],
        [
            "2006  39.40"
        ],
        [
            "2009  27.66"
        ],
        [
            "2012  41.70"
        ],
        [
            "2015  21.97"
        ],
        [
            "2018  17.29"
        ],
        [
            "2021  22.05"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The main thoroughfare is Datu Halun Street, where the Town Hall is situated.",
            "Poblacion is the commercial hub.",
            "Most of the businesses here are owned by local people.",
            "Due to its relative peace and order situation, recent migrant Chinese from Zamboanga have also open business."
        ],
        [
            "Banks operating in Bongao include Land Bank of the Philippines, Philippine National Bank, and Metrobank.",
            "Quedancor, a government owned investment company, has recently opened business."
        ],
        [
            "The Midway Plaza Mall, a new 2-storey retail center, is the first shopping mall in Tawi-tawi opened in April 2010."
        ],
        [
            "Education"
        ],
        [
            "Bongao is home to the Mindanao State University - Tawi-Tawi College of Technology and Oceanography (MSU-TCTO), Tawi-Tawi Regional Agricultural College (TRAC), Mahardika Institute of Technology (MIT), Abubakar Learning Center Foundation College (ALC), Tawi-Tawi School of Midwifery (TTSM).",
            "The first two are government owned state colleges, while the last three are privately owned."
        ],
        [
            "There are several secondary high schools in Tawi-Tawi such as the MSU TCTO - Science High School, MSU TCTO Preparatory High School, Tawi-Tawi School of Arts and Trade, Notre Dame of Bongao, and Tawi-Tawi School of Fisheries (TTSF)."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bongao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ \"2020 Census of Population and Housing (2020 CPH) Population Counts Declared Official by the President\".",
            "2020 census of the Philippines.",
            "Philippine Statistics Authority.",
            "July 7, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Census of Population (2020).",
            "\"Bangsamoro (BARMM)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"Tawi-tawi: Glimpse of pre-historic life at Balobok Rock Shelter | Ironwulf en Route\".",
            "Archived from the original on October 25, 2019.",
            "Retrieved August 1, 2017."
        ],
        [
            "^ \"CONVERTING INTO MUNICIPALITIES ALL THE MUNICIPAL DISTRICTS IN THE PROVINCE OF SULU, EXCEPT MARUNGAS\".",
            "Retrieved October 29, 2023."
        ],
        [
            "^ Yap, Eric (June 30, 2022).",
            "\"AN ACT AUTOMATICALLY CONVERTING THE CAPITAL TOWN OF PROVINCES WITH NO COMPONENT CITIES, INDEPENDENT COMPONENT CITIES OR HIGHLY URBANIZED CITIES WITHIN ITS TERRITORIAL JURISDICTION, INTO A COMPONENT CITY\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved April 1, 2023."
        ],
        [
            "^ Palma, Wilter (August 9, 2022).",
            "\"AN ACT AUTOMATICALLY CONVERTING THE CAPITAL TOWN OF PROVINCES WITH NO COMPONENT CITIES, INDEPENDENT COMPONENT CITIES, OR HIGHLY URBANIZED CITIES WITHIN ITS TERRITORIAL JURISDICTION, INTO A COMPONENT CITY\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved April 1, 2023."
        ],
        [
            "^ Daza, Paul (August 11, 2022).",
            "\"AN ACT CONVERING INTO COMPONENT CITIES THE CAPITAL TOWNS OF PROVINCES WITHOUT A CITY, AMENDING FOR THE PURPOSE SECTION 450 OF REPUBLIC ACT NO.",
            "7610, AS AMENDED BY REPUBLIC ACT NO.",
            "9009, OTHERWISE KNOWN AS THE LOCAL GOVERNMENT CODE OF 1991, AND FOR OTHER PURPOSES\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved April 1, 2023."
        ],
        [
            "^ \"Climate: Bongao\".",
            "Climate-Data.org.",
            "Retrieved October 25, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Tawi‑tawi\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Tawi-tawi: Glimpse of pre-historic life at Balobok Rock Shelter | Ironwulf en Route\".",
            "Archived from the original on October 25, 2019.",
            "Retrieved August 1, 2017."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Bongao."
        ],
        [
            "Bongao Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Bongao Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Bongao"
        ],
        [
            "Sulu Sea"
        ],
        [
            "Languyan"
        ],
        [
            " Lahad Datu, Sabah"
        ],
        [
            "Bongao"
        ],
        [
            "Panglima Sugala"
        ],
        [
            "Sibutu / Sibutu Passage"
        ],
        [
            "Simunul"
        ],
        [
            "vte Province of Tawi-TawiBongao (capital)Municipalities"
        ],
        [
            "Bongao"
        ],
        [
            "Languyan"
        ],
        [
            "Mapun"
        ],
        [
            "Panglima Sugala"
        ],
        [
            "Sapa-Sapa"
        ],
        [
            "Sibutu"
        ],
        [
            "Simunul"
        ],
        [
            "Sitangkai"
        ],
        [
            "South Ubian"
        ],
        [
            "Tandubas"
        ],
        [
            "Turtle Islands"
        ],
        [
            "vte Bangsamoro Autonomous Region in Muslim Mindanao (BARMM)Regional center"
        ],
        [
            "Cotabato City (de facto)"
        ],
        [
            "Parang, Maguindanao del Norte (de jure)"
        ],
        [
            "Provinces"
        ],
        [
            "Basilan"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Sulu"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Independent component cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Component cities"
        ],
        [
            "Lamitan"
        ],
        [
            "Marawi"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Bongao"
        ],
        [
            "Buluan"
        ],
        [
            "Datu Odin Sinsuat"
        ],
        [
            "Jolo"
        ],
        [
            "Lamitan"
        ],
        [
            "Marawi"
        ],
        [
            "Municipalities"
        ],
        [
            "Akbar"
        ],
        [
            "Al-Barka"
        ],
        [
            "Amai Manabilang"
        ],
        [
            "Ampatuan"
        ],
        [
            "Bacolod-Kalawi"
        ],
        [
            "Balabagan"
        ],
        [
            "Balindong"
        ],
        [
            "Banguingui"
        ],
        [
            "Barira"
        ],
        [
            "Bayang"
        ],
        [
            "Binidayan"
        ],
        [
            "Bongao"
        ],
        [
            "Buadiposo-Buntong"
        ],
        [
            "Bubong"
        ],
        [
            "Buldon"
        ],
        [
            "Buluan"
        ],
        [
            "Butig"
        ],
        [
            "Calanogas"
        ],
        [
            "Datu Abdullah Sangki"
        ],
        [
            "Datu Anggal Midtimbang"
        ],
        [
            "Datu Blah T. Sinsuat"
        ],
        [
            "Datu Hoffer Ampatuan"
        ],
        [
            "Datu Montawal"
        ],
        [
            "Datu Odin Sinsuat"
        ],
        [
            "Datu Paglas"
        ],
        [
            "Datu Piang"
        ],
        [
            "Datu Salibo"
        ],
        [
            "Datu Saudi-Ampatuan"
        ],
        [
            "Datu Unsay"
        ],
        [
            "Ditsaan-Ramain"
        ],
        [
            "Ganassi"
        ],
        [
            "General Salipada K. Pendatun"
        ],
        [
            "Guindulungan"
        ],
        [
            "Hadji Mohammad Ajul"
        ],
        [
            "Hadji Muhtamad"
        ],
        [
            "Hadji Panglima Tahil"
        ],
        [
            "Indanan"
        ],
        [
            "Jolo"
        ],
        [
            "Kabuntalan"
        ],
        [
            "Kadayangan"
        ],
        [
            "Kalingalan Caluang"
        ],
        [
            "Kapai"
        ],
        [
            "Kapalawan"
        ],
        [
            "Kapatagan"
        ],
        [
            "Languyan"
        ],
        [
            "Lantawan"
        ],
        [
            "Ligawasan"
        ],
        [
            "Lugus"
        ],
        [
            "Lumba-Bayabao"
        ],
        [
            "Lumbaca-Unayan"
        ],
        [
            "Lumbatan"
        ],
        [
            "Lumbayanague"
        ],
        [
            "Luuk"
        ],
        [
            "Madalum"
        ],
        [
            "Madamba"
        ],
        [
            "Maguing"
        ],
        [
            "Maimbung"
        ],
        [
            "Malabang"
        ],
        [
            "Malidegao"
        ],
        [
            "Maluso"
        ],
        [
            "Mamasapano"
        ],
        [
            "Mangudadatu"
        ],
        [
            "Mapun"
        ],
        [
            "Marantao"
        ],
        [
            "Marogong"
        ],
        [
            "Masiu"
        ],
        [
            "Matanog"
        ],
        [
            "Mulondo"
        ],
        [
            "Nabalawag"
        ],
        [
            "Old Kaabakan"
        ],
        [
            "Northern Kabuntalan"
        ],
        [
            "Old Panamao"
        ],
        [
            "Omar"
        ],
        [
            "Pagalungan"
        ],
        [
            "Pagayawan"
        ],
        [
            "Paglat"
        ],
        [
            "Pahamuddin"
        ],
        [
            "Pandag"
        ],
        [
            "Pandami"
        ],
        [
            "Panglima Estino"
        ],
        [
            "Panglima Sugala"
        ],
        [
            "Pangutaran"
        ],
        [
            "Parang (Maguindanao del Norte)"
        ],
        [
            "Parang (Sulu)"
        ],
        [
            "Pata"
        ],
        [
            "Patikul"
        ],
        [
            "Piagapo"
        ],
        [
            "Picong"
        ],
        [
            "Poona Bayabao"
        ],
        [
            "Pualas"
        ],
        [
            "Rajah Buayan"
        ],
        [
            "Saguiaran"
        ],
        [
            "Sapa-Sapa"
        ],
        [
            "Shariff Aguak"
        ],
        [
            "Shariff Saydona Mustapha"
        ],
        [
            "Siasi"
        ],
        [
            "Sibutu"
        ],
        [
            "Simunul"
        ],
        [
            "Sitangkai"
        ],
        [
            "South Ubian"
        ],
        [
            "South Upi"
        ],
        [
            "Sultan Dumalondong"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sultan Mastura"
        ],
        [
            "Sultan sa Barongis"
        ],
        [
            "Sumisip"
        ],
        [
            "Tabuan-Lasa"
        ],
        [
            "Tagoloan II"
        ],
        [
            "Talayan"
        ],
        [
            "Talipao"
        ],
        [
            "Talitay"
        ],
        [
            "Tamparan"
        ],
        [
            "Tandubas"
        ],
        [
            "Tapul"
        ],
        [
            "Taraka"
        ],
        [
            "Tipo-Tipo"
        ],
        [
            "Tubaran"
        ],
        [
            "Tuburan"
        ],
        [
            "Tugaya"
        ],
        [
            "Tugunan"
        ],
        [
            "Turtle Islands"
        ],
        [
            "Ungkaya Pukan"
        ],
        [
            "Upi"
        ],
        [
            "Wao"
        ],
        [
            "Other"
        ],
        [
            "Special Geographic Area"
        ],
        [
            "Clusters"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vte Provincial capital cities and municipalities of the PhilippinesLuzon"
        ],
        [
            "Abra: Bangued"
        ],
        [
            "Albay: Legazpi"
        ],
        [
            "Apayao: Kabugao / Luna1"
        ],
        [
            "Aurora: Baler"
        ],
        [
            "Bataan: Balanga"
        ],
        [
            "Batanes: Basco"
        ],
        [
            "Batangas: Batangas City"
        ],
        [
            "Benguet: La Trinidad"
        ],
        [
            "Bulacan: Malolos"
        ],
        [
            "Cagayan: Tuguegarao"
        ],
        [
            "Camarines Norte: Daet"
        ],
        [
            "Camarines Sur: Pili"
        ],
        [
            "Catanduanes: Virac"
        ],
        [
            "Cavite: Imus / Trece Martires1"
        ],
        [
            "Ifugao: Lagawe"
        ],
        [
            "Ilocos Norte: Laoag"
        ],
        [
            "Ilocos Sur: Vigan"
        ],
        [
            "Isabela: Ilagan"
        ],
        [
            "Kalinga: Tabuk"
        ],
        [
            "La Union: San Fernando"
        ],
        [
            "Laguna: Santa Cruz"
        ],
        [
            "Marinduque: Boac"
        ],
        [
            "Masbate: Masbate City"
        ],
        [
            "Mountain Province: Bontoc"
        ],
        [
            "Nueva Ecija: Palayan"
        ],
        [
            "Nueva Vizcaya: Bayombong"
        ],
        [
            "Occidental Mindoro: Mamburao"
        ],
        [
            "Oriental Mindoro: Calapan"
        ],
        [
            "Palawan: Puerto Princesa"
        ],
        [
            "Pampanga: San Fernando"
        ],
        [
            "Pangasinan: Lingayen"
        ],
        [
            "Quezon: Lucena"
        ],
        [
            "Quirino: Cabarroguis"
        ],
        [
            "Rizal: Antipolo"
        ],
        [
            "Romblon: Romblon"
        ],
        [
            "Sorsogon: Sorsogon City"
        ],
        [
            "Tarlac: Tarlac City"
        ],
        [
            "Zambales: Iba"
        ],
        [
            "Visayas"
        ],
        [
            "Aklan: Kalibo"
        ],
        [
            "Antique: San Jose de Buenavista"
        ],
        [
            "Biliran: Naval"
        ],
        [
            "Bohol: Tagbilaran"
        ],
        [
            "Capiz: Roxas"
        ],
        [
            "Cebu: Cebu City"
        ],
        [
            "Eastern Samar: Borongan"
        ],
        [
            "Guimaras: Jordan"
        ],
        [
            "Iloilo: Iloilo City"
        ],
        [
            "Leyte: Tacloban"
        ],
        [
            "Negros Occidental: Bacolod"
        ],
        [
            "Negros Oriental: Dumaguete"
        ],
        [
            "Northern Samar: Catarman"
        ],
        [
            "Samar: Catbalogan"
        ],
        [
            "Siquijor: Siquijor"
        ],
        [
            "Southern Leyte: Maasin"
        ],
        [
            "Mindanao"
        ],
        [
            "Agusan del Norte: Cabadbaran / Butuan1"
        ],
        [
            "Agusan del Sur: Prosperidad"
        ],
        [
            "Basilan: Lamitan / Isabela1"
        ],
        [
            "Bukidnon: Malaybalay"
        ],
        [
            "Camiguin: Mambajao"
        ],
        [
            "Cotabato: Kidapawan"
        ],
        [
            "Davao de Oro: Nabunturan"
        ],
        [
            "Davao del Norte: Tagum"
        ],
        [
            "Davao del Sur: Digos"
        ],
        [
            "Davao Occidental: Malita"
        ],
        [
            "Davao Oriental: Mati"
        ],
        [
            "Dinagat Islands: San Jose"
        ],
        [
            "Lanao del Norte: Tubod"
        ],
        [
            "Lanao del Sur: Marawi"
        ],
        [
            "Maguindanao del Norte: Datu Odin Sinsuat"
        ],
        [
            "Maguindanao del Sur: Buluan"
        ],
        [
            "Misamis Occidental: Oroquieta"
        ],
        [
            "Misamis Oriental: Cagayan de Oro"
        ],
        [
            "Sarangani: Alabel"
        ],
        [
            "South Cotabato: Koronadal"
        ],
        [
            "Sultan Kudarat: Isulan"
        ],
        [
            "Sulu: Jolo"
        ],
        [
            "Surigao del Norte: Surigao City"
        ],
        [
            "Surigao del Sur: Tandag"
        ],
        [
            "Tawi-Tawi: Bongao"
        ],
        [
            "Zamboanga del Norte: Dipolog"
        ],
        [
            "Zamboanga del Sur: Pagadian"
        ],
        [
            "Zamboanga Sibugay: Ipil"
        ],
        [
            "1 de facto seat of provincial government"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bongao&oldid=1222348123\""
        ],
        [
            "Categories: Municipalities of Tawi-TawiProvincial capitals of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2014All articles needing additional referencesUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Coordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}