{
    "name": "Borongan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Borongan"
        ],
        [
            "28 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSimple EnglishSvenskaTagalogไทยУкраїнськаاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°36′34″N 125°26′10″E﻿ / ﻿11.6094°N 125.4361°E﻿ / 11.6094; 125.4361"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Capital of Eastern Samar, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Borongan\" – news · newspapers · books · scholar · JSTOR (June 2008) (Learn how and when to remove this message)"
        ],
        [
            "Component city in Eastern Visayas, PhilippinesBoronganComponent cityCity of BoronganBaybay Boulevard"
        ],
        [
            "FlagSealNickname: City of Golden SunriseMap of Eastern Samar with Borongan highlightedOpenStreetMapBoronganLocation within the PhilippinesCoordinates: 11°36′34″N 125°26′10″E﻿ / ﻿11.6094°N 125.4361°E﻿ / 11.6094; 125.4361CountryPhilippinesRegionEastern VisayasProvinceEastern SamarDistrict"
        ],
        [
            "Lone districtFoundedSeptember 8, 1619CityhoodJune 21, 2007 (Lost cityhood in 2008 and 2010)Affirmed CityhoodFebruary 15, 2011Government  • TypeSangguniang Panlungsod • MayorJose Ivan Dayan C. Agda • Vice MayorEmmanuel T. Tiu Sonco • RepresentativeMaria Fe R. Abunda • City Council"
        ],
        [
            "List"
        ],
        [
            "• Ma.",
            "Rozene D. Daza• Anna Katrina L. Anacta-Sadac• Lyra Gel A. Limbauan• Kathlyn Jane B. Cainday• Melcho A. Arago• Glaiza G. Tiu• Renato C. Bagacay• Byron M. Suyot• Kurt Ryan R. Ty• Glenn A. EscotoDILG Masterlist of Officials"
        ],
        [
            " • Electorate50,258 voters (2022)Area • Revenue₱ 956.9 million (2020) • Assets₱ 2,145 million (2020) • Expenditure₱ 591.2 million (2020) • Liabilities₱ 442.9 million (2020)Service provider • ElectricityEastern Samar Electric Cooperative (ESAMELCO)Time zoneUTC+8 (PST)ZIP code6800PSGC082604000IDD : area code +63 (0)55Native languagesWaray TagalogWebsitewww.borongan-esamar.gov.ph"
        ],
        [
            "Borongan, officially the City of Borongan (Waray: Siyudad han Borongan;  Filipino: Lungsod ng Borongan), is a 1st class component city and capital of the province of Eastern Samar, Philippines.",
            "According to the 2020 census, it has a population of 71,961 people."
        ],
        [
            "It is also nicknamed as the \"City of the Golden Sunrise/Sunshine\" and aspiring to be the \"King City of the East\".",
            "Its cityhood was settled by the Supreme Court of the Philippines when it decided with finality on April 12, 2007, the constitutionality of its city charter, Republic Act 9394, which conferred upon and elevated the status of the municipality of Borongan into a component city of the province of Eastern Samar."
        ],
        [
            "Etymology"
        ],
        [
            "Pronounced bo-róng-gan, the name Borongan was taken from the local word \"borong\", which in the Waray-Waray language means \"fog\".",
            "The mountainous terrains surrounding Borongan is covered by a heavy veil of fog which can usually be seen during the cold and raining seasons and in the early hours of the morning.",
            "Because of this characteristic, the pre-Hispanic natives attributed the name borongan to the place, which was then a fragmented commune of households."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Borongan\" – news · newspapers · books · scholar · JSTOR (July 2022) (Learn how and when to remove this message)"
        ],
        [
            "Pre-Hispanic period"
        ],
        [
            "Boronganons were known to be fierce fighters according to William Henry Scott, who stated that, \"There was an Indio of gigantic stature called Pusong, a native of the town of Magtaon in the interior of the island of Samar and lbabao, who used to make frequent invasions of the towns of Calbiga and Libunao which are on the Samar side, but not so much around Borongan because those on that coast were much more feared.\""
        ],
        [
            "Spanish contact"
        ],
        [
            "Its development into a town, and eventually into a city, is traced back to the early 1600 out of the scattered hamlets located on the banks of the adjacent Guiborongani (Borongan or Sabang) River and Lo-om River.",
            "Guiborongani was the larger settlement and was later on called Borongan because of the heavy fog that usually covered the place.",
            "The people inhabiting the eastern coast of Samar were originally called \"Ibabao\" during the pre-Spanish period."
        ],
        [
            "As early as 1595, or 74 years after Ferdinand Magellan's landing in Homonhon (now an island barangay of Guiuan, Eastern Samar) Spanish Jesuit missionary priests from mission centers in Leyte began to evangelize the southern portion of the island of Samar.",
            "The first evangelical mission was established in Tinago, Western Samar and gradually expanded to Catubig.",
            "In 1614 Palapag was selected as the mission center of the Ibabao region or the north-eastern coast of the island; from this mission center in turn was the eastern coast of Samar subsequently evangelized.",
            "The missionaries proselytized to the inhabitants in the faith, raised stone churches, and protected the people from the Muslim predatory/piratical raids from the south.",
            "This is probably the reason why the town itself was established some distance away from the shoreline and built on a hill overlooking the northern banks of the Lo-om River."
        ],
        [
            "In fact, the old Catholic church convent has its own self-contained water supply: a deep dugout well lined with big blocks of ancient hewn stones located underneath the convent building itself.",
            "The major settlements then were Borongan, Bacod/Jubasan/Paric (now Dolores), Tubig (Taft), Sulat, Libas/Nonoc (now San Julian), Butag (now Guiuan) and Balangiga."
        ],
        [
            "The development of Borongan was greatly influenced by the religious missions of the Jesuits during the period 1604–1768, and the Franciscans from 1768 to 1868.",
            "Borongan was established as a pueblo on September 8, 1619.",
            "On this date, the Commandancia and the Very Rev.",
            "Father Superior of the Jesuits from Palapag, a town in Northern Samar, went to Ibabao to install the first priest of Borongan, Fr.",
            "Manuel Martinez, who served up to 1627."
        ],
        [
            "American occupation"
        ],
        [
            "Ang Labanan sa Borongan (1899 Himagsikang Pilipino-Amerikano) historical marker"
        ],
        [
            "At the outbreak of the Philippine Revolution in 1898, Borongan was the site of an uprising led by the Pulahanes.",
            "The first public municipal officials were Sr. Magno Abenis, President, and Sr. Andres Hipe, vice-president, who held office from 1899 to 1903.",
            "After the Japanese occupation in 1941–1945, the town was henceforth led by a mayor and a vice mayor.",
            "Hilarion Basada and Ignacio Brozas were the first mayor and vice mayor, respectively, from 1945 to 1947."
        ],
        [
            "Borongan was legally constituted as a capital town when Eastern Samar was created as a separate province under Republic Act No.",
            "4221 which was enacted on June 19, 1965.",
            "Its first municipal mayor as the capital town of Eastern Samar was Luis Capito."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "For further information, see League of Cities of the Philippines v. COMELEC."
        ],
        [
            "On June 21, 2007, Borongan became the first city in Eastern Samar.",
            "However, it subsequently lost its cityhood, along with 15 other cities, after the Supreme Court of the Philippines granted a petition filed by the League of Cities of the Philippines, and declared the cityhood law (RA 9394) which granted the town its city status, unconstitutional.",
            "The said 16 cities, the court ruled, did not meet the requirements for cityhood."
        ],
        [
            "On December 22, 2009, the cityhood law of Borongan and 15 other municipalities regain its status as cities again after the Supreme Court reversed its ruling on November 18, 2008.",
            "On August 23, 2010, the court reinstated its ruling on November 18, 2008, causing Borongan and 15 cities to become regular municipalities.",
            "Finally, on February 15, 2011, Borongan becomes a city again including the 15 municipalities declaring that the conversion to cityhood met all legal requirements."
        ],
        [
            "After six years of legal battle, in its board resolution, the League of Cities of the Philippines acknowledged and recognized the cityhood of Borongan and 15 other cities."
        ],
        [
            "Geography"
        ],
        [
            "The City of Borongan is located along the middle coastal part of the province of Eastern Samar.",
            "The city center itself is situated along the northern banks of the Lo-om River and is set back a little distance away from the shoreline of Borongan Bay.",
            "The province itself comprises a part of the Eastern Visayas region (Region VIII) of the Republic of the Philippines."
        ],
        [
            "The city is bounded on the north by the municipality of San Julian, in the south by the municipality of Maydolong, in the west by the Samar municipalities of Hinabangan, Calbiga, Pinabacdao and Basey, and in the east by the Pacific Ocean.",
            "The city's territory include the islands of Ando, Monbon, and Divinubo in Borongan Bay."
        ],
        [
            "Barangays"
        ],
        [
            "Borongan is politically subdivided into 61 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alang-alang"
        ],
        [
            "Amantacop"
        ],
        [
            "Ando"
        ],
        [
            "Balacdas"
        ],
        [
            "Balud"
        ],
        [
            "Banuyo"
        ],
        [
            "Baras"
        ],
        [
            "Bato"
        ],
        [
            "Bayobay"
        ],
        [
            "Benowangan"
        ],
        [
            "Bugas"
        ],
        [
            "Cabalagnan"
        ],
        [
            "Cabong"
        ],
        [
            "Cagbonga"
        ],
        [
            "Calico-an"
        ],
        [
            "Calingatngan"
        ],
        [
            "Campesao"
        ],
        [
            "Can-abong"
        ],
        [
            "Can-aga"
        ],
        [
            "Camada"
        ],
        [
            "Canjaway"
        ],
        [
            "Canlaray"
        ],
        [
            "Canyopay"
        ],
        [
            "Divinubo"
        ],
        [
            "Hebacong"
        ],
        [
            "Hindang"
        ],
        [
            "Lalawigan"
        ],
        [
            "Libuton"
        ],
        [
            "Locsoon"
        ],
        [
            "Maybacong"
        ],
        [
            "Maypangdan"
        ],
        [
            "Pepelitan"
        ],
        [
            "Pinanag-an"
        ],
        [
            "Purok A (Poblacion)"
        ],
        [
            "Purok B (Poblacion)"
        ],
        [
            "Purok C (Poblacion)"
        ],
        [
            "Purok D1 (Poblacion)"
        ],
        [
            "Purok D2 (Poblacion)"
        ],
        [
            "Purok E (Poblacion)"
        ],
        [
            "Purok F (Poblacion)"
        ],
        [
            "Purok G (Poblacion)"
        ],
        [
            "Purok H (Poblacion)"
        ],
        [
            "Punta Maria/Gintagikan/Point Mary"
        ],
        [
            "Sabang North"
        ],
        [
            "Sabang South"
        ],
        [
            "San Andres"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Gregorio"
        ],
        [
            "San Jose"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "San Saturnino"
        ],
        [
            "Santa Fe"
        ],
        [
            "Siha"
        ],
        [
            "Songco"
        ],
        [
            "Sohutan"
        ],
        [
            "Suribao"
        ],
        [
            "Surok"
        ],
        [
            "Taboc"
        ],
        [
            "Tabunan"
        ],
        [
            "Tamoso"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Borongan, Eastern Samar (1991–2020, extremes 1949–2020)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "34.5(94.1)"
        ],
        [
            "33.5(92.3)"
        ],
        [
            "33.8(92.8)"
        ],
        [
            "35.6(96.1)"
        ],
        [
            "37.4(99.3)"
        ],
        [
            "36.8(98.2)"
        ],
        [
            "37.8(100.0)"
        ],
        [
            "37.8(100.0)"
        ],
        [
            "37.3(99.1)"
        ],
        [
            "36.5(97.7)"
        ],
        [
            "35.5(95.9)"
        ],
        [
            "34.7(94.5)"
        ],
        [
            "37.8(100.0)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.6(85.3)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "30.5(86.9)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "32.2(90.0)"
        ],
        [
            "31.9(89.4)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.3(79.3)"
        ],
        [
            "26.3(79.3)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "27.9(82.2)"
        ],
        [
            "27.8(82.0)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "28.0(82.4)"
        ],
        [
            "27.9(82.2)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "27.3(81.1)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.9(73.2)"
        ],
        [
            "22.8(73.0)"
        ],
        [
            "23.0(73.4)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "16.6(61.9)"
        ],
        [
            "18.0(64.4)"
        ],
        [
            "16.1(61.0)"
        ],
        [
            "18.1(64.6)"
        ],
        [
            "19.6(67.3)"
        ],
        [
            "19.0(66.2)"
        ],
        [
            "19.2(66.6)"
        ],
        [
            "17.0(62.6)"
        ],
        [
            "18.3(64.9)"
        ],
        [
            "18.6(65.5)"
        ],
        [
            "18.0(64.4)"
        ],
        [
            "17.6(63.7)"
        ],
        [
            "16.1(61.0)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "697.0(27.44)"
        ],
        [
            "532.7(20.97)"
        ],
        [
            "407.3(16.04)"
        ],
        [
            "234.8(9.24)"
        ],
        [
            "220.8(8.69)"
        ],
        [
            "260.2(10.24)"
        ],
        [
            "244.0(9.61)"
        ],
        [
            "165.8(6.53)"
        ],
        [
            "193.8(7.63)"
        ],
        [
            "336.9(13.26)"
        ],
        [
            "525.3(20.68)"
        ],
        [
            "775.7(30.54)"
        ],
        [
            "4,594.3(180.88)"
        ],
        [
            "Average rainy days (≥ 1.0 mm)"
        ],
        [
            "25"
        ],
        [
            "20"
        ],
        [
            "19"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "12"
        ],
        [
            "14"
        ],
        [
            "18"
        ],
        [
            "23"
        ],
        [
            "26"
        ],
        [
            "223"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "89"
        ],
        [
            "89"
        ],
        [
            "88"
        ],
        [
            "87"
        ],
        [
            "86"
        ],
        [
            "87"
        ],
        [
            "86"
        ],
        [
            "85"
        ],
        [
            "87"
        ],
        [
            "87"
        ],
        [
            "89"
        ],
        [
            "89"
        ],
        [
            "87"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BoronganYearPop.±% p.a.1903 13,667—    1918 17,629+1.71%1939 21,340+0.91%1948 25,638+2.06%1960 24,228−0.47%1970 34,368+3.55%1975 33,129−0.73%1980 39,741+3.71%1990 44,085+1.04%1995 48,638+1.86%2000 55,141+2.73%2007 59,354+1.02%2010 64,457+3.05%2015 69,297+1.39%2020 71,961+0.74%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2007 census conducted by the CBMS, Borongan had a total population of 59,354 people in 10,699 households."
        ],
        [
            "The local dialect is Waray-Waray and some locals are able to speak and understand Cebuano with varying fluency, locals are literate in both English and Filipino.",
            "Boronganons are predominantly Roman Catholic, but it also has other small Christian as well as minority religious sects."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Borongan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  26.40"
        ],
        [
            "2009  37.64"
        ],
        [
            "2012  25.96"
        ],
        [
            "2015  32.25"
        ],
        [
            "2018  37.42"
        ],
        [
            "2021  26.51"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Livelihood"
        ],
        [
            "Borongan's main product is copra.",
            "It has lively commercial activity throughout the year not only catering to the needs of the local city populace but serving as well as the central business hub of the entire province of Eastern Samar.",
            "Many families rely on coastal and deep-sea fishing as well as lowland and upland farming as means of livelihood.",
            "Others have spouses, children, parents or other relatives working in Manila or in other places within the Philippines or abroad either as professionals, contract workers or domestic helpers who regularly remit part of their earnings to their families back home.",
            "The single biggest employer of its local populace is the government."
        ],
        [
            "A cattle farm in Borongan City, Eastern Samar"
        ],
        [
            "Commercial activity"
        ],
        [
            "Borongan has a wet market located a little upstream and beside the northern bank of the Lo-om River in the Puray district of Barangay H (Tarusan) selling the usual foodstuffs like rice & corn grains, dried & fresh fish (either caught locally or brought in frozen from Catbalogan or Guiuan as well as other nearby towns), pork, beef, chicken, carabeef, preserved meats, vegetables, fruits, condiments & spices, rootcrops, native cakes and the like.",
            "The place also sells locally-made and beautiful native basketware."
        ],
        [
            "In 2005, the municipality (then) saw the opening of the largest and only Mall in Eastern Samar, the Uptown Mall which opened in 2005 for business operations and is located along the national highway in Barangay Songco at the northern fringe of the city.",
            "Appliance stores, mini-groceries and 'sari-sari' stores also abound throughout the length and breadth of the city selling items ranging from basic necessities to supplies for recreational and entertainment activities."
        ],
        [
            "There are several hardware stores that also operate catering to the needs of the city's construction industry.",
            "The city has numerous restaurants and eateries offering local cuisine randomly located throughout the city limits while nightspots can be found mostly along the length of Baybay Boulevard at the eastern edge of the city immediately abutting the shoreline of Borongan Bay.",
            "Major and new oil companies have their own oil refueling stations within the city limits selling engine lubricants, kerosene as well as regular, unleaded and premium gasoline and diesel fuels."
        ],
        [
            "Now, Borongan boasts several large establishments that opened throughout the years.",
            "These include several department stores and another Mall that opened in 2017.",
            "Most of these establishments are located within the city proper such as GrandMart, Novo Shirts and Jeans, and the recently opened 578 Emporium.",
            "The second mall that opened in the city is the J&F Mall, which houses a Puregold Franchise meanwhile Savemore Borongan which is Located in Wilsam Uptown Mall is just across Puregold.",
            "A Jollibee Franchise also opened in 2016, located in the city proper.",
            "A Fast food chain McDonald's which also opened in 2022, located beside Uptown Mall."
        ],
        [
            "Tourism"
        ],
        [
            "Exterior of the Borongan Cathedral"
        ],
        [
            "Interior of the Borongan Cathedral"
        ],
        [
            "Borongan's pristine and undisturbed forests contain spectacular streams, river rapids, waterfalls and caves sought after by nature lovers, trekkers and spelunkers - locals and foreign visitors alike.",
            "With its vast virginal landscape, most of its scenic spots can be reached by those who have the time and energy."
        ],
        [
            "There is said to be a famed hidden cave in one of the offshore islands of Borongan Bay containing the long-boned remains and antique artifacts (i.e.",
            "necklaces, porcelain, etc.)",
            "of apparently ancient people whose true history have been obscured by the mists of time and only snippets of which have survived to this day in tales and legends among the local folk who continue to zealously preserve as well as guard and protect them from the curious and from the occasional vandal/looter, believing that allowing such remains and artifacts to be disturbed or taken away will bring bad luck or misfortune to the nearby local inhabitants."
        ],
        [
            "Festivals"
        ],
        [
            "The City celebrates its annual Fiesta celebration in honor of its Patroness, the Blessed Virgin Mary.",
            "Albeit the actual Feast day is on September 8, the celebration is usually a month long as each Barangay will hold its own \"Barangay Night\" where barangays would have a barangay-wide party through programs held in their respective Barangay Plazas.",
            "At the same time, schools would also have their annual reunions and respective \"School Night\".",
            "The series of celebrations is in anticipation of the actual Feast day."
        ],
        [
            "Padul-ong Festival"
        ],
        [
            "The Festival illustrates the legend of a mysterious “Lady in White” who allegedly visits the Hamorawon Spring, behind the Hamorawon Park, regularly.",
            "According to the legend, the Lady in White has been blessing the spring waters with miraculous healing powers.",
            "On September 7, Borongan offers mass in the wee hours of the morning, in the chapel of Barangay Punta Maria, signifying that the Padul-ong Festival has officially started.",
            "From the chapel, a small figure of the Blessed Virgin Mary will be transferred to Rawis Port through a fluvial procession where boat owners can join along with the official boat carrier of the small image across Rawis Bay.",
            ":The figure would then be paraded through the town going to Borongan Cathedral.",
            "At the Borongan city plaza, different schools would reenact the town’s old legend on how the figure was brought to the Philippines.",
            "This is done as a contest, where several schools from the different municipalities, and schools within the City would compete among themselves through their performances.",
            "The festival commemorates the day the town received the figure of the Patroness, the Blessed Virgin Mary, all the way from Portugal."
        ],
        [
            "Lechon Festival"
        ],
        [
            "The city government took the initiative to hold a lechon festival to coincide with the city fiesta after the verbal endorsement of Kris Aquino during her visit to the City, after having tasted the City's own version of the Lechon.",
            "The festival coincides with the Fiesta celebration, where participants would showcase their own styles of cooking the famous filipino dish.",
            "The festival is celebrated by parading the participants' dishes dressed in elaborate costumes or floats, and thereafter will be shared in the main competition held in the city plaza.",
            "The festival is concluded by a competition among the local lechon butchers to showcase their own recipes, the dishes they paraded, and whoever will win will be awarded by monetary prizes and recognition.",
            "When the festival was first held, Kris Aquino was said to have been one of the principal sponsors."
        ],
        [
            "Surfing and skimboarding"
        ],
        [
            "Being part of Eastern Samar, the surfing capital of the Visayas, Borongan is blessed with several surfing spots.",
            "More often than not, these spots are uncrowded, easily making it a surfer's paradise.",
            "The city's waves are at their best during the Amihan (Northeast Monsoon) season which runs from November to April."
        ],
        [
            "Among the numerous surf sites in the city, the following are considered to be the top pick for surfers and tourists:"
        ],
        [
            "Baybay Boulevard (Borongan Bay)"
        ],
        [
            "Known as the birthplace of surfing in the Visayas, this is the nearest surf spot from Borongan town proper.",
            "This surf spot has a sandy bottom, right hand rivermouth beach break.",
            "Perfect for both beginners and advance surfers."
        ],
        [
            "Pirates Cove Beach and Surf Resort"
        ],
        [
            "A 5-minute drive from Borongan town proper brings you to this 2-hectare private reef, marine sanctuary and water sports recreation area.",
            "This is an exposed reef break facing the Pacific Ocean filled with rocks and corals."
        ],
        [
            "Sulangan Beach"
        ],
        [
            "A left and right hand steady beach break that is ideal for beginners.",
            "A good place to learn how to surf."
        ],
        [
            "Lalawigan Beach"
        ],
        [
            "Still part of Borongan, this barangay is rarely visited.",
            "Only advanced surfers frequent the area due to its rough waves and strong current."
        ],
        [
            "Guintagican Beach"
        ],
        [
            "A beautiful 2 km beach with white sand.",
            "It has a left and right hand beach break with inconsistent surf.",
            "During the summer season, it tends to be flat.",
            "Also ideal for beginners."
        ],
        [
            "Beaches"
        ],
        [
            "Sunrise viewed from Baybay Boulevard."
        ],
        [
            "Borongan has many beaches, the most notable of which can be found in Divinubo Island and in Ando Island, both of which boast of white sand beaches, vibrant coral formations alive with teeming marine life in sparkling clear blue waters, incidentally ideal also for diving and snorkeling.",
            "Cabong gray-sand beach is a favorite destination of the locals, with excursionists, bathers and picnic-goers spilling over from one end of the beach to the other especially during special occasions, weekends and holidays.",
            "The strip of white-sand beach in Guintagican or Punta Maria is also a good bet, although it takes some effort to get there as it is several kilometers away from the town proper and accessible only through a feeder road, the final stretch of which can be reach on foot only because of the narrow width of the footpath."
        ],
        [
            "Baybay Boulevard during the Miss Earth Philippines 2024 Beachwear Competitions"
        ],
        [
            "Islands and island beaches"
        ],
        [
            "Ando Island White Sand Beach"
        ],
        [
            "Butay island (located at the middle of Lo-om River between the upstream concrete bridge connecting the city proper to and from Barangay Taboc and the downstream steel-and-concrete bridge connecting the city proper to and from Barangay Alang-alang)"
        ],
        [
            "Divinubo Island White Sand Beach"
        ],
        [
            "Monbon Island White Sand Beach"
        ],
        [
            "Pamuloton Island Beach (Tabunan)"
        ],
        [
            "City parks"
        ],
        [
            "The Hamorawon park is located at the center of the city proper itself and can easily be located by the presence of the giant acacia tree beside it.",
            "It contains the stylized rendition of a concrete giant clamshell the upper half of which being held up by two mermaids while at its base are two crocodiles with their mouths agape.",
            "This giant clamshell served as the then town's cultural stage where social presentations were held while the fenced grounds fronting it served as the venue for social gatherings.",
            "This was the brainchild of then Mayor Pablo \"Buaya\" Rosales.",
            "On its left side but still within the park grounds is the city tourism building."
        ],
        [
            "From underneath this giant clamshell bubbles and flows the Hamorawon natural spring, the only one place in the entire province of Eastern Samar which has a naturally occurring fresh-water spring, flowing from the very center of the city itself towards the Lo-om River a short distance downstream.",
            "The waters of this spring has been said to be miraculous the site itself having allegedly been the place where appearances of a lady in white (supposed to be the patroness saint of the city) have reportedly been seen.",
            "Unfortunately, access to this natural water source has of late been impeded and virtually blocked, its previous access road having been long fenced off leaving the spring almost unnoticeable already to busy passersby."
        ],
        [
            "Government"
        ],
        [
            "As the provincial capital, provincial government institutions are located in the city.",
            "The city government also has its own executive, legislative and judicial bodies."
        ],
        [
            "Executive"
        ],
        [
            "The seat of the executive branch of the local government of Borongan is at the city hall located at the city proper itself with the city mayor acting as the local chief executive."
        ],
        [
            "Legislative"
        ],
        [
            "The legislative department is represented by the local Sangguniang Panglungsod composed of ten (10) elected members headed by the city vice mayor as the presiding officer thereof."
        ],
        [
            "Judicial"
        ],
        [
            "Regional Trial Court, Branches I & II - both located at the Hall of Justice Bldg., Provincial Capitol Complex in Barangay Alang-alang."
        ],
        [
            "Municipal Trial Court - also located at the Hall of Justice Bldg., Provincial Capitol Complex in Barangay Alang-alang."
        ],
        [
            "Constitutional Bodies"
        ],
        [
            "Commission on Audit"
        ],
        [
            "Commission on Elections"
        ],
        [
            "Civil Service Commission"
        ],
        [
            "Peace and order"
        ],
        [
            "The local inhabitants are generally peace-loving and law-abiding citizens who follow all the laws, ordinances, rules and regulations promulgated by the duly-constituted authorities, be they national or local.",
            "Except for the lingering insurgency problem, which however is restricted to the hinterland barangays, does not affect the normal course of political and business activities of the city.",
            "The place has no major peace and order nor internal security problems."
        ],
        [
            "Infrastructure"
        ],
        [
            "Communications"
        ],
        [
            "Landline telephone, cellular phone as well as internet (both landline and wireless) connections are available within the city limits and up to a certain limited distance from the city proper.",
            "Cable television is also available to city subscribers as well as to inhabitants up to a certain limited distance from the city proper.",
            "The city has a government-run FM radio station although it operates only on limited broadcast time at certain hours of the day."
        ],
        [
            "Electric power"
        ],
        [
            "Main electric power supply to the city is through an interconnection with the Leyte electric power grid that comes from the electricity generated by the Tongonan geothermal power plant located in the adjacent island of Leyte.",
            "The distribution of the power supply within the city and the entire province of Eastern Samar is operated and managed by the Eastern Samar Electric Cooperative (ESAMELCO)"
        ],
        [
            "Transportation"
        ],
        [
            "Air"
        ],
        [
            "The Borongan Airport is located at Barangay Punta Maria.",
            "The Airport has undergone several improvements through the years since its construction during the Second World War, where it was constructed as an emergency air strip for the military.",
            "The Air strip is serviceable to smaller aircraft, such as turbo-propelled Airplanes, which was seen when the airport had chartered flights on different occasions.",
            "On December 19, 2022, Philippine Airlines subsidiary PAL Express, commenced operations between Cebu to Borongan with 2x weekly flights from Monday and Friday."
        ],
        [
            "Sea"
        ],
        [
            "The Port of Borongan is classified as a national port and can accommodate medium-draft sea vessels, linking the town with the other coastal and riverine towns of the province as well as major coastal cities of Eastern Visayas, Central Visayas and Bicol regions.",
            "Access to and from the outlying inhabited offshore islands of Borongan Bay is either through motorized as well as sail- or oar-driven outrigger bancas."
        ],
        [
            "Borongan Port"
        ],
        [
            "Land"
        ],
        [
            "Bus transport, airconditioned and ordinary, is the dominant means of public land conveyance to Borongan from Manila (and vice versa) passing overland through the Pan-Philippine Highway (Maharlika Highway) through southern Luzon, a short roll on, roll off 1-hour boat ride across the San Bernardino Strait from Matnog, Sorsogon to Allen, Northern Samar, then southwards to Catbalogan, Western Samar, east across the mountainous and forested geographical spine of the island, then southwards again from the town of Taft until finally entry into the city on the eastern coast of Samar.",
            "There are also ordinary mini-buses and air-conditioned shuttle vans from Tacloban City going to Borongan (and vice versa)."
        ],
        [
            "Another route from Tacloban City is through the Pan-Philippine-Japan Friendship Highway on a west-to-east-to-north course that traverses the southern coastal fringe of the island of Samar crossing the San Juanico Bridge from Tacloban City turning right at the junction southwards to Basey and then Marabut, Samar then eastward across the provincial boundary to Lawa-an in Eastern Samar passing by the famous municipality of Balangiga, turning left at the junction past Quinapondan town northward to the municipality of Gen. MacArthur and onwards to Borongan itself.",
            "The main forms of public mass transport in and around the city are motorized tricycles, motorcycles, passenger jeepneys,  multicabs and bicycles.",
            "There is no taxicab service available within the city."
        ],
        [
            "Accredited Transport Cooperatives as of January 2021:"
        ],
        [
            "Eastern Samar Transport Service Cooperative"
        ],
        [
            "Eastern Transit Transport Cooperative"
        ],
        [
            "Education"
        ],
        [
            "Borongan has many elementary schools, high schools, colleges and a lone university.",
            "It has the highest literacy rate among the municipalities in the whole province of Eastern Samar."
        ],
        [
            "Secondary schools"
        ],
        [
            "The Eastern Samar National Comprehensive High School (ESNCHS) Administration Building.",
            "ESNCHS is the largest high school in the entire Eastern Samar province."
        ],
        [
            "Benowangan National High School"
        ],
        [
            "Calingatngan National High School"
        ],
        [
            "Eastern Visayas International Montessori School"
        ],
        [
            "Eastern Samar National Comprehensive High School"
        ],
        [
            "Lalawigan National High School"
        ],
        [
            "Maypangdan National High School"
        ],
        [
            "Saint Mary's College of Borongan (formerly Saint Joseph's College), High School Department"
        ],
        [
            "Seminario de Jesus Nazareno (exclusive high school for Boys )"
        ],
        [
            "MSH Sisters High School"
        ],
        [
            "Santa Fe National High School"
        ],
        [
            "Supt.",
            "Fidel E. Anacta Sr. Memorial High School"
        ],
        [
            "Colleges"
        ],
        [
            "Nativity of Our Lady College Seminary"
        ],
        [
            "Saint Mary's College (formerly Saint Joseph's College)"
        ],
        [
            "Our Lady of Mercy College"
        ],
        [
            "University"
        ],
        [
            "Eastern Samar State University"
        ],
        [
            "The university offers undergraduate and graduate course in sciences, technology, literature, humanities, philosophy, agriculture, education, forestry, arts and science, and other degrees/courses within it areas of specialization and according to its capabilities as the Board of Regents may deem necessary to carry out its objectives, particularly to meet the needs of the Province of Eastern Samar and the Region.",
            "Its main campus is located in Borongan."
        ],
        [
            "Notable personalities"
        ],
        [
            "Boy Abunda - television host, publicist, talent manager and celebrity endorser."
        ],
        [
            "Maria Fe Abunda - politician; Eastern Samar's representative in the House of Representatives of the Philippines."
        ],
        [
            "Aster Amoyo - entertainment writer, television host, and talent manager."
        ],
        [
            "Gabrielle Camille Basiano - model and beauty pageant titleholder, Binibining Pilipinas Intercontinental 2022."
        ],
        [
            "K Brosas - actress, comedienne and singer."
        ],
        [
            "Eugenio Daza - Area Commander Southeastern Samar during the Philippine-American War.",
            "Organizer of the Balangiga Encounter.",
            "Rep. of Samar's 3rd District to the First Philippine Legislature."
        ],
        [
            "Gabriel Daza - Knight Commander with Star of the Order of St. Sylvester, knighted by Pope Pius XII.",
            "Co-founder Boy Scouts of the Philippines."
        ],
        [
            "R-Ji Lim - singer, actor and model; member of P-pop group Alamat."
        ],
        [
            "Jewel Ponferada - PBA professional basketball player, currently playing for Rain or Shine Elasto Painters."
        ],
        [
            "Art Ramasasa - singer, songwriter and musician in the Waray-Waray language."
        ],
        [
            "Mastermind - dance group, made popular in their performance in Pilipinas Got Talent season 5.",
            "They finally settled for 4th place in the Grand Finals."
        ],
        [
            "References"
        ],
        [
            "^  City of Borongan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ * \"16 new cities legal, SC rules with finality | the Manila Bulletin Newspaper Online\".",
            "Manila Bulletin.",
            "Archived from the original on June 25, 2011.",
            "Retrieved April 13, 2011."
        ],
        [
            "^ Robredillo, Lope C. (November 27, 2012).",
            "\"FROM THE UNDERSIDE OF HISTORY: A HISTORY OF BORONGAN (EASTERN SAMAR),1604-1898\"."
        ],
        [
            "^ \"R.A. No.",
            "4221, An Act Creating the Provinces of Northern Samar, Eastern Samar and Western Samar\".",
            "LawPH.com.",
            "Retrieved April 27, 2011."
        ],
        [
            "^ \"Supreme Court of the Philippines\".",
            "Archived from the original on March 19, 2009."
        ],
        [
            "^"
        ],
        [
            "\"Borongan, Eastern Samar Climatological Normal Values 1991–2020\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on March 1, 2022.",
            "Retrieved May 22, 2022."
        ],
        [
            "^"
        ],
        [
            "\"Borongan, Eastern Samar Climatological Extremes\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on May 22, 2022.",
            "Retrieved May 22, 2022."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Eastern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ Philippine Statistics Authority Archived July 16, 2012, at the Wayback Machine"
        ],
        [
            "^ \"Total Population by Province, City, Municipality and Barangay: as of May 1, 2010\" (PDF).",
            "2010 Census of Population and Housing.",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on March 20, 2013.",
            "Retrieved April 22, 2013."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Corp, ABS-CBN (July 8, 2021).",
            "\"The Legend of the Miraculous Lady in White Lurking in Eastern Samar's Hamorawan Spring\".",
            "Choose Philippines."
        ],
        [
            "^ \"Borongan holds first lechon festival\".",
            "The Philippine Star."
        ],
        [
            "^ \"PAL Opens Cebu-Borongan route, boosting Eastern Samar as tourism gateway\".",
            "Philippine Airlines.",
            "Retrieved January 8, 2023."
        ],
        [
            "^ \"Accredited Transport Cooperatives as of January 2021\" (PDF).",
            "Office of Transportation Cooperatives.",
            "January 2021."
        ],
        [
            "^ \"R.A. 9312\".",
            "The LawPhil Project."
        ],
        [
            "Sources"
        ],
        [
            "16 new cities legal, SC rules with finality | The Manila Bulletin Newspaper Online"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Borongan."
        ],
        [
            "Wikivoyage has a travel guide for Borongan."
        ],
        [
            "Borongan Official Website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "2007 Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Borongan Community Website"
        ],
        [
            "www.mb.com.ph"
        ],
        [
            "Places adjacent to Borongan"
        ],
        [
            "Hinabangan, Samar"
        ],
        [
            "San Julian"
        ],
        [
            "Calbiga, SamarPinabacdao, Samar"
        ],
        [
            "Borongan"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Basey, Samar"
        ],
        [
            "Maydolong"
        ],
        [
            "Articles Related to Borongan"
        ],
        [
            "vte Province of Eastern SamarBorongan (capital and largest city)Municipalities"
        ],
        [
            "Arteche"
        ],
        [
            "Balangiga"
        ],
        [
            "Balangkayan"
        ],
        [
            "Can-avid"
        ],
        [
            "Dolores"
        ],
        [
            "General MacArthur"
        ],
        [
            "Giporlos"
        ],
        [
            "Guiuan"
        ],
        [
            "Hernani"
        ],
        [
            "Jipapad"
        ],
        [
            "Lawaan"
        ],
        [
            "Llorente"
        ],
        [
            "Maslog"
        ],
        [
            "Maydolong"
        ],
        [
            "Mercedes"
        ],
        [
            "Oras"
        ],
        [
            "Quinapondan"
        ],
        [
            "Salcedo"
        ],
        [
            "San Julian"
        ],
        [
            "San Policarpo"
        ],
        [
            "Sulat"
        ],
        [
            "Taft"
        ],
        [
            "Component city"
        ],
        [
            "Borongan"
        ],
        [
            "vteEastern Visayas (Region VIII)Regional center"
        ],
        [
            "Tacloban"
        ],
        [
            "Provinces"
        ],
        [
            "Biliran"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Leyte"
        ],
        [
            "Northern Samar"
        ],
        [
            "Samar"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc"
        ],
        [
            "Component cities"
        ],
        [
            "Baybay"
        ],
        [
            "Borongan"
        ],
        [
            "Calbayog"
        ],
        [
            "Catbalogan"
        ],
        [
            "Maasin"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Borongan"
        ],
        [
            "Catarman"
        ],
        [
            "Catbalogan"
        ],
        [
            "Maasin"
        ],
        [
            "Naval"
        ],
        [
            "Tacloban"
        ],
        [
            "Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Allen"
        ],
        [
            "Almagro"
        ],
        [
            "Almeria"
        ],
        [
            "Anahawan"
        ],
        [
            "Arteche"
        ],
        [
            "Babatngon"
        ],
        [
            "Balangiga"
        ],
        [
            "Balangkayan"
        ],
        [
            "Barugo"
        ],
        [
            "Basey"
        ],
        [
            "Bato"
        ],
        [
            "Biliran"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Bontoc"
        ],
        [
            "Burauen"
        ],
        [
            "Cabucgayan"
        ],
        [
            "Caibiran"
        ],
        [
            "Calbiga"
        ],
        [
            "Calubian"
        ],
        [
            "Can-avid"
        ],
        [
            "Capoocan"
        ],
        [
            "Capul"
        ],
        [
            "Carigara"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Culaba"
        ],
        [
            "Dagami"
        ],
        [
            "Daram"
        ],
        [
            "Dolores"
        ],
        [
            "Dulag"
        ],
        [
            "Gamay"
        ],
        [
            "Gandara"
        ],
        [
            "General MacArthur"
        ],
        [
            "Giporlos"
        ],
        [
            "Guiuan"
        ],
        [
            "Hernani"
        ],
        [
            "Hilongos"
        ],
        [
            "Hinabangan"
        ],
        [
            "Hindang"
        ],
        [
            "Hinunangan"
        ],
        [
            "Hinundayan"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Jiabong"
        ],
        [
            "Jipapad"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "Kawayan"
        ],
        [
            "La Paz"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lawaan"
        ],
        [
            "Leyte"
        ],
        [
            "Libagon"
        ],
        [
            "Liloan"
        ],
        [
            "Limasawa"
        ],
        [
            "Llorente"
        ],
        [
            "Lope de Vega"
        ],
        [
            "MacArthur"
        ],
        [
            "Macrohon"
        ],
        [
            "Mahaplag"
        ],
        [
            "Malitbog"
        ],
        [
            "Mapanas"
        ],
        [
            "Marabut"
        ],
        [
            "Maripipi"
        ],
        [
            "Maslog"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Matuguinao"
        ],
        [
            "Maydolong"
        ],
        [
            "Mayorga"
        ],
        [
            "Mercedes"
        ],
        [
            "Merida"
        ],
        [
            "Mondragon"
        ],
        [
            "Motiong"
        ],
        [
            "Naval"
        ],
        [
            "Oras"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagsanghan"
        ],
        [
            "Palapag"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pambujan"
        ],
        [
            "Paranas"
        ],
        [
            "Pastrana"
        ],
        [
            "Pinabacdao"
        ],
        [
            "Pintuyan"
        ],
        [
            "Quinapondan"
        ],
        [
            "Rosario"
        ],
        [
            "Saint Bernard"
        ],
        [
            "Salcedo"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro (Leyte)"
        ],
        [
            "San Isidro (Northern Samar)"
        ],
        [
            "San Jorge"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose de Buan"
        ],
        [
            "San Juan"
        ],
        [
            "San Julian"
        ],
        [
            "San Miguel"
        ],
        [
            "San Policarpo"
        ],
        [
            "San Ricardo"
        ],
        [
            "San Roque"
        ],
        [
            "San Sebastian"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Margarita"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Silago"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Sogod"
        ],
        [
            "Sulat"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Taft"
        ],
        [
            "Tagapul-an"
        ],
        [
            "Talalora"
        ],
        [
            "Tanauan"
        ],
        [
            "Tarangnan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tomas Oppus"
        ],
        [
            "Tunga"
        ],
        [
            "Victoria"
        ],
        [
            "Villaba"
        ],
        [
            "Villareal"
        ],
        [
            "Zumarraga"
        ],
        [
            "Visayas, Republic of the Philippines"
        ],
        [
            "vte Provincial capital cities and municipalities of the PhilippinesLuzon"
        ],
        [
            "Abra: Bangued"
        ],
        [
            "Albay: Legazpi"
        ],
        [
            "Apayao: Kabugao / Luna1"
        ],
        [
            "Aurora: Baler"
        ],
        [
            "Bataan: Balanga"
        ],
        [
            "Batanes: Basco"
        ],
        [
            "Batangas: Batangas City"
        ],
        [
            "Benguet: La Trinidad"
        ],
        [
            "Bulacan: Malolos"
        ],
        [
            "Cagayan: Tuguegarao"
        ],
        [
            "Camarines Norte: Daet"
        ],
        [
            "Camarines Sur: Pili"
        ],
        [
            "Catanduanes: Virac"
        ],
        [
            "Cavite: Imus / Trece Martires1"
        ],
        [
            "Ifugao: Lagawe"
        ],
        [
            "Ilocos Norte: Laoag"
        ],
        [
            "Ilocos Sur: Vigan"
        ],
        [
            "Isabela: Ilagan"
        ],
        [
            "Kalinga: Tabuk"
        ],
        [
            "La Union: San Fernando"
        ],
        [
            "Laguna: Santa Cruz"
        ],
        [
            "Marinduque: Boac"
        ],
        [
            "Masbate: Masbate City"
        ],
        [
            "Mountain Province: Bontoc"
        ],
        [
            "Nueva Ecija: Palayan"
        ],
        [
            "Nueva Vizcaya: Bayombong"
        ],
        [
            "Occidental Mindoro: Mamburao"
        ],
        [
            "Oriental Mindoro: Calapan"
        ],
        [
            "Palawan: Puerto Princesa"
        ],
        [
            "Pampanga: San Fernando"
        ],
        [
            "Pangasinan: Lingayen"
        ],
        [
            "Quezon: Lucena"
        ],
        [
            "Quirino: Cabarroguis"
        ],
        [
            "Rizal: Antipolo"
        ],
        [
            "Romblon: Romblon"
        ],
        [
            "Sorsogon: Sorsogon City"
        ],
        [
            "Tarlac: Tarlac City"
        ],
        [
            "Zambales: Iba"
        ],
        [
            "Visayas"
        ],
        [
            "Aklan: Kalibo"
        ],
        [
            "Antique: San Jose de Buenavista"
        ],
        [
            "Biliran: Naval"
        ],
        [
            "Bohol: Tagbilaran"
        ],
        [
            "Capiz: Roxas"
        ],
        [
            "Cebu: Cebu City"
        ],
        [
            "Eastern Samar: Borongan"
        ],
        [
            "Guimaras: Jordan"
        ],
        [
            "Iloilo: Iloilo City"
        ],
        [
            "Leyte: Tacloban"
        ],
        [
            "Negros Occidental: Bacolod"
        ],
        [
            "Negros Oriental: Dumaguete"
        ],
        [
            "Northern Samar: Catarman"
        ],
        [
            "Samar: Catbalogan"
        ],
        [
            "Siquijor: Siquijor"
        ],
        [
            "Southern Leyte: Maasin"
        ],
        [
            "Mindanao"
        ],
        [
            "Agusan del Norte: Cabadbaran / Butuan1"
        ],
        [
            "Agusan del Sur: Prosperidad"
        ],
        [
            "Basilan: Lamitan / Isabela1"
        ],
        [
            "Bukidnon: Malaybalay"
        ],
        [
            "Camiguin: Mambajao"
        ],
        [
            "Cotabato: Kidapawan"
        ],
        [
            "Davao de Oro: Nabunturan"
        ],
        [
            "Davao del Norte: Tagum"
        ],
        [
            "Davao del Sur: Digos"
        ],
        [
            "Davao Occidental: Malita"
        ],
        [
            "Davao Oriental: Mati"
        ],
        [
            "Dinagat Islands: San Jose"
        ],
        [
            "Lanao del Norte: Tubod"
        ],
        [
            "Lanao del Sur: Marawi"
        ],
        [
            "Maguindanao del Norte: Datu Odin Sinsuat"
        ],
        [
            "Maguindanao del Sur: Buluan"
        ],
        [
            "Misamis Occidental: Oroquieta"
        ],
        [
            "Misamis Oriental: Cagayan de Oro"
        ],
        [
            "Sarangani: Alabel"
        ],
        [
            "South Cotabato: Koronadal"
        ],
        [
            "Sultan Kudarat: Isulan"
        ],
        [
            "Sulu: Jolo"
        ],
        [
            "Surigao del Norte: Surigao City"
        ],
        [
            "Surigao del Sur: Tandag"
        ],
        [
            "Tawi-Tawi: Bongao"
        ],
        [
            "Zamboanga del Norte: Dipolog"
        ],
        [
            "Zamboanga del Sur: Pagadian"
        ],
        [
            "Zamboanga Sibugay: Ipil"
        ],
        [
            "1 de facto seat of provincial government"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "Authority control databases"
        ],
        [
            "NARA"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Borongan&oldid=1230165852\""
        ],
        [
            "Categories: BoronganCities in Eastern VisayasPopulated places in Eastern SamarProvincial capitals of the PhilippinesSurfing locations in the PhilippinesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataUse mdy dates from July 2022Use Philippine English from January 2023All Wikipedia articles written in Philippine EnglishArticles needing additional references from June 2008All articles needing additional referencesPages using photo montage with one or fewer imagesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using PH wikidata incorrectlyArticles containing Filipino-language textArticles needing additional references from July 2022All articles with unsourced statementsArticles with unsourced statements from March 2021Commons category link from WikidataArticles with NARA identifiersPages using the Kartographer extension"
        ]
    ]
}