{
    "name": "Brooke's Point",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Brooke's Point"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°47′N 117°50′E﻿ / ﻿8.78°N 117.83°E﻿ / 8.78; 117.83"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Palawan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Brooke's Point\" – news · newspapers · books · scholar · JSTOR (November 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Mimaropa, PhilippinesBrooke's PointMunicipalityMunicipality of Brooke's Point"
        ],
        [
            "FlagSealMap of Palawan with Brooke's Point highlightedOpenStreetMapBrooke's PointLocation within the PhilippinesCoordinates: 8°47′N 117°50′E﻿ / ﻿8.78°N 117.83°E﻿ / 8.78; 117.83CountryPhilippinesRegionMimaropaProvincePalawanDistrict"
        ],
        [
            "2nd districtFoundedJune 28, 1949Named forJames BrookeBarangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorCesareo R. Benedito Jr. • Vice MayorMary Jean D. Feliciano • RepresentativeJose C. Alvarez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Sarah Jane C. AbonRichard R. BaleanEzekiel E. RodriguezNathan Sam O. LacanilaoJonathan Z. LagradaArturo B. FerrarisVictoriano B. ColiliHayati B. Dugasan"
        ],
        [
            " • Electorate47,082 voters (2022)Area • Revenue₱ 503.4 million (2020) • Assets₱ 1,217 million (2020) • Expenditure₱ 398.6 million (2020) • Liabilities₱ 298.1 million (2020)Service provider • ElectricityPalawan Electric Cooperative (PALECO)Time zoneUTC+8 (PST)ZIP code5305PSGC1705306000IDD : area code +63 (0)48Native languagesPalawano TagalogWebsitehttp://brookespointpalawan.gov.ph/"
        ],
        [
            "Brooke's Point, officially the Municipality of Brooke's Point (Tagalog: Bayan ng Brooke's Point),  is a 1st class municipality in the province of Palawan, Philippines.",
            "According to the 2020 census, it has a population of 73,994 people."
        ],
        [
            "The Pearl of Lao Tzu, formerly considered the world's largest pearl, was found in its waters on May 7, 1934."
        ],
        [
            "Etymology"
        ],
        [
            "Brooke's Point is named after James Brooke, described as \"the first white Rajah\" of Sarawak and founder of the Brooke Dynasty.",
            "It is believed that during one of his voyages, he landed on the tip of an island with a long narrow stretch of land inhabited by Palaweños and Muslims under the Sultanate of Sulu.",
            "During American rule, American scouts named the place Brooke's Point."
        ],
        [
            "The name has now come under critical review, with some branding the naming of the municipality as \"white worship\" and the persistence of colonial mentality amidst Filipino sovereignty.",
            "Municipal officials have also demanded that the original name of the municipality, Bonbon (sometimes written as Bon-Bon), be restored."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Brooke's Point\" – news · newspapers · books · scholar · JSTOR (February 2022) (Learn how and when to remove this message)"
        ],
        [
            "On June 28, 1949, the Brooke's Point, formerly a municipal district, became a municipality by virtue of Executive Order No.",
            "232 by then-President Elpidio Quirino."
        ],
        [
            "The pioneer families who settled in Brooke's Point are the Villapa, Rodriguez, Setias, Valencia, Aspiras, Arzaga and Edwards families."
        ],
        [
            "Geography"
        ],
        [
            "Brooke's Point is situated in the south-eastern section of Palawan Island, 190 kilometres (120 mi) from Puerto Princesa.",
            "It has a total land area of 85,064.90 hectares (210,199.9 acres) stretching about 20 kilometers (12 mi) along the length of Palawan.",
            "Brooke's Point is bounded by Sofronio Española in the north, Bataraza in the south, Rizal in the west, and the Sulu Sea in the east.",
            "The municipalities of Bataraza,"
        ],
        [
            "Barangays"
        ],
        [
            "Brooke's Point is subdivided into 18 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Currently, there are 2 barangays which classified as urban (highlighted in bold)."
        ],
        [
            "Samariñana was separated from Tanionbog in 1954."
        ],
        [
            "Amas"
        ],
        [
            "Aribungos"
        ],
        [
            "Barong-barong"
        ],
        [
            "Calasaguen"
        ],
        [
            "Imulnod"
        ],
        [
            "Ipilan"
        ],
        [
            "Maasin"
        ],
        [
            "Mainit"
        ],
        [
            "Malis"
        ],
        [
            "Mambalot"
        ],
        [
            "Oring-oring"
        ],
        [
            "Pangobilian"
        ],
        [
            "Poblacion I"
        ],
        [
            "Poblacion II"
        ],
        [
            "Salogon"
        ],
        [
            "Samariñana"
        ],
        [
            "Saraza (Taniongbobog)"
        ],
        [
            "Tubtub"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Brooke's Point"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(76)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "64(2.5)"
        ],
        [
            "55(2.2)"
        ],
        [
            "90(3.5)"
        ],
        [
            "93(3.7)"
        ],
        [
            "169(6.7)"
        ],
        [
            "215(8.5)"
        ],
        [
            "206(8.1)"
        ],
        [
            "181(7.1)"
        ],
        [
            "190(7.5)"
        ],
        [
            "219(8.6)"
        ],
        [
            "182(7.2)"
        ],
        [
            "115(4.5)"
        ],
        [
            "1,779(70.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.1"
        ],
        [
            "11.5"
        ],
        [
            "17.3"
        ],
        [
            "19.4"
        ],
        [
            "26.8"
        ],
        [
            "26.8"
        ],
        [
            "27.8"
        ],
        [
            "26.9"
        ],
        [
            "27.1"
        ],
        [
            "28.3"
        ],
        [
            "25.4"
        ],
        [
            "20.1"
        ],
        [
            "270.5"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Brooke's PointYearPop.±% p.a.1918 18,080—    1939 21,839+0.90%1948 28,476+2.99%1960 28,118−0.11%1970 26,961−0.42%1975 36,967+6.53%1980 46,320+4.61%YearPop.±% p.a.1990 57,934+2.26%1995 41,924−5.88%2000 48,928+3.37%2007 56,311+1.96%2010 61,301+3.14%2015 66,374+1.53%2020 73,994+2.16%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Brooke's Point was 73,994 people, with a density of 56.8 inhabitants per square kilometer or 147 inhabitants per square mile."
        ],
        [
            "Religion"
        ],
        [
            "The town is predominantly Christian, with a sizable Muslim population."
        ],
        [
            "Most are Catholics.",
            "Other Christian denominations include Members Church of God International, Iglesia ni Cristo, Jehovah's Witnesses, the Church of Jesus Christ of Latter-day Saints (LDS Church) and others."
        ],
        [
            "The Catholic Church is located north of the town center while the Evangelical Christian Churches are the Gospel Hall, located north of the town center, the Iglesia ni Cristo, south of the municipal hall, the Church of Christ International's building is located in Old Camp while the LDS Church chapel is in Edward's Subdivision."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Brooke's Point"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  36.10"
        ],
        [
            "2009  26.65"
        ],
        [
            "2012  26.95"
        ],
        [
            "2015  31.96"
        ],
        [
            "2018  16.71"
        ],
        [
            "2021  15.71"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Brooke's Point is one of Palawan's main economic centers outside Puerto Princesa, along with Narra, Coron and Cuyo.",
            "The town is home to several banks including the Land Bank and Rural Bank of Brooke's Point.",
            "Money transfer companies such as Western Union and MoneyGram also have branches in the town.",
            "There are several pawnshops like M Lhullier, Cebuana Lhuillier, among others.",
            "The town also has a Mercury Drug and a Generic Pharmacy."
        ],
        [
            "Commercial Enterprises are thriving.",
            "There are many medium-sized stores, located mostly in the town proper.",
            "The service sector is also growing with the rise of many commercial establishments.",
            "The town's economy is based primarily on agriculture.",
            "The town produces great quantities of rice, copra and corn.",
            "The palm oil industry is headquartered in Barangay Mainit in the south.",
            "Unlike most of Palawan's towns, Brooke's Point does not have white and pristine beaches that draw local and foreign tourists.",
            "But because of abundant freshwater resources, the town is one of the most productive in the province in terms of agriculture.",
            "Many fruits and vegetables grow in abundance."
        ],
        [
            "In addition, the town is also one of the Philippines' gateways to Southeast Asia.",
            "Its proximity to Sabah is a strategic advantage, but the lack of infrastructure and an inter-governmental agreement between Malaysia and the Philippines hinders the town from being a trading hub.",
            "There is minimal trade with Malaysia through many of the town's Muslim and Christian residents who have relatives in Sabah.",
            "The town is supposed to become an international port with cargo services to Sabah and Brunei."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Brooke's Point has a modern seaport that serves many cargo ships from Manila, Mindanao, the Visayas and other parts of Luzon.",
            "The port also caters to numerous fishing vessels.",
            "Commercial vessels from Malaysia, Indonesia and other countries also make frequent stops in the port.",
            "The port also serves as a docking point for vessels containing commercial goods from Manila and abroad, and also mining-related materials to Rio Tuba.",
            "The port of Brooke's Point is considered as one of the most profitable ports in the southern Philippines."
        ],
        [
            "The El Nido-Bataraza highway connects the town to other mainland towns and municipalities.",
            "Transportation between Puerto Princesa and Brooke's Point is through commercial vans, buses or jeepneys.",
            "There is also a private airport located at Lada.",
            "Transportation throughout the town is through tricycle and multi-cabs.",
            "Kuliglig, a machine also used for agriculture, is widely used as a means of transportation in rural areas."
        ],
        [
            "Healthcare"
        ],
        [
            "Health facilities in the municipality include Southern Palawan Provincial Hospital (a 25-bed capacity secondary government hospital), a Rural Health Unit (RHU), Barangay Health Stations (BHS), and private clinics and hospitals.",
            "Dental and optical clinics, laboratories, and drugstores are also present and serve not only Brooke's Point, but also neighboring municipalities."
        ],
        [
            "Currently, there are three private hospitals."
        ],
        [
            "Education"
        ],
        [
            "The Palawan State University has its campus in Brooke's Point.",
            "In addition to this, the town is also home to Southern Palawan College, Inc. which offers several technical and vocational courses."
        ],
        [
            "There are 9 secondary schools in Brooke's Point.",
            "Brooke's Point Christian High School, a Christian-run institution, and the Sacred Heart of Jesus High School administered by the Augustinians are located in the town center.",
            "Public secondary schools include the Brooke's Point National High School, Governor Abueg Memorial and Vocational High school, and more.",
            "There are also at least 40 public elementary schools."
        ],
        [
            "Media"
        ],
        [
            "Brooke's Point is home to three radio stations, all broadcasting on FM: 104.5 Radyo Natin Brooke's Point, 95.7 Brigada News FM Brooke's Point, and 89.5 Radyo Bandera News FM Brooke's Point.",
            "GMA Network's DYAA-TV is also based in Brooke's Point.",
            "The town is also a telecommunications hub for several companies such as Smart and Globe networks.",
            "Internet cafes are becoming increasingly popular, while the percentage of personal computer ownership is also rising."
        ],
        [
            "Environmental issues"
        ],
        [
            "Many parts of the town's forests are cleared to give way for agriculture.",
            "Slash and burn agriculture is a common practice in the town's interior.",
            "Burning of garbage and waste are common, as is illegal fishing.",
            "Illegal logging is done on a small basis, but it has a substantial impact on the town's forest cover.",
            "Small-scale illegal pet trade also exists.",
            "Mynahs, parrots and pangolins, as well as many animals found only in Palawan, are poached and traded to other parts of the country and abroad.",
            "Although the practice is increasingly common, many of these activities are not known to authorities."
        ],
        [
            "In recent years, the local government along with the National government has enacted several policies and programs to protect the environment.",
            "But apathy and corruption hinder government efforts to implement these policies and programs."
        ],
        [
            "A long-running dispute exists over the establishment of a nickel mine within what is now the Mount Mantalingahan Protected Landscape."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Brooke's Point |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Brooke's Point\" (PDF).",
            "Provincial Government of Palawan.",
            "Archived from the original (PDF) on March 4, 2012.",
            "Retrieved November 22, 2012."
        ],
        [
            "^ Executive Order No.",
            "232, s. 1949 (June 28, 1949), Converting into municipalities the municipal districts of Aborlan and Brooke’s Point, both of the Province of Palawan, Official Gazette of the Republic of the Philippines, retrieved September 22, 2023"
        ],
        [
            "^ Republic Act No.",
            "3426 (June 18, 1961), An Act Creating the Municipality of Batarasa in the Province of Palawan, The Corpus Juris, retrieved September 22, 2023"
        ],
        [
            "^ Republic Act No.",
            "7679 (February 24, 1994), An Act Creating the Municipality of Sofronio Espala in the Province of Palawan, Chan Robles Virtual Law Library, retrieved September 22, 2023"
        ],
        [
            "^ Republic Act No.",
            "617 (May 15, 1951), An Act to Create the Municipality of Quezon in the Province of Palawan, Chan Robles Virtual Law Library, retrieved March 2, 2016"
        ],
        [
            "^ Batas Pambansa Blg.",
            "386 (April 14, 1983), An Act Creating the Municipality of Marcos in the Province of Palawan, Chan Robles Virtual Law Library, retrieved March 2, 2016"
        ],
        [
            "^ Republic Act No.",
            "1012 (June 12, 1954), An Act Creating the Barrio of Samariniana, in the Municipality of Brooke’s Point, Province of Palawan, The Lawphil Project - Arellano Law Foundation, Inc., retrieved September 22, 2023"
        ],
        [
            "^ Republic Act No.",
            "1012 (June 16, 1955), An Act Changing the Name of the Barrio of Taniongbobog, Municipality of Brooke’s Point, Province of Palawan, to Saraza, The Lawphil Project - Arellano Law Foundation, Inc., retrieved September 22, 2023"
        ],
        [
            "^"
        ],
        [
            "\"Brooke's Point: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved November 16, 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"BusinessWorld | Mindanao-Indonesia ferry service to boost BIMP-EAGA trade\".",
            "BusinessWorld."
        ],
        [
            "^ Keith Anthony S. Fabro (September 25, 2023).",
            "\"Indigenous community fighting a mine in Palawan wins a milestone legal verdict\".",
            "Mongabay.",
            "Retrieved October 2, 2023."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Brooke's Point."
        ],
        [
            "Brooke's Point Profile at PhilAtlas.com"
        ],
        [
            "Official site"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Brooke's Point"
        ],
        [
            "Quezon"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Rizal"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Bataraza"
        ],
        [
            "Sulu Sea"
        ],
        [
            "vte Province of PalawanPuerto Princesa (capital and largest city)Municipalities"
        ],
        [
            "Aborlan"
        ],
        [
            "Agutaya"
        ],
        [
            "Araceli"
        ],
        [
            "Balabac"
        ],
        [
            "Bataraza"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Busuanga"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Coron"
        ],
        [
            "Culion"
        ],
        [
            "Cuyo"
        ],
        [
            "Dumaran"
        ],
        [
            "El Nido"
        ],
        [
            "Kalayaan"
        ],
        [
            "Linapacan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Narra"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "San Vicente"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Taytay"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Puerto Princesa (Administratively independent from the province but grouped under Palawan by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Brooke%27s_Point&oldid=1234478245\""
        ],
        [
            "Categories: Municipalities of PalawanPolitical divisions established by Philippine executive order1949 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from November 2012All articles needing additional referencesUse Philippine English from April 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles needing additional references from February 2022Pages using the Kartographer extension"
        ]
    ]
}