{
    "name": "Bugallon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bugallon"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°55′N 120°11′E﻿ / ﻿15.92°N 120.18°E﻿ / 15.92; 120.18"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pangasinan, Philippines"
        ],
        [
            "For the Filipino historical figure, see José Torres Bugallón."
        ],
        [
            "Municipality in Ilocos Region, PhilippinesBugallon"
        ],
        [
            "SalasaMunicipalityMunicipality of BugallonStreet in Bugallon"
        ],
        [
            "FlagSealMap of Pangasinan with Bugallon highlightedOpenStreetMapBugallonLocation within the PhilippinesCoordinates: 15°55′N 120°11′E﻿ / ﻿15.92°N 120.18°E﻿ / 15.92; 120.18CountryPhilippinesRegionIlocos RegionProvincePangasinanDistrict"
        ],
        [
            "2nd districtFounded (as Salasa)1747Renamed (as Bugallon)January 12, 1921Named forJosé Torres BugallónBarangays24"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPriscilla I. Espino • Vice MayorWinston P. Tandoc • RepresentativeJumel Anthony I. Espino • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Rogelio M. MadrigueraAislinn L. de GuzmanMarlon Y. CuisonErnesto A. TanigueRamie T. OcsanGemma C. HipolBernardo F. de VeraRolando A. Manaoat"
        ],
        [
            " • Electorate48,419 voters (2022)Area • Revenue₱ 237.6 million (2020) • Assets₱ 356 million (2020) • Expenditure₱ 186.1 million (2020) • Liabilities₱ 127.1 million (2020)Service provider • ElectricityCentral Pangasinan Electric Cooperative (CENPELCO)Time zoneUTC+8 (PST)ZIP code2416PSGC015515000IDD : area code +63 (0)75Native languagesPangasinan Ilocano Tagalog"
        ],
        [
            "Bugallon, officially the Municipality of Bugallon (Pangasinan: Baley na Bugallon; Ilocano: Ili ti Bugallon; Tagalog: Bayan ng Bugallon), is a 2nd class municipality in the province of Pangasinan, Philippines.",
            "According to the 2020 census, it has a population of 74,962 people."
        ],
        [
            "Bugallon is 8 kilometres (5.0 mi) from Lingayen and 198 kilometres (123 mi) from Manila."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(November 2012) (Learn how and when to remove this message)"
        ],
        [
            "The Municipality of Bugallon was formerly called \"Salasa\" (meaning floor joist in the dialect, a part of a wooden house where the floor is attached to).",
            "In the Spanish colonial era, the Spanish authorities established the town center in Poblacion (now Barangay Salasa).",
            "Because of the 1914 massive flooding and erosion, the town center was later transferred to Barrio Anagao (became Barangay Poblacion) but the Our Lady of Lourdes Catholic Church, one of the oldest churches in the country, could not be transferred (every time someone attempts, he dies).",
            "A new Catholic church was created in the Poblacion, the Saint Andrew Catholic Church.",
            "This is the reason why Bugallon has two Catholic Churches (one in Salasa and the other in Anagao)."
        ],
        [
            "Fr.",
            "Antonio Perez.",
            "founded Salasa (1714-1747)  In 1720, Poblacion was in Barangay Polong's Don Francisco Valencerina yard, later transferred later to Baranggay Salasa on January 24, 1734, by Fr.",
            "Fernando Garcia.",
            "The Plaza, Presedencia, the church and convent, were engineered by the Frayle (surrounded by parallel calles).",
            "Doña Milagros Klar, wife of then manager of Pantranco (Philtranco) donated in 1935, the Our Lady of Lourdes statue to Salasa Shrine."
        ],
        [
            "The town was named after the town's hero Major Jose Torres Bugallon who fought together with Gen. Antonio Luna during the Philippine–American War in 1899.",
            "February 5, 1899, at the Battle of La Loma, Bugallon faced Gen. Arthur MacArthur.",
            "Bugallon suffered a shot to the thigh during the battle.",
            "Later that day, in the arms of Antonio Luna, Bugallon died from excessive loss of blood."
        ],
        [
            "In 1921, the town of Salasa was renamed to Bugallon.",
            "Mr. Canullas founded the Jose Torres Bugallonas association and a monument was erected in the plaza, wherein the bones of General Bugallon were interred thereat on January 12, 1958."
        ],
        [
            "The act of changing Salasa an old town to a new one, Bugallon, required a congressional approval sponsored by the Congressman Mauro Navarro, first district of Pangasinan, and obtained congressional approval in changing Salasa to Bugallon.",
            "Hence, Salasa became a mere barangay but remains the seat of Our Lady of Lourdes Parish (11 barangays) and the other is Bugallon's St. Andrew the Apostle (14 barangay)."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Bugallon is politically subdivided into 24 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Angarian"
        ],
        [
            "Asinan"
        ],
        [
            "Bañaga"
        ],
        [
            "Bacabac"
        ],
        [
            "Bolaoen"
        ],
        [
            "Buenlag"
        ],
        [
            "Cabayaoasan"
        ],
        [
            "Cayanga"
        ],
        [
            "Gueset"
        ],
        [
            "Hacienda"
        ],
        [
            "Laguit Centro"
        ],
        [
            "Laguit Padilla"
        ],
        [
            "Magtaking"
        ],
        [
            "Pangascasan"
        ],
        [
            "Pantal"
        ],
        [
            "Poblacion"
        ],
        [
            "Polong"
        ],
        [
            "Portic"
        ],
        [
            "Salasa"
        ],
        [
            "Salomague Norte"
        ],
        [
            "Salomague Sur"
        ],
        [
            "Samat"
        ],
        [
            "San Francisco"
        ],
        [
            "Umanday"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bugallon, Pangasinan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "5.1(0.20)"
        ],
        [
            "11.6(0.46)"
        ],
        [
            "21.1(0.83)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "232.9(9.17)"
        ],
        [
            "350.8(13.81)"
        ],
        [
            "679.8(26.76)"
        ],
        [
            "733.1(28.86)"
        ],
        [
            "505(19.9)"
        ],
        [
            "176.6(6.95)"
        ],
        [
            "67.2(2.65)"
        ],
        [
            "17.7(0.70)"
        ],
        [
            "2,828.6(111.38)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3"
        ],
        [
            "3"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "14"
        ],
        [
            "18"
        ],
        [
            "23"
        ],
        [
            "25"
        ],
        [
            "22"
        ],
        [
            "15"
        ],
        [
            "8"
        ],
        [
            "4"
        ],
        [
            "142"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BugallonYearPop.±% p.a.1903 8,746—    1918 10,289+1.09%1939 14,469+1.64%1948 18,687+2.88%1960 24,698+2.35%1970 31,657+2.51%1975 35,981+2.60%1980 39,072+1.66%1990 47,412+1.95%1995 50,478+1.18%2000 57,445+2.81%2007 62,237+1.11%2010 64,253+1.17%2015 67,348+0.90%2020 74,962+2.13%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bugallon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  30.10"
        ],
        [
            "2009  24.75"
        ],
        [
            "2012  15.15"
        ],
        [
            "2015  14.68"
        ],
        [
            "2018  15.28"
        ],
        [
            "2021  19.45"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Bugallon, belonging to the second congressional district of the province of Pangasinan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Jumel Anthony I. Espino"
        ],
        [
            "Mayor"
        ],
        [
            "Priscilla I. Espino"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Winston P. Tandoc"
        ],
        [
            "Councilors"
        ],
        [
            "Rogelio M. Madriguera"
        ],
        [
            "Aislinn L. De Guzman"
        ],
        [
            "Marlon Y. Cuison"
        ],
        [
            "Ernesto Agbisit"
        ],
        [
            "Ramie T. Ocsan"
        ],
        [
            "Gemma C. Hipol"
        ],
        [
            "Bernardo F. De Vera"
        ],
        [
            "Rolando A. Manaoat"
        ],
        [
            "Tourism"
        ],
        [
            "Park, Plaza"
        ],
        [
            "Heritage house (Atty.",
            "Agerico V. Guiang)"
        ],
        [
            "Bugallon's interesting points, destinations and products, events, include:"
        ],
        [
            "Freedom Park, Town Hall, Church of Christ Philippine Theological College, Sangguniang Bayan Hall, Mt.",
            "Zion Pilgrim Mountain and Retreat House, United Methodist Church, National Building and Library, Senior Juan Farm Resort, Municipal Auditorium, Gymmasium and Coop Canteen, Concrete Water Tank in Laguit Padilla, Laguit Padilla Falls, Iglesia Ni Kristo, Hanging Bridge, Bubunga Dam, Gabion Type Dike, Lema Canal, Bugallon Supermarket, Community Hospital,Eco-Tourism Park, High Value Crop Organic Farm, Major Jose Torres Bugallon Park and Agricultural, Carabao Landmark."
        ],
        [
            "Le Dilla Duhat Wine is a Fruit Wine of Duhat Wine Enterprises, Laguit Padilla Multi-Purpose Cooperative and the One-Town-One-Product of Bugallon, Pangasinan, the Best Beverage Award (wine category) of the 7th Agraryo Trade Fair of June 4–8, 2008, Megatrade Hall 2, 5th Level Building B, SM Megamall, Mandaluyong"
        ],
        [
            "Rice, mango, antique home furnishings, vinegar, sawali products."
        ],
        [
            "Shrine of the Our Lady of Lourdes/Salasa Church (1720), Busay Waterfalls, Mt.",
            "Zion Pilgrim’s Site, Biak-na-Bato Falls, Gen. Torres Bugallon Park."
        ],
        [
            "Carabao Festival -January 13, 2012 - 24 carabaos; \"palengkera ang kalabaw\" wasBarangay Cabayaoasan."
        ],
        [
            "The cascading waters of brooks and streams located in Barangays Cayanga, Portic, Hacienda,  Laguit Padilla, Laguit Centro, San Francisco,  Salomague Sur, Salomague Norte, Umanday and Gueset coming from the fresh water sources in the Zambales mountain slopes."
        ],
        [
            "SOFIA'S Mountain Home Resort, Barangay Portic (owned by ex-Judge and ex-Vice Mayor Eliseo Versoza."
        ],
        [
            "San Jose Hillside Farm, Barangay Laguit Padilla (owned by Atty.",
            "Agerico V. Guiang & Mrs. Nieves V. Guiang)."
        ],
        [
            "Swimming pool, Sampaguita (formerly Primicias Farm, Barangay Portic)."
        ],
        [
            "Nipa swamps, vinegar, and wine making industry from \"tuba\" (Barangays Salasa, Bañaga, Pantal, Asinan and Magtaking)"
        ],
        [
            "Dam structures (NIA, Barangays Cayanga and Portic)"
        ],
        [
            "Pangasinan State University Tissue Culture Project ( Congressman Amado Espino, Jr. farm, Barangay Portic."
        ],
        [
            "Monastery of the contemplative Hermits of the Living Word or Hermit sisters, Barangay Portic"
        ],
        [
            "Agno River Flood Control River, Barangays Salasa and Bañaga, zigzagging bridge (Philippine-Japanese financed project)"
        ],
        [
            "Vinegar industry of Barangays Asinan, Magtaking and Bañaga, Sawali making in Barangays Magtaking, Gueset and Laguit Padilla, Mango puree production, Candle making Factory, Barangay Pangascasan (Catro's) and in Poblacion (Tuliao's Candle Making Cottage Industry)."
        ],
        [
            "Salasa Parish Church"
        ],
        [
            "St. Andrew the Apostle Parish Church"
        ],
        [
            "St. Andrew the Apostle Church"
        ],
        [
            "The 1920 St. Andrew the Apostle Parish Church (Poblacion, Bugallon, 2416 Pangasinan)  is under the jurisdiction of the Roman Catholic Archdiocese of Lingayen-Dagupan, The church has impressive inspired-baroque type of altar for the saints."
        ],
        [
            "Its Feast Day is November 30 with Parish Priest, Fr.",
            "Dominador Mendoza, Jr., Population of 57,445."
        ],
        [
            "St. Andrew the Apostle Parish was originally erected at Salasa (founded by the Dominicans in the 18th century).",
            "When the town site was transferred, the seat of the parish was also transferred as a consequence brought about by natural calamities that battered the area."
        ],
        [
            "The 1914 Salasa floods destroyed crops, properties, buildings, the church and convent.",
            "Poblacion was transferred to Barangay Anagao (Bugallon), under Our Lady of Lourdes and St. Andrew the Apostle remained the patron Saint in July 1920 with 1st Parish Priest, Fr.",
            "Eustaquio Ocampo, then,  Fr.",
            "Montano Domingo on November 29, 1921, and in June 1928, Fr Emeterio Domagas succeeded."
        ],
        [
            "On May 23, 1929, Pangasinan was created as a new Diocese and Msgr.",
            "Cesar Maria Guerrero became Pangasinan's First Bishop on May 23, 1929.",
            "In 1930, Franciscan Capuchin appointed Fr.",
            "Cesario of Legario and Fr.",
            "Fernando of Erasum to Bugallon and Salasa, respectively on September 17, 1930.",
            "The Salasa Church, one of the biggest in Philippines, 100 meters long was completely destroyed and despoiled by Bugallon natives.",
            "Fr.",
            "Benjamin of Ilarduya became Kura Paroko from October 16, 1933, to June 27, 1941.",
            "The church brick-structure and the old façade were built.",
            "During World War II,  Fr.",
            "Hipolito of Azcoita parish priest of Labrador, was transferred to Bugallon."
        ],
        [
            "St. Joseph is the Principal Patron of the Diocese of Alaminos, Suffragan of Lingayen-Dagupan, Created and Erected: January 12, 1985, under Bishop Marlo M. Peralta, D.D.",
            "2404 Alaminos, Pangasinan and Bishop-Emeritus Jesus A.Cabrera, D.D."
        ],
        [
            "Incidents"
        ],
        [
            "Bugallon Mayor Rodrigo Orduña and Barangay Chairman Fernando Alimagno filed on December 14, 2012, at the Ombudsman of the Philippines plunder case against Pangasinan Governor Amado Espino, Jr. Orduña alleged that he was Espino’s jueteng collector since 2001, and that Espino earned P900 million from gambling operators."
        ],
        [
            "Pangasinan police director and chief, Senior Supt.",
            "Mariano Luis Verzosa had been removed and transferred to the main PNP headquarters in Camp Crame, Quezon City, allegedly due to conflict of interest since his daughter, Lingayen City Councilor Maan Versoza, is running for 2013 reelection."
        ],
        [
            "Gallery"
        ],
        [
            "Town center"
        ],
        [
            "Town Hall"
        ],
        [
            "Major José Torres Bugallón Park"
        ],
        [
            "National Building and Library"
        ],
        [
            "Old house (Generosa Espino)"
        ],
        [
            "Heritage house (Generosa Espino)"
        ],
        [
            "See also"
        ],
        [
            "List of renamed cities and municipalities in the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bugallon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Bugallon | the Official Website of the Province of Pangasinan and its People\".",
            "Archived from the original on 2017-09-09.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"Diocese of Alaminos Home Page\".",
            "Archived from the original on 2011-03-07.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"About Us\".",
            "Municipality of Bugallon.",
            "Archived from the original on 2011-12-27.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"Province: PANGASINAN\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on 14 November 2012.",
            "Retrieved 26 November 2012."
        ],
        [
            "^"
        ],
        [
            "\"Bugallon, Pangasinan: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 26 September 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Pangasinan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Archived (PDF) from the original on 2020-10-06.",
            "Retrieved March 6, 2022."
        ],
        [
            "^ \"Digital Tour in Bugallon\".",
            "Archived from the original on 2012-02-15.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"Mga kalabaw, rumampa sa Carabao Festival ng Bugallon, Pangasinan\".",
            "13 January 2012."
        ],
        [
            "^ \"Archived copy\".",
            "Archived from the original on 2016-03-04.",
            "Retrieved 2012-12-22.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ \"Archdiocese of Lingayen-Dagupan\".",
            "Archived from the original on 2017-09-12.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"Diocese of Alaminos Home Page\".",
            "Archived from the original on 2011-03-07.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"Diocese of Alaminos Home Page\".",
            "Archived from the original on 2013-08-10.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"Diocese of Bayombong | ucanews.com\".",
            "Archived from the original on 2012-09-05.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ a b http://www.cbcponline.org/alaminos/"
        ],
        [
            "^ a b \"Diocese of Alaminos\".",
            "Catholic-Hierarchy.org.",
            "David M. Cheney.",
            "Retrieved 21 January 2015."
        ],
        [
            "^ a b \"Capital of Pangasinan: All Churches in Pangasinan\".",
            "18 February 2008."
        ],
        [
            "^ \"Diocese of Alaminos Home Page\".",
            "Archived from the original on 2013-08-10.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"List of Parishes of the Roman Catholic Diocese of Urdaneta | Philippine Churches\".",
            "Archived from the original on 2014-10-06.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"Diocese of Urdaneta\".",
            "Archived from the original on 2012-09-04.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"Home\".",
            "dioceseofalaminos.org.",
            "Archived from the original on 2017-06-17.",
            "Retrieved 2012-12-22."
        ],
        [
            "^ \"Palace: Probe on Pangasinan gov for jueteng will be free from politics\".",
            "15 December 2012."
        ],
        [
            "^ \"Cop chief removed amid 'jueteng' controversy\".",
            "20 December 2012."
        ],
        [
            "^ \"NPC backs Espino vs jueteng raps - Manila Standard Today\".",
            "manilastandardtoday.com.",
            "Archived from the original on 28 January 2013.",
            "Retrieved 22 May 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Bugallon."
        ],
        [
            "Bugallon Profile at PhilAtlas.com"
        ],
        [
            "Bugallon Pangasinan Website"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Bugallon at the Pangasinan Government Website"
        ],
        [
            "Bugallon Pangasinan website"
        ],
        [
            "Taga-Bugallon Facebook Group"
        ],
        [
            "Bugallon Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Bugallon"
        ],
        [
            "Labrador"
        ],
        [
            "Lingayen"
        ],
        [
            "MabiniInfanta"
        ],
        [
            "Bugallon"
        ],
        [
            "San CarlosAguilar"
        ],
        [
            "Santa Cruz, Zambales"
        ],
        [
            "vte Province of PangasinanLingayen (capital)  San Carlos City (largest city)Municipalities"
        ],
        [
            "Agno"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Anda"
        ],
        [
            "Asingan"
        ],
        [
            "Balungao"
        ],
        [
            "Bani"
        ],
        [
            "Basista"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos"
        ],
        [
            "Calasiao"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lingayen"
        ],
        [
            "Mabini"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Natividad"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Rosales"
        ],
        [
            "San Fabian"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Quintin"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sison"
        ],
        [
            "Sual"
        ],
        [
            "Tayug"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "San Carlos"
        ],
        [
            "Urdaneta"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan (Administratively independent from the province but grouped under Pangasinan by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Pangasinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bugallon&oldid=1215607425\""
        ],
        [
            "Categories: Municipalities of PangasinanPopulated places on the Agno RiverHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listCS1 maint: archived copy as titleArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textArticles needing additional references from November 2012All articles needing additional referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}