{
    "name": "Buhi",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Buhi, Camarines Sur"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°26′05″N 123°31′00″E﻿ / ﻿13.4347°N 123.5167°E﻿ / 13.4347; 123.5167"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Camarines Sur, Philippines"
        ],
        [
            "Municipality in Bicol Region, PhilippinesBuhiMunicipalityMunicipality of BuhiView of Buhi from Mt.",
            "Asog"
        ],
        [
            "FlagSealMap of Camarines Sur with Buhi highlightedOpenStreetMapBuhiLocation within the PhilippinesCoordinates: 13°26′05″N 123°31′00″E﻿ / ﻿13.4347°N 123.5167°E﻿ / 13.4347; 123.5167CountryPhilippinesRegionBicol RegionProvinceCamarines SurDistrict"
        ],
        [
            "5th districtFoundedApril 14, 1578Barangays38"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRey P. Lacoste • Vice MayorJose Alfred N. Balagot • RepresentativeMiguel Luis R. Villafuerte • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Maria Bella Z. NonatoLeticia D. MoraldeCatherine M. MartinezMarlon L. TabaldeRaul S. LibardoVictor Ramon H. CarulloGloria M. ArceEddie A. Mesalucha"
        ],
        [
            " • Electorate54,826 voters (2022)Area • Revenue₱245,889,870.47 (2020) • Assets₱643,761,840.05 (2020) • Expenditure₱ 178.1 million (2020) • Liabilities₱ 53.6 million (2020)Service provider • ElectricityCamarines Sur 3 Electric Cooperative  (CASURECO 3)Time zoneUTC+8 (PST)ZIP code4433PSGC051705000IDD : area code +63 (0)54Native languagesCentral BikolTagalogWebsitewww.buhi.gov.ph"
        ],
        [
            "Buhi, officially the Municipality of Buhi (Buhinon: Banwaan nya Buhi; Rinconada Bikol: Banwāan ka Buhi; Tagalog: Bayan ng Buhi), is a 1st class municipality in the province of Camarines Sur, Philippines.",
            "According to the 2020 census, it has a population of 81,306 people."
        ],
        [
            "According to the Guinness Book of World Records, Lake Buhi is home to the world's smallest edible fish locally known as \"Sinarapan\"."
        ],
        [
            "Buhi is not just known for Lake Buhi but it is likewise the home to the world's smallest commercial fish locally known as the sinarapan (Mystychtis luzonensis)."
        ],
        [
            "History"
        ],
        [
            "Buhi Veterans Memorial Monument"
        ],
        [
            "The town known today as Buhi began as a small settlement by refugees fleeing the outrage of Mayon Volcano hundreds of years ago.",
            "These people founded a permanent settlement in an area close to the lake and flourished as time passed."
        ],
        [
            "The general exodus of people fleeing and being able to escape grave calamities such as Mayon's eruption was known in local vernacular as \"naka-buhi\".",
            "Local lore takes this as the most probable explanation as to how the town acquired its present name – Buhi.",
            "One version of local legend attributes the town being accorded the name to the time when the first Spaniards came and asked local settlers the name of the area.",
            "The local settlers misunderstood the question as how they came to be there and so gave the response \"Naka-Buhi\"."
        ],
        [
            "There were two patron saints with whom the town directed their devotion.",
            "The first was St. Francis of Assisi placed in the church made of wooden materials.",
            "Unfortunately, in 1730 the church was razed down by fire.",
            "It was, however, replaced by a stone structure built under the supervision of Rev.",
            "Fray Jose de Cerda.",
            "Another saint was installed, St. Anthony of Padua."
        ],
        [
            "On December 28, 1995, 13 people of Sitio Bogtong, Barangay Gabas were killed, three of whom were beheaded, by four gunmen inside a house, with survivors numbering at least seven."
        ],
        [
            "Geography"
        ],
        [
            "Lake Buhi"
        ],
        [
            "Buhi is located in the south-eastern part of the province of Camarines Sur.",
            "It is bound on the east by Mount Malinao, on the west by Mount Asog and Iriga City, on the north by Sagñay-Buhi mountain ranges and on the south by the low-lying ranges of Polangui, Albay, with the following coordinates: 13 degrees 25’ 32.4\" north latitude and 123 degrees 30’ 49.1\" east longitude.",
            "It is 75 kilometres (47 mi) north-east of Legaspi City and 53 kilometres (33 mi) and south of Naga City."
        ],
        [
            "The municipality has been divided into five sectors, namely:"
        ],
        [
            "The Poblacion"
        ],
        [
            "The Lake/Mt.",
            "Asog sector"
        ],
        [
            "the Road/cross road sector"
        ],
        [
            "The Mountain sector"
        ],
        [
            "The Malangkaw Sector"
        ],
        [
            "Barangays"
        ],
        [
            "Buhi is politically subdivided into 38 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Amlongan  (del Rosario)"
        ],
        [
            "Antipolo"
        ],
        [
            "Burocbusoc"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cagmaslog"
        ],
        [
            "Dela Fe"
        ],
        [
            "Delos Angeles"
        ],
        [
            "Divino Rostro"
        ],
        [
            "Gabas"
        ],
        [
            "Ibayugan"
        ],
        [
            "Igbac"
        ],
        [
            "Ipil"
        ],
        [
            "Iraya"
        ],
        [
            "Labawon"
        ],
        [
            "Lourdes-Hinulid-tubog"
        ],
        [
            "Macaangay"
        ],
        [
            "Monte Calvario"
        ],
        [
            "Namurabod"
        ],
        [
            "Sagrada-Pito"
        ],
        [
            "Salvacion"
        ],
        [
            "San Antonio"
        ],
        [
            "San Buenaventura"
        ],
        [
            "San Francisco Parada"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose Baybayon"
        ],
        [
            "San Jose Salay"
        ],
        [
            "San Pascual"
        ],
        [
            "San Pedro"
        ],
        [
            "San Rafael"
        ],
        [
            "San Ramon"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Clara"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santa Isabel"
        ],
        [
            "Santa Justina"
        ],
        [
            "Santa Lourdes"
        ],
        [
            "Tambo"
        ],
        [
            "Topography"
        ],
        [
            "Buhi has generally mountainous and hilly surface, with 50% of its area having a slope of around 25%.",
            "The Poblacion located on the south shore of Lake Buhi, has gently rolling topography."
        ],
        [
            "Mt.",
            "Malinao and Mt.",
            "Asog dominate the town's surface terrain whose highest elevations are 1,548 metres (5,079 ft) and 1,196 metres (3,924 ft) above main sea level respectively."
        ],
        [
            "Itbog Falls located in Barangay Santa Cruz, on the south-eastern side of Lake Buhi, is a 60 feet (18 m) twin waterfalls.",
            "It could be reached by means of a motorized boat ride from the town proper, then a 30-minute trek."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Buhi, Camarines Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "33(91)"
        ],
        [
            "35(95)"
        ],
        [
            "36(97)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "33(91)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(83)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "64.54(2.54)"
        ],
        [
            "102.68(4.04)"
        ],
        [
            "57.93(2.28)"
        ],
        [
            "85.33(3.36)"
        ],
        [
            "202.28(7.96)"
        ],
        [
            "290.93(11.45)"
        ],
        [
            "389.95(15.35)"
        ],
        [
            "298.3(11.74)"
        ],
        [
            "311.59(12.27)"
        ],
        [
            "437.08(17.21)"
        ],
        [
            "132.1(5.20)"
        ],
        [
            "373.8(14.72)"
        ],
        [
            "2,746.51(108.12)"
        ],
        [
            "Average rainy days"
        ],
        [
            "22"
        ],
        [
            "26"
        ],
        [
            "18"
        ],
        [
            "19"
        ],
        [
            "24"
        ],
        [
            "30"
        ],
        [
            "31"
        ],
        [
            "29"
        ],
        [
            "29"
        ],
        [
            "29"
        ],
        [
            "27"
        ],
        [
            "30"
        ],
        [
            "314"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Buhi has a warm, humid climate.",
            "During the warmest months from March to June, temperatures reach 29.2 °C (84.6 °F).",
            "The weather cools off during the rainy season which last from August to February with an average temperature of 24.7 °C (76.5 °F)."
        ],
        [
            "Land use"
        ],
        [
            "A rice field with the view of Mount Asog"
        ],
        [
            "A total area of 24,665 hectares (60,950 acres) is occupied by the municipality, about 13,000 hectares of which are part of the watershed in Rinconada.",
            "18,378 hectares (45,410 acres) of its land area are within the watershed declared as protected area by virtue of Presidential Proclamation No.",
            "573 and Executive Order no.",
            "224.",
            "All other areas are cultivated for agriculture, quarry and human settlement.",
            "Higher slopes east and north of Lake Buhi are predominantly forests and secondary brushland.",
            "Total area utilized as built-up areas is 448 hectares (1,110 acres)."
        ],
        [
            "Farmlands make up about 7,500 hectares (19,000 acres) of which about 2,375 hectares (5,870 acres) have access to irrigation, while 600 hectares (1,500 acres) are non-irrigated.",
            "About 2,811 hectares (6,950 acres) are open water spaces of Lake Buhi, and other lakes and streams."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BuhiYearPop.±% p.a.1903 9,692—    1918 14,103+2.53%1939 22,391+2.23%1948 25,057+1.26%1960 37,786+3.48%1970 41,259+0.88%1975 44,226+1.40%1980 48,625+1.91%1990 57,496+1.69%1995 61,887+1.39%2000 67,762+1.96%2007 70,756+0.60%2010 73,809+1.55%2015 77,143+0.84%2020 81,306+1.04%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Buhi, Camarines Sur, was 81,306 people, with a density of 330 inhabitants per square kilometre or 850 inhabitants per square mile."
        ],
        [
            "The total population was 70,756 in 2007, with a growth rate of about 2.1%.",
            "The total number of households was 13,238 and with an average household size of 5 persons.",
            "At the 2010 census, the population has increased to 73,809 persons.",
            "The local language is Buhinon, a dialect of Bikolano."
        ],
        [
            "Literacy rate of Buhi is about 99%.",
            "The labor force is about 24,000 people strong, or 63% of economically productive people age 15 to 64 years old."
        ],
        [
            "8 out of 10 persons are Roman Catholics; Iglesia ni Cristo makes up about 2% of the total population which is the largest minority religion in the municipality."
        ],
        [
            "Language"
        ],
        [
            "A signage in the local language (Disposing of fish scales and their innards on the lakeshore is prohibited.)"
        ],
        [
            "Buhinon is the mother tongue of the majority of the population especially those residing around the lake area with Rinconada Bikol as its first language especially the folks residing on the eastern part of the municipality near Iriga City.",
            "Buhinon is classified as a lone language, and the only one used in the province of Camarines Sur.",
            "Buhinon, the Albay Bikol languages, and Rinconada Bikol are members of Inland Bikol group of languages and share common vocabulary."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Buhi"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  41.00"
        ],
        [
            "2009  43.99"
        ],
        [
            "2012  34.07"
        ],
        [
            "2015  39.84"
        ],
        [
            "2018  29.82"
        ],
        [
            "2021  36.76"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Two thirds of the population depends on agriculture"
        ],
        [
            "More than one-fifth of the total land area is devoted to agriculture primary crops are rice, corn, coconut, and abaca"
        ],
        [
            "Rice grows in the vast field of Road sector while corn and abaca are being grown at Mountain sector"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Buhi Terminal"
        ],
        [
            "Three major road networks that link the town to the adjacent province of Albay, Partido District and Iriga City.",
            "Most of its roads are gravel, especially those in the lake, road and mountain sectors."
        ],
        [
            "Presence of tricycles and jeepneys"
        ],
        [
            "Presence of non-aircon and aircon buses"
        ],
        [
            "Presence of motorized boats and bancas"
        ],
        [
            "Presence of motorcycles called door-to-door"
        ],
        [
            "Spring Resorts"
        ],
        [
            "Pongol Hot Spring"
        ],
        [
            "Balerite Resort"
        ],
        [
            "Lologon Resort"
        ],
        [
            "Utilities"
        ],
        [
            "Water supply:"
        ],
        [
            "Rural Waterworks Multi-Purpose"
        ],
        [
            "Cooperative provides the potable drinking water to at least 1,683 households in 7 suburban areas"
        ],
        [
            "Burabod ririgusan- tubog Lourdes Buhi Camarines sur"
        ],
        [
            "Magindara"
        ],
        [
            "Power and electricity:"
        ],
        [
            "CASURECO III delivers electricity to 63% of households and business establishments and 97% of barangays"
        ],
        [
            "Host to a 1.2 MW mini hydro-electric power plant of the National Power Corporation"
        ],
        [
            "Health"
        ],
        [
            "Presence of 1 public hospital; 3 private medical clinics; 38 health stations/centers; 3 pharmacies"
        ],
        [
            "Public Hospital:"
        ],
        [
            "Buhi Community Hospital (temporarily closed by DOH)"
        ],
        [
            "Private Clinics:"
        ],
        [
            "Claveria Clinic"
        ],
        [
            "Portugal Clinic"
        ],
        [
            "Sabio-Valenciano Clinic"
        ],
        [
            "Dental Clinic"
        ],
        [
            "CJR Berces Dental Clinic"
        ],
        [
            "Dr. Wennie A. Samper Dental Clinic"
        ],
        [
            "Education"
        ],
        [
            "CSPC Buhi campus"
        ],
        [
            "Buhi Lyceum"
        ],
        [
            "St. Bridget School"
        ],
        [
            "No.",
            "of pre-schools: 33 public and 4 private schools"
        ],
        [
            "No.",
            "of elementary schools: 33 public and 4 private schools"
        ],
        [
            "No.",
            "of high schools: 3 private and 6 public schools"
        ],
        [
            "No.",
            "of colleges: 1 state college"
        ],
        [
            "No.",
            "of universities: 1 state university"
        ],
        [
            "State colleges"
        ],
        [
            "Camarines Sur Polytechnic Colleges"
        ],
        [
            "Public high schools"
        ],
        [
            "Santa Justina National High School"
        ],
        [
            "Tambo Barangay National High School"
        ],
        [
            "San Vicente Barangay National High School"
        ],
        [
            "Lourdes High School(New Open Public High school)"
        ],
        [
            "Iraya High School (New Open Public High School)"
        ],
        [
            "Salvacion High School (New Open Public High School)"
        ],
        [
            "Santa Isabel High School(Soon to Operate)"
        ],
        [
            "John Mark Memorial High School"
        ],
        [
            "Private high schools"
        ],
        [
            "Buhi St. Joseph's Academy Inc. (formerly St. Joseph's Academy)"
        ],
        [
            "Buhi Lyceum"
        ],
        [
            "St. Bridget School"
        ],
        [
            "Dautil-Watkins National High School"
        ],
        [
            "Private elementary schools"
        ],
        [
            "Buhi Institute Foundation"
        ],
        [
            "Holy Child Educational Center (Buhi Branch)"
        ],
        [
            "Buhi Lyceum"
        ],
        [
            "Elen O. Villanueva School"
        ],
        [
            "Media"
        ],
        [
            "Social media"
        ],
        [
            "LGU Buhi Official Facebook page"
        ],
        [
            "FM stations"
        ],
        [
            "88.5 DWLF FM – Barita 88.5 (inactive)"
        ],
        [
            "97.7 DWEA FM – Buhi (Radyo Buhi, Numero Uno)"
        ],
        [
            "100.1 Radyo Natin Buhi"
        ],
        [
            "102.9 DWLR – Lauyay Radio (closed)"
        ],
        [
            "Notable people"
        ],
        [
            "Victor Wood – singer, actor, politician"
        ],
        [
            "Avel Bacudio – fashion designer"
        ],
        [
            "Elaine Kay Moll – Binibining Pilipinas candidate"
        ],
        [
            "Yen Quirante – television personality"
        ],
        [
            "Gallery"
        ],
        [
            "Lake Buhi"
        ],
        [
            "St. Francis of Assisi Parish Church"
        ],
        [
            "Patio"
        ],
        [
            "Parish Pastoral Center"
        ],
        [
            "Baked \"Sinarapan\""
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Buhi |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"14 massacred in Camarines Sur\".",
            "Manila Standard.",
            "Legazpi City: Kamahalan Publishing Corporation.",
            "December 30, 1995. p. 2.",
            "Retrieved June 30, 2022."
        ],
        [
            "^ a b c Narito, Florencio P. (January 3, 1996).",
            "\"Witness names mastermind, cohorts\".",
            "Manila Standard.",
            "Legazpi City: Kamahalan Publishing Corporation.",
            "p. 10.",
            "Retrieved June 30, 2022."
        ],
        [
            "^ Evangelista, Romie A.",
            "(December 31, 1995).",
            "\"Revenge eyed in Camarines Sur massacre\".",
            "Manila Standard.",
            "Kamahalan Publishing Corporation.",
            "p. 4.",
            "Retrieved June 30, 2022."
        ],
        [
            "^ \"Camarines Sur: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "{{cite web}}: Missing or empty |url= (help)"
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Camarines Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Buhi, Camarines Sur."
        ],
        [
            "Buhi Online (www.buhi.com) – The First Online Community of Buhi.",
            "Established 1998."
        ],
        [
            "Buhi Families Genealogical Research project"
        ],
        [
            "Buhi: Of Rinconada, Lake, Handloom Weaving, and the World's Smallest Fish"
        ],
        [
            "Places adjacent to Buhi, Camarines Sur"
        ],
        [
            "Sagñay"
        ],
        [
            "Iriga"
        ],
        [
            "Buhi"
        ],
        [
            "Tiwi, Albay"
        ],
        [
            "Polangui, Albay"
        ],
        [
            "Malinao, Albay"
        ],
        [
            "vte Province of Camarines SurPili (capital)  Naga (largest city)Municipalities"
        ],
        [
            "Baao"
        ],
        [
            "Balatan"
        ],
        [
            "Bato"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Caramoan"
        ],
        [
            "Del Gallego"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Goa"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Lupi"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Nabua"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "Presentacion"
        ],
        [
            "Ragay"
        ],
        [
            "Sagñay"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Component city"
        ],
        [
            "Iriga"
        ],
        [
            "Independent component city"
        ],
        [
            "Naga (Administratively independent from the province but grouped under Camarines Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Buhi,_Camarines_Sur&oldid=1225228042\""
        ],
        [
            "Category: Municipalities of Camarines SurHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: requires URLCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataAll articles with unsourced statementsArticles with unsourced statements from February 2014Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}