{
    "name": "Bulan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bulan, Sorsogon"
        ],
        [
            "23 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°40′11″N 123°52′33″E﻿ / ﻿12.6697°N 123.8758°E﻿ / 12.6697; 123.8758"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Sorsogon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Bulan, Sorsogon\" – news · newspapers · books · scholar · JSTOR (February 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bicol Region, PhilippinesBulan"
        ],
        [
            "The Home of Padaraw FestivalMunicipalityMunicipality of BulanSunset at Ticao Pass"
        ],
        [
            "FlagNickname: Fishing Capital of BicolMotto: \"Unhan Bulan\"Map of Sorsogon with Bulan highlightedOpenStreetMapBulanLocation within the PhilippinesCoordinates: 12°40′11″N 123°52′33″E﻿ / ﻿12.6697°N 123.8758°E﻿ / 12.6697; 123.8758CountryPhilippinesRegionBicol RegionProvinceSorsogonDistrict"
        ],
        [
            "2nd districtBarangays63"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRomeo A. Gordola • Vice MayorChezka Mae B. Robles • RepresentativeVacant • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Joefrey O. AzurChezka Mae B. RoblesRenato D. GubanOlaf S. GotladeraExcel G. ZuñigaMildred H. PelagioAugusto G. GerongaTito G. Guelas"
        ],
        [
            " • Electorate67,070 voters (2022)Area • Revenue₱ 306.4 million (2020) • Assets₱ 836.5 million (2020) • Expenditure₱ 255.3 million (2020)Service provider • ElectricitySorsogon 1 Electric Cooperative (SORECO 1)Time zoneUTC+8 (PST)ZIP code4706PSGC056203000IDD : area code +63 (0)56Native languages"
        ],
        [
            "- Bisakol (Southern Sorsogon)"
        ],
        [
            "- Tagalog"
        ],
        [
            "Websitewww.bulan.gov.ph"
        ],
        [
            "Bulan, officially the Municipality of Bulan (Waray Sorsogon: Bungto san Bulan; Waray: Bungto han Bulan; Tagalog: Bayan ng Bulan), is a 1st class municipality in the province of Sorsogon, Philippines.",
            "According to the 2020 census, it has a population of 105,190 people, making it the most populated town in the province."
        ],
        [
            "One of Bicol's fastest growing economy and primed to be the next city of Sorsogon.",
            "Bulan now is being groomed to be the next city of the province given its being a first class municipality with an estimated population of 120k, 196 square kilometers land area and an annual regular income of not less than P200M Bulan almost had the status of being a city.",
            "The town is said to propose a cityhood bill in 2024."
        ],
        [
            "It is also one of the Top Five Municipalities with the Highest Operating Income in Bicol, ISO Accredited LGU, with Seal of Good Financial Housekeeping from DILG, and a lot more."
        ],
        [
            "Geography"
        ],
        [
            "The Municipality of Bulan is located at the south-westernmost tip of the Bicol Peninsula of the island of Luzon.",
            "It has an area of exactly 20,094 hectares and is the terminal and burgeoning center of trade and commerce of its neighboring towns.",
            "It comprises fifty-five (55) barangays and eight (8) zones and is populated by people of diversified origin."
        ],
        [
            "This municipality is bounded on the north by the Municipality of Magallanes, on the east by the municipalities of Juban and Irosin, on the south by the Municipality of Matnog, and on the west by Ticao Pass.",
            "It has a distance of 667 kilometres (414 mi) from Manila, 63 kilometres (39 mi) from the province's capital Sorsogon City, 20 kilometres (12 mi) from the town of Irosin and 30 kilometres (19 mi) from the town of Matnog."
        ],
        [
            "Barangays"
        ],
        [
            "Bulan is politically subdivided into 63 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "A. Bonifacio (Tinurilan)"
        ],
        [
            "Abad Santos (Kambal)"
        ],
        [
            "Aguinaldo (Lipata Dako)"
        ],
        [
            "Antipolo"
        ],
        [
            "Aquino (Imelda)"
        ],
        [
            "Bical"
        ],
        [
            "Beguin"
        ],
        [
            "Bonga"
        ],
        [
            "Butag"
        ],
        [
            "Cadandanan"
        ],
        [
            "Calomagon"
        ],
        [
            "Calpi"
        ],
        [
            "Cocok-Cabitan"
        ],
        [
            "Daganas"
        ],
        [
            "Danao"
        ],
        [
            "Dolos"
        ],
        [
            "E. Quirino (Pinangomhan)"
        ],
        [
            "Fabrica"
        ],
        [
            "G. Del Pilar (Tanga)"
        ],
        [
            "Gate"
        ],
        [
            "Inararan"
        ],
        [
            "J. Gerona (Biton)"
        ],
        [
            "J.P. Laurel (Pon-od)"
        ],
        [
            "Jamorawon"
        ],
        [
            "Libertad (Calle Putol)"
        ],
        [
            "Lajong"
        ],
        [
            "Magsaysay (Bongog)"
        ],
        [
            "Managa-naga"
        ],
        [
            "Marinab"
        ],
        [
            "Nasuje"
        ],
        [
            "Montecalvario"
        ],
        [
            "N. Roque (Calayugan)"
        ],
        [
            "Namo"
        ],
        [
            "Obrero"
        ],
        [
            "Osmeña (Lipata Saday)"
        ],
        [
            "Otavi"
        ],
        [
            "Padre Diaz"
        ],
        [
            "Palale"
        ],
        [
            "Quezon (Cabarawan)"
        ],
        [
            "R. Gerona (Butag)"
        ],
        [
            "Recto"
        ],
        [
            "Roxas (Busay)"
        ],
        [
            "Sagrada"
        ],
        [
            "San Francisco (Polot)"
        ],
        [
            "San Isidro (Cabugaan)"
        ],
        [
            "San Juan Bag-o"
        ],
        [
            "San Juan Daan"
        ],
        [
            "San Rafael (Togbongon)"
        ],
        [
            "San Ramon"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Remedios"
        ],
        [
            "Santa Teresita (Trece)"
        ],
        [
            "Sigad"
        ],
        [
            "Somagongsong"
        ],
        [
            "Tarhan"
        ],
        [
            "Taromata"
        ],
        [
            "Zone 1 (Ilawod)"
        ],
        [
            "Zone 2 (Sabang)"
        ],
        [
            "Zone 3 (Central)"
        ],
        [
            "Zone 4 (Central Business District)"
        ],
        [
            "Zone 5 (Canipaan)"
        ],
        [
            "Zone 6 (Baybay)"
        ],
        [
            "Zone 7 (Iraya)"
        ],
        [
            "Zone 8 (Loyo)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bulan, Sorsogon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "65(2.6)"
        ],
        [
            "44(1.7)"
        ],
        [
            "42(1.7)"
        ],
        [
            "39(1.5)"
        ],
        [
            "87(3.4)"
        ],
        [
            "150(5.9)"
        ],
        [
            "184(7.2)"
        ],
        [
            "153(6.0)"
        ],
        [
            "163(6.4)"
        ],
        [
            "154(6.1)"
        ],
        [
            "127(5.0)"
        ],
        [
            "100(3.9)"
        ],
        [
            "1,308(51.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.9"
        ],
        [
            "9.2"
        ],
        [
            "11.0"
        ],
        [
            "12.5"
        ],
        [
            "19.6"
        ],
        [
            "24.3"
        ],
        [
            "26.5"
        ],
        [
            "25.0"
        ],
        [
            "25.5"
        ],
        [
            "24.4"
        ],
        [
            "19.4"
        ],
        [
            "15.1"
        ],
        [
            "226.4"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BulanYearPop.±% p.a.1903 13,431—    1918 19,268+2.44%1939 29,414+2.03%1948 37,231+2.65%1960 46,520+1.87%1970 54,180+1.53%1975 56,013+0.67%1980 60,911+1.69%1990 66,450+0.87%1995 74,219+2.09%2000 82,688+2.34%2007 91,730+1.44%2010 93,943+0.87%2015 100,076+1.21%2020 105,190+0.98%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bulan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  40.70"
        ],
        [
            "2009  38.84"
        ],
        [
            "2012  32.66"
        ],
        [
            "2015  37.20"
        ],
        [
            "2018  29.49"
        ],
        [
            "2021  27.45"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Residents of Bulan are now looking forward to its city hood because of its rapid-economic growth considering the fact that it is cited as the richest municipality in the province and 5th among the 1st class municipalities in Bicol Region with an average annual income of PHP 58.8M (2009).",
            "If it happens, Bulan will be the second city in the province and will be the 8th in the region."
        ],
        [
            "Major exports of this town are from its coastal waters, agricultural lands produce rice, copra, abaca fiber.",
            "Most of the revenues come from the fishing port of Bulan and businesses."
        ],
        [
            "A perfect place to start a Business.",
            "Bulan's strategic location and its rapidly growing economy and revenue, alongside its large population growth, makes it a great place for investments and businesses."
        ],
        [
            "There are commercial and rural banks in Bulan, the PNB (with 2 ATMs), BDO Network Bank (The first commercial proper bank in the area with 2 storey and atm services.",
            "), and the Landbank of the Philippines, A rural bank Rural Bank of San Jacinto, Masbate, Rural Bank of Pilar, Sorsogon, Camalig Bank, and the Producer's Bank.",
            "A BDO Unibank Bulan branch and Landbank of the Philippines are expected to be built soon.",
            "There are also lending institutions like Intertrade, GSAC, and PALFSI that are very popular to SMEs."
        ],
        [
            "Development areas"
        ],
        [
            "Commercial businesses are heavily concentrated in the town center.",
            "The expansion of the commercial area under the Comprehensive Land Use Plan (CLUP) has been approved, stretching from the Poblacion Zone Business District to Zone 7, Barangay Aquino, and extending to Barangay Fabrica.",
            "This will form the new Central Business District (CBD) of the town, aimed at alleviating traffic congestion and reducing the burden on commercial establishments in the downtown area.",
            "The expansion also includes an 80-meter radius on both sides of the National Highway."
        ],
        [
            "Due to Bulan's rapidly growing economy and revenue, alongside its large population growth, the old and unfinished Bulan airport will start construction soon and will serve as the gateway to the province of Sorsogon."
        ],
        [
            "Bulan port also will undergo rehabilitation so locals would not have to go to Matnog to access the Visayas and Masbate Area."
        ],
        [
            "Retail"
        ],
        [
            "There are numerous shopping centers in town: the LCC Supermarket and Home Store (formerly Department Store) and Jeanee's Supermarket and Department Store.",
            "The new LCC Market Savers recently opened in June 2023.",
            "Additionally, as of June 2024, the new LCC Department Store has opened, establishing it as their third branch in town."
        ],
        [
            "As part of the growing economy, J&F Mall with Puregold as a tenant, SM Savemore, LCC Expressmart, LCC Essentials, Watsons, and McDonald's are set to open in Bulan and will soon rise in the Business District area."
        ],
        [
            "There are local and national retail chains that the town has drawn in addition to the numerous shops already present in the downtown area, including 7-Eleven and Mr. DIY."
        ],
        [
            "Growth"
        ],
        [
            "Although poverty is still high in Bulan, the government has improve people's lives.",
            "Bulan is ranked in the Top 10 richest municipalities out of 107 Municipalities in the Bicol Region, from 5th to 2nd fastest growing as of 2021 with an average annual income of 145.60M (41.91% increase) after Aroroy, Masbate."
        ],
        [
            "Infrastracture"
        ],
        [
            "Telecommunications"
        ],
        [
            "Bulan has fixed landline phones and fiber internet from BTTI (Bicol Telephone and Telegraph, Inc.).",
            "Mobile or cellular networks are Globe, Smart and Dito Telecommunications Companies."
        ],
        [
            "Education"
        ],
        [
            "Primary education"
        ],
        [
            "The primary education in Bulan is divided into two Districts, the Bulan North District comprising all the Barangays towards the north coastal Barangays, to the interior land locked northern Barangays.",
            "The Bulan South District comprises the southern Coastal Barangays."
        ],
        [
            "Secondary education"
        ],
        [
            "Bulan has many secondary educational institutions.",
            "The largest public high school is Bulan National High School.",
            "Formerly, it was the Bulan High School/Bulan Vocational High School, before the former was converted into Sorsogon State College Bulan Campus.",
            "BNHS has satellite Campuses at Barangays Otavi, Beguin, J.P. Laurel, San Juan Bag-o.",
            "There is also a Secondary School in San Francisco, one of the biggest Barangay of Bulan.",
            "The San Francisco National High School."
        ],
        [
            "On the coastal area, Quezon National High School, is one and only coastal high school in the area.",
            "Where students from nearby barangays (Osmeña, Aguinaldo, Sagrada and even Coron-Coron & Sua - part of Municipality of Matnog, use to send their students.",
            "The only school to represent major national events as headed by Mrs. Adelia O. Gregorio (Principal), Mr. Renato B. Gallenito and their co-teachers (by: HBF)."
        ],
        [
            "There are various private secondary schools.",
            "The St. Louise De Marillac School (Formerly Colegio de la Inmaculada Concepcion) a Catholic school run by the Daughters of Charity religious congregation, Immaculate Conception Academy of Bulan (Formerly Immaculate Conception Learning Center) a Catholic School, Saint Bonaventure Academy of Butag, the Southern Luzon Institute-Kenerino Ramirez Asuncion Memorial School (SLI-KRAMS) were the oldest school in Bulan, Solis Institute of Technology, and A.G. Villaroya Technological Foundation Institute."
        ],
        [
            "Tertiary education"
        ],
        [
            "Sorsogon State University - Bulan Campus"
        ],
        [
            "R.G.",
            "De Castro Colleges (formerly Quezon Academy)"
        ],
        [
            "SLI-KRAMS"
        ],
        [
            "Solis Institute of Technology"
        ],
        [
            "A.G. Villaroya (Post-Secondary courses only)"
        ],
        [
            "Alternative Learning System"
        ],
        [
            "Aside from the formal education system, a parallel alternative learning system program is incorporated in the education system to provide a viable alternative to the existing formal education structure.",
            "It encompasses both the non-formal and informal sources of knowledge and skills such as those acquired at home, the church, media, environment or even the life itself and span the pre-literacy to higher skills continuum."
        ],
        [
            "There are two major existing programs implemented.",
            "1) Basic Literacy Program 2)Accreditation and Equivalency (A & E).",
            "ALS implementers such as Mobile Teachers and District ALS Coordinators were the one administer the implementation of the programs.",
            "It is intended for Out-of-School Youth and Adults who are unschooled or school drop-out.",
            "For more inquiries look for Bulan South and Bulan North Districts ALS implementers."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Bulan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ https://www.facebook.com/groups/161120340733350/, http://ph.geoview.info/cabarawan,6906823p, https://www.facebook.com/photo.php?fbid=1925324608817&set=t.1113197609&type=3&theater"
        ],
        [
            "^"
        ],
        [
            "\"Bulan, Sorsogon : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 December 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Sorsogon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ https://www.facebook.com/photo.php?fbid=1652365681667577&set=pcb.479725778872803&type=3&theater, https://www.facebook.com/groups/161120340733350/"
        ],
        [
            "External links"
        ],
        [
            "Bulan Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "LGU Profile of Bulan,Sorsogon"
        ],
        [
            "Places adjacent to Bulan, Sorsogon"
        ],
        [
            "Magallanes"
        ],
        [
            "Juban"
        ],
        [
            "Monreal, Masbate San Jacinto, Masbate / Ticao Pass"
        ],
        [
            "Bulan"
        ],
        [
            "Irosin"
        ],
        [
            "Ticao Pass"
        ],
        [
            "Matnog"
        ],
        [
            "vte Province of SorsogonSorsogon City (capital and largest city)Municipalities"
        ],
        [
            "Barcelona"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castilla"
        ],
        [
            "Donsol"
        ],
        [
            "Gubat"
        ],
        [
            "Irosin"
        ],
        [
            "Juban"
        ],
        [
            "Magallanes"
        ],
        [
            "Matnog"
        ],
        [
            "Pilar"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Component city"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bulan,_Sorsogon&oldid=1231460746\""
        ],
        [
            "Category: Municipalities of SorsogonHidden categories: Pages using gadget WikiMiniAtlasAccuracy disputes from March 2022CS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from February 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using the Kartographer extension"
        ]
    ]
}