{
    "name": "Burauen",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Burauen"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°59′N 124°54′E﻿ / ﻿10.98°N 124.9°E﻿ / 10.98; 124.9"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Leyte, Philippines"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesBurauenMunicipalityMunicipality of Burauen"
        ],
        [
            "FlagSealMap of Leyte with Burauen highlightedOpenStreetMapBurauenLocation within the PhilippinesCoordinates: 10°59′N 124°54′E﻿ / ﻿10.98°N 124.9°E﻿ / 10.98; 124.9CountryPhilippinesRegionEastern VisayasProvinceLeyteDistrict"
        ],
        [
            "2nd districtBarangays77"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJuanito E. Renomeron • Vice MayorNoel P. Alpino • RepresentativeLolita T. Javier • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Warren V. Hermano• Dexter R. Seno• Felipe E. Coral• Cipriano R. Relatorres• Vincent G. Enerlan• Cheeryl Y. Ducentes• Benoni Z. Pocpoc• Oscar A. CagaraDILG Masterlist of Officials"
        ],
        [
            " • Electorate34,288 voters (2022)Area • Annual Regular Revenue₱369.0 million (2023) • Locally Sourced Revenue₱144.7 million (2023) • Assets₱1.0 billion (2022) • Expenditure₱ 229.4 million (2020) • Liabilities₱192.0 million (2022)Service provider • ElectricityDon Orestes Romualdez Electric Coperative (DORELCO)Time zoneUTC+8 (PST)ZIP code6516PSGC0803710000IDD : area code +63 (0)53Native languagesWaray TagalogWebsiteweb.evis.net.ph/lgu/burauen/"
        ],
        [
            "Burauen (IPA:"
        ],
        [
            "Etymology"
        ],
        [
            "The name “Burauen” evolved from the word “haru” which means “spring”.",
            "This is because Burauen is the fountainhead of several rivers: the big Daguitan and Marabong rivers, the Guinarona and Hibuga rivers that pass through several neighboring towns, as well as several smaller ones.",
            "The legend behind the name speaks of a drought when several tributaries of these rivers dried up, forcing people to flock to a cluster of large springs in the town.",
            "The place was duly called “Buraburon” which according to Justice Norberto Lopez Romualdez Sr., is the “multiplicative construction of the word “haru” (spring), which indicates “abundance”.",
            "Over the years, the name “Buraburon” (“having many springs”) evolved into “Burawon” and finally into “Burawen”."
        ],
        [
            "History"
        ],
        [
            "Early settlers"
        ],
        [
            "Clandestine diggings conducted by antique hunters and verified by the National Museum archaeologists yield valuable artifacts consisting of chinaware and jars.",
            "Some of the discoveries were Stone Age artifacts and implements.",
            "These antiques and artifacts were found on the plateaus of both sides of the Kag-oloolo Brook of Barangay Patag and Villa Aurora, which were about 16 kilometers southwest of the poblacion of Burauen.",
            "Similar artifacts were found in Barangay Paghudlan which is 12 kilometers from the Kag-oloolo.",
            "The earlier diggings on the south western portion of the poblacion, and those in Barangay Tambuco and Armasen unearth several precious antiques.",
            "With the extensive presence of these artifacts over the said areas, the past locations of the early settlements in Burauen during the prehistoric epoch are indicated."
        ],
        [
            "Spanish regime"
        ],
        [
            "The Jesuit friars discovered Burauen as settlement in the later part of 1595 when they used the community as a base in the Christianization of the central part of Leyte.",
            "Between years 1609 to 1616 Burauen was the most populous town of Leyte and Samar and it consistently registered the highest tax collection during the same period in the region.",
            "From Buraburon, the settlers were told by the Jesuit Missionaries to transfer to “Armasen” (meaning a trading place that is at the same time a granary), presently a sitio of Barangay Libas, which was similarly named today.",
            "Due to frequent flooding of the area by the Guinarona River, and to facilitate their “reducción de las visitas”, they transferred to the site of the present Barangay Malabca and led by Tamdon and his brother Hangdon who were the children of the last Rajah."
        ],
        [
            "Filipino - American War"
        ],
        [
            "A captured photo of the Pulahan movement Leader, Faustino Ablen (Center) sitting between a standing member of Philippine Constabulary and an African-American soldier"
        ],
        [
            "The short-lived Philippine Republic proclaimed on June 12, 1898, face a new enemy, the American who were pursuing their so-called “Manifest Destiny” The troops of the Revolutionary Army under General Ambrosio Mojica, realizing that their fortification of “estacas” (bamboo palisades) around the poblacion of Burauen were weak, they force to withdraw to the mountains.",
            "Several encounters occur during the Filipino-American War, the American burned the poblacion on July 4, 1900, sparing only the Catholic Church, its convent, the warehouses and the building of the Smith Bell and Co. and Chinese merchandizing.",
            "This incident made Burauen one of the strongholds of the “Pulahan” dissidents."
        ],
        [
            "With the cessation of hostilities, the people devoted their efforts to the reconstruction of their homes and expansion of their farms to usher progress of the municipality.",
            "The productive endeavors of the people lured many enterprises to the town.",
            "The first Electric System and cinematographic house in Leyte and Samar were established in Burauen in 1916.",
            "In 1928 Burauen Academy, the first secondary school in the municipality was founded.",
            "The different municipal administrations of the time were able to put up irrigation system in 1912.",
            "Constructed a big public market in 1918, erect a concrete municipal building in 1925 and build concrete school building in 1928. the income of the municipality in 1918 to 1928 was bigger than the income of the whole province of Surigao, this due to the wide area of abacá plantation of that time.",
            "This boomtown prosperity of Burauen lasted until 1929 when the great depression took place."
        ],
        [
            "World War II"
        ],
        [
            "The outbreak of World War II stunted the economic growth of Burauen.",
            "The Japanese Military encamped the eastern part of the poblacion there were many encounters between the Japanese forces and the guerillas who were firmly established in their mountain strongholds.",
            "In August 1944, the Japanese established a \"comfort station\" in the town, where the invaders enslaved local girls, teens, and young adults into becoming sex slaves called \"comfort women\", who were routinely gang-raped and murdered by Japanese soldiers.",
            "During the Allied Forces liberation of Leyte on October 20, 1944, Burauen was among the most heavily devastated towns in Leyte, thousands of civilians were killed and a number of properties were destroyed."
        ],
        [
            "Post-war period to present"
        ],
        [
            "Rising from the ruins of war, the municipality rehabilitated its homes and agriculture, hand in hand with the improvement of its institution and facilities.",
            "In 1946, the Burauen High School was founded, followed by the rehabilitation of the Gabaldon school building, and the construction and operation of the water system in 1948.",
            "The private sector contributed in the field of education in 1950 the Burauen Institute and the Rizal Colleges were founded.",
            "The progress of the town suffered a setback in the middle part of 1951 when a very strong typhoon hit Burauen, which was followed by four others that were equally ravaging.",
            "In 1952, despite financial hardships, the municipal government was able to repair the municipal building from its own funds but generally, the recovery of the municipality was very slow.",
            "On March 2, 1962, the Rural Bank of Burauen was established, the first rural bank in Leyte and Samar.",
            "A decade after, on April 1, 1972, the Burauen District Hospital was opened to accept its first patient.",
            "During the intervening years and onward, road and bridges construction and street concreting in the poblacion and the Barangays alike were pursued, together with the construction of school building and health centers.",
            "The public market area as well as the irrigation system was expanded."
        ],
        [
            "Timeline"
        ],
        [
            "When a German ethnologist and explorer came to Burauen in 1859 to 1860, he witnessed how sulfur was extracted, processed using coconut oil, and transported to Manila, where it was sold between 1 and 5 dollars per PICO.",
            "But the sulfur discovery was already reported 200 years earlier, in 1691, by a jesuit priest named Fr.",
            "Francisco Combes."
        ],
        [
            "In 1873, from being a missionary church under the diocese of Dagami, Burauen was carved out and declared as a separate town."
        ],
        [
            "In 1918, La Paz detached itself from Burauen to become an independent municipality."
        ],
        [
            "In 1949, or just a few years after world war 2, President Elpidio Quirino issued an executive order no.278 separating Julita from burauen."
        ],
        [
            "It was on March 2, 1962 when the Rural Bank of Burauen was established.",
            "Making it the very first rural bank in both islands of Samar and Leyte."
        ],
        [
            "Geography"
        ],
        [
            "Burauen is located in the central part of Leyte Island, bounded to the north by Dagami and Tabon-tabon, on the east by Julita, south by Lapaz and on the west by Albuera and Ormoc City."
        ],
        [
            "Barangays"
        ],
        [
            "Burauen is politically subdivided into 77 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Abuyogon"
        ],
        [
            "Anonang"
        ],
        [
            "Arado"
        ],
        [
            "Balao"
        ],
        [
            "Balatson"
        ],
        [
            "Balorinay"
        ],
        [
            "Bobon"
        ],
        [
            "Buenavista"
        ],
        [
            "Buri"
        ],
        [
            "Caanislagan"
        ],
        [
            "Cadahunan"
        ],
        [
            "Cagangon"
        ],
        [
            "Calao"
        ],
        [
            "Cali"
        ],
        [
            "Calsadahay"
        ],
        [
            "Candag-on"
        ],
        [
            "Cansiboy"
        ],
        [
            "Catagbacan"
        ],
        [
            "Dumalag"
        ],
        [
            "Damulu-an"
        ],
        [
            "Dina-ayan"
        ],
        [
            "Esperansa"
        ],
        [
            "Gamay"
        ],
        [
            "Gitablan"
        ],
        [
            "Hapunan"
        ],
        [
            "Hibonawan"
        ],
        [
            "Hugpa East"
        ],
        [
            "Hugpa West"
        ],
        [
            "Ilihan"
        ],
        [
            "Kagbana"
        ],
        [
            "Kalipayan"
        ],
        [
            "Kaparasanan"
        ],
        [
            "Laguiwan"
        ],
        [
            "Libas"
        ],
        [
            "Limburan"
        ],
        [
            "Logsongan"
        ],
        [
            "Maabab"
        ],
        [
            "Maghubas"
        ],
        [
            "Mahagnao"
        ],
        [
            "Malabca"
        ],
        [
            "Malaguinabot"
        ],
        [
            "Malaihao"
        ],
        [
            "Matin-ao"
        ],
        [
            "Moguing"
        ],
        [
            "Poblacion District I"
        ],
        [
            "Poblacion District II"
        ],
        [
            "Poblacion District III"
        ],
        [
            "Poblacion District IV"
        ],
        [
            "Poblacion District V"
        ],
        [
            "Poblacion District VI"
        ],
        [
            "Poblacion District VII"
        ],
        [
            "Poblacion District VIII"
        ],
        [
            "Poblacion District IX"
        ],
        [
            "Paghudlan"
        ],
        [
            "Paitan"
        ],
        [
            "Pangdan"
        ],
        [
            "Patag"
        ],
        [
            "Patong"
        ],
        [
            "Pawa"
        ],
        [
            "Roxas"
        ],
        [
            "Sambel"
        ],
        [
            "San Esteban"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose East"
        ],
        [
            "San Jose West"
        ],
        [
            "San Pablo"
        ],
        [
            "Tabuanon"
        ],
        [
            "Tagadtaran"
        ],
        [
            "Taghuyan"
        ],
        [
            "Takin"
        ],
        [
            "Tambis"
        ],
        [
            "Tambuko"
        ],
        [
            "Toloyao"
        ],
        [
            "Villa Aurora"
        ],
        [
            "Villa Corazon"
        ],
        [
            "Villa Patria"
        ],
        [
            "Villa Rosas"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Burauen, Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "78(3.1)"
        ],
        [
            "57(2.2)"
        ],
        [
            "84(3.3)"
        ],
        [
            "79(3.1)"
        ],
        [
            "118(4.6)"
        ],
        [
            "181(7.1)"
        ],
        [
            "178(7.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "172(6.8)"
        ],
        [
            "180(7.1)"
        ],
        [
            "174(6.9)"
        ],
        [
            "128(5.0)"
        ],
        [
            "1,598(62.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.7"
        ],
        [
            "13.8"
        ],
        [
            "17.3"
        ],
        [
            "18.5"
        ],
        [
            "23.2"
        ],
        [
            "26.5"
        ],
        [
            "27.1"
        ],
        [
            "26.0"
        ],
        [
            "26.4"
        ],
        [
            "27.5"
        ],
        [
            "24.6"
        ],
        [
            "21.0"
        ],
        [
            "268.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BurauenYearPop.±% p.a.1903 18,197—    1918 25,647+2.31%1939 33,505+1.28%1948 37,252+1.18%1960 31,807−1.31%1970 42,954+3.05%1975 47,152+1.89%1980 48,053+0.38%YearPop.±% p.a.1990 46,029−0.43%1995 50,751+1.85%2000 47,180−1.55%2007 48,606+0.41%2010 48,853+0.18%2015 52,732+1.47%2020 52,511−0.08%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Burauen, Leyte, was 52,511 people, with a density of 200 inhabitants per square kilometre or 520 inhabitants per square mile."
        ],
        [
            "Its population in 2015 comprised 3.1 percent of the total population of Leyte (excluding Tacloban City).",
            "It grew at the rate of 1.46 percent annually from 2010 to 2015, which is higher by 1.12 percentage points from its population growth rate in 2000 to 2010 of 0.35 percent."
        ],
        [
            "The household population of Burauen totaled to 52,548 persons in 2015, which is 7.9 percent higher than its count in 2010 at 48,711 persons.",
            "Majority or 99.7 percent of the total population of Burauen in 2015 are household population.",
            "The remaining 0.3 percent or 184 persons comprised institutional population or those residing in collective or institutional living quarters such as hospitals, rehabilitation centers, orphanages, hotels, motels, inns, lodging houses, dormitories, military camps, corrective and penal institutions, logging, mining, construction/public work camps, and other institutional living quarters."
        ],
        [
            "The number of households in 2015 reached 12,577, higher by 1,983 households from 10,594 in 2010.",
            "The average household size in Burauen declined from 4.6 in 2010 to 4.2 in 2015.",
            "This municipality posted the 10th highest number of households in Leyte in 2015."
        ],
        [
            "The estimated total land area of Burauen was 265.33 square kilometers as per data from the Land Management Bureau of the Department of Environment and Natural Resources.",
            "The resulting population density in 2015 posted at 199 persons per square kilometer, higher than in 2000 and 2010 at 178 and 184 persons per square kilometer, respectively."
        ],
        [
            "Of the 77 barangays of Burauen, Barangay Poblacion District III registered the biggest population with 2,565 persons in 2015 or 4.9 percent of the municipality's total population.",
            "The remaining barangays which completed the top 10 barangays in terms of population were Poblacion District IX (2,530), Poblacion District VI (2,162), Poblacion District IV (2,099), Poblacion District II (1,671), Poblacion District I (1,614), Arado (1,369), Libas (1,357), Maghubas (1,189), and Malabca (1,111).",
            "These barangays also recorded with the highest number of households."
        ],
        [
            "Meanwhile, Barangay Gitablan recorded the smallest population in 2015 with 139 persons which accounted 0.3 percent of the total population of Burauen.",
            "The remaining barangays which completed the bottom 10 barangays in terms of population were Balatson (181), Kaparasanan (211), Laguiwan (230), San Fernando (236), Damulo-an (242), Buenavista (245), Hugpa East (253), Cali (269), and Kagbana (282)."
        ],
        [
            "The top three (3) fastest growing barangays of Burauen in terms of population growth rate from 2010 to 2015 were Hibonawan (10.69 percent), Ilihan (9.38 percent) and Maghubas (7.83 percent).",
            "The rest of the barangays which completed the top 10 fastest growing barangays were Balorinay, Cagangon, Taghuyan, Caanislagan, Cadahunan, San Esteban and Esperanza with PGRs ranging from 4.96 percent to 6.45 percent."
        ],
        [
            "Economy"
        ],
        [
            "Agriculture is the main driver of development in Burauen.",
            "Demand for staple foods, agricultural commodities and - increasingly - processed food is growing within the municipality."
        ],
        [
            "Also, commerce is the next thing that driving the town's economy for decades.",
            "It was able to develop people's way of doing business, coupled by the local government units excellent management which is one of the country's best in terms of business efficiency."
        ],
        [
            "Tourism is also a growing economic growth driver currently in the process development."
        ],
        [
            "According to the Cities and Municipalities Competitiveness Index Report, Burauen has been consistently one of the top performers in the region and in the province since the ranking started in 2013.",
            "The town has been the top performer in Leyte for the year 2017, 2018 and 2019.",
            "Making it the only town in the province to held the top spot for 3 consecutive years and has been consistently in the top 10 since CMCI started in 2013."
        ],
        [
            "Cities and municipalities competitiveness index ranking"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(November 2022) (Learn how and when to remove this message)"
        ],
        [
            "2019"
        ],
        [
            "Provincial rank- 1st"
        ],
        [
            "National rank- 186th"
        ],
        [
            "2018"
        ],
        [
            "Provincial rank- 1st"
        ],
        [
            "National rank- 303rd"
        ],
        [
            "2017"
        ],
        [
            "Provincial rank- 1st"
        ],
        [
            "National rank- 93rd"
        ],
        [
            "2016"
        ],
        [
            "Provincial rank- 6th"
        ],
        [
            "National rank- 414th"
        ],
        [
            "2015"
        ],
        [
            "Provincial rank- 3rd"
        ],
        [
            "National rank- 420th"
        ],
        [
            "2014"
        ],
        [
            "Provincial rank- 3rd"
        ],
        [
            "National rank- 182"
        ],
        [
            "Infrastructure"
        ],
        [
            "According to the 2019 Cities and Municipalities Competitiveness Index, Burauen posted the highest score in the province and second in the region in terms of infrastructure quality and development."
        ],
        [
            "Tourism"
        ],
        [
            "The Local Government Unit of Burauen has been consulting with industry experts on how to develop the town's eco-tourism sites in a sustainable manner to carry out the Burauen Eco-tourism and Sustainable Tourism (BEST) project."
        ],
        [
            "With extensive promotion and backing of experts, Burauen is off to a good start in its goal to market and cement the town's status as the spring capital of Leyte."
        ],
        [
            "Other identified eco-tourism sites are in the villages of Matin-ao, Tambis, Villa Rosas, Abuyogon, Cansiboy, and Kagbana."
        ],
        [
            "These areas are seen as an addition to Mahagnao Volcano Natural Park, a site proclaimed as a national park in 1937."
        ],
        [
            "Notable persons supporting the initiative are former actress and UN Sustainable Development Goals Advocate Antoinette Taus, former Tourism Secretary Mina Gabor, and Asean Center for Biodiversity Director Mundita Lim."
        ],
        [
            "Attractions"
        ],
        [
            "Mahagnao Volcano Natural Park"
        ],
        [
            "Burauen's upland territories are composed of wetland forests that contain thousands of century old trees, unique species of birds and mammals, plants and marine species mostly scattered inside Mahagnao Volcano Natural Park.",
            "It is also has with many natural sites such as lakes, mountain ranges, rivers, waterfalls, hot springs and a volcano.",
            "MVNP has an elevation of 1,200 meters above sea level and an area of 635 hectares, within the boundaries of Burauen, La Paz and McArthur towns."
        ],
        [
            "Mahagnao Volcano"
        ],
        [
            "Mahagnao Volcano is a dormant volcano located in Barangay Mahagnao, more than 30 km away from the town proper.",
            "Although the volcano has been inactive, it is still classified as potentially active due to the active thermal features of the mountain.",
            "Tourist are allowed to hike on its peak."
        ],
        [
            "Malagsum Lake"
        ],
        [
            "This lake is smaller compared to the other one.",
            "It is a highly acidic lake which contains high level of sulfuric acid making it impossible for marine lives or some organisms to thrive.",
            "Except for the hundreds to thousands of wild docks making it as breeding ground or a home for migratory birds during migrating season."
        ],
        [
            "Mahagnao Lake"
        ],
        [
            "This lake serves as the main source of marine products for the locals and also the center of its tourism activities.",
            "Several resorts owned privately or by community associations are on the lakeshore."
        ],
        [
            "Matigbao Lake"
        ],
        [
            "It is the smallest of the three lakes inside the park.",
            "But it is also the farthest and the most challenging to have a trek."
        ],
        [
            "Due to being isolated, the environment is quite different from what commonly seen in the rest of the park.",
            "There are numerous species of plants and insects thriving within the vicinity (such as dragonflies)."
        ],
        [
            "Calor Hot spring"
        ],
        [
            "The spring is just located at the southern foot of the volcano.",
            "It was a system of springs heated by an active thermal feature.",
            "Thus, creating a hot spring that merges to another system of spring creating a river of hot spring."
        ],
        [
            "Guin-aniban Falls"
        ],
        [
            "The waterfall is located few kilometers on the southeast.",
            "It is the water from the Mahagnao lake which is passing to systems of rivers then merge before approaching on the mouth of the cliff creating a water fall that directly flow on the larger river called Marabong."
        ],
        [
            "Norberto Romualdez monument - historical marker"
        ],
        [
            "In his honor, June 6 every year was declared Norberto Romualdez Sr. Day."
        ],
        [
            "Norberto Romualdez Sr. park"
        ],
        [
            "On June 14, 2024, Mayor Juanito E. Renomeron inaugurated the restored 177-square meter park built in 1975, beside the 1600 Our Lady of the Immaculate Conception Church along the corner of Santa Ana and Ave Maria Streets, the exact site of his 1800s ancestral house.",
            "It is named after Norberto Romualdez.",
            "It was first improved in 2022 with the assistance of the National Historical Commission of the Philippines assistance."
        ],
        [
            "Religion"
        ],
        [
            "Healthcare"
        ],
        [
            "Burauen healthcare needs are served by both the private and government owned health institutions."
        ],
        [
            "Burauen District Hospital (managed by the Provincial Government of Leyte)"
        ],
        [
            "Burauen Rural Heath Unit (managed by the LGU of Burauen)"
        ],
        [
            "Barangay Health Centers (with presence in each barangays of Burauen)"
        ],
        [
            "While there are also several Private health facilities that catering Burawanons and nearby towns scattered all over the Poblacion."
        ],
        [
            "Education"
        ],
        [
            "Burauen's educational institutions is one of the largest when it comes to the size of enrollment and the teacher to student ratio."
        ],
        [
            "The town is served by both public and private educational institutions."
        ],
        [
            "Tertiary"
        ],
        [
            "EVSU-Burauen Campus"
        ],
        [
            "Burauen Community College"
        ],
        [
            "TESDA Burauen (Vocational)"
        ],
        [
            "Secondary"
        ],
        [
            "Burauen Comprehensive National Highschool (BCNHS)"
        ],
        [
            "Burauen National Highschool (BNHS)"
        ],
        [
            "Hibunauan National Highschool"
        ],
        [
            "Buraburon National Highschool"
        ],
        [
            "Armasen National Highschool"
        ],
        [
            "Primary"
        ],
        [
            "All of Burauen's 77 barangays had public primary schools that are shared and governed by the town's three school districts namely; Burauen North, Burauen South and Burauen East under the supervision of Deped Leyte Second Division."
        ],
        [
            "Immaculate Conception Academy of Burauen"
        ],
        [
            "Morningside Middle School of Burauen"
        ],
        [
            "Gallery"
        ],
        [
            "Daguitan Irrigation Facility"
        ],
        [
            "Marabong River"
        ],
        [
            "Mamanwa tribe leader holding a gong being used for their rituals"
        ],
        [
            "Burauen Municipal Hall"
        ],
        [
            "Tribu Buraburon performing in the Aliwan Festival"
        ],
        [
            "Burauen Executive & Legislative Building"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Burauen |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Philippine Survivor Recounts Her Struggle As A 'Comfort Woman' For Wartime Japan\".",
            "NPR.org.",
            "NPR.",
            "Retrieved 15 August 2021."
        ],
        [
            "^ The Other Empire: Literary Views of Japan from the Philippines, Singapore, and Malaysia.",
            "The University of the Philippines Press.",
            "2008.",
            "ISBN 9789715425629.",
            "Retrieved 15 August 2021."
        ],
        [
            "^ \"Women made to be Comfort Women - Philippines\"."
        ],
        [
            "^"
        ],
        [
            "\"Province:\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Burauen: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 February 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ a b c d e f g \"Special Release - POPCEN - Burauen | Philippine Statistics Authority - Eastern Visayas\"."
        ],
        [
            "^"
        ],
        [
            "^"
        ],
        [
            "^ Gabieta, Joey (June 17, 2024).",
            "\"Leyte town opens renovated park named after Marcos' grand uncle\".",
            "Philippine Daily Inquirer.",
            "Retrieved June 20, 2024."
        ],
        [
            "^ Meniano, Sarwell (June 14, 2024).",
            "\"Leyte town launches park honoring PBBM's grand uncle\".",
            "Retrieved June 20, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Burauen, Leyte."
        ],
        [
            "Wikimedia Commons has media related to Burauen."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Burauen"
        ],
        [
            "Ormoc"
        ],
        [
            "Dagami"
        ],
        [
            "Tabontabon"
        ],
        [
            "Albuera"
        ],
        [
            "Burauen"
        ],
        [
            "Julita"
        ],
        [
            "La Paz"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Burauen&oldid=1232221811\""
        ],
        [
            "Category: Municipalities of Leyte (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listAll articles with dead external linksArticles with dead external links from August 2022Articles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textArticles needing additional references from November 2022All articles needing additional referencesAll articles with unsourced statementsArticles with unsourced statements from July 2020Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}