{
    "name": "Bustos",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bustos, Bulacan"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°57′N 120°55′E﻿ / ﻿14.95°N 120.92°E﻿ / 14.95; 120.92"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bulacan, Philippines"
        ],
        [
            "Bustos, officially the Municipality of Bustos (Tagalog: Bayan ng Bustos),  is a 1st class municipality in the province of Bulacan, Philippines.",
            "According to the 2020 census, it has a population of 77,199 people."
        ],
        [
            "With the continuous expansion of Metro Manila, Bustos is part of Manila's built-up area which reaches San Ildefonso, Bulacan at its northernmost partMunicipality in Central Luzon, PhilippinesBustosMunicipalityMunicipality of Bustos"
        ],
        [
            "(From top, left to right): Bustos Municipal Hall • Bulacan Military Area Park • Santo Niño de"
        ],
        [
            "Bustos Parish Church • Bustos Dam panoramic view"
        ],
        [
            "FlagSealMotto: Minasa ng kaunlaran!Anthem: Bayang Dakila (Himno ng Bustos)Map of Bulacan with Bustos highlightedOpenStreetMapBustosLocation within the PhilippinesCoordinates: 14°57′N 120°55′E﻿ / ﻿14.95°N 120.92°E﻿ / 14.95; 120.92CountryPhilippinesRegionCentral LuzonProvinceBulacanDistrict"
        ],
        [
            "2nd districtFoundedJanuary 1, 1917Named forJose Pedro Pérez de BustoBarangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFrancis Albert G. Juan • Vice MayorMartin S. Angeles • RepresentativeAugustina Dominique C. Pancho • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Marie Niña N. PerezLeo T. SantosPhillip Wryner B. SantosJuliet D. Dela CruzAljhaneal E. QuiñonesSoliman C. SantosWilfredo G. CanozaJohn Erick L. Perez"
        ],
        [
            " • Electorate48,827 voters (2022)Area • Revenue₱ 213.9 million (2020) • Assets₱ 182.3 million (2020) • Expenditure₱ 207.9 million (2020) • Liabilities₱ 57.96 million (2020)Utilities • ElectricityMeralcoTime zoneUTC+8 (PST)ZIP code3007PSGC0301406000IDD : area code +63 (0)44Native languagesTagalog"
        ],
        [
            "Etymology"
        ],
        [
            "The town got its name from Jose Pedro Perez de Busto(s), a mining engineer from Villaviciosa, Asturias, Spain, served as the right-hand of Simón de Anda y Salazar, and was appointed teniente general alcalde (Provincial Governor) of Bulacan."
        ],
        [
            "History"
        ],
        [
            "Bustos was a part of the town of Baliuag as its barrio during the Spanish Period.",
            "The town was separated from Baliuag by a tragic incident when around 1860, during a rainy Sunday, a group of natives from Bustos with babies in their arms were on their way to St. Augustine Parish Church of Baliuag for baptismal when they drowned after the planceta or raft they were riding accidentally capsized while crossing the wild river of Angat due to the strong water current.",
            "This fateful event led the people of Bustos to request and build their own parish church to avoid the crossings in the wild river for community safety.",
            "The locals chose Holy Child Jesus (Santo Niño) as their patron saint in honor of those infants that died in the river."
        ],
        [
            "Bustos also gained its independence from Baliuag on April 29, 1867, through the painstaking efforts and sacrifices of its inhabitants with the integration of barrios Bonga Mayor and Bonga Menor.",
            "However, it was returned to Baliuag on October 8, 1903, with San Rafael merging as well."
        ],
        [
            "Bustos became a distinct municipality on January 1, 1916, during the Philippine Assembly through Assemblyman Ricardo Lloret Gonzalez (Bulacan–2nd).",
            "A year after, the town inaugurated its municipal hall on January 1, 1917.",
            "Leon Prado became its first Municipal Mayor and served from 1917 to 1919.",
            "Gabriel Alvarez served as the first parish priest of the institutionalized Santo Niño de Bustos Parish Church."
        ],
        [
            "The town became a part of Baliuag again during the American period.",
            "At the time, Bustos also became a part of the historical World War II in the Philippines and served as the military headquarters of soldiers in the province of Bulacan during the war in 1945 being led by Bustosenyo then Capt.",
            "Alejo Santos."
        ],
        [
            "With the theme \"Bustos Sentenaryo: Isang Daan tungo sa Ikasandaan\" (lit. transl.",
            "Bustos Centenary: One Way Towards One Hundredth), Bustos celebrated its 100th year founding anniversary in 2017, at the same time as the Santo Niño de Bustos Parish Church's 150th year founding anniversary as an independent parish church of the municipality.",
            "The Philippine Postal Corporation made a special commemorative stamp for the centennial anniversary celebration of the town."
        ],
        [
            "Geography"
        ],
        [
            "Bustos is located at the center of five adjoining towns of Bulacan: San Rafael on the north; Pandi and Plaridel on the south; Baliuag on the west; and Angat on the east."
        ],
        [
            "The land areas are mostly rice fields devoted for planting crops and agricultural products.",
            "Some farmlands of the town are covered by irrigation systems of National Irrigation Administration coming from Bustos Dam and Angat Dam on the Angat River."
        ],
        [
            "Bustos is 29 kilometres (18 mi) from Malolos, 52 kilometres (32 mi) from Manila, and 35 kilometres (22 mi) from San Jose del Monte."
        ],
        [
            "Barangays"
        ],
        [
            "Bustos is politicially subdivided into 14 barangays.",
            "There are (six urban and eight rural) barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 031406001   Bonga Mayor"
        ],
        [
            " 4.9%"
        ],
        [
            " 3,792"
        ],
        [
            " 4,407"
        ],
        [
            "  ▾"
        ],
        [
            " −1.49%"
        ],
        [
            " 031406002   Bonga Menor"
        ],
        [
            " 6.0%"
        ],
        [
            " 4,619"
        ],
        [
            " 4,742"
        ],
        [
            "  ▾"
        ],
        [
            " −0.26%"
        ],
        [
            " 031406003   Buisan"
        ],
        [
            " 2.4%"
        ],
        [
            " 1,869"
        ],
        [
            " 1,783"
        ],
        [
            "  ▴"
        ],
        [
            " 0.47%"
        ],
        [
            " 031406004   Camachilihan"
        ],
        [
            " 3.3%"
        ],
        [
            " 2,552"
        ],
        [
            " 2,289"
        ],
        [
            "  ▴"
        ],
        [
            " 1.09%"
        ],
        [
            " 031406005   Cambaog"
        ],
        [
            " 8.1%"
        ],
        [
            " 6,242"
        ],
        [
            " 5,592"
        ],
        [
            "  ▴"
        ],
        [
            " 1.11%"
        ],
        [
            " 031406006   Catacte"
        ],
        [
            " 10.3%"
        ],
        [
            " 7,990"
        ],
        [
            " 2,367"
        ],
        [
            "  ▴"
        ],
        [
            " 12.93%"
        ],
        [
            " 031406007   Liciada"
        ],
        [
            " 6.5%"
        ],
        [
            " 5,017"
        ],
        [
            " 4,702"
        ],
        [
            "  ▴"
        ],
        [
            " 0.65%"
        ],
        [
            " 031406008   Malamig"
        ],
        [
            " 7.3%"
        ],
        [
            " 5,633"
        ],
        [
            " 5,313"
        ],
        [
            "  ▴"
        ],
        [
            " 0.59%"
        ],
        [
            " 031406009   Malawak"
        ],
        [
            " 3.6%"
        ],
        [
            " 2,789"
        ],
        [
            " 2,383"
        ],
        [
            "  ▴"
        ],
        [
            " 1.59%"
        ],
        [
            " 031406010  Poblacion"
        ],
        [
            " 9.3%"
        ],
        [
            " 7,153"
        ],
        [
            " 9,641"
        ],
        [
            "  ▾"
        ],
        [
            " −2.94%"
        ],
        [
            " 031406011   San Pedro"
        ],
        [
            " 9.1%"
        ],
        [
            " 6,994"
        ],
        [
            " 6,506"
        ],
        [
            "  ▴"
        ],
        [
            " 0.73%"
        ],
        [
            " 031406012   Talampas"
        ],
        [
            " 4.3%"
        ],
        [
            " 3,325"
        ],
        [
            " 3,660"
        ],
        [
            "  ▾"
        ],
        [
            " −0.96%"
        ],
        [
            " 031406013   Tanawan"
        ],
        [
            " 3.7%"
        ],
        [
            " 2,862"
        ],
        [
            " 2,946"
        ],
        [
            "  ▾"
        ],
        [
            " −0.29%"
        ],
        [
            " 031406014   Tibagan"
        ],
        [
            " 8.0%"
        ],
        [
            " 6,202"
        ],
        [
            " 6,084"
        ],
        [
            "  ▴"
        ],
        [
            " 0.19%"
        ],
        [
            "Total"
        ],
        [
            "77,199"
        ],
        [
            "62,415"
        ],
        [
            " ▴"
        ],
        [
            "2.15%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Bustos, Bulacan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "6(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "6(0.2)"
        ],
        [
            "17(0.7)"
        ],
        [
            "82(3.2)"
        ],
        [
            "122(4.8)"
        ],
        [
            "151(5.9)"
        ],
        [
            "123(4.8)"
        ],
        [
            "124(4.9)"
        ],
        [
            "99(3.9)"
        ],
        [
            "37(1.5)"
        ],
        [
            "21(0.8)"
        ],
        [
            "792(31.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "2.5"
        ],
        [
            "11.7"
        ],
        [
            "6.6"
        ],
        [
            "17.7"
        ],
        [
            "22.2"
        ],
        [
            "25.2"
        ],
        [
            "23.7"
        ],
        [
            "23.2"
        ],
        [
            "17.9"
        ],
        [
            "9.2"
        ],
        [
            "5.2"
        ],
        [
            "168.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BustosYearPop.±% p.a.1903 7,072—    1918 6,855−0.21%1939 8,692+1.14%1948 10,493+2.11%1960 13,412+2.07%1970 19,254+3.68%1975 22,622+3.29%1980 25,739+2.61%1990 34,965+3.11%1995 41,372+3.20%2000 47,091+2.81%2007 60,681+3.56%2010 62,415+1.03%2015 67,039+1.37%2020 77,199+2.81%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Bustos, Bulacan, was 77,199 people, with a density of 1,100 inhabitants per square kilometre or 2,800 inhabitants per square mile."
        ],
        [
            "Religion"
        ],
        [
            "Façade of Santo Niño Parish"
        ],
        [
            "Bustos has two parishes under the administration of the Diocese of Malolos, Santo Niño de Bustos Parish Church and San Isidro Labrador Parish Church."
        ],
        [
            "Other Christian religious groups, such as Iglesia ni Cristo, Seventh-day Adventist Church, Jesus is Lord Church, Ang Dating Daan, the Church of Jesus Christ of Latter-day Saints, Jehovah's Witnesses and other Protestant groups can be found in the municipality."
        ],
        [
            "People in Bustos celebrate a number of Catholic holidays throughout the year.",
            "The first church in Bustos has been dedicated to Santo Niño, the Holy Child Jesus, and there is a feast that is held in memory every third Sunday of January, where the townspeople celebrate it with music and dance while holding images of Santo Niño decorated with flowers and lights with parade of floats with images of the saint (locally known as Tugyaw)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bustos"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  10.00"
        ],
        [
            "2009  8.14"
        ],
        [
            "2012  5.87"
        ],
        [
            "2015  5.80"
        ],
        [
            "2018  4.31"
        ],
        [
            "2021  13.50"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Bustos Wet and Dry Public Market"
        ],
        [
            "Bustos is, in the majority, an agricultural town.",
            "It is hailed as one of the largest rice producers of the country and the Central Luzon Region (the Rice Granary of the Philippines), and received the Rice Achiever Award as an Outstanding Municipality in Region III (Central Luzon) and a Hall of Fame award at the Agri-Pinoy Rice Achievers Awards of 2014 conferred by the Department of Agriculture."
        ],
        [
            "The Bustos commercial center in the town proper is still expanding with the influx of more business investors willing to venture into the small but flourishing town.",
            "At present, the town has its public market and a few small private markets, business shops, banks, convenience stores, restaurants, cafeterias, and grocery stores."
        ],
        [
            "Bustos has its own trademark product, the finger food 'minasa'."
        ],
        [
            "Minasa refers to \"cassava cookies\", made from cassava flour, egg yolk, yeast, butter, and coco milk.",
            "It is often compared to the uraro, another local delicacy.",
            "Minasa is one of the famous treats from the province of Bulacan traded in the local and global market of Filipino pasalubong products.",
            "During the Spanish colonial era, Bustos' minasa cookies were made from sago or arrowroot starch instead of cassava.",
            "The main ingredient was changed because of the long production time of sago starch and when cassava starch became cheaper and easier to produce with the onset of cassava flour-making equipment.",
            "Also, minasas were exclusively produced and eaten by the elite Bulakeños who were the only ones who could afford the ingredients and the equipment for the production of the flour.",
            "The word minasa translates to \"molded\" in English.",
            "The process of preparing minasa is similar to the making and baking of cookies.",
            "The only special characteristics of minasa are its shape, which is molded on specially-made wooden molders with intricate designs, commonly floral designs, and its being baked in a hurno or brick stone oven that adds to the yumminess of the cookie.",
            "Minasa is said to be a part of the history and culture of Bulacan because of the egg yolks that were left in kitchens during the building of old stone houses that were made of egg whites.",
            "Currently, there are stalls all around Bustos selling this local delicacy, making the municipality the \"Home of Minasa\"."
        ],
        [
            "The Rural Bank of Bustos under Producers Savings Bank Corporation"
        ],
        [
            "Bustos has a rural bank, the Rural Bank of Bustos, which is located at Gen. Alejo Santos Highway, Barangay Bonga Menor, beside the Bustos by-pass road going to Cabanatuan, Nueva Ecija.",
            "It has a branch in Barangay Poblacion in front of Santo Niño Hospital.",
            "The bank is currently under the management of Producers Savings Bank Corporation."
        ],
        [
            "Other products, industries, & services"
        ],
        [
            "Rice and other agricultural products"
        ],
        [
            "Poultry & swine raising and other dairy products"
        ],
        [
            "Bags and handicrafts making"
        ],
        [
            "Pastry making"
        ],
        [
            "Food processing and retail selling"
        ],
        [
            "Garments and embroidery"
        ],
        [
            "Metal-crafting"
        ],
        [
            "Furniture making"
        ],
        [
            "Fishpond raising"
        ],
        [
            "Recreational facilities and services"
        ],
        [
            "Resorts and hotels"
        ],
        [
            "Electrical supply and hardware"
        ],
        [
            "Culture"
        ],
        [
            "2016 Minasa Festival street dance demonstration at SM City Baliwag Event Center"
        ],
        [
            "Minasa Festival is the official festival of Bustos observed every January where street dances, dance showdowns, cooking contests, singing contests, running events, beauty pageants, live band concerts and other variety shows are commonly done.",
            "It features the cookie minasa, a locally-made delicacy as well as other items such as the dry-like wafer crispy barquillos.",
            "The festival was first celebrated in 2011 and since then, the activity is televised yearly."
        ],
        [
            "Manok-Manok (Chicken) Festival in Barangay San Pedro every June and Hito (Catfish) Festival in Barangay Camachilihan every August are also observed."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Bustos is a recipient of the 2017 Seal of Good Local Governance given by the Department of the Interior and Local Government.",
            "Based on the 2022 Philippine general election, here are the following elected local officials of the Municipality of Bustos for the term 2022 – 2025."
        ],
        [
            "2022–2025 Bustos Municipal Officials"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "Mayor"
        ],
        [
            "Francis Albert \"Iskul\" G. Juan"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Martin S. Angeles"
        ],
        [
            "Independent"
        ],
        [
            "Councilors"
        ],
        [
            "Marie Niña N. Perez"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Leo T. Santos"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Phillip Wryner \"Gen\" B. Santos"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Juliet D. Dela Cruz"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Aljhaneal \"Anel\" E. Quiñones"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Soliman C. Santos"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Wilfredo \"Willy\" G. Canoza"
        ],
        [
            "PDP–Laban"
        ],
        [
            "John Erick \"Tangkol\" L. Perez"
        ],
        [
            "NUP"
        ],
        [
            "Ex Officio Municipal Council Members"
        ],
        [
            "ABC President"
        ],
        [
            "Fortunato SJ.",
            "Angeles (Liciada)"
        ],
        [
            "Nonpartisan"
        ],
        [
            "SK Federation President"
        ],
        [
            "Kyle Gabrille D.R Navarro (Tibagan)"
        ],
        [
            "Nonpartisan"
        ],
        [
            "Transportation"
        ],
        [
            "Bustos Bypass Road"
        ],
        [
            "North Luzon Expressway has a by-pass road that passes through the municipality of Bustos that shortens the transportation of goods and passengers from some areas in Bulacan going to Metro Manila and Nueva Ecija.",
            "The Bustos by-pass road passes through Gen. Alejo Santos Highway at Barangay Bonga Menor, Bustos, Bulacan and travels to NLEx Balagtas Exit Toll Plaza leading to Balintawak Cloverleaf, Quezon City, on one side and San Rafael, Bulacan, leading to Cabanatuan, Nueva Ecija, on the other."
        ],
        [
            "Education"
        ],
        [
            "Gate of Bulacan State University – Bustos Campus"
        ],
        [
            "There are eight secondary schools in Bustos, four of which are public while every barangay has its own public pre-elementary and elementary school."
        ],
        [
            "Bulacan State University – Bustos Campus (BulSU-Bustos) is the largest satellite campus of the university.",
            "It was established in 1976 and it offers degrees in education, industrial technology, information technology, engineering, and business administration."
        ],
        [
            "Notable personalities"
        ],
        [
            "Alejo Santos – popularly known as \"Manong\"; a survivor of Bataan Death March; a World War II hero; leader of the Bulacan Military Area; former Secretary of National Defense of the Philippines under then President Carlos P. Garcia; former Military Governor of Bulacan province; ran in the Philippine Presidential Elections before but lost to then President Ferdinand E. Marcos."
        ],
        [
            "Katy de la Cruz –  also known as \"Mommy Kate\"; \"Queen of Philippine Vaudeville/ Bodabil\", \"Queen of Filipino Jazz\" and awarded as FAMAS Best Supporting Actress."
        ],
        [
            "Luzviminda Tancangco – also known as \"Baby\"; first non-lawyer and woman commissioner of the Philippine Commission on Elections.",
            "She was also its first female acting chairman (1998–1999)."
        ],
        [
            "Gen. Carlito Galvez Jr. – Former Chief of Staff of the Armed Forces of the Philippines; former commander of the 6th Infantry Division (Philippines); former chairman of Coordinating Committee on the Cessation of Hostilities; and former commander of AFP Western Mindanao Command and known for his leadership in the Battle of Marawi."
        ],
        [
            "Rear Admiral Hilario Ruiz – former Flag Officer in Command of the Philippine Navy (PN); one of Rolex 12 advisers of President Ferdinand Marcos during his martial law period; BRP Hilario Ruiz (PG-378), a coastal patrol boat of the Philippine Navy, is named after him."
        ],
        [
            "Conrado Mercado, Sr. – locally known as \"Mr. Irrigation\"; first National Irrigation Administration (NIA) Assistant Administrator; Original owner of the Mercado Ancestral House in Barangay Bonga Menor; the government created a statue for him to serve as a memorabilia for him and his contributions."
        ],
        [
            "Conrado Mercado, Jr. – most successful Bustosenyo in the aspect of arts; famous metal-sculptor and painter; one of the greatest artists produced by the University of Santo Tomas; enlisted as one of UST's Alumni Permanent Roll of Honor; gained the Outstanding Thomasian Award in the field of arts; honored by the City of Manila with the Patnubay ng Sining Award; founded the Philippine Association of Figure Artists and became the president of Society of Philippine Sculptors; his artworks are placed in the Paraiso ng mga Bata in front of the Aklatang Bayan ng Bustos being part of the Bustos Heritage Park."
        ],
        [
            "Minister Jesus Hipolito – former Minister of Department of Public Works and Highways (DPWH) from 1980 to 1986."
        ],
        [
            "Gen. Romeo Maganto – retired and decorated police general of the Philippine National Police having awarded with 45 medals in service; former chief of Western Police District; former traffic czar during the administration of President Fidel V. Ramos and is known as the first to implement the color coding traffic scheme in 1995; featured in the films Tomagan: Story of Gen. Romeo Maganto and Leon ng Maynila, Lt. Col. Romeo Maganto."
        ],
        [
            "Sister cities"
        ],
        [
            " Valenzuela,  Metro Manila, Philippines"
        ],
        [
            " Villaviciosa,  Asturias,  Spain"
        ],
        [
            "Gallery"
        ],
        [
            "Bustos Welcome Arch from Baliwag"
        ],
        [
            "Arts, Culture and Tourism Center"
        ],
        [
            "Dr. Pablito V. Mendoza, Sr. Multi-purpose Gymnasium"
        ],
        [
            "San Isidro Labrador Parish Church"
        ],
        [
            "Mercado Ancestral House"
        ],
        [
            "References"
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^  Municipality of Bustos |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Mayor Mendoza laments on beginnings of Bustos | Politiko Central Luzon\".",
            "25 May 2017."
        ],
        [
            "^ \"Bulacan, Philippines: Bustos, Bulacan: History\".",
            "Archived from the original on 2019-04-26.",
            "Retrieved 2018-07-21."
        ],
        [
            "^ Act No.",
            "932 (October 8, 1903), \"An Act Reducing the Twenty-five Municipalities of the Province of Bulacan to Thirteen\", Senate of the Philippines Legislative Digital Resources, retrieved July 3, 2023"
        ],
        [
            "^ \"Bulacan, Philippines: Bustos, Bulacan: History\".",
            "Archived from the original on 2019-04-26.",
            "Retrieved 2018-07-21."
        ],
        [
            "^ \"Philippines Stamps\"."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Bustos: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 12 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ Maricel Eballo, \"Feast of Santo Niño in Bustos, Bulacan\", Catholics & Cultures updated December 4, 2017"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Central Luzon bags rice achievers awards\".",
            "SunStar.",
            "30 March 2015."
        ],
        [
            "^ \"Municipal Officials-Bustos\".",
            "Provincial Government of Bulacan Official Website.",
            "Retrieved 26 July 2018."
        ],
        [
            "^ \"BulSU Campuses | Bulacan State University\"."
        ],
        [
            "^ \"Who is Carlito Galvez Jr, the next Philippine military chief?\".",
            "7 April 2018."
        ],
        [
            "^ Malig, Jojo (2013-04-12).",
            "\"'Omega 12' behind Marcos' martial law - US envoy\".",
            "ABS-CBN Corporation.",
            "Archived from the original on 2021-04-10."
        ],
        [
            "^ \"Conrado Mercado - A tribute to his masterpieces\"."
        ],
        [
            "^ Secretary of Public Works and Highways"
        ],
        [
            "^ \"Ex-police general Romeo Maganto dies at 70\"."
        ],
        [
            "^ \"Bustos eyes more innovative programs as Valenzuela's sister city – Win Gatchalian\".",
            "December 4, 2014."
        ],
        [
            "^ .",
            "May 5, 2017 https://m.facebook.com/story.php?story_fbid=413394369023016&id=100010573681590.",
            "{{cite news}}: Missing or empty |title= (help)"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Bustos, Bulacan."
        ],
        [
            "Bustos Bulacan"
        ],
        [
            "Facebook Page"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Bustos, Bulacan"
        ],
        [
            "San Rafael"
        ],
        [
            "Baliwag"
        ],
        [
            "Bustos"
        ],
        [
            "Angat"
        ],
        [
            "Plaridel"
        ],
        [
            "Pandi"
        ],
        [
            "vte Province of BulacanMalolos (capital)  San Jose del Monte (largest city)Municipalities"
        ],
        [
            "Angat"
        ],
        [
            "Balagtas"
        ],
        [
            "Bocaue"
        ],
        [
            "Bulakan"
        ],
        [
            "Bustos"
        ],
        [
            "Calumpit"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Guiguinto"
        ],
        [
            "Hagonoy"
        ],
        [
            "Marilao"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Pandi"
        ],
        [
            "Paombong"
        ],
        [
            "Plaridel"
        ],
        [
            "Pulilan"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Maria"
        ],
        [
            "Component cities"
        ],
        [
            "Baliwag"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bustos,_Bulacan&oldid=1227524304\""
        ],
        [
            "Category: Municipalities of BulacanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listAll articles lacking reliable referencesArticles lacking reliable references from August 2018CS1 errors: missing titleCS1 errors: bare URLArticles with short descriptionShort description is different from WikidataArticles containing Tagalog-language textInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using infobox settlement with possible demonym listCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}