{
    "name": "Busuanga",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Busuanga, Palawan"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°08′01″N 119°56′11″E﻿ / ﻿12.133519°N 119.936314°E﻿ / 12.133519; 119.936314"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Palawan, Philippines"
        ],
        [
            "\"Busuanga\" redirects here.",
            "For the island, see Busuanga Island.",
            "For the squirrel, see Busuanga squirrel."
        ],
        [
            "Not to be confused with Buruanga."
        ],
        [
            "Municipality in Mimaropa, PhilippinesBusuangaMunicipalityMunicipality of BusuangaCambaya Beach in Busuanga Island"
        ],
        [
            "FlagSealMotto: The Last Shades of ParadiseMap of Palawan with Busuanga highlightedOpenStreetMapBusuangaLocation within the PhilippinesCoordinates: 12°08′01″N 119°56′11″E﻿ / ﻿12.133519°N 119.936314°E﻿ / 12.133519; 119.936314CountryPhilippinesRegionMimaropaProvincePalawanDistrict"
        ],
        [
            "1st districtFounded1951Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorElizabeth M. Cervantes • Vice MayorElvin D. Edonga • RepresentativeEdgardo L. Salvame • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Erdolfo D. BorejonJohn Silver D. EdongaMa.",
            "Ana D. MercadoPersis D. SanchezEstanislao H. Rodriguez IIIDiomedes T. Jagmis Jr.Zandro T. De JesusBernard Patrick D.L.",
            "Ultra"
        ],
        [
            " • Electorate16,439 voters (2022)Area • Revenue₱ 174.4 million (2020) • Assets₱ 431.8 million (2020) • Expenditure₱ 178.1 million (2020) • Liabilities₱ 148 million (2020)Service provider • ElectricityBusuanga Island Electric Cooperative (BISELCO)Time zoneUTC+8 (PST)ZIP code5317PSGC1705307000IDD : area code +63 (0)48Native languagesCalamian Tagbanwa Kagayanen Palawano Tagalog"
        ],
        [
            "Busuanga, officially the Municipality of Busuanga (Tagalog: Bayan ng Busuanga), is a 3rd class municipality in the province of Palawan, Philippines.",
            "According to the 2020 census, it has a population of 25,617 people."
        ],
        [
            "History"
        ],
        [
            "Oral tradition has it, that the entire island of Busuanga was once the realm of a Cuyonon datu named Datu Macanas.",
            "The island was once part of the four jurisdictions of Cuyonon datus with the other three being Datu Magbanua who reigned over Cuyo archipelago, Datu Cabaylo who had Taytay and surrounding islands and Datu Cabangon reigning over south of Taytay."
        ],
        [
            "The town of Busuanga was created from the barrios of Concepcion, Salvacion, Busuanga, New Busuanga, Buluang, Quezon, Calawit, and Cheey of the town of Coron in 1950."
        ],
        [
            "Quezon was reinstated as a barangay in 2000."
        ],
        [
            "The history of Busuanga could well be said to date back as early as 3,000 B.C.",
            "at the time group of nomadic people were known to make such waves of immigration by way of land-bridges from the Asia mainland, some of which lagged and drifted along the Philippines Archipelago.",
            "Much later, the Malayans and Indonesians followed.",
            "For some thousands of years, they explored, discovered, utilized, and finally spread and populated the Philippines Island, presumably including the island of Busuanga."
        ],
        [
            "Accordingly, as early as the 9th century A.D., Chinese traders were known to transact business with the natives of the coastal regions of Calamianes, and referred to some places as \"Pa-laoyu\", \"Kia-ma-yan\", and \"Pa-ki-nung\", meaning Palawan, Calamian, and Busuanga, respectively, as mentioned in their (Chinese) narratives."
        ],
        [
            "In 1380, nearly a century and half before Christianity reached the Philippines, an Arab missionary from Mallaca, named Mahdu introduced Islam in Sulu.",
            "Through the next centuries the Islamic faith must have spread and secured a profound influence in the lives of the early Filipinos.",
            "Thus, our ancestors possessed dominantly an Islamic-pagan life and culture, long before the Spaniards came to the islands."
        ],
        [
            "Origin"
        ],
        [
            "More than 3000 years before the conversion of Busuanga into a municipality in 1951, the name BUSUANGA was already attributed to the island.",
            "Actually the name is ascribed to that of a big river, the largest in the municipality (an average width of 100 meters; length is unknown), christened by the natives after the great calamitous upheaval in nature, handed down then by word of mouth to be a legend."
        ],
        [
            "The legend"
        ],
        [
            "According to the age-old legend, *a small limpid river with a narrow picturesque bank no bigger than a brook flow and runs southwards inland in a beautiful valley where people had their livelihood and seems to have always enough.",
            "Everyday the inhabitants make good spoils of the bounties of nature around, and lived a contented life.",
            "Until on that one fateful day, a violent, strong storm raged and made a rampage of the whole island; and on five or fourteen consecutive days, dilute the place with heaviest rains and strongest winds to sweep the island."
        ],
        [
            "*It is believed that the legend is real account of a natural calamitous event, which could have actually occurred thus causing the sporadically located small rivers and creeks in the island to branch out and unite their flow one great stream, which is the now-evolved Busuanga River."
        ],
        [
            "In the clear, cold dawn that settled after the storm, the inhabitants were amazed to find-in a mixed awe and terror-a massive phenomenal transformation in their place.",
            "Out of the darkness of the storm, a wide new channel through the western portion of the mainland into the sea.",
            "Thus, nature gave birth to this great river, evolved out of a small brook which up to this day serves an unmistakable beautiful natural landmark."
        ],
        [
            "Busuanga, from the vernacular word meaning \"burst\" in English, is the popular rendition of this event."
        ],
        [
            "Formation"
        ],
        [
            "Busuanga during the Spanish Regime : 1600-1898"
        ],
        [
            "In 1622, the colonization of Palawan under Count San Augustine reached the island of Busuanga.",
            "A number of Augustinian-Recollect missionaries landed in the eastern coast of the mainland, converted the inhabitants to Christianity and built church for them together with the establishment of the Spanish local government in the barrio, known then as Busuanga*, the oldest barrio in the municipality."
        ],
        [
            "Later, 1636, the Spaniards began constructing fortification with small muzzle-loading artilleries to defend the barrio from an almost perennial raids and onslaught of Muslim rebels.",
            "With the establishment of a strong naval station at Puerto Princepe Alfonso, now Balabac, together with the forts of Cuyo, Taytay, Labao, etc.",
            "combined with the powerful Spanish fleets cruising the seas, the Muslim attacks was eventually put to an end."
        ],
        [
            "In 1898, the Treaty of Peace between the United States and Spain brought the more democratic Americans to the island, thus ending the epidotic Spanish rule."
        ],
        [
            "The American regime: 1901-1914"
        ],
        [
            "In 1904, with American Military Government ruling the province under Governor Wright, the island of Culion was made into a government reservation, providing a colony for lepers and a vast government farm, its jurisdiction and control eventually served from the municipality of Coron."
        ],
        [
            "On June 2 of the same year, some former inhabitants of Culion was resettled to a place southeastern of the mainland and founded Concepcion, known then as \"Kinamotean\", from the word camote, a root crop growing abundantly in the place."
        ],
        [
            "*Busuanga, now Old Busuanga, the mother barrio.",
            "Present study and research as of 1977; set the year 1600 the earliest probable founding of Busuangan."
        ],
        [
            "Sometime, between 1906 and 1911, with the Governor Edmund Miller in office a number of school buildings were erected in some of the barrios, (Salvacion, Concepcion, Calauit, etc.)"
        ],
        [
            "The founding of New Busuanga, formerly called \"Kanyepet\", is significant.",
            "If only its most controversial creation, a part of which she would still play in the last phase of Busuanga history."
        ],
        [
            "Given official recognition by Mayor Restituto Bacnan in 1937, mainly for religious commitments to the members of the Evangelical Church, the barrio was directed another official order in that time for its dissolution.",
            "Dissolution followed."
        ],
        [
            "About the year 1938, four or five years before the Second World War, manganese mine deposits were uncovered in the island.",
            "In the mining boom that followed a national road was expedite from Coron to the northern barrios passing through Bintuan to Concepcion."
        ],
        [
            "World War II through the liberation: (1941-1949)"
        ],
        [
            "In 1942, still a nondescript barrio under the municipality of Coron, Busuanga entered the era of war.",
            "The Japanese occupation of Coron and Busuanga was primarily due to the manganese mines-good source of precious metals for ammunitions.",
            "Provoked and with no alternatives, the Busuangenos formed the Resistance Movement, foremost of which was the daring Bolo Battalion under Ignacio Libarra."
        ],
        [
            "Late of the same year, members of the Resistance Movement burned down the semi-permanent school buildings in Busuanga, Salvacion, Cheey and Calauit, which they fear would be a good headquarters for the Japanese.",
            "Spreading havoc and massacre, the enemies were already enjoying their plunder."
        ],
        [
            "On September 24, 1944, however, US bomber planes raided, and several Japanese ships, among them big tankers, were bombed and sunk off Concepcion coast.",
            "The sea became so thick laden with oil from the tankers that it burned furiously and spread out the nearby mangroves creating a bright sea-inferno for several days and nights.",
            "This was followed, in April 1945, by an ambush kill of two Japanese Officers coming from the manganese mines.",
            "Within the same month three more enemy soldiers died in the hands of the gallant Bolo Battalion.",
            "This foreshadowed the doom of Japanese invaders and the end of war."
        ],
        [
            "Immediately after the war, the US Government built and caused the establishment of Long Range (LORAN) Transmitting Station on the western coast of Panlaitan.",
            "The station was staffed and maintained by US Coast Guards until 1970."
        ],
        [
            "With peace fully reigning in the island, schools were re-opened; and the people vanishing their painful experience of war happily sent their children to school.",
            "Accordingly, the US government gave aids and full support for rehabilitation of the people from their low economic state."
        ],
        [
            "Thus Busuanga came out of the ashes of war still recouping and, one year after, still wavering from the moral and economic depression which it suffered in war, was forced to emerge into a full-pledged independent municipality."
        ],
        [
            "Foundation: the ABORDO Bill)"
        ],
        [
            "The year 1950 came to be the dawn of the birth of Busuanga as a full pledged municipality.",
            "With 13 daughter barrios already settled and populated, it only waited for some process of law turned for its promulgation into an independent municipality."
        ],
        [
            "It was Governor Gaudencio Abordo, then Congressman of Palawan, and foremost of the earliest Palaweno Statesman, who trigged the session of Congress in 1950 into his bill for the realization of the municipality.",
            "The bill number 381, sought for the creation of Busuanga, including all the barrios in its realm, into a municipality.",
            "Both houses of Congress approved the bill without much restraint, and its final approval by the President of the Philippines was eventually contained and sealed in the Republic of Act No.",
            "560."
        ],
        [
            "New Busuanga, the controverter, once-dissolved barrio founded by the members of the Evangelical Church, became politically the favored site for the municipality."
        ],
        [
            "On December 30, 1951, with a temporary \"wood and nipa\" structure for a municipal building, the first town mayor, by virtue of appointment, served his term, Mayor Adriano Custodio.",
            "He ruled the first few months of its founding years up to December 1952."
        ],
        [
            "The municipal site controversy"
        ],
        [
            "It was Tiburcio Barracoso, a southern, of a prominent clan from Salvacion, who ascended the mayorship by rights and virtue of popular election.",
            "His first bold act of moving the municipal site to Salvacion created the first wave of \"locality conflict\" between the southerners and the northerners.",
            "Accordingly, when a northerner, Antonio Capague, 1956 to a 1959, won the next election in 1955, the municipal site was moved again from Salvacion back to New Busuanga."
        ],
        [
            "The succeeding mayors however did not cause further migration of the municipal site since the political tide and atmosphere in the higher level favored New Busuanga; and there the municipality remained until 1974."
        ],
        [
            "Relocation of the municipal site: The MITRA Bill"
        ],
        [
            "About the tenure of the late Mayor Antero Hachero between 1968 and 1971, the then representative of Palawan, Ramon V. Mitra Jr. was fighting another bill in the session of Congress; this time it provided for the proper relocation and immediate transfer of the municipal site, from New Busuanga to Salvacion."
        ],
        [
            "The bill was approved for various justifiable and sound reasons, among them, Salvacion possessed a relatively more suitable and strategic location geographically and more economically developed community, making in the most suited political center for public service and the strategic seat of the municipal government."
        ],
        [
            "For some nebulous reasons, however, the bill had a hard and jolty time getting its way into the local government.",
            "Due to an admixture of conflicting personal and political interest and motives waged from all directions at once, the bill remained unexecuted in the local administration concerned."
        ],
        [
            "Consequently, the barrio council of Salvacion in collaboration filed a case of \"Mandamus\" with some municipal councilors against the involved municipal officials.",
            "But while serving in the middle of his tenure, the incumbent mayor, Antero Hachero, died, and the mandamus case hung like the word of Damocles upon the would-be successor.",
            "Eventually when laureano Custodio won in the 1972 local election, the same fell hair to the mandamus."
        ],
        [
            "This time it was the municipal council who sought the power of the court (CFI) to issue an order for the execution of the municipality's transfer to Salvacion against the indifference of the officials concerned.",
            "A little \"cold war\" almost sprung to the surface between the people of Salvacion and New Busuanga."
        ],
        [
            "The final seat of the municipal government"
        ],
        [
            "On September 2, 1974, with some constabulary men acting as peacekeepers and mediators between the people of New Busuanga and Salvacion, the municipality was finally transferred and laid to its ultimate site.",
            "This historic transfer of the municipal site was characterized by clashing sentiments and convictions by the people and their leaders, both from personal and political motives and interest that made no little significance to the history of Busuanga."
        ],
        [
            "Thus ended the conflict between the two locality-after almost two decades."
        ],
        [
            "These are the barrios found, in chronological order:"
        ],
        [
            "Names of Barangay"
        ],
        [
            "Year Established"
        ],
        [
            "Busuanga (Old Busuanga)"
        ],
        [
            "about 1600"
        ],
        [
            "Sagrada"
        ],
        [
            "1898"
        ],
        [
            "Cheey"
        ],
        [
            "1902"
        ],
        [
            "Concepcion"
        ],
        [
            "1904, 02 of June"
        ],
        [
            "Salvacion"
        ],
        [
            "1905"
        ],
        [
            "Buluang"
        ],
        [
            "1908, April 24"
        ],
        [
            "Quezon"
        ],
        [
            "1917, November 17"
        ],
        [
            "Calauit"
        ],
        [
            "1925"
        ],
        [
            "San Rafael"
        ],
        [
            "1925"
        ],
        [
            "Panlaitan"
        ],
        [
            "1925, December 10"
        ],
        [
            "Maglalambay"
        ],
        [
            "1927, June 27"
        ],
        [
            "New Busuanga"
        ],
        [
            "1937"
        ],
        [
            "Post World War II."
        ],
        [
            "Bogtong"
        ],
        [
            "1947"
        ],
        [
            "San Isidro"
        ],
        [
            "1951-Conversion of Busuanga into Municipality"
        ],
        [
            "Sto.",
            "Niño"
        ],
        [
            "1979 (formerly Sitio Dipuyai)"
        ],
        [
            "Geography"
        ],
        [
            "The territory of Busuanga covers the western one-third of Busuanga Island, as well as Calauit Island, which both are part of the Calamian Islands, lying between Mindoro and Palawan Island.",
            "According to the 2020 census, it has a population of 25,617 people."
        ],
        [
            "Geographical Location"
        ],
        [
            "At the northernmost part of the province of Palawan, Calamianes group of islands is found.",
            "This is composed of five islands namely: Busuanga, Calauit, Coron, Culion and Linapacan as it corresponds to four major municipalities which are Busuanga, Coron, Culion and Linapacan.",
            "The Municipality of Busuanga is the largest island as it covers 1/3 of Busuanga Island and about 3.8% of Palawan's total land area.",
            "Based from the Comprehensive Land Use Plan (CLUP 2001–2009) of the municipality, the total land area of the municipality is 52, 748 hectares while according to DENR –CENRO, the total land area was 53, 051 ha.",
            "It is bounded by Mindoro strait on the north, municipality of Coron on the east, South China Sea on the west and Culion Island on the south.",
            "A majority (59%) of the land area of the Municipality of Busuanga consists of the Calauit Game Preserve and Wildlife Sanctuary (3,323ha) and the Yulo King Ranch (YKR) (28.",
            "380ha).",
            "Lilu Marie Capiral is currently living in this municipality."
        ],
        [
            "Administrative boundary"
        ],
        [
            "The Municipality of Busuanga is composed of 14 barangays namely: Bogtong, Buluang, Cheey, Concepcion, Maglalambay, New Busuanga, Old Busuanga, Panlaitan, Quezon, Salvacion, San Isidro, San Rafael, Sagrada and Sto.",
            "Niño.",
            "San Isidro, Panlaitan, Maglalambay are island barangays.",
            "Meanwhile, as shown in Table 2, Barangay Cheey has the largest area as it comprises about 32% of total land area of the municipality.",
            "It is followed by Sto.",
            "Niño with 11%.",
            "Busuanga has also a high number of Islets which mostly are home for the Indigenous People (Tagbanuas) in the municipality."
        ],
        [
            "Barangays"
        ],
        [
            "Busuanga is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "BARRIOS FOUNDED IN THEIR CHRONOLOGICAL ORDER"
        ],
        [
            "Barangay"
        ],
        [
            "Year Established"
        ],
        [
            "Land Area (ha)"
        ],
        [
            "Percentage of Total Land Area"
        ],
        [
            "Busuanga (Old Busuanga)"
        ],
        [
            "about 1600"
        ],
        [
            "2,860.31"
        ],
        [
            "5.39"
        ],
        [
            "Sagrada"
        ],
        [
            "1898"
        ],
        [
            "3,722.36"
        ],
        [
            "7.01"
        ],
        [
            "Cheey"
        ],
        [
            "1902"
        ],
        [
            "17,229.63"
        ],
        [
            "32.47"
        ],
        [
            "Concepcion"
        ],
        [
            "1904, 02 of June"
        ],
        [
            "1,282,99"
        ],
        [
            "2.41"
        ],
        [
            "Salvacion"
        ],
        [
            "1905"
        ],
        [
            "2,890.09"
        ],
        [
            "5.61"
        ],
        [
            "Buluang"
        ],
        [
            "1908, April 24"
        ],
        [
            "1,395.84"
        ],
        [
            "3.64"
        ],
        [
            "New Quezon"
        ],
        [
            "1917, November 17"
        ],
        [
            "1,599.98"
        ],
        [
            "3.01"
        ],
        [
            "Calauit"
        ],
        [
            "1925"
        ],
        [
            "3,323.59"
        ],
        [
            "6.26"
        ],
        [
            "San Rafael"
        ],
        [
            "1925"
        ],
        [
            "2,323.83"
        ],
        [
            "4.38"
        ],
        [
            "Panlaitan"
        ],
        [
            "1925, December 10"
        ],
        [
            "227.47"
        ],
        [
            "0.42"
        ],
        [
            "Maglalambay"
        ],
        [
            "1927, June 27"
        ],
        [
            "437.18"
        ],
        [
            "0.82"
        ],
        [
            "New Busuanga"
        ],
        [
            "1937"
        ],
        [
            "3,236.45"
        ],
        [
            "6.10"
        ],
        [
            "Bogtong"
        ],
        [
            "1947"
        ],
        [
            "2,966.84"
        ],
        [
            "5.59"
        ],
        [
            "San Isidro"
        ],
        [
            "1951-Conversion of Busuanga into Municipality"
        ],
        [
            "448.81"
        ],
        [
            "0.84"
        ],
        [
            "Sto.",
            "Niño"
        ],
        [
            "1979 (formerly Sitio Dipuyai)"
        ],
        [
            "5995.80"
        ],
        [
            "11.30"
        ],
        [
            "Other Island"
        ],
        [
            "1,519.",
            "94"
        ],
        [
            "2.86"
        ],
        [
            "Total"
        ],
        [
            "53, 051.63"
        ],
        [
            "100.00"
        ],
        [
            "Burabod"
        ],
        [
            "Halsey"
        ],
        [
            "Note: On July 15, 2002, plebiscites held in Culion and Busuanga simultaneously with the election of barangay officials and Sangguniang Kabataan representatives resulted in the ratification of the transfer of Halsey and Burabod to Culion and the creation of Barangay Carabao."
        ],
        [
            "Source: DENR-CENRO, 2016"
        ],
        [
            "Islet"
        ],
        [
            "Small Island and Islets of Busuanga Municipality"
        ],
        [
            "Small Island and Islets"
        ],
        [
            "Land Area (ha)"
        ],
        [
            "Percentage of Total Land Area"
        ],
        [
            "Calumboyan Island"
        ],
        [
            "Not Determined"
        ],
        [
            "Not Determined"
        ],
        [
            "Denicolan Island"
        ],
        [
            "Not Determined"
        ],
        [
            "Not Determined"
        ],
        [
            "Diboyayan Island"
        ],
        [
            "14.59"
        ],
        [
            "0.96"
        ],
        [
            "Dicoyan Island"
        ],
        [
            "67.89"
        ],
        [
            "4.49"
        ],
        [
            "Dimipac Island"
        ],
        [
            "118.15"
        ],
        [
            "7.82"
        ],
        [
            "Elet Island"
        ],
        [
            "1.40"
        ],
        [
            "0.092"
        ],
        [
            "Horse Island"
        ],
        [
            "47.28"
        ],
        [
            "3.12"
        ],
        [
            "Kalampisauan Island"
        ],
        [
            "15/27"
        ],
        [
            "1.01"
        ],
        [
            "Lajo Island"
        ],
        [
            "283.75"
        ],
        [
            "18.78"
        ],
        [
            "Malajon Island/ Black Island"
        ],
        [
            "77.80"
        ],
        [
            "5.15"
        ],
        [
            "Malcatop Island"
        ],
        [
            "66.04"
        ],
        [
            "4.37"
        ],
        [
            "Mangueguey Island"
        ],
        [
            "10.61"
        ],
        [
            "0.70"
        ],
        [
            "Manolaba Island"
        ],
        [
            "15.48"
        ],
        [
            "1.02"
        ],
        [
            "Manobeleng Island"
        ],
        [
            "30.13"
        ],
        [
            "1.99"
        ],
        [
            "Napula Island"
        ],
        [
            "23.84"
        ],
        [
            "1.",
            "57"
        ],
        [
            "North Malbinchilao"
        ],
        [
            "43.96"
        ],
        [
            "2.91"
        ],
        [
            "Northwest Rock"
        ],
        [
            "1.20"
        ],
        [
            "0.07"
        ],
        [
            "Pamanlican Island"
        ],
        [
            "7.51"
        ],
        [
            "0.49"
        ],
        [
            "Pass Island"
        ],
        [
            "11.82"
        ],
        [
            "0.78"
        ],
        [
            "Rat Island 1"
        ],
        [
            "37.35"
        ],
        [
            "2.47"
        ],
        [
            "Rat Island 2"
        ],
        [
            "107.37"
        ],
        [
            "7.10"
        ],
        [
            "Salvacion Island"
        ],
        [
            "26.",
            "03"
        ],
        [
            "1.72"
        ],
        [
            "South Cay Island"
        ],
        [
            "10.74"
        ],
        [
            "0.71"
        ],
        [
            "South Malbinchilao Island"
        ],
        [
            "13.90"
        ],
        [
            "0.92"
        ],
        [
            "Tanabon Island"
        ],
        [
            "12.61"
        ],
        [
            "0.83"
        ],
        [
            "Tantangon Island"
        ],
        [
            "66.61"
        ],
        [
            "4.40"
        ],
        [
            "West Nalaut Island"
        ],
        [
            "57.66"
        ],
        [
            "3.81"
        ],
        [
            "Other Islands (no names)"
        ],
        [
            "289.29"
        ],
        [
            "19.15"
        ],
        [
            "Total"
        ],
        [
            "1,510.64"
        ],
        [
            "100.00"
        ],
        [
            "Source: ECAN Zones Management Framework and Guidelines for Busuanga Municipality, 2006"
        ],
        [
            "Islet of Elet as seen aboard a motorboat"
        ],
        [
            "Famous of these are the following:"
        ],
        [
            "A. CALAUIT SAFARI PARK"
        ],
        [
            "-Calauit Island is a 4,000 has.",
            "Protected are with active environmental and resources management separated by the narrow mangrove channel from nearby Busuanga Island.",
            "It includes an 18-kilometers coastline and along the coasting line is about 9-km of reef, although much of it are limestone rock and sand, rubble communities dominated by sea grass, seaweeds and micro invertebrates.",
            "About 70-80% of the coastal area of the island is surrounded by coral reefs of moderate cover and sea grass beds, and latter serving as feeding grounds for dugongs and turtles.",
            "Another 40% meters wide fins the reef, with an estimated of 1.80 km of living covered."
        ],
        [
            "In the 1979 Presidential 1578 declared Calauit Island Game Preserve and Wildlife Sanctuary for the endemic and exotic animals.",
            "The latter consisted of a total of 104 composed of GIRAFFES, ZEBRAS, IMPALAS, WATERBUCKS, GRANT GAZELLES, ELANDS, TOPI and BUSHBACKS imported from Kenya and arrived at Calauit Island in March 1977.",
            "These animals are now numbered more than 600 mostly island born and only a few of the original stocks lived."
        ],
        [
            "The game preserve was originally managed by Ministry of Natural Resources by the Presidential Commission for the conservation of the Tamaraw (PCCT) through the Presidential Assistance for Cultural Minorities (PANAMIN).",
            "Later on the management of the park is under the jurisdiction of the Department of Environment and Natural Resources (DENR) through the Conservation and Resources management Foundation (CRMF).",
            "At present, management of the park is under the Palawan Council for Sustainable Development (PCSD)."
        ],
        [
            "B.",
            "BLACK ISLAND – located near Panlaitan.",
            "The island is called Malajom(in native dialect) or Black Island due to its unique physical characteristics.",
            "It has three small caves with mini-pool inside, and a black rock of about 150 feet into a majestic cave.",
            "The island has natural grass which serves as flooring around the beach, as white silica of more or less 5 km.",
            "Assorted fishes are available in a whole year.",
            "Fisherman usually staying as a resting place.",
            "The island is one of the municipality's sources of edible bird's nests and its quano for fertilizers.",
            "Inside the caves, you will find the writings on the wall in Spanish.",
            "A mini-pool, a table forms rock, and a bench.",
            "Vacationers/Adventurers believed that it was a natural built.",
            "It invites the adventurous who dare and explore its interior for discovery, mystery and fun."
        ],
        [
            "C. PAMALICAN ISLAND – Is considered as one of the tourist attraction in the municipality.",
            "It is bound with silica sand and famous for its sparkling white beaches.",
            "The water is so clear that you can see the corals under.",
            "The abundant marine life and coral reefs attracts people from neighboring barangays and town to go swimming, scuba diving and snorkeling.",
            "This activity cannot be enjoyed if you cannot go to this place.",
            "And if you dream of natural resort with all the breathtaking beauty, then go to this island, and is one of the best places to go during summertime.",
            "It has a total land of 50 hectares and approximately 30 minutes travel time from the poblacion.",
            "Development of the island is potential."
        ],
        [
            "The means of transportation form the poblacion to the island is to hire a motorized boat around P200.00 one way.",
            "There are no cottages in the island; accommodation is in poblacion, at the rate P 100.00 per day."
        ],
        [
            "D.LAS HAMACAS BEACH RESORT – Located seven kilometers away from the poblacion.",
            "The island is surrounded by coconut grooves recently, along its white sand beaches, crystal clear water and idea for swimming, scuba diving, and snorkeling.",
            "People will enjoy if they go this place.",
            "The resort is presently operating with beautiful cottages as tourist's accommodation and with the necessary transportation facilities as to cater the needs of the tourist.",
            "You can go there anytime."
        ],
        [
            "E.CALUMBUYAN ISLAND – It is about ten (10) hectares situated in the islands of considered as one of the tourist's attraction in the municipality.",
            "The abundant marine life white beaches attracts the people to go swimming, and if you dream of a natural resort with all the breathtaking beauty then go to this place and one of the best place to go during summertime.",
            "A transportation facility from poblacion to Concepcion is service by two units of buses/jeepneys plying between Busuanga to Coron wherein regular fare is only P38.00.",
            "The resort is presently operating with the necessary accommodation.",
            "There are transportation and cottages to cater the needs of tourist."
        ],
        [
            "F.TREASURE ISLAND – The Island is abounding with silica sand and famous for its sparkling white beaches.",
            "It has natural beauty with locally made cottages that will attract people to get there especially during summertime.",
            "Its white beaches sand with prolific fish life is suitable for snorkeling and scuba diving."
        ],
        [
            "The means of transportation from the poblacion is to hire a motorboat amounting to P300.00 one way.",
            "Tourist accommodations in the place were locally made cottages."
        ],
        [
            "G.CONCEPCION FALLS – It is located 17 km away from the poblacion and both accessible by land and water transportation.",
            "It is an ideal place to those who would dare and like to dip in cool fresh water.",
            "Transportation is by 2 units of buses and jeepneys plying between Busuanga and Coron and vice versa at the rate of P38.00 regular and P10.00 from the poblacion.",
            "Development of this falls is potential."
        ],
        [
            "H.WEST NALAUT ISLAND – In barangay Panlaitan.",
            "The abundant marine life attracts the people from neighboring barangays to go swimming, scuba diving and snorkeling and other activities, and its noted for its beautiful coral reefs and seaweeds.",
            "It cannot be docked during rainy season due to large waves.",
            "It is approximately 1 hour travel from barangay Panlaitan.",
            "Accommodation is in Panlaitan proper, and transportation facilities are to hire a pump boat from the poblacion to the island wherein pump boat hire is amounted to P300.00 one way."
        ],
        [
            "I.MALTATAYOK ISLAND – The Island is abounding with silica and like any other island is also famous for its sparkling white beaches.",
            "It is approximately 45 minutes travel from the poblacion to the island and the transportation facilities is to hire a pump boat wherein pump boat hire is amounted to P500.00 one way.",
            "Approximately area of the island is 100 hectares.",
            "Tourist accommodations are the cottages."
        ],
        [
            "J.NAGTENGA ISLAND – The island abound with silica sand with an area of about 90 hectares and famous for its sparkling white beaches.",
            "It is approximately 50 minutes from the poblacion to the islands and the transportation facilities are to hire a pump boat.",
            "There are also tourist accommodations in the island.",
            "Foremost of which are locally made cottages."
        ],
        [
            "K.PAGBINIT ISLAND – The Island is also considered one of the tourist attractions due to its unique and special features.",
            "It is also abound with silica sand and famous for its sparkling white beaches.",
            "The means of transportation to the island is to hire a pump boat amounting to P300.00 one way."
        ],
        [
            "L.CHINIBAYAN FALLS – In New Busuanga.",
            "It is located 16 km from the poblacion and accessibility by both water and land transportation.",
            "It is special place to those who would dare and like to dip in cool fresh water.",
            "Transportation is serviced by 2 units of jeepneys plying between poblacion to New Busuanga and by pump boat amounting to P260.00 one way.",
            "Development of the falls is potential."
        ],
        [
            "M.DIBUTUNAI ISLAND – It is approximately 15 nautical miles from barangay Panlaitan.",
            "It is abound with silica sand and famous for its sparkling white beaches.",
            "It can be docked even in low tide.",
            "It is approximately 1 hour travel to Panlaitan.",
            "Means of transportation from Poblacion to Dibutunai amounted to P300.00 one way.",
            "Development of the island is potential."
        ],
        [
            "Topography"
        ],
        [
            "Elevation"
        ],
        [
            "The municipality's western and central portions are predominantly rough and mountainous with rolling to hilly terrain.",
            "A part of this is the Chinabayan Mountain and Wayan Range that still support extensive parches of Molave forest and Cogon grassland (features which are dominant in the locale).",
            "Chinabayan, also called Sinibayan, is approximately near to Sinibayan River and the waterfalls found in Barangay New Busuanga.",
            "Chinabayan traverses along Barangay San Rafael and Barangay Sagrada where forest cover is much more extensive.",
            "Meanwhile, the hilly portions of the mountain range is covered by lowland beach and limestone forest while those that are confined to the sides of hills following the municipality's streams and river have thicker forest covers.",
            "The central hills have low elevation (less than 700 meters above sea level) while some have an elevation reaching more than 500 meters.",
            "Also, on the western portion are numerous islets while on the northern tip is the Calauit Island."
        ],
        [
            "The Salvacion Mountain Range located in Salvacion, the Sinabuyan Mountain Range between New Busuanga and Cheey, and the Naapac Mountain Range in San Rafael are among the major mountain ranges of the municipality."
        ],
        [
            "Slope"
        ],
        [
            "Due to the mountainous features of the municipality, most of the areas have high"
        ],
        [
            "variations of slope composition.",
            "Areas more than 50% slope account for 2% of the municipality; about 32% represent those areas with more than 18% slope but lesser than 50% slope; while 59% are areas with less than 18% slope.",
            "The relatively flat areas are generally devoted to rice and tree plantations.",
            "Areas with slope that ranges from 0-3% can be used for agricultural and urban development while those slope classes with 3-18% can be allocated for human settlement expansion."
        ],
        [
            "Geology"
        ],
        [
            "The whole Busuanga Island belongs to the non-volcanic micro-continental fragment of the northern Palawan group of islands which includes all areas on- and offshore north of the Ulugan Bay Fault.",
            "Based on geophysical observations, these groups of islands are believed to be part of the southeastern continental shelf of mainland China before the Tertiary period (Mid-Oligocene) (particularly during the beginning of the sea-floor spreading of the South China Sea)."
        ],
        [
            "As stated in the Flora Survey and Biodiversity Assessment for Core Zoning Report by the PCSD in 2006, the geology of Busuanga consists of several formations.",
            "These include King Ranch Formation, Liminangcong Formation, Quaternary Alluvium and Malajon Limestone.",
            "The Liminangcong Formation which is distinguished of its bedded chert is dominant in the municipality while the Quaternary Alluvium which consists of unconsolidated floodplain deposits accumulated at the foot of the hills can be found in the low – lying coastal areas and along the river channels of most of the barangays in Busuanga.",
            "On the other hand, Malajon Limestone, typified by creamy to dark gray massive coralline, marbleized limestone, is commonly found in Elet and Kalapisauan Islands located northwest of the municipality.",
            "Most of the land formations are karst limestone having silicon dioxide as its major elements.",
            "Limestone distribution over the municipality, however, can only be observed in few areas such as Barangay Buluang."
        ],
        [
            "An outcrop of deformed Liminangcong chert near the Marina del Sol yacht club in Busuanga showing distinct folding"
        ],
        [
            "Closer view of bedded Liminangcong chert outcrop near the Marina del Sol yacht club"
        ],
        [
            "Triassic-Jurassic aged limestone of Malajon Island (Black Island) with a wave-cut notch at its base"
        ],
        [
            "Triassic to Jurassic-aged limestone of Elet Island"
        ],
        [
            "Soil"
        ],
        [
            "The soil classification and fertility of lands in the municipality is affected by climate, rainfall, and its varying elevation.",
            "There are six major types of soil in Busuanga namely: Rough Mountainous Land, Coron Clay Loam, San Miguel Clay Loam, Aborlan Clay Loam, Busuanga Loam and Hydrosol.",
            "Sub-surface textures of these soils can be classified as either loam to clay loam and sandy clay; these fall under the medium to fine- textures soils."
        ],
        [
            "The types of soil in the municipality vary on its geographical location.",
            "According to the report of the Office of the Provincial Agriculturist, those soils located in the plains, valleys and plateaus are made up of silt clay loam while those soils located in the area where it is gently sloping to slightly steep are composed of sandy clay to sandy clay loam.",
            "For coastal plains on the southern part of the municipality, the major type of soil is hydrosol while in some valley areas, there is rich Busuanga loam.",
            "Of these types of soil, silt clay loam soil, given its properties, makes it suitable for the community to plant their crops and grow their vegetables."
        ],
        [
            "Climate"
        ],
        [
            "Busuanga has two distinct climate types.",
            "It is dry from December to May and rainy from June to November; the warmest months are March, April, and May while the coldest are December, January, and February.",
            "It has an average yearly rainfall measurement of 2,873.9 mm."
        ],
        [
            "Meanwhile, though Palawan as a whole is outside the typhoon belt, the northern portion where Busuanga is located experiences persistent gales and torrential rains especially during the months of July to August."
        ],
        [
            "Climate data for Busuanga, Palawan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "30(1.2)"
        ],
        [
            "26(1.0)"
        ],
        [
            "39(1.5)"
        ],
        [
            "58(2.3)"
        ],
        [
            "192(7.6)"
        ],
        [
            "283(11.1)"
        ],
        [
            "341(13.4)"
        ],
        [
            "323(12.7)"
        ],
        [
            "317(12.5)"
        ],
        [
            "231(9.1)"
        ],
        [
            "119(4.7)"
        ],
        [
            "56(2.2)"
        ],
        [
            "2,015(79.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.3"
        ],
        [
            "8.5"
        ],
        [
            "12.4"
        ],
        [
            "16.3"
        ],
        [
            "23.5"
        ],
        [
            "27.1"
        ],
        [
            "28.4"
        ],
        [
            "27.3"
        ],
        [
            "27.6"
        ],
        [
            "26.3"
        ],
        [
            "19.2"
        ],
        [
            "13.6"
        ],
        [
            "240.5"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Surface water"
        ],
        [
            "Busuanga has three mineral springs .",
            "It has several river systems as well.",
            "The major ones are as follows."
        ],
        [
            "Busuanga River in Old Busuanga"
        ],
        [
            "Binalayan River in Cheey"
        ],
        [
            "Dipuyal River in Sto.",
            "Niño"
        ],
        [
            "Lele River in New Busuanga"
        ],
        [
            "Malabnas River in San Rafael"
        ],
        [
            "Ditapec River in Calauit"
        ],
        [
            "Kiwit River in Sagrada"
        ],
        [
            "Falls"
        ],
        [
            "Concepcion Fall in Conception"
        ],
        [
            "Chinabayan / Sinibayan Falls in New Busuanga"
        ],
        [
            "Land resources"
        ],
        [
            "The land classification map of the Municipality of Busuanga in 2006 (in accordance with SEMP- ECAN Zoning Project).",
            "It can be seen that majority of the land is classified as alienable and disposable; dominance of this land classification is primarily because secondary brushland/ shrub lands are abundant in the area."
        ],
        [
            "On the other side, there are different sources of information indicating the composition of various land classification of the municipality.",
            "Department of Environment and Natural Resource- CENRO have identified the total municipal land area of Busuanga with 32, 144 hectares (71.3%) classified as alienable and disposable (A&D) land and 12, 950 hectares (28.7%) of forest land; SEMP-ECAN Zoning Project which formulated a NAMRIA-land classification map, however, revealed that the A&D land is only about 48%.",
            "On the other hand; while CLUP showed the allocation of municipal land uses with 46% devoted to brushland and grassland, 39% to forest, 8% for agriculture, and 1% for built-up areas or only about 392 hectares of the total land area."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BusuangaYearPop.±% p.a.1960 4,424—    1970 5,905+2.93%1975 6,934+3.27%1980 10,348+8.33%1990 11,007+0.62%1995 15,843+7.06%YearPop.±% p.a.2000 16,287+0.59%2007 19,066+2.20%2010 21,358+4.22%2015 22,046+0.61%2020 25,617+3.00%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Busuanga was 25,617 people, with a density of 65 inhabitants per square kilometre or 170 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Busuanga"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  40.20"
        ],
        [
            "2009  26.47"
        ],
        [
            "2012  34.91"
        ],
        [
            "2015  22.60"
        ],
        [
            "2018  17.42"
        ],
        [
            "2021  20.55"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Notes"
        ],
        [
            "^  Municipality of Busuanga |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Republic Act No.",
            "560 (26 May 2012), An act to create the municipality of Busuanga in the province of Palawan, archived from the original on 2012-05-25, retrieved 2011-04-09"
        ],
        [
            "^ NSCB - 2001 Factsheet - 12 New Cities Created Archived April 23, 2006, at the Wayback Machine, July–December 2000."
        ],
        [
            "^ Burabod and Halsey are not listed by PSGC Archived 2017-08-03 at the Wayback Machine making their count as 14."
        ],
        [
            "^ \"Black Island (Malajon Island), Busuanga: Important Travel Tips\".",
            "2 August 2017."
        ],
        [
            "^"
        ],
        [
            "\"Busuanga: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 17 November 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Busuanga Island."
        ],
        [
            "Busuanga Turismo"
        ],
        [
            "Wikimedia Commons has media related to Busuanga."
        ],
        [
            "Busuanga Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Busuanga, Palawan"
        ],
        [
            "Mindoro Strait"
        ],
        [
            "South China Sea"
        ],
        [
            "Busuanga"
        ],
        [
            "Coron"
        ],
        [
            "Culion"
        ],
        [
            "vte Province of PalawanPuerto Princesa (capital and largest city)Municipalities"
        ],
        [
            "Aborlan"
        ],
        [
            "Agutaya"
        ],
        [
            "Araceli"
        ],
        [
            "Balabac"
        ],
        [
            "Bataraza"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Busuanga"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Coron"
        ],
        [
            "Culion"
        ],
        [
            "Cuyo"
        ],
        [
            "Dumaran"
        ],
        [
            "El Nido"
        ],
        [
            "Kalayaan"
        ],
        [
            "Linapacan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Narra"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "San Vicente"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Taytay"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Puerto Princesa (Administratively independent from the province but grouped under Palawan by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Busuanga,_Palawan&oldid=1233827582\""
        ],
        [
            "Category: Municipalities of PalawanHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}