{
    "name": "Butig",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Butig"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°43′26″N 124°18′04″E﻿ / ﻿7.7239°N 124.3011°E﻿ / 7.7239; 124.3011"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Lanao del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Butig\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bangsamoro Autonomous Region in Muslim Mindanao, PhilippinesButig"
        ],
        [
            "بوتيجMunicipalityMunicipality of Butig"
        ],
        [
            "FlagSealMap of Lanao del Sur with Butig highlightedOpenStreetMapButigLocation within the PhilippinesCoordinates: 7°43′26″N 124°18′04″E﻿ / ﻿7.7239°N 124.3011°E﻿ / 7.7239; 124.3011CountryPhilippinesRegionBangsamoro Autonomous Region in Muslim MindanaoProvinceLanao del SurDistrict"
        ],
        [
            "2nd districtFoundedJune 25, 1963Barangays16"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorDimnatang Bangconolan L. Pansar • Vice MayorBin Khalifa L. Pansar • RepresentativeYasser A. Balindong • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Palawan P. KiramJalani M. IsmailJhanan M. DiamaodenAmer S. Mona Jr.Jalil B. MamailaoAmer D. Mindalano Jr.Saiben M. PanolongJack T. Mamaon"
        ],
        [
            " • Electorate14,561 voters (2022)Area • Revenue₱ 177.7 million (2020) • Assets₱ 119.8 million (2020) • Expenditure₱ 132.2 million (2020) • Liabilities₱ 5.241 million (2020)Service provider • ElectricityLanao del Sur Electric Cooperative (LASURECO)Time zoneUTC+8 (PST)ZIP code9305PSGC153607000IDD : area code +63 (0)63Native languagesMaranao TagalogWebsitewww.butig-lds.gov.ph"
        ],
        [
            "Butig, officially the Municipality of Butig (Maranao: Dalm a Butig),  is a 6th class municipality in the province of Lanao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 22,768 people."
        ],
        [
            "This ancient and royal town of the Maranaos became a municipality under Executive Order No.",
            "21 issued on June 25, 1963, during the term of President Diosdado Macapagal."
        ],
        [
            "History"
        ],
        [
            "Butig is considered as one of the oldest settlements in the center of Mindanao.",
            "A sultanate located in the Pangampong (Principality) of Unayan, Lanao, Mindanao, Butig belongs to the confederation of the Sultans of Lanao (Ranao in Maranao language).",
            "This historic town is the \"cradle\" of Maranao civilization."
        ],
        [
            "Role in Islamization of Mindanao"
        ],
        [
            "While Islamic political institutions were being implemented in Sulu, Muslim traders and possibly itinerant teachers visited the eastern and northern parts of Mindanao Island.",
            "The advent of Muhammad Kabungsuwan and his lieutenants developed a system of multiple marriage alliances with various ruling families which served as a means of extending both political control and Islamization.",
            "The coming of this intrepid Arab-Malay, to whom the pervasive spread of Islam in Mindanao is attributed, and from whom all the leading sultans of that island have claimed descent, can be calculated to have taken place around the second decade of the sixteenth century.",
            "(Majul, 1973)"
        ],
        [
            "From the above-mentioned marriage alliances came the Moro dynasties of Maguindanao, Buayan, and Butig.",
            "From the Maranaos of Butig, Islam was then introduced to the Maranaos of Lake Lanao.",
            "Whereas the base and strength of the Buayan sultanate was in the upper valley of the Pulangi in the interior of eastern Mindanao, that of the sultanate of Maguindanao was at the lower valley and the nearby coastal areas.",
            "Actually, for many years it was Iranun support that strengthened the Maguindanaon rulers against their antagonists.",
            "(Majul, 1973)"
        ],
        [
            "In the time, the continued existence of Islam in Sulu and Mindanao was guaranteed by a more intensive Islamization of their neighbors such as Brunei and Ternate.",
            "The royal families of Brunei and Sulu became intimately related, as did those of Maguindanao and Ternate.",
            "Commercial relations and religious dialogue expanded among the peoples of these regions ... thus generating a sense of community transcending regional frontiers or dynastic loyalties.",
            "(Majul, 1973)"
        ],
        [
            "Resistance to European colonialism"
        ],
        [
            "In 1658, a strong force took the field against the Moros of Mindanao under the command of Don Francisco Estovar, Governor of Zamboanga.",
            "The expedition disembarked before the Moro town of Mamucan in the Cotabato Valley.",
            "Here an action conducted by Don Pedro de Biruga, who, with a force of 180 Spaniards, destroyed the town of Butig, with many vessels and a quantity of rice.",
            "(Hurley, 1936)"
        ],
        [
            "Between 1663, when Zamboanga was abandoned, and 1718 when it was refortified, there was an interlude in the Moro Wars, which allowed the sultanates to become better organized and their Islamic institutions to be reinforced.",
            "Vigorous commercial relations with other principalities were initiated.",
            "It was around this time, too that the Sulu Sultanate acquired the North Borneo territory from the Sultan of Brunei as a grateful recompense for armed intervention in a dynastic quarrel.",
            "Sulu had reached the highest level of its territorial expansion.",
            "Actually, Sulu was simply filling up the power vacuum left in the island of Borneo as a result of Brunei's gradual political and commercial decline."
        ],
        [
            "The Spanish government, principally on account of Jesuit agitation, decided to refortify Zamboanga.",
            "The Jesuits, more than any religious order in the Philippines, were the most insistent on the evangelization of Muslims.",
            "This attitude cost them (the Jesuits) a few casualties on account of extreme zeal."
        ],
        [
            "It is proposed that the fifth stage in the history of the Moro Wars began with the refortification of Zamboanga in 1718 and ended in the Spanish failure in the eighteenth century to reduce the Muslim states to vassalage.",
            "To achieve this political end, and Spanish plan was devised to convert the sultans of Sulu and Maguindanao preparatory to the eventual conversion of the datus and other subjects.",
            "In this stage, the combined Sulu-Maranao attack to capture Zamboanga in 1719 failed.",
            "Again, a desultory war followed.",
            "The plan to convert the sultans failed in the case of Maguindanao.",
            "Although 'Azim-ud-Din, the sultan deposed by his brother, was baptized in Manila in 1751, that action did not have the desired political results in Sulu since the sultanate was in the hands of a usurper.",
            "Also, the question of the sincerity of the conversion still remains an open one."
        ],
        [
            "In this fifth stage, the men of Sultan Mardan and the Maranaos of Butig began their devastating attacks on other parts of the Philippines, reducing the number of tributes for Spain coming from the Visayas and causing a virtual disruption in the economic life of many islands under the Spanish colonial regime.",
            "On account of thousands of captives taken by the Muslims, some depopulation started to take place in the Visayas.",
            "But all this was in response to the Spanish order in 1751 to enslave captured Muslims and destroy their settlements, boats, plantations, and fields.",
            "Yet, as the facts demonstrate, it was the Sulu Sultan who was always the first to initiate moves for a peaceful settlement.",
            "The lessening of Spanish power as a direct result of the British invasion of the Philippines and capture of Manila in 1762 once again brought about a decline of hostilities between Spaniards and Sulu and Maguindanao.",
            "The Muslim principalities again tried to recapture their days of commercial prosperity, but they were not to be left in peace.",
            "(Majul, 1973)"
        ],
        [
            "On December 8, 1720, Dalasi, the Datu of Butig (also known as Rajah Janatun of Butig), with an armada of one hundred vessels or “paraws” manned by Sultan sa Kanluran, Miyangaludan and several thousand Moros, attacked Fort Pilar in Zamboanga.",
            "He captured a local Jesuit priest and forced the Spanish government in Manila to give ransom payment in exchange for his freedom.",
            "(Hurley, 1936)  But the accuracy of this report by Hurley is in doubt considering the distance of Butig (Lanao del Sur) to the shores of Zamboanga.",
            "Furthermore, the Jesuits in Zamboanga were more engaged with the Tausugs of Sulu; and for Datu Dalasi, a Maranao of Lanao, to get involved in the affairs of the Sulu Sultanate is highly unusual."
        ],
        [
            "American rule in Mindanao"
        ],
        [
            "In July 1908, Lieutenant Burr of the American colonial forces was leading forty men through the Agus River in Mindanao.",
            "Near Nyaan the party came to a cotta, well fortified and surrounded with a moat filled with brush.",
            "Resistance being encountered, the soldiers cut through the brush with their bayonets and assaulted the fort."
        ],
        [
            "The first soldier to reach the cotta walls was attacked from the rear by a Moro with a kris.",
            "Hearing the cry of the soldier, Lieutenant Burr hurried to his assistance, killing the Moro with a pistol.",
            "Another Moro sprang from the shelter of the bush and struck Burr before he could turn to defend himself, dealing the American officer a terrible blow on the head with a campilane."
        ],
        [
            "Burr died a few days later in the hospital at Camp Kiethley."
        ],
        [
            "During the years 1908 and 1909, and for a number of years afterwards, the Butig Mountain range and the Lake Lanao and Buldun sections of Mindanao were infested with outlaw bands ranging in size from a few men to several hundred."
        ],
        [
            "Early in the year 1906, Moro outlaws in the inaccessible mountains of Butig fortified themselves in hill-top strongholds under the leadership of Sultan Mangatung and his brother inlaw, Amai Maricor of Maciu.",
            "Under Mangatung, a great force of outlaws became established at rancherias and were responsible for terrible depredations throughout the district."
        ],
        [
            "Government launches operating at the mouth of the Malaig river were frequently fired upon, with the result that a camp of men from the 15th Infantry was established at the river."
        ],
        [
            "The Moros were invited in for parleys and many of them came in and abandoned the outlaw life to return peacefully to their homes."
        ],
        [
            "A number of the Moros, however, chose to ignore the American request for conciliation, and after a perty commanded by Lieutenant Furlong was fired upon, an American offensive was undertaken.",
            "Sultan Mangatung was killed."
        ],
        [
            "Colonel J. F. Hutton took the field at the head of three columns of troops in the Butig Mountains.",
            "The soldiers were fired upon from the cottas but after eight serious engagements all of the outlaws in the district were annihilated."
        ],
        [
            "Upon completion of these operations in Mindanao, a short period of peace ensued, to be broken by rumblings in Jolo."
        ],
        [
            "Political history"
        ],
        [
            "Atty.",
            "Dimnatang Labay Pansar is the incumbent mayor of Butig.",
            "His predecessors were mayors Ibrahim Mitoon Macadato, Dimnatang Labay Pansar, Pauli Bao-Macabuntal Ditual, Sunnyboy Mona, Monabantog Kiram, Arapa Datukanug, Palawan Amatonding, Abdulrahman Mamalinding Romato, Datu Mombao Mamalinding Romato, Sangcad Mamalinding Bao, Sultan Macalinog Mamalinding Bao and Sultan Macabayao Macadato."
        ],
        [
            "Butig is one of the oldest town in the province and the inhabitants thereat are connected to all the Seventeen Royal Houses of Lanao.",
            "By tradition, any individual who has no blood line in Butig cannot hold any recognized Royal Title in the Sultanate of Lanao."
        ],
        [
            "Military conflict"
        ],
        [
            "Main article: 2016 Butig clashes"
        ],
        [
            "Clashes between the Philippine military and a local terrorist organization known as the Maute group which is believed to have ties with Jemaah Islamiyah started on February 20, 2016, after the Maute Group raided the detachment of the 51st Infantry Battalion of the Philippine Army in the town.",
            "The firefight displaced 2,000 residents of Butig, and killed 42 members of the group and three government troops.",
            "In November 2016, the Maute group seized the town but were driven from their positions by Philippine Army troops after about a week of fighting."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Butig is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Butig Proper"
        ],
        [
            "Cabasaran"
        ],
        [
            "Coloyan Tambo"
        ],
        [
            "Dilabayan"
        ],
        [
            "Dolangan"
        ],
        [
            "Pindolonan"
        ],
        [
            "Bayabao Poblacion"
        ],
        [
            "Poktan"
        ],
        [
            "Ragayan"
        ],
        [
            "Raya"
        ],
        [
            "Samer (Dama)"
        ],
        [
            "Sandab Madaya"
        ],
        [
            "Sundig"
        ],
        [
            "Tiowi"
        ],
        [
            "Timbab"
        ],
        [
            "Malungun"
        ],
        [
            "Butig had forty four (44) barangays during the time of Mayor Sultan Macabayao M. Macadato until 1979, but reduced to only sixteen (16) barangays when Sangcad S. Bao took over as OIC-Mayor during the time of President Corazon C. Aquino."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Butig, Lanao de Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "236(9.3)"
        ],
        [
            "225(8.9)"
        ],
        [
            "244(9.6)"
        ],
        [
            "235(9.3)"
        ],
        [
            "304(12.0)"
        ],
        [
            "287(11.3)"
        ],
        [
            "200(7.9)"
        ],
        [
            "175(6.9)"
        ],
        [
            "158(6.2)"
        ],
        [
            "200(7.9)"
        ],
        [
            "287(11.3)"
        ],
        [
            "243(9.6)"
        ],
        [
            "2,794(110.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "24.3"
        ],
        [
            "22.3"
        ],
        [
            "26.0"
        ],
        [
            "27.2"
        ],
        [
            "28.3"
        ],
        [
            "27.2"
        ],
        [
            "25.8"
        ],
        [
            "24.8"
        ],
        [
            "22.2"
        ],
        [
            "25.4"
        ],
        [
            "27.2"
        ],
        [
            "25.8"
        ],
        [
            "306.5"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of ButigYearPop.±% p.a.1918 1,218—    1939 2,855+4.14%1948 3,437+2.08%1960 9,251+8.60%1970 10,152+0.93%1975 11,428+2.40%1980 6,278−11.29%1990 14,491+8.73%1995 16,229+2.15%2000 16,283+0.07%2007 22,256+4.40%2010 16,642−10.04%2015 19,302+2.86%2020 22,768+3.30%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty Incidence of Butig"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "80"
        ],
        [
            "90"
        ],
        [
            "2000  57.88"
        ],
        [
            "2003  55.09"
        ],
        [
            "2006  30.60"
        ],
        [
            "2009  37.10"
        ],
        [
            "2012  58.91"
        ],
        [
            "2015  65.05"
        ],
        [
            "2018  80.72"
        ],
        [
            "2021  23.12"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "See also"
        ],
        [
            "Lake Butig National Park"
        ],
        [
            "Mount Makaturing (Palaw a Magaturing in Meranau or Maranaw)."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Butig |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Bangsamoro (BARMM)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Romero, Alexis (26 February 2016).",
            "\"3 soldiers killed, 11 hurt in Lanao del Sur clash\".",
            "The Philippine Star.",
            "Retrieved 3 March 2016."
        ],
        [
            "^ \"Troops overrun terrorists' stronghold in Lanao del Sur\".",
            "Manila Bulletin.",
            "Philippine News Agency.",
            "26 February 2016.",
            "Retrieved 3 March 2016."
        ],
        [
            "^ \"Military gains control of Maute group's lair in Butig, Lanao del Sur\".",
            "GMA News.",
            "GMA Network.",
            "1 March 2016.",
            "Retrieved 3 March 2016."
        ],
        [
            "^"
        ],
        [
            "\"Butig, Lanao del Sur : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 24 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Lanao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Butig Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Butig"
        ],
        [
            "Lumbayanague"
        ],
        [
            "Sultan Dumalondong"
        ],
        [
            "Butig"
        ],
        [
            "Lumba-Bayabao"
        ],
        [
            "Sultan Dumalondong"
        ],
        [
            "vte Province of Lanao del SurMarawi (capital)Municipalities"
        ],
        [
            "Amai Manabilang"
        ],
        [
            "Bacolod-Kalawi"
        ],
        [
            "Balabagan"
        ],
        [
            "Balindong"
        ],
        [
            "Bayang"
        ],
        [
            "Binidayan"
        ],
        [
            "Buadiposo-Buntong"
        ],
        [
            "Bubong"
        ],
        [
            "Butig"
        ],
        [
            "Calanogas"
        ],
        [
            "Ditsaan-Ramain"
        ],
        [
            "Ganassi"
        ],
        [
            "Kapai"
        ],
        [
            "Kapatagan"
        ],
        [
            "Lumba-Bayabao"
        ],
        [
            "Lumbaca-Unayan"
        ],
        [
            "Lumbatan"
        ],
        [
            "Lumbayanague"
        ],
        [
            "Madalum"
        ],
        [
            "Royal Sultanate of Madamba"
        ],
        [
            "Maguing"
        ],
        [
            "Malabang"
        ],
        [
            "Marantao"
        ],
        [
            "Marogong"
        ],
        [
            "Masiu"
        ],
        [
            "Mulondo"
        ],
        [
            "Pagayawan"
        ],
        [
            "Piagapo"
        ],
        [
            "Picong"
        ],
        [
            "Poona Bayabao"
        ],
        [
            "Pualas"
        ],
        [
            "Saguiaran"
        ],
        [
            "Sultan Dumalondong"
        ],
        [
            "Tagoloan"
        ],
        [
            "Tamparan"
        ],
        [
            "Taraka"
        ],
        [
            "Tubaran"
        ],
        [
            "Tugaya"
        ],
        [
            "Wao"
        ],
        [
            "Component city"
        ],
        [
            "Marawi"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Butig&oldid=1231155317\""
        ],
        [
            "Categories: Municipalities of Lanao del SurPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}