{
    "name": "Cabanglasan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cabanglasan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°04′38″N 125°17′57″E﻿ / ﻿8.0772°N 125.2992°E﻿ / 8.0772; 125.2992"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Cabanglasan\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesCabanglasanMunicipalityMunicipality of CabanglasanView of Ear of Corn Landmark in Cabanglasan, Bukidnon"
        ],
        [
            "FlagSealMap of Bukidnon with Cabanglasan highlightedOpenStreetMapCabanglasanLocation within the PhilippinesCoordinates: 8°04′38″N 125°17′57″E﻿ / ﻿8.0772°N 125.2992°E﻿ / 8.0772; 125.2992CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "2nd districtFoundedAugust 13, 1979Barangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorLolita O. Bullecer • Vice MayorRenante V. Inocando • RepresentativeJonathan Keith T. Flores • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Edwin F. Haligado Sr.Charlie C. CastillanesMarilou T. TaalEvangeline S. TamayoJohny E. Dum-oganEfren M. Flores Sr.Ryan Rex M. DumagpiMesar P. Toyhacao Sr."
        ],
        [
            " • Electorate23,334 voters (2022)Area • Revenue₱ 165.8 million (2020) • Assets₱ 615.8 million (2020) • Expenditure₱ 127.3 million (2020) • Liabilities₱ 246.6 million (2020)Service provider • ElectricityBukidnon 2 Electric Cooperative (BUSECO)Time zoneUTC+8 (PST)ZIP code8723PSGC101322000IDD : area code +63 (0)88Native languagesBinukid Cebuano Ata Manobo TagalogWebsitewww.cabanglasanbuk.gov.ph"
        ],
        [
            "Cabanglasan, officially the Municipality of Cabanglasan (Binukid and Higaonon: Bánuwa ta Kabanglasán; Cebuano: Lungsod sa Cabanglasan; Tagalog: Bayan ng Cabanglasan), is a 3rd class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 36,286 people."
        ],
        [
            "History"
        ],
        [
            "The town was once a Barangay of the capital town, Malaybalay.",
            "It was named after a Banglas tree, endemic tree species that inhabit and grow abundantly and distinctively only on this portion of the upper Pulangui.",
            "Banglas is hardwood that usually grows in the rocky portion of the Bobunawan riverbanks.",
            "Kabanglasan literally means a place that has plenty of Banglas."
        ],
        [
            "Cabanglasan was created as a separate municipality from Malaybalay on August 13, 1979, by virtue of Republic Act 6489."
        ],
        [
            "The movement for the separation of Cabanglasan from his mother municipality (Malaybalay) began in the early 1960s when the people of Pulangi region petitioned for secession.",
            "This prompted the passage of House Bill No.",
            "2789 in Congress by the then-Congressman Cesar M. Fortich.",
            "The bill was enacted into law without executive approval under Republic Act 6489 but its implementation was delayed due to the declaration of martial law."
        ],
        [
            "Due to the persistence of the residents as spearheaded by Datu Maliwanag (Saturnino P. Linsagan), then President Ferdinand E. Marcos referred the matter to the mother municipality, Malaybalay.",
            "A plebiscite was then held wherein the majority voted for the implementation of RA 6489.",
            "On August 13, 1979, (by virtue of Batas Pambansa Blg.",
            "17) the first set of municipal officials headed by Mayor Saturnino P. Linsagan aka Datu Maliwanag to his tribesmen, took their oath and held their first session."
        ],
        [
            "Geography"
        ],
        [
            "Cabanglasan is geographically located between east longitude 125 degrees 27 minutes and north latitude 8 degrees and 3 minutes.",
            "It is located at the eastern part of the province of Bukidnon, bounded in the north and west by the City of Malaybalay and the south by the Municipality of San Fernando, and in the east by the province of Agusan del Sur."
        ],
        [
            "It has a total area of 24,330 hectares (60,100 acres), of which 38% is Alienable and Disposable (A&D) land and 62% is timberland.",
            "It has 15 barangays, 5 of which are situated within timberland namely; Freedom, Mandahican, Mauswagon, Jasaan, and Cananga-an.",
            "Five barangays, namely; Anlugan, Cabanglasan proper, Iba, Mandaing and Dalacutan are located within A&D land while the remaining 5 barangays as; Cabulohan, Capinonan, Imbatug, Paradise and Mauswagon are located within both timberland and A&D."
        ],
        [
            "It occupies 2.52% of the total provincial area of Bukidnon and 0.74% of the regional area (Northern Mindanao)."
        ],
        [
            "Slope"
        ],
        [
            "The major part of the municipality is classified under slope class 8 to 15 per cent.",
            "Where such areas are found, it is contiguous to level areas, identified as water retaining areas potentially suited to intensive palay production.",
            "Along its North, East and South boundaries are slope class 30% and above, hilly and mountainous are declared as forestal, but not necessarily foliaged.",
            "Cabanglasan has an average elevation of 465 meters above sea level."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cabanglasan, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "118(4.6)"
        ],
        [
            "73(2.9)"
        ],
        [
            "66(2.6)"
        ],
        [
            "74(2.9)"
        ],
        [
            "175(6.9)"
        ],
        [
            "261(10.3)"
        ],
        [
            "271(10.7)"
        ],
        [
            "281(11.1)"
        ],
        [
            "267(10.5)"
        ],
        [
            "258(10.2)"
        ],
        [
            "164(6.5)"
        ],
        [
            "93(3.7)"
        ],
        [
            "2,101(82.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.0"
        ],
        [
            "13.8"
        ],
        [
            "12.4"
        ],
        [
            "13.1"
        ],
        [
            "24.2"
        ],
        [
            "27.6"
        ],
        [
            "28.9"
        ],
        [
            "28.5"
        ],
        [
            "27.1"
        ],
        [
            "27.4"
        ],
        [
            "21.0"
        ],
        [
            "16.1"
        ],
        [
            "256.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Cabanglasan fall under the fourth type.",
            "It means that rainfall is more or less evenly distributed throughout the year.",
            "May to December is usually the period with long rainfalls.",
            "While driest months last from January to April.",
            "Mountain climates reasonably form another type of climate.",
            "As far as some climatological elements are concerned, except as to temperature, rainfall generally increases with height."
        ],
        [
            "Barangays"
        ],
        [
            "Political map of Cabanglasan."
        ],
        [
            "Cabanglasan is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101322001   Cabulohan"
        ],
        [
            " 6.0%"
        ],
        [
            " 2,179"
        ],
        [
            " 2,121"
        ],
        [
            "  ▴"
        ],
        [
            " 0.27%"
        ],
        [
            " 101322002   Canangaan"
        ],
        [
            " 7.6%"
        ],
        [
            " 2,764"
        ],
        [
            " 2,943"
        ],
        [
            "  ▾"
        ],
        [
            " −0.63%"
        ],
        [
            " 101322003   Iba"
        ],
        [
            " 11.0%"
        ],
        [
            " 4,000"
        ],
        [
            " 3,406"
        ],
        [
            "  ▴"
        ],
        [
            " 1.62%"
        ],
        [
            " 101322004   Imbatug"
        ],
        [
            " 6.3%"
        ],
        [
            " 2,279"
        ],
        [
            " 2,265"
        ],
        [
            "  ▴"
        ],
        [
            " 0.06%"
        ],
        [
            " 101322005   Lambangan"
        ],
        [
            " 3.1%"
        ],
        [
            " 1,112"
        ],
        [
            " 1,073"
        ],
        [
            "  ▴"
        ],
        [
            " 0.36%"
        ],
        [
            " 101322006   Mandaing"
        ],
        [
            " 4.6%"
        ],
        [
            " 1,682"
        ],
        [
            " 1,616"
        ],
        [
            "  ▴"
        ],
        [
            " 0.40%"
        ],
        [
            " 101322007   Paradise"
        ],
        [
            " 6.8%"
        ],
        [
            " 2,470"
        ],
        [
            " 2,331"
        ],
        [
            "  ▴"
        ],
        [
            " 0.58%"
        ],
        [
            " 101322008  Poblacion"
        ],
        [
            " 16.3%"
        ],
        [
            " 5,928"
        ],
        [
            " 5,710"
        ],
        [
            "  ▴"
        ],
        [
            " 0.38%"
        ],
        [
            " 101322009   Anlogan"
        ],
        [
            " 4.7%"
        ],
        [
            " 1,715"
        ],
        [
            " 1,622"
        ],
        [
            "  ▴"
        ],
        [
            " 0.56%"
        ],
        [
            " 101322010   Capinonan"
        ],
        [
            " 7.4%"
        ],
        [
            " 2,675"
        ],
        [
            " 2,662"
        ],
        [
            "  ▴"
        ],
        [
            " 0.05%"
        ],
        [
            " 101322011   Dalacutan"
        ],
        [
            " 1.7%"
        ],
        [
            " 614"
        ],
        [
            " 559"
        ],
        [
            "  ▴"
        ],
        [
            " 0.94%"
        ],
        [
            " 101322012   Freedom"
        ],
        [
            " 4.1%"
        ],
        [
            " 1,498"
        ],
        [
            " 1,714"
        ],
        [
            "  ▾"
        ],
        [
            " −1.34%"
        ],
        [
            " 101322013   Mandahikan"
        ],
        [
            " 6.9%"
        ],
        [
            " 2,489"
        ],
        [
            " 1,840"
        ],
        [
            "  ▴"
        ],
        [
            " 3.07%"
        ],
        [
            " 101322014   Mauswagon"
        ],
        [
            " 3.1%"
        ],
        [
            " 1,142"
        ],
        [
            " 1,123"
        ],
        [
            "  ▴"
        ],
        [
            " 0.17%"
        ],
        [
            " 101322015   Jasaan"
        ],
        [
            " 4.0%"
        ],
        [
            " 1,450"
        ],
        [
            " 1,442"
        ],
        [
            "  ▴"
        ],
        [
            " 0.06%"
        ],
        [
            "Total"
        ],
        [
            "36,286"
        ],
        [
            "32,427"
        ],
        [
            " ▴"
        ],
        [
            "1.13%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CabanglasanYearPop.±% p.a.1980 16,843—    1990 26,351+4.58%1995 29,288+2.00%2000 32,305+2.12%2007 32,817+0.22%2010 32,427−0.43%2015 33,997+0.90%2020 36,286+1.29%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Cabanglasan was 36,286 people, with a density of 150 inhabitants per square kilometre or 390 inhabitants per square mile."
        ],
        [
            "Cabanglasan was created to become a municipality on August 13, 1979, by virtue of Republic Act 6489.",
            "In the following year, 1980, a regular census on population and housing was conducted nationwide, wherein Cabanglasan had an actual population count of 16,843."
        ],
        [
            "In 1990, there was another census of population and housing.",
            "Because of the presence of the two logging companies, the T.H.",
            "Valderrama and Talakag Timber Incorporated, the population of this town grew to 26,351, an increase of about 9,508 or 56.45%.",
            "During those Censal years Barangays Cabulohan, Capinonan and Imbatug had a greater population because it was where the logging companies established their plant and housing camps."
        ],
        [
            "In 1995, a mid-decade census on population and housing was made.",
            "During that year, Cabanglasan had a population of 29,288 or an increase of 11.15%.",
            "However, due to the closure of the two logging companies in 1991, the population of the three barangays mentioned above decreased while the population of other barangays increased.",
            "Barangay Poblacion had an increase of 68.2116%.",
            "In 1990, its population was only 2,287 but it grew to 3,847 in 1995.",
            "This increase was due to the influx of former workers from the logging companies who settled in the neighbouring barangays.",
            "As a result, the overall population count of the municipality increased at an average growth rate of 2.50%."
        ],
        [
            "Another factor in this population increase is the ongoing progress and development of this municipality, such as road accessibility to the different barangays and sitios, farm modernization, electrification and the coming of small and medium investors to establish their business in the Poblacion.",
            "With this positive trend, it can be projected that the increase of population will continue and the coming of investors would provide job opportunities to our people."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cabanglasan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "2006  50.50"
        ],
        [
            "2009  45.21"
        ],
        [
            "2012  59.30"
        ],
        [
            "2015  60.75"
        ],
        [
            "2018  34.04"
        ],
        [
            "2021  33.46"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Infrastructure"
        ],
        [
            "This section needs to be updated.",
            "Please help update this article to reflect recent events or newly available information.",
            "(December 2016)"
        ],
        [
            "Transportation"
        ],
        [
            "Being typically landlocked, the means of transportation for intra-municipal travel is through jeepneys and motorcycles, buses and jeepneys can be availed of for travels going out of the municipality."
        ],
        [
            "Most of the vehicles (82%) are privately owned.",
            "About 16 per cent are public utility vehicles while only 2% belonged to the government."
        ],
        [
            "The whole stretch of the national highway (21.61  km) is still gravel-paved.",
            "Of the 15.065  km of municipal road, 4% per cent has already been converted to concrete pavement, 9% is gravel-paved, and the rest is still earth-paved.",
            "The aggregate length of barangay roads in the municipality has been recorded at 287.409  km.",
            "Nearly 41 per cent (117.603) of this is gravel-paved, a little over half (56%) of the total length is still unpaved while only less than one per cent (1%) has been concreted.",
            "It can also be noted that earth-paved roads – especially roads going to the interior sitios are not passable during the rainy season."
        ],
        [
            "Bridges link gaps between rivers.",
            "For areas which are not regular routes of land transportation but are bounded by rivers, hanging footbridges were constructed."
        ],
        [
            "Communication"
        ],
        [
            "Postal services of the municipality are being provided by the Bureau of Post which is staffed by a Postmaster.",
            "Being understaffed, the postmaster also served as the municipality's letter carrier."
        ],
        [
            "For telecommunication, the provincial government had installed a single-sideband radio in the municipality.",
            "This is actually part of the Provincial Radio Communication Network.",
            "Through this system, the municipality is able to reach out to other parts of the province directly or via relay stations.",
            "This is being complemented by handheld radios in some barangays which the municipality used for transmitting messages to these areas.",
            "Cabanglasan's populace is also kept abreast of recent information which is of regional and/or national significance through two Television channels which signal covered the municipality.",
            "These are the ABS-CBN (Channel 2) and GMA (Channel 12).",
            "AM and FM Band radio Stations from Malaybalay, Valencia, Cagayan and Davao also reached the municipality.",
            "Print media on the other hand only include a local newspaper (Bukidnon Newswatch) which has a weekly circulation."
        ],
        [
            "Water systems"
        ],
        [
            "Springs, rivers and deep wells are the sources of water supply used for both domestic water supply and irrigation needs.",
            "Deep wells and springs are commonly used as potable water supply.",
            "Local government, congressional initiatives, and regional and senatorial funds are used to develop these sources.",
            "The municipal government's ardent thrust to provide basic services to its constituents can be well manifested by its current pursuit to develop a level III type of water system through funding from the World Bank.",
            "The municipal government had entered into a loan agreement with the bank to develop a system that will provide for an individual pipe connection for each household within the barangays of Poblacion and Iba.",
            "Data shows that Level I and Level II types of systems are the most prevalent type of water supply in the municipality.",
            "Level I water system is currently serving 7.17% of the total households.",
            "Likewise, Level II is providing water for 47.39% of all households, while Level III only served 3.62% of the total.",
            "The rest (41.82%) still remained un-served by a water supply system"
        ],
        [
            "Health services"
        ],
        [
            "The health service in the Municipality of Cabanglasan is catered by the Municipal Health Office (MHO) and one private lying-in clinic.",
            "The former handles the public health services and some clinical services while the latter serves most of the clinical cases.",
            "The MHO is located at Poblacion and the nine Barangay Health Stations are located in the different barangays.",
            "These serve as channels for providing basic health services to the general populace.",
            "The office is staffed by one medical doctor, one dentist, one DOH-nurse, four permanent Rural Health Midwives (RHMs), five Job Order RHMs, one Rural Sanitary Inspector (RSI), and one dental aid.",
            "The health personnel is augmented by 175 Barangay Health Workers (BHW) 38 “hilots” and other health-oriented NGOs such as BIDANI, MAP, and the German Rolling Clinic."
        ],
        [
            "Health statistics showed that the four leading causes of morbidity fall under communicable diseases which are preventable in nature but there was a gradual increase in such cases in the past few years.",
            "This increase could be attributed to the lack of permanent personnel assigned in far-flung and strategically located barangays.",
            "Another contributing factor is the inadequate supply of medicines and medical logistics which are necessary for the implementation of health services and programs.",
            "Records from the nutrition program of the municipality revealed the high prevalence rate of malnutrition has gradually decreased.",
            "This accomplishment was due to the full support of the Local Government Unit and Department of Health, and the increased awareness of the general populace on proper nutrition."
        ],
        [
            "Security"
        ],
        [
            "The total population is 29,288 as of 1995 having a ratio of one policeman per 1,220 inhabitants.",
            "The national standard ratio is one policeman per one thousand inhabitants.",
            "Therefore, the Cabanglasan police force needs 15 Policemen to meet the standard ratio."
        ],
        [
            "Special Force (SF) of the Philippine Army (PA) established four strategic detachments, located at Barangay Poblacion, Freedom, Cananga-an and Jasaan.",
            "Each detachment is staffed by two regular elements of the SF-PA assisted by their respective CAFGUs (Citizen Armed Forces Geographical Units).",
            "Cabanglasan police force is headed by one Police Commission Officer (PCO) as Chief of Police (COP), twenty-three Police Non-Commission Officer (PCNOs) with five police community precincts.",
            "Each PCP is headed by one policeman assisted by their respective Bantay Bayan/CVOs (Civilian Volunteers Organization).",
            "The area of responsibility or coverage has one PCP for every three Barangays."
        ],
        [
            "Education"
        ],
        [
            "This section needs to be updated.",
            "Please help update this article to reflect recent events or newly available information.",
            "(December 2016)"
        ],
        [
            "Elementary"
        ],
        [
            "The data on existing schools and facilities are complete which is indicative of the overall picture of the District of Cabanglasan.",
            "There are 26 elementary schools within the municipality three schools are within the urban centre, while the remaining 23 schools are distributed throughout the rural areas.",
            "Each barangay has at least one elementary school with Iba and Poblacion having the biggest area in terms of hectares.",
            "All schools have playgrounds, and some have clinics but none of them has a laboratory, shop or library."
        ],
        [
            "Secondary"
        ],
        [
            "The Municipality of Cabanglasan has five secondary schools, three public schools and two private school, namely: Cabulohan-Paradise National High School, Cabanglasan National High School, Capinonan National High School, Fr.",
            "Leoni Memorial School and Promise Mountain Christian Academy."
        ],
        [
            "Tertiary"
        ],
        [
            "The municipality has an external campus for Bukidnon State University situated in Barangay Iba."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Cabanglasan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Batas Pambansa Blg.",
            "17\".",
            "The LawPhil Project.",
            "Arellano Law Foundation.",
            "February 9, 1979.",
            "Retrieved March 22, 2023."
        ],
        [
            "^"
        ],
        [
            "\"Cabanglasan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Cabanglasan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Cabanglasan"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malaybalay"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Loreto, Agusan del Sur"
        ],
        [
            "San Fernando"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cabanglasan&oldid=1214257825\""
        ],
        [
            "Categories: Municipalities of BukidnonPopulated places on the Rio Grande de MindanaoHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textWikipedia articles in need of updating from December 2016All Wikipedia articles in need of updatingCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}