{
    "name": "Caba",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Caba, La Union"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°25′54″N 120°20′41″E﻿ / ﻿16.4316°N 120.3446°E﻿ / 16.4316; 120.3446"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in La Union, Philippines"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesCabaMunicipalityMunicipality of CabaCaba town center along the National Highway"
        ],
        [
            "FlagSealMotto: \"Arriba Dur-As Caba\"Anthem: Caba HymnMap of La Union with Caba highlightedOpenStreetMapCabaLocation within the PhilippinesCoordinates: 16°25′54″N 120°20′41″E﻿ / ﻿16.4316°N 120.3446°E﻿ / 16.4316; 120.3446CountryPhilippinesRegionIlocos RegionProvinceLa UnionDistrict"
        ],
        [
            "2nd districtBarangays17"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPhilip Caesar P. Crispino • Vice MayorRonnie P. Mangaser • RepresentativeSandra Y. Eriguel • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Donna R. CrispinoArleen G. CrispinoMaribel B. RunesConrado A. VitoDon Mar P. DugeniaCharlyn C. Fesalbon-ReyesPatricio A. DulayCrisogono D. Hulipas Jr."
        ],
        [
            " • Electorate17,787 voters (2022)Area • Revenue₱ 94.98 million (2020) • Assets₱ 331.1 million (2020) • Expenditure₱ 132.7 million (2020) • Liabilities₱ 33.44 million (2020)Service provider • ElectricityLa Union Electric Cooperative (LUELCO)Time zoneUTC+8 (PST)ZIP code2502PSGC013309000IDD : area code +63 (0)72Native languagesIlocano Pangasinan TagalogWebsitewww.caba.gov.ph"
        ],
        [
            "Caba, officially the Municipality of Caba (Ilocano: Ili ti Caba; Filipino: Bayan ng Caba), is a 4th class municipality in the province of La Union, Philippines.",
            "According to the 2020 census, it has a population of 23,119 people."
        ],
        [
            "Caba was a part of the municipality of Aringay until the late-19th century when it was permanently separated to form its own entity.",
            "It has a land area of 4,631 hectares (11,440 acres)."
        ],
        [
            "Etymology"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(August 2013) (Learn how and when to remove this message)"
        ],
        [
            "History records show that this municipality used three names interchangeably: Caba, Cava, and Caua.",
            "According to a local historian Pedro Manongdo, two tales have persisted on how the town got his name.",
            "One group referred to an incident when a Spaniard asked an inhabitant the name of the place.",
            "The youth mistook the question as an inquiry to the name of the animal he was herding and answered “Cava.”  The repetition of the name ended with Cava and later Caba."
        ],
        [
            "Another story sustained that Caba was the name given by a group of immigrants from barrio Caba, San Carlos, Pangasinan who settled in the community in the later years of the 16th century.",
            "In memory of the place where they came from, they named the new settlement CABA."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(August 2013) (Learn how and when to remove this message)"
        ],
        [
            "Establishment during the Spanish colonial era"
        ],
        [
            "Caba was founded as a settlement in 1598 by Augustinian Fathers with Don Agustin dela Cruz as the “first man to rule.”  The settlement developed into barangay in 1692 with don Luis Manongdo as the Cabeza de barangay.",
            "It became a town in 1783 with Don Domingo Aragon as gobernadorcillo."
        ],
        [
            "Two other historians however have claimed different dates on the founding of Caba as a town.",
            "On one hand, Father Jose Braganza, SVD claims that Caba was founded in 1745 along with Aringay.",
            "On the other hand, Julian Martin claims that Caba was founded in 1844."
        ],
        [
            "Revolt of Diego Silang"
        ],
        [
            "Diego Silang monument in downtown Caba"
        ],
        [
            "Main article: Diego Silang"
        ],
        [
            "See also: Gabriela Silang"
        ],
        [
            "Caba is the birthplace of Diego Silang, the inspiration and the leader of the Ilocos Revolt of 1762-1763.",
            "During the Spanish period, Silang established an independent rebel government in Northern Luzon and agitated for reforms in and out of the government.",
            "However, Spanish authorities resorted to assassinating him with the help of one of his followers who betrayed him with a shot in his back on May 28, 1763.",
            "The assassin's bullet did not however smother the flame of Silang rebellion.",
            "His wife Gabriella took the torch of leadership and by her own right, continued the rebellion heroically.",
            "Four months later, she was captured by Spanish forces and was executed publicly in Vigan on September 20, 1763, thus ended not only the heroic adventure of the “Ilocandia’s Joan of Arc” but also Silang's revolt.",
            "A predominantly Roman Catholic municipality.",
            "In 1997 the Roman Catholic Church Celebrated its 400 years of Christianity basing on church's documents"
        ],
        [
            "During the American colonial era"
        ],
        [
            "In 1903, the Philippine commission reorganized the administrative and territorial set-up of municipalities in the country.",
            "Due to a meager population of financial difficulties, some smaller municipalities were integrated.",
            "Caba was integrated with Aringay while Santo Tomas to Agoo."
        ],
        [
            "In 1907, Executive Order no.",
            "41 was issued which provided that Caba be separated from Aringay.",
            "The order took effect on January 1, 1908, thus Caba again became a regular municipality with Francisco Sobredillo as Chief Executive."
        ],
        [
            "During World War II"
        ],
        [
            "Main article: Japanese Invasion of Lingayen Gulf"
        ],
        [
            "Caba, along with the nearby towns of Agoo and Bauang were the first places the Japanese invasion force sought to control  during the main effort to capture Luzon at the beginning of World War 2 - now known as the Japanese Invasion of Lingayen Gulf.",
            "Capturing the three towns which were connected by a high quality road, but protected on one side by the ocean and the other by the sea, meant that the Japanese forces were easily able to establish a secure beachhead.",
            "Once they had done so, they launched attacks against defense forces at San Fernando, La Union and Rosario, La Union, and from there they deployed southwards across the plains of Pangasinan and Tarlac to take Fort Stotsenburg in Pampanga, then Bulacan, and finally Manila."
        ],
        [
            "During the Marcos dictatorship"
        ],
        [
            "Main articles: Martial law under Ferdinand Marcos and Human rights abuses of the Marcos dictatorship"
        ],
        [
            "The beginning of the 1970s marked a period of turmoil and change in the Philippines because Ferdinand Marcos had used foreign debt to fund too many public works projects as he headed his 1969 reelection campaign,"
        ],
        [
            "Marcos' efforts to consolidate political power did not get much resistance in the La Union,"
        ],
        [
            "Later 20th Century"
        ],
        [
            "See also: People Power revolution, Provisional Government of the Philippines (1986–1987), and 1990 Luzon earthquake"
        ],
        [
            "After Marcos fled into exile after the civilian-led 1986 People Power revolution, Edgar T. Bacungan was appointed OIC mayor under the new Provisional Revolutionary Government.",
            "He was then properly elected into office when the Fifth Philippine Republic was established, serving until 1992."
        ],
        [
            "In 1990, Caba was heavily affected by the 1990 Luzon earthquake."
        ],
        [
            "Geography"
        ],
        [
            "Caba is located 248 kilometres (154 mi) from Metro Manila and 21 kilometres (13 mi) from San Fernando, the provincial capital."
        ],
        [
            "Barangays"
        ],
        [
            "Caba is politically subdivided into 17"
        ],
        [
            "barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bautista"
        ],
        [
            "Gana"
        ],
        [
            "Juan Cartas"
        ],
        [
            "Las-ud"
        ],
        [
            "Liquicia"
        ],
        [
            "Poblacion Norte"
        ],
        [
            "Poblacion Sur"
        ],
        [
            "San Carlos"
        ],
        [
            "San Cornelio"
        ],
        [
            "San Fermin"
        ],
        [
            "San Gregorio"
        ],
        [
            "San Jose"
        ],
        [
            "Santiago Norte"
        ],
        [
            "Santiago Sur"
        ],
        [
            "Sobredillo"
        ],
        [
            "Urayong"
        ],
        [
            "Wenceslao"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Caba, La Union"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "15(0.6)"
        ],
        [
            "16(0.6)"
        ],
        [
            "24(0.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "102(4.0)"
        ],
        [
            "121(4.8)"
        ],
        [
            "177(7.0)"
        ],
        [
            "165(6.5)"
        ],
        [
            "144(5.7)"
        ],
        [
            "170(6.7)"
        ],
        [
            "56(2.2)"
        ],
        [
            "23(0.9)"
        ],
        [
            "1,046(41.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "6.3"
        ],
        [
            "6.6"
        ],
        [
            "9.5"
        ],
        [
            "12.8"
        ],
        [
            "20.6"
        ],
        [
            "23.5"
        ],
        [
            "25.4"
        ],
        [
            "23.4"
        ],
        [
            "23.2"
        ],
        [
            "21.4"
        ],
        [
            "14.0"
        ],
        [
            "8.2"
        ],
        [
            "194.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CabaYearPop.±% p.a.1903 3,967—    1918 5,860+2.64%1939 6,873+0.76%1948 7,320+0.70%1960 9,517+2.21%1970 11,719+2.10%1975 13,029+2.15%1980 14,114+1.61%1990 16,620+1.65%1995 18,234+1.75%2000 19,565+1.52%2007 20,927+0.93%2010 21,244+0.55%2015 22,039+0.70%2020 23,119+0.95%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Caba, La Union, was 23,119 people, with a density of 500 inhabitants per square kilometre or 1,300 inhabitants per square mile."
        ],
        [
            "Religion"
        ],
        [
            "UCCP"
        ],
        [
            "Assemblies of God (Poblacion Norte)"
        ],
        [
            "Assemblies of God (San Jose)"
        ],
        [
            "Assemblies of the First Born (Gana)"
        ],
        [
            "Assemblies of the First Born (Juan Cartas)"
        ],
        [
            "Assemblies of the First Born (Liquicia)"
        ],
        [
            "Assemblies of the First Born (San Cornelio)"
        ],
        [
            "Assemblies of the First Born (San Jose)"
        ],
        [
            "Assemblies of the First Born (Sobredillo)"
        ],
        [
            "Assemblies of the First Born (Urayong)"
        ],
        [
            "Christ Centered Fellowship (Juan Cartas)"
        ],
        [
            "Faith Gospel Mission Church/Yes for Jesus Crusaders International (Poblacion Norte)"
        ],
        [
            "Iglesia Filipina Independiente (Poblacion Norte)"
        ],
        [
            "Iglesia Ni Cristo (Gana)"
        ],
        [
            "Jesus Christ The Glorious Savior International Ministry JCGSIM LU"
        ],
        [
            "Messengers of the Cross Bible College/Assemblies of the First Born Full Gospel Church (Poblacion Norte)"
        ],
        [
            "Shinil Caba Christian Fellowship (Poblacion Norte)"
        ],
        [
            "The Lord's Vineyard Baptist Church (Las-ud)"
        ],
        [
            "United Church of Christ in the Philippines (Poblacion Norte)"
        ],
        [
            "Words of Life Christian Ministries (Santiago Norte)"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Caba"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  29.60"
        ],
        [
            "2009  25.23"
        ],
        [
            "2012  8.53"
        ],
        [
            "2015  7.30"
        ],
        [
            "2018  3.11"
        ],
        [
            "2021  10.46"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Just as the national government, the municipal government of Caba, is divided into three branches: executive, legislative, and judiciary.",
            "The judicial branch is administered solely by the Supreme Court of the Philippines.",
            "The LGUs have control of the executive and legislative branches."
        ],
        [
            "The executive branch is composed of the mayor and the barangay captain for the barangays.Local Government Code of the Philippines, Book III, Department of the Interior and Local Government official website."
        ],
        [
            "The legislative branch is composed of the Sangguniang Bayan (town assembly), Sangguniang Barangay (barangay council), and the Sangguniang Kabataan for the youth sector."
        ],
        [
            "The seat of Government is vested upon the Mayor and other elected officers who hold office at the Caba Town Hall.",
            "The Sanguniang Bayan is the center of legislation, stationed in Caba Legislative Building."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Dante S. Garcia"
        ],
        [
            "Governor"
        ],
        [
            "Raphaelle Veronica A. Ortega-David"
        ],
        [
            "Mayor"
        ],
        [
            "Donna R. Crispino"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Ronnie P. Mangaser"
        ],
        [
            "Councilors"
        ],
        [
            "Conrado A. Vito"
        ],
        [
            "Arleen G. Crispino"
        ],
        [
            "Maribel B. Runes"
        ],
        [
            "Igmedio L. Dugenia"
        ],
        [
            "Don Mar P. Dugenia"
        ],
        [
            "Charlyn F. Reyes"
        ],
        [
            "Crisogono D. Hulipas Jr."
        ],
        [
            "Imelda D. Vallejo"
        ],
        [
            "Tourism"
        ],
        [
            "Silang Monument and the Caba covered court, Auditorium"
        ],
        [
            "Sangria is a privately-owned Farm Resort located in Barangay Gana."
        ],
        [
            "Diego Silang's monument is erected in the middle of the Town Plaza."
        ],
        [
            "President Elpidio Quirino's stone monument on the other hand was placed at Barangay Gana highway.",
            "Quirino taught in Caba as an elementary public school teacher."
        ],
        [
            "Ripe and green mangoes, Bagoong, Padas, and Alamang are the town's products that are sold install along the Gana roads."
        ],
        [
            "Bamboo furniture is one of the prime business of the residents."
        ],
        [
            "Mt.",
            "Kimmallugong is the town's hiking and camping site."
        ],
        [
            "Sobredillo barrio: one can find the 56 Mortar (weapon) (bombs, 81 millimeter each of Japanese soldiers, World War II), were unearthed near Mayor Clyde Crispino's house in Barangay Sobredillo including a 1-high old jar, for serving offerings in religious rites."
        ],
        [
            "Caba holds the records in the \"Search for Cleanest and Greenest Municipality in La Union\" (4th-5th Class Municipality Category in 2006, 2007 and 2008).",
            "It also claimed the Regional Level and National Finalist trophies, for Seal of Good Housekeeping trophies in 2010, including the 2010 Provincial Championship medal in the Search for Best Performing LGU Local Governance Performance Measurement System)."
        ],
        [
            "Caba celebrates on April 15 to 18, the town fiesta and on June 24, the Feast of Saint John the Baptist."
        ],
        [
            "Caba holds its Paskua Ti Umili every December."
        ],
        [
            "Caba beach"
        ],
        [
            "Caba prime beaches are located along Lingayen Gulf in La Union."
        ],
        [
            "Caba's prime tourist spot is Villa Navarro Beach Resort and Restaurant (along Lingayen Gulf in Caba, 247 kilometers north of Manila and 10 km north of Agoo, La Union)."
        ],
        [
            "Sea of Dreams Spa Resort (San Carlos)."
        ],
        [
            "Paiko Blue Waters Beach Resort and Spa is another Caba's"
        ],
        [
            " Panorama of Caba's beach"
        ],
        [
            "Maglaya Medical-Legal Missions Inc We Care Clinic (MMLM)"
        ],
        [
            "Caba Medicare Community Hospital"
        ],
        [
            "Caba Municipal Health Center"
        ],
        [
            "Education"
        ],
        [
            "Caba Elementary School"
        ],
        [
            "Elementary schools"
        ],
        [
            "Caba Central Elementary School"
        ],
        [
            "Dona Antonia Maglaya Elementary School"
        ],
        [
            "Jesus Cares Christian Academy (formerly Faith Mission Academy, Incorporated)"
        ],
        [
            "Labbon Elementary School"
        ],
        [
            "Liquicia Integrated School"
        ],
        [
            "San Carlos Elementary School"
        ],
        [
            "San Cornelio Elementary School"
        ],
        [
            "San Gregorio Elementary School"
        ],
        [
            "San Jose Elementary School"
        ],
        [
            "Santiago Sur Integrated School"
        ],
        [
            "St. John the Baptist Learning Center"
        ],
        [
            "Wenceslao Elementary School"
        ],
        [
            "Secondary schools"
        ],
        [
            "Caba National High School"
        ],
        [
            "International World Mission School (formerly Remnant Int'l School)"
        ],
        [
            "La Union Standard Academy"
        ],
        [
            "Saint John the Baptist Learning Center"
        ],
        [
            "San Gregorio National High School"
        ],
        [
            "San Jose National High School"
        ],
        [
            "Wenceslao National High School"
        ],
        [
            "Liquicia Integrated School"
        ],
        [
            "Santiago Sur Integrated School"
        ],
        [
            "Colleges"
        ],
        [
            "Messengers of the Cross Bible College"
        ],
        [
            "Gallery"
        ],
        [
            "Caba welcome arch"
        ],
        [
            "Municipal hall"
        ],
        [
            "Farmers' Market Building"
        ],
        [
            "Saint John the Baptist Parish Church"
        ],
        [
            "Caba rural landscape"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Caba |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b"
        ],
        [
            "\"Province: La Union\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Local Government Units: Municipality of Caba-History - Province of la Union :: Official Website\".",
            "Archived from the original on 2013-07-20.",
            "Retrieved 2012-12-09."
        ],
        [
            "^ \"The Main Landings\".",
            "Retrieved 18 March 2014."
        ],
        [
            "^ Balbosa, Joven Zamoras (1992).",
            "\"IMF Stabilization Program and Economic Growth: The Case of the Philippines\" (PDF).",
            "Journal of Philippine Development.",
            "XIX (35).",
            "Archived from the original (PDF) on September 21, 2021.",
            "Retrieved November 6, 2022."
        ],
        [
            "^ Balisacan, A. M.; Hill, Hal (2003).",
            "The Philippine Economy: Development, Policies, and Challenges.",
            "Oxford University Press.",
            "ISBN 9780195158984."
        ],
        [
            "^ Celoza, Albert F. (1997).",
            "Ferdinand Marcos and the Philippines: The Political Economy of Authoritarianism.",
            "Greenwood Publishing Group.",
            "ISBN 9780275941376."
        ],
        [
            "^ Schirmer, Daniel B.",
            "(1987).",
            "The Philippines reader : a history of colonialism, neocolonialism, dictatorship, and resistance (1st ed.).",
            "Boston: South End Press.",
            "ISBN 0896082768.",
            "OCLC 14214735."
        ],
        [
            "^ Kessler, Richard J.",
            "(1989).",
            "Rebellion and repression in the Philippines.",
            "New Haven: Yale University Press.",
            "ISBN 0300044062.",
            "OCLC 19266663."
        ],
        [
            "^ a b c Cortes, Rosario Mendoza.",
            "(1990) Pangasinan, 1901-1986: A Political, Socioeconomic, and Cultural History.",
            "New Day Publishers."
        ],
        [
            "^ a b Turner, Mark M. (1989) Elites and Power in a Philippine Town.",
            "Under Martial Law, 1972-76.",
            "Philippine Studies 37: 283-300."
        ],
        [
            "^"
        ],
        [
            "\"Caba: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of La Union\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ a b \"Province of la Union :: Official Website: Local Government Units: Municipality of Caba\".",
            "Archived from the original on 2012-07-10.",
            "Retrieved 2012-12-09."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Archived (PDF) from the original on 2020-10-06.",
            "Retrieved March 6, 2022."
        ],
        [
            "^ \"The Official WebSite of San Fernando City, la Union\".",
            "Archived from the original on 2008-08-27.",
            "Retrieved 2012-12-09."
        ],
        [
            "^ \"Villa Navarro Beach Resort and Restaurant\".",
            "Archived from the original on 2013-03-03.",
            "Retrieved 2012-12-09."
        ],
        [
            "^ \"Sea of Dreams Spa Resort\".",
            "Archived from the original on 2013-06-08.",
            "Retrieved 2012-12-09."
        ],
        [
            "^ Archived copy Archived 2012-11-12 at the Wayback Machine prime beach front at San Carlos."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Caba, La Union."
        ],
        [
            "Caba Website"
        ],
        [
            "Local Government of Caba"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Caba, La Union"
        ],
        [
            "Bauang"
        ],
        [
            "Naguilian"
        ],
        [
            "Lingayen Gulf"
        ],
        [
            "Caba"
        ],
        [
            "Aringay"
        ],
        [
            "Aringay"
        ],
        [
            "vteProvince of La UnionSan Fernando (capital and largest city)Municipalities"
        ],
        [
            "Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Bacnotan"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Bangar"
        ],
        [
            "Bauang"
        ],
        [
            "Burgos"
        ],
        [
            "Caba"
        ],
        [
            "Luna"
        ],
        [
            "Naguilian"
        ],
        [
            "Pugo"
        ],
        [
            "Rosario"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santol"
        ],
        [
            "Sudipen"
        ],
        [
            "Tubao"
        ],
        [
            "Component city"
        ],
        [
            "San Fernando"
        ],
        [
            "BarangaysSee: List of barangays in La Union"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Caba,_La_Union&oldid=1230789402\""
        ],
        [
            "Category: Municipalities of La UnionHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textArticles needing additional references from August 2013All articles needing additional referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}