{
    "name": "Cabanatuan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cabanatuan"
        ],
        [
            "33 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어IlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuLietuviųBahasa MelayuNederlands日本語Norsk bokmålOʻzbekcha / ўзбекчаPangasinanPolskiPortuguêsРусскийSvenskaTagalogТатарча / tatarçaاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°29′27″N 120°58′04″E﻿ / ﻿15.4908°N 120.9678°E﻿ / 15.4908; 120.9678"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Component city in Nueva Ecija, Philippines"
        ],
        [
            "Not to be confused with Cabatuan."
        ],
        [
            "Component city in Central Luzon, PhilippinesCabanatuanComponent cityCity of Cabanatuan(From top, left to right: Maharlika Highway-Cagayan Valley Road Crossing Intersection, Gen. Antonio Luna Equestrian Statue, Old Nueva Ecija Provincial Capitol, San Nicolas de Tolentino Cathedral (Cabanatuan Cathedral), Nueva Ecija High School)"
        ],
        [
            "FlagSealNickname(s): Gateway to the North  Tricycle Capital of the Philippines  Commercial Hub of Nueva EcijaMotto(s): Pagbabago, Progreso, DisiplinaMap of Nueva Ecija with Cabanatuan highlightedOpenStreetMapCabanatuanLocation within the PhilippinesCoordinates: 15°29′27″N 120°58′04″E﻿ / ﻿15.4908°N 120.9678°E﻿ / 15.4908; 120.9678CountryPhilippinesRegionCentral LuzonProvinceNueva EcijaDistrict"
        ],
        [
            "3rd districtFounded1750CityhoodJune 15, 1950Barangays89"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorMyca Elizabeth R. Vergara • Vice MayorJulius Cesar V. Vergara • RepresentativeRosanna V. Vergara • City Council"
        ],
        [
            "Members"
        ],
        [
            "Joselito C. RoquePrudencio B. Garcia Jr.Oscar M. MendozaAldwin Joseph V. DiazFroilan M. ValinoMarius A. GarciaMedel R. SeepingRuben A. Ilagan VRosendo D. del Rosario Jr.Epifanio G. Posada"
        ],
        [
            " • Electorate217,785 voters (2022)Area • Revenue₱ 1,894 million (2020) • Assets₱ 6,978 million (2020) • Expenditure₱ 1,964 million (2020) • Liabilities₱ 3,473 million (2020)Service provider • ElectricityCabanatuan Electric Corporation (CELCOR)Time zoneUTC+8 (PST)ZIP code3100PSGC034903000IDD : area code +63 (0)44Native languagesKapampangan Tagalog IlocanoWebsitewww.cabanatuancity.gov.ph"
        ],
        [
            "Cabanatuan, officially the City of Cabanatuan (Filipino: Lungsod ng Cabanatuan; Ilocano: Siudad ti Cabanatuan; Kapampangan: Lakanbalen/Ciudad ning Cabanatuan), is a 1st class component city in the province of Nueva Ecija, Philippines.",
            "According to the 2020 census, it has a population of 327,325 people, making it the most populous city in Nueva Ecija and the fifth-most populous in Central Luzon."
        ],
        [
            "The city is popular for being home to more than 30,000 motorized tricycles, making it the \"Tricycle Capital of the Philippines.\"",
            "Its strategic location along the Cagayan Valley Road has made the city a major economic, educational, medical, entertainment, shopping, and transportation center in Nueva Ecija and nearby provinces in the region such as Tarlac, Aurora, and Bulacan.",
            "It has also earned the moniker \"Gateway to the North.\""
        ],
        [
            "Cabanatuan remained Nueva Ecija's capital until 1965 when the government created nearby Palayan City as the new provincial capital.",
            "Nueva Ecija's old capitol and other government offices are still used and maintained by the provincial administration."
        ],
        [
            "After the campaign for the city's designation as a highly urbanized city failed, a motion was made to convert the city into a lone district instead."
        ],
        [
            "History"
        ],
        [
            "Marker of Gen. Antonio Luna's Death Place"
        ],
        [
            "Cabanatuan was founded as a Barrio of Gapan in 1750 and became a Municipality and capital of La Provincia de Nueva Ecija in 1780.",
            "Majority of the original settlers of Cabanatuan were Tagalogs from Bulacan and Morong (Rizal Province); other early settlers came from Ilocos, Pampanga and Tayabas (now Quezon Province).",
            "Tagalogs settled the barrios on the western part while the vicinity around Sangitan was the settlement of Kapampangans and Ilocanos."
        ],
        [
            "During World War II, the occupying Japanese built Cabanatuan Prison Camp, where many American soldiers were imprisoned, some of whom had been forced to endure the infamous Bataan Death March.",
            "In January 1945, elements of the U.S. Army 6th Ranger Battalion and two teams of Alamo Scouts marched 30 miles (48 km) behind enemy lines to rescue the prisoners in what became known as the Raid at Cabanatuan.",
            "As a result of the raid on January 30, 1945, victorious Filipino guerrillas, American troops of the U.S. Army 6th Ranger Battalion and Alamo Scouts celebrated having obtained the freedom of 500 American POWs.",
            "Soon thereafter, Philippine and American forces re-established the presence of military general headquarters and military camp bases of the Philippine Commonwealth Army, Philippine Constabulary 2nd Constabulary Regiment, and the United States Army in Cabanatuan from February 1, 1945, to June 30, 1946, during the Allied Liberation.",
            "Before long, the combined Philippine Commonwealth and American armed forces, in cooperation with local guerrilla resistance fighters and Hukbalahap Communist guerrillas, had liberated Central Luzon from Japanese Imperial forces, a campaign that lasted from January until August 1945."
        ],
        [
            "In 1957, the barrios of Mataas na Kahoy, Balangkare Norte, Balangkare Sur, Sapang Kawayan, Magasawang Sampaloc, Talabutab Norte, Talabutab Sur, Platero, Belen, Pecaleon, Piñahan, Kabulihan, Pasong-Hari, Balaring, Pulong Singkamas, Panaksak, Bravo, Sapang Bato, Burol, Miller, Tila Patio, Pula, Carinay, and Acacia were separated from Cabanatuan and constituted into a separate and independent municipality known as General Mamerto Natividad."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "Cabanatuan became a city by virtue of Republic Act No.",
            "526, approved on June 16, 1950.",
            "In 1965, Congress created Palayan City, and transferred the capital of Nueva Ecija from Cabanatuan to the newly created city of Palayan."
        ],
        [
            "Highly urbanized city (HUC)"
        ],
        [
            "In 1998, Cabanatuan was declared by then-president Fidel V. Ramos as a highly urbanized city however it failed ratification after the majority of votes in the plebiscite was negative."
        ],
        [
            "Cabanatuan was declared as a highly urbanized city by President Benigno S. Aquino III under Presidential Proclamation No.",
            "418 on July 14, 2012."
        ],
        [
            "1990 Luzon earthquake"
        ],
        [
            "Cabanatuan was near the epicenter of the infamous 1990 Luzon earthquake, which registered a 7.8 on the surface wave magnitude scale, at roughly 3 pm on July 16, 1990.",
            "It leveled some buildings, most notably the Christian College of the Philippines (Liwag Colleges) in the midst of class time, and killed 1,653 people.",
            "Around 154 people were said to be killed inside the CCP building."
        ],
        [
            "Unlike in Baguio, local and international journalists were able to arrive at Cabanatuan City hours after the tremor, and media coverage of the quake in its immediate aftermath centered on the collapsed school, where rescue efforts were hampered by the lack of heavy equipment to cut through the steel reinforcement of fallen concrete."
        ],
        [
            "Geography"
        ],
        [
            "Cabanatuan City is located in the rolling central plains of Luzon drained by the Pampanga River.",
            "The city stands 14 kilometres (8.7 mi) southwest of the provincial capital Palayan City and 116 kilometres (72 mi) north of Manila.",
            "It is bordered by Santa Rosa to the south, Talavera and Gen. Mamerto Natividad to the north, Palayan to the north east, Laur to the east, and Aliaga to the west."
        ],
        [
            "Climate and natural disasters"
        ],
        [
            "Cabanatuan has a tropical wet and dry climate  (Köppen climate classification: Aw), with year-round warm weather and distinct dry and wet seasons.",
            "It is touted as one of the hottest cities in the country; in the summer season of 2011 Cabanatuan reached its hottest temperature at 39.8 °C, also the hottest in the Philippines in that same year, and on June 4, 2015 PAGASA reported a 53 °C (127 °F) heat index for the city, which is the hottest yet recorded."
        ],
        [
            "According to the fifth Annual Natural Hazards Risk Atlas (NHRA) report in 2015, Cabanatuan City was ranked as the sixth city in the Philippines with extreme exposure to a myriad of natural hazards, especially typhoons and flooding."
        ],
        [
            "Notable disasters have struck Cabanatuan City in the past decades, including the 1990 Luzon earthquake, 2013 Typhoon Santi, and 2015 Typhoon Lando.",
            "The 2013 Typhoon Santi brought extreme winds measuring up to 120 km/h, causing widespread infrastructure damages and power loss to the city."
        ],
        [
            "Later in 2015, Typhoon Lando caused massive damage in the form of severe flooding in Central Luzon, including Cabanatuan City.",
            "The city experienced severe flooding, which hampered the operations of many establishments.",
            "Most roads going to the major districts of Cabanatuan were not passable to light vehicles for two to three days after the storm."
        ],
        [
            "Recently in 2022, Typhoon Karding damaged numerous establishments, farmlands, and electric lines in the city."
        ],
        [
            "Climate data for Cabanatuan (rainfall and humidity 1991–2018, temperature 1981–2011, extremes 1949–2020)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "36.2(97.2)"
        ],
        [
            "38.1(100.6)"
        ],
        [
            "38.8(101.8)"
        ],
        [
            "39.9(103.8)"
        ],
        [
            "40.4(104.7)"
        ],
        [
            "38.5(101.3)"
        ],
        [
            "37.0(98.6)"
        ],
        [
            "36.0(96.8)"
        ],
        [
            "37.0(98.6)"
        ],
        [
            "37.1(98.8)"
        ],
        [
            "37.5(99.5)"
        ],
        [
            "36.5(97.7)"
        ],
        [
            "40.4(104.7)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "32.1(89.8)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "34.3(93.7)"
        ],
        [
            "36.0(96.8)"
        ],
        [
            "35.6(96.1)"
        ],
        [
            "34.3(93.7)"
        ],
        [
            "33.0(91.4)"
        ],
        [
            "32.3(90.1)"
        ],
        [
            "32.5(90.5)"
        ],
        [
            "32.9(91.2)"
        ],
        [
            "32.7(90.9)"
        ],
        [
            "32.0(89.6)"
        ],
        [
            "33.4(92.1)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.4(79.5)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "30.0(86.0)"
        ],
        [
            "29.4(84.9)"
        ],
        [
            "28.5(83.3)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20.6(69.1)"
        ],
        [
            "21.1(70.0)"
        ],
        [
            "22.1(71.8)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "21.7(71.1)"
        ],
        [
            "23.0(73.4)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "15.0(59.0)"
        ],
        [
            "15.0(59.0)"
        ],
        [
            "13.7(56.7)"
        ],
        [
            "15.8(60.4)"
        ],
        [
            "18.8(65.8)"
        ],
        [
            "19.9(67.8)"
        ],
        [
            "18.4(65.1)"
        ],
        [
            "19.0(66.2)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "18.6(65.5)"
        ],
        [
            "17.0(62.6)"
        ],
        [
            "15.1(59.2)"
        ],
        [
            "13.7(56.7)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "6.7(0.26)"
        ],
        [
            "24.7(0.97)"
        ],
        [
            "22.4(0.88)"
        ],
        [
            "32.9(1.30)"
        ],
        [
            "208.3(8.20)"
        ],
        [
            "184.3(7.26)"
        ],
        [
            "341.5(13.44)"
        ],
        [
            "386.8(15.23)"
        ],
        [
            "239.6(9.43)"
        ],
        [
            "180.2(7.09)"
        ],
        [
            "91.9(3.62)"
        ],
        [
            "28.0(1.10)"
        ],
        [
            "1,747.3(68.79)"
        ],
        [
            "Average rainy days (≥ 1.0 mm)"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "3"
        ],
        [
            "3"
        ],
        [
            "12"
        ],
        [
            "14"
        ],
        [
            "18"
        ],
        [
            "19"
        ],
        [
            "16"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "111"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "84"
        ],
        [
            "83"
        ],
        [
            "80"
        ],
        [
            "79"
        ],
        [
            "82"
        ],
        [
            "87"
        ],
        [
            "89"
        ],
        [
            "89"
        ],
        [
            "89"
        ],
        [
            "88"
        ],
        [
            "86"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Barangays"
        ],
        [
            "Cabanatuan is administratively subdivided into 89 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Barangay"
        ],
        [
            "Population (2015)"
        ],
        [
            "Population (2020)"
        ],
        [
            "Aduas Centro (Aduas)"
        ],
        [
            "5,116"
        ],
        [
            "5,116"
        ],
        [
            "Aduas Norte"
        ],
        [
            "5,546"
        ],
        [
            "5,755"
        ],
        [
            "Aduas Sur"
        ],
        [
            "6,745"
        ],
        [
            "7,640"
        ],
        [
            "Bagong Sikat"
        ],
        [
            "4,599"
        ],
        [
            "5,272"
        ],
        [
            "Bagong Buhay"
        ],
        [
            "852"
        ],
        [
            "934"
        ],
        [
            "Bakero"
        ],
        [
            "3,073"
        ],
        [
            "3,359"
        ],
        [
            "Bakod Bayan"
        ],
        [
            "7,659"
        ],
        [
            "9,981"
        ],
        [
            "Balite"
        ],
        [
            "2,141"
        ],
        [
            "2,307"
        ],
        [
            "Bangad"
        ],
        [
            "7,596"
        ],
        [
            "7,688"
        ],
        [
            "Bantug Bulalo"
        ],
        [
            "2,390"
        ],
        [
            "2,009"
        ],
        [
            "Bantug Norte"
        ],
        [
            "8,695"
        ],
        [
            "8,686"
        ],
        [
            "Barlis"
        ],
        [
            "2,066"
        ],
        [
            "2,258"
        ],
        [
            "Barrera District (Poblacion)"
        ],
        [
            "5,374"
        ],
        [
            "5,290"
        ],
        [
            "Bernardo District (Poblacion)"
        ],
        [
            "1,233"
        ],
        [
            "1,144"
        ],
        [
            "Bitas"
        ],
        [
            "5,779"
        ],
        [
            "5,513"
        ],
        [
            "Bonifacio District (Poblacion)"
        ],
        [
            "2,917"
        ],
        [
            "3,041"
        ],
        [
            "Buliran"
        ],
        [
            "3,322"
        ],
        [
            "3,461"
        ],
        [
            "Cabu"
        ],
        [
            "4,054"
        ],
        [
            "5,182"
        ],
        [
            "Caudillo"
        ],
        [
            "1,614"
        ],
        [
            "1,920"
        ],
        [
            "Calawagan (Kalawagan)"
        ],
        [
            "1,757"
        ],
        [
            "1,836"
        ],
        [
            "Caalibangbangan"
        ],
        [
            "11,112"
        ],
        [
            "11,104"
        ],
        [
            "Camp Tinio (Campo Tinio)"
        ],
        [
            "11,449"
        ],
        [
            "11,917"
        ],
        [
            "Caridad Village"
        ],
        [
            "1,885"
        ],
        [
            "1,905"
        ],
        [
            "Cinco-Cinco"
        ],
        [
            "1,816"
        ],
        [
            "2,163"
        ],
        [
            "City Supermarket/Bayan (Poblacion)"
        ],
        [
            "172"
        ],
        [
            "95"
        ],
        [
            "Communal"
        ],
        [
            "1,451"
        ],
        [
            "1,791"
        ],
        [
            "Cruz Roja"
        ],
        [
            "4,145"
        ],
        [
            "5,354"
        ],
        [
            "Daan Sarile"
        ],
        [
            "7,191"
        ],
        [
            "8,030"
        ],
        [
            "Dalampang"
        ],
        [
            "2,057"
        ],
        [
            "2,202"
        ],
        [
            "Dicarma (Poblacion)"
        ],
        [
            "4,480"
        ],
        [
            "4,344"
        ],
        [
            "Dimasalang (Poblacion)"
        ],
        [
            "1,421"
        ],
        [
            "1,281"
        ],
        [
            "Dionisio S. Garcia (D.S.",
            "Garcia)"
        ],
        [
            "7,076"
        ],
        [
            "7,405"
        ],
        [
            "Fatima (Poblacion)"
        ],
        [
            "886"
        ],
        [
            "777"
        ],
        [
            "General Luna (Poblacion)"
        ],
        [
            "1,548"
        ],
        [
            "1,516"
        ],
        [
            "Hermogenes C. Concepcion Sr. (H. Concepcion)"
        ],
        [
            "4,039"
        ],
        [
            "4,756"
        ],
        [
            "Ibabao-Bana"
        ],
        [
            "2,313"
        ],
        [
            "2,662"
        ],
        [
            "Imelda District"
        ],
        [
            "4,001"
        ],
        [
            "3,639"
        ],
        [
            "Isla (Poblacion)"
        ],
        [
            "2,081"
        ],
        [
            "2,340"
        ],
        [
            "Kalikid Norte"
        ],
        [
            "3,344"
        ],
        [
            "3,585"
        ],
        [
            "Kalikid Sur"
        ],
        [
            "5,056"
        ],
        [
            "6,210"
        ],
        [
            "Kapitan Pepe Subdivision (Poblacion)"
        ],
        [
            "4,425"
        ],
        [
            "4,795"
        ],
        [
            "Lagare"
        ],
        [
            "2,366"
        ],
        [
            "2,715"
        ],
        [
            "Lourdes (Matungal-tungal)"
        ],
        [
            "2,457"
        ],
        [
            "2,478"
        ],
        [
            "M.S.",
            "Garcia"
        ],
        [
            "4,670"
        ],
        [
            "6,148"
        ],
        [
            "Mabini Extension"
        ],
        [
            "3,314"
        ],
        [
            "3,208"
        ],
        [
            "Mabini Homesite"
        ],
        [
            "4,317"
        ],
        [
            "5,501"
        ],
        [
            "Macatbong"
        ],
        [
            "3,378"
        ],
        [
            "3,623"
        ],
        [
            "Magsaysay District"
        ],
        [
            "4,492"
        ],
        [
            "4,242"
        ],
        [
            "Magsaysay South"
        ],
        [
            "2,800"
        ],
        [
            "2,419"
        ],
        [
            "Maria Theresa"
        ],
        [
            "930"
        ],
        [
            "969"
        ],
        [
            "Matadero (Poblacion)"
        ],
        [
            "1,123"
        ],
        [
            "1,010"
        ],
        [
            "Mayapyap Norte"
        ],
        [
            "2,288"
        ],
        [
            "2,750"
        ],
        [
            "Mayapyap Sur"
        ],
        [
            "5,473"
        ],
        [
            "5,904"
        ],
        [
            "Melojavilla (Poblacion)"
        ],
        [
            "654"
        ],
        [
            "387"
        ],
        [
            "Nabao (Poblacion)"
        ],
        [
            "730"
        ],
        [
            "703"
        ],
        [
            "Obrero"
        ],
        [
            "4,361"
        ],
        [
            "4,360"
        ],
        [
            "Padre Burgos (Poblacion)"
        ],
        [
            "324"
        ],
        [
            "328"
        ],
        [
            "Padre Crisostomo"
        ],
        [
            "4,018"
        ],
        [
            "4,298"
        ],
        [
            "Pagas"
        ],
        [
            "2,997"
        ],
        [
            "3,261"
        ],
        [
            "Palagay"
        ],
        [
            "2,221"
        ],
        [
            "2,648"
        ],
        [
            "Pamaldan"
        ],
        [
            "3,870"
        ],
        [
            "4,203"
        ],
        [
            "Pangatian"
        ],
        [
            "2,815"
        ],
        [
            "3,290"
        ],
        [
            "Patalac"
        ],
        [
            "2,349"
        ],
        [
            "2,417"
        ],
        [
            "Polilio"
        ],
        [
            "2,605"
        ],
        [
            "2,913"
        ],
        [
            "Pula"
        ],
        [
            "1,708"
        ],
        [
            "1,306"
        ],
        [
            "Quezon District (Poblacion)"
        ],
        [
            "1,949"
        ],
        [
            "1,648"
        ],
        [
            "Rizdelis (Poblacion)"
        ],
        [
            "789"
        ],
        [
            "784"
        ],
        [
            "Samon"
        ],
        [
            "1,713"
        ],
        [
            "1,806"
        ],
        [
            "San Isidro"
        ],
        [
            "4,996"
        ],
        [
            "6,277"
        ],
        [
            "San Josef Norte"
        ],
        [
            "4,442"
        ],
        [
            "4,684"
        ],
        [
            "San Josef Sur"
        ],
        [
            "6,793"
        ],
        [
            "7,785"
        ],
        [
            "San Juan Accfa (San Juan Poblacion)"
        ],
        [
            "6,687"
        ],
        [
            "8,772"
        ],
        [
            "San Roque Norte"
        ],
        [
            "1,128"
        ],
        [
            "944"
        ],
        [
            "San Roque Sur"
        ],
        [
            "1,356"
        ],
        [
            "1,314"
        ],
        [
            "Sanbermicristi (Poblacion)"
        ],
        [
            "1,331"
        ],
        [
            "1,298"
        ],
        [
            "Sangitan"
        ],
        [
            "2,015"
        ],
        [
            "1,566"
        ],
        [
            "Sangitan East"
        ],
        [
            "2,050"
        ],
        [
            "1,531"
        ],
        [
            "Santa Arcadia"
        ],
        [
            "4,598"
        ],
        [
            "5,751"
        ],
        [
            "Santo Niño"
        ],
        [
            "1,807"
        ],
        [
            "1,946"
        ],
        [
            "Sapang"
        ],
        [
            "1,382"
        ],
        [
            "1,590"
        ],
        [
            "Sumacab Este"
        ],
        [
            "4,118"
        ],
        [
            "4,517"
        ],
        [
            "Sumacab Norte"
        ],
        [
            "4,698"
        ],
        [
            "4,869"
        ],
        [
            "Sumacab South"
        ],
        [
            "4,487"
        ],
        [
            "5,776"
        ],
        [
            "Talipapa"
        ],
        [
            "1,796"
        ],
        [
            "2,498"
        ],
        [
            "Valdefuente"
        ],
        [
            "4,321"
        ],
        [
            "4,216"
        ],
        [
            "Valle Cruz"
        ],
        [
            "4,856"
        ],
        [
            "6,503"
        ],
        [
            "Vijandre District (Poblacion)"
        ],
        [
            "1,376"
        ],
        [
            "1,096"
        ],
        [
            "Villa Ofelia Subdivision (Villa Ofelia-Caridad)"
        ],
        [
            "1,319"
        ],
        [
            "1,315"
        ],
        [
            "Zuleta District (Poblacion)"
        ],
        [
            "1,558"
        ],
        [
            "1,495"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CabanatuanYearPop.±% p.a.1903 7,109—    1918 15,286+5.24%1939 46,626+5.45%1948 54,668+1.78%1960 69,580+2.03%YearPop.±% p.a.1970 99,890+3.68%1975 115,258+2.91%1980 138,298+3.71%1990 173,065+2.27%1995 201,033+2.85%YearPop.±% p.a.2000 222,859+2.23%2007 259,267+2.11%2010 272,676+1.85%2015 302,231+1.98%2020 327,325+1.58%Source: Philippine Statistics Authority"
        ],
        [
            "St. Nicholas of Tolentine Cathedral"
        ],
        [
            "Religion"
        ],
        [
            "Roman Catholicism has been the predominant religion in the city, being host to a major cathedral – the St. Nicholas of Tolentino Cathedral which serves as the seat of the bishop of the Diocese of Cabanatuan.",
            "There are three other major Catholic structures located within the city: the Mother of Perpetual Help Parish, the Carmelite Sisters Convent and the Maria Assumpta Seminary.",
            "Local chapels/parishes are also present in most barangays.",
            "The Roman Catholic Church owns the College of the Immaculate Conception, the first and only Catholic higher education institute in the city."
        ],
        [
            "The New St. Nicholas of Tolentine Cathedral in 2024"
        ],
        [
            "The New St. Nicholas of Tolentine Cathedral (popularly known as Crypta) has been under construction in Lakewood, Cabanatuan City since 1999.",
            "The cathedral will be a type of round church, similar to churches that were prominent in Nordic countries during the 11th and early 12th century.",
            "It will become the largest church in the Philippines that shall feature a park and accommodate at least 3,000 people once it is finished."
        ],
        [
            "Iglesia ni Cristo also maintains a sizable presence in Cabanatuan with its large house of worship in Barangay Zulueta that seats up to 5,000 people."
        ],
        [
            "The United Methodist Church also has many local churches with a large congregation within the city.",
            "The United Methodist Church owns Wesleyan University Philippines and the Wesleyan University of the Philippines-Cardiovascular and Medical Center."
        ],
        [
            "Other Philippine-based Christian denominations are also present in the city, such as Jesus Is Lord Church Worldwide, Jesus Miracle Crusade and Members Church of God International."
        ],
        [
            "The Islamic faith also has a presence in Cabanatuan, specifically within the districts of Imelda and Isla.",
            "Two large mosques exist in the city, with the largest located at Imelda District."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cabanatuan"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  12.20"
        ],
        [
            "2009  10.91"
        ],
        [
            "2012  10.60"
        ],
        [
            "2015  12.36"
        ],
        [
            "2018  3.12"
        ],
        [
            "2021  8.19"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Income of Cabanatuan LGU (2003-2015)"
        ],
        [
            "Cabanatuan is the economic heart of Nueva Ecija.",
            "More than 640,000 people live in its metropolitan area comprising the city and its adjacent municipalities.",
            "As a hub, many people in Nueva Ecija commute to the city during the day.",
            "This causes the city's daytime population to swell to about a million.",
            "Although Cabanatuan does not have significant manufacturing industries, its dynamic service and agricultural sectors drive the economy forward."
        ],
        [
            "The city is a vital financial center housing a good number of banks, non-bank financial institutions, and headquarters of some of the largest rural banks in Central Luzon.",
            "The Bangko Sentral ng Pilipinas (BSP) maintains a branch in the city that performs cash operations and cash administration.",
            "As of June 2018"
        ],
        [
            "Water, electricity, and telecommunications"
        ],
        [
            "Most of the water supply of the city is provided for by the Cabanatuan City Water District (CCWD), founded in 1974 through a resolution enacted by the Honorable City Council of Cabanatuan City, pursuant to PD 198.",
            "In recent years, the CCWD has entered into a JVA (Joint Venture Agreement) with PrimeWater Infrastructure Corporation, a private water service provider delivering quality services in the design of water distribution systems.",
            "It continues to provide most of the city's water supply."
        ],
        [
            "Unlike the majority of Nueva Ecija, most of the electric services in the city are provided by the Cabanatuan Electric Corporation (CELCOR).",
            "Power generation companies like FCVC and FCRV operate a 12-8 MW diesel power plant and a 10-MW solar power plant, respectively.",
            "Major telecommunication companies like Globe Telecom, PLDT-Smart Communications, and Dito Telecommunity have also their respective infrastructures and business offices in the city.",
            "Local TV and Radio Stations, such as the city's main local channel CabTV 16 and radio broadcast channel, Big Sound FM 101.5, are also present."
        ],
        [
            "Logistics and distribution"
        ],
        [
            "The city is also a distribution and logistics center for goods and commodities; a number of distribution warehouses and sales offices of various companies serve the whole of Nueva Ecija and parts of neighboring provinces.",
            "The NFA warehouses in the city play an important role in regulating Nueva Ecija's burgeoning rice industry.",
            "The city acts as a trading place or bagsakan of agricultural produce from the surrounding farming communities."
        ],
        [
            "Indicators reflect Cabanatuan's economic achievements in the past few years.",
            "Residential buildings and subdivisions, numbering more than a hundred, are taking up lands on the fringes of the downtown."
        ],
        [
            "Real estate and investment"
        ],
        [
            "Camella Nueva Ecija"
        ],
        [
            "The presence of big land developers such as Santa Lucia Realty, Vista Land, and Ayala Land ensures competition and quality in the new suburban homes.",
            "New commercial buildings are springing up in the CBD and along Maharlika Highway at an average of seventy-five per year."
        ],
        [
            "Vista Estates has recently planned to build Verterra Residences, Nueva Ecija's first condominium development and one of the Philippines' first \"Urban Green Hubs,\" near Camella Cabanatuan."
        ],
        [
            "Cabanatuan is gradually becoming a major investment hub and is considered one of the most competitive cities for doing business in the country.",
            "Investors in banking, real estate, retail and other business and industrial enterprises are similarly drawn to the city because of its adequate infrastructure and investor support services."
        ],
        [
            "Avida Residences Cabanatuan"
        ],
        [
            "Its continuing urbanization is also luring investors into its suburban municipalities as well."
        ],
        [
            "To further explore its economic potentials, Cabanatuan is seeking to have a share of the IT-BPO boom.",
            "The first call center in Nueva Ecija was successfully established in the city in 2008.",
            "The city government is providing prospective investors with fast business applications processing, low business taxes, and other incentives to attract big-ticket projects."
        ],
        [
            "In 2015, the city's total assets amounted to PHP 3.719 billion and the total income reached PHP 1.696 billion."
        ],
        [
            "Shopping centers"
        ],
        [
            "Cabanatuan City serves as a major shopping hub in the province and other nearby localities."
        ],
        [
            "Major Philippine mall chains such as Robinsons Malls, SM Supermalls, Walter Mart, and Puregold Price Club, Inc. have established their presence in the city.",
            "Currently, major shopping centers in the city include: NE Pacific Mall; SM Megacenter; Robinsons Townville Cabanatuan; SM City Cabanatuan which is built as a regional SM Supermall with amenities such as a roof park, an indoor park, and a large-screen cinema; AllHome, and Waltermart.",
            "Cabanatuan has also multiple grocery and department stores including a chain of Savemore Supermarkets, Puregold Supermarkets, NE Supermarkets, and the warehouse club store, S&R.",
            "The city has also numerous hardware centers like Ace Hardware, Citi Hardware, and Wilcon Depot."
        ],
        [
            "In terms of future developments, Robinsons Land Corp. expressed plans for their second mall in the city.",
            "The plan has since received backlash from groups that were against the decision to build it in the site of Nueva Ecija's Old Provincial Capitol."
        ],
        [
            "Cabanatuan is also building a new main public market that is set to open in 2024, after its old public market burnt down in April 2020.",
            "The new Magsaysay Market in Brgy.",
            "Sangitan is also scheduled to open in 2024."
        ],
        [
            "Two temporary public markets were built in Melencio Street Ext., Brgy.",
            "Kapitan Pepe and Brgy.",
            "San Isidro, with the former planned to be converted into the city's convention center."
        ],
        [
            "No."
        ],
        [
            "Name"
        ],
        [
            "Opening Date"
        ],
        [
            "Location"
        ],
        [
            "Remarks"
        ],
        [
            "Image"
        ],
        [
            "1"
        ],
        [
            "All Home"
        ],
        [
            "Cabanatuan"
        ],
        [
            "27 November 2020"
        ],
        [
            "Brgy.",
            "Mabini Extension, Cabanatuan City"
        ],
        [
            "First AllHome branch in Cabanatuan and the entire province of Nueva Ecija."
        ],
        [
            "2"
        ],
        [
            "NE Mall (NE Supermarket)"
        ],
        [
            "–"
        ],
        [
            "Brgy.",
            "Zulueta, Cabanatuan City"
        ],
        [
            "First mall in Nueva Ecija."
        ],
        [
            "NE Mall"
        ],
        [
            "3"
        ],
        [
            "NE Pacific Mall"
        ],
        [
            "Apr 1996"
        ],
        [
            "Brgy.",
            "H. Concepcion Sr., Maharlika Highway, Cabanatuan City"
        ],
        [
            "First full-service mall in Nueva Ecija; houses many restaurants, amenities, and also a movie theater that has three cinemas."
        ],
        [
            "NE Pacific Mall"
        ],
        [
            "4"
        ],
        [
            "Puregold Cabanatuan"
        ],
        [
            "8 October 2011"
        ],
        [
            "Brgy.",
            "Bernardo District, Maharlika Highway, Cabanatuan City."
        ],
        [
            "First Puregold supermarket in Nueva Ecija."
        ],
        [
            "Puregold Cabanatuan"
        ],
        [
            "5"
        ],
        [
            "Robinsons Townville Cabanatuan"
        ],
        [
            "4 February 2009"
        ],
        [
            "Brgy.",
            "H. Concepcion Sr., Maharlika Highway, Cabanatuan City."
        ],
        [
            "First Robinsons mall in Nueva Ecija.",
            "Originally named \"Robinsons Cabanatuan,\" the mall was rebranded as \"Robinsons Townville Cabanatuan\", referring to the RRHI's (the mall's operator) own community mall-formatted that it was the sister counterpart of Robinsons Malls."
        ],
        [
            "Robinsons Townville Cabanatuan"
        ],
        [
            "6"
        ],
        [
            "SM City Cabanatuan"
        ],
        [
            "9 October 2015"
        ],
        [
            "Brgy.",
            "H. Concepcion Sr., Maharlika Highway, Cabanatuan City."
        ],
        [
            "The second largest mall in Central Luzon, boasting a total retail area of 154,020 square meters.",
            "The five-story mall also includes two Sky Gardens, a Garden Park, a Roof Park, as well as a large-format theater capable for 3D movies and stadium-type seating similar to IMAX housing up to 507 guests."
        ],
        [
            "SM City Cabanatuan"
        ],
        [
            "7"
        ],
        [
            "SM Megacenter Cabanatuan"
        ],
        [
            "25 April 2015"
        ],
        [
            "Melencio corner General Tinio Streets, Brgy.",
            "San Roque Norte, Cabanatuan City."
        ],
        [
            "First SM supermall in Nueva Ecija.",
            "The four-story mall was acquired in 2013 from the CHAS Realty and Development Corp before being developed into a SM mall."
        ],
        [
            "8"
        ],
        [
            "S&R Membership Shopping Cabanatuan"
        ],
        [
            "6 June 2018"
        ],
        [
            "Brgy.",
            "H. Concepcion Sr., Cabanatuan City."
        ],
        [
            "First S&R in Cabanatuan."
        ],
        [
            "9"
        ],
        [
            "Waltermart Cabanatuan"
        ],
        [
            "11 December 2015"
        ],
        [
            "Brgy.",
            "Dicarma, Maharlika Highway, Cabanatuan City."
        ],
        [
            "First Waltermart branch in Cabanatuan."
        ],
        [
            "Hotels, restaurants, and leisure"
        ],
        [
            "Harvest Hotel"
        ],
        [
            "The city has numerous accommodation and lodging establishments such as hotels, motels, inns, and resorts.",
            "In recent years, the local food scene in the city has experienced growth.",
            "Several restaurants, fast-food chains, bakery and coffee shops are also located in the city.",
            "Cabanatuan's food scene offers a variety of culinary choices such as local Filipino delicacies, Japanese cuisine, Korean cuisine, Indian cuisine and others.",
            "Food joints have also been established in Kapitan Pepe Subdivision, such as the Food Park."
        ],
        [
            "Cabanatuan also houses various resorts and waterparks, such as BL Resort and Hotel, Acropolis North, and Lamarang Hotel and Resort Resort."
        ],
        [
            "Transportation"
        ],
        [
            "Public transportation"
        ],
        [
            "Cabanatuan City Central TerminalCabanatuan City is a major hub of land transportation services in Central Luzon.",
            "The city has many bus companies operating provincial and regional routes, with the Cabanatuan Central Transport Terminal serving as the terminus."
        ],
        [
            "However, due to a recent boycott against SM (the private owner of the Cabanatuan Central Transport Terminal), bus companies like Baliwag Transit, Inc. and Five Star are currently departing and receiving passengers in their own garages located at Brgy.",
            "Zulueta instead."
        ],
        [
            "Much of the city's population rely on public transportation such as tricycles and jeeps to get around the city.",
            "The jeepney was patterned after U.S. Army jeeps and have been in use since the years immediately following World War II.",
            "Almost all types of public road transport plying Cabanatuan are privately owned and operated under government franchise."
        ],
        [
            "Jeepney, van, and mini-bus operators serve routes within the province with some reaching as far to Dingalan, Baler, and Dilasag in Aurora, Olongapo City, San Fernando, and Dau in Pampanga, Mariveles and Balanga in Bataan, Baguio in Benguet, Dagupan, and Tarlac City.",
            "Tricycle operators serve local routes in the city and sometimes to nearby towns of Santa Rosa and Talavera.Unloading area at the Cabanatuan City Central TerminalIntercity and interprovincial buses from Manila serve the city, and are usually operated by Baliwag Transit, Inc., Five Star, Victory Liner, Genesis Transport Service Inc., GV Florida Transport, ES Transport Inc., and Pangasinan Solid North."
        ],
        [
            "Cabanatuan is accessible via the major expressway networks such as NLEX (from either Bulacan or Pampanga), SCTEX (from either Pampanga or Tarlac) and TPLEX (from Tarlac or Pangasinan).",
            "Then, the main access roads leading to Cabanatuan are the Pan-Philippine Highway, Santa Rosa –Tarlac Road, and the Nueva Ecija – Aurora Road."
        ],
        [
            "Road network"
        ],
        [
            "National highway"
        ],
        [
            "Maharlika Highway - Cagayan Valley Road in Cabanatuan"
        ],
        [
            "Maharlika Highway (or Pan-Philippine Highway) is the main highway traversing Cabanatuan where most vehicles going to Cagayan Valley pass through.",
            "The city's portion of the Maharlika Highway starts from the city's southernmost barangay, Brgy.",
            "Sumacab Este, and ends at Brgy.",
            "Caalibangbangan."
        ],
        [
            "Another highway that traverses Cabanatuan is the Nueva Ecija - Aurora Road.",
            "The highway links Cabanatuan to Baler, Aurora, passing through rural towns in eastern Nueva Ecija."
        ],
        [
            "Arterial Roads"
        ],
        [
            "Burgos Avenue and Del Pilar Street both serve as the city's main thoroughfare in the downtown area.",
            "Other major roads include the General Tinio and Rizal Streets that run through the city proper in an east–west direction; Mabini Street, where two of the city's three universities are situated, and the Circumferential Road that connects the downtown area to the Kapitan Pepe residential district."
        ],
        [
            "Cabanatuan Circumferential Road - Maharlika Highway Junction"
        ],
        [
            "Cabanatuan was previously served by the Manila Railroad Company in 1905 through the Balagtas – Cabanatuan line which was abandoned after the war because scavengers looted pieces of the rail tracks.",
            "Rail service was resumed in 1969 after the rehabilitation of the rail tracks as mandated by a government order.",
            "The service was again abandoned in the 1980s.",
            "The old Cabanatuan Railway Station is located at Barangay General Luna and is converted to a daycare center with the original structure remaining."
        ],
        [
            "Expressways and Toll Roads"
        ],
        [
            "Central Luzon Link Expressway"
        ],
        [
            "Cabanatuan shall also be serviced by a future expressway once completed, the Central Luzon Link Expressway (SCTEX-TPLEX to San Jose City).",
            "It will shorten the usual travel time between the neighboring provinces and Cabanatuan City, also stimulating the economy of the towns that the carriageway will pass through as a direct consequence.",
            "Central Luzon Link Expressway from Tarlac City to San Juan, Aliaga was opened in 2024.",
            "It is still unknown when the said project will be completed."
        ],
        [
            "Bypass Roads"
        ],
        [
            "Felipe Vergara Highway in 2014"
        ],
        [
            "During the early 2000s to decongest the Pan-Philippine Highway and to spur new developments outside the downtown area, two bypass roads were constructed in Cabanatuan: the 10.3-kilometer Felipe Vergara Highway provides a direct route to Cagayan Valley, and the 12.35-kilometer Emilio Vergara Highway which links Santa Rosa to Nueva Ecija - Aurora Road, avoiding traffic bottleneck along Pan-Philippine Highway.",
            "There are present efforts being made to extend the Emilio Vergara Highway to Talavera."
        ],
        [
            "Two flyovers are currently being constructed to ease prevailing traffic congestions in the city."
        ],
        [
            "The 278-meter Nueva Ecija - Aurora Road - Emilio Vergara Highway Flyover will be an extension of the Emilio Vergara Highway towards the Leopoldo Vergara Bridge, and will end at the boundary of Cabanatuan at Talavera, near the partially-completed CLLEX."
        ],
        [
            "The 330-meter Emilio Vergara Highway - Lakewood Intersection Flyover aims to reduce the traffic bottleneck in the Lakewood Avenue - Emilio Vergara Highway intersection."
        ],
        [
            "Another flyover will also be built from Jollibee Diversion Road to Emilio Vergara Highway in the future to alleviate traffic conditions in the Maharlika Highway."
        ],
        [
            "Cabanatuan is also building major dike roads that shall serve as access roads to far-flung barangays in the city, such as Barangay Samon and Barangay Caudillo."
        ],
        [
            "City Traffic"
        ],
        [
            "Infrastructure improvements by the administration are ongoing.",
            "A Unified Command Center (UCC) for the city's traffic light system is currently under construction at 25 major intersections.",
            "Separate tricycle lanes are also present within the perimeter of the Public Market.",
            "Road extension, and road widening of the Emilio Vergara Highway from two to six lanes is nearing its completion."
        ],
        [
            "Constructions and rehabilitations of major bridges are also ongoing, such as the second Felipe Vergara, Valdefuente, and Cabu bridges, to ease traffic.",
            "The widening of all city and arterial roads from one- to two-lane highway to three-lane highway is also being considered."
        ],
        [
            "Tourism"
        ],
        [
            "Freedom Park"
        ],
        [
            "Gen. Antonio Luna Monument"
        ],
        [
            "Historical sites found in the city include:"
        ],
        [
            "Cabanatuan Railroad Station is found in Barangay General Luna.",
            "It was built in early 1927 as the terminus of the now-abandoned Balagtas-Cabanatuan line.",
            "The building has since been converted into a barangay civic center and day care center, with the original structure preserved."
        ],
        [
            "Camp Pangatian (Prisoner of War Memorial Shrine) (Now Cabanatuan American Memorial), began as a military training camp for twenty years until converted into a concentration camp for allied prisoners of war during the Japanese occupation.",
            "A popular tourist destination among war veterans by way of the WWII Veteran's Homecoming Program.",
            "Camp Pangatian's liberation of World War II American prisoners of war held by the Japanese forces in January 1945 was the most successful rescue operation ever executed by the American military aided by the Filipino guerillas who were fighting the invaders.",
            "That tactical operation was immortalized in the movie The Great Raid."
        ],
        [
            "Freedom Park is a two-hectare provincial park located in front of the Old Provincial Capitol of Nueva Ecija, civic spaces as well as various monuments and memorials can be found inside the park which includes a monument dedicated to General Antonio Luna who was assassinated in the nearby Cathedral of San Nicolas de Tolentino."
        ],
        [
            "Gen. Antonio Luna Statue and Marker in found in Plaza Lucero.",
            "This statue of Philippine hero General Antonio Luna astride a horse stands at the plaza in front of the cathedral on the exact spot where the brave general was assassinated in 1899 in the city that adopted him subsequently.",
            "In May 2022, alongside Plaza Lucero, the statue was renovated and re-opened to the public."
        ],
        [
            "Old Provincial Capitol of Nueva Ecija is located along Burgos Avenue.",
            "The old provincial capitol was designed by prominent American architect William E. Parsons who also designed government buildings in Manila, Cebu and Laguna during the American Colonial Period.",
            "The old edifice has since been renovated and expanded."
        ],
        [
            "Cabanatuan Eco Park is a future city project that will convert the Valle Cruz dumpsite into a ten-hectare eco park.",
            "Government centers, including the new Cabanatuan City Hall, are to be built within the area."
        ],
        [
            "Festivals and celebrations celebrated in Cabanatuan include:"
        ],
        [
            "Banatu Festival celebrates its founding anniversary as a chartered city.",
            "From its humble beginning in 2015, \"Banatu Festival\" aims to showcase the history, culture, talent, beauty and craftsmanship of Cabanatueños."
        ],
        [
            "Longganisa Festival one of the activities in \"Banatu Festival\" and is held in the vicinity of the public market along Paco Roman Street.",
            "Apart from the local meat traders and customers, tourists from nearby towns also join the celebration.",
            "Highlights of this festival are the cooking contests and the different preparations for longganisa (native sausage like \"batutay\", \"longganisang bawang\" and \"longganisang matamis\"), including spaghetti and “binagoongan”."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Panglungsod"
        ],
        [
            "Cabanatuan City's current seat of government, the city hall, is located at Barangay San Josef Sur.",
            "The local government structure is composed of one mayor, one vice mayor, and ten councilors.",
            "Each official is elected publicly to a 3-year term and can be re-elected up to 3 terms in succession.",
            "The day-to-day administration of the city is handled by the city administrator."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Cabanatuan City Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative(3rd Legislative District of the province of Nueva Ecija)"
        ],
        [
            "Rosanna V. Vergara"
        ],
        [
            "Chief Executive of the City of Cabanatuan"
        ],
        [
            "Mayor Myca Elizabeth R. Vergara"
        ],
        [
            "Presiding Officer of the City Council of Cabanatuan"
        ],
        [
            "Vice Mayor Julius Cesar V. Vergara"
        ],
        [
            "Members of the City Council"
        ],
        [
            "Joselito C. Roque"
        ],
        [
            "Prudencio B. Garcia Jr."
        ],
        [
            "Oscar M. Mendoza"
        ],
        [
            "Aldwin Joseph V. Diaz"
        ],
        [
            "Froilan M. Valino"
        ],
        [
            "Marius A. Garcia"
        ],
        [
            "Medel R. Seeping"
        ],
        [
            "Ruben A. Ilagan V"
        ],
        [
            "Rosendo D. del Rosario Jr."
        ],
        [
            "Epifanio G. Posada"
        ],
        [
            "Education"
        ],
        [
            "Nueva Ecija University of Science and Technology"
        ],
        [
            "Wesleyan University (Philippines)"
        ],
        [
            "Cabanatuan is a regional educational hub.",
            "The city more than forty higher education institutions including four universities, a science high school, more than fifty public and private high schools, and more than a hundred public and private primary schools."
        ],
        [
            "Some prominent schools, universities and colleges within the city include:"
        ],
        [
            "College of the Immaculate Conception"
        ],
        [
            "ABE International College"
        ],
        [
            "Acatech Aviation College"
        ],
        [
            "AMA Computer College"
        ],
        [
            "Asian College of Science and Technology"
        ],
        [
            "Asian Institute of Computer Studies (AICS)"
        ],
        [
            "Asian Institute of E-commerce (AIE) Cabanatuan"
        ],
        [
            "Araullo University Main Campus"
        ],
        [
            "Araullo University South Campus"
        ],
        [
            "Cabanatuan East Central School"
        ],
        [
            "Cabanatuan City Senior High School"
        ],
        [
            "Camp Tinio National High School"
        ],
        [
            "Cesar E. Vergara Memorial High School"
        ],
        [
            "College for Research & Technology"
        ],
        [
            "College of the Immaculate Conception"
        ],
        [
            "Datamex Institute of Computer Technology - Cabanatuan City"
        ],
        [
            "Dr. Gloria Lacson Foundation Colleges"
        ],
        [
            "Eduardo L. Joson Memorial College"
        ],
        [
            "First Asian International Systems College"
        ],
        [
            "Good Samaritan Colleges"
        ],
        [
            "Great Values Learning Center"
        ],
        [
            "Honorato C. Perez Sr. Memorial Science High School"
        ],
        [
            "La Fortuna College"
        ],
        [
            "Lazaro Francisco Integrated School"
        ],
        [
            "Little Merry Hearts Montessori Center"
        ],
        [
            "Maria Assumpta Seminary"
        ],
        [
            "Midway Maritime Foundation"
        ],
        [
            "M.V.",
            "Gallego Foundation Colleges"
        ],
        [
            "Nueva Ecija University of Science and Technology Sumacab Main Campus"
        ],
        [
            "Nueva Ecija University of Science and Technology General Tinio Street Campus"
        ],
        [
            "North Central Academy for Culinary Arts"
        ],
        [
            "Our Lady of Fatima University"
        ],
        [
            "Philippine Statesman College"
        ],
        [
            "Provincial Manpower Training Center"
        ],
        [
            "St. Augustine Foundation College"
        ],
        [
            "St. Bernadette Montessori Academy"
        ],
        [
            "St. John Regis Health Care Institute Inc."
        ],
        [
            "Skill Power Institute"
        ],
        [
            "Wesleyan University (Philippines)"
        ],
        [
            "Healthcare"
        ],
        [
            "Many hospitals and clinics can be found in the city, most are private and with modern facilities which made Cabanatuan City the center for medical operations and research in the province.",
            "Most residents of the province go to Cabanatuan for their check-ups and appointments in hospitals and clinics within the city."
        ],
        [
            "There are three (3) notable public and six (5 fully constructed, 1 under construction) private hospitals in Cabanatuan City:"
        ],
        [
            "No."
        ],
        [
            "Name"
        ],
        [
            "Location"
        ],
        [
            "Remarks"
        ],
        [
            "Image"
        ],
        [
            "1"
        ],
        [
            "Dr. Paulino J. Garcia Memorial Research and Medical Center (PJGMRMC)"
        ],
        [
            "Brgy.",
            "Mabini Extension, Cabanatuan City"
        ],
        [
            "It is the 400-bed modern multi-story regional health center of Cabanatuan City.",
            "It was opened to the public on December 15, 1930, with a capacity of thirty (30) beds.",
            "The hospital has since been designated as the region's specialty center for heart and lung, kidney transplant, trauma, brain, orthopedic, physical medicine and rehabilitation, eye, and reproductive health."
        ],
        [
            "The hospital's bed capacity is planned to be increased to 1000 beds in the near future."
        ],
        [
            "2"
        ],
        [
            "Eduardo L. Joson Memorial Hospital (Nueva Ecija Provincial Hospital)"
        ],
        [
            "Maharlika Highway, Brgy.",
            "Daang Sarile, Cabanatuan City"
        ],
        [
            "It is a government-owned hospital located along the Maharlika Highway, Brgy.",
            "Daang Sarile."
        ],
        [
            "3"
        ],
        [
            "Dr. M.V.",
            "Gallego Cabanatuan City General Hospital"
        ],
        [
            "Maharlika Highway, Brgy.",
            "Imelda, Cabanatuan City"
        ],
        [
            "It is a local government-funded hospital that offers health services mostly to the people of Cabanatuan City, Nueva Ecija, and to some extent to the neighboring municipalities."
        ],
        [
            "It has since undergone rehabilitation to add more modern facilities and cater to the growing healthcare of the city."
        ],
        [
            "4"
        ],
        [
            "Immaculate Conception Medical Center of Central Luzon (ICMC)"
        ],
        [
            "Circumferential Road, Brgy.",
            "San Juan Accfa, Cabanatuan City"
        ],
        [
            "A private-owned hospital located in Circumferential Road, Brgy.",
            "San Juan Accfa.",
            "It was established by a group of doctors and businessmen-investors and was opened on September 8, 2007."
        ],
        [
            "5"
        ],
        [
            "Nueva Ecija Doctors Hospital"
        ],
        [
            "Maharlika Highway, Brgy.",
            "Sumacab Este, Cabanatuan City"
        ],
        [
            "A private hospital started by a group of 22 American-trained doctors, headed by Dr. Rodrigo Cuizon, who arrived in Nueva Ecija during the 1960s to settle and practice their profession at Cabanatuan City."
        ],
        [
            "The hospital has since been undergoing renovations to add more facilities."
        ],
        [
            "Nueva Ecija Doctors Hospital"
        ],
        [
            "6"
        ],
        [
            "Good Samaritan General Hospital (GoodSam)"
        ],
        [
            "Burgos Avenue, Cabanatuan City"
        ],
        [
            "It is a private hospital part of the network of hospitals of Mt.",
            "Grace Hospitals (MGHI)."
        ],
        [
            "At present, GoodSam has an eye and laser center, a fresenius renal center and major components of a secondary hospital in both Cabanatuan and Gapan, an out-patient department, emergency room, imaging center, operating and delivery room complex and intensive care unit.",
            "(ICU)"
        ],
        [
            "7"
        ],
        [
            "Premiere Medical Center"
        ],
        [
            "Maharlika Highway, Brgy.",
            "Daan Sarile, Cabanatuan City"
        ],
        [
            "A private hospital that has been serving the city's residents since 1997."
        ],
        [
            "8"
        ],
        [
            "Wesleyan University General Hospital and Cardiovascular Center"
        ],
        [
            "Brgy.",
            "Mabini Extension, Cabanatuan City, Nueva Ecija"
        ],
        [
            "Non-stock, non-profit hospital owned and operated by the United Methodist Church through the Wesleyan University – Philippines (WU–P)."
        ],
        [
            "It is located within the campus of Wesleyan University - Philippines."
        ],
        [
            "Wesleyan University Medical Center"
        ],
        [
            "9"
        ],
        [
            "Cabanatuan Doctors Medical Center (CMC)"
        ],
        [
            "Emilio Vergara Highway, Brgy.",
            "Valle Cruz, Cabanatuan City"
        ],
        [
            "An under-construction private hospital situated along Emilio Vergara Highway, Brgy.",
            "Valle Cruz."
        ],
        [
            "Notable personalities"
        ],
        [
            "Kathryn Bernardo"
        ],
        [
            "Some of the notable personalities whose roots originated in Cabanatuan include:"
        ],
        [
            "Kathryn Bernardo, Filipina actress, singer and dancer.",
            "She is best known for her role as Mara in the primetime Filipino drama, Mara Clara and her lead roles in The Hows of Us and Hello, Love, Goodbye, two of the highest-grossing Filipino films of all time."
        ],
        [
            "Paolo Ballesteros, Filipino actor, TV host and model.",
            "He is also a host of Eat Bulaga."
        ],
        [
            "Vic Sotto, multi-awarded Filipino actor, television host, comedian.",
            "He was the former vocalist for the band VST & Company, played a lead role in the sitcom Iskul Bukol and is a pioneer host of Eat Bulaga."
        ],
        [
            "Willie Revillame, television host, actor, comedian, recording artist and businessman.",
            "Known for hostingPaolo Ballesterosthe variety shows Wowowee at ABS-CBN, and Wowowin at GMA Network."
        ],
        [
            "Heber Bartolome, Filipino folk and folk rock singer, songwriter, composer, poet, guitarist, bandurria player, bluesman, and painter."
        ],
        [
            "Manuel Chua, Filipino male model and actor."
        ],
        [
            "Samboy de Leon, Filipino professional basketball player for TNT KaTropa of the Philippine Basketball Association."
        ],
        [
            "Nestor de Villa, Filipino actor frequently cast in musical films and often paired with on-screen partner Nida Blanca.",
            "His dancing talent led some people to call him the \"Fred Astaire of the Philippines\"."
        ],
        [
            "Frederick Kriekenbeek, exorcist and priest in Cebu."
        ],
        [
            "John Paul Lizardo, Filipino taekwondo Asian Games bronze medalist, actor and commercial model."
        ],
        [
            "Ameurfina Melencio-Herrera, Filipino lawyer and jurist who served as Associate Justice of the Supreme Court of the Philippines from 1979 to 1992.",
            "Herrera is a granddaughter of Emilio Aguinaldo."
        ],
        [
            "Kurt Perez, former child actor."
        ],
        [
            "Yen Santos, Filipina actress and dancer.",
            "A part of ABS-CBN's Star Magic, she has appeared in Growing Up, Pure Love and Dream Dad."
        ],
        [
            "Xilhouete, drag performer, Drag Race Philippines (Season 1) contestant"
        ],
        [
            "Sister cities"
        ],
        [
            "Cabanatuan has the following sister cities:"
        ],
        [
            " Angeles City"
        ],
        [
            " Tarlac City, Tarlac"
        ],
        [
            " Davao City, Davao Del Sur"
        ],
        [
            " Cebu City, Cebu"
        ],
        [
            " San Fernando, Pampanga"
        ],
        [
            " Gapan, Nueva Ecija"
        ],
        [
            " Aliaga, Nueva Ecija"
        ],
        [
            " Calamba, Laguna"
        ],
        [
            " Taguig, Metro Manila"
        ],
        [
            " Baguio, Benguet"
        ],
        [
            " Quezon City, Metro Manila"
        ],
        [
            " Manila, Metro Manila"
        ],
        [
            " San Jose, Nueva Ecija"
        ],
        [
            " Santa Rosa, Nueva Ecija"
        ],
        [
            " Santa Rosa, Laguna"
        ],
        [
            " Subic, Zambales"
        ],
        [
            " Olongapo, Zambales"
        ],
        [
            " Balanga, Bataan"
        ],
        [
            " Baliwag, Bulacan"
        ],
        [
            " Tuguegarao, Cagayan"
        ],
        [
            " Dagupan, Pangasinan"
        ],
        [
            " Lucena, Quezon"
        ],
        [
            "References"
        ],
        [
            "^  City of Cabanatuan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Cabanatuan City remains the undisputed \"Tricycle Capital of the Phili…\".",
            "Archived from the original on January 18, 2014."
        ],
        [
            "^ History of Cabanatuan City"
        ],
        [
            "^ [https://tourismnuevaecija.weebly.com/uploads/5/2/4/1/52413881/history_of_nueva_ecija.doc"
        ],
        [
            "History of Nueva Ecija]"
        ],
        [
            "^ a b \"About\"."
        ],
        [
            "^ \"An Act to Create the Municipality of General Mamerto Natividad in the Province of Nueva Ecija\".",
            "LawPH.com.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ \"An act creating the City of Cabanatuan\".",
            "LawPH.com.",
            "Retrieved April 9, 2011."
        ],
        [
            "^ \"Archived copy\" (PDF).",
            "Archived from the original (PDF) on August 25, 2013.",
            "Retrieved June 23, 2014.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ Bernal, Buena.",
            "\"SC issues TRO on Cabanatuan's Jan 25 plebiscite\".",
            "Rappler."
        ],
        [
            "^ \"SC: All Nueva Ecija voters should take part in plebiscite for Cabanatuan as HUC\".",
            "GMA News."
        ],
        [
            "^ Elmo Roque (February 10, 2015).",
            "\"'Highly-urbanized' Cabanatuan still unratified\".",
            "punto.com.ph.",
            "Punto!",
            "Central Luzon.",
            "Archived from the original on March 17, 2015.",
            "Retrieved March 17, 2015."
        ],
        [
            "^ ARISE Case Studies.",
            "\"SM Cabanatuan - ARISE Case Studies in Disaster Risk Management\" (PDF).",
            "Prevention Web.",
            "Retrieved June 19, 2022."
        ],
        [
            "^ Galang, Marilyn.",
            "\"Several Karding-hit areas in N. Ecija still without power\".",
            "www.pna.gov.ph.",
            "Retrieved January 26, 2023."
        ],
        [
            "^ Manahan, Jervis (September 6, 2022).",
            "\"Nueva Ecija reels from Karding's wrath\".",
            "ABS-CBN News."
        ],
        [
            "^ \"Cabanatuan City, Nueva Ecija Climatological Normal Values\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on October 8, 2018.",
            "Retrieved October 8, 2018."
        ],
        [
            "^"
        ],
        [
            "\"Cabanatuan, Nueva Ecija Climatological Normal Values 1991–2020\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on March 2, 2022.",
            "Retrieved May 23, 2022."
        ],
        [
            "^ \"Cabanatuan, Nueva Ecija Climatological Extremes\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on March 7, 2022.",
            "Retrieved May 23, 2022."
        ],
        [
            "^ \"Province: Nueva Ecija\".",
            "PSGC Interactive.",
            "Makati, Philippines: National Statistical Coordination Board.",
            "Archived from the original on October 21, 2013.",
            "Retrieved October 21, 2013."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Nueva Ecija\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"SM Prime redesigns to expand SM City Cabanatuan | GlobalPost\".",
            "Archived from the original on February 2, 2014.",
            "Retrieved January 18, 2014."
        ],
        [
            "^ \"Banking Statistics - Trust and Other Fiduciary Business and Other Management Activities - Universal/Commercial Banks\".",
            "www.bsp.gov.ph."
        ],
        [
            "^ \"Makati, Cabanatuan, Tagbilaran are RP's best cities to live in | Newsbreak | Independent Journalism\".",
            "Archived from the original on February 2, 2014.",
            "Retrieved January 18, 2014."
        ],
        [
            "^ \"CCWD - Website\".",
            "www.ccwd.com.ph.",
            "Retrieved June 19, 2022."
        ],
        [
            "^ \"SM Prime\".",
            "smprime.com.",
            "January 12, 2021."
        ],
        [
            "^ \"Municipality of Cabanatuan | Historical Data\".",
            "Archived from the original on October 24, 2017.",
            "Retrieved December 22, 2016."
        ],
        [
            "^ a b Magpayo, Prudencio E. (December 7, 2014).",
            "\"Cabanatuan enjoys economic boom - Prudencio E. Magpayo\".",
            "BusinessMirror."
        ],
        [
            "^ \"Archived copy\".",
            "Archived from the original on August 17, 2016.",
            "Retrieved July 4, 2016.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ \"SM City Cabanatuan is now open\".",
            "Philippine Daily Inquirer.",
            "www.pressreader.com.",
            "October 9, 2015.",
            "Retrieved April 7, 2024."
        ],
        [
            "^ \"Robinsons bullish, plans 10 new malls - the Standard\".",
            "Archived from the original on December 10, 2015.",
            "Retrieved October 27, 2015."
        ],
        [
            "^ Galang, Armand (April 1, 2020).",
            "\"Cabanatuan supermarket destroyed by fire\".",
            "INQUIRER.net.",
            "Retrieved May 17, 2022."
        ],
        [
            "^ Cabanatuan City Supermarket at Magsaysay Public Market | Alamin kung ano ang mga dapat abangan sa ating dalawang bagong palengke sa Lungsod ng Cabanatuan, ang Cabanatuan City Supermarket at Magsaysay Public Market.",
            "| By City Government of Cabanatuan | Facebook, retrieved January 27, 2024"
        ],
        [
            "^ Neil (November 29, 2020).",
            "\"AllHome sees improved sales as it adds stores\".",
            "BusinessWorld Online.",
            "Retrieved June 26, 2022."
        ],
        [
            "^ Inquirer, Philippine Daily (April 26, 2015).",
            "\"Cabanatuan home to 51st mall of firm\".",
            "INQUIRER.net.",
            "Retrieved June 26, 2022."
        ],
        [
            "^ Radyo Natin Guimba (DWTC 105.3 FM) (May 21, 2024).",
            "Terminal ng Bus nasa Zulueta Street, Cabanatuan City wala na sa SM.",
            "Retrieved May 28, 2024 – via YouTube.",
            "{{cite AV media}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ Cordero, Ted (July 22, 2022).",
            "\"DPWH: Central Luzon Link Expressway now 96% complete\".",
            "GMA News Online.",
            "Retrieved July 24, 2022."
        ],
        [
            "^ \"The District Bulletin - Volume VII, Issue No.",
            "1, January to March 2020 by dpwhne2dio - Issuu\".",
            "issuu.com.",
            "April 30, 2020.",
            "Retrieved May 3, 2022."
        ],
        [
            "^ \"City of Ilagan, Election Results 2022\".",
            "COMELEC.",
            "Rappler.com.",
            "Retrieved February 25, 2023."
        ],
        [
            "^ \"City of Ilagan Political Structure\".",
            "City Government of Ilagan.",
            "cityofilagan.com.",
            "Retrieved February 25, 2023."
        ],
        [
            "^ \"Duterte signs 4 laws establishing, upgrading hospitals\".",
            "www.pna.gov.ph.",
            "Retrieved May 6, 2022."
        ],
        [
            "^ \"Immaculate Conception Medical Center\".",
            "www.icmcne.com.",
            "Retrieved May 6, 2022."
        ],
        [
            "^ \"NUEVA ECIJA DOCTORS HOSPITAL, INC\".",
            "www.nedhi.com.ph.",
            "Retrieved May 6, 2022."
        ],
        [
            "External links"
        ],
        [
            " Cabanatuan travel guide from Wikivoyage"
        ],
        [
            " Media related to Cabanatuan at Wikimedia Commons"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Cabanatuan"
        ],
        [
            "Talavera / Gen. Mamerto Natividad"
        ],
        [
            "Palayan"
        ],
        [
            "Aliaga"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Laur"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Articles Related to Cabanatuan"
        ],
        [
            "vte Province of Nueva EcijaPalayan (capital)  Cabanatuan (largest city)Municipalities"
        ],
        [
            "Aliaga"
        ],
        [
            "Bongabon"
        ],
        [
            "Cabiao"
        ],
        [
            "Carranglan"
        ],
        [
            "Cuyapo"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Guimba"
        ],
        [
            "Jaen"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Llanera"
        ],
        [
            "Lupao"
        ],
        [
            "Nampicuan"
        ],
        [
            "Pantabangan"
        ],
        [
            "Peñaranda"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Leonardo"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Zaragoza"
        ],
        [
            "Component cities"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Jose"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Philippines cities with a 100,000+ population2,000,000 and more"
        ],
        [
            "Quezon City (2,960,048)"
        ],
        [
            "1,000,000–1,999,999"
        ],
        [
            "Manila (1,846,513)"
        ],
        [
            "Davao City (1,776,949)"
        ],
        [
            "Caloocan (1,661,584)"
        ],
        [
            "Taguig (1,223,597)"
        ],
        [
            "500,000–999,999"
        ],
        [
            "Zamboanga City (977,234)"
        ],
        [
            "Cebu City (964,169)"
        ],
        [
            "Antipolo (887,399)"
        ],
        [
            "Pasig (803,159)"
        ],
        [
            "Cagayan de Oro (728,402)"
        ],
        [
            "Valenzuela (714,978)"
        ],
        [
            "Dasmariñas (703,141)"
        ],
        [
            "General Santos (697,315)"
        ],
        [
            "Parañaque (689,992)"
        ],
        [
            "Bacoor (664,625)"
        ],
        [
            "San Jose del Monte (651,813)"
        ],
        [
            "Las Piñas (606,293)"
        ],
        [
            "Bacolod (600,783)"
        ],
        [
            "Muntinlupa (543,445)"
        ],
        [
            "Calamba (539,671)"
        ],
        [
            "200,000–499,999"
        ],
        [
            "Lapu-Lapu City (497,604)"
        ],
        [
            "Imus (496,794)"
        ],
        [
            "Angeles City (462,928)"
        ],
        [
            "Iloilo City (457,626)"
        ],
        [
            "Marikina (456,059)"
        ],
        [
            "General Trias (450,583)"
        ],
        [
            "Pasay (440,656)"
        ],
        [
            "Mandaluyong (425,758)"
        ],
        [
            "Santa Rosa (414,812)"
        ],
        [
            "Biñan (407,437)"
        ],
        [
            "Tarlac City (385,398)"
        ],
        [
            "Malabon (380,522)"
        ],
        [
            "Lipa (372,931)"
        ],
        [
            "Butuan (372,910)"
        ],
        [
            "Baguio (366,358)"
        ],
        [
            "Mandaue (364,116)"
        ],
        [
            "Iligan (363,115)"
        ],
        [
            "Cabuyao (355,330)"
        ],
        [
            "San Fernando (Pampanga) (354,666)"
        ],
        [
            "Batangas City (351,647)"
        ],
        [
            "Cabanatuan (327,325)"
        ],
        [
            "San Pedro (326,001)"
        ],
        [
            "Cotabato City (325,079)"
        ],
        [
            "Puerto Princesa (307,079)"
        ],
        [
            "Tagum (296,202)"
        ],
        [
            "Mabalacat (293,244)"
        ],
        [
            "Makati (292,743)"
        ],
        [
            "San Pablo (285,348)"
        ],
        [
            "Lucena (278,924)"
        ],
        [
            "Talisay (Cebu) (263,048)"
        ],
        [
            "Malolos (261,189)"
        ],
        [
            "Olongapo (260,317)"
        ],
        [
            "Tacloban (251,881)"
        ],
        [
            "Navotas (247,543)"
        ],
        [
            "Ormoc (230,998)"
        ],
        [
            "Meycauayan (225,673)"
        ],
        [
            "Santo Tomas (218,500)"
        ],
        [
            "Valencia (Bukidnon) (216,546)"
        ],
        [
            "Trece Martires (210,503)"
        ],
        [
            "Pagadian (210,542)"
        ],
        [
            "Legazpi (209,533)"
        ],
        [
            "Panabo (209,230)"
        ],
        [
            "Naga (Camarines Sur) (209,170)"
        ],
        [
            "Toledo (207,314)"
        ],
        [
            "Marawi (207,010)"
        ],
        [
            "San Carlos (Pangasinan) (205,424)"
        ],
        [
            "Kabankalan (200,198)"
        ],
        [
            "100,000–199,999"
        ],
        [
            "Koronadal (195,398)"
        ],
        [
            "Bago (191,210)"
        ],
        [
            "Malaybalay (190,712)"
        ],
        [
            "Digos (188,376)"
        ],
        [
            "Calbayog (186,960)"
        ],
        [
            "Sorsogon City (182,237)"
        ],
        [
            "Roxas City (179,292)"
        ],
        [
            "Dagupan (174,302)"
        ],
        [
            "Surigao City (171,107)"
        ],
        [
            "Baliwag (168,470)"
        ],
        [
            "Tuguegarao (166,334)"
        ],
        [
            "Kidapawan (160,791)"
        ],
        [
            "Cadiz (158,544)"
        ],
        [
            "Ilagan (158,258)"
        ],
        [
            "Danao (156,321)"
        ],
        [
            "San Jose (Nueva Ecija) (150,917)"
        ],
        [
            "Sagay (148,894)"
        ],
        [
            "Santiago (148,580)"
        ],
        [
            "Mati (147,547)"
        ],
        [
            "Urdaneta (144,577)"
        ],
        [
            "Cauayan (143,403)"
        ],
        [
            "Calapan (145,786)"
        ],
        [
            "Tabaco (140,961)"
        ],
        [
            "Ozamis (140,443)"
        ],
        [
            "Dipolog (138,141)"
        ],
        [
            "Gingoog (136,698)"
        ],
        [
            "Carcar (136,453)"
        ],
        [
            "Dumaguete (134,103)"
        ],
        [
            "Naga (Cebu) (133,184)"
        ],
        [
            "San Carlos (Negros Occidental) (132,650)"
        ],
        [
            "Silay (130,478)"
        ],
        [
            "Isabela (Basilan) (130,379)"
        ],
        [
            "San Juan (Metro Manila) (126,347)"
        ],
        [
            "San Fernando (La Union) (125,640)"
        ],
        [
            "Gapan (122,968)"
        ],
        [
            "Bayawan (122,747)"
        ],
        [
            "Tabuk (121,033)"
        ],
        [
            "Ligao (118,096)"
        ],
        [
            "Samal (Davao del Norte) (116,771)"
        ],
        [
            "Himamaylan (116,240)"
        ],
        [
            "Iriga (114,457)"
        ],
        [
            "Tayabas (112,658)"
        ],
        [
            "Baybay (111,848)"
        ],
        [
            "Laoag (111,651)"
        ],
        [
            "Tacurong (109,319)"
        ],
        [
            "Talisay (Negros Occidental) (108,909)"
        ],
        [
            "Catbalogan (106,440)"
        ],
        [
            "Carmona (106,256)"
        ],
        [
            "Tagbilaran (104,976)"
        ],
        [
            "Masbate City (104,522)"
        ],
        [
            "Balanga (104,173)"
        ],
        [
            "Guihulngan (102,656)"
        ],
        [
            "Cavite City (100,674)"
        ],
        [
            "Lamitan (100,150)"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Germany"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Czech Republic"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cabanatuan&oldid=1228559475\""
        ],
        [
            "Categories: CabanatuanCities in Nueva EcijaPopulated places established in 17801780 establishments in the PhilippinesPopulated places on the Pampanga RiverFormer national capitalsFormer provincial capitals of the PhilippinesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: archived copy as titleCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from July 2022Pages using infobox settlement with possible nickname listPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using infobox settlement with possible demonym listArticles containing Filipino-language textArticles containing Ilocano-language textAll articles with unsourced statementsArticles with unsourced statements from July 2012Articles containing potentially dated statements from June 2018All articles containing potentially dated statementsCommons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with GND identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with NKC identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}