{
    "name": "Cabarroguis",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cabarroguis"
        ],
        [
            "25 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSimple EnglishSvenskaTagalogไทยاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°30′37″N 121°31′20″E﻿ / ﻿16.5103°N 121.5222°E﻿ / 16.5103; 121.5222"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Capital of Quirino, Philippines"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesCabarroguisMunicipalityMunicipality of CabarroguisCabarroguis Town Hall"
        ],
        [
            "FlagSealMap of Quirino with Cabarroguis highlightedOpenStreetMapCabarroguisLocation within the PhilippinesCoordinates: 16°30′37″N 121°31′20″E﻿ / ﻿16.5103°N 121.5222°E﻿ / 16.5103; 121.5222CountryPhilippinesRegionCagayan ValleyProvinceQuirinoDistrict"
        ],
        [
            "Lone districtFoundedJune 21, 1969Named forLeon CabarroguisBarangays17"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAvelino N. Agustin, Jr. • Vice MayorFrancisco M. Dulnuan, Jr. • RepresentativeJunie E. Cua • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jann Graceal Bert N. BinlayanAvelino N. Agustin Jr.Francisco M. Dulnuan Jr.Teresita B. TuguinayoTirso V. AbuanAlipio N. PastorDanuel S. GalgalengFlorencio L. Valdez Jr."
        ],
        [
            " • Electorate20,999 voters (2022)Area • Revenue₱ 176 million (2020) • Assets₱ 346.3 million (2020) • Expenditure₱ 144.6 million (2020) • Liabilities₱ 83.88 million (2020)Service provider • ElectricityQuirino Electric Cooperative (QUIRELCO)Time zoneUTC+8 (PST)ZIP code3400PSGC025702000IDD : area code +63 (0)78Native languagesIlocano Bugkalot TagalogWebsitewww.cabarroguis.gov.ph"
        ],
        [
            "Cabarroguis, officially the Municipality of Cabarroguis (Ilocano: Ili ti Cabarroguis; Tagalog: Bayan ng Cabarroguis), is a 3rd class municipality and capital of the province of Quirino, Philippines.",
            "According to the 2020 census, it has a population of 33,533 people."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(April 2020) (Learn how and when to remove this message)"
        ],
        [
            "Prior to the advent of settlement, Cabarroguis was a vast forested area and formed parts of the municipalities of Saguday, Diffun, and Aglipay.",
            "It was originally occupied by the Aetas who were later displaced by the Ilongot tribe because the Aetas were known to be of nomadic character.",
            "Many years later, permanent settlements were made by different civilized ethnic groups like Ilocanos, Tagalog and others in search of good fortune in this virgin land."
        ],
        [
            "As the population and settlement increased, regular barrios were created.",
            "These were the barrios of Zamora, Banuar, Burgos, Del Pilar, Dibibi, Eden, Villamor and five more sitios of Villapeña, Villarose, Tucod, Calaocan and Dingasan at the municipality of Aglipay: barrios of San Marcos, Gundaway and portion of Mangandingay at the municipality of Diffun and the other part of Mangandingay at the municipality of Saguday.",
            "The above stated barrios of different municipalities became the territorial jurisdiction of Cabarroguis by virtue of Republic Act No.",
            "5554 enacted by the Philippine Congress authored by then Senator Leonardo Perez on June 21, 1969.",
            "The newly created municipality of Cabarroguis was named in honor of the late Congressman of Nueva Vizcaya, Leon Cabarroguis."
        ],
        [
            "Cabarroguis operated as a regular municipality after the 1971 local polls wherein Anastacio dela Pena become the first Local Chief Executive.",
            "Barangay Mangandingay also became the temporary seat of the municipal government, Years later, when Diomedes Dumayas was appointed as the town's executive, the seat of the Local Government officially transferred to Barangay Zamora where a 12 hectares lot was donated."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "In the 19th Congress of the Philippines, house bills were filed by various representatives which seeks Cabarroguis including other capital towns of provinces with no current component cities, independent component cities or highly urbanized cities to automatically convert into cities."
        ],
        [
            "Geography"
        ],
        [
            "Cabarroguis is located in the northwestern part of the province of Quirino.",
            "It is bounded on the north, northwest and northeast by the municipalities of Diffun, and Saguday respectively, on the east and southeast by the municipality of Aglipay on the south by the municipalities of Maddela, and Nagtipunan, and on the west by the province of Nueva Vizcaya.",
            "It is 380 kilometres (240 mi) from Manila."
        ],
        [
            "The municipal area of Cabarroguis covers 26,902 hectares, approximately.",
            "The area is further distributed into the 17 barangays comprising the municipality, including barangay Didipio, which remains in the municipality and the provinces of Nueva Vizcaya, and Quirino."
        ],
        [
            "Cabarroguis is accessible by series of roads notably the Cordon–Diffun–Maddela–Aurora Road."
        ],
        [
            "Barangays"
        ],
        [
            "Cabarroguis is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Names of Barangays with the corresponding Land Areas, Households & Population"
        ],
        [
            "Source: 2022 Community-Based Monitoring System (CBMS), Philippine Statistics Authority"
        ],
        [
            "Barangay"
        ],
        [
            "Land Area (has.)"
        ],
        [
            "Number of responding"
        ],
        [
            "households"
        ],
        [
            "Number of household"
        ],
        [
            "members"
        ],
        [
            "Urban:"
        ],
        [
            "Gundaway"
        ],
        [
            "629.6612"
        ],
        [
            "1011"
        ],
        [
            "4072"
        ],
        [
            "Zamora"
        ],
        [
            "427.1250"
        ],
        [
            "734"
        ],
        [
            "2779"
        ],
        [
            "Mangandingay"
        ],
        [
            "500.7266"
        ],
        [
            "915"
        ],
        [
            "3584"
        ],
        [
            "San Marcos"
        ],
        [
            "667.7311"
        ],
        [
            "671"
        ],
        [
            "2496"
        ],
        [
            "Sub-total:"
        ],
        [
            "2,255.2439"
        ],
        [
            "3331"
        ],
        [
            "12931"
        ],
        [
            "Rural:"
        ],
        [
            "Villarose"
        ],
        [
            "843.1654"
        ],
        [
            "195"
        ],
        [
            "779"
        ],
        [
            "Banuar"
        ],
        [
            "546.6502"
        ],
        [
            "180"
        ],
        [
            "712"
        ],
        [
            "Villamor"
        ],
        [
            "865.3353"
        ],
        [
            "630"
        ],
        [
            "2449"
        ],
        [
            "Del Pilar"
        ],
        [
            "550.1530"
        ],
        [
            "176"
        ],
        [
            "593"
        ],
        [
            "Villa Peña"
        ],
        [
            "642.1622"
        ],
        [
            "199"
        ],
        [
            "727"
        ],
        [
            "Burgos"
        ],
        [
            "1,288.4090"
        ],
        [
            "823"
        ],
        [
            "3171"
        ],
        [
            "Eden"
        ],
        [
            "1,001.8760"
        ],
        [
            "289"
        ],
        [
            "1131"
        ],
        [
            "Gomez"
        ],
        [
            "491.8008"
        ],
        [
            "162"
        ],
        [
            "627"
        ],
        [
            "Dingasan"
        ],
        [
            "3,108.0650"
        ],
        [
            "396"
        ],
        [
            "1663"
        ],
        [
            "Calaocan"
        ],
        [
            "677.9979"
        ],
        [
            "223"
        ],
        [
            "935"
        ],
        [
            "Dibibi"
        ],
        [
            "3,491.2367"
        ],
        [
            "690"
        ],
        [
            "2776"
        ],
        [
            "Sto.",
            "Domingo"
        ],
        [
            "299.6062"
        ],
        [
            "239"
        ],
        [
            "863"
        ],
        [
            "Tucod (including Didipio)"
        ],
        [
            "10,869.8230"
        ],
        [
            "455"
        ],
        [
            "1963"
        ],
        [
            "Sub-total:"
        ],
        [
            "24,646.7561"
        ],
        [
            "4657"
        ],
        [
            "18389"
        ],
        [
            "Total:"
        ],
        [
            "26,902"
        ],
        [
            "7988"
        ],
        [
            "31320"
        ],
        [
            "Administrative Map"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cabarroguis, Quirino"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "27(81)"
        ],
        [
            "25(77)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "119(4.7)"
        ],
        [
            "83(3.3)"
        ],
        [
            "54(2.1)"
        ],
        [
            "37(1.5)"
        ],
        [
            "133(5.2)"
        ],
        [
            "132(5.2)"
        ],
        [
            "161(6.3)"
        ],
        [
            "163(6.4)"
        ],
        [
            "153(6.0)"
        ],
        [
            "142(5.6)"
        ],
        [
            "160(6.3)"
        ],
        [
            "224(8.8)"
        ],
        [
            "1,561(61.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.4"
        ],
        [
            "13.6"
        ],
        [
            "11.6"
        ],
        [
            "9.4"
        ],
        [
            "19.3"
        ],
        [
            "21.9"
        ],
        [
            "23.9"
        ],
        [
            "23.4"
        ],
        [
            "21.1"
        ],
        [
            "16.3"
        ],
        [
            "18.1"
        ],
        [
            "21.4"
        ],
        [
            "218.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CabarroguisYearPop.±% p.a.1970 7,838—    1975 12,226+9.33%1980 17,450+7.37%1990 21,793+2.25%1995 22,812+0.86%YearPop.±% p.a.2000 25,832+2.70%2007 28,024+1.13%2010 29,395+1.75%2015 30,582+0.76%2020 33,533+1.83%Source: Philippine Statistics Authority"
        ],
        [
            "Initially, year 1970 recorded a population of 7,835 person followed by census year 1975 which registered a total population of 12,226 that manifested a growth rate of 9.29%.",
            "Another increase of population was observed during census year 1980 which recorded 17,450 displaying a growth rate of 2.2% and for census year 1995, it manifested a 22,812 person displaying a growth rate of 2.25%.",
            "Base year of 2000 recorded a total population of 25,832 which manifested a growth rate of 2.25%.",
            "As of census year 2007, the population increased to 28,024 which manifested a growth rate of 1.21%."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cabarroguis"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  12.10"
        ],
        [
            "2009  11.75"
        ],
        [
            "2012  15.19"
        ],
        [
            "2015  10.81"
        ],
        [
            "2018  9.32"
        ],
        [
            "2021  7.37"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Income class"
        ],
        [
            "Cabarroguis is a 3rd class municipality with an agricultural base economy where the majority of the population derives their income from agricultural related industries and businesses.",
            "The municipality is 99% dependent on the Internal Revenue Allotment (IRA) now called the National Tax Allocation (NTA)."
        ],
        [
            "For the year 2022, the local lncome is Four Million Five Hundred Ninety-One Three Hundred forty-seven and 92/100 (4,591,347.92) and the total external income is Two Hundred Ten Million Five Hundred Eighty-seven Fifty-three thousand (210,587,053.00)."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Cabarroguis, belonging to the lone congressional district of the province of Quirino, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Vision"
        ],
        [
            "Cabarroguis as center of technological innovations with value-oriented and resilient society living in an ecologically balanced economy governed by just and pro-active leaders."
        ],
        [
            "Mission"
        ],
        [
            "To promote the standards of living through vibrant technological innovations in education, agriculture and ecology, health care, commerce, and industry carried out through participative legislation and governance."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Dakila Carlo E. Cua"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Avelino N. Agustin Jr."
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Francisco M. Dulnuan, Jr."
        ],
        [
            "Councilors"
        ],
        [
            "Jann Graceal Bert N. Binlayan"
        ],
        [
            "Danuel S. Galgaleng"
        ],
        [
            "Virgilio A. Lopez"
        ],
        [
            "Marciano G. Immapa"
        ],
        [
            "Tirso V. Abuan"
        ],
        [
            "Zernan B. Cariño"
        ],
        [
            "Florencio L. Valdez Jr."
        ],
        [
            "Leilani R. Vinluan"
        ],
        [
            "David G. Bangsoyao"
        ],
        [
            "Reynaldo S. Marzo"
        ],
        [
            "Jannette R. Orpia"
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Quirino governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Higher educational institution"
        ],
        [
            "Quirino State University"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Cabarroguis |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ \"Cabarroguis, Quirino\"."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Yap, Eric (June 30, 2022).",
            "\"AN ACT AUTOMATICALLY CONVERTING THE CAPITAL TOWN OF PROVINCES WITH NO COMPONENT CITIES, INDEPENDENT COMPONENT CITIES OR HIGHLY URBANIZED CITIES WITHIN ITS TERRITORIAL JURISDICTION, INTO A COMPONENT CITY\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved April 1, 2023."
        ],
        [
            "^ Palma, Wilter (August 9, 2022).",
            "\"AN ACT AUTOMATICALLY CONVERTING THE CAPITAL TOWN OF PROVINCES WITH NO COMPONENT CITIES, INDEPENDENT COMPONENT CITIES, OR HIGHLY URBANIZED CITIES WITHIN ITS TERRITORIAL JURISDICTION, INTO A COMPONENT CITY\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved April 1, 2023."
        ],
        [
            "^ Daza, Paul (August 11, 2022).",
            "\"AN ACT CONVERING INTO COMPONENT CITIES THE CAPITAL TOWNS OF PROVINCES WITHOUT A CITY, AMENDING FOR THE PURPOSE SECTION 450 OF REPUBLIC ACT NO.",
            "7610, AS AMENDED BY REPUBLIC ACT NO.",
            "9009, OTHERWISE KNOWN AS THE LOCAL GOVERNMENT CODE OF 1991, AND FOR OTHER PURPOSES\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved April 1, 2023."
        ],
        [
            "^"
        ],
        [
            "\"Cabarroguis: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved July 4, 2021."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Quirino\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Archived (PDF) from the original on October 6, 2020.",
            "Retrieved March 10, 2022."
        ],
        [
            "^ \"THE SCHOOLS DIVISION OF QUIRINO\".",
            "deped quirino | SDO Quirino Website.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Cabarroguis."
        ],
        [
            "Cabarroguis Profile at PhilAtlas.com"
        ],
        [
            "Cabarroguis.gov.ph"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Cabarroguis"
        ],
        [
            "Diffun"
        ],
        [
            "Saguday"
        ],
        [
            "DiffunKasibu, Nueva Vizcaya"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Aglipay"
        ],
        [
            "Nagtipunan"
        ],
        [
            "Articles Related to Cabarroguis, Quirino"
        ],
        [
            "vte Province of QuirinoCabarroguis (capital)  Diffun (largest municipality)Municipalities"
        ],
        [
            "Aglipay"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Diffun"
        ],
        [
            "Maddela"
        ],
        [
            "Nagtipunan"
        ],
        [
            "Saguday"
        ],
        [
            "BarangaysSee: List of barangays in Quirino"
        ],
        [
            "vteCagayan Valley (Region II)Regional center"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Provinces"
        ],
        [
            "Batanes"
        ],
        [
            "Cagayan"
        ],
        [
            "Isabela"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Quirino"
        ],
        [
            "Independent component city"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Basco"
        ],
        [
            "Bayombong"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Ilagan"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Municipalities"
        ],
        [
            "Abulug"
        ],
        [
            "Aglipay"
        ],
        [
            "Alcala"
        ],
        [
            "Alfonso Castañeda"
        ],
        [
            "Alicia"
        ],
        [
            "Allacapan"
        ],
        [
            "Ambaguio"
        ],
        [
            "Amulung"
        ],
        [
            "Angadanan"
        ],
        [
            "Aparri"
        ],
        [
            "Aritao"
        ],
        [
            "Aurora"
        ],
        [
            "Bagabag"
        ],
        [
            "Baggao"
        ],
        [
            "Ballesteros"
        ],
        [
            "Bambang"
        ],
        [
            "Basco"
        ],
        [
            "Bayombong"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Buguey"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "Claveria"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Diadi"
        ],
        [
            "Diffun"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Dupax del Norte"
        ],
        [
            "Dupax del Sur"
        ],
        [
            "Echague"
        ],
        [
            "Enrile"
        ],
        [
            "Gamu"
        ],
        [
            "Gattaran"
        ],
        [
            "Gonzaga"
        ],
        [
            "Iguig"
        ],
        [
            "Itbayat"
        ],
        [
            "Ivana"
        ],
        [
            "Jones"
        ],
        [
            "Kasibu"
        ],
        [
            "Kayapa"
        ],
        [
            "Lal-lo"
        ],
        [
            "Lasam"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Maddela"
        ],
        [
            "Mahatao"
        ],
        [
            "Mallig"
        ],
        [
            "Nagtipunan"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Pamplona"
        ],
        [
            "Peñablanca"
        ],
        [
            "Piat"
        ],
        [
            "Quezon (Isabela)"
        ],
        [
            "Quezon (Nueva Vizcaya)"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "Sabtang"
        ],
        [
            "Saguday"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Sanchez-Mira"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Solana"
        ],
        [
            "Solano"
        ],
        [
            "Tuao"
        ],
        [
            "Tumauini"
        ],
        [
            "Uyugan"
        ],
        [
            "Villaverde"
        ],
        [
            "Luzon, Philippines"
        ],
        [
            "vte Provincial capital cities and municipalities of the PhilippinesLuzon"
        ],
        [
            "Abra: Bangued"
        ],
        [
            "Albay: Legazpi"
        ],
        [
            "Apayao: Kabugao / Luna1"
        ],
        [
            "Aurora: Baler"
        ],
        [
            "Bataan: Balanga"
        ],
        [
            "Batanes: Basco"
        ],
        [
            "Batangas: Batangas City"
        ],
        [
            "Benguet: La Trinidad"
        ],
        [
            "Bulacan: Malolos"
        ],
        [
            "Cagayan: Tuguegarao"
        ],
        [
            "Camarines Norte: Daet"
        ],
        [
            "Camarines Sur: Pili"
        ],
        [
            "Catanduanes: Virac"
        ],
        [
            "Cavite: Imus / Trece Martires1"
        ],
        [
            "Ifugao: Lagawe"
        ],
        [
            "Ilocos Norte: Laoag"
        ],
        [
            "Ilocos Sur: Vigan"
        ],
        [
            "Isabela: Ilagan"
        ],
        [
            "Kalinga: Tabuk"
        ],
        [
            "La Union: San Fernando"
        ],
        [
            "Laguna: Santa Cruz"
        ],
        [
            "Marinduque: Boac"
        ],
        [
            "Masbate: Masbate City"
        ],
        [
            "Mountain Province: Bontoc"
        ],
        [
            "Nueva Ecija: Palayan"
        ],
        [
            "Nueva Vizcaya: Bayombong"
        ],
        [
            "Occidental Mindoro: Mamburao"
        ],
        [
            "Oriental Mindoro: Calapan"
        ],
        [
            "Palawan: Puerto Princesa"
        ],
        [
            "Pampanga: San Fernando"
        ],
        [
            "Pangasinan: Lingayen"
        ],
        [
            "Quezon: Lucena"
        ],
        [
            "Quirino: Cabarroguis"
        ],
        [
            "Rizal: Antipolo"
        ],
        [
            "Romblon: Romblon"
        ],
        [
            "Sorsogon: Sorsogon City"
        ],
        [
            "Tarlac: Tarlac City"
        ],
        [
            "Zambales: Iba"
        ],
        [
            "Visayas"
        ],
        [
            "Aklan: Kalibo"
        ],
        [
            "Antique: San Jose de Buenavista"
        ],
        [
            "Biliran: Naval"
        ],
        [
            "Bohol: Tagbilaran"
        ],
        [
            "Capiz: Roxas"
        ],
        [
            "Cebu: Cebu City"
        ],
        [
            "Eastern Samar: Borongan"
        ],
        [
            "Guimaras: Jordan"
        ],
        [
            "Iloilo: Iloilo City"
        ],
        [
            "Leyte: Tacloban"
        ],
        [
            "Negros Occidental: Bacolod"
        ],
        [
            "Negros Oriental: Dumaguete"
        ],
        [
            "Northern Samar: Catarman"
        ],
        [
            "Samar: Catbalogan"
        ],
        [
            "Siquijor: Siquijor"
        ],
        [
            "Southern Leyte: Maasin"
        ],
        [
            "Mindanao"
        ],
        [
            "Agusan del Norte: Cabadbaran / Butuan1"
        ],
        [
            "Agusan del Sur: Prosperidad"
        ],
        [
            "Basilan: Lamitan / Isabela1"
        ],
        [
            "Bukidnon: Malaybalay"
        ],
        [
            "Camiguin: Mambajao"
        ],
        [
            "Cotabato: Kidapawan"
        ],
        [
            "Davao de Oro: Nabunturan"
        ],
        [
            "Davao del Norte: Tagum"
        ],
        [
            "Davao del Sur: Digos"
        ],
        [
            "Davao Occidental: Malita"
        ],
        [
            "Davao Oriental: Mati"
        ],
        [
            "Dinagat Islands: San Jose"
        ],
        [
            "Lanao del Norte: Tubod"
        ],
        [
            "Lanao del Sur: Marawi"
        ],
        [
            "Maguindanao del Norte: Datu Odin Sinsuat"
        ],
        [
            "Maguindanao del Sur: Buluan"
        ],
        [
            "Misamis Occidental: Oroquieta"
        ],
        [
            "Misamis Oriental: Cagayan de Oro"
        ],
        [
            "Sarangani: Alabel"
        ],
        [
            "South Cotabato: Koronadal"
        ],
        [
            "Sultan Kudarat: Isulan"
        ],
        [
            "Sulu: Jolo"
        ],
        [
            "Surigao del Norte: Surigao City"
        ],
        [
            "Surigao del Sur: Tandag"
        ],
        [
            "Tawi-Tawi: Bongao"
        ],
        [
            "Zamboanga del Norte: Dipolog"
        ],
        [
            "Zamboanga del Sur: Pagadian"
        ],
        [
            "Zamboanga Sibugay: Ipil"
        ],
        [
            "1 de facto seat of provincial government"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cabarroguis&oldid=1227188083\""
        ],
        [
            "Categories: Municipalities of QuirinoProvincial capitals of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textArticles needing additional references from April 2020All articles needing additional referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}