{
    "name": "Cabatuan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cabatuan, Isabela"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°57′32″N 121°40′09″E﻿ / ﻿16.9589°N 121.6692°E﻿ / 16.9589; 121.6692"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Cabatuan, Isabela\" – news · newspapers · books · scholar · JSTOR (January 2014) (Learn how and when to remove this message)"
        ],
        [
            "For the municipality in Iloilo, see Cabatuan, Iloilo."
        ],
        [
            "Not to be confused with Cabanatuan."
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesCabatuanMunicipalityMunicipality of Cabatuan"
        ],
        [
            "FlagSealNickname: Land of the Golden GrainsMap of Isabela with Cabatuan highlightedOpenStreetMapCabatuanLocation within the PhilippinesCoordinates: 16°57′32″N 121°40′09″E﻿ / ﻿16.9589°N 121.6692°E﻿ / 16.9589; 121.6692CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "3rd districtFoundedNovember 5, 1949Barangays22"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 155.1 million (2020) • Assets₱ 555.7 million (2020) • Expenditure₱ 147.6 million (2020) • Liabilities₱ 188.4 million (2020)Service provider • ElectricityIsabela 1 Electric Cooperative (ISELCO 1)Time zoneUTC+8 (PST)ZIP code3315PSGC023107000IDD : area code +63 (0)78Native languagesIlocano TagalogWebsitewww.cabatuan-isabela.gov.ph"
        ],
        [
            "Cabatuan, officially the Municipality of Cabatuan (Ilocano: Ili ti Cabatuan; Tagalog: Bayan ng Cabatuan), is a 3rd class municipality in the province of Isabela, Philippines.",
            "According to the 2020 census, it has a population of 39,990 people."
        ],
        [
            "Being a major rice producing town, it is the home of several rice mills and rice traders, dubbed as the Land of the Golden Grains."
        ],
        [
            "Etymology"
        ],
        [
            "When the act of throwing stones called \"ambatuan\" then it was evolved to \"cabatuan\" when Ilocano people who settled in the area used stones to drive away Kalingas."
        ],
        [
            "History"
        ],
        [
            "Indigenous settlements"
        ],
        [
            "The early inhabitants of the vast forest land were the Kalingas who are indigenous to the mountain provinces.",
            "These settlers lived on tree houses which they built along the banks of Magat River.",
            "These sturdy, dark complexioned, G-stringed, soldier-like people depended on hunting, fishing and a little agriculture and poultry."
        ],
        [
            "The land where Cabatuan now nestles was once teeming with vegetation, wildlife and fish, nurtured by the Magat River.",
            "Its history started when one of the indigenous people of the mountain provinces settled down in the Cagayan Valley where the Apayaos, Dumagats, Gaddangs, Ibanags, Ifugaos, Igorots, Itawes, Palananons and the Yogads were living.",
            "This tribe is known as the Kalingas, the name believed to have come from the Ibanag and Gaddang word, which means \"headhunters\".",
            "The Kalinga villages were strategically located along the banks of the Magat River in south-western Isabela near the boundary of Ifugao province, surrounding the locality now known as Sili, Bolinao, Dalig Kalinga (these places are now barangays of Aurora town) and Subasta (now a sitio of Barangay Saranay in Cabatuan).",
            "The early Cabatuanenses were generally known to be medium in height, with dark complexion and lissome with high nose bridges.",
            "Physically, they were very sturdy and well-built so that their war-like bearing feature made them more like soldiers.",
            "They lived on tree-houses and depended on hunting, fishing and a little of poultry and agriculture.",
            "The Kalingas were believed to be the descendants of the second wave of Malay who came to the Islands from Borneo.",
            "These pagans were headed by several able leaders like: Ronsan and Ngolan (both from Sili in Aurora town), Balindan, Melad and Gombi (from Bolinao, also in Aurora), Tullayao Bayudoc (from Subasta, Saranay in Cabatuan) and the grand old chieftain Materig (also from Sili in Aurora)."
        ],
        [
            "The Kalingas preferred to stay in the Cabatuan area of jurisdiction rather than in Aurora because the town proper of Aurora then was located in Dalig, now a barangay of Burgos town."
        ],
        [
            "When the Christians arrived, the Kalingas attached the word \"Infiel\" before their native name to fulfill their yearning for a second name like those of Christians.",
            "The name \"Infiel\" was derived from \"ynfieles\", a Spanish friar's term for non-believers of the Christian faith."
        ],
        [
            "Ilocano migration"
        ],
        [
            "In 1912, the Ilocanos started arriving with their families, relatives and friends.",
            "The Ilocanos settled away from the river but the Kalingas considered it an intrusion which later led to encounters where the Ilocanos used piles of stones to drive away the Kalingas.",
            "The act of throwing stones was called “ambatuan” which later evolved to “cabatuan”.",
            "The warring groups eventually became friends through a peace pact led by their respective leaders and the place became known as Cabatuan."
        ],
        [
            "After the Ilocano migrants, several waves of settlers particularly locals from Pangasinan and Central Luzon came to Isabela as merchants.",
            "Some of the Pangasinan pioneers were: Nicolas T. Almirol (originally surnamed Lagasca), Benito Monte, Hermogenes B. Soriben and Zacarias P. Munoz."
        ],
        [
            "Some of the Tagalog migrants were: Carlino O. Munsayac (Nueva Ecija), Atanasio H. Dayrit (San Fernando, Pampanga), Atty.",
            "Rafael M. Tomacruz (then Mayor of Hagonoy, Bulacan and Provincial Board Member), Anselmo S. Esmino (Licab, Nueva Ecija), a certain Pamintuan (Pampanga), Andres Alivia (Rizal, Nueva Ecija) and Antonio V. Altoveros (Rizal, Nueva Ecija)."
        ],
        [
            "The Chinese also migrated to Cabatuan and opted to reside there and marry young Ilocano women.",
            "The bulk of the Chinese migrants came from Amoy in the 1930s.",
            "The Chinese migrants were: Clemente Paggabao (married Andrea Labasan), Eusebio Uy (married Lourdes Visaya), Juan Uy (married Felisa Acio), Mariano Uy (married Lourdes dela Cruz), Kaya Uy (married Carmen Rambac), Inocencio Uy (married Mercedes Domingcil), Francisco Uy (married Mercedes Llamelo), Guillermo Uy (married Tomasa Padron), Lorenzo Uy (married Teodora Visaya), Venancio Tio (married Monica Acorda), Vicente Pua (married Sabina Ventura), Joaquin Pua (married Entonia Labayog), Pedro Pua (married Isabela Guerrero), Kiana Uy (married Claudia Manuel), Pascual Pua (married Carmen Uy), Densoy Ty (married Maxima Uy), Tomas Uy, Miguel Dy, Mariano Tio, Julian Pua (married Felicitas Bagcal), Eusebio Tan (married Eusenia Lomotan), Jose Uy (married Adelina Ventura), Ben Chong (married Gue Eng Tio), Alfonso Uy (married Engracia Uy), Sytong Uy, Uwa Uy (married Avelina Gervacio), Ben Co (married Maria Vea), Pedro Ong (married Salud Bacallan), Pedro Tan (married Maria Aczon), Tio Nga Luy (married Pelagia Acosta), Alfredo Uy (married Ruperta V. Pancho)"
        ],
        [
            "As a barrio of Cauayan"
        ],
        [
            "In 1914, during the American Regime, Cabatuan was incorporated with the Municipality of Cauayan, Isabela with Agapito A. Pilar as the first Barrio Teniente.",
            "Others who assumed the post were: Florencio Abad, Leocadio Acio, Pedro Acob, Felipe Aczon, Tomas Camungao, T. Damunglo, Jose Castillo, Cirilo Guerrero, Platon Guillermo, Ignacio Juan, Antonio S. Medina, Felipe Pascual, Feliciano A. Ramos, Roman Rivera, Inigo Sales, Francisco Salvador, Tirso Santos, B. Sumawang and Juan Ventura.",
            "Bernardo C. Dacuycuy, the acknowledged founder of Cabatuan, was appointed by Governor-General Leonard Wood as President of the Confederate Districts of Antatet (now Luna), Dalig, Bolinao and Sili.",
            "Later on, Cabatuan was sub-divided into four districts.",
            "District 1, comprises what is now the barangays of Sampaloc and Saranay.",
            "District 2, the barrio proper, comprises what is now the barangays of Centro and San Andres.",
            "District 3, comprises what is now the barangays of Del Pilar, Magdalena and portions of Paraiso.",
            "And District 4, comprises all populated areas upstream the Magat River like Macalaoat, Culing and Diamantina."
        ],
        [
            "Early politics"
        ],
        [
            "The desire to have a representation for the Magat region prompted the Cabatuanenses to support the candidacy of several of their barrio folks.",
            "Thus, the administrations of Cauayan Mayors Guillermo Blas (1938) and Zoilo Cuntapay (1938-1940), three of their Municipal Councilors hailed from Cabatuan.",
            "They were: Paz Sales-Cruz, Francisco Razon and Atanasio H. Dayrit.",
            "Realizing their strong political power in Cauayan, the Cabatuanenses supported Federico P. Acio as mayor.",
            "Acio won and assumed office in 1941 but his term was cut short when the Japanese Imperial Army occupied the town.",
            "Acio was replaced by Jose Canciller."
        ],
        [
            "Second World War"
        ],
        [
            "When the Second World War erupted, several residents of Cabatuan were involved in various encounters in the countryside.",
            "Some Cabatuanenses who fought in the Battle of Bataan were: Norberto V. Abad (suffered the Death March), Dominador Acob (suffered the Death March), Victorino R. Agustin, Leopoldo Cadeliria (suffered the Death March), Alejandro A. Cadiente (suffered the Death March), Ventura D. Frogoso, Elpidio A. Galiza, Domingo J. Marcelo, Juan B. Molina (suffered the Death March), Ranulfo Navarro, Andres N. Palado, Cenon B. Ramos, Jose M. Rivera, Florencio B. Sacaben (suffered the Death March), Simeon B. Santos, Victorino O. Santos (missing in action), Lorenzo T. Sunga, Manuel T. Talimada, Damian S. Tomacruz and Hermogenes S. Tomas.",
            "Some Cabatuanenses who fought outside Bataan were: Benedicto A. Acosta (Ilocos), Teodoro P. Asuncion (died in action in Tuguegarao, Cagayan), Sebastian M. Ballesteros (Ilocos), Rizalino M. Camungao (died in action in Batangas), Florencia M. Dacuycuy (Women's Auxiliary Service in Ilocos) and Enrique Padron (died in action in Tuguegarao)."
        ],
        [
            "As the Japanese Imperial Army occupied the town after the Fall of Bataan, strong resistance continued.",
            "Many Cabatuanenses joined the underground \"guerilla\" movement, locally known as the Bolo Unit.",
            "Some Guerillas from Cabatuan were: Federico P. Acio, Damaso A. Acosta, Mariano P. Alejo, Antonio V. Altoveros, Nestor R. Altoveros, Alvaro C. Antolin, Rufino D. Apostol, Benito G. Bauzon, Osmundo S. Bungay, Pacifico S. Cabantac, Felix G. Cadelina, Norberto Cadiz, Demetrio dela Cruz, Leonides R. Dacuycuy, Gavino K. Enerlan, Fernando A. Ferrer, Apolonio R. Galicano, Patrocinio Gamiao, Venancio Galingana, Santos D. Gonatise, Iluminado Grande, Lino P. Gumaru, Jose G. Hermogela, Nicolas Labayog, Juan R. Labuguen, Celestino G. Lomboy, Cenon S. Manibog, Venancio G. Manibog, Juan G. Manuel, Isaac I. Martinez, Cipriano D. Mercado, Nicolas Meria, Miguel O. Monte, Sixta C. Juan, Dionisio B. Juan, Andres E. Nomina, Domingo Pedro, Nemesio N. Ramil, Antonio B. Rodriguez, Cayetano K. Rosario, Teodulfo D. Rumbaoa, Maura A.",
            "Sales, Domingo D. Salgado, Severino Tarapia, Juanito S. Topinio, Juan P. Valeroso, Avelino A. Villanueva, Vicente Villar and Juan G. Visaya."
        ],
        [
            "Mayor Acio was one of the remaining mayors of northern Luzon who refused to surrender to the Japanese, who tried to make him surrender by torturing his wife, Josefa Ventura-Acio, through \"water treatment\".",
            "In reality, Mrs. Acio never knew the whereabouts of her husband and her suffering continued until before Liberation."
        ],
        [
            "The tabacalera (almasin), now owned by Bernardo Bulosan Garcia Sr, in District (now Barangay San Andres) became the chief garrison (Center of Command) of the Japanese.",
            "Other prominent Japanese garrisons were the residences of Federico Acio, Francisco Acob and Daniel Crisologo.",
            "The guerillas continued their underground activities and were fully supported by the barrio people.",
            "The Japanese troops made plans to liquidate the resistance.",
            "The Japanese soldiers hired Filipinos to serve as \"magic eyes\" (Makapili) to pinpoint supporters and members of the movement.",
            "The civilians who were tagged and assassinated were: Catalino Pascual, Ireneo Acedo, Severino Tarampi and a certain Mr. Gomez.",
            "There was also an incident where the Japanese kidnapped a woman by the name of Genoveva A. Agsalda (residing in what is now Barangay San Andres) while reaping tobacco in her field (in Sili) and was not seen again."
        ],
        [
            "When the American warplanes arrived, a house in District Dos (now San Andres) where at least two families were residing was mistakenly identified as a Japanese camp.",
            "The house was heavily bombarded killing all its inhabitants.",
            "The fatalities were: Agustin Duldulao and wife Josefa Mercado with sister Teodorica M. Visaya.",
            "The Duldulao children were: Aprecion, Emeteria, Severo, Angel, Teofilo and the eldest, Demetrio and wife Demetria Aczon with their three-months old baby girl, Angeles."
        ],
        [
            "Separation as a town"
        ],
        [
            "The Municipal Council of Cauayan in 1948 agreed and endorsed the segregation of Cabatuan from the mother town.",
            "Through the initiative of the delegation formed by leaders who hailed from Barrio Cabatuan, Executive Order 293 creating the Municipality of Cabatuan was finally signed by President Elpidio R. Quirino in Malacañang on November 5, 1949."
        ],
        [
            "On November 30, 1949, the set of municipal officials appointed by President Quirino took their oath of office."
        ],
        [
            "Geography"
        ],
        [
            "Cabatuan occupies a land area of 7,200 hectares.",
            "It lies in the south-western part of the Province of Isabela bounded on the north by the Municipality of Aurora, on the east by the Municipality of Luna, on the west by the Municipality of San Mateo and on the south by the City of Cauayan.",
            "Its territorial boundaries are more specifically delineated under Executive Order 293 issued by President Elpidio Quirino on November 5, 1949."
        ],
        [
            "Cabatuan is 41 kilometres (25 mi) from Ilagan and 381 kilometres (237 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Upon the creation of Cabatuan in 1949, twelve barrios were extracted from the mother-town of Cauayan.",
            "They were: Cabatuan (as the seat of government), Buenavista, Caggong, Canan, Culing, Diamantina, Luzon, Macalaoat, Magdalena, Namnama, Tandul Viejo and Villa Visaya.",
            "The three sitios were: Nueva Era, Sampaloc and Saranay."
        ],
        [
            "In 1951, a major re-organization was made creating the new barrios of: Calaocan (from Culing), Centro East (from the old Barrio of Cabatuan-poblacion), Centro West (from the old Barrio of Cabatuan-poblacion), La Paz (from Canan and Namnama), Nueva Era 1 (from Culing), Nueva Era 2 (from Culing), Sampaloc and Saranay.",
            "Barrio Buenavista, on the other hand, was joined with Barrio Caggong while Barrio Villa Visaya was also incorporated with Barrio Diamantina."
        ],
        [
            "In 1956, two additional barrios were formed.",
            "Barrio Del Pilar was created from Magdalena while Barrio Del Corpuz was extracted from Nueva Era 1."
        ],
        [
            "In 1964, Barrio Centro West was renamed to T. Abad honoring one of the founders of Cabatuan, Senor Teodoro Abad while Barrio Centro East was simply called Barrio Centro.",
            "Also the same year, Barrio Caggong was re-christened to Rang-ay while Barrio Tandul Viejo was simply called Tandul.",
            "Barrio Nueva Era 1 was renamed to Culing West while the remaining fraction of old Culing was called Culing East.",
            "Barrio Nueva Era 2 was plainly called Nueva Era."
        ],
        [
            "In 1969, Barrios Culing East and West were chopped to accommodate a new barrio and was named Culing Centro."
        ],
        [
            "The continuous re-organization of the barangay administrative and political set-up divided Barrio Macalaoat and in 1972, the Barrios of Magsaysay and Paraiso were created.",
            "The territory of Barrio Magsaysay was derived from the western portion while Barrio Paraiso got its land area at the eastern side of Macalaoat.",
            "Also in the same year, Barrio T. Abad was again renamed to San Andres to honor Cabatuan's patron, Saint Andrew the Apostle."
        ],
        [
            "Today the Municipality of Cabatuan has 22 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Calaocan"
        ],
        [
            "Canan"
        ],
        [
            "Centro (Poblacion)"
        ],
        [
            "Del Pilar"
        ],
        [
            "Culing Centro"
        ],
        [
            "Culing East"
        ],
        [
            "Culing West"
        ],
        [
            "Del Corpuz"
        ],
        [
            "Diamantina"
        ],
        [
            "La Paz"
        ],
        [
            "Luzon"
        ],
        [
            "Macalaoat"
        ],
        [
            "Magdalena"
        ],
        [
            "Magsaysay"
        ],
        [
            "Namnama"
        ],
        [
            "Nueva Era"
        ],
        [
            "Paraiso"
        ],
        [
            "Rang-ay"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "Saranay"
        ],
        [
            "Tandul"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cabatuan, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "13.6(0.54)"
        ],
        [
            "10.4(0.41)"
        ],
        [
            "18.2(0.72)"
        ],
        [
            "15.7(0.62)"
        ],
        [
            "178.4(7.02)"
        ],
        [
            "227.9(8.97)"
        ],
        [
            "368(14.5)"
        ],
        [
            "306.6(12.07)"
        ],
        [
            "310.6(12.23)"
        ],
        [
            "215.7(8.49)"
        ],
        [
            "70.3(2.77)"
        ],
        [
            "31.1(1.22)"
        ],
        [
            "1,766.5(69.56)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3"
        ],
        [
            "2"
        ],
        [
            "2"
        ],
        [
            "4"
        ],
        [
            "14"
        ],
        [
            "16"
        ],
        [
            "23"
        ],
        [
            "21"
        ],
        [
            "24"
        ],
        [
            "15"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "140"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CabatuanYearPop.±% p.a.1960 11,121—    1970 16,331+3.91%1975 18,778+2.84%1980 21,399+2.65%1990 26,380+2.12%1995 28,449+1.42%YearPop.±% p.a.2000 31,659+2.32%2007 34,079+1.02%2010 37,299+3.34%2015 39,413+1.06%2020 39,990+0.29%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Cabatuan, Isabela, was 39,990 people, with a density of 560 inhabitants per square kilometre or 1,500 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cabatuan"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  13.70"
        ],
        [
            "2009  12.73"
        ],
        [
            "2012  14.15"
        ],
        [
            "2015  11.58"
        ],
        [
            "2018  11.02"
        ],
        [
            "2021  11.08"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "According to the Bureau of Local Government Finance, the annual regular revenue of Cabatuan for the fiscal year of 2016 was ₱106,631,260.21."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipality of Cabatuan is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Cabatuan Municipal Council (2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative(3rd Legislative District of the Province of Isabela)"
        ],
        [
            "Ian Paul L. Dy"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Bernardo A. Garcia, Jr."
        ],
        [
            "Municipal Vice Mayor"
        ],
        [
            "Charlton L. Uy"
        ],
        [
            "Municipal Councilors"
        ],
        [
            "Benjamin Isabelo R. Dy"
        ],
        [
            "Andres C. Alivia III"
        ],
        [
            "Randy G. Britanico"
        ],
        [
            "Rolando Velasco"
        ],
        [
            "Julian A. Dayrit"
        ],
        [
            "Jasmin L. Miano"
        ],
        [
            "Jomar D. Jarvinia"
        ],
        [
            "Krischan Laurado"
        ],
        [
            "Congress representation"
        ],
        [
            "Cabatuan, belonging to the third legislative district of the province of Isabela, currently represented by Hon.",
            "Ian Paul L. Dy."
        ],
        [
            "Infrastructure"
        ],
        [
            "Telecommunication"
        ],
        [
            "This town has excellent telecommunications facilities.",
            "The PLDT provides fixed line services.",
            "Wireless mobile communications services are provided by Smart Communications and Globe Telecommunications.",
            "Dito Telecommunity is now available offering connectivity service."
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Elementary"
        ],
        [
            "Cabatuan West Central School"
        ],
        [
            "Cabatuan East Central School"
        ],
        [
            "Luzon Elementary School"
        ],
        [
            "Paraiso Elementary School"
        ],
        [
            "Macalaoat Elementary School"
        ],
        [
            "Nueva Era Elementary School"
        ],
        [
            "Canan Elementary School"
        ],
        [
            "Diamantina Elementary School"
        ],
        [
            "La Paz Elementary School"
        ],
        [
            "Calaocan Elementary School"
        ],
        [
            "Namnama Elementary School"
        ],
        [
            "Tandul Elementary School"
        ],
        [
            "Rang-ay Elementary School"
        ],
        [
            "Culing Elementary School"
        ],
        [
            "La Salette of Cabatuan"
        ],
        [
            "Nazarette Elementary School"
        ],
        [
            "Philippine Yuh Chiau School"
        ],
        [
            "Ortiz-Saranay Elementary School"
        ],
        [
            "High school"
        ],
        [
            "Cabatuan National High School"
        ],
        [
            "La Salette of Cabatuan"
        ],
        [
            "Philippine Yuh Chiau School"
        ],
        [
            "Diamantina National High School"
        ],
        [
            "La Paz National High School"
        ],
        [
            "Banks"
        ],
        [
            "Mallig Plains Rural Bank"
        ],
        [
            "FICO Bank"
        ],
        [
            "Rural Bank of Cauayan"
        ],
        [
            "Producers Bank"
        ],
        [
            "BDO Cabatuan"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Cabatuan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Miano, Troy Alexander (November 5, 1990).",
            "\"History of Cabatuan\".",
            "Municipality of Cabatuan - cabatuan-isabela.gov.ph.",
            "Retrieved June 24, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Cabatuan, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved October 31, 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Cabatuan, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved May 15, 2022."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Cabatuan at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Municipality of Cabatuan"
        ],
        [
            "Places adjacent to Cabatuan, Isabela"
        ],
        [
            "Aurora"
        ],
        [
            "Luna"
        ],
        [
            "Cabatuan"
        ],
        [
            "San Mateo"
        ],
        [
            "Cauayan"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cabatuan,_Isabela&oldid=1230758390\""
        ],
        [
            "Categories: Municipalities of Isabela (province)Political divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Articles needing additional references from January 2014All articles needing additional referencesCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}