{
    "name": "Cabiao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cabiao"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°15′08″N 120°51′27″E﻿ / ﻿15.2522°N 120.8575°E﻿ / 15.2522; 120.8575"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Nueva Ecija, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Cabiao\" – news · newspapers · books · scholar · JSTOR (July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesCabiao"
        ],
        [
            "KabyawMunicipalityMunicipality of CabiaoKabyawan Monument"
        ],
        [
            "FlagSealNickname(s): Site of the First Cry of Nueva Ecija  Sweet Sorghum Capital of Nueva EcijaMotto(s): Bagong Cabiao, Bagong Pag-asa!",
            "Igpaw KabyawMap of Nueva Ecija with Cabiao highlightedOpenStreetMapCabiaoShow map of PhilippinesCabiaoShow map of AsiaCabiaoShow map of EarthCoordinates: 15°15′08″N 120°51′27″E﻿ / ﻿15.2522°N 120.8575°E﻿ / 15.2522; 120.8575CountryPhilippinesRegionCentral LuzonProvinceNueva EcijaDistrict"
        ],
        [
            "4th districtFoundedBetween 1765-1767Incorporated to Pampanga1797Incorporated to Nueva EcijaFebruary 9, 1848Barangays23"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRamil B. Rivera • Vice MayorMarcelino M. Simbillo • RepresentativeEmerson D. Pascual • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Edelwina P. GonzalesDemetrio M. dela Cruz Jr.Jose L. GarciaMoises M. GuevarraJulito G. WycocoReginald R. AngelesJose G. Bustamante Jr.Jorge A. Burayag"
        ],
        [
            " • Electorate58,003 voters (2022)Area • Revenue₱ 241.4 million (2020) • Assets₱ 522.6 million (2020) • Expenditure₱ 245.3 million (2020) • Liabilities₱ 299 million (2020)Service provider • ElectricityNueva Ecija 1 Electric Cooperative (NEECO 1)Time zoneUTC+8 (PST)ZIP code3107PSGC034904000IDD : area code +63 (0)44Native languagesKapampangan Tagalog IlocanoWebsitewww.cabiao.gov.ph"
        ],
        [
            "Cabiao, officially the Municipality of Cabiao (Tagalog: Bayan ng Cabiao, Kapampangan: Balen ning Cabio), is a 1st class municipality Cabiao is the 3rd most populous, one of the richest, and fastest growing municipality in the province, only behind Talavera and Guimba.",
            "If cities are included, the town ranks 6th."
        ],
        [
            "According to the National Competitiveness Council in Cities/Municipalities Competitiveness Index 2018, Cabiao is ranked 10th in Overall Municipal category with 1,400 participating municipalities and 30th place in first to second class municipal category.",
            "The town also boasts of being 2nd place in the Resiliency category."
        ],
        [
            "The town is part of the so-called \"Rice Granary Capital of the Philippines\", and is also remarked as the \"Sweet Sorghum Capital of Nueva Ecija\"."
        ],
        [
            "History"
        ],
        [
            "Gen. Mariano Llanera Monument"
        ],
        [
            "Cabiao, along with Gapan, Aliaga, Cabiao, San Isidro, and San Antonio were transferred from Pampanga to Nueva Ecija in 1848.",
            "The desire of the populace of Cabiao to be free from Spanish domination and tyranny resulted in an uprising on September 2, 1896.",
            "Numbering around 700 men (461 listed in the Tablet of Heroes in the Municipal Compound), the townsfolk of Cabiao and the Cabiao Brass Band under the leadership of their Capitan Municipal Mariano Nuñez Llanera together with the people of the neighboring towns of Arayat, Deliquente (San Antonio) & Jaen led the siege against the colonizing Spaniards stationed at the Factoria of San Isidro.",
            "The Spanish Colonial Government ceded the Philippines to the United States on December 10, 1898, via the Treaty of Paris.",
            "Once again, the Philippines was under colonial rule, this time by the American.",
            "In the last days of the Spanish occupation, the Cabiao heroes participated in the declaration of Philippine Republic in Malolos on January 23, 1899.",
            "During the Philippine–American War, Cabiao was one of the fiercely battled terrains of the American forces in pursuit of General Aguinaldo's Forces however most of the populated areas of Cabiao have been saved from the encounter.",
            "General Pio del Pilar hold out in the marshes of San Vicente and Santa Rita to delay the intruding Forces of General Elwell Stephen Otis under the command of General Henry Ware Lawton."
        ],
        [
            "In 1903, the Americans established schools in Cabiao and used the English language as a medium of instructions.",
            "Pedro Oreta was elected as the first chief executive of the town under American civil regime followed by the then Mun.",
            "President Jose Crespo who established and organized the Presidencia (township hierarchy and organizational plan) constituting the different executive department of the municipality.",
            "American occupation in Cabiao has not been as cruel as their Spanish predecessor, however, the people of Cabiao were already afraid to trust the new colonizer.",
            "Thomasites missionaries arrived in Cabiao in 1902 as a part of educating the people of Cabiao and in 1903, the Americans established schools in Cabiao and used the English language as the medium of instruction.",
            "From 1907 to 1909, Cabiao was placed under jurisdiction of San Isidro and the executive power was then held by the Municipal President of San Isidro.",
            "It was in the term of Office of Municipal President Gonzalo Del Leon that the seat of Municipal Town Hall was erected on the land donated by the Romero family.",
            "It was during the term of Jose Lapuz that Judge Bonifacio Ysip was elected as delegate to the constitutional convention held in Manila."
        ],
        [
            "After almost three decades of peace, Japan invaded the Philippines.",
            "HUKBALAHAP (Hukbo ng Bayan Laban sa Hapon) or People's Anti-Japanese Army, was then established in Sitio Bawit, San Julian, Cabiao on March 29, 1942.",
            "When the Allies between the combined U.S. and Filipino troops finally liberated the Philippines and as soon as the Central Government was established in Manila, Mariano Guevarra was appointed Mayor of Cabiao.",
            "He was the chief executive of the town in 1945.",
            "Prudencio Ortiz Luis succeeded Guevarra who occupies the position for only a few months.",
            "In later part of 1945 after the liberation, most of the people of Cabiao were still in the far flung areas of Cambabalu, Saclang Capampangan, Saclang Tagalog, and Dumanas and it was during this time that the mayor of this town has been appointed by then President Manuel Roxas by the name of Ambrosio Aligada.",
            "He was appointed as the Chief Executive of the town from 1945 to 1947."
        ],
        [
            "Cabiao was placed under the military government under Pablo Aligada.",
            "It was also during the time of Aligada that the Sitio of Palasinan (presently San Gregorio) comprising the property owned by Don Ramon Fernandez were repopulated by the people coming from said the places whereas the area of Bagong Silang were repopulate by the people coming from Buliran, Guyong-guyong, Luyos of which most of them are Tagalogs.",
            "Cabiao was governed by Aligada through coercive and dictatorial rule.",
            "Isaias Manalastas seated as the progressive mayor through the support HUKBALAHAPs that during that time is at its height from which they fielded their party named Prente Popular however it did not last long due to the suspicion of the military of an imminent grabbing of power where these party is the political front of the Huks.",
            "Nieves Pablo, a woman, was the fourth appointed mayor in that same year.",
            "At the height of the Huk uprising, when the entire town was the seat of the rebellion, fifty thousand armed men were inducted in Bawit and in Pasong Diablo, only to be captured en masse by General Ismael Lapus.",
            "The clearing of the entire forested area of Bagong Sikat and Santa Isabel was initiated to eliminate the lair of the Huk rebels."
        ],
        [
            "In 1950, when the first tenure of then Paterno Santiano began, the town's public market was constructed through the support of the national government since the towns income cannot at that time support such huge amount of expenditures.",
            "During the first tenure of Gregorio T. Crespo, the old town hall was renovated and the original Cabiao Central School Building has been restored.",
            "The gravelling of Sinipit-San Roque Road was made.",
            "Santiano was re-elected as mayor after a heavily contested election results.",
            "In 1960, Crespo was re-elected as Mayor of Cabiao, and Pedro T. Wycoco was appointed as the Chief of Police.",
            "The Gapan- Arayat Road, Cabiao Section were constructed by Golangco Construction and Development Corp. in 1963.",
            "In 1979, the town's Public Market was rehabilitated with the help of Angel Concepcion (Member of Parliament) for which main building was constructed contiguously from the previous two small one.",
            "Cabiao was governed by Crespo for almost three decades, bringing together the people of Cabiao to live in peace."
        ],
        [
            "Geography"
        ],
        [
            "Cabiao is located at the south-western part of Nueva Ecija bordering the province of Pampanga.",
            "It also borders the municipalities of San Isidro and San Antonio in the province of Nueva Ecija; the municipalities of Magalang, Candaba and Arayat in Pampanga province; and to its north-west is the municipality of Concepcion in Tarlac province.",
            "It is 37 kilometres (23 mi) from Cabanatuan, 51 kilometres (32 mi) from Palayan, and 107 kilometres (66 mi) from Manila, and 39 kilometres (24 mi) from San Fernando."
        ],
        [
            "The land area is flat-bounded river with abundant fertile soil; very ideal for cultivation.",
            "The estimated 32%, classified as rural/sub-rural areas are related in agricultural land farming.",
            "Its surrounded by irrigations and sources of water supply needed in multi-cropping.",
            "The rest land area with an estimated of 89.6 km2 situated in the core-centered are residentials, households and commercial occupancies.",
            "It is classified as urban and sub-urban areas."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cabiao, Nueva Ecija"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "4(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "5(0.2)"
        ],
        [
            "11(0.4)"
        ],
        [
            "66(2.6)"
        ],
        [
            "99(3.9)"
        ],
        [
            "127(5.0)"
        ],
        [
            "113(4.4)"
        ],
        [
            "99(3.9)"
        ],
        [
            "84(3.3)"
        ],
        [
            "35(1.4)"
        ],
        [
            "14(0.6)"
        ],
        [
            "661(26.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "2.2"
        ],
        [
            "1.9"
        ],
        [
            "3.2"
        ],
        [
            "5.3"
        ],
        [
            "16.1"
        ],
        [
            "20.8"
        ],
        [
            "23.5"
        ],
        [
            "22.8"
        ],
        [
            "22.2"
        ],
        [
            "16.5"
        ],
        [
            "8.9"
        ],
        [
            "3.5"
        ],
        [
            "146.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Cabiao is politically subdivided into 23 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bagong Buhay/ Lote"
        ],
        [
            "Bagong Sikat"
        ],
        [
            "Bagong Silang"
        ],
        [
            "Concepcion/Asyenda"
        ],
        [
            "Entablado"
        ],
        [
            "Maligaya"
        ],
        [
            "Natividad North(pob)"
        ],
        [
            "Natividad South(pob)"
        ],
        [
            "Palasinan"
        ],
        [
            "San Antonio/Pantalan"
        ],
        [
            "San Fernando Norte"
        ],
        [
            "San Fernando Sur"
        ],
        [
            "San Gregorio"
        ],
        [
            "San Juan North(pob)"
        ],
        [
            "San Juan South(pob)"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Rita"
        ],
        [
            "Sinipit"
        ],
        [
            "Polilio/Libis"
        ],
        [
            "San Carlos"
        ],
        [
            "Santa Isabel"
        ],
        [
            "Santa Ines"
        ],
        [
            "Sitio Dumanas"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CabiaoYearPop.±% p.a.1903 7,843—    1918 8,161+0.27%1939 14,617+2.81%1948 15,902+0.94%1960 21,561+2.57%1970 28,260+2.74%1975 32,752+3.00%1980 37,922+2.97%1990 48,850+2.57%1995 55,902+2.56%2000 62,624+2.46%2007 68,382+1.22%2010 72,081+1.94%2015 79,007+1.76%2020 85,862+1.65%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Cabiao had a population of 85,862.",
            "The population density was 770 inhabitants per square kilometre (2,000/sq mi)."
        ],
        [
            "Language"
        ],
        [
            "Kabyawenyos can speak two languages, Tagalog and Kapampangan.",
            "Because the town is a provincial boundary to Pampanga, most of the populace can understand and speak Kapampangan.",
            "English is predominantly used in schools and offices, replacing Tagalog as the language spoken."
        ],
        [
            "Religion"
        ],
        [
            "Almost the populace of Cabiao are Roman Catholic.",
            "Protestants like Iglesia ni Cristo, born-again Christians, Latter-day Saints, Jehovah's Witnesses, Evangelical fourth watches, Seventh-day Adventists and Baptists are the secondary religious affiliations, sects and organizations."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cabiao"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  17.20"
        ],
        [
            "2009  15.23"
        ],
        [
            "2012  15.22"
        ],
        [
            "2015  14.83"
        ],
        [
            "2018  5.71"
        ],
        [
            "2021  14.25"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Growing population and migration provides Cabiao more progressive and sustainable.",
            "Increasing the number of commercial business establishment along Jose Abad Santos Avenue, Maligaya Street, Natividad Street, and three neighbor barangays of San Roque, San Gregorio, and San Fernando Sur were located the Public market and Hospital rapidly sprouted.",
            "Urbanization in residential and poblacion areas since 2010–present are observed.",
            "From 2nd class municipality rural based in agriculture to 1st class urban municipality."
        ],
        [
            "Eastern and Southern portion engaged in farming and multi-cropping.",
            "As part of the \"Rice Granary of the Philippines\", palay growing are very sustainable and efficient because of good condition of weather, the land area is ideal for cultivation and road connections adjoined from farm to market.",
            "Cabiao annually contribute to the provincial rice productions maintain their quantities."
        ],
        [
            "Cabiao's economy is one of the fastest growing in the province of Nueva Ecija and lead as one of the most competitive municipalities in entire Central Luzon region according to the National Competitiveness Council (Philippines) Cities/Municipalities Competitiveness Index 2018.",
            "Their revenue income in calendar year 2020 reached P 280,611,660.65 in over 86,968 inhabitants.",
            "According to Commission on Audit of the Philippines 2020 data, economic performance of Cabiao are rapidly sustained.",
            "Year 2020, 2019, 2018, 2017 and year 2016 shown below:"
        ],
        [
            "Assets:"
        ],
        [
            "P 522,574,173.26"
        ],
        [
            "P 451,396,886.98"
        ],
        [
            "P 372,568,464.93"
        ],
        [
            "P 267,107,549.18"
        ],
        [
            "P 212,686,222.79"
        ],
        [
            "Liabilities:"
        ],
        [
            "P 299,048,311.11"
        ],
        [
            "P 259,324,151.71"
        ],
        [
            "P 193,280,360.65"
        ],
        [
            "P 138,700,038.84"
        ],
        [
            "P 131,995,215.81"
        ],
        [
            "Equity:"
        ],
        [
            "P 223,525,862.15"
        ],
        [
            "P 192,072,735.27"
        ],
        [
            "P 179,288,104.28"
        ],
        [
            "P 128,407,510.34"
        ],
        [
            "P 80,691,006.98"
        ],
        [
            "Income:"
        ],
        [
            "P 280,611,660.65"
        ],
        [
            "P 223,233,770.08"
        ],
        [
            "P 221,613,558.08"
        ],
        [
            "P 200,024,292.86"
        ],
        [
            "P 160,353,999.25"
        ],
        [
            "Major industries"
        ],
        [
            "Rice, corn and sorghum are the main crops for cultivation.",
            "Livestocks and contract grower provides inevitable source of income of some Kabyawenyos.",
            "Seasonal source of income are mango plantation and calamansi."
        ],
        [
            "Tourism"
        ],
        [
            "Nabao Lake with Mount Arayat at the background"
        ],
        [
            "Nabao Lake, also known as the \"Lawa ng Nabao\", features views of Mount Arayat from its own nature park.",
            "The site is composed of market stalls of handicrafts, rides, a zipline, hanging bridge and restaurants beside the lake.",
            "The groundbreaking ceremony was held on September 12, 2018.",
            "The place is developed to be pegged as the first floating market-park in the province of Nueva Ecija."
        ],
        [
            "\"Cabiokid\" Foundation is a 13-hectare fermaculture land with over 1000 species of endemic fora are preserved.",
            "The land area is composed of rice fields, swamps, mini forest and a garden."
        ],
        [
            "Historical site"
        ],
        [
            "First Cry of Nueva Ecija Marker"
        ],
        [
            "Monument of general Mariano Llanera that can be seen in front of Cabiao Municipal Hall symbolizes the heroism of the general who fought the Spaniards and led the \"First Cry of Nueva Ecija\".",
            "The place is also surrounded by bustling Philippine Mahogany trees."
        ],
        [
            "Products"
        ],
        [
            "Sweet delicacies and Pasalubong are the most visited in the town.",
            "Pastillas"
        ],
        [
            "Culture"
        ],
        [
            "Paistima Ka"
        ],
        [
            "Paistima Ka sa Kabyawan Festival, a week-long festivity every first/second week of February.",
            "The festival commemorates the founding anniversary of the town that showcases the rich culture and display the wide array of local delicacies."
        ],
        [
            "The acronym \"PaIsTiMa Ka\" is from: Pa (Palay), Is (Isda), Ti (Tinapay), Ma (Mangga), and Ka (Ikaw)."
        ],
        [
            "Kabyawan Festival"
        ],
        [
            "Kabyawan Festival Poster"
        ],
        [
            "Kabyawan Festival annually celebrated to the feast of patron's town proper Saint John Nepomocene starting May 8–16.",
            "Kabyawan is derived from grinding tools used in extracting sugarcane.",
            "The festival showcases local products and delicacies."
        ],
        [
            "The first day includes a Holy Mass in the cathedral.",
            "Festivities include a fun-run, bike-a-thon, street dancing, mass demonstration, cultural dancing, dart and poster making.",
            "A talent competition and Mayflower parade, followed by the Coronation night of Mutya ng Cabiao is the high point.",
            "A grand parade proceeds along Jose Abad Santos Avenue."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "It is about an hour and a half drive with 92 kilometre away from Manila.",
            "It can be reached via NLEX, taking San Simon exit and turning right at Santo Domingo junction in Mexico, traversing Santa Ana, and Arayat in Pampanga.",
            "The other route from Manila is taking Santa Rita exit and traversing Maharlika Road through Bulacan province to Gapan, Nueva Ecija turning left towards San Isidro.",
            "From Cabanatuan, Cabiao can be reached via Gapan or partly through the Cabiao Viaduct from Jaen town.",
            "There are also routes from Clark International Airport via Magalang traversing left to Arayat Pampanga via Jose Abad Santos Avenue (Olongapo-Gapan road)."
        ],
        [
            "Cabiao transportation is likely available in all services.",
            "The First North Luzon Transit (formerly Sierra Madre Transit.)",
            "and RJ Express Inc. are regular travel bus companies with route from Caloocan to San Isidro and vice versa via North Luzon Expressway taking San Simon exit.",
            "The regional bus company Genesis Transport, Saulog Transit,and Arayat Express also has a regular route from Olongapo - San Jose City / Cabanatuan vice versa along Jose Abad Santos Avenue (Olongapo-San Fernando-Gapan Road) R3 traversing the town.",
            "Passenger jeepneys with the regular route from Cabanatuan - Cabiao via Gapan and vice versa and Cabiao - Arayat / Cabiao - San Fernando, Pampanga via Arayat and vice versa are the common public transport services.",
            "Passenger tricycles spreadout point to point around the town has a terminal sections along the streets and market centers."
        ],
        [
            "Telecommunications"
        ],
        [
            "PLDT, Datelcom and Digitel Mobile Philippines, Inc. are the longest telecommunication company in town.",
            "Smart Communications, Talk 'N Text and Sun Cellular provide high speed signals LTE in town.",
            "Dito Telecommunity, Globe Telecom and Touch mobile upgrade their signals as LTE as part of the area site covered."
        ],
        [
            "Cabiao is part of the contagious Mega Manila as far as Cabanatuan so that several radio stations and television signals are covered."
        ],
        [
            "Education"
        ],
        [
            "Education in Cabiao is concentrated in the downtown area.",
            "Primary and secondary together with the colleges and universities are also seen in suburban barangays.",
            "These are the list of schools in Cabiao:"
        ],
        [
            "Primary Schools:"
        ],
        [
            "Cabiao Central School"
        ],
        [
            "Maligaya Elementary School"
        ],
        [
            "Palasinan Elementary School"
        ],
        [
            "San Roque Elementary School"
        ],
        [
            "Polilio Elementary School"
        ],
        [
            "San Antonio Bagong Buhay (SABBES) Elementary School"
        ],
        [
            "San Gregorio Elementary School"
        ],
        [
            "Santa Rita Elementary School"
        ],
        [
            "Bagong Silang Elementary School"
        ],
        [
            "San Fernando Sur Elementary School"
        ],
        [
            "Jose Rico Cruz Elementary School"
        ],
        [
            "Saint Josef Elementary School"
        ],
        [
            "Entablado Elementary School"
        ],
        [
            "Bagong Sikat Elementary School"
        ],
        [
            "Enrique Rivera Jr.Elementary School"
        ],
        [
            "San Carlos Elementary School"
        ],
        [
            "Sinipit Elementary School"
        ],
        [
            "Santa Isabel Elementary School"
        ],
        [
            "Concepcion Elementary School"
        ],
        [
            "San Fernando Norte Elementary School"
        ],
        [
            "San Vicente Elementary School"
        ],
        [
            "Blessed Children Integrated School"
        ],
        [
            "Little Child Jesus Christian Academy"
        ],
        [
            "God's Speed Foundation Inc."
        ],
        [
            "Legacy Accelerated Christian Academy"
        ],
        [
            "Seventhday Adventist Elementary School"
        ],
        [
            "Saint John Nepomocene Parochial School"
        ],
        [
            "Advent School Foundation Inc."
        ],
        [
            "Secondary Schools:"
        ],
        [
            "Cabiao Senior High School"
        ],
        [
            "Cabiao National High School"
        ],
        [
            "Santa Rita National High School"
        ],
        [
            "Saint John Nepomocene Parochial School"
        ],
        [
            "Saint Josef National High School"
        ],
        [
            "General Mariano Llanera High School (CNHS annex)"
        ],
        [
            "Manuel V. Gallego High School (CNHS annex)"
        ],
        [
            "Gregorio T. Crespo Memorial High School (CNHS annex)"
        ],
        [
            "Advent School Foundation Inc."
        ],
        [
            "Legacy Accelerated Christian Academy"
        ],
        [
            "Tertiary Schools:"
        ],
        [
            "Polytechnic University of the Philippines, Cabiao campus"
        ],
        [
            "Cabiao Technological College Inc."
        ],
        [
            "Resource World College"
        ],
        [
            "First Asean International Systems College, Cabiao campus"
        ],
        [
            "Sister cities"
        ],
        [
            "Gapan, Nueva Ecija"
        ],
        [
            "Gallery"
        ],
        [
            "Municipal offices"
        ],
        [
            "Old Cabiao Town Hall, seat of Municipal Government"
        ],
        [
            "Saint John Nepomucene Parochial School facade"
        ],
        [
            "Saint John Nepomucene Parochial School exterior"
        ],
        [
            "View of Pampanga River from Sta.",
            "Isabel Bridge"
        ],
        [
            "Cabiao Floating Market"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Cabiao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Cities and Municipalities urban population\".",
            "City population.",
            "Retrieved October 28, 2018."
        ],
        [
            "^ Datu, Carlo Lorenzo J (August 22, 2018).",
            "\"National Competitiveness Council recognizes 6 Central Luzon LGUs\".",
            "Philippine News Agency.",
            "Retrieved October 18, 2018."
        ],
        [
            "^ Albano, Raizel (March 7, 2017).",
            "\"Nueva Ecija:The Rice Granary of the Philippines\".",
            "go UNESCO make heritage fun!.",
            "Retrieved October 18, 2018."
        ],
        [
            "^"
        ],
        [
            "\"Cabiao: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 4, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Nueva Ecija\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ Lanzona, Vina (2009).",
            "Amazons of the Huk rebellion: gender, sex, and revolution in the Philippines.",
            "Wisconsin Press.",
            "pp. 289–290.",
            "ISBN 9780299230937."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Galvez, Manny (January 6, 2009).",
            "\"16 Ecija towns upgraded\".",
            "Philippine Star.com.",
            "Retrieved October 28, 2018."
        ],
        [
            "^ \"Annual Audit Report\".",
            "Commission on Audit.",
            "Retrieved October 18, 2018."
        ],
        [
            "^ Galang, Marilyn (September 12, 2018).",
            "\"Nabao lake to become prime tourist attraction in Nueva Ecija\".",
            "Philippine News Agency.",
            "Retrieved October 19, 2018."
        ],
        [
            "^ Domingo, Ferdie G. (January 10, 2017).",
            "\"Cabiao plans to turn Nabao lake into tourist hub\".",
            "Manila Standard.",
            "Retrieved October 18, 2018."
        ],
        [
            "^ \"Central Luzon floating market country's 1st\".",
            "The Manila Times.",
            "Retrieved February 25, 2021."
        ],
        [
            "^ Corpus, Rina Angela (March 23, 2013).",
            "\"Cabiokid:Sanctuary of sustainability\".",
            "Rappler.com.",
            "Retrieved October 18, 2018."
        ],
        [
            "^ Bentandan, Almira (December 19, 2014).",
            "\"Pastillas king's homemade success\".",
            "Department of Agriculture:Philippine Carabao Center.",
            "Retrieved October 20, 2018."
        ],
        [
            "^ Aspiras, Reggie.",
            "\"Homemade 'pastillas'from Cabiao Nueva Ecija, and other 'best desserts'\".",
            "Inquirer.Net.",
            "Retrieved October 18, 2018."
        ],
        [
            "^ Nazareno, Maricel.",
            "\"Kabyawan festival:Beauty in Nueva Ecija\".",
            "Philippine knoji.com.",
            "Retrieved October 20, 2018."
        ],
        [
            "^ Nazareno, Maricel.",
            "\"Beauty in Nueva Ecija:Kabyawan Festival\".",
            "Philippine knoji.com.",
            "Retrieved October 19, 2018."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Cabiao."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "National Competitiveness Council (Philippines)"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Cabiao"
        ],
        [
            "Concepcion, Tarlac"
        ],
        [
            "San Antonio"
        ],
        [
            "Magalang, Pampanga"
        ],
        [
            "Cabiao"
        ],
        [
            "San Isidro"
        ],
        [
            "Arayat, Pampanga"
        ],
        [
            "Candaba, Pampanga"
        ],
        [
            "vte Province of Nueva EcijaPalayan (capital)  Cabanatuan (largest city)Municipalities"
        ],
        [
            "Aliaga"
        ],
        [
            "Bongabon"
        ],
        [
            "Cabiao"
        ],
        [
            "Carranglan"
        ],
        [
            "Cuyapo"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Guimba"
        ],
        [
            "Jaen"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Llanera"
        ],
        [
            "Lupao"
        ],
        [
            "Nampicuan"
        ],
        [
            "Pantabangan"
        ],
        [
            "Peñaranda"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Leonardo"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Zaragoza"
        ],
        [
            "Component cities"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Jose"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cabiao&oldid=1222953980\""
        ],
        [
            "Categories: Municipalities of Nueva EcijaPopulated places on the Pampanga RiverHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Articles needing additional references from July 2020All articles needing additional referencesPages using infobox settlement with possible nickname listPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using infobox settlement with possible demonym listCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}