{
    "name": "Cabugao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cabugao"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°47′41″N 120°27′20″E﻿ / ﻿17.7947°N 120.4556°E﻿ / 17.7947; 120.4556"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Sur, Philippines"
        ],
        [
            "Not to be confused with Kabugao."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Cabugao\" – news · newspapers · books · scholar · JSTOR (September 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesCabugaoMunicipalityMunicipality of CabugaoSunset at Cabugao Beach"
        ],
        [
            "FlagSealMotto: Bagnos Cabugao!Map of Ilocos Sur with Cabugao highlightedOpenStreetMapCabugaoLocation within the PhilippinesCoordinates: 17°47′41″N 120°27′20″E﻿ / ﻿17.7947°N 120.4556°E﻿ / 17.7947; 120.4556CountryPhilippinesRegionIlocos RegionProvinceIlocos SurDistrict"
        ],
        [
            "1st districtFounded1781Barangays33"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEdgardo S. Cobangbang Jr. • Vice MayorJemaima T. Yee • RepresentativeDeogracias Victor B. Savellano • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Josh Edward S. CobangbangDanilo Q. GazmenAmelia S. AbarquezJeremy A. Seguban Jr.Bryann Jett S. PanoMariedes D. SollerRandy Baniaga G. KinaudDodjie S. Santella"
        ],
        [
            " • Electorate27,278 voters (2022)Area • Revenue₱ 327.9 million (2020) • Assets₱ 1,740 million (2020) • Expenditure₱ 208.7 million (2020) • Liabilities₱ 103.4 million (2020)Service provider • ElectricityIlocos Sur Electric Cooperative (ISECO)Time zoneUTC+8 (PST)ZIP code2732PSGC012905000IDD : area code +63 (0)77Native languagesIlocano TagalogWebsitecabugao.gov.ph"
        ],
        [
            "Cabugao, officially the Municipality of Cabugao (Ilocano: Ili ti Cabugao; Filipino: Bayan ng Cabugao), is a 1st class municipality in the province of Ilocos Sur, Philippines.",
            "According to the 2020 census, it has a population of 38,884 people."
        ],
        [
            "Etymology"
        ],
        [
            "In the beginning, the place was only a wilderness, a thick forest where peaceful nomadic tribesman roamed and hunted.",
            "For fish, which were also abundant, there was a river.",
            "On these occasional visits, the hunters noticed the fertile and flatlands that could be tilled, and they decided to stay.",
            "They were the first settlers."
        ],
        [
            "As to how the name of the town evolved, there are interesting legends transmitted through generations."
        ],
        [
            "Some claimed that during the pre-Hispanic regime, there were also numerous uncivilized warring tribes.",
            "Kabu Angaw, a man with a good sense of humor headed one such tribe.",
            "In an intertribal rivalry, Kabu Angaw suffered defeat, forcing him and his remaining warriors to move southward until they reached the village where the friendly and hospitable nomads settled.",
            "Kabu Angaw's natural carefree manners and ability to relate entertaining stories endeared him to the settlers, especially the young.",
            "His fairness and righteousness earned him respect and esteem, eventually making him ahe village chieftain.",
            "His leadership became legendary so much that his people were referred to as “taga Kabu Angaw”.",
            "When he died, the villagers deeply mourned ouch a great loss."
        ],
        [
            "On the other hand, some assert that the village by the river was ruled by a certain Aggao.",
            "When the Spaniards arrived, his subjects called him “Cabo Aggao” meant chief.",
            "Finding difficulty in pronouncing the headman's name, the Spaniards contracted it to “Cabugao” denoting not only the ruler but also the place he ruled."
        ],
        [
            "As time passed, Kabu Angaw or Cabo Aggao was transformed into Cabugao."
        ],
        [
            "Geography"
        ],
        [
            "Cabugao is the second northernmost town of the province of Ilocos Sur.",
            "It is 27 kilometres (17 mi) from Vigan City, the capital of the province; 55 kilometres (34 mi) from Laoag City, the capital of Ilocos Norte; 163 kilometres (101 mi) from the San Fernando, La Union, the regional center; and 432 kilometres (268 mi) north of Manila.",
            "It is accessible by almost all modes of land transportation and a 7–kilometer portion of the MacArthur Highway passes through the town center."
        ],
        [
            "Its total land area is 9,556 hectares (23,610 acres).",
            "It is bordered by Sinait to the north, San Juan to the south, and to the east by Nueva Era, Ilocos Norte and the Cordillera Mountain Ranges; and on the west by the South China Sea."
        ],
        [
            "Topography"
        ],
        [
            "The Cordillera mountain range borders on the eastern part of the municipality.",
            "Hills are located in all the four corners of the municipality.",
            "Off the coast of Barangay Sabang there is Salomague Island."
        ],
        [
            "The Cabugao River is the largest river in the municipality.",
            "Two tributaries to the east feed the main channel of the Cabugao River.",
            "The headwaters of the north fork of the Cabugao River originate in Sitio Caset in Barangay Maradodon and the southern fork's headwaters originate in Sitio Gaco in Barangay Cacadiran.",
            "Cabugao's drinking water supply comes from three water resources in the Cordillera mountain range."
        ],
        [
            "The barangays that lie along the Cabugao River are flood prone areas during the rainy season.",
            "The uncontrollable surges of water erode the properties that line the Cabugao River endangering life and limb.",
            "The creek that runs through the poblacion easily clogs up in rain causing portions near it to be inundated."
        ],
        [
            "Barangays"
        ],
        [
            "Cabugao is politically subdivided into 33 barangays  Each barangay consists of puroks and some have sitios."
        ],
        [
            "There are four barangays that are in the poblacion which are considered urban (highlighted in bold) and the rest of the 29 barangays are rural.",
            "There are 94 sitios."
        ],
        [
            "Alinaay"
        ],
        [
            "Aragan"
        ],
        [
            "Arnap"
        ],
        [
            "Baclig (Poblacion)"
        ],
        [
            "Bato"
        ],
        [
            "Bonifacio (Poblacion)"
        ],
        [
            "Bungro"
        ],
        [
            "Cacadiran"
        ],
        [
            "Caellayan"
        ],
        [
            "Carusipan"
        ],
        [
            "Catucdaan"
        ],
        [
            "Cuancabal"
        ],
        [
            "Cuantacla"
        ],
        [
            "Daclapan"
        ],
        [
            "Dardarat"
        ],
        [
            "Lipit"
        ],
        [
            "Maradodon"
        ],
        [
            "Margaay"
        ],
        [
            "Nagsantaan"
        ],
        [
            "Nagsincaoan"
        ],
        [
            "Namruangan"
        ],
        [
            "Pila"
        ],
        [
            "Pug-os"
        ],
        [
            "Quezon (Poblacion)"
        ],
        [
            "Reppaac"
        ],
        [
            "Rizal (Poblacion)"
        ],
        [
            "Sabang"
        ],
        [
            "Sagayaden"
        ],
        [
            "Salapasap"
        ],
        [
            "Salomague"
        ],
        [
            "Sisim"
        ],
        [
            "Turod"
        ],
        [
            "Turod-Patac"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cabugao, Ilocos Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "18(64)"
        ],
        [
            "19(66)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "19(66)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "9(0.4)"
        ],
        [
            "11(0.4)"
        ],
        [
            "13(0.5)"
        ],
        [
            "23(0.9)"
        ],
        [
            "92(3.6)"
        ],
        [
            "122(4.8)"
        ],
        [
            "153(6.0)"
        ],
        [
            "137(5.4)"
        ],
        [
            "139(5.5)"
        ],
        [
            "141(5.6)"
        ],
        [
            "42(1.7)"
        ],
        [
            "14(0.6)"
        ],
        [
            "896(35.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "4.6"
        ],
        [
            "4.0"
        ],
        [
            "6.2"
        ],
        [
            "9.1"
        ],
        [
            "19.5"
        ],
        [
            "23.2"
        ],
        [
            "24.0"
        ],
        [
            "22.5"
        ],
        [
            "21.5"
        ],
        [
            "15.2"
        ],
        [
            "10.5"
        ],
        [
            "6.0"
        ],
        [
            "166.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "The climate of Cabugao is characterized by two (2) well-pronounced seasons; dry and wet.",
            "Dry season is usually experienced from November to April; while wet (rainy) season starts in May until October.",
            "Occasional rainfall also occurs at the onset of the dry season caused by the north-east monsoon passing through the region.",
            "The town is naturally shielded from the trade winds by the Cordillera Mountain Ranges.",
            "In the middle of May, drift winds from the Pacific Ocean sweep over the area, signaling the imminent wet season."
        ],
        [
            "Temperature ranges from 21.6 to 34.7 °C (70.9 to 94.5 °F) or a minimum temperature of 23.9 °C (75.0 °F) and a 31.9 °C (89.4 °F) maximum.",
            "Average relative humidity is 87.3%."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CabugaoYearPop.±% p.a.1903 8,848—    1918 12,602+2.39%1939 13,867+0.46%1948 14,823+0.74%1960 17,791+1.53%YearPop.±% p.a.1970 20,444+1.40%1975 22,664+2.09%1980 24,424+1.51%1990 28,033+1.39%1995 28,567+0.35%YearPop.±% p.a.2000 31,459+2.09%2007 33,847+1.01%2010 35,706+1.96%2015 37,501+0.94%2020 38,884+0.71%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Cabugao had a population of 38,884.",
            "The population density was 410 inhabitants per square kilometre (1,100/sq mi)."
        ],
        [
            "The first data on population of the Municipality of Cabugao was recorded on March 2, 1903, indicating 8,848 residents.",
            "This number steadily increased to 35,706 in the 2010 census.",
            "The biggest population increase was on December 31, 1918, with 3,754."
        ],
        [
            "Religion"
        ],
        [
            "The people of Cabugao are generally religious.",
            "A majority of the population is Roman Catholic, while a sizable number practice other religions such as the Iglesia Filipina Independiente, Iglesia ni Cristo, various Protestants groups, the Church of Jesus the Latter Day Saints, and Islam."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cabugao"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  23.50"
        ],
        [
            "2009  20.67"
        ],
        [
            "2012  22.46"
        ],
        [
            "2015  15.01"
        ],
        [
            "2018  6.61"
        ],
        [
            "2021  18.24"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "People are primarily engaged in farming and fishing.",
            "Cabugao, with its big poblpulatn, is one of the most urbanized towns in the province."
        ],
        [
            "While it is true that many natives of the town have gone to greener pastures in other parts of the country and abroad, the number of migrants has been offset by the number of immigrants – Pangasinenses, Bataguenos, Kapampangans and Maranaos who have come for trade and commerce and have stayed here for good."
        ],
        [
            "People's organizations and non-government organizations are active in the municipality responding to the needs of the community."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Cabugao, belonging to the first congressional district of the province of Ilocos Sur, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and councilors are elected directly by the people through an election which is held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Ronald V. Singson"
        ],
        [
            "Mayor"
        ],
        [
            "Josh Edward S. Cobangbang"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Edgardo S. Cobangbang Jr."
        ],
        [
            "Councilors"
        ],
        [
            "Michael Angelo B. Sarmiento"
        ],
        [
            "Jemaima S. Tan-Yee"
        ],
        [
            "Mariedes D. Soller"
        ],
        [
            "Jeremy A. Seguban Jr."
        ],
        [
            "Atty.",
            "Randy Baniaga G. Kinaud"
        ],
        [
            "Danni Rica G. Magdato"
        ],
        [
            "Vicky S. Serna"
        ],
        [
            "Robertson R. Gorospe"
        ],
        [
            "Tourism"
        ],
        [
            "Pug-os"
        ],
        [
            "Located along the national highway and two (2) kilometers north of the poblacion, it boasts of its fine beach, with its white sand stretching to more than half a kilometer.",
            "This attribute and the gradually sloping seabed make it a top favorite among townmates and tourists for swimming, picnics, or fun hiking.",
            "Two hotel beach resorts, Ponce del Mar and restaurant, and the privately leased municipality-owned Cabugao Public Beach and Park (renamed Cabugao Beach Resort) serve as venues for conventions, conferences, seminars, and social occasions such as weddings, baptisms, and birthdays.",
            "For those who want to seek the thrill of the paranormal, Pug-os National High School should be the perfect place to visit.",
            "Not only can you admire the history of the school, but you can also experience the hauntings at that school, such as the famous white lady, who walks or appears during a full moon or light rainy evening; a poltergeist in a classroom that is said to move chairs and is usually active a few hours before the morning classes start; and the mysterious student found pacing in a certain unoccupied room in the school campus."
        ],
        [
            "Salomague"
        ],
        [
            "The historic port of Salomague located in this barangay explains why it holds the distinction of being one of the few Ilocos barangays printed on international mariners’ map.",
            "The Port of Salomague was an ancient port of call of seafaforrs, merchants and traders from different Asian countries.",
            "During the American occupation, it served as a mooring place from boatorhat ferried across the Pacific where thousands of Ilocanos worked at sugar plantations in Hawaii and California.",
            "Now leased to a private corporation, It is the transshipment port of goods for and products to Taiwan.",
            "It is also the unloading point of commercial fishing vessels.",
            "The Saloe Island is used have inhabitants until the owners choose to have it maknhabited.",
            "A 1109-hectare island, it can be reached in less than five (5) minutes ride thrby boatcipal ordinance has declared the waters around it a fish sanctuary area, thus making it more attractive to sports fishers and scmenba divers who regularly visit it.",
            "Picnickers also frequent its eastern coast."
        ],
        [
            "Dardarat"
        ],
        [
            "Eco-tourism structures were in place in Barangay Dardarat attracting hordes of town ates and local tourists and earning for its barangay captain a prestigious award until typhoon “Feria” unleashed her fury ,razing down to the seafloor said structures.",
            "Only mangrove seedlings planted by teachers and Japanese volunteers provide the contrast theo a ow, desolate coastland.",
            "At the southern end of the place is the Dardarat Lighthouse, a Philippine Coast Guard facility that guides marine vessels."
        ],
        [
            "Sabang"
        ],
        [
            "Sabang is the take-off point for Salomague Island.",
            "Members of the Saint Claire, a Roman Catholic religious congregation, have established a place in the barangay facing the Salomague Island, also known as \"Puro\" by the locals."
        ],
        [
            "Salapasap"
        ],
        [
            "During the peak season of beach-lovers, Salapasap Beach is good alternative to Pug-os Beach.",
            "Barangay cottages are rented oatcheap rates."
        ],
        [
            "Namruangan"
        ],
        [
            "Namruangan is known for its rich fishing grounds.",
            "Situated at the mouth of the Cabugao River, it shares with barangay Salapasap the “ipon” (small fish) fishing ground.",
            "“Bugi” (fries) abound in the place.",
            "During clear weather and fishing season, fisherfolk gracefully pull the “daklis” (a big fishing net) to the tune of an Ilokano folksong."
        ],
        [
            "Daclapan"
        ],
        [
            "Daclapan is also a good place for swimming and picnics.",
            "Daclapan Coast or Cabugao Bay io local maps, is closely guarded by the barangay inhabitants against illegal fishing."
        ],
        [
            "Saint Mark the Evangelist Parish Church"
        ],
        [
            "Built in 1772, it lost part of its aesthetics when it was burned in 1965.",
            "The architectural charm of its interiors was no longer restored.",
            "However, renovation in recent years has been improved its beauty."
        ],
        [
            "Old Cabugao Public Market"
        ],
        [
            "This was the first project of the -hen Mayor Pacifi.co P Apostol.",
            "This has been converinted to Cabugao Park."
        ],
        [
            "Municipal Government Center"
        ],
        [
            "Several public buildings and structures converge in the Municipal Government Center.",
            "Among them are the municipal hall, the 66-year-old Lady Magarang, World War II Veterans’ Memorial, Children's Park and, the Cabugao Cultural and Sports Complex."
        ],
        [
            "Northern Ilocos Sur Trade Center (NISTC)"
        ],
        [
            "As the municipal public market, its strategic location on a spacious municipal property along the national highway north of the poblacion proper is strengthened by the proximity of the “dayo”, the slaughterhouse compound, and of course, the municipality-owned Cabugao Ice Plant that is within its arm's reach.",
            "It is a Department of Health Awardee as the Cleanest and Healthiest Public Market in Region I for 2002.",
            "This was erected under the administration of Mayor Andrea Soller Tan.",
            "The finishing touches and its grand opening waereadministered by Mayor Diocaesar C .Suero."
        ],
        [
            "Historic Hills and Mountains"
        ],
        [
            "Hills and a mountain stand out as reminders of the valor and heroism of our people against the three colonial powers."
        ],
        [
            "The Balaywak hills hosted a military outpost constructed by Diego Silang and his men in their bid to challenge the Spanish might.",
            "Balaywak was also a battle site between Gabriela Silang and her Ilocano and Tingguian allies on the one hand and the Spaniards and their Filipino allies on the other.",
            "For those who seek a one-of-a-kind paranormal experience, Balaywak is the place to be.",
            "The bridge found at Balaywak is said to be haunted by two white ladies and the adjacent sitios and barangays also hasvetheir own haunts."
        ],
        [
            "Mount Bimmuaya, a plateau in Barangay Maradodon, was drenched with blood of at least 18 Filipinos who perished in a clash against the Americans during the Filipino-American War."
        ],
        [
            "Balay-aran, a hill in Barangay Caellayan, was the birthplace and bastion of the town’s resistance movement against the Japanese occupation Army."
        ],
        [
            "Springs and Waterfalls"
        ],
        [
            "Several springs notably Magarang, Roma, Kinalian, Baterina and Bacques have been tapped to provide potable water to the poblacion and to some eastern barangays.",
            "A popular waterfall, Kimmandela, so named because even from a distance it resembles a candle (\"Kandela\" is the Ilocano term for \"candle),is a remarkable sight.",
            "The springs or waterfalls can be reached through hiker-friendly mountain trails and settlements at the foot of the Ilocos Mountain Range."
        ],
        [
            "Cabugao River"
        ],
        [
            "Cabugao River has two channels: one starts in Sitio Caset, Barangay Maradodon and another in Sitio Rebba, Barangay Cacadiran.",
            "The two channels meet at Barangay Alinaay and form a big branch until its mouth in Barangays Namruangan and Salapasap.",
            "It is a 12-kilometer body of water where farm animals drink and take a bath, fishermen catch fish and crabs, housewives do their laundry, and construction builders quarry stone and pebbles.",
            "The local government's program on Save Cabugao River project is a recipient of the Likas Yaman Award for Environmental Excellence as the Most Outstanding LGU-Initiated Environmental Project in Region I conferred in 2007."
        ],
        [
            "Libunao Protected Landscape"
        ],
        [
            "A protected watershed area in Sitio Caset, Barangay Maradodon."
        ],
        [
            "Culture"
        ],
        [
            "Town Fiesta"
        ],
        [
            "The annual town fiesta is held in honor of the town's patron saint, St. Mark the Evangelist, whose feast day falls on April 25 by the name of the festival is \"San Markos\" (Saint Mark).",
            "It is usually a week-long festivialled by the municipal government and the church.",
            "Agro-industrial fairs, sports festsivals, andindigenous cultural shows, coordinated and implemented with the assistance of farmers’ groups, sports’ associations, and cultural groups, enliven the merrymaking."
        ],
        [
            "Cultural Gems"
        ],
        [
            "The creativity of the people is tangibly demonstrated through their cultural innovations, “Aweng ti Kawayan” (Sound of the Bamboo), a musical instrument, is unique throughout Ilocandia.",
            "“Kinnaras”, a dance reenacting how fishermen catch fish within a fish sanctuary and “Kalapati” (Dove), a dance that mimics the graceful and gentle movements of the dove, have their origins in the town, having been choreographed by the Cabugao teachers."
        ],
        [
            "Kawayan"
        ],
        [
            "Strength and Beauty of Cabugao: The present administration is bent on promoting “kawayan” (Bamboo), the tallest grass, as a prime agricultural and forecast product.",
            "Bamboo culture, from the choice of their planting materials to the manufacturing or fabrication of bamboo products or furniture, demands strength and beauty of the character of our people.",
            "The people of Cabugao can always look up to Malakas (Strength) and Maganda (Beauty) who came from the “Kawayan” as paragons of virtuesfor the development of the town."
        ],
        [
            "Education"
        ],
        [
            "The municipality of Cabugao has currently 26 public elementary schools and some of private primary schools, and four public high schools, and these are:"
        ],
        [
            "● Cabugao National High School (Formerly “Turod National High School” )"
        ],
        [
            "● Lipit National High School"
        ],
        [
            "● Pug-os National High School"
        ],
        [
            "● Sisim National High School"
        ],
        [
            "It is also consists of one private high school:"
        ],
        [
            "● Cabugao Institute"
        ],
        [
            "And also one of partially integrated school:"
        ],
        [
            "● Cabugao Integrated School (will be formerly known as “Cabugao South Central School” )"
        ],
        [
            "Trivia"
        ],
        [
            "Salomague Port in Cabugao was an ancient port that the place of departure for over 100 sacadas destined to work in the sugarcane fields of Hawaii in the 1930s-40s and 19"
        ],
        [
            "According to local legend, the first rubber sandals entered Ilocos Sur through Salomague Port.",
            "As a result, rubber sandals are sometimes called ismagel, which is an Ilocano-ized word meaning \"smuggle.\""
        ],
        [
            "The novel \"Tree\" by F. Sionil Jose begins in Cabugao."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Cabugao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Ilocos Sur\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Cabugao: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 14, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Archived (PDF) from the original on October 6, 2020.",
            "Retrieved March 11, 2022."
        ],
        [
            "^ \"Officials – Bayan ng Cabugao\".",
            "Retrieved September 4, 2023."
        ],
        [
            "^ \"Ilocos Sur officials take oath\".",
            "PIA.",
            "June 3, 2022.",
            "Retrieved September 4, 2023."
        ],
        [
            "^ \"MGB: Mga Kaluluwang Ligaw sa Cabugao | Magandang Gabi Bayan\".",
            "YouTube."
        ],
        [
            "^ \"MGB: Mga Kaluluwang Ligaw sa Cabugao | Magandang Gabi Bayan\".",
            "YouTube."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Cabugao."
        ],
        [
            "Cabugao Website"
        ],
        [
            "Cabugao Portal Online"
        ],
        [
            "Pasyalang Ilocos Sur"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Cabugao"
        ],
        [
            "Sinait"
        ],
        [
            "South China Sea"
        ],
        [
            "Cabugao"
        ],
        [
            "Nueva Era, Ilocos Norte"
        ],
        [
            "San Juan"
        ],
        [
            "vte Province of Ilocos SurVigan (capital)  Candon (largest city)Municipalities"
        ],
        [
            "Alilem"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bantay"
        ],
        [
            "Burgos"
        ],
        [
            "Cabugao"
        ],
        [
            "Caoayan"
        ],
        [
            "Cervantes"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Lidlidda"
        ],
        [
            "Magsingal"
        ],
        [
            "Nagbukel"
        ],
        [
            "Narvacan"
        ],
        [
            "Quirino"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Juan"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Component cities"
        ],
        [
            "Candon"
        ],
        [
            "Vigan"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Sur"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cabugao&oldid=1231494501\""
        ],
        [
            "Category: Municipalities of Ilocos SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2013All articles needing additional referencesUse mdy dates from January 2023Use Philippine English from January 2023All Wikipedia articles written in Philippine EnglishInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}