{
    "name": "Cadiz",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cadiz, Negros Occidental"
        ],
        [
            "24 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogТатарча / tatarçaاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°57′N 123°18′E﻿ / ﻿10.95°N 123.3°E﻿ / 10.95; 123.3"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Component city in Negros Occidental, Philippines"
        ],
        [
            "\"Cadiz City\" redirects here.",
            "For other cities, see Cadiz (disambiguation)."
        ],
        [
            "Component city in Negros Island Region, PhilippinesCadizComponent cityCity of CadizView of Cadiz City Park"
        ],
        [
            "FlagSealNickname(s): \"City of Whales\"  \"Dinagsa Country of the North\"  \"Dried Fish Capital of Negros Occidental\"Motto(s): Bilis Cadiz, Ugyon CadiznonMap of Negros Occidental with Cadiz highlightedOpenStreetMapCadizLocation within the PhilippinesCoordinates: 10°57′N 123°18′E﻿ / ﻿10.95°N 123.3°E﻿ / 10.95; 123.3CountryPhilippinesRegionNegros Island RegionProvinceNegros OccidentalDistrict"
        ],
        [
            "2nd districtFounded1861CityhoodJuly 4, 1967Named forCádiz, SpainBarangays22"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorSalvador G. Escalante Jr. • Vice MayorLilia O. Decolongon • RepresentativeAlfredo D. Marañon III • City Council"
        ],
        [
            "Members"
        ],
        [
            "John Vincent I. EscalanteMarlon M. MetodaLalen H. LamisFrances V. GuanzonKathrina Kaye L. GustiloFria Cristine A. Cervantes-NapizaSheila Z. TabanaoWarren S. Zaragoza Sr.Maricel L. DesuyoCedric Jon Nido D. Olvido"
        ],
        [
            " • Electorate96,224 voters (2022)Area • Revenue₱ 1,212 million (2020) • Assets₱ 3,536 million (2020) • Expenditure₱ 1,279 million (2020) • Liabilities₱ 1,125 million (2020)Service provider • ElectricityNorthern Negros Electric Cooperative (NONECO)Time zoneUTC+8 (PST)ZIP code6121PSGC064504000IDD : area code +63 (0)34Native languagesHiligaynon Tagalog CebuanoNamed afterCádiz, SpainWebsitewww.cadizcity.gov.ph"
        ],
        [
            "Cadiz, officially the City of Cadiz (Hiligaynon: Dakbanwa/Syudad sang Cadiz; Cebuano: Dakbayan sa Cadiz; Filipino: Lungsod ng Cadiz), is a 2nd class component city in the province of Negros Occidental, Philippines.",
            "It was the capital of the short-lived province of Negros del Norte, before the creation of the province was declared unconstitutional on August 18, 1986."
        ],
        [
            "According to the 2020 census, it has a population of 158,544 people."
        ],
        [
            "The city is a gateway and a premier center of agro-fishery resources in Negros Island.",
            "The strategic location of the city, with a wide and rich island and marine resources and vast fertile agricultural land, and the completion of the commercial port and the construction of a fish port, will open a new opportunity for economic growth and competitiveness."
        ],
        [
            "The city is a major sugarcane-producing area.",
            "This is transported to Victorias City for further refining.",
            "Another major source of livelihood is the harvest of seafood."
        ],
        [
            "The Dinagsa Festival, a celebration which earned Cadiz the name of the Dinagsa Country of the north, is held annually on the last week of January.",
            "Some three kilometers off the coast of Barangay Cadiz Viejo is a white sand island resort of Lakawon, a popular destination among the local population."
        ],
        [
            "The current City Mayor is Salvador G. Escalante Jr. (elected 2019)."
        ],
        [
            "The city was heavily damaged by Typhoon Haiyan, but has had success with restoration efforts to a stage where conditions are comparable to its pre-calamity status."
        ],
        [
            "History"
        ],
        [
            "Cadiz traces its beginnings to the establishment of a traditional settlement in a place known as Cadiz Viejo, near the banks of the Hitalon River.",
            "Historical records showed that in 1861, the Spaniards came and named the settlement Cadiz because of its northern location which reminded them of the seaport by the same name in Spain."
        ],
        [
            "Cadiz became a municipality independent from Saravia (now E.B.",
            "Magalona) in 1878.",
            "Its first appointed Gobernadorcillo was Antonio Cabahug, married to Capitana Francisca Cito.",
            "During the outbreak of the Philippine Revolution saw Cadiz take part in the insurrection in 1898.",
            "As her sons and daughters, headed by Francisco Abelarde, took up arms against their Spanish masters."
        ],
        [
            "During the short-lived government of the cantonal state of the Federal Republica de Negros, Jose Lopez Vito was elected its president.",
            "At the onset of American rule, Cadiz was on its way to prosperity with the operation of two lumber companies in the area.",
            "The war years stopped these economic activities and brought much suffering to the people of Cadiz.",
            "The resistance movement and the local forces of the Philippine Commonwealth Army units put up the civil government in the mountains to deal with civilian affairs.",
            "In the post-war election of 1952, Joaquin Ledesma was elected mayor.",
            "Cadiz is also known as the \"City of Whales\" in 1960 because a number of whales washed to its shores in several different historical events thus became an iconic image of the city."
        ],
        [
            "Cityhood"
        ],
        [
            "In July 1967, Cadiz was inaugurated as a city by virtue of Republic Act No.",
            "4894 which was passed by Congress on June 17, 1967.",
            "The act was authored by Congressman Armando Gustilo."
        ],
        [
            "Super-Typhoon Haiyan (Yolanda)"
        ],
        [
            "In November 2013, the city was heavily damaged by the typhoon.",
            "Around 20,000 homes were damaged.",
            "In the island of Lakawon, from 250 homes, 10 was left standing.",
            "No casualties were reported in and around the city."
        ],
        [
            "Geography"
        ],
        [
            "The island resort of Lakawon is part of Barangay Cadiz Viejo"
        ],
        [
            "The old seal of Cadiz, still registered by the NHCP"
        ],
        [
            "Cadiz is located at the northern part of Negros Occidental, 63 kilometres (39 mi) away from the provincial capital of Bacolod City.",
            "The city is bounded to the north by the Visayan Sea, to the south by Silay City and Victorias City, to the east by Sagay City and to the west by the municipality of Manapla.",
            "It is located within the geographical coordinates of 10 degrees and 50 mins.",
            "Latitude NE and 125 degrees and 9 mins.",
            "longitude E."
        ],
        [
            "The total land area by land use is 52,457 hectares.",
            "An area of 7,354.59 hectares is classified as urban land, which includes residential, commercial, industrial and institutional.",
            "45,102.45 hectares are rural."
        ],
        [
            "The city has reclaimed an area of 38 hectares, 500 meters southeast of City Hall.",
            "This area is found alongside of Hitalon River and is ideal for industrial activities."
        ],
        [
            "Barangays"
        ],
        [
            "Cadiz is politically subdivided into 22 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Andres Bonifacio"
        ],
        [
            "Banquerohan"
        ],
        [
            "Barangay 1 Pob.",
            "(Zone 1)"
        ],
        [
            "Barangay 2 Pob.",
            "(Zone 2)"
        ],
        [
            "Barangay 3 Pob.",
            "(Zone 3)"
        ],
        [
            "Barangay 4 Pob.",
            "(Zone 4)"
        ],
        [
            "Barangay 5 Pob.",
            "(Zone 5)"
        ],
        [
            "Barangay 6 Pob.",
            "(Zone 6)"
        ],
        [
            "Burgos"
        ],
        [
            "Cabahug"
        ],
        [
            "Cadiz Viejo"
        ],
        [
            "Caduha-an"
        ],
        [
            "Celestino Villacin"
        ],
        [
            "Daga"
        ],
        [
            "V. F. Gustilo"
        ],
        [
            "Jerusalem"
        ],
        [
            "Luna"
        ],
        [
            "Mabini"
        ],
        [
            "Magsaysay"
        ],
        [
            "Sicaba"
        ],
        [
            "Tiglawigan"
        ],
        [
            "Tinampa-an"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cadiz, Negros Occidental"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "120(4.7)"
        ],
        [
            "87(3.4)"
        ],
        [
            "95(3.7)"
        ],
        [
            "97(3.8)"
        ],
        [
            "187(7.4)"
        ],
        [
            "263(10.4)"
        ],
        [
            "251(9.9)"
        ],
        [
            "220(8.7)"
        ],
        [
            "227(8.9)"
        ],
        [
            "268(10.6)"
        ],
        [
            "220(8.7)"
        ],
        [
            "158(6.2)"
        ],
        [
            "2,193(86.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.1"
        ],
        [
            "12.6"
        ],
        [
            "15.4"
        ],
        [
            "16.8"
        ],
        [
            "25.8"
        ],
        [
            "28.4"
        ],
        [
            "29.1"
        ],
        [
            "27.9"
        ],
        [
            "27.7"
        ],
        [
            "28.5"
        ],
        [
            "23.9"
        ],
        [
            "18.4"
        ],
        [
            "270.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CadizYearPop.±% p.a.1903 16,429—    1918 22,183+2.02%1939 41,905+3.08%1948 48,960+1.74%1960 88,542+5.06%1970 124,108+3.43%1975 127,653+0.57%1980 129,632+0.31%1990 119,772−0.79%1995 125,943+0.95%2000 141,954+2.60%2007 150,750+0.83%2010 151,500+0.18%2015 154,723+0.40%2020 158,544+0.48%Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "Hiligaynon is the major language of the city, with differences in tone and accent from the Hiligaynon used in Metro Bacolod.",
            "It is also mixed with a few Cebuano and Spanish words.",
            "Tagalog and English are widely taught but seldom used, however, both are frequently used in the academe and businesses."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cadiz"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  26.20"
        ],
        [
            "2009  27.29"
        ],
        [
            "2012  24.65"
        ],
        [
            "2015  22.54"
        ],
        [
            "2018  24.85"
        ],
        [
            "2021  22.86"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The total annual income of the city for the year under review is P429,389,619.",
            "It is derived from the actual collections of local revenues and Internal Revenue Allotment (IRA)."
        ],
        [
            "The city has a total number of 4,965 business establishments, in which 4,750 of which are classified as commercial and 215 as industrial.",
            "It has 11 pawnshops, 16 lending corporation and five banking institutions which provide financial capital to businessmen."
        ],
        [
            "The principal sources of livelihood are agriculture and fishing, with employment and business as a secondary source of income."
        ],
        [
            "Cadiz has a total agricultural area of 36,475.7429 hectares.",
            "Sugarcane remains as the prime agricultural commodity with as large as 23,571.1445 hectares or 64.5242% of the total agricultural area."
        ],
        [
            "Fish supply is more than what the city currently needs.",
            "Being rich in natural resources and considered as one of the few fishing centers of Negros Occidental, Cadiz, rich in marine resources, is envisioned to be the seafood center of Negros and an alternative tourist destination.",
            "In Barangays Daga and Tiglawigan, for instance, dried fish processing and boat building are the major economic activities."
        ],
        [
            "A P37 million multi-purpose seaport, still under construction, is envisioned to encourage both fishing and commercial vessels to dock in and use the area for trade and industry.",
            "This nationally funded seaport would create more jobs in the city."
        ],
        [
            "So far, four companies (San Miguel Corp., Pepsi Cola, Coca-Cola and Jaz Cola) have established their distribution centers within the city."
        ],
        [
            "Also located in the city is the Cadiz Solar Power Plant."
        ],
        [
            "Government"
        ],
        [
            "Office of the City Mayor of Cadiz"
        ],
        [
            "Cadiz city government building"
        ],
        [
            "Elected officials"
        ],
        [
            "Member of the Cadiz City Council (2019–2022):"
        ],
        [
            "Office"
        ],
        [
            "Name"
        ],
        [
            "City Mayor's Office"
        ],
        [
            "Salvador G. Escalante"
        ],
        [
            "City Vice Mayor / SP Office"
        ],
        [
            "Lilia O. Decolongon"
        ],
        [
            "Councilors"
        ],
        [
            "Marlon Metoda"
        ],
        [
            "Warren S. Zaragosa"
        ],
        [
            "Owen C. Desuyo"
        ],
        [
            "Fria Cervantes"
        ],
        [
            "Lalen Lamis"
        ],
        [
            "Bamboo Puey-Hinolan"
        ],
        [
            "CJ Olvido"
        ],
        [
            "Vincent Escalante"
        ],
        [
            "Sheila Tabanao"
        ],
        [
            "Agustin Jesmar Desuyo"
        ],
        [
            "List of former municipal captains, municipal presidents, town and city mayors"
        ],
        [
            "Year"
        ],
        [
            "Mayor"
        ],
        [
            "1878-1879"
        ],
        [
            "Antonio Cabahug"
        ],
        [
            "1879-1880"
        ],
        [
            "Mamerto Vito"
        ],
        [
            "1880-1882"
        ],
        [
            "Luis Vito"
        ],
        [
            "1882-1884"
        ],
        [
            "Pedro de los Santos"
        ],
        [
            "1884-1885"
        ],
        [
            "Ceferino de los Santos"
        ],
        [
            "1885-1886"
        ],
        [
            "Procopio Abelarde"
        ],
        [
            "1887-188"
        ],
        [
            "Quintin Barilea"
        ],
        [
            "1889-1890"
        ],
        [
            "Carlos Lazaro"
        ],
        [
            "1890-1892"
        ],
        [
            "Gil Javier"
        ],
        [
            "1892-1894"
        ],
        [
            "Tomas Belmonte"
        ],
        [
            "1894-1895"
        ],
        [
            "Gil Lopez Villanueva"
        ],
        [
            "1896-1897"
        ],
        [
            "Mateo Lazaro"
        ],
        [
            "1898-1900"
        ],
        [
            "José Lopez Vito"
        ],
        [
            "1900-1901"
        ],
        [
            "Miguel Araullo"
        ],
        [
            "1902-1903"
        ],
        [
            "Francisco Abelarde"
        ],
        [
            "1904-1905"
        ],
        [
            "Amado Panes"
        ],
        [
            "1906-1907"
        ],
        [
            "Fermin Belmonte"
        ],
        [
            "1908-1911"
        ],
        [
            "Ildefonso Monfort"
        ],
        [
            "1912-1915"
        ],
        [
            "Catalino Delos Santos"
        ],
        [
            "1916-1918"
        ],
        [
            "Fermin Belmonte"
        ],
        [
            "1919-1921"
        ],
        [
            "Emilio Rodriguez"
        ],
        [
            "1922-1931"
        ],
        [
            "Carlos Magalona"
        ],
        [
            "1932-1935"
        ],
        [
            "Agustin Javier"
        ],
        [
            "1935-1942"
        ],
        [
            "Pedro Villena"
        ],
        [
            "1942-1945"
        ],
        [
            "Manuel Escalante"
        ],
        [
            "1945-1946"
        ],
        [
            "Pedro Villena"
        ],
        [
            "1947-1955"
        ],
        [
            "Joaquin Ledesma"
        ],
        [
            "1955-1975"
        ],
        [
            "Heracleo Villacin, Sr."
        ],
        [
            "1975-1983"
        ],
        [
            "Pedro Ramos, Sr."
        ],
        [
            "1983-1986"
        ],
        [
            "Prudencio Olvido"
        ],
        [
            "1986-1992"
        ],
        [
            "Rowena V. Guanzon"
        ],
        [
            "1992-1994"
        ],
        [
            "Vicente Tabanao"
        ],
        [
            "1994-2001"
        ],
        [
            "Eduardo Varela"
        ],
        [
            "2001-2010"
        ],
        [
            "Salvador Escalante, Jr."
        ],
        [
            "2010–2019"
        ],
        [
            "Patrick G. Escalante, M.D."
        ],
        [
            "2019–present"
        ],
        [
            "Salvador Escalante, Jr."
        ],
        [
            "Infrastructure"
        ],
        [
            "Protective services"
        ],
        [
            "As of 2007, the city has 54 policemen serving its 150,750 citizens.",
            "The existing policemen-population ratio is 1:2,792 - above the standard ratio of 1:1,000.",
            "This necessitates that the city police force employs 97 more policemen."
        ],
        [
            "The Philippine National Police has one headquarter located at the Villa Cristina Subdivision and 6 community police unit precincts located at Barangay Daga, Barangay Banquerohan, the Public Market, Fara-on Institute, Lacawon Island and Barangay Tiglawigan.",
            "There are 3 patrol vehicles and 3 motorcycles being utilized by the police force."
        ],
        [
            "Considering that the police force ratio to the populace is not sufficient, the Civilian Volunteers Organization (CVO) was created to augment the policemen.",
            "Today, there are 40 members of CVO serving alongside the policemen of the city."
        ],
        [
            "The city has 62 traffic enforcers helping policemen direct and control the traffic flow.",
            "The city planned to hire additional traffic enforcers by 2008."
        ],
        [
            "There are three PA Detachments operating in the rural barangays with the main patrol base located at Had.",
            "Buenretiro, Barangay Burgos, I PA Special Detachment at Had.",
            "Bjormaine, Barangay Magsaysay and I PA Detachment at Had.",
            "Ladnon in Barangay Caduha-an."
        ],
        [
            "As of 2007, the Bureau of Jail Management and Penology has 8 personnel and 126 inmates.",
            "It is located in Barangay Tinampaan."
        ],
        [
            "The Bureau of Fire Protection, as of 2007, has 2 serviceable fire trucks and 24 firemen and personnel.",
            "Of these, 11 are nationally funded, including the Inspector.",
            "The other 13 are locally funded.",
            "The ratio is 1:6,226.",
            "This is higher than the standard 1 fireman per 2,000 population.",
            "Inferring from this, the city needs 50 more firemen and personnel.",
            "The development of the Busac-Busac Spring, the city has 23 serviceable fire hydrants located at different strategic locations."
        ],
        [
            "Transportation and communication"
        ],
        [
            "Cadiz is a one-hour drive from Bacolod City, the capital of Negros Occidental, by private car and an hour and fifteen minutes ride by a passenger bus.",
            "The Vallacar Transit (Ceres), the largest bus company, has a terminal here.",
            "Buses plying to San Carlos, Dumaguete, and the nearby municipalities make short stopovers here.",
            "Other services of transportations available are PUJ and van for hire vehicles.",
            "Cadiz is also accessible to Cebu via the cities of San Carlos and Escalante.",
            "Passenger buses for Cebu also pass by at the bus terminal on scheduled trips."
        ],
        [
            "The existence of communication facilities in any area plays a vital role in economic development.",
            "These facilities lessen the cost of transportation and likewise shorten the time in transacting business.",
            "Cadiz has a Bureau of Telecommunications and a post Office located at the City Engineer's Compound.",
            "There is also an air cargo service in the city.",
            "Two private companies, the JRS and LBC,  also deliver mail.",
            "Unlike the post office, home mail delivery of these private companies reaches the rural areas."
        ],
        [
            "The Cadiz Post Office has only two mail carriers and seven office personnel, including the postmaster.",
            "The recommended ratio between letter carriers and the population is 1:5,000.",
            "With the projected population of 161,393 in 2005, the current ratio between letter carriers and population is placed at 1:80,696.",
            "The city needs to hire 30 additional personnel to meet the requirement of 32 letter carriers.",
            "The population is estimated to be 165,589 in 2006; hence, an additional of 31 letter carriers will be needed to meet the new requirement of 33 letter carriers."
        ],
        [
            "Two telephone companies operate in the city, the Philippine Long Distance telephone Company located along Villena Street with a capacity of 1,500 lines and the Globe Fiber Optic Backbone Network support facility located along Cabahug Street.",
            "Cellular sites of Smart, Globe and Sun are also found in the city to cater for the wireless telephone system.",
            "The city has also five internet cafes."
        ],
        [
            "Cadiz has one satellite cable station.",
            "COMSATEL Cable TV located at San Eusebio Subdivision, Barangay Zone 2.",
            "It caters to six urban barangays, including parts of Barangay Daga and offers 45 channels to choose from.",
            "By using ordinary antennas, 3 television channels (12, 6 and 4) are viewed and received."
        ],
        [
            "The city has one FM radio station located at Villa Barbas, Barangay Zone 2, with a broadcast power of 104.5 kHz.",
            "Cadiz also receives broadcasts from stations in Bacolod, Manila, Cebu, Iloilo and other nearby provinces or towns and cities.",
            "The broadcasts are either in English, Hiligaynon, Cebuano and Filipino."
        ],
        [
            "National newspapers available in the city include the Malaya Daily Express, Bulletin Today, Philippine Daily Inquirer, Time Journal, Tempo, The Philippine Star, and Bandera.",
            "Local dailies include Negros Daily Bulletin, Sunstar and the Visayan Daily Star.",
            "The City Government of Cadiz also has the quarterly Cadiz Bulletin and the monthly Bulletin."
        ],
        [
            "By sea"
        ],
        [
            "There used to be two ferry boats of private company transporting cargoes and passengers to and from Bantayan Island."
        ],
        [
            "Healthcare"
        ],
        [
            "Cadiz Health Office"
        ],
        [
            "The government health facilities of the city consist of a district hospital with 50 beds, an emergency clinic with 5 beds and 2 extension beds, a city health clinic, 22 Barangay health centers, and 43 school clinics.",
            "There are 5 private medical clinics, 3 private family planning clinics, 2 private optical clinics and 3 private clinical laboratories.",
            "The government's x-ray clinic and dental clinic further support the health facilities of the city.",
            "There are seven drugstores, two of which are open 24 hours a day."
        ],
        [
            "Education"
        ],
        [
            "Front view of the Cadiz public library on Cabahug Street"
        ],
        [
            "Elementary"
        ],
        [
            "Cadiz West I Elementary School"
        ],
        [
            "Cadiz West II Elementary School"
        ],
        [
            "Cadiz East I Elementary School"
        ],
        [
            "Northern Negros Private School"
        ],
        [
            "Philippine Normal University (PNU Visayas Campus)"
        ],
        [
            "Holy Infant Academy"
        ],
        [
            "SPED Training Center"
        ],
        [
            "Manuel J. Escalante Elementary School"
        ],
        [
            "High School"
        ],
        [
            "Philippine Normal University (PNU Visayas Campus)"
        ],
        [
            "SPED High School"
        ],
        [
            "Holy Infant Academy"
        ],
        [
            "Dr. Vicente F. Gustilo Memorial National High School"
        ],
        [
            "Cadiz Viejo National High School"
        ],
        [
            "Caduha-an National High School"
        ],
        [
            "Sicaba National High School"
        ],
        [
            "Tiglawigan National High School"
        ],
        [
            "Villacin National High School"
        ],
        [
            "College"
        ],
        [
            "North Negros College"
        ],
        [
            "CEDAR College, Inc."
        ],
        [
            "Philippine Normal University (PNU Visayas Campus)"
        ],
        [
            "LaSalTech, Inc. - Cadiz"
        ],
        [
            "Northern Negros State College of Science and Technology - Cadiz Campus"
        ],
        [
            "Technological University of the Philippines Visayas, Cadiz Extension Campus"
        ],
        [
            "Cadiz has 76 educational institutions that offer elementary, secondary and tertiary education.",
            "67 are public schools, eight are private, and one is a state-owned university.",
            "Out of the 67 public schools, 51 offer elementary education and 16 offer secondary education.",
            "Out of eight private schools, four offer elementary education, one offers secondary and elementary, one offers solely secondary, one offers business education and vocational courses, and one offers a computer technology course.",
            "The state-owned university offers elementary, secondary and tertiary (BS in Elementary Education, BS in Secondary Education and master's degree in Education) courses."
        ],
        [
            "There are also nine private preparatory schools: Cadiz Evangelical Church Kindergarten School, Northern Negros Private School, Alpha-Omega Christian School, Seventh Day Adventist Elementary School, PNU Early Childhood Education, Kiddie's Joy Kinder School, Solid Ground Christian Academy, Cadiz Christian Learning Center and Creativity School.",
            "The seven public preparatory schools are the Cadiz East Elementary Schools 1 and 2, Cadiz West II Elementary School, Villacin Elementary School, Bayabas Elementary School, Don Luis Consing Elementary School and Caduha-an Elementary School."
        ],
        [
            "Gallery"
        ],
        [
            "One of the major streets in Cadiz"
        ],
        [
            "Cadiz children's playground"
        ],
        [
            "Cadiz wharf"
        ],
        [
            "Evangelical Church in Cadiz"
        ],
        [
            "Rice fields with Mount Silay as background, taken from the Cadiz highway"
        ],
        [
            "Covered gym near Cadiz City Hall"
        ],
        [
            "Falls in Sitio Alimatoc, Barangay Celestino Villacin"
        ],
        [
            "References"
        ],
        [
            "^  City of Cadiz |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Cadiz: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 7, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Welcome to Cadiz City, Negros Occidental, Philippines!\".",
            "Cadizcity.gov.ph.",
            "Archived from the original on September 2, 2012.",
            "Retrieved August 19, 2012."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Cadiz, Negros Occidental."
        ],
        [
            "Wikimedia Commons has media related to Cadiz, Negros Occidental."
        ],
        [
            "Official Cadiz tourism and business portal Archived January 26, 2021, at the Wayback Machine"
        ],
        [
            "Official Public Information Bulletin website"
        ],
        [
            "Official website"
        ],
        [
            "Official Cadiz news and info site Archived November 14, 2020, at the Wayback Machine"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine census information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Cadiz, Negros Occidental"
        ],
        [
            "Guimaras Strait"
        ],
        [
            "Visayan Sea"
        ],
        [
            "ManaplaVictorias"
        ],
        [
            "Cadiz"
        ],
        [
            "Sagay"
        ],
        [
            "Silay"
        ],
        [
            "Silay Volcano"
        ],
        [
            "Articles Related to Cadiz, Negros Occidental"
        ],
        [
            "vte Province of Negros OccidentalBacolod (capital and largest city)Municipalities"
        ],
        [
            "Binalbagan"
        ],
        [
            "Calatrava"
        ],
        [
            "Candoni"
        ],
        [
            "Cauayan"
        ],
        [
            "Don Salvador Benedicto"
        ],
        [
            "Enrique B. Magalona"
        ],
        [
            "Hinigaran"
        ],
        [
            "Hinoba-an"
        ],
        [
            "Ilog"
        ],
        [
            "Isabela"
        ],
        [
            "La Castellana"
        ],
        [
            "Manapla"
        ],
        [
            "Moises Padilla"
        ],
        [
            "Murcia"
        ],
        [
            "Pontevedra"
        ],
        [
            "Pulupandan"
        ],
        [
            "San Enrique"
        ],
        [
            "Toboso"
        ],
        [
            "Valladolid"
        ],
        [
            "Component cities"
        ],
        [
            "Bago"
        ],
        [
            "Cadiz"
        ],
        [
            "Escalante"
        ],
        [
            "Himamaylan"
        ],
        [
            "Kabankalan"
        ],
        [
            "La Carlota"
        ],
        [
            "Sagay"
        ],
        [
            "San Carlos"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Talisay"
        ],
        [
            "Victorias"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Bacolod (Administratively independent from the province but grouped under Negros Occidental by the Philippine Statistics Authority.)"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "vteLargest cities and municipalities in the VisayasPSA Census May 2020"
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            "Pop."
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            "Pop."
        ],
        [
            "Cebu CityBacolod"
        ],
        [
            "1"
        ],
        [
            "Cebu City"
        ],
        [
            "Central Visayas"
        ],
        [
            "964,169"
        ],
        [
            "11"
        ],
        [
            "Bago"
        ],
        [
            "Western Visayas"
        ],
        [
            "191,210"
        ],
        [
            "Lapu-LapuIloilo City"
        ],
        [
            "2"
        ],
        [
            "Bacolod"
        ],
        [
            "Western Visayas"
        ],
        [
            "600,783"
        ],
        [
            "12"
        ],
        [
            "Calbayog"
        ],
        [
            "Eastern Visayas"
        ],
        [
            "186,960"
        ],
        [
            "3"
        ],
        [
            "Lapu-Lapu"
        ],
        [
            "Central Visayas"
        ],
        [
            "497,604"
        ],
        [
            "13"
        ],
        [
            "Roxas"
        ],
        [
            "Western Visayas"
        ],
        [
            "179,292"
        ],
        [
            "4"
        ],
        [
            "Iloilo City"
        ],
        [
            "Western Visayas"
        ],
        [
            "457,626"
        ],
        [
            "14"
        ],
        [
            "Cadiz"
        ],
        [
            "Western Visayas"
        ],
        [
            "158,544"
        ],
        [
            "5"
        ],
        [
            "Mandaue"
        ],
        [
            "Central Visayas"
        ],
        [
            "364,116"
        ],
        [
            "15"
        ],
        [
            "Danao"
        ],
        [
            "Central Visayas"
        ],
        [
            "156,321"
        ],
        [
            "6"
        ],
        [
            "Talisay"
        ],
        [
            "Central Visayas"
        ],
        [
            "263,048"
        ],
        [
            "16"
        ],
        [
            "Liloan"
        ],
        [
            "Central Visayas"
        ],
        [
            "153,197"
        ],
        [
            "7"
        ],
        [
            "Tacloban"
        ],
        [
            "Eastern Visayas"
        ],
        [
            "251,881"
        ],
        [
            "17"
        ],
        [
            "Minglanilla"
        ],
        [
            "Central Visayas"
        ],
        [
            "151,002"
        ],
        [
            "8"
        ],
        [
            "Ormoc"
        ],
        [
            "Eastern Visayas"
        ],
        [
            "230,998"
        ],
        [
            "18"
        ],
        [
            "Sagay"
        ],
        [
            "Western Visayas"
        ],
        [
            "148,894"
        ],
        [
            "9"
        ],
        [
            "Toledo"
        ],
        [
            "Central Visayas"
        ],
        [
            "207,314"
        ],
        [
            "19"
        ],
        [
            "Consolacion"
        ],
        [
            "Central Visayas"
        ],
        [
            "148,012"
        ],
        [
            "10"
        ],
        [
            "Kabankalan"
        ],
        [
            "Western Visayas"
        ],
        [
            "200,198"
        ],
        [
            "20"
        ],
        [
            "Carcar"
        ],
        [
            "Central Visayas"
        ],
        [
            "136,453"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cadiz,_Negros_Occidental&oldid=1229043630\""
        ],
        [
            "Categories: Cities in Negros OccidentalPopulated places established in 18781878 establishments in the PhilippinesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse mdy dates from July 2022Pages using infobox settlement with possible nickname listPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using PH wikidata incorrectlyArticles containing Hiligaynon-language textArticles containing Cebuano-language textArticles containing Filipino-language textCommons category link from WikidataWebarchive template wayback linksPages using largest cities with nav classArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}