{
    "name": "Cagayancillo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cagayancillo"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°34′37″N 121°11′50″E﻿ / ﻿9.5769°N 121.1972°E﻿ / 9.5769; 121.1972"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Palawan, Philippines"
        ],
        [
            "This article is about the Sulu Sea island in Palawan Province.",
            "For the Sulu Sea island in Tawi-Tawi Province formerly also known as \"Cagayan\", see Mapun."
        ],
        [
            "Municipality in Mimaropa, PhilippinesCagayancilloMunicipalityMunicipality of CagayancilloView from Cagayancillo Fort"
        ],
        [
            "FlagSealMap of Palawan with Cagayancillo highlightedOpenStreetMapCagayancilloLocation within the PhilippinesCoordinates: 9°34′37″N 121°11′50″E﻿ / ﻿9.5769°N 121.1972°E﻿ / 9.5769; 121.1972CountryPhilippinesRegionMimaropaProvincePalawanDistrict"
        ],
        [
            "1st districtFounded1810Barangays12 (see Barangays)Government  • TypeSangguniang Bayan • MayorSergio S. Tapalla • Vice MayorLourdes C. Lanoy • RepresentativeEdgardo L. Salvame • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ameliana B. BuñagJerry F. BuncagNoli A. BundalElma C. FavilaJulia T. DusongNarciso T. MagbanuaRetchil S. CayaoVictoria C. Magbanua"
        ],
        [
            " • Electorate4,790 voters (2022)Area • Revenue₱  • Assets₱  • Expenditure₱  • Liabilities₱ Service provider • ElectricityPalawan Electric Cooperative (PALECO)Time zoneUTC+8 (PST)ZIP code5321PSGC175308000IDD : area code +63 (0)48Native languagesKagayanen Palawano Tagalog"
        ],
        [
            "Cagayancillo, officially the Municipality of Cagayancillo (Tagalog: Bayan ng Cagayancillo),  is a 6th class municipality in the province of Palawan, Philippines.",
            "According to the 2020 census, it has a population of 6,884 people."
        ],
        [
            "Located between the islands of Palawan and Negros in the Sulu Sea, Cagayancillo is the closest settlement to the Tubbataha National Marine Park.",
            "The word Cagayancillo is Spanish meaning \"Little Cagayan\"."
        ],
        [
            "History"
        ],
        [
            "The island was known to the first Spanish settlers in the Archipelago simply as Cagayan.",
            "They describe this territory as \"two low islets about fifteen leagues from the island of Panay\".",
            "They ruled these islets from the town of Arevalo in Iloilo by sailing south-southeast from this part of Panay, to the open sea.",
            "The islands are surrounded by many low reefs.",
            "But the Spaniards were able to discover their narrow entry, avoiding potential shipping hazards."
        ],
        [
            "During the early period of Spanish colonizations, these small islets were inhabited by four hundred people, all of whom were very skillful shipbuilders.",
            "They were from Panay, and they came to these islets in order to fortify themselves by the reefs, for fear of pirates.",
            "Then they undertook to return to Panay in order to dwell there.",
            "But many of their women died there.",
            "Seeing this, as they were soothsayers, they returned to the islands of Cagayan, from where they set out every year, and scattered themselves over all the islands to build ships.",
            "They built the ships of the Spanish Royal Navy in the Philippines, as well as galleys, galliots, and frigates.",
            "They also helped in repairing and righting ships.",
            "Being the most important people in the islands for the Spaniards, the adelantado Miguel López de Legazpi allotted their islands to the encomenderos of Negros Island.",
            "Afterwards, the colonizers found it best to put them under the direct control of the Spanish Crown.",
            "Thus, it was governed from the town of Arevalo in Iloilo."
        ],
        [
            "Historically, the islands also became part of Antique Province.",
            "It was made into a municipality in 1810, with Omabong as its first mayor."
        ],
        [
            "During the American regime, it came under the jurisdiction of Negros Occidental."
        ],
        [
            "In 1959, the following sitios were constituted into barrios of Cagayan:"
        ],
        [
            "the sitios of Banted, Nipay, Dool, Cavili, Cabayog and Langtad, as barrio Talaga;"
        ],
        [
            "the sitios of Ibiok, Panderse, Lato and Gatung-an, as barrio Mampio; and"
        ],
        [
            "sitio Nusa as Barrio Nusa"
        ],
        [
            "Geography"
        ],
        [
            "Tubbataha Park Ranger Station"
        ],
        [
            "The farthest provincial limit of the province of Palawan in the east is the island of municipality of Cagayancillo.",
            "It is approximately 178 nautical miles (330 km) east of Puerto Princesa City and only 72 nautical miles (133 km) south-west of Antique.",
            "It is located near the middle of the Sulu Sea."
        ],
        [
            "There are neither mountain ranges nor forested areas in the municipality.",
            "A hilly portion in the north-eastern part of the main island has a slope of 3-82%.",
            "The other areas are flat with the highest elevation around 2 to 3 meters.",
            "The majority of the island has a sandy loam soil not enough to support a forest."
        ],
        [
            "Barangays"
        ],
        [
            "Cagayancillo is the smallest municipality in the province of Palawan with a total land area of only 2,639 hectares (6,520 acres) as of 2007.",
            "It is composed of 31 islands and islets and is politically subdivided into 12 barangays and two island sitios (Cavili and Calusa) included under the political jurisdiction of Magsaysay.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bantayan (Poblacion)"
        ],
        [
            "Calsada (Poblacion)"
        ],
        [
            "Convento (Poblacion)"
        ],
        [
            "Lipot North (Poblacion)"
        ],
        [
            "Lipot South (Poblacion)"
        ],
        [
            "Magsaysay"
        ],
        [
            "Mampio"
        ],
        [
            "Nusa"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Tacas (Poblacion)"
        ],
        [
            "Talaga"
        ],
        [
            "Wahig (Poblacion)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cagayancillo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "57(2.2)"
        ],
        [
            "55(2.2)"
        ],
        [
            "78(3.1)"
        ],
        [
            "83(3.3)"
        ],
        [
            "217(8.5)"
        ],
        [
            "311(12.2)"
        ],
        [
            "360(14.2)"
        ],
        [
            "331(13.0)"
        ],
        [
            "324(12.8)"
        ],
        [
            "336(13.2)"
        ],
        [
            "232(9.1)"
        ],
        [
            "129(5.1)"
        ],
        [
            "2,513(98.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.7"
        ],
        [
            "9.6"
        ],
        [
            "12.2"
        ],
        [
            "12.7"
        ],
        [
            "22.4"
        ],
        [
            "25.5"
        ],
        [
            "26.8"
        ],
        [
            "25.7"
        ],
        [
            "25.4"
        ],
        [
            "25.4"
        ],
        [
            "21.5"
        ],
        [
            "18.5"
        ],
        [
            "237.4"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Cagayancillo belongs to Type II climate wherein there is no distinct wet or dry season.",
            "The dry season is usually from December to May with March as the driest month.",
            "The wet season is usually from May to November with August as the rainiest month."
        ],
        [
            "The municipality is exposed to both monsoons.",
            "The Amihan or north-east winds blow from November to March while the Habagat or south-west winds visit the area from June to October.",
            "The summer months from April to June receive the moderate daplak wind from the north-west."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CagayancilloYearPop.±% p.a.1903 2,448—    1918 3,198+1.80%1939 3,029−0.26%1948 4,167+3.61%1960 3,880−0.59%1970 3,598−0.75%1975 4,023+2.26%1980 3,992−0.15%YearPop.±% p.a.1990 5,082+2.44%1995 6,717+5.37%2000 6,348−1.20%2007 6,506+0.34%2010 7,116+3.32%2015 6,285−2.34%2020 6,884+1.81%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Cagayancillo was 6,884 people, with a density of 260 inhabitants per square kilometre or 670 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cagayancillo"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "80"
        ],
        [
            "2006  74.50"
        ],
        [
            "2009  36.63"
        ],
        [
            "2012  22.54"
        ],
        [
            "2015  31.59"
        ],
        [
            "2018  23.16"
        ],
        [
            "2021  22.12"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Landmark"
        ],
        [
            "Cagayancillo Fort"
        ],
        [
            "Cagayancillo Fort is one of the surviving defense forts in Palawan built during the Spanish Colonial Period.",
            "Work on the fort was started in the late 16th century by Father Nicolas Melo and Father Alonso Colosa, but it was not completed till the early 18th century by Father Hipolito Casiano, spanning almost 130 years.",
            "The other Spanish Colonial fortifications in Palawan are Fort Santa Isabel in Taytay and Cuyo Fort in Cuyo."
        ],
        [
            "Healthcare"
        ],
        [
            "There are no hospitals in Cagayancillo."
        ],
        [
            "Education"
        ],
        [
            "Cagayancillo has a total of 8 public elementary schools with a total of 37 classrooms.",
            "A total of 35 teachers are available in school year 2000–2001 for total enrollees of 1,110.",
            "This provides an average classroom - pupil ratio and teacher - pupil ratio 1:39.",
            "This ratio is above the national standard of 1:50 classroom - pupil and teacher- pupil ratios.",
            "Enrollment participation rate is estimated at 85.03% for school year 2000–2001.",
            "In secondary education, the municipality has one national high school located in the Poblacion.",
            "There were 9 classrooms and 13 secondary school teachers giving an average ratio of 1:52 classroom -student ratio.",
            "Secondary school participation rate was low at 69%."
        ],
        [
            "See also"
        ],
        [
            "List of islands of the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Cagayancillo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Miguel de Loarca, Relacion de las Yslas Filipinas (Arevalo: June 1782) in BLAIR, Emma Helen & ROBERTSON, James Alexander, eds.",
            "(1903).",
            "The Philippine Islands, 1493–1803.",
            "Volume 05 of 55 (1582–1583).",
            "Historical introduction and additional notes by Edward Gaylord BOURNE.",
            "Cleveland, Ohio: Arthur H. Clark Company.",
            "ISBN 978-0554259598.",
            "OCLC 769945704.",
            "\"Explorations by early navigators, descriptions of the islands and their peoples, their history and records of the catholic missions, as related in contemporaneous books and manuscripts, showing the political, economic, commercial and religious conditions of those islands from their earliest relations with European nations to the beginning of the nineteenth century.",
            "\", p. 79."
        ],
        [
            "^ \"Cagayancillo\" (PDF).",
            "Provincial Government of Palawan.",
            "Archived from the original (PDF) on 2012-03-04.",
            "Retrieved 9 November 2012."
        ],
        [
            "^ \"R.A. No.",
            "2103, An Act Creating Certain Barrios in the Municipality of Cagayancillo, Province of Palawan\".",
            "LawPH.com.",
            "Retrieved 2011-04-13."
        ],
        [
            "^ a b Arquiza, Yasmin D. and White, Alan T (1999).",
            "\"Tales from Tubbataha (2nd ed.)\".",
            "Sulu Fund for Conservation Foundation, Cebu.",
            "ISBN 971-569-337-7."
        ],
        [
            "^ \"Municipality of Cagayancillo\" Archived 2017-08-04 at the Wayback Machine.",
            "National Statistical Coordination Board.",
            "Retrieved on 2011-02-02."
        ],
        [
            "^ \"Background Study Guide of Cagayancillo\".",
            "SIL Kagayanen Language Team Updates.",
            "December 1988."
        ],
        [
            "^"
        ],
        [
            "\"Cagayancillo: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 17 November 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Palawan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Muog (2008-01-30).",
            "\"Cagayancillo Fort\".",
            "Muog: Spanish Colonial Fortifications in the Philippines.",
            "Retrieved on 2011-02-03."
        ],
        [
            "^ \"Things to do and see in Palawan\".",
            "Lakbay Pilipinas.",
            "Retrieved on 2011-02-03."
        ],
        [
            "^ <SIL Int'l fieldworker>"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Cagayancillo."
        ],
        [
            "Wikivoyage has a travel guide for Cagayancillo."
        ],
        [
            "Cagayancillo Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Cagayancillo"
        ],
        [
            "Cuyo / MagsaysaySulu Sea"
        ],
        [
            "Puerto Princesa / Sulu Sea"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Sulu Sea"
        ],
        [
            "Sulu Sea"
        ],
        [
            "vte Province of PalawanPuerto Princesa (capital and largest city)Municipalities"
        ],
        [
            "Aborlan"
        ],
        [
            "Agutaya"
        ],
        [
            "Araceli"
        ],
        [
            "Balabac"
        ],
        [
            "Bataraza"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Busuanga"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Coron"
        ],
        [
            "Culion"
        ],
        [
            "Cuyo"
        ],
        [
            "Dumaran"
        ],
        [
            "El Nido"
        ],
        [
            "Kalayaan"
        ],
        [
            "Linapacan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Narra"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "San Vicente"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Taytay"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Puerto Princesa (Administratively independent from the province but grouped under Palawan by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cagayancillo&oldid=1208944354\""
        ],
        [
            "Categories: Municipalities of PalawanIslands of PalawanIsland municipalities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from February 2014Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}