{
    "name": "Cajidiocan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cajidiocan"
        ],
        [
            "17 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°22′N 122°41′E﻿ / ﻿12.37°N 122.68°E﻿ / 12.37; 122.68"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Romblon, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesCajidiocanMunicipalityMunicipality of Cajidiocan"
        ],
        [
            "FlagSealMap of Romblon with Cajidiocan highlightedOpenStreetMapCajidiocanLocation within the PhilippinesCoordinates: 12°22′N 122°41′E﻿ / ﻿12.37°N 122.68°E﻿ / 12.37; 122.68CountryPhilippinesRegionMimaropaProvinceRomblonDistrict"
        ],
        [
            "Lone districtFounded1744 (as pueblo Sibuyan)IncorporatedOctober 1, 1946Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAtty.",
            "Marvin \"Greggy\" R. Ramos • Vice MayorKenyo \"Ken\" R. Rabino • RepresentativeEleandro Jesus F. Madrona • Councilors"
        ],
        [
            "Rufino Marc R. Gotanco"
        ],
        [
            "Cleto R. Ramilo"
        ],
        [
            "Jayner Jonathan M. Porras"
        ],
        [
            "Athena B. Malapitan"
        ],
        [
            "Rigor M. Ramos"
        ],
        [
            "Shirley R. Dianco"
        ],
        [
            "Mabini T. Maca"
        ],
        [
            "Haide R. Rabino"
        ],
        [
            "Angeline R. Rizo - ABC President"
        ],
        [
            "Lydia R. Raet - MIPMR"
        ],
        [
            "Evo R. RAñon - SK Fed President"
        ],
        [
            " • Electorate14,136 voters (2022)Area • Revenue₱ 75.35 million (2020) • Assets₱ 192.7 million (2020) • Expenditure₱ 53.98 million (2020) • Liabilities₱ 35.09 million (2020)Service provider • ElectricityRomblon Electric Cooperative (ROMELCO)Time zoneUTC+8 (PST)ZIP code5512PSGC175903000IDD : area code +63 (0)42Native languagesRomblomanon Tagalog"
        ],
        [
            "Cajidiocan, officially the Municipality of Cajidiocan,  is a 3rd class municipality in the province of Romblon, Philippines.",
            "According to the 2020 census, it has a population of 23,259 people."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "According to Miguel de Loarca's Relacion de Las Islas Filipinas, the Spaniards led by conquistador Martin de Goiti arrived on Sibuyan Island on 10 May 1570 from Panay.",
            "Hence, Cajidiocan, as well as the rest of Romblon, became part of the province of Panay.",
            "It was administered as a visita (barrio) of pueblo de Romblon, together with Visita de Azagra."
        ],
        [
            "In 1744, Pueblo de Sibuyan was founded by the Spaniards with Visita de Cajidiocan as its seat.",
            "It was one of the early pueblos established and administered as part of Capiz province, the others being Cabolutan, San Agustin (established in 1700), Looc, established in 1844, Romblon and Banton.",
            "Beginning in 1779, the friars ordered the construction of stone fortifications in these four pueblos as a defense against attacks from Muslim pirates.",
            "One of these forts was built in Bantay de Lubug, Cajidiocan."
        ],
        [
            "On 23 July 1843, the pueblo changed its name to Cajidiocan, derived from the word jidioc, which means \"palm\", an abundant tree in the area."
        ],
        [
            "Modern history"
        ],
        [
            "When the Americans arrived in the Philippines and introduced civilian government in Romblon on 16 March 1901, Cajidiocan was one of 11 new municipalities created.",
            "However, when Romblon was abolished as a province on 15 July 1907 due to insufficient income, jurisdiction of the municipality was returned to Capiz, which would last until 1917, when Romblon was reinstated as a province."
        ],
        [
            "On 8 June 1940, by virtue of Commonwealth Act No.",
            "581 authored by Congressman Leonardo Festin, the special municipality of Sibuyan was created, with Cajidiocan as its seat and absorbing the neighboring municipalities of Magdiwang and San Fernando."
        ],
        [
            "In 1958, Sibuyan's first government hospital, the Sibuyan District Hospital was established by virtue of Republic Act No.",
            "2400, sponsored by Congressman Jose D. Moreno.",
            "On 18 June 1961, through Republic Act No.",
            "3384, Cantagda was created into a separate barrio taken from barrio Danao.",
            "Meanwhile, on 17 June 1961 barrio Lumbang was split into two barrios of Lumbang Este and Lumbang Oeste with its old barrio Centro located at Barangay Lumbang Este, while sitios attached to Lumbang Oeste were the following: Pawala, Guinalan, Cansuyat, Agnaga and Hagimit."
        ],
        [
            "In February 2018, the government planned the construction of a road that would go through Mt.",
            "Guiting-guiting Natural Park Protected Area, effectively endangering thousands of Sibuyan Island pristine forests that have never been touched by man."
        ],
        [
            "Geography"
        ],
        [
            "Cajidiocan is located in the north-eastern portion of Sibuyan Island.",
            "To its west is the municipality of Magdiwang and to its south is the municipality of San Fernando.",
            "To its east lies Sibuyan Sea.",
            "It has a total land area of 201.85 km2.",
            "60 percent of which is part of the Mount Guiting-Guiting Natural Park, a mountainous protected wildlife area composed of lush tropical rainforest surrounding the Mount Guiting-Guiting, Sibuyan's tallest mountain.",
            "It has narrow strips of flat land along the coast where much of the population is concentrated."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cajidiocan, Romblon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "47(1.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "39(1.5)"
        ],
        [
            "48(1.9)"
        ],
        [
            "98(3.9)"
        ],
        [
            "150(5.9)"
        ],
        [
            "169(6.7)"
        ],
        [
            "147(5.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "172(6.8)"
        ],
        [
            "118(4.6)"
        ],
        [
            "80(3.1)"
        ],
        [
            "1,264(49.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "8.2"
        ],
        [
            "9.3"
        ],
        [
            "9.7"
        ],
        [
            "19.1"
        ],
        [
            "25.6"
        ],
        [
            "27.4"
        ],
        [
            "25.5"
        ],
        [
            "25.5"
        ],
        [
            "25.2"
        ],
        [
            "18.5"
        ],
        [
            "14.5"
        ],
        [
            "219.9"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Barangays"
        ],
        [
            "Cajidiocan is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alibagon"
        ],
        [
            "Cambajao"
        ],
        [
            "Cambalo"
        ],
        [
            "Cambijang"
        ],
        [
            "Cantagda"
        ],
        [
            "Danao"
        ],
        [
            "Gutivan"
        ],
        [
            "Lico"
        ],
        [
            "Lumbang Este"
        ],
        [
            "Lumbang Weste"
        ],
        [
            "Marigondon"
        ],
        [
            "Poblacion"
        ],
        [
            "Sugod"
        ],
        [
            "Taguilos"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CajidiocanYearPop.±% p.a.1903 4,464—    1918 8,429+4.33%1939 7,854−0.34%1948 8,966+1.48%1960 9,700+0.66%YearPop.±% p.a.1970 12,030+2.17%1975 13,350+2.11%1980 14,292+1.37%1990 17,250+1.90%1995 17,511+0.28%YearPop.±% p.a.2000 19,369+2.19%2007 21,292+1.31%2010 21,198−0.16%2015 21,861+0.59%2020 23,259+1.23%Source: Philippine Statistics Authority"
        ],
        [
            "The locals speak a variant of the Romblomanon language, locally called Sibuyanon (Sibuyanon Cajidiocanon style)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cajidiocan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  47.40"
        ],
        [
            "2009  50.38"
        ],
        [
            "2012  38.13"
        ],
        [
            "2015  36.47"
        ],
        [
            "2018  28.71"
        ],
        [
            "2021  35.18"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Because of the abundance of palm trees in its coastal plains and its proximity to the sea, copra farming and fishing are the main sources of livelihood in Cajidiocan.",
            "Other livelihood and investment opportunities include agri-business, fish culture and processing, marble mining and processing, cut flower cultivation, cottage industries, garment manufacturing, banking, and tourism."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "See also: Philippine municipality"
        ],
        [
            "As a municipality in the Province of Romblon, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "Pursuant to Chapter II, Title II, Book III of Republic Act 7160 or the Local Government Code of 1991, the municipal government is composed of a mayor (alkalde), a vice mayor (bise alkalde) and members (kagawad) of the legislative branch Sangguniang Bayan alongside a secretary to the said legislature, all of which are elected to a three-year term and are eligible to run for three consecutive terms."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors."
        ],
        [
            "Elected officials"
        ],
        [
            "The incumbent mayor and vice mayor of Cajidiocan are Greggy Royo Ramos from the PDP Laban Party and Kenyo \"Ken\" R. Rabino from the PDP–Laban party."
        ],
        [
            "Infrastructure"
        ],
        [
            "Utilities"
        ],
        [
            "The Romblon Electric Cooperative (ROMELCO) facilitates the power supply in the entire Sibuyan Island, including Cajidiocan.",
            "As for water supply, the town has a potable water system, which comes from jet pumps, open wells, artesian wells, and springs.",
            "A water irrigation project is also present in the municipality with 188 service areas.",
            "Landline and mobile telephone services are also available through PLDT, Smart Communications, and Globe Telecom."
        ],
        [
            "Transportation"
        ],
        [
            "Cajidiocan is connected to its neighboring municipalities by the Sibuyan Circumferential Road.",
            "Common forms of transportation are light vehicles, including jeepneys, motorcycles, tricycles, and small trucks."
        ],
        [
            "To reach Cajidiocan, visitors can take a RORO ferry from Manila or Batangas City to Ambulong Port in Magdiwang.",
            "From there, there are jeepneys that can take visitors to Cajidiocan.",
            "Another route is by air via AirSWIFT which operates four flights weekly from Manila to Tugdan Airport in Alcantara, Romblon."
        ],
        [
            "Tourism"
        ],
        [
            "Cajidiocan has a lot of eco-tourism potential due to its lush natural environment and pristine rivers and falls."
        ],
        [
            " Cawa-cawa Falls: Seven kilometers deep into the heart of Cajidiocan forest is Cawa-Cawa Falls.",
            "The central basin, 10 yards deep, resembles a cauldron hence the Spanish name.",
            "It has three levels but one has to do a little bouldering to see all levels.",
            "But those who don’t want to romance the rocks can stay at the lower basin which is also swimmable and has some pretty clear waters.",
            "The place has a pay-parking area and collects entrance fees.",
            "It can be reached using a motorcycle and any four-wheeled vehicle.",
            "Cawa-cawa Falls is managed and maintained by the Barangay LGU of Lumbang West.",
            "Further development of Cawa Cawa Falls includes the construction of cottages, restrooms, dressing rooms, additional access roads, parking areas, reception areas, and other necessary facilities in the operation and maintenance."
        ],
        [
            " Agbalit Mountain River Resort:is a natural pool built within the river using river rocks and stones.",
            "It was named after the “Balit” tree which grows abundantly in the area.",
            "It is located at Sitio Camanglad, Barangay Danao, 12 kilometers from the town proper.",
            "It will take approximately 30-45 minutes from Cajidiocan town proper.",
            "Upon reaching Danao proper, it will take another 30 minutes to drive to the destination (parking area).",
            "From the parking area, one must hike for 15-20 minutes to reach the actual pool.",
            "The place can be reached by motorcycle or any 4-wheeled vehicle.",
            "A pay parking area is provided for all vehicles.",
            "Everybody will enjoy the clean, fresh, and cold water, especially during summer.",
            "This resort is managed and maintained by Barangay Danao.",
            "As of January 2023, an entrance fee of P5 per person for local residents and Sibuyanons is collected.",
            "Foreign Tourists must pay the P10 entrance fee.",
            "Cottages are also available for rent.",
            "There are still improvements and developments to be made in this attraction which include an additional access road, reception area, comfort rooms, drinking water stations, hiring of lifeguards, security guards, and other personnel."
        ],
        [
            "Gomot Falls: is a natural 20-meter-tall waterfall located at Sitio Sinapawan and is part of IP’s Ancestral domain.",
            "This emerging tourist spot can trek via an access road from Sugod Barangay Hall towards Sitio Nalus-ocan.",
            "Tourists can take motorcycles up to Sitio Sinapawan"
        ],
        [
            "Alibagon Beach: A small crescent of white sandy beach ideal for swimming and picnic, sail boating, and mountain hiking."
        ],
        [
            " Little Baguio Falls: Take a break from outside pressure and feel the crash of the crystal clear, cool water from the waterfalls, surrounded by boulders and trees that provide visitors shades.",
            "It is about four kilometers from Poblacion."
        ],
        [
            "References"
        ],
        [
            "^ a b \"Republic Act No.",
            "38 : REPUBLIC ACTS - PHILIPPINE LAWS STATUTES and CODES - CHANROBLES VIRTUAL LAW LIBRARY\".",
            "laws.chanrobles.com."
        ],
        [
            "^  Municipality of Cajidiocan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Corp, ABS-CBN (8 July 2021).",
            "\"The Galapagos of Asia: Sibuyan Island\".",
            "Choose Philippines."
        ],
        [
            "^ a b c d e f \"History of Cajidiocan, Romblon\".",
            "Reference.com.",
            "Archived from the original on 2015-04-11.",
            "Retrieved 18 August 2014."
        ],
        [
            "^ a b c d e f g h Fabula, Milex (2001).",
            "\"Profile: Cajidiocan\".",
            "Romblon Travel Guide.",
            "Retrieved 18 August 2014."
        ],
        [
            "^ a b c d \"Cajidiocan, Romblon\".",
            "The Official Website of the Provincial Government of Romblon.",
            "Archived from the original on 14 August 2014.",
            "Retrieved 18 August 2014."
        ],
        [
            "^ \"OFFICIAL STATEMENT: DPWH road project endangers Sibuyan Island protected area | Bayay Sibuyanon Inc\".",
            "bayay.ph.",
            "Archived from the original on 13 April 2018.",
            "Retrieved 17 January 2022."
        ],
        [
            "^ Mt.",
            "Guiting-guiting Natural Park Protected Area"
        ],
        [
            "^"
        ],
        [
            "\"Cajidiocan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Romblon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Poverty Incidence, 2000\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"Poverty Incidence, 2003\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"Poverty Incidence, 2006\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"Poverty Incidence, 2012\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Poverty Incidence, 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Providing for a Local Government Code of 1991\".",
            "The LawPhil Project.",
            "8th Congress of the Republic of the Philippines.",
            "Retrieved 21 April 2014."
        ],
        [
            "^ \"Cebu Pacific adds Masbate, Tablas to route network\".",
            "Manila Bulletin.",
            "December 13, 2016.",
            "Archived from the original on 13 January 2017.",
            "Retrieved 12 January 2017."
        ],
        [
            "^ \"How to Get to Romblon\".",
            "Lakas ng Trip.",
            "15 June 2012.",
            "Retrieved 18 August 2014."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Cajidiocan."
        ],
        [
            "Cajidiocan Profile - Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Cajidiocan"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "Magdiwang"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "San Fernando"
        ],
        [
            "vte Province of RomblonRomblon (capital)  Odiongan (largest municipality)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Banton"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Calatrava"
        ],
        [
            "Concepcion"
        ],
        [
            "Corcuera"
        ],
        [
            "Ferrol"
        ],
        [
            "Looc"
        ],
        [
            "Magdiwang"
        ],
        [
            "Odiongan"
        ],
        [
            "Romblon"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cajidiocan&oldid=1225919141\""
        ],
        [
            "Category: Municipalities of RomblonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}