{
    "name": "Calasiao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Calasiao"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°01′N 120°22′E﻿ / ﻿16.02°N 120.37°E﻿ / 16.02; 120.37"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pangasinan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Calasiao\" – news · newspapers · books · scholar · JSTOR (September 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesCalasiaoMunicipalityMunicipality of Calasiao"
        ],
        [
            "FlagSealMap of Pangasinan with Calasiao highlightedOpenStreetMapCalasiaoLocation within the PhilippinesCoordinates: 16°01′N 120°22′E﻿ / ﻿16.02°N 120.37°E﻿ / 16.02; 120.37CountryPhilippinesRegionIlocos RegionProvincePangasinanDistrict"
        ],
        [
            "3rd districtFoundedJune 29, 1592Barangays24"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorKevin Roy Q. Macanlalay • Vice MayorNestor A. Gabrillo • RepresentativeMaria Rachel J. Arenas • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ardieson B. SorianoNestor A. GabrilloGerald C. AficialFelipe K. de VeraRogelio E. DanoliKevin Roy Q. MacanlalayJerald C. Navarro"
        ],
        [
            " • Electorate66,216 voters (2022)Area • Revenue₱ 329.8 million (2020) • Assets₱ 696.5 million (2020) • Expenditure₱ 343.2 million (2020) • Liabilities₱ 227.9 million (2020)Service provider • ElectricityDagupan Electric Corporation (DECORP)Time zoneUTC+8 (PST)ZIP code2418PSGC015517000IDD : area code +63 (0)75Native languagesPangasinan Ilocano Sambal TagalogCatholic dioceseLingayen-DagupanPatron saintSaint Peter and PaulWebsitewww.calasiao.gov.ph"
        ],
        [
            "Calasiao, officially the Municipality of Calasiao (Pangasinan: Baley na Calasiao; Ilocano: Ili ti Calasiao; Tagalog: Bayan ng Calasiao),  is a 1st class municipality in the province of Pangasinan, Philippines.",
            "According to the 2020 census, it has a population of 100,471 people."
        ],
        [
            "Today, Calasiao is known as a first class, highly commercialized municipality and is strategically located at the heart of Pangasinan.",
            "It governs 24 barangays and 31 sitios in a total land area of 4,836 hectares.",
            "Being a town adjacent to the city of Dagupan, the municipality experiences continuous economic boom and is increasingly becoming an important satellite commercial hub for Metro Dagupan.",
            "In terms of delicacy, Calasiao's flagship product is the native rice cake known as Puto Calasiao."
        ],
        [
            "Calasiao is 3 kilometres (1.9 mi) from Dagupan, 17 kilometres (11 mi) from Lingayen, 206 kilometres (128 mi) from Manila, and 9 kilometres (5.6 mi) from San Carlos."
        ],
        [
            "Etymology"
        ],
        [
            "The name Calasiao was derived from the native word Kalasian, which means \"a place where lightning frequently occurs\", from the root word lasi, meaning \"lightning\".",
            "Upon the arrival of the Spaniards, they called the place \"Lugar de Rayos\", a literal Spanish translation of the word Kalasian.",
            "It was named as such because it is said that Calasiao back in the day was always frequented by this natural phenomenon."
        ],
        [
            "History"
        ],
        [
            "The indigenous people of Calasiao are descended from the Austronesian-speaking people who settled in the Malay archipelago at least 5,000 years ago.",
            "Calasiao was settled by a Pangasinan speaking people whose language belongs to the Malayo-Polynesian branch of the Austronesian languages family."
        ],
        [
            "In 1571, the Spanish conquest of Pangasinan began.",
            "The Spanish conquistadors were accompanied by Roman Catholic missionaries who introduced Roman Catholicism to the indigenous peoples of Pangasinan."
        ],
        [
            "In the 16th century, Dominican friars, who were settling at Gabon, were driven out because of the continuing unrest in the town.",
            "The formation of the new Calasiao however was not immediately welcomed by its native inhabitants.",
            "Hence in 1660, when the call for the Malong Rebellion came, the citizens picked up their weapons and joined in the fight against the Spanish rule.",
            "The citizens were also one of the first people to answer the call for rebellion of Juan de la Cruz Palaris of Binalatongan (now San Carlos City), which succeeded in driving the Spanish rulers and friars out of the boundaries.",
            "The town of Calasiao became part of the Pangasinan encomendia of Labaya, designated as belonging to the King of Spain, Juan Ximenez del opaline, and a son of Alonso Hernandez de Sandoval for whom tributes were collected."
        ],
        [
            "Today, Calasiao is rapidly expanding town.",
            "It may soon become a city or join with Dagupan and San Carlos City to be a metropolis.",
            "Yet many people from Calasiao have emigrated to other parts of the Philippines, the United States and other countries to seek better opportunities."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Calasiao is politically subdivided into 24 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Ambonao"
        ],
        [
            "Ambuetel"
        ],
        [
            "Banaoang"
        ],
        [
            "Bued"
        ],
        [
            "Buenlag"
        ],
        [
            "Cabilocaan"
        ],
        [
            "Dinalaoan"
        ],
        [
            "Doyong"
        ],
        [
            "Gabon"
        ],
        [
            "Lasip"
        ],
        [
            "Longos"
        ],
        [
            "Lumbang"
        ],
        [
            "Macabito"
        ],
        [
            "Malabago"
        ],
        [
            "Mancup"
        ],
        [
            "Nagsaing"
        ],
        [
            "Nalsian"
        ],
        [
            "Poblacion East"
        ],
        [
            "Poblacion West^"
        ],
        [
            "Quesban"
        ],
        [
            "San Miguel"
        ],
        [
            "San Vicente"
        ],
        [
            "Songkoy"
        ],
        [
            "Talibaew"
        ],
        [
            "† indicates the most populous barangay."
        ],
        [
            "^ The seat of government"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Calasiao, Pangasinan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "4.3(0.17)"
        ],
        [
            "19.1(0.75)"
        ],
        [
            "27.3(1.07)"
        ],
        [
            "45.2(1.78)"
        ],
        [
            "153.3(6.04)"
        ],
        [
            "271.3(10.68)"
        ],
        [
            "411.1(16.19)"
        ],
        [
            "532(20.9)"
        ],
        [
            "364.4(14.35)"
        ],
        [
            "182.5(7.19)"
        ],
        [
            "56.3(2.22)"
        ],
        [
            "24.4(0.96)"
        ],
        [
            "2,091.2(82.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "5"
        ],
        [
            "14"
        ],
        [
            "17"
        ],
        [
            "22"
        ],
        [
            "23"
        ],
        [
            "21"
        ],
        [
            "13"
        ],
        [
            "7"
        ],
        [
            "4"
        ],
        [
            "134"
        ],
        [
            "Source: World Weather Online (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CalasiaoYearPop.±% p.a.1903 16,539—    1918 16,960+0.17%1939 19,325+0.62%1948 23,269+2.09%1960 29,330+1.95%1970 38,576+2.77%1975 43,640+2.50%1980 48,101+1.96%1990 62,966+2.73%1995 69,528+1.87%2000 77,039+2.22%2007 85,419+1.43%2010 91,109+2.37%2015 95,154+0.83%2020 100,471+1.07%Source: Philippine Statistics Authority"
        ],
        [
            "The people speak Pangasinan, the dominant language in central Pangasinan.",
            "Ilocano, Tagalog, and English are also widely spoken."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Calasiao"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  23.10"
        ],
        [
            "2009  17.23"
        ],
        [
            "2012  9.88"
        ],
        [
            "2015  8.70"
        ],
        [
            "2018  7.82"
        ],
        [
            "2021  14.68"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Public Market."
        ],
        [
            "Calasiao is centrally located in Pangasinan, between Dagupan and San Carlos City, with a major road connecting Calasiao to both cities.",
            "The town is also connected to Santa Barbara, from where the MacArthur Highway connects to Baguio City and Metro Manila."
        ],
        [
            "Calasiao has rich farmlands planted mainly with palay or rice, coconuts and mangoes.",
            "Calasiao also has a lot of fishponds along its rivers and wetlands where fish like bangus (milkfish), pantat (catfish), and tilapia are raised.",
            "A Coca-Cola Bottlers plant is located in Purok 7 Barangay Bued Calasiao."
        ],
        [
            "In June 2010, Robinsons Malls announced the construction of its 30th mall in this town.",
            "Robinsons Place Pangasinan is a two-level mall built on a 5.8 hectares (14 acres) lot with a gross floor area of 31,900 square metres (343,000 sq ft) and a gross leasable area of 23,000 square metres (250,000 sq ft)."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Calasiao, belonging to the third congressional district of the province of Pangasinan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "The town hall is located in front of the Roman Catholic convent of San Pedro y San Pablo de Calasiao, the same building as the shrine of Senor Divino Tesoro.",
            "The current mayor is Mamilyn A. Caramat, who took over the mayoralty post from Joseph Arman C. Bauzon, following his victory in the May 2022 elections.",
            "In January 2023, she died from stroke and Kevin Macanlalay took over as Mayor."
        ],
        [
            "Elected officials"
        ],
        [
            "The town is currently led by Mayor Kevin Roy Q. Macanlalay, Vice Nestor Gabrillo, and eight other councilors."
        ],
        [
            "Members of the Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Maria Rachel Arenas"
        ],
        [
            "Mayor"
        ],
        [
            "Kevin Roy Q. Macanlalay"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Nestor A. Gabrillo"
        ],
        [
            "Councilors"
        ],
        [
            "Manny D.V.",
            "Datuin"
        ],
        [
            "Felipe K. De Vera"
        ],
        [
            "Ardieson B. Soriano"
        ],
        [
            "Haverdani Das B. Mesina"
        ],
        [
            "Gerald C. Aficial"
        ],
        [
            "Elias S. Villanueva"
        ],
        [
            "MYC D. Sison"
        ],
        [
            "Jose A. Loresco"
        ],
        [
            "Liga ng mga Barangay President"
        ],
        [
            "Patrick A. Caramat (Nalsian)"
        ],
        [
            "Sangguniang Kabataan Federation President"
        ],
        [
            "Narayana Rsi Das Mesina (Longos)"
        ],
        [
            "Tourism"
        ],
        [
            "St. Peter and Paul Church (Poblacion West)"
        ],
        [
            "Calasiao is a short ride to the Bonuan Blue Beach and the Hundred Islands in Lingayen Gulf.",
            "Calasiao is about 2 hour ride to Baguio City and a four-hour ride to Manila."
        ],
        [
            "Calasiao is known for its puto, a soft rice cake; suman, a sweet coconut and sticky rice cake wrapped in banana leaves; and bagoong, or fermented fish paste.",
            "Calasiao puto is described as the town's \"white gold.\"",
            "Calasiao puto is a bite-size, soft rice cake made from semi-glutinous rice that is fermented in earthen jars.",
            "It is produced mainly in Barangay Dinalaoan."
        ],
        [
            "Many pilgrims from neighbouring cities/towns and provinces visit Calasiao to pray at the Senor Divino Tesoro shrine.",
            "The statue of a crucified Jesus Christ is believed to grow in size and grant miracles."
        ],
        [
            "Puto festival"
        ],
        [
            "Special Puto (Calasiao stores)."
        ],
        [
            "Calasiao celebrates a puto industry festival.",
            "The Calasiao puto is a rice cake that is well known all over the Philippines for its melt-in-the-mouth feeling.",
            "It is locally sold along the streets going to Sr. Divino Tesoro."
        ],
        [
            "It is known for its \"white gold\": \"cup-shaped, bite-sized, soft rice cakes; the semi-glutinous rice is fermented in old earthen jars\" (in villages of Dinalaoan, Lumbang, Ambuetel, and part of Nalsian)."
        ],
        [
            "Calasiao puto is made of long grain rice soaked in water, ground and fermented for three days of more, with just enough sugar to taste, and steamed.",
            "It can be topped with cheese or drizzled with chocolate syrup for variation.",
            "It is perfect to be paired with dinuguan.",
            "The town has the traditional white puto and many flavors like pandan (green), ube (violet), banana (yellow), strawberry (light red/pink) and cheese (gold)."
        ],
        [
            "The original white puto and kutsinta (another rice cake variety) is sold at P80 per kilogram (70 to 75 pieces), while the flavored ones are sold at P80 per kg.",
            "The price is higher by P15 to P20 in other areas to cover transportation costs."
        ],
        [
            "Bella's Puto consumes three to six sacks of rice a day to make puto, depending on the season.",
            "Peak production period is from October to January.",
            "A sack of rice can produce 8,000 pieces or 107 kg of puto.",
            "Bella's Puto is sold at four SM shopping mall branches, in Santa Mesa (Manila), Baliwag (Bulacan), Clark (Pampanga) and Rosales (Pangasinan).",
            "It is also sold in a store in Caloocan and at the Pasalubong Center in Rosales town."
        ],
        [
            "Bocayo (sweetened coconut) and dinuguan are also the best products of Nalsian Bacayao and Nalsian Centro.",
            "Calasiao celebrates its town fiesta every May 2 and 3: the feast day of Señor Divino Tesoro.",
            "Every June 28 and 29 is the fiesta of San Pedro and San Pablo, which were the dates of the Calasiao fiesta."
        ],
        [
            "Notable personalities"
        ],
        [
            "Mitoy Yonting"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Calasiao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Brief History\".",
            "Archived from the original on September 28, 2012.",
            "Retrieved November 8, 2012."
        ],
        [
            "^ \"Province: PANGASINAN\".",
            "PSGC Interactive.",
            "Makati, Philippines: National Statistical Coordination Board.",
            "Archived from the original on November 14, 2012.",
            "Retrieved November 26, 2012."
        ],
        [
            "^"
        ],
        [
            "\"Calasiao, Pangasinan: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved September 26, 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Pangasinan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Calasiao mayor passes away due to stroke\".",
            "January 8, 2023."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Archived (PDF) from the original on October 6, 2020.",
            "Retrieved March 7, 2022."
        ],
        [
            "^ \"Inquirer.net, Free puto as Pangasinan town celebrates rice cake festival\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on May 27, 2008.",
            "Retrieved May 3, 2008."
        ],
        [
            "^ \"Puto Festival of Calasiao\".",
            "October 6, 2010."
        ],
        [
            "^ \"Business - United colors of Calasiao puto - INQUIRER.net\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on December 28, 2011.",
            "Retrieved November 8, 2012."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Calasiao."
        ],
        [
            "Calasiao Profile at PhilAtlas.com"
        ],
        [
            "Official website"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Calasiao at the Pangasinan Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Calasiao"
        ],
        [
            "Dagupan"
        ],
        [
            "Mangaldan"
        ],
        [
            "Binmaley"
        ],
        [
            "Calasiao"
        ],
        [
            "Santa Barbara"
        ],
        [
            "San Carlos"
        ],
        [
            "Malasiqui"
        ],
        [
            "vte Province of PangasinanLingayen (capital)  San Carlos City (largest city)Municipalities"
        ],
        [
            "Agno"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Anda"
        ],
        [
            "Asingan"
        ],
        [
            "Balungao"
        ],
        [
            "Bani"
        ],
        [
            "Basista"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos"
        ],
        [
            "Calasiao"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lingayen"
        ],
        [
            "Mabini"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Natividad"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Rosales"
        ],
        [
            "San Fabian"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Quintin"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sison"
        ],
        [
            "Sual"
        ],
        [
            "Tayug"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "San Carlos"
        ],
        [
            "Urdaneta"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan (Administratively independent from the province but grouped under Pangasinan by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Pangasinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Calasiao&oldid=1225075292\""
        ],
        [
            "Category: Municipalities of PangasinanHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Articles needing additional references from September 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from January 2009Commons category link is on WikidataPages using the Kartographer extension"
        ]
    ]
}