{
    "name": "Calatrava",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Calatrava, Romblon"
        ],
        [
            "17 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°37′00″N 122°04′15″E﻿ / ﻿12.61667°N 122.07083°E﻿ / 12.61667; 122.07083"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Romblon, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesCalatravaMunicipalityMunicipality of Calatrava"
        ],
        [
            "FlagSealMap of Romblon with Calatrava highlightedOpenStreetMapCalatravaLocation within the PhilippinesCoordinates: 12°37′00″N 122°04′15″E﻿ / ﻿12.61667°N 122.07083°E﻿ / 12.61667; 122.07083CountryPhilippinesRegionMimaropaProvinceRomblonDistrict"
        ],
        [
            "Lone districtFounded1810Barangays7"
        ],
        [
            "  (see Barangays)Government  • RepresentativeEleandro Jesus F. Madrona • Councilors"
        ],
        [
            "Monching Magbata"
        ],
        [
            "Dilbert Motin"
        ],
        [
            "Wilfredo Famorcan"
        ],
        [
            "Elmer Fortu"
        ],
        [
            "Alan Famini"
        ],
        [
            "Marnal Mores"
        ],
        [
            "Roger Sixon"
        ],
        [
            "Gal Ferrancullo"
        ],
        [
            " • Electorate7,807 voters (2022)Area • Revenue₱ 120.7 million (2020) • Assets₱ 425.6 million (2020) • Expenditure₱ 93.81 million (2020) • Liabilities₱ 53.61 million (2020)Service provider • ElectricityTablas Island Electric Cooperative (TIELCO)Time zoneUTC+8 (PST)ZIP code5503PSGC175904000IDD : area code +63 (0)42Native languagesBantoanon Ati Tagalog"
        ],
        [
            "Calatrava, officially the Municipality of Calatrava (Asi: Banwa it Calatrava, Filipino: Bayan ng Calatrava, formerly Andagao), is a 5th class municipality in the province of Romblon, Philippines.",
            "According to the 2020 census, it has a population of 11,342 people."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Calatrava, once a barrio in the town of San Agustin (then called Badajoz) in Tablas Island.",
            "During pre-Spanish period, the place was called \"Andagao\", named after a medicinal plant growing in abundance everywhere in the locality especially in places along the shore."
        ],
        [
            "Around 1810, the first settlers in Andagao migrated from Banton and Romblon islands, as well as in central parts of Tablas Island, in search of lands more suitable for agriculture.",
            "The Simaranhons, Sibalenhons and Bantoanons were the first settlers of the municipality and joined later by migrants from Odiongan of which, like them, spoke Asi.",
            "Today, this group of people made up the great portion of its residents, while the northern barangays of Linao, Pangulo and Talisay have significant Romblomanon residents.",
            "Onhan settlers originally from central Tablas decided to settle in the southern barangay of Balogo."
        ],
        [
            "Around 1838, Andagao was organized into a fundacion (settlement) attached to visita (village) of Odiongan under the pueblo of Banton by the Spanish colonial authorities.",
            "The following year, a Spanish friar named Padre Jose Aznar from the parish of Banton visited the place and planned the construction of its first Roman Catholic church made of wood and limestone.",
            "Eleuterio Asuncion, the barrio's cabeza de barangay spearheaded its construction.",
            "After the church was completed, Andagao immediately progressed and developed.",
            "In 1850, people started using family names beginning with letter \"F\" as decreed by Spanish Governor-General Narciso Claveria issued on 21 November 1848."
        ],
        [
            "In 1853, after the creation of the District of Romblon, 17 new towns were created which included Andagao.",
            "This was Calatrava's first proclamation as a municipality.",
            "However, when the District of Romblon was elevated into a full-pledge province a total of 15 towns were abolished, including Andagao.",
            "On 11 January 1868, Romblon became a fully pledged province and Andagao reverted to its former status as a visita and it was annexed to the town of Guintiguian (renamed Badajoz on August 28, 1868, now San Agustin)."
        ],
        [
            "On 14 June 1881,  Andagao was renamed Calatrava during the term of the controversial military governor of Romblon, Don Jose Fernandez de Terran (1880–1883), after the Military Order of Calatrava, which was founded by the Cistercian monk St. Raymond of Fitero and tasked to defend the castle of Calatrava and other crucial towns and cities in the Andalucian region from invasions and attacks from the Moors."
        ],
        [
            "Modern history"
        ],
        [
            "Calatrava remained part of Badajoz municipality throughout the American colonial period until 4 June 1940, when Commonwealth Act No.",
            "581 (authored by Congressman Leonardo Festin) was passed and created the special municipality of Tablas, with its seat at Odiongan.",
            "The town of Badajoz became part of the new municipality and was represented with one special municipal councilor at the municipal council in Odiongan.",
            "Calatrava, being a barrio of Badajoz then, was not represented.",
            "On 4 June 1943, during the Second World War, the special municipality of Calatrava was created upon the sponsorship of the guerrilla movement regime under the Revolutionary Republic of the Philippines.",
            "Its first and only mayor then was Benito Famini, Sr. who served up to the liberation period.",
            "This was Calatrava's second proclamation as a municipality."
        ],
        [
            "On 1 October 1946 Commonwealth Act No.",
            "581 was repealed through the passage of Republic Act No.",
            "38 sponsored by Congressman Modesto Formilleza.",
            "Badajoz regained back its independent municipal status and Calatrava was annexed back to Badajoz municipality as a barrio.",
            "The same year, a three-man delegation composed of Pablo Fetalino, Lauriano Falcutila, Sr. and Jose Capa from Calatrava went to Manila to lobby for a bill in Congress that will establish Calatrava as an independent municipality but it didn't push through."
        ],
        [
            "On 15 June 1968, through the sponsorship Congressman Jose Moreno, Republic Act No.",
            "5317 was drafted and approved which finally established Calatrava as an independent municipality.",
            "Thus Calatrava became Romblon's 15th independent constituency under the category of municipal-district.",
            "This was Calatrava's third proclamation as a municipality."
        ],
        [
            "Geography"
        ],
        [
            "Calatrava is situated along the northern coastal plains and rugged terrain of Tablas Island.",
            "It is bounded on the north by Tablas Strait, on the east by municipality of San Agustin, on the south and west by the municipality of San Andres.",
            "The municipality has a total land area of 8,670 hectares (21,400 acres) constituting 6.39% of Romblon's land area."
        ],
        [
            "Barangays"
        ],
        [
            "Calatrava is politically subdivided into 7 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Balogo"
        ],
        [
            "Linao"
        ],
        [
            "Poblacion"
        ],
        [
            "Pagsangahan"
        ],
        [
            "Pangulo"
        ],
        [
            "San Roque"
        ],
        [
            "Talisay"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Calatrava, Romblon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31(1.2)"
        ],
        [
            "20(0.8)"
        ],
        [
            "25(1.0)"
        ],
        [
            "39(1.5)"
        ],
        [
            "152(6.0)"
        ],
        [
            "269(10.6)"
        ],
        [
            "314(12.4)"
        ],
        [
            "285(11.2)"
        ],
        [
            "303(11.9)"
        ],
        [
            "208(8.2)"
        ],
        [
            "95(3.7)"
        ],
        [
            "70(2.8)"
        ],
        [
            "1,811(71.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "9.5"
        ],
        [
            "7.1"
        ],
        [
            "9.0"
        ],
        [
            "11.3"
        ],
        [
            "21.0"
        ],
        [
            "25.7"
        ],
        [
            "28.1"
        ],
        [
            "26.5"
        ],
        [
            "27.3"
        ],
        [
            "24.6"
        ],
        [
            "16.5"
        ],
        [
            "12.1"
        ],
        [
            "218.7"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CalatravaYearPop.±% p.a.1970 4,754—    1975 5,682+3.64%1980 6,115+1.48%1990 7,463+2.01%1995 7,734+0.67%2000 8,878+3.00%2007 9,726+1.27%2010 9,776+0.19%2015 10,275+0.95%2020 11,342+1.96%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2015 census, Calatrava has a population of 10,275 people.",
            "Asi is the native language of Barangay Poblacion, Pagsangahan and San Roque, while both Asi and Ini are used in Barangay Talisay, Linao and Pangulo.",
            "Onhan is used by majority of Barangay Balogo's inhabitants, however in some of its sitios, both Asi and Ini are also being used regularly by its native residents."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Calatrava"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  47.30"
        ],
        [
            "2009  47.39"
        ],
        [
            "2012  35.46"
        ],
        [
            "2015  33.97"
        ],
        [
            "2018  22.64"
        ],
        [
            "2021  27.25"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Philippine municipality"
        ],
        [
            "As a municipality in the Province of Romblon, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "Pursuant to Chapter II, Title II, Book III of Republic Act 7160 or the Local Government Code of 1991, the municipal government is composed of a mayor (alkalde), a vice mayor (bise alkalde) and members (kagawad) of the legislative branch Sangguniang Bayan alongside a secretary to the said legislature, all of which are elected to a three-year term and are eligible to run for three consecutive terms.",
            "The incumbent mayor and vice mayor for the 2019–2022 term are Marieta Babera from LAKAS-CMD and Dishan Servañez y Fondevilla from PDP–Laban party, respectively."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "See also"
        ],
        [
            "Mayor of Calatrava, Romblon"
        ],
        [
            "References"
        ],
        [
            "^ a b \"Halalan 2019 Philippine Election Results\".",
            "ABS-CBN News."
        ],
        [
            "^  Municipality of Calatrava |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Jernegan, Prescott Ford (1905) \"A Short History of the Philippines: For use in Philippine schools\".",
            "pp.",
            "232-234.",
            "D. Appleton and Company, New York."
        ],
        [
            "^ Republic Act No.",
            "38 LawPH.com Retrieved 2012-04-16"
        ],
        [
            "^ An Act Creating the Municipal District of Calatrava in the Province of Romblon Archived 2012-05-31 at the Wayback Machine Congress of the Philippines.",
            "LawPH.com Retrieved on 2012-04-16"
        ],
        [
            "^ Profile: Calatrava Romblon Travel Guide.",
            "Retrieved on 2012-04-16."
        ],
        [
            "^"
        ],
        [
            "\"Calatrava: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Romblon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Poverty Incidence, 2000\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"Poverty Incidence, 2003\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"Poverty Incidence, 2006\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"Poverty Incidence, 2012\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Poverty Incidence, 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Providing for a Local Government Code of 1991\".",
            "The LawPhil Project.",
            "8th Congress of the Republic of the Philippines.",
            "Retrieved April 21, 2014."
        ],
        [
            "External links"
        ],
        [
            "Calatrava Profile at PhilAtlas.com"
        ],
        [
            "Calatrava, Romblon Profile - Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "2007 Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Calatrava, Romblon"
        ],
        [
            "CorcueraSibuyan Sea"
        ],
        [
            "Tablas Strait"
        ],
        [
            "Calatrava"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "vte Province of RomblonRomblon (capital)  Odiongan (largest municipality)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Banton"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Calatrava"
        ],
        [
            "Concepcion"
        ],
        [
            "Corcuera"
        ],
        [
            "Ferrol"
        ],
        [
            "Looc"
        ],
        [
            "Magdiwang"
        ],
        [
            "Odiongan"
        ],
        [
            "Romblon"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Calatrava,_Romblon&oldid=1192470398\""
        ],
        [
            "Category: Municipalities of RomblonHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using the Kartographer extension"
        ]
    ]
}