{
    "name": "Calinog",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Calinog"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°08′N 122°30′E﻿ / ﻿11.13°N 122.5°E﻿ / 11.13; 122.5"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "Municipality in Western Visayas, PhilippinesCalinogMunicipalityMunicipality of Calinog"
        ],
        [
            "FlagSealMap of Iloilo with Calinog highlightedOpenStreetMapCalinogLocation within the PhilippinesCoordinates: 11°08′N 122°30′E﻿ / ﻿11.13°N 122.5°E﻿ / 11.13; 122.5CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "3rd districtFounded1763Barangays59"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFrancisco L. Calvo • Vice MayorAnthony Andrew Gustilo • RepresentativeLorenz R. Defensor • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Julius Andrew L. CastañosGretchel Joy C. CasonoQP Gold C. CaspilloDino C. DizonTeodoro Y. Lao IIMayjan Paul C. HurtadaRenato B. MagpantayHazel C. Bibit"
        ],
        [
            " • Electorate41,679 voters (2022)Area • Revenue₱ 229.5 million (2020) • Assets₱ 530.3 million (2020) • Expenditure₱ 200.8 million (2020) • Liabilities₱ 146.8 million (2020)Service provider • ElectricityIloilo 2 Electric Cooperative (ILECO 2)Time zoneUTC+8 (PST)ZIP code5040PSGC063013000IDD : area code +63 (0)33Native languagesKaray-a Hiligaynon Capisnon Ati TagalogWebsitewww.calinog.gov.ph"
        ],
        [
            "Calinog, officially the Municipality of Calinog (Kinaray-a: Banwa kang Calinog, Hiligaynon: Banwa sang Calinog,  Tagalog: Bayan ng Calinog),  is a 1st class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 62,853 people."
        ],
        [
            "Etymology"
        ],
        [
            "The town got its name from the Hiligaynon word kalinong which means calm or placid.",
            "But some might say it is from linog or an earthquake given the fact that the town lies near the West Panay Fault."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2013) (Learn how and when to remove this message)"
        ],
        [
            "Former flag of Calinog"
        ],
        [
            "Calinog, which according to legend Datu Marikudo chose to settle, is strategically located in the central part of the Island of Panay.",
            "Calinog was already a developing community when the Spaniards came between the 16th and the 17th Century.",
            "In the early 18th Century, Calinog was established as a permanent settlement following the system of town planning as prescribed by the Law of the Indies: a town plaza surrounded by the church, Municipal Tribunal, school and public market.",
            "This remains as the main town-planning feature of the poblacion until the present.",
            "The Spanish Colonial Government then declared Calinog as “Pueblo” or town in 1763."
        ],
        [
            "A new colonial power, the Americans introduced important changes in the civil affairs of the municipality in the early 1900s.",
            "The most significant was annexing Calinog as part of the Municipality of Passi (now a component city of Iloilo) from 1904 to 1920.",
            "Through intense lobbying by prominent leaders, Calinog was restored to its original status as a separate Municipality in January 1921."
        ],
        [
            "It was in the late 1960s when Calinog stepped on the springboard of development as a progressive Municipality bustling with business and economic opportunities.",
            "In 1969, with the sugar industry boom, the political leadership decided to split a portion of the town into a separate municipality, the Municipality of Bingawan."
        ],
        [
            "Among the founders of the old communities in the uplands were the descendants of the families who fought the abusive Spanish colonizers in the settlements of Bugasong and Lawaan, Province of Antique, in the 16th Century (their colorful folklore and the oral tradition of their historical journeys became a part of the timeless epic, “Hinilawod”).",
            "Mt.",
            "Dila Dila in Barangay Alibunan is best remembered as a strong hold of Filipino guerillas and soldiers during World War II under the command of a Calinognon Major Julian C. Chaves where the fiercest battles in the annals of war in the Island of Panay were fought against the Japanese Imperial Army."
        ],
        [
            "Geography"
        ],
        [
            "The town of Calinog nestles in the central part of Panay Island.",
            "It is the last municipality in the central part of Iloilo Province which adjourns the province of Capiz.",
            "It is located at geographical coordinates 11°15′ latitude and 122°30′ longitudes.",
            "It has a total land area of 27,446 hectares representing about 5% of the total land area (532,297) of the entire Province."
        ],
        [
            "Calinog is 58 kilometres (36 mi) from Iloilo City and 75 kilometres (47 mi) from Roxas City."
        ],
        [
            "Soil"
        ],
        [
            "Around 75% of the municipality's slope is above 8% or category C. The municipality, however, is mainly agricultural.",
            "There are four (4) types of soil in Calinog: 1) Umingan fine sandy loam; 2) Alimodian clay loam; 3) Bantog clay loam and 4) Alimodian soil (undifferentiated)."
        ],
        [
            "Topography"
        ],
        [
            "The municipality has mixed topographic reliefs.",
            "The westernmost portion is very mountainous.",
            "The central and northern areas have gently sloping reliefs while the eastern and southern portions are flat lands or plains with also gently sloping reliefs.",
            "All urban barangays are located in the lowland area."
        ],
        [
            "The slope category of the municipality are: A (0-8%) 5,049 hectares; Category B (3-5%) 1,644 hectares; Category C (5-8%) 9,056 hectares; Category D (8-15%) 4,199 hectares and Category E (15-18%) 6,971 hectares."
        ],
        [
            "Water sources"
        ],
        [
            "Jalaur River is the main source of water supply most specially for irrigation purposes considering the fact that this river is one of the biggest in terms of source volume in the whole Panay Island.",
            "For Potable Water, there is one pumping station at Barangay Bo.",
            "Calinog as its main source and one back-up pumping station at Barangay Simsiman along the Jalaur River."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Calinog, Iloilo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "48(1.9)"
        ],
        [
            "41(1.6)"
        ],
        [
            "58(2.3)"
        ],
        [
            "82(3.2)"
        ],
        [
            "223(8.8)"
        ],
        [
            "300(11.8)"
        ],
        [
            "346(13.6)"
        ],
        [
            "307(12.1)"
        ],
        [
            "311(12.2)"
        ],
        [
            "292(11.5)"
        ],
        [
            "167(6.6)"
        ],
        [
            "81(3.2)"
        ],
        [
            "2,256(88.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "7.7"
        ],
        [
            "11.3"
        ],
        [
            "15.4"
        ],
        [
            "25.7"
        ],
        [
            "28.5"
        ],
        [
            "29.5"
        ],
        [
            "28.7"
        ],
        [
            "28.3"
        ],
        [
            "28.7"
        ],
        [
            "21.8"
        ],
        [
            "15.2"
        ],
        [
            "252.2"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Calinog falls under the third type consisting of seasons, which are not very pronounced relatively dry from November to April and wet during the rest of the year.",
            "The maximum rain periods are not very pronounced with a short dry season lasting only from one to three months.",
            "It is influenced by the southeast monsoons, which one of the principal air streams affecting the country.",
            "Its exposure to prevailing winds maybe affected by the local topography."
        ],
        [
            "Calinog is relatively dry from November to April and wet during the rest of the year.",
            "The maximum rain periods are not very heavy with a short dry season lasting from one to three months.",
            "The climate is influenced by the southeast monsoons, one of the principal air streams affecting the country.",
            "Local topography affects its exposure to prevailing winds."
        ],
        [
            "Barangays"
        ],
        [
            "Calinog is politically subdivided into 59 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "The Poblacion area is composed of 4 barangays, namely: Poblacion Centro, Poblacion Ilaya, Poblacion Delgado and Poblacion Rizal Ilaud.",
            "There is a proposed additional 5 barangays to be included in the urban land area.",
            "They are Barangays Carvasana, Dalid, Simsiman, Bo.",
            "Calinog, and Libot.",
            "They will constitute the greater Poblacion area."
        ],
        [
            "Agcalaga"
        ],
        [
            "Aglibacao"
        ],
        [
            "Aglonok"
        ],
        [
            "Alibunan"
        ],
        [
            "Badlan Grande"
        ],
        [
            "Badlan Pequeño"
        ],
        [
            "Badu"
        ],
        [
            "Balaticon"
        ],
        [
            "Banban Grande"
        ],
        [
            "Banban Pequeño"
        ],
        [
            "Binolosan Grande"
        ],
        [
            "Binolosan Pequeño"
        ],
        [
            "Cabagiao"
        ],
        [
            "Cabugao"
        ],
        [
            "Cahigon"
        ],
        [
            "Barrio Calinog"
        ],
        [
            "Camalongo"
        ],
        [
            "Canabajan"
        ],
        [
            "Caratagan"
        ],
        [
            "Carvasana"
        ],
        [
            "Dalid"
        ],
        [
            "Datagan"
        ],
        [
            "Gama Grande"
        ],
        [
            "Gama Pequeño"
        ],
        [
            "Garangan"
        ],
        [
            "Guinbonyugan"
        ],
        [
            "Guiso"
        ],
        [
            "Hilwan"
        ],
        [
            "Impalidan"
        ],
        [
            "Ipil"
        ],
        [
            "Jamin-ay"
        ],
        [
            "Lampaya"
        ],
        [
            "Libot"
        ],
        [
            "Lonoy"
        ],
        [
            "Malaguinabot"
        ],
        [
            "Malag-It"
        ],
        [
            "Malapawe"
        ],
        [
            "Malitbog Centro"
        ],
        [
            "Mambiranan"
        ],
        [
            "Manaripay"
        ],
        [
            "Marandig"
        ],
        [
            "Masaroy"
        ],
        [
            "Maspasan"
        ],
        [
            "Nalbugan"
        ],
        [
            "Owak"
        ],
        [
            "Poblacion Centro"
        ],
        [
            "Poblacion Delgado"
        ],
        [
            "Poblacion Rizal Ilaud"
        ],
        [
            "Poblacion Ilaya"
        ],
        [
            "Baje San Julian"
        ],
        [
            "San Nicolas"
        ],
        [
            "Simsiman"
        ],
        [
            "Tabucan"
        ],
        [
            "Tahing"
        ],
        [
            "Tibiao"
        ],
        [
            "Tigbayog"
        ],
        [
            "Toyungan"
        ],
        [
            "Ulayan"
        ],
        [
            "Supanga"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CalinogYearPop.±% p.a.1903 4,194—    1939 22,175+4.73%1948 25,484+1.56%1960 29,913+1.34%1970 25,996−1.39%1975 30,074+2.97%1980 32,897+1.81%1990 41,113+2.25%1995 45,452+1.90%2000 48,454+1.38%2007 51,018+0.71%2010 54,430+2.38%2015 60,413+2.01%2020 62,853+0.78%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Calinog, Iloilo, was 62,853 people, with a density of 230 inhabitants per square kilometre or 600 inhabitants per square mile."
        ],
        [
            "Ethnic groups"
        ],
        [
            "There are two ethnic groups identified.",
            "They are the Sulodnon or Bukidnon tribe and the Aeta.",
            "The Sulodnon or Bukidnon tribe comprises the thirteen (13) mountain barangays.",
            "The Aeta group resides in the different barangays of the municipality."
        ],
        [
            "Languages"
        ],
        [
            "The main local languages are Hiligaynon, Capiznon and Kinaray-a.",
            "Filipino and English are also used and understood by the local residents, but are seldom used every day."
        ],
        [
            "Tourism"
        ],
        [
            "Calinog is home to the Hirinugyaw-Suguidanonay Festival.",
            "From a Visayan term for \"jubilation\" or \"rejoicing,\" \"Hirinugyaw\" was inspired by the Dinagyang Festival of Iloilo City and has become a feast with success for the people Calinog through a festivity showing the town's devotion to the Child Jesus and highlighted as it turns out in celebration for the feast of Santo Niño."
        ],
        [
            "People make effort to perform colorful cultural dances and other festive commemorative rites in His honor.",
            "The festival has given life in their faith and has become a growing devotion in their hearts.",
            "The dances performed are usually thought to be simple dances composed of repetitive, easy-to-learn steps.",
            "However the presentation becomes highly complex with the incorporation of a Sugidanon---traditional stories on a town's history and culture narrated through chanting.",
            "It is used to highlight the dances in order to heighten the dramatic or comic effect of the presentation.",
            "As a whole, the festival functions to create or promote a sense of community as it continues to make the community feel part of a provincial or regional group to help them establish ties with their heritage."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Calinog"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  29.80"
        ],
        [
            "2009  29.64"
        ],
        [
            "2012  27.01"
        ],
        [
            "2015  28.30"
        ],
        [
            "2018  27.02"
        ],
        [
            "2021  26.79"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Calinog |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Calinog | Iloilo Provincial Government\".",
            "iloilo.gov.ph.",
            "Retrieved 2023-11-26."
        ],
        [
            "^"
        ],
        [
            "\"Calinog: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 3 May 2020."
        ],
        [
            "^ Philippine Standard Geographic Code listing for Calinog Archived 2008-11-19 at the Wayback Machine - National Statistical Coordination Board"
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Calinog"
        ],
        [
            "Tapaz, Capiz / Bingawan"
        ],
        [
            "Lambunao"
        ],
        [
            "Calinog"
        ],
        [
            "Passi City"
        ],
        [
            "Lambunao"
        ],
        [
            "Dueñas"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Calinog&oldid=1230371229\""
        ],
        [
            "Category: Municipalities of IloiloHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Kinaray-a-language textArticles containing Hiligaynon-language textArticles containing Tagalog-language textArticles needing additional references from July 2013All articles needing additional referencesPages using the Kartographer extension"
        ]
    ]
}