{
    "name": "Calintaan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Calintaan"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°34′32″N 120°56′34″E﻿ / ﻿12.5756°N 120.9428°E﻿ / 12.5756; 120.9428"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Occidental Mindoro, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesCalintaan"
        ],
        [
            "IrirunMunicipalityMunicipality of CalintaanMountains in Calintaan"
        ],
        [
            "FlagSealMap of Occidental Mindoro with Calintaan highlightedOpenStreetMapCalintaanLocation within the PhilippinesCoordinates: 12°34′32″N 120°56′34″E﻿ / ﻿12.5756°N 120.9428°E﻿ / 12.5756; 120.9428CountryPhilippinesRegionMimaropaProvinceOccidental MindoroDistrict"
        ],
        [
            "Lone districtFoundedJune 18, 1966Barangays7"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 199.9 million (2020) • Assets₱ 388 million (2020) • Expenditure₱ 175.7 million (2020) • Liabilities₱ 151.2 million (2020)Service provider • ElectricityOccidental Mindoro Electric Cooperative (OMECO)Time zoneUTC+8 (PST)ZIP code5102PSGC175102000IDD : area code +63 (0)43Native languagesBuhid Tawbuid Tagalog"
        ],
        [
            "Calintaan, officially the Municipality of Calintaan (Tagalog: Bayan ng Calintaan),  is a 3rd class municipality in the province of Occidental Mindoro, Philippines.",
            "According to the 2020 census, it has a population of 30,190 people."
        ],
        [
            "Tagalog is the main language spoken in Calintaan, being spoken by approximately 62% of the household population, followed by Ilocano which is spoken by about 22%."
        ],
        [
            "History"
        ],
        [
            "This article possibly contains original research.",
            "Please improve it by verifying the claims made and adding inline citations.",
            "Statements consisting only of original research should be removed.",
            "(July 2008) (Learn how and when to remove this message)"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Ililin is the first village mentioned in the history of Calintaan; this village is now believed to be Barangay Iriron based on its location in the old maps.",
            "Records left by the Jesuits in 1666 mentioned that adults 20 to 24 years old were baptized in Ililin.",
            "The village is recorded as belonging to the Parish of Mangarin in 1733."
        ],
        [
            "In the pre-dawn hours of October 23, 1739, 100 Moro pirates aboard five bancas laid siege to the village.",
            "Most of the residents escaped, but a few villagers and a visiting missionary were captured by the pirates and brought to Jolo.",
            "Word reached the Order of Augustinian Recollects in 1740 that the missionary, Fr.",
            "Leon de San Jose, has been killed."
        ],
        [
            "In 1754, pirates again attacked Ililin, but the people beat the pirates into retreat.",
            "The pirates instead attacked Dongon, a neighboring village.",
            "Later records reveal that Ililin was eventually destroyed by the Moros.",
            "The residents migrated to plains and mountains further from the coast.",
            "In 1819, by which time Ililin was being called Iriron, a new parish was created with a population of 1,300 persons."
        ],
        [
            "By 1871, Spain had managed to control the problem of piracy throughout the Philippines, and the villages of Mindoro repopulated.",
            "In the area called Magarang a cattle ranch was set up by a Spaniard named Pascual Ledesma."
        ],
        [
            "After some disagreement with the friars, Capitan Jimenez relocated his family and followers—including the families Pascual, Labrador, Pudan, Romaquin, Picarzo and Isidro-to found a new community, in a place they called Calintaan after the word for the leeches which they encountered there."
        ],
        [
            "During the revolution against the Spanish authorities, Capt.",
            "Jimenez, Isidro Zamora, Pedro Dapil and Marcelino Vitang were among the leaders of the local rebellion.",
            "They joined forces with Captain Pedro Fernandez' revolutionaries from Sablayan.",
            "Also in Fernandez' group were Vicente Gallembas, Tiago Dangeros, Carpo Urieta, Docoy Eniega, Vicente Dangcoding, Tiago Dantayana and Paeng Dawatis.",
            "With the approval of other revolutionary leaders, including the leaders of West Mindoro and Calapan, Jiminez and Fernandez combined their groups to march on El Pueblo de Magarang in 1897, where the 75-man company captured the Spaniards and missionary friars."
        ],
        [
            "Antoon Postma, a Dutch researcher, indicated that the captured men were held for a time at Magarang before being sent, by way of Paluan, to Taysan, Batangas.",
            "The captives were held for several years before the Americans occupied Mindoro and freed them in 1904."
        ],
        [
            "American invasion era"
        ],
        [
            "After the end of the Spanish regime, Calintaan became progressive, with Eligio Jimenez serving as the first appointed cabeza de barangay.",
            "Sablayan became a municipality during the American period, holding jurisdiction over barrios including Iriron and Calintaan.",
            "The municipal board of Sablayan was dominated by representatives from Calintaan.",
            "Some of these representatives were Leoncio Panganiban, Benigno Lontoc, Juanito Gonzales, Juan Credo, Pedro Credo, Agustin Esmelo, Francisco Esmelo, Eriberto Lineses, Atanacio Encomio,Pedro Romaquin, Constancio Villarosa, Cornelio Gasmin, Aniceto Apigo, Alberto Obispo, Amador Ulay and Vicente Isidro.",
            "During this period, the residents of Calintaan requested that they be established as a municipality themselves rather than sitting as a barrio of Sablayan.",
            "They felt that Sablayan was too far away for easy governance.",
            "The petition was heard in Calapan, which at that time served as Provincial Council of all of Mindoro.",
            "Although some from the Sablayan municipal council supported the petitioners, their request was ultimately declined because it was feared that Calintaan did not have enough income to maintain a municipal government."
        ],
        [
            "In 1940, a resident of Calintaan, Pedro Gonzales, became mayor by a wide margin of Sablayan, becoming the first from Calintaan to do so."
        ],
        [
            "World War II"
        ],
        [
            "Less than a year after Gonzales' election, World War II caused most of the residents of Calintaan to evacuate, including the mayor himself."
        ],
        [
            "Post-War"
        ],
        [
            "Occidental Mindoro and Oriental Mindoro were formalized as provinces after the war on November 15, 1950.",
            "The population of Mindoro boomed as residents arrived from elsewhere, and the forests were cut from surrounding areas.",
            "Communal irrigation systems were built for ricefields.",
            "The indigenous Tau-Buhid or Batangan tribe relocated to the mountains.",
            "Calintaan itself became a municipality distinct from Sablayan on June 18, 1966, with governance of an area of 38,250 hectares, including the barrios of Concepcion, Iriron, New Dagupan and Tanyag.",
            "Calintaan's first municipal mayor was Felomino Jiminez, elected on November 14, 1967."
        ],
        [
            "The new town"
        ],
        [
            "In 1970, the barrio high school became a municipal high school, with extension classes opening at Tanyag, Iriron and Concepcion.",
            "At this time, the population of the Calintaan jurisdiction was 7,949.",
            "Due to continued immigration, the additional barrios of Poypoy and Malpalon were added to Calintaan.",
            "Home of the indigenous population, these have subsequently become Barangays.",
            "National parks were established in Poypoy, Calintaan and Sablayan to protect endangered species, including Mindoro's unique wild animals, the tamaraw.",
            "National agencies stepped in for other work as well, including improving irrigation."
        ],
        [
            "In 1971, during the first year of service of Calintaan Mayor Amador Sison, the Philippines entered a state of martial law.",
            "The national government then saw to additional improvements in Calintaan, including enlarging the canals so as to provide better irrigation and building roads and bridges.",
            "After Sison's death in April 1977, the office was inhabited by Vice Mayor Romeo Calabio, who in three years of service oversaw the addition of a health center and the initiation of a central town water system, before the next election on January 30, 1980.",
            "Following that election, Felomino Jimenez returned as municipal mayor to continue civic improvements."
        ],
        [
            "Important to the region, an Apostolic Vicariate of San Jose in Mindoro was created at St. Joseph Cathedral, San Jose, Occidental Mindoro.",
            "On July 1, 1983, Bishop Vicente Manuel, a grandson of Espiridion Jimenez, became its first Vicar Apostolic.",
            "Bishop Manuel was active in overseeing the implementation of programs in Calintaan engineered to improve the lives of Catholic residents."
        ],
        [
            "Following Mayor Jimenez's death on August 30, 1985, Vice Mayor Apolinario Bullagay entered office."
        ],
        [
            "Revolution"
        ],
        [
            "All of the officials in Calintaan were, like the rest of local officials in the Philippines, replaced by President Corazon Aquino following the peaceful revolution at EDSA in 1986.",
            "Edgardo Gagtan was appointed as OIC-Mayor.",
            "He initiated the construction of the public market, school buildings and communal faucets in some barangays.",
            "The municipality of Calintaan endured turbulent times, as the New People’s Army (NPA) attacked it and its barrios as part of their campaign against the government.",
            "The Philippine government countered the revolutionaries by conducting seminars to promote its aims and granting amnesty and awarding land to those who chose to reform.",
            "After several years, rebel unrest in Calintaan quieted."
        ],
        [
            "The area quickly went through several mayors following 1996 before Rolando Sison was elected in 1991, and civic construction continued.",
            "Meanwhile, the area's high school had continued to grow until, along with the barangay schools at Tanyag, Iriron and Concepcion, it became a national high school (CNHS) by executive order of Aquino.",
            "Sison's successor, attorney Eric Labrador (who had briefly served during those years of unrest) returned to office in 1995 and continued to oversee construction until the 1998 election of Renato Paulino.",
            "During Sison's term, the Apostolic Vicariate formed a farmers' cooperative and instructed area farmers in Integrated Pest Management (IPM)."
        ],
        [
            "The new millennium"
        ],
        [
            "Under Paulino's term as mayor, the area continued to expand, with new roads and public buildings, including a nursery and public market.",
            "He also oversaw the initiation of a gymnasium, which is not yet completed."
        ],
        [
            "A rebel group known as the New Peoples Army (NPA) is still a threat to the peace of Calintaan notwithstanding governmental efforts to sway leftist groups to democracy."
        ],
        [
            "In 2007, Lily Racca Estoya became the mayor, with former Mayor Paulino, who had just completed his third term, as her running mate."
        ],
        [
            "Geography"
        ],
        [
            "Calintaan has a total land area of 383 square kilometres (148 sq mi).",
            "It is covered in vast rice paddies and coryphas, which are used for making buri.",
            "The land area is around 82% mountainous with the rest of it being mostly coastal plains and hills."
        ],
        [
            "Calintaan is 136 kilometres (85 mi) from Mamburao."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Calintaan, Occidental Mindoro"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "30(1.2)"
        ],
        [
            "26(1.0)"
        ],
        [
            "39(1.5)"
        ],
        [
            "58(2.3)"
        ],
        [
            "192(7.6)"
        ],
        [
            "283(11.1)"
        ],
        [
            "341(13.4)"
        ],
        [
            "323(12.7)"
        ],
        [
            "317(12.5)"
        ],
        [
            "231(9.1)"
        ],
        [
            "119(4.7)"
        ],
        [
            "56(2.2)"
        ],
        [
            "2,015(79.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.3"
        ],
        [
            "8.3"
        ],
        [
            "12.4"
        ],
        [
            "16.3"
        ],
        [
            "23.5"
        ],
        [
            "27.1"
        ],
        [
            "28.4"
        ],
        [
            "27.3"
        ],
        [
            "27.6"
        ],
        [
            "26.3"
        ],
        [
            "19.2"
        ],
        [
            "13.6"
        ],
        [
            "240.3"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Barangays"
        ],
        [
            "Calintaan is politically subdivided into 7 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Concepcion"
        ],
        [
            "Iriron"
        ],
        [
            "Malpalon"
        ],
        [
            "New Dagupan"
        ],
        [
            "Poblacion"
        ],
        [
            "Poypoy"
        ],
        [
            "Tanyag"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CalintaanYearPop.±% p.a.1970 7,949—    1975 10,740+6.22%1980 14,416+6.06%1990 18,117+2.31%1995 21,687+3.43%2000 23,503+1.74%2007 26,779+1.82%2010 28,148+1.83%2015 29,826+1.11%2020 30,190+0.24%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Calintaan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  41.50"
        ],
        [
            "2009  34.19"
        ],
        [
            "2012  31.05"
        ],
        [
            "2015  29.83"
        ],
        [
            "2018  18.97"
        ],
        [
            "2021  16.28"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The economy of Calintaan is mainly agricultural, and its major crop is rice.",
            "Other crops produced and sold in Calintaan include corn, legumes, coconuts, and bananas.",
            "Practices such as fishing, livestock, poultry, banana processing (banana chips) and buricraft (the production of goods made from buri fibers such as buntal) are also important to the economy."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Calintaan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Postma, Antoon.",
            "1983.",
            "\"Historical Data on the Greater San Jose Parish of Occidental Mindoro\".",
            "San Carlos Publications.",
            "Cebu City.",
            "p. 1-3"
        ],
        [
            "^ a b Postma, Antoon.",
            "1982.",
            "\"Calintaan: Glimpses From Its Historic Past\".",
            "San Carlos Publications.",
            "Cebu City.",
            "p. 4"
        ],
        [
            "^ a b c d e f Cordova, Gregoria.",
            "1988.",
            "\"History of Calintaan\".",
            "Unpublished."
        ],
        [
            "^ a b Candelario, Rudy.",
            "1997.",
            "Interview with Sablayan Ex-Mayor Pedro Gonzales"
        ],
        [
            "^ Philippine Statistics Authority (NSO).",
            "1970.",
            "Census of Population, 1970."
        ],
        [
            "^ a b Candelario, Rudy.",
            "1997.",
            "Interview with Dr. Iluminada Remo"
        ],
        [
            "^ Candelario, Rudy.",
            "1997.",
            "Interview with Mr. Hoverto Isidro"
        ],
        [
            "^ Candelario, Rudy.",
            "2007.",
            "Interview with Eilene Dionisio ."
        ],
        [
            "^ a b \"About Calintaan\".",
            "One Town One Product (OTOP) Philippines.",
            "Retrieved 2008-03-08."
        ],
        [
            "^"
        ],
        [
            "\"Calintaan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Occidental Mindoro\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Calintaan."
        ],
        [
            "Calintaan Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Calintaan"
        ],
        [
            "Sablayan"
        ],
        [
            "Mindoro Strait"
        ],
        [
            "Calintaan"
        ],
        [
            "Mansalay, Oriental Mindoro"
        ],
        [
            "Rizal / San Jose"
        ],
        [
            "vte Province of Occidental MindoroMamburao (capital)  San Jose (largest municipality)Municipalities"
        ],
        [
            "Abra de Ilog"
        ],
        [
            "Calintaan"
        ],
        [
            "Looc"
        ],
        [
            "Lubang"
        ],
        [
            "Magsaysay"
        ],
        [
            "Mamburao"
        ],
        [
            "Paluan"
        ],
        [
            "Rizal"
        ],
        [
            "Sablayan"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Calintaan&oldid=1210141244\""
        ],
        [
            "Category: Municipalities of Occidental MindoroHidden categories: Pages using gadget WikiMiniAtlasAll articles with dead external linksArticles with dead external links from June 2019Articles with permanently dead external linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from May 2016Articles that may contain original research from July 2008All articles that may contain original researchCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}