{
    "name": "Calumpit",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Calumpit"
        ],
        [
            "24 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSimple EnglishTagalogاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°55′N 120°46′E﻿ / ﻿14.92°N 120.77°E﻿ / 14.92; 120.77"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bulacan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Calumpit\" – news · newspapers · books · scholar · JSTOR (October 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesCalumpitMunicipalityMunicipality of CalumpitCalumpit Municipal Hall"
        ],
        [
            "FlagSealEtymology: KalumpítMotto: God bless CalumpitMap of Bulacan with Calumpit highlightedOpenStreetMapCalumpitLocation within the PhilippinesCoordinates: 14°55′N 120°46′E﻿ / ﻿14.92°N 120.77°E﻿ / 14.92; 120.77CountryPhilippinesRegionCentral LuzonProvinceBulacanDistrict"
        ],
        [
            "1st districtFounded14 November 1571Chartered5 March 1575Founded by"
        ],
        [
            "Gat Maitim"
        ],
        [
            "Miguel Lopez de Legazpi"
        ],
        [
            "Sargento Juan Moron"
        ],
        [
            "Barangays29"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorGlorime M. Faustino • Vice MayorZacarias C. Candelaria • RepresentativeDanilo A. Domingo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Rico John L. PagdangananThelma A. DansalanLucerio D. DiegoRicky L. VirayAgnes A. PanganRomeo M. Bernardino Jr.Alvin N. DangananMaureen I. Torres"
        ],
        [
            " • Electorate70,117 voters (2022)Area • Revenue₱ 369.3 million (2020) • Assets₱ 722.2 million (2020) • Expenditure₱ 314.8 million (2020) • Liabilities₱ 300.4 million (2020)Utilities • ElectricityMeralcoTime zoneUTC+8 (PST)ZIP code3003PSGC031407000IDD : area code +63 (0)44Native languagesTagalog KapampanganWebsitewww.calumpit.gov.ph"
        ],
        [
            "Calumpit ("
        ],
        [
            "Etymology"
        ],
        [
            "The name \"Calumpit\" comes from the tree \"Kalumpít\", an indigenous hardwood species similar to apalit and narra, which grows abundantly in front of the St. John the Baptist Parish Church in the Población-Sucol area."
        ],
        [
            "History"
        ],
        [
            "Calumpit Poblacion"
        ],
        [
            "Precolonial era"
        ],
        [
            "Calumpit was already an established barangay under the leadership of Gat Maitim prior to the fall of Tondo in June 1571.",
            "Other nearby villages were Gatbuka, Meyto, Meysulao, Pandukot, Malolos, Macabebe, Hagonoy, and Apalit.",
            "When Calumpit was Hispanized and established as a political and geographical entity in 1572, they chose what is today Barangay Población as the site of the church and the administrative center of the aforementioned villages, which were annexed to it."
        ],
        [
            "Spanish period"
        ],
        [
            "Upon hearing that the Kingdom of Tondo was conquered by Martín de Goíti and Juan Salcedo, and that Rajah Matanda allied with the Spaniards in May 1571, Bambalito formed a fleet of two thousand natives mostly from Hagonoy and Macabebe.",
            "They sailed across Manila Bay to Tondo on 3 June 1571, facing Goíti and Salcedo in the historic Battle of Bangkusay.",
            "Bambalito and the natives were defeated, and the conquerors proceeded northwards to pacify other villages along the coast of Manila Bay."
        ],
        [
            "In September 1571, Goíti and Salcedo, along with the invading forces, arrived at Lubao.",
            "On 14 November 1571, they reached Calumpit and Malolos and reported it to Miguel López de Legazpi, the first Spanish Governor-General of the Philippines.",
            "The two settlements were then constituted as the Encomienda de Calumpit and Encomienda de Malolos, respectively.",
            "The Encomienda de Calumpit was entrusted to Sargento Juan Moron, one of the conquerors in the Legazpi Expedition."
        ],
        [
            "Christianization"
        ],
        [
            "It is uncertain as to exactly when the Augustinians first set foot in Calumpit, but according to the documents, Calumpit was already a parish by 3 May 1572, when Fray Martín de Rada was elected Prior Provincial.",
            "Calumpit was simultaneously established with the conventos of Bay, Laguna, Tondo and Lubao, Pampanga, with De Rada as its prior and Fray Diego Vivar as his vicar."
        ],
        [
            "Accounts state that the Augustinian missionaries planted a wooden cross along the bank of the Meyto River to symbolise the baptism of the land, and they built a chapel made of nipa and bamboo.",
            "Later, they moved to Meysulao and built another visita, and then in Panducot, where they built another chapel dedicated to Our Lady of the Visitation as Fray Gaspar de San Agustín mentioned in his Conquistas delas Isla Philipinas (Libro Segundo, Chapter 9).",
            "Subsequently, the missionary headquarters was moved again to a much higher place where a very huge and prominent tree called \"Kalumpit\" (Terminalia macrocarpa decne) stands as the original settlers named the place.",
            "Another notable characteristic of the village of Calumpit is that it was bounded by rivers which served as a natural moat-like feature.",
            "Primarily, Meyto, Meysulao, Panducot and Calumpit was independent barangays under their own chiefs, it is same with Gatbuka, Bugyon and other old settlements."
        ],
        [
            "On 5 April 1572, Legaspi merged the villages of Meyto, Meysulao, Panducot, Calumpit, Candaba, Apalit and Malolos and these villages became ministerios and visitas and these settlements first formed the town named Calumpit, with present-day Calumpit as center."
        ],
        [
            "On 28 December 1575, Gov.",
            "General Francisco Sande ordered the inclusion of the villages of Agonoy (Hagonoy), Quinabalonan (now Santa Monica and San Jose, Hagonoy), and some villages along Macabebe river to the town of Calumpit."
        ],
        [
            "Early Spanish presence"
        ],
        [
            "When Calumpit was already pacified by Spaniards and submitted under the colonial rule, On 5 April 1572, Encomiendas of Calumpit and Malolos was unified under the shared administration of their encomenderos Don Marcos de Herrera and Sargento Mayor Juan Moron.",
            "One month later on the same year Calumpit was created as one of the centers of the Augustinian ministry in Northern Luzon with Convento de Lubao Pampanga, which includes Betis and Bacolor and Convento de Taal Batangas established on 3 May 1572, upon the election of Fray Martín de Rada as the new Prior Provincial of the Augustinians replacing Fray Diego de Herrera who was recalled to Mexico.",
            "This parochial beginnings of Calumpit have included the old villages of Hagonoy, Apalit, Candaba, Malolos and Macabebe as its missions.",
            "The town of Calumpit was originally dedicated to Saint Nicholas of Tolentino, but in December 1576, the town was re-dedicated to the patronage of Saint John the Baptist."
        ],
        [
            "Province of Calumpit"
        ],
        [
            "On 28 December 1575, Governor-General Francisco de Sande established Calumpit as an Alcaldia (Province) with Marcos de Arce as the first Alcalde Mayor, with Calumpit and nearby visitas and settlements such as Malolos, Hagonoy, Macabebe, Apalit and Candaba.",
            "Later in 1576, jurisdiction of Macabebe transferred to the town of Lubao and Candaba separated and became town, then on 11 June 1580, Malolos became a town, and it was transferred to Alcaldia de Bulacan.",
            "In 1581, Hagonoy had its own convent but still under the Governor of Calumpit, while in 1591 Apalit officially separated and established as an independent town, and it was transferred in the reconfigured territory of Pampanga province.",
            "In Miguel de Loarca's document in 1581 called Relación de las Islas Filipinas and the June 1591 document of Governor-General Luis Pérez de Dasmariñas, it is proven that Calumpit appears as an independent Alcaldia, independent of those of Bulacan and Lubao and Betis.",
            "It was therefore established as an Encomienda and Alcaldia separate to Province of Bulacan.",
            "Contrary to popular belief, Calumpit was not only the first town founded in Bulacan, but it existed as a province."
        ],
        [
            "Abolition"
        ],
        [
            "The Alcaldia de Calumpit was eventually abolished and the towns of Calumpit and Hagonoy were annexed to the Province of Bulacan.",
            "Neighbouring Apalit was meanwhile annexed to Pampanga."
        ],
        [
            "Philippine Revolution and Philippine-American War"
        ],
        [
            "During the Philippine Revolution in 1896, Calumpiteños participated in battles launched by the Katipunan against the Spanish Empire.",
            "Many notable Calumeteños helped establish and support the Malolos Republic, with the town serving as a defense line due to its proximity to the new capital.",
            "When the Philippine–American War erupted, Calumpit become the headquarters of General Antonio Luna in 1898.",
            "In the bloody encounters at Barrio Bagbag on 25 April 1899, many people joined the army of General Luna."
        ],
        [
            "Civil administration under the United States-led Insular Government was established in Calumpit in April 1901, with Juan Galang serving as the first elected American-era mayor of the town."
        ],
        [
            "American occupation and World War II"
        ],
        [
            "Aerial view of Calumpit, circa 1930s"
        ],
        [
            "Calumpit played an important role at the outbreak of the Second World War in the Pacific theater.",
            "The bridge of Calumpit, on the way to Bataan was demolished by the Engineering Battalion of the U.S., impeding movement of the Japanese forces on their way to Bataan.",
            "In January 1942, the Japanese Government occupied Calumpit for three years, during which many of the townsfolk died."
        ],
        [
            "In the middle of 1943, the first part of the USAFFE guerrilla was established under the leadership of Luis Macam, with most of the members from Calumpit."
        ],
        [
            "In June 1944, the 4th Battalion of the Del Pilar Regiment was established under the leadership of Major Francisco del Rosario.",
            "They continued fighting until the returned of the USAFFE under the leadership of General Douglas MacArthur."
        ],
        [
            "In January 1945, the combined Filipino and American troops arrived in the town, liberating it from Japanese control."
        ],
        [
            "Third republic"
        ],
        [
            "On 18 November 1959, former mayor Fausto Carlos was convicted for the murder of suspected Hukbalahap rebel Artemio Mutuc at the municipal building 11 years prior and was sentenced to life in prison."
        ],
        [
            "Geography"
        ],
        [
            "Calumpit is 50 kilometres (31 mi) from Manila and 5 kilometres (3.1 mi) from Malolos City."
        ],
        [
            "Calumpit is sprawled over an area of 5,625 has.",
            "of flat terrain classified accordingly to use for agricultural (66.81%), residential (10.42%), industrial (2.48%), commercial, (0.89%) and other (1.05%) purposes.",
            "It occupies around 2.06% of the total land area of Bulacan.",
            "The municipality has 144.33 kilometers of concrete roads that easily link its 29 barangays."
        ],
        [
            "Two distinct seasons characterize the town's climate: rainy season which starts late May and ends around November; and dry season which begins November and lasts until April."
        ],
        [
            "Calumpit has two types of soil – the silt loam which is found in almost 90% of the entire municipality and the clay loam in the south-east far end of the town.",
            "Both types are basically suited for agricultural purposes as per Department of Agriculture (Philippines) classifications."
        ],
        [
            "Calumpit River"
        ],
        [
            "Calumpit River"
        ],
        [
            "The stretch of waterway where two great rivers traversing through Calumpit, the Angat River and the Pampanga River is referred to as the Calumpit River."
        ],
        [
            "This river has shaped the lives of Bulakeños since time immemorial.",
            "With the longest river system in Bulacan, Calumpit River traverses the towns of Calumpit, Pulilan and Plaridel on the east, Paombong and Hagonoy in the West and winds up through Apalit, Macabebe and Masantol, Pampanga."
        ],
        [
            "It was the major route for trade and commerce in this part of the Luzon prior to the arrival of Spain.",
            "The Pampanga and Quingua Rivers served as arteries through which goods coming in and going out of Calumpit passed.",
            "At present, the river is a valued resource as a rich fishing ground and providing farmers with irrigation."
        ],
        [
            "Climate"
        ],
        [
            "The climate of Calumpit is similar to that of the rest of the other municipalities in the province of Bulacan.",
            "It is characterized by two (2) distinct seasons namely, the rainy and the dry.",
            "The rainy seasons starts from late May and ends around November, the dry season from December to April.",
            "The average annual rainfall is 255.3 millimetres (10.05 in) with the month of August having the highest month average rainfall, about 304 millimetres (12.0 in).",
            "The annual number of rainy days is 175 days."
        ],
        [
            "Climate data for Calumpit, Bulacan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "6(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "6(0.2)"
        ],
        [
            "17(0.7)"
        ],
        [
            "82(3.2)"
        ],
        [
            "122(4.8)"
        ],
        [
            "151(5.9)"
        ],
        [
            "123(4.8)"
        ],
        [
            "124(4.9)"
        ],
        [
            "99(3.9)"
        ],
        [
            "37(1.5)"
        ],
        [
            "21(0.8)"
        ],
        [
            "792(31.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "2.5"
        ],
        [
            "11.7"
        ],
        [
            "6.6"
        ],
        [
            "17.7"
        ],
        [
            "22.2"
        ],
        [
            "25.2"
        ],
        [
            "23.7"
        ],
        [
            "23.2"
        ],
        [
            "17.9"
        ],
        [
            "9.2"
        ],
        [
            "5.2"
        ],
        [
            "168.4"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Barangays"
        ],
        [
            "Calumpit is politically subdivided into 29 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 031407001   Balite"
        ],
        [
            " 2.7%"
        ],
        [
            " 3,216"
        ],
        [
            " 2,399"
        ],
        [
            "  ▴"
        ],
        [
            " 2.97%"
        ],
        [
            " 031407002   Balungao"
        ],
        [
            " 4.3%"
        ],
        [
            " 5,044"
        ],
        [
            " 4,899"
        ],
        [
            "  ▴"
        ],
        [
            " 0.29%"
        ],
        [
            " 031407004   Buguion"
        ],
        [
            " 2.8%"
        ],
        [
            " 3,296"
        ],
        [
            " 3,143"
        ],
        [
            "  ▴"
        ],
        [
            " 0.48%"
        ],
        [
            " 031407005   Bulusan"
        ],
        [
            " 2.2%"
        ],
        [
            " 2,564"
        ],
        [
            " 2,330"
        ],
        [
            "  ▴"
        ],
        [
            " 0.96%"
        ],
        [
            " 031407006   Calizon"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,999"
        ],
        [
            " 1,926"
        ],
        [
            "  ▴"
        ],
        [
            " 0.37%"
        ],
        [
            " 031407007   Calumpang"
        ],
        [
            " 3.5%"
        ],
        [
            " 4,159"
        ],
        [
            " 3,571"
        ],
        [
            "  ▴"
        ],
        [
            " 1.54%"
        ],
        [
            " 031407008   Caniogan"
        ],
        [
            " 3.6%"
        ],
        [
            " 4,278"
        ],
        [
            " 3,955"
        ],
        [
            "  ▴"
        ],
        [
            " 0.79%"
        ],
        [
            " 031407009   Corazon"
        ],
        [
            " 2.1%"
        ],
        [
            " 2,458"
        ],
        [
            " 2,529"
        ],
        [
            "  ▾"
        ],
        [
            " −0.28%"
        ],
        [
            " 031407010   Frances"
        ],
        [
            " 4.9%"
        ],
        [
            " 5,770"
        ],
        [
            " 5,535"
        ],
        [
            "  ▴"
        ],
        [
            " 0.42%"
        ],
        [
            " 031407011   Gatbuca"
        ],
        [
            " 5.3%"
        ],
        [
            " 6,332"
        ],
        [
            " 5,914"
        ],
        [
            "  ▴"
        ],
        [
            " 0.69%"
        ],
        [
            " 031407012   Gugo"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,770"
        ],
        [
            " 1,581"
        ],
        [
            "  ▴"
        ],
        [
            " 1.14%"
        ],
        [
            " 031407013   Iba Este"
        ],
        [
            " 2.3%"
        ],
        [
            " 2,754"
        ],
        [
            " 2,756"
        ],
        [
            "  ▾"
        ],
        [
            " −0.01%"
        ],
        [
            " 031407014   Iba Oeste"
        ],
        [
            " 10.4%"
        ],
        [
            " 12,359"
        ],
        [
            " 10,610"
        ],
        [
            "  ▴"
        ],
        [
            " 1.54%"
        ],
        [
            " 031407015   Longos"
        ],
        [
            " 2.9%"
        ],
        [
            " 3,444"
        ],
        [
            " 3,070"
        ],
        [
            "  ▴"
        ],
        [
            " 1.16%"
        ],
        [
            " 031407016   Meysulao"
        ],
        [
            " 3.5%"
        ],
        [
            " 4,109"
        ],
        [
            " 3,430"
        ],
        [
            "  ▴"
        ],
        [
            " 1.82%"
        ],
        [
            " 031407017   Meyto"
        ],
        [
            " 2.5%"
        ],
        [
            " 2,971"
        ],
        [
            " 2,780"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 031407018   Palimbang"
        ],
        [
            " 1.8%"
        ],
        [
            " 2,117"
        ],
        [
            " 2,146"
        ],
        [
            "  ▾"
        ],
        [
            " −0.14%"
        ],
        [
            " 031407019   Panducot"
        ],
        [
            " 2.1%"
        ],
        [
            " 2,501"
        ],
        [
            " 2,403"
        ],
        [
            "  ▴"
        ],
        [
            " 0.40%"
        ],
        [
            " 031407020   Pio Cruzcosa"
        ],
        [
            " 3.7%"
        ],
        [
            " 4,336"
        ],
        [
            " 4,145"
        ],
        [
            "  ▴"
        ],
        [
            " 0.45%"
        ],
        [
            " 031407021   Poblacion"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,909"
        ],
        [
            " 2,044"
        ],
        [
            "  ▾"
        ],
        [
            " −0.68%"
        ],
        [
            " 031407022   Pungo"
        ],
        [
            " 7.0%"
        ],
        [
            " 8,347"
        ],
        [
            " 7,674"
        ],
        [
            "  ▴"
        ],
        [
            " 0.84%"
        ],
        [
            " 031407023   San Jose"
        ],
        [
            " 4.6%"
        ],
        [
            " 5,437"
        ],
        [
            " 5,017"
        ],
        [
            "  ▴"
        ],
        [
            " 0.81%"
        ],
        [
            " 031407024   San Marcos"
        ],
        [
            " 1.9%"
        ],
        [
            " 2,255"
        ],
        [
            " 2,166"
        ],
        [
            "  ▴"
        ],
        [
            " 0.40%"
        ],
        [
            " 031407025   San Miguel"
        ],
        [
            " 4.2%"
        ],
        [
            " 4,998"
        ],
        [
            " 4,720"
        ],
        [
            "  ▴"
        ],
        [
            " 0.57%"
        ],
        [
            " 031407026   Santa Lucia"
        ],
        [
            " 1.9%"
        ],
        [
            " 2,206"
        ],
        [
            " 2,391"
        ],
        [
            "  ▾"
        ],
        [
            " −0.80%"
        ],
        [
            " 031407027   Santo Niño"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,955"
        ],
        [
            " 2,357"
        ],
        [
            "  ▾"
        ],
        [
            " −1.85%"
        ],
        [
            " 031407028   Sapang Bayan"
        ],
        [
            " 2.3%"
        ],
        [
            " 2,762"
        ],
        [
            " 2,454"
        ],
        [
            "  ▴"
        ],
        [
            " 1.19%"
        ],
        [
            " 031407029   Sergio Bayan"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,967"
        ],
        [
            " 1,713"
        ],
        [
            "  ▴"
        ],
        [
            " 1.39%"
        ],
        [
            " 031407030   Sucol"
        ],
        [
            " 1.2%"
        ],
        [
            " 1,444"
        ],
        [
            " 1,410"
        ],
        [
            "  ▴"
        ],
        [
            " 0.24%"
        ],
        [
            "Total"
        ],
        [
            "118,471"
        ],
        [
            "101,068"
        ],
        [
            " ▴"
        ],
        [
            "1.60%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CalumpitYearPop.±% p.a.1903 13,897—    1918 14,844+0.44%1939 17,047+0.66%1948 21,788+2.76%1960 27,662+2.01%1970 36,119+2.70%1975 41,041+2.60%1980 45,454+2.06%1990 59,042+2.65%1995 70,839+3.47%2000 81,113+2.95%2007 98,017+2.65%2010 101,068+1.12%2015 108,757+1.41%2020 118,471+1.70%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Calumpit was 118,471,  with a density of 2,100 inhabitants per square kilometre or 5,400 inhabitants per square mile."
        ],
        [
            "Calumpit's population was 101,068 in the Philippine Statistics Authority (NSO) 2010 census.",
            "Historically, its population grew at an average of 3.71% per annum."
        ],
        [
            "The barangay with the largest population is Iba Oeste, with 10,610 residents, while the smallest is Sucol with 1,410 residents."
        ],
        [
            "Calumpit has a relatively young population, with the age group 1–19 years old, constituting 46.01% of the total population.",
            "The rest consists mainly of the working group between the ages of 20 to 59 years old accounting for about 47.96% and the elderly comprising 6.02%."
        ],
        [
            "In terms of sex distribution, males exceeded the number of females very slightly with a count of 35,710 and 35,087, respectively."
        ],
        [
            "Language"
        ],
        [
            "Calumpit is a predominantly Tagalog-speaking town, with about 96.3% of its people being fluent speakers.",
            "Residents in the northernmost barangays (bordering Apalit) speak Kapampangan while a minority speak other Philippine languages."
        ],
        [
            "Religion"
        ],
        [
            "San Juan Bautista Parish Church"
        ],
        [
            "As Calumpit is the first town in Bulacan to have been Christianized by the Spaniards in 1572, about 80% of residents profess the Roman Catholic faith.",
            "Under the United States and because of the eventual disestablishment of the Catholic Church in the Philippines in 1902, Protestantism gained a foothold in the municipality.",
            "Significant religious minorities include the Iglesia ni Cristo, Members Church of God International, Iglesia Filipina Independiente."
        ],
        [
            "Among the oldest churches in Bulacan found in Calumpit is the San Juan Bautista Church.",
            "Constructed under Augustinian friars Martín de Rada and Diego Vivar, it was initially made of nipa and bamboo and gradually built of stone in 1700.",
            "It enshrines the local patron saint, John the Baptist, whose liturgical birthday on 24 June is celebrated as the town fiesta."
        ],
        [
            "Inside the church is a tunnel that, as legend would have it, was used by priests during the Spanish era as an escape route in the event of Chinese and Moro pirate attacks.",
            "It is a declared Diocesan Shrine of the Diocese of Malolos."
        ],
        [
            "Meyto Shrine"
        ],
        [
            "The Meyto Shrine marks the cradle of Christianity in western Bulacan, where a wooden cross was first planted and first mass in the region was said in May 1572.",
            "The shrine, located in the western part of town, is also the site of the original church of Calumpit, predating the existing one in the town centre.",
            "During the Philippine Revolution, the Iglesia Filipina Independiente – which had by then separated from the Catholic Church – took over Meyto Shrine."
        ],
        [
            "Labor and employment"
        ],
        [
            "In 1995, Calumpit had a relatively big labor force of 24,095 or 66% of the population aged 20–59.",
            "Around 35% of these skilled and were employed in their respective occupations; 28% were housewives with occasional employment as farmhands, selling farm produce in the market and doing marginal odd jobs.",
            "Others were unclassified and consisted mostly of students, out-of-school youth and the unemployed."
        ],
        [
            "Total household income per annum is ₱705 million, with the annual average household income is ₱66,600 and per capita income annually is ₱12,198."
        ],
        [
            "Literacy"
        ],
        [
            "The high literacy rate (98.5%) is maintained by its 24 elementary schools and six secondary or high schools.",
            "The Bulacan Manpower and Livelihood Training Center (BMLTC), based at the heart of the town, offers vocational courses and serves as the training ground for both unskilled and highly skilled workers.",
            "As a result, most Calumpiteños have acquired and maintained skills suited for employment especially in the agro-industrial field."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Calumpit"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  5.30"
        ],
        [
            "2009  6.41"
        ],
        [
            "2012  5.22"
        ],
        [
            "2015  6.27"
        ],
        [
            "2018  4.73"
        ],
        [
            "2021  14.69"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The renowned Longganisang Calumpit"
        ],
        [
            "Major industries"
        ],
        [
            "Industrial estates"
        ],
        [
            "Handicrafts"
        ],
        [
            "Food processing"
        ],
        [
            "Paper"
        ],
        [
            "Garments"
        ],
        [
            "Ceramics/pottery"
        ],
        [
            "Flowers/ornamental plants"
        ],
        [
            "Houseware"
        ],
        [
            "Major products"
        ],
        [
            "Longganisang Calumpit"
        ],
        [
            "Key chains, key holders, pen holders"
        ],
        [
            "Company Uniforms"
        ],
        [
            "Corporate giveaways"
        ],
        [
            "Industrial estates"
        ],
        [
            "Bulacan Agro-Industrial Subdivision (Barangay Pio Cruzcosa)"
        ],
        [
            "Garments & Printing Services"
        ],
        [
            "Imprentas Printing Services - Sitio Danga, Brgy.",
            "San Miguel"
        ],
        [
            "Osano Threads Garments - Sitio Danga, Brgy.",
            "San Miguel"
        ],
        [
            "Osanotech Sports Apparels - Sitio Danga, Brgy.",
            "San Miguel"
        ],
        [
            "Tourism and culture"
        ],
        [
            "Festivals"
        ],
        [
            "Calumpit celebrates its town fiesta from June 23 to 24.",
            "The Libad is a river procession held every Saint John's Eve on June 23 to honour the town's patron saint.",
            "Calumpiteños sing, dance and douse water to \"baptize\" passers-by, recalling the saint's characteristic act.",
            "The ritual and its traditional route are relics of the old fluvial procession held when Apalit and Hagonoy were still governed from Calumpit.",
            "The festivities carry on to the next day, June 24, the feast of Saint John the Baptist."
        ],
        [
            "Every June 23, a day before John the Baptist's feast, Calumpit's 29 barangays participate in the \"Libad sa Ilog\" fluvial float parade."
        ],
        [
            "One of the oldest barangays in the town, established in 1575, Santa Lucia is very popular and famous because of the supposedly miraculous image of its patroness, Saint Lucy.",
            "During the village festival, every December 12–13, the streets of the village are strung with colorful banderitas, as is the façade of Santa Lucia Church.",
            "Pilgrims visit the church for the two-day celebration, with the novena to the saint beginning on December 4."
        ],
        [
            "Calumpit longganisa festival"
        ],
        [
            "On March 24-25, 2023, the town's 451st Founding Anniversary, Mayor Glorime M. Faustino led the 1st Calumpit longganisa Festival with a 514 meters \"Longest Boodle Fight\" along  Pulilan Regional Road.",
            "3,000 people who participated from Barangays Caniogan and Corazon ate the star \"Longganisang Bawang\" of Bikers Longganisa makers."
        ],
        [
            "Bagbag Bridge"
        ],
        [
            "Bagbag Bridge was the site of the longest battle between the Americans and Filipinos led by General Gregorio del Pilar on April 25, 1899.",
            "The bridge is now a reminder of the valor displayed by the Filipino who triumphed against the American forces."
        ],
        [
            "Education"
        ],
        [
            "Colegio de Calumpit (formerly Calumpit Institute)"
        ],
        [
            "Notable personalities"
        ],
        [
            "Servants of God Dionisia de Santa María Mitas Talangpaz (1691–1732) and Cecilia Rosa de Jesús Talangpaz (1693–1731): Sisters Dionisia and Cecilia Talangpas co-founded the Beaterio de San Sebastián.",
            "Their beatification process started in 1999, and they have both been deemed Servants of God while consideration for sainthood is in progress.",
            "Known for their exemplary lives of prayer, self-denial, service to the Church and apostolate that attracted young Filipinas."
        ],
        [
            "Gregorio Velasquez, National Scientist of the Philippines for Phycology"
        ],
        [
            "Francisco O. Santos, National Scientist of the Philippines for Human Nutrition and Agricultural Chemistry"
        ],
        [
            "José Zabala-Santos - one of the most popular cartoonists in the Philippines during the 1950s for characters such Popoye, Sianong Sano, and Lukas Malakas."
        ],
        [
            "Higino J. Fallorina Award-winning cinematographer.",
            "Tatlong Maria (1944), Baguio Cadets (1950)Maria Clara Awards, Roberta (1951), Sa isang sulyap mo Tita (1953), Jack and Jill (1954), Nagkita si kerubin at tulisang pugot (1954), Anino ni Bathala (1958), Katawang lupa (1975), Bamboo trap (1975), Mababagsik na anghel (1975), Saan ka pupunta, Miss Lutgarda Nicolas?",
            "(1975), Anna Karenina: Babaeng hiwalay sa asawa (1976), Halik na lumalatay (1977), Ang babae sa ulog (1981)"
        ],
        [
            "Incidents"
        ],
        [
            "In 2011 when Typhoon Nesat or \"Pedring\" and Typhoon Nalgae or \"Quiel\" battered Central Luzon consecutively within two months, thousands of families in Calumpit and nearby towns experienced neckdeep floods due to the rains, bursting dikes and the release of water from dams that had reached critical levels."
        ],
        [
            "Gallery"
        ],
        [
            "Calumpit Welcome Arch, viewed from the Calumpit-Pulilan Road"
        ],
        [
            "San Juan Bautista Church"
        ],
        [
            "St. Joseph Parish Church"
        ],
        [
            "Calumpit Wet and Dry Public Market"
        ],
        [
            "Rotary Club of Calumpit - Calumpit Public Library"
        ],
        [
            "Calumpit Water District"
        ],
        [
            "Labangan Bridge"
        ],
        [
            "Notes"
        ],
        [
            "^  Municipality of Calumpit |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Merrill, Elmer Drew (1903).",
            "A Dictionary of the Plant Names of the Philippine Islands.",
            "Manila: Bureau of Public Print.",
            "p. 8."
        ],
        [
            "^ Blair and Robertson.",
            "\"The Philippine Islands\".",
            "pp. 304–310.",
            "Archived from the original on 2015-09-24.",
            "Retrieved 2014-08-31."
        ],
        [
            "^ Administracion espiritual de los Padres Agustinos calsados de la Provincia del Duche Nombre de Jesus de las islas Filipinas, Valladolid, Imprenta de H. Roldan, Mayo de 1833, p. 47"
        ],
        [
            "^ E. H. Blair (October 14, 2004).",
            "\"The Philippine Islands, 1493–1898\".",
            "gutenberg.org."
        ],
        [
            "^ a b Chisholm, Hugh, ed.",
            "(1911).",
            "\"Calumpit\" .",
            "Encyclopædia Britannica.",
            "Vol.",
            "5 (11th ed.).",
            "Cambridge University Press.",
            "p. 69."
        ],
        [
            "^ \"Ex-mayor gets life for slay\".",
            "The Manila Times.",
            "Malolos, Bulacan: The Manila Times Publishing Company, Inc. November 19, 1959.",
            "The former town mayor was found guilty of murder in a decision signed by Judge Ambrosio T. Dollete of the third sala of the local court of first instance."
        ],
        [
            "^ \"Calumpit: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 12, 2020."
        ],
        [
            "^ \"Municipality: CALUMPIT\".",
            "Philippine Statistics Authority (National Statistical Coordination Board).",
            "Archived from the original on November 11, 2016.",
            "Retrieved May 24, 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bulacan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Things to Do and see in Bulacan...\" Wow Philippines.",
            "Archived from the original on July 12, 2007.",
            "Retrieved April 14, 2007."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Velez, Freddie (June 24, 2023).",
            "\"Over 100 well-decorated pagodas featured in 'Libad Festival 2023' in Bulacan\".",
            "Manila Bulletin.",
            "Retrieved June 28, 2024."
        ],
        [
            "^ Velez, Freddie (June 24, 2024).",
            "\"Thousands of Bulakenyos, tourists join Calumpit's Libad Festival 2024\".",
            "Manila Bulletin.",
            "Retrieved June 28, 2024."
        ],
        [
            "^ Velez, Freddie (Mar 24, 2023).",
            "\"1st Calumpit Longganisa Festival draws thousands\".",
            "Manila Bulletin.",
            "Retrieved April 30, 2024."
        ],
        [
            "^ Labor, Analy (March 23, 2024).",
            "\"Calumpit Longganisa Festival feat.",
            "500m logganisa boodle fight\".",
            "Retrieved April 30, 2024."
        ],
        [
            "^ Sianong Sano by Jose Zabala Santos 1950's.",
            "Comicartfans.com (2009-07-07).",
            "Retrieved on 2011-05-25."
        ],
        [
            "^ \"Pedring the worst for Bulacan town\".",
            "ABS-CBN News.",
            "Retrieved January 22, 2019."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Calumpit."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "All About Calumpit Bulacan"
        ],
        [
            "Philippine Census information"
        ],
        [
            "Bulacan Provincial website"
        ],
        [
            "LGO:Municipality of Calumpit"
        ],
        [
            "Municipality of Calumpit"
        ],
        [
            "Samahang Calumpit - Canada"
        ],
        [
            "Places adjacent to Calumpit"
        ],
        [
            "Apalit, Pampanga"
        ],
        [
            "Macabebe, Pampanga"
        ],
        [
            "Calumpit"
        ],
        [
            "PulilanPlaridel"
        ],
        [
            "Masantol, Pampanga"
        ],
        [
            "Hagonoy / Paombong"
        ],
        [
            "Malolos City"
        ],
        [
            "vte Province of BulacanMalolos (capital)  San Jose del Monte (largest city)Municipalities"
        ],
        [
            "Angat"
        ],
        [
            "Balagtas"
        ],
        [
            "Bocaue"
        ],
        [
            "Bulakan"
        ],
        [
            "Bustos"
        ],
        [
            "Calumpit"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Guiguinto"
        ],
        [
            "Hagonoy"
        ],
        [
            "Marilao"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Pandi"
        ],
        [
            "Paombong"
        ],
        [
            "Plaridel"
        ],
        [
            "Pulilan"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Maria"
        ],
        [
            "Component cities"
        ],
        [
            "Baliwag"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Calumpit&oldid=1231811751\""
        ],
        [
            "Categories: Municipalities of BulacanPopulated places on the Pampanga RiverHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsWikipedia articles incorporating a citation from the 1911 Encyclopaedia Britannica with Wikisource referenceCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from October 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Tagalog IPAArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from July 2019Commons category link from WikidataArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}