{
    "name": "Camiling",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Camiling"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°41′12″N 120°24′47″E﻿ / ﻿15.6867°N 120.4131°E﻿ / 15.6867; 120.4131"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Tarlac, Philippines"
        ],
        [
            "This article is about the municipality.",
            "For the crater, see Camiling (crater)."
        ],
        [
            "Municipality in Central Luzon, PhilippinesCamilingMunicipalityMunicipality of CamilingWelcome Arch"
        ],
        [
            "FlagSealNickname: Old Lady in the Northwestern Province of TarlacMotto: Camiling MagalingMap of Tarlac with Camiling highlightedOpenStreetMapCamilingLocation within the PhilippinesCoordinates: 15°41′12″N 120°24′47″E﻿ / ﻿15.6867°N 120.4131°E﻿ / 15.6867; 120.4131CountryPhilippinesRegionCentral LuzonProvinceTarlacDistrict"
        ],
        [
            "1st districtFounded1838Barangays61"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorErlon C. Agustin • Vice MayorNoel B. Dela Cruz • RepresentativeJaime D. Cojuangco • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Gladys T. Agustin-ResurrectionBenicio B. Delos Reyes IIMahalia M. MateoJesus A. CorpuzKristine Anne S. LegaspiRaul G. MangrobangJherwin D. CorpuzErnesto C. Toralba"
        ],
        [
            " • Electorate53,623 voters (2022)Area • Revenue₱ 274.9 million (2020) • Assets₱ 1,063 million (2020) • Expenditure₱ 234.2 million (2020) • Liabilities₱ 174.7 million (2020)Service provider • ElectricityTarlac 1 Electric Cooperative (TARELCO 1)Time zoneUTC+8 (PST)ZIP code2306PSGC036903000IDD : area code +63 (0)45Native languagesPangasinan Ilocano Tagalog KapampanganWebsitewww.camiling-lgu.gov.ph"
        ],
        [
            "Camiling, officially the Municipality of Camiling, (Pangasinan: Baley na Camiling; Ilocano: Ili ti Camiling; Tagalog: Bayan ng Camiling) is a  1st class municipality in the province of Tarlac in the Philippines.",
            "According to the 2020 census, it has a population of 87,319 people."
        ],
        [
            "Camiling is one of the fastest-growing towns of Tarlac when it comes to income and economy.",
            "It is also considered one of the richest when it comes to cultural heritage in the entire province.",
            "The town is also dubbed to be the \"Old Lady in the Northwestern province of Tarlac\", because it is one of the oldest municipalities created by the Spanish government under the province of Pangasinan where it previously included the former barrio of Mayantoc, San Clemente, and Santa Ignacia.",
            "The municipality also features cultural antiquity such as its churches, ancestral houses, and ruins.",
            "However, the baroque church of Camiling has yet to be restored after 20 years since a fire burned its interior.",
            "The inside of the church, one of the only two Spanish churches left in Tarlac, has become a cesspool for human waste, while the facade (front) and buttresses (side supports) have been occupied by business establishments.",
            "One buttress has been converted by a business store into a toilet.",
            "Heritage advocates and Camiling locals have been campaigning for the restoration of the church after the reports came out in March 2018."
        ],
        [
            "Camiling is the major municipality in north-western Tarlac.",
            "It is the commercial center of an area composed of about eight towns, and borders the province of Pangasinan.",
            "It is the gateway to central and western Pangasinan through the Romulo Highway (formerly Highway 13).",
            "It is also known for its famous \"chicharon Camiling\" and its green native rice cake called nilubyan."
        ],
        [
            "History"
        ],
        [
            "One of the original images of St Michael in the front of the ruined church in Camiling"
        ],
        [
            "Camiling began its history as a settlement located near the Camiling River."
        ],
        [
            "During the classical era, the area used to be lush in tropical rainforest and was used mainly by the local Pangasinense people.",
            "When the polity of Caboloan was established in 1406, the area was incorporated as part of the kingdom."
        ],
        [
            "In 1575, the Chinese pirate Limahong attacked the polity and declared himself as ruler of the Caboloan realms.",
            "The kingdom was eventually abolished in 1576, when the Spanish attacked and ransacked the kingdom's capital of Binalatongan (present-day San Carlos, Pangasinan).",
            "It was later on incorporated into the Spanish Empire."
        ],
        [
            "Early in the 18th century, the community was a sitio of Paniqui; before and after, Paniqui was also part of Bayambang.",
            "The town's name is derived from \"camiring\" or \"camiling\", the Pangasinan name for the Semecarpus cuneiformis tree, which at that time grew abundantly in the wilderness."
        ],
        [
            "The community was originally a vast area of Cogon growth interposed with thick forestalls areas stretching into the Zambales mountain ranges.",
            "A wide river cut through it.",
            "The early inhabitants of the place were the Aetas who make a living by gathering fruit from fruit trees, hunting, and fishing.",
            "With the coming first of the Pangasinenses and later the Ilocanos from the north, the Aetas who used to roam freely in the wilderness obliged themselves to move into the interior."
        ],
        [
            "The new settlers first occupied the swampy land, now known as \"Cacamilingan\" on the right side of the river.",
            "In time, these settlers began moving to the left opposite shore because of more frequent disastrous floods.",
            "To this new location, the residents therein built a small church with Saint Michael as the patron saint."
        ],
        [
            "Camiling became a District Commission from 1834 to 1837 founded by Don Francisco Soriano, the then Cabeza de Barangay who became the town's first District Commissioner.",
            "In 1838, Camiling became an independent town, formally separated from the mother town of Paniqui and with Don Vicente Galsim, as the first Gobernadorcillo.",
            "Thirty-eight others followed him.",
            "Don Jose Sabado, the last to serve under the Spanish regime and the first Presidente Municipal under the Revolutionary Government by Aguinaldo."
        ],
        [
            "Camiling was a first-class municipality during the 1970s but was reclassified when the Local Government Code went into effect in the early 1990s.",
            "It became again a first-class municipality again on November 20, 2001, by virtue of the Latest Income Class Classification (L.I.C.C.)",
            "initiated by the Department of Finance; the Local Government Unit of Camiling was reclassified from a second class municipality to a first-class municipality, having attained an annual income of 50,942,508.51 pesos.",
            "In 2008, Camiling's income was more than 72,463,893,00 pesos with average growth of more than 5.164% per year (2001–2008)."
        ],
        [
            "Cultural representations"
        ],
        [
            "The town of San Diego in Jose Rizal's 1887 novel, Noli Me Tángere, is the municipality of Camiling in real life.",
            "The old Saint Michael the Archangel Parish Church of Camiling and Leonor Rivera were all real-life inspiration to the novel."
        ],
        [
            "Geography"
        ],
        [
            "Camiling is 160 kilometres (99 mi) north-north-west of Manila, and 36 kilometres (22 mi) from provincial capital Tarlac City.",
            "It borders San Clemente on the west, Bayambang from the north, Santa Ignacia and Mayantoc to the south and Paniqui and Moncada by the east."
        ],
        [
            "Mostly of plain topography but some parts are hilly to mountainous in which the barangays of Papaac, Bacsay, Birbira and Cayasan, to name a few.",
            "The deeper part of the mountains can be described as a place where wild animals live, such as deer, Toddy cat (Musang), wild boar (Baboy ramo), Monitor lizard (Bayawak)."
        ],
        [
            "Barangays"
        ],
        [
            "Camiling is politically subdivided into 61 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "It has the most barangays in all of the municipalities of Tarlac while the city of Tarlac has 76 barangays."
        ],
        [
            "Anoling 1st"
        ],
        [
            "Anoling 2nd"
        ],
        [
            "Anoling 3rd"
        ],
        [
            "Bacabac"
        ],
        [
            "Bacsay"
        ],
        [
            "Bancay 1st"
        ],
        [
            "Bilad"
        ],
        [
            "Birbira"
        ],
        [
            "Bobon 1st Casarratan"
        ],
        [
            "Bobon 2nd"
        ],
        [
            "Bobon Caarosipan"
        ],
        [
            "Cabanabaan"
        ],
        [
            "Cacamilingan Norte (with Kipping village)"
        ],
        [
            "Cacamilingan Sur"
        ],
        [
            "Caniag"
        ],
        [
            "Carael"
        ],
        [
            "Cayaoan"
        ],
        [
            "Cayasan"
        ],
        [
            "Florida"
        ],
        [
            "Lasong"
        ],
        [
            "Libueg (with sitio Pugo)"
        ],
        [
            "Malacampa (With sitio Cacelestinuan and Sitio Camartinisan)"
        ],
        [
            "Manaquem"
        ],
        [
            "Manupeg"
        ],
        [
            "Marawi"
        ],
        [
            "Matubog"
        ],
        [
            "Nagrambacan"
        ],
        [
            "Nagserialan"
        ],
        [
            "Palimbo Proper"
        ],
        [
            "Palimbo Caarosipan"
        ],
        [
            "Pao 1st"
        ],
        [
            "Pao 2nd"
        ],
        [
            "Pao 3rd"
        ],
        [
            "Papaac"
        ],
        [
            "Pindangan 1st"
        ],
        [
            "Pindangan 2nd"
        ],
        [
            "Poblacion A"
        ],
        [
            "Poblacion B"
        ],
        [
            "Poblacion C"
        ],
        [
            "Poblacion D"
        ],
        [
            "Poblacion E"
        ],
        [
            "Poblacion F"
        ],
        [
            "Poblacion G"
        ],
        [
            "Poblacion H"
        ],
        [
            "Poblacion I"
        ],
        [
            "Poblacion J"
        ],
        [
            "San Isidro (Bancay 2nd)"
        ],
        [
            "Santa Maria"
        ],
        [
            "Sawat"
        ],
        [
            "Sinilian 1st (with Sitio Cabalaongan and Nangalisan)"
        ],
        [
            "Sinilian 2nd (with Sitio Barikir)"
        ],
        [
            "Sinilian 3rd (Northern, Bitawa, Centro)"
        ],
        [
            "Sinilian Cacalibosuan"
        ],
        [
            "Sinulatan 1st"
        ],
        [
            "Sinulatan 2nd"
        ],
        [
            "Surgui 1st"
        ],
        [
            "Surgui 2nd"
        ],
        [
            "Surgui 3rd"
        ],
        [
            "Tambugan"
        ],
        [
            "Telbang"
        ],
        [
            "Tuec"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Camiling, Tarlac"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "35(95)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "3(0.1)"
        ],
        [
            "2(0.1)"
        ],
        [
            "5(0.2)"
        ],
        [
            "10(0.4)"
        ],
        [
            "80(3.1)"
        ],
        [
            "107(4.2)"
        ],
        [
            "138(5.4)"
        ],
        [
            "147(5.8)"
        ],
        [
            "119(4.7)"
        ],
        [
            "70(2.8)"
        ],
        [
            "26(1.0)"
        ],
        [
            "8(0.3)"
        ],
        [
            "715(28.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "2.0"
        ],
        [
            "1.7"
        ],
        [
            "2.7"
        ],
        [
            "4.6"
        ],
        [
            "16.1"
        ],
        [
            "20.8"
        ],
        [
            "24.0"
        ],
        [
            "23.0"
        ],
        [
            "21.4"
        ],
        [
            "15.5"
        ],
        [
            "8.0"
        ],
        [
            "3.2"
        ],
        [
            "143"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CamilingYearPop.±% p.a.1903 25,243—    1918 23,375−0.51%1939 25,824+0.48%1948 33,935+3.08%1960 40,536+1.49%1970 49,156+1.94%1975 52,411+1.29%1980 53,860+0.55%1990 62,773+1.54%1995 65,340+0.75%2000 71,598+1.98%2007 79,941+1.53%2010 80,241+0.14%2015 83,248+0.70%2020 87,319+0.94%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Camiling, Tarlac, was 87,319 people, with a density of 620 inhabitants per square kilometre or 1,600 inhabitants per square mile."
        ],
        [
            "Language"
        ],
        [
            "Many old town's districts are based on the Pangasinan language like Anoling, Cayaoan (Bamboo), Libueg, Lasong, Tuec (to nod), Pindangan, Telbang.",
            "Others are named after towns of Ilocos where the other settlers originally came from.",
            "Hence, Caviganan for Vigan, Ilocos Sur, Cacabugaoan (now Cayaoan) for Cabugao, Ilocos Sur, Cabatacan for Batac City, Ilocos Norte, Capaoayan for Paoay, Ilocos Norte, Casarratan for Sarrat, Ilocos Norte."
        ],
        [
            "Pangasinan and Ilocano are the main dialects of Camiling.",
            "Kapampangan and Tagalog are also widely understood and spoken."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Camiling"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  10.70"
        ],
        [
            "2009  15.83"
        ],
        [
            "2012  9.50"
        ],
        [
            "2015  14.56"
        ],
        [
            "2018  6.25"
        ],
        [
            "2021  10.35"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Industries and produce"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(August 2023)"
        ],
        [
            "Aside from rice cakes and chicharon, the municipality is also known for its freshwater fish produce, like tilapia; dalag (or mudfish, Channa striata); catfish, including the native hito, Clarias macrocephalus; and bangús, the milkfish."
        ],
        [
            "Tourism"
        ],
        [
            "This section is written like a travel guide.",
            "Please help improve the section by introducing an encyclopedic style or move the content to Wikivoyage.",
            "(March 2021)"
        ],
        [
            "Attractions"
        ],
        [
            "The Old St Michael the Archangel Parish Church which was gutted by fire in 1997"
        ],
        [
            "The Old St Michael the Archangel Parish Church: A historical building built around the 18th century.",
            "It was also the oldest religious structure built in the province of Tarlac.",
            "The antique edifice also features the ruins of a Spanish style school which is created for sanctification like the St Michael Parish Church Garden and the St Michael Meditation Sanctuary.",
            "This church is also the largest in the entire province.",
            "Michael the Archangel, the patron saint of Camiling is said to have performed miracles in the Phillipnes.",
            "During the War, He was said to have saved the lives of many Filipinos who suffered at the hands of the Japanese.",
            "The old church was declared by the National Historic Commission as a historic site until it was gutted by a fire in 1997.",
            "The baroque church has yet to be restored after 20 years since a fire burned its interior.",
            "The facade (front) and buttresses (side supports) have been occupied by business establishments.",
            "One buttress has been converted by a business store into a toilet.",
            "Heritage advocates and Camiling locals have been campaigning for the restoration of the church since March 2018."
        ],
        [
            "Maria Clara Iglesias Independiente: Built after the Philippine revolution by revolutionaries attempting to \"Filipinize\" the Church.",
            "This is the second church built by Gregorio Aglipay, the first one being in Paniqui."
        ],
        [
            "Maria Clara Museum: A part of the mansion where Leonor Rivera lived.",
            "Several priceless artifacts belonging to her, immortalized by Noli Me Tángere as María Clara and even her late admirer, the Philippine National Hero, José Rizal's old photos is being exhibited on glass."
        ],
        [
            "The New St Michael the Archangel Parish Church: St Michael the Archangel Parish Church of Camiling was built in 2009.",
            "With a total floor area of 2,200 square meters, the church features intricately designed stained glass windows depicting, aside from Jesus Christ and the Virgin Mary, the angels.",
            "It is adjacent to Camiling's Catholic school."
        ],
        [
            "The New St Michael the Archangel Parish Church"
        ],
        [
            "The Old Site of Camiling: Also known as the Old Intramuros of Tarlac.",
            "This place showcases the combined ruins of the old St Michael the Archangel Parish Church together with its school extension and convent which  burned down in 1997."
        ],
        [
            "The Old site of Camiling's Meditation Garden is best visited during recollection and visita Iglesia"
        ],
        [
            "Our Lady of Guadalupe Church: A parish church that features the Guadalupe title of Blessed Virgin Mary.",
            "It is located in Brgy.",
            "Malacampa"
        ],
        [
            "Maria Clara Town Plaza: The municipal plaza of Camiling which features different cultural heritages and interesting contribution of Camiling to Philippine history.",
            "It includes the Camiling Veterans Park, Maria Clara Auditorium, the \"camiring tree\" (from which the town of Camiling got its name), the tower clock, the Grotto of Our Lady of Lourdes, and the statue of General Paulino Santos."
        ],
        [
            "Mt.",
            "Damas is a crag which is one of the favorite destination of hikers and mountain climbers in the province.",
            "As part of the Zambales Mountain Range lies a cave which serve as a shelter and hideout of many people and soldiers (guerillas) of Camiling against the Japanese during the war."
        ],
        [
            "Ubod Falls is a 160-foot waterfall in Mt.",
            "Damas in Papaac.",
            "It is considered the highest falls in the entire province of Tarlac.",
            "It is located deep in the wilderness of barangay Papaac."
        ],
        [
            "Pias Falls has greater water power than Ubod Falls despite being much smaller."
        ],
        [
            "Festivals"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(November 2022) (Learn how and when to remove this message)"
        ],
        [
            "street dancers of the 2008 chicharon - iniruban festival"
        ],
        [
            "Camiling's \"one town, one product\" is the bagnet (also called chicharon by the Ilocano people of Ilocos Sur) and the sweet green native cakes called iniruban or dirimin of Pangasinan origin.",
            "The municipality is also known for other native rice cakes such as tupig, pinais, and patupat.",
            "Camiling hosts the \"Iniruban and Chicharon Festival\", held in the last week of October every year to showcase Camiling's products and cultural heritage.",
            "Established in 2000, the festival includes colorful and artistic presentations and a street dancing competition amongst the different schools in Camiling."
        ],
        [
            "Government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Elected officials"
        ],
        [
            "Municipal council (2022–2025):"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "Mayor"
        ],
        [
            "Erlon C. Agustin"
        ],
        [
            "Nationalist People's Coalition"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Noel B. Dela Cruz"
        ],
        [
            "Probinsya Muna Development Initiative"
        ],
        [
            "Sangguniang Bayan Members"
        ],
        [
            "Gladys T. Agustin"
        ],
        [
            "Kilusang Bagong Lipunan"
        ],
        [
            "Benicio B. Delos Reyes II"
        ],
        [
            "Nationalist People's Coalition"
        ],
        [
            "Mahalia M. Mateo"
        ],
        [
            "Nationalist People's Coalition"
        ],
        [
            "Jesus A. Corpuz"
        ],
        [
            "Nationalist People's Coalition"
        ],
        [
            "Kristine Anne S. Legaspi"
        ],
        [
            "Nationalist People's Coalition"
        ],
        [
            "Raul G. Mangrobang"
        ],
        [
            "Nationalist People's Coalition"
        ],
        [
            "Jherwin D. Corpuz"
        ],
        [
            "Nationalist People's Coalition"
        ],
        [
            "Ernesto C. Toralba"
        ],
        [
            "Nationalist People's Coalition"
        ],
        [
            "Ex-Officio Members"
        ],
        [
            "ABC President"
        ],
        [
            "Albert B. Jose (from Barangay Bilad)"
        ],
        [
            "SK President"
        ],
        [
            "Jude Theo G. Basilio (from Barangay Poblacion E)"
        ],
        [
            "Healthcare"
        ],
        [
            "Camiling has three hospitals and a health center at the Municipal Hall.",
            "The health center serves the poor by giving free medicines and other health service.",
            "There are numerous private clinics scattered throughout the town.",
            "Hospitals in Camiling are Señor Santo Niħo Tertiary Hospital at Poblacion, Camiling District Hospital at Malacampa, and Salvador General Hospital at Palimbo."
        ],
        [
            "Education"
        ],
        [
            "Colleges (private, vocational)"
        ],
        [
            "Tarlac Agricultural University: Founded in 1945, the second largest college in the province of Tarlac that offers bachelor's, master's, and doctorate degrees and curriculum based on agriculture and now offers industry-based courses.",
            "It is the largest college in Tarlac in land area.",
            "Main campus is located at Malacampa, Camiling.",
            "The college state is also known for its kamote wine and other vegetables and fruits use in food processing."
        ],
        [
            "the panoramic view of the tarlac agricultural university facade"
        ],
        [
            "Tarlac Agricultural University(Laboratory School): TAU-LS is an extension of the TAU-College for Secondary Education.",
            "Entrance exams are requirements for enrollment."
        ],
        [
            "BESTCAP Career College, Inc.: Founded in 1998.",
            "Active member of California Education Association, TAPSA, APSTaP and MTG Philippines.",
            "It is also accredited to use Dunn and Dunn Learning Styles and Assessment.",
            "It is located at Malacampa, Camiling."
        ],
        [
            "United school of Science and Technology (USST): It is newly established since 2009 as branch of United School of Science and Technology at the City of Tarlac and the first university in Tarlac Province.",
            "It is located at Cacamilingan Norte, Camiling."
        ],
        [
            "Saint Paul College of Technology: A branch of Christian college serving central Luzon, particularly in Camiling.",
            "It is famous for its great contribution in vocational courses particularly HRM or Hotel Resource Management.",
            "It is located at Quezon Avenue, Camiling."
        ],
        [
            "Camiling Colleges: Founded by Gilberto Romulo since 1945, the brother of the Former UN President Carlos P. Romulo.",
            "It has several professional courses such as Education, Information Technology, Computer Programming.",
            "It is also known for its vocational courses such as Office Management, Practical Electricity, Nursing Aide, Practical Electricity and Nursing.",
            "It is located at Gomez Street, Poblacion B, Camiling."
        ],
        [
            "Camiling Catholic School (formerly St. Michael Academy): Founded in 1964.",
            "A catholic school offering pre-primary, primary and secondary courses.",
            "It is located near Camiling Town Center, Camiling."
        ],
        [
            "Camiling Secondary Institute: One of the oldest schools in Camiling.",
            "It was founded by Casimiro Brillantes, the father of the award-winning writer and journalist Gregorio Brillantes, in the 1932.",
            "(defunct)"
        ],
        [
            "Asian Lexcon School: One of the newly established private school since 2006."
        ],
        [
            "Camiling School For Home Industries: A vocational school located at the rural Sinilian, Camiling."
        ],
        [
            "Malacampa National High School: A newly established located rural high school at Malacampa, Camiling."
        ],
        [
            "Camiling Adventist Multigrade School: A Seventh-day Adventist Church educational institution established for Primary education located at Camiling Poblacion."
        ],
        [
            "Saint Rose Academy: A newly established private institution offering Primary education located at Cacamilingan Sur, Camiling."
        ],
        [
            "Camiling United Methodist Church"
        ],
        [
            "Goodshepherd Shekinah School"
        ],
        [
            "Kasangga Security Dev't.",
            "& Training Inst.",
            "Corp"
        ],
        [
            "Public high schools"
        ],
        [
            "Bilad High School"
        ],
        [
            "Birbira High School"
        ],
        [
            "Camiling School of Home Industries"
        ],
        [
            "Malacampa National High School"
        ],
        [
            "Marawi High School"
        ],
        [
            "Public elementary schools"
        ],
        [
            "Camiling Central Elementary School"
        ],
        [
            "In Camiling Central:"
        ],
        [
            "Bacabac Elementary School"
        ],
        [
            "Camiling Central Elementary School"
        ],
        [
            "Camiling North Elementary School"
        ],
        [
            "Cayaoan Elementary School"
        ],
        [
            "Pindangan 2nd Elementary School"
        ],
        [
            "Pindangan 1st Elementary School"
        ],
        [
            "Sawat Elementary School"
        ],
        [
            "Surgui Elementary School"
        ],
        [
            "Tambugan Elementary School"
        ],
        [
            "Tuec Elementary School"
        ],
        [
            "In Camiling East:"
        ],
        [
            "Bancay I Elementary School"
        ],
        [
            "Bilad Elementary School"
        ],
        [
            "Bilad Elementary School (Annex)"
        ],
        [
            "Cabanabaan Primary School"
        ],
        [
            "Camiling East Elementary School"
        ],
        [
            "Caniag Elementary School"
        ],
        [
            "Carael Elementary School"
        ],
        [
            "Florida Elementary School"
        ],
        [
            "Lasong Elementary School"
        ],
        [
            "Malacampa Elementary School"
        ],
        [
            "Malacampa Elementary School (Annex)"
        ],
        [
            "Marawi Elementary School"
        ],
        [
            "Matubog Elementary School"
        ],
        [
            "San Isidro Elementary School"
        ],
        [
            "Sinilian I Elementary School"
        ],
        [
            "Sinilian II Elementary School"
        ],
        [
            "Sinilian III Elementary School"
        ],
        [
            "Santa Maria Elementary School"
        ],
        [
            "Telbang Primary School"
        ],
        [
            "In Camiling West:"
        ],
        [
            "Anoling Elementary School"
        ],
        [
            "Bacsay Elementary School"
        ],
        [
            "Birbira Elementary School"
        ],
        [
            "Bobon 1st-Palimbo Proper Elementary School"
        ],
        [
            "Bobon 2nd Elementary School"
        ],
        [
            "Camiling West Central Elementary School"
        ],
        [
            "Cayasan Elementary School"
        ],
        [
            "Libueg Elementary School"
        ],
        [
            "Manaquem Elementary School"
        ],
        [
            "Pao Elementary School"
        ],
        [
            "Papaac Elementary School"
        ],
        [
            "Sinulatan Elementary School"
        ],
        [
            "Notable people"
        ],
        [
            "Alberto Romulo - former Foreign Secretary, Senator and Executive Secretary."
        ],
        [
            "Alfonso G. Pablo Sr. - a retired ordained Filipino Wesleyan clergyman who was General Superintendent of the Wesleyan Church of the Philippines from 1989 to 2005, and was the chairman of the International Conference of The Wesleyan Church for four years from 2000."
        ],
        [
            "Carlos P. Romulo - former UN President and Foreign Affairs Secretary."
        ],
        [
            "César Bengzon - former Chief Justice of the Supreme Court of the Philippines and first Filipino Justice of the International Court of Justice."
        ],
        [
            "Gregorio C. Brillantes - A multi-awarded fiction-writer."
        ],
        [
            "Jing Abalos - A 60's Philippine actor."
        ],
        [
            "Leonor Rivera - José Rizal's second cousin and love interest well known as Maria Clara."
        ],
        [
            "Onofre Corpuz - former President of the University of the Philippines and Secretary of Education, Culture and Sports (now DepEd)."
        ],
        [
            "Paulino Santos - Founder of Penal Colonies and Chief of Staff of The Philippine Army.",
            "General Santos is named after him."
        ],
        [
            "Sister city"
        ],
        [
            "Juneau, Alaska, United States  Archived 2012-05-09 at the Wayback Machine"
        ],
        [
            "Gallery"
        ],
        [
            "The Old Site of Camiling or commonly known as the Intramuros of Tarlac"
        ],
        [
            "Our Lady of Guadalupe Church"
        ],
        [
            "Leonor Rivera Estate"
        ],
        [
            "Cathedral of St. Michael the Archangel, Doña Maria Clara Memorial Church, Camiling, Tarlac."
        ],
        [
            "Chicharon Camiling with freshly picked tomatoes surrounded by Tupig, and Pinais, native delicacies."
        ],
        [
            "The green rice they called Iniruban"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Camiling |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Camiling Church: Gutted, forgotten, 'reused' as public toilet\".",
            "Philippine Daily Inquirer.",
            "18 March 2018."
        ],
        [
            "^ Alcazaren, Paulo (2016-12-03).",
            "\"Captivating Camiling\".",
            "The Philippine Star.",
            "Archived from the original on 2018-11-01.",
            "Retrieved 2023-05-15."
        ],
        [
            "^ \"SEMECARPUS CUNEIFORMIS Blanco 'LIGAS'\" (PDF), BPI Philippines, Government of the Philippines, archived from the original (PDF) on 2011-07-20, retrieved 2009-02-04\"Ligas, Semecarpus cuneiformis: Philippine Medicinal Herbs\".",
            "StuartXchange.",
            "Pulang Lupa Foundation Inc.  & the Art Guild for Education and Communication Foundation Inc."
        ],
        [
            "^"
        ],
        [
            "\"Province: Tarlac\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Camiling: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 5 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Tarlac\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Camiling."
        ],
        [
            "Wikisource has the text of the 1911 Encyclopædia Britannica article \"Camiling\"."
        ],
        [
            "Camiling Profile at PhilAtlas.com"
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Camiling"
        ],
        [
            "Bayambang"
        ],
        [
            "Bautista, Pangasinan"
        ],
        [
            "San Clemente"
        ],
        [
            "Camiling"
        ],
        [
            "MoncadaPaniqui"
        ],
        [
            "Mayantoc"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "vte Province of TarlacTarlac City (capital and largest city)Municipalities"
        ],
        [
            "Anao"
        ],
        [
            "Bamban"
        ],
        [
            "Camiling"
        ],
        [
            "Capas"
        ],
        [
            "Concepcion"
        ],
        [
            "Gerona"
        ],
        [
            "La Paz"
        ],
        [
            "Mayantoc"
        ],
        [
            "Moncada"
        ],
        [
            "Paniqui"
        ],
        [
            "Pura"
        ],
        [
            "Ramos"
        ],
        [
            "San Clemente"
        ],
        [
            "San Jose"
        ],
        [
            "San Manuel"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Victoria"
        ],
        [
            "Component city"
        ],
        [
            "Tarlac City"
        ],
        [
            "BarangaysSee: List of barangays in Tarlac"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Camiling&oldid=1205059574\""
        ],
        [
            "Categories: Municipalities of TarlacPopulated places on the Agno RiverHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from May 2023Articles to be expanded from August 2023All articles to be expandedArticles using small message boxesWikipedia articles with style issues from March 2021All articles with style issuesArticles needing additional references from November 2022All articles needing additional referencesWebarchive template wayback linksCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}