{
    "name": "Candelaria",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Candelaria, Quezon"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°55′52″N 121°25′24″E﻿ / ﻿13.9311°N 121.4233°E﻿ / 13.9311; 121.4233"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Quezon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Candelaria, Quezon\" – news · newspapers · books · scholar · JSTOR (November 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesCandelariaMunicipalityMunicipality of Candelaria(from top, left to right): Welcome Arch, San Pedro Bautista Parish Church, Municipal Hall, Downtown Area, Devotional Candle Park"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "Industrial Town of Quezon"
        ],
        [
            "Desiccated Coconut Capital"
        ],
        [
            "Map of Quezon with Candelaria highlightedOpenStreetMapCandelariaLocation within the PhilippinesCoordinates: 13°55′52″N 121°25′24″E﻿ / ﻿13.9311°N 121.4233°E﻿ / 13.9311; 121.4233CountryPhilippinesRegionCalabarzonProvinceQuezonDistrict"
        ],
        [
            "2nd districtFoundedAugust 5, 1879Annexation to SariayaMay 17, 1902ReestablishedSeptember 20, 1907Barangays25"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorGeorge D. Suayan • Vice MayorMacario D. Boongaling • RepresentativeDavid C. Suarez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Aileen M. DellosaJulius D. ManieboLydelle M. DizonRodante A. PadilloDarren P. De GalaAnatalia R. AtienzaMaria Lourdes Bernadette D. LiwanagNumeriano S. Briones"
        ],
        [
            " • Electorate81,374 voters (2022)Area • Revenue₱ 364.9 million (2020) • Assets₱ 1,079 million (2020) • Expenditure₱ 268.8 million (2020) • Liabilities₱ 318.9 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code4323PSGC045608000IDD : area code +63 (0)42Native languagesTagalogWebsitewww.candelaria.gov.ph"
        ],
        [
            "Candelaria, officially the Municipality of Candelaria (Tagalog: Bayan ng Candelaria),  is a 1st class municipality in the province of Quezon, Philippines.",
            "According to the 2020 census, it has a population of 137,881 people."
        ],
        [
            "It is the third most populous settlement of Quezon after Lucena City and Sariaya.",
            "Among the municipalities in Quezon Province, Candelaria has the most desiccated coconut factories and oil refineries, such as Peter Paul Philippine Corporation, Primex Coco Products Inc., Pacific Royal Basic Foods, SuperStar Corporation, Tongsan Industrial Development Corporation, and others, which employ thousands of people."
        ],
        [
            "History"
        ],
        [
            "Foundation"
        ],
        [
            "Prior to 1885, the pioneering barangays of Candelaria in its western part, Taguan (Bukal), Kinatihan and Masin were parts of the Municipality of Tiaong, while Malabanban, Mangilag and Santa Catalina in the east, were under the jurisdiction of the town of Sariaya."
        ],
        [
            "Sr. Don Ciriaco Nadres, a local leader of Barangay Masinand his wife Sra.",
            "Doña Baltazara Bustamante, with the support of Don Simeon Nadres and wife Doña Everista Ona, Don Justo Argao, Don Elino de Gala, Don Apolinario Gonzales, Don Tomas Cabuñag, Don Ignacio de Ramos, Don Domingo de Alday, Don Tomas Regidor, Don Juan del Valle, Don Ambrocio Salazar, Don Buenaventura Cedeño and Don Hipolito Martinez, proposed the establishment of an independent government over these barangays.",
            "They became known as the founding families of the town."
        ],
        [
            "It was on December 26, 1878, that a permit was granted by the Governor-General of the Philippine Islands, Domingo Moriones y Murillo for the establishment of an independent government over these barangays.",
            "Its boundaries were fixed by means of a treaty signed by the notable leaders of Tiaong, Sariaya and the founding families of Candelaria."
        ],
        [
            "King Alfonso XII of Spain finally approved the establishment of Candelaria as an independent town on August 5, 1879."
        ],
        [
            "American Era and Japanese Occupation"
        ],
        [
            "In 1902, after the cessation of the general hostilities against the Americans, administration of Candelaria was merged with the neighboring town of Sariaya.",
            "During the American regime, the town progressed by leaps and bounds.",
            "Many houses and public edifices were constructed, and commerce and industries grew, until the Japanese invasion brought a further wave of destruction."
        ],
        [
            "Geography"
        ],
        [
            "Aerial view of Candelaria (2012)"
        ],
        [
            "Candelaria lies at the western part of the province, 108 kilometres (67 mi) from the nation's capital Manila, 22 kilometres (14 mi) from the provincial capital Lucena, and 61 kilometres (38 mi) from Batangas City.",
            "To its northern part lies the famous Mount Banahaw, to the east is Sariaya, to the south is San Juan, and to the west are Dolores and Tiaong.",
            "The neighboring cities are Lucena, Tayabas, San Pablo and Lipa City.",
            "It is traversed by the Pan Philippine Highway and the Philippine National Railways."
        ],
        [
            "Candelaria has an area of about 12,910 hectares (31,900 acres) and is an agricultural municipality, situated in the southern part of Mount Banahaw.",
            "The town proper is wedged by two rivers, namely, Masin and Quiapo rivers."
        ],
        [
            "Barangays"
        ],
        [
            "Taguan River (bridge)"
        ],
        [
            "Candelaria is politically subdivided into 25 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Barangay"
        ],
        [
            "Barangay Captain (2015)"
        ],
        [
            "Population (2020)"
        ],
        [
            "Buenavista East"
        ],
        [
            "Dionisio G. Aguila"
        ],
        [
            "2,783"
        ],
        [
            "Buenavista West"
        ],
        [
            "Cesar M. Limbo"
        ],
        [
            "3,768"
        ],
        [
            "Bukal Norte"
        ],
        [
            "William M. Navaliza"
        ],
        [
            "2,979"
        ],
        [
            "Bukal Sur"
        ],
        [
            "Gauden M. Cordero"
        ],
        [
            "8,483"
        ],
        [
            "Kinatihan I"
        ],
        [
            "Buenaventura M. Reyes"
        ],
        [
            "2,071"
        ],
        [
            "Kinatihan II"
        ],
        [
            "Manuel C. Hawak"
        ],
        [
            "1,923"
        ],
        [
            "Malabanban Norte"
        ],
        [
            "Fernando A. Alcantara"
        ],
        [
            "13,453"
        ],
        [
            "Malabanban Sur"
        ],
        [
            "Perfecto C. Alcantara"
        ],
        [
            "9,701"
        ],
        [
            "Mangilag Norte"
        ],
        [
            "Alfonso A. Semira"
        ],
        [
            "2,824"
        ],
        [
            "Mangilag Sur"
        ],
        [
            "Felimon R. Predilla Jr."
        ],
        [
            "8,451"
        ],
        [
            "Masalukot I"
        ],
        [
            "Ireneo C. Boongaling"
        ],
        [
            "6,836"
        ],
        [
            "Masalukot II"
        ],
        [
            "Arnel B. Magcawas"
        ],
        [
            "3,017"
        ],
        [
            "Masalukot III"
        ],
        [
            "Eladio C. Carandang"
        ],
        [
            "1,351"
        ],
        [
            "Masalukot IV"
        ],
        [
            "Reverend H. Manalo"
        ],
        [
            "787"
        ],
        [
            "Masalukot V"
        ],
        [
            "Maximo S. Magadia"
        ],
        [
            "749"
        ],
        [
            "Masin Norte"
        ],
        [
            "Nelson H. Punzalan"
        ],
        [
            "7,587"
        ],
        [
            "Masin Sur"
        ],
        [
            "Reynaldo L. Cantos"
        ],
        [
            "5,862"
        ],
        [
            "Mayabobo"
        ],
        [
            "Arnel B. Ilao"
        ],
        [
            "2,566"
        ],
        [
            "Pahinga Norte"
        ],
        [
            "Manuel S. Ebora"
        ],
        [
            "16,237"
        ],
        [
            "Pahinga Sur"
        ],
        [
            "Estelito A. Sulit"
        ],
        [
            "3,522"
        ],
        [
            "Poblacion"
        ],
        [
            "Antonio Marinelo F. Emralino"
        ],
        [
            "6,453"
        ],
        [
            "San Andres"
        ],
        [
            "Librado M. Panaligan"
        ],
        [
            "3,522"
        ],
        [
            "San Isidro"
        ],
        [
            "Cesar V. Abdon"
        ],
        [
            "5,339"
        ],
        [
            "Santa Catalina Norte"
        ],
        [
            "Peter S. Malaluan"
        ],
        [
            "7,394"
        ],
        [
            "Santa Catalina Sur"
        ],
        [
            "Maila S. Escamillas"
        ],
        [
            "7,922"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Candelaria, Quezon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "146.2(5.76)"
        ],
        [
            "118.9(4.68)"
        ],
        [
            "89.1(3.51)"
        ],
        [
            "75.6(2.98)"
        ],
        [
            "170.8(6.72)"
        ],
        [
            "188.7(7.43)"
        ],
        [
            "258.9(10.19)"
        ],
        [
            "193.3(7.61)"
        ],
        [
            "227.3(8.95)"
        ],
        [
            "373.7(14.71)"
        ],
        [
            "425.3(16.74)"
        ],
        [
            "483.6(19.04)"
        ],
        [
            "2,751.4(108.32)"
        ],
        [
            "Average rainy days"
        ],
        [
            "22"
        ],
        [
            "16"
        ],
        [
            "14"
        ],
        [
            "10"
        ],
        [
            "16"
        ],
        [
            "18"
        ],
        [
            "20"
        ],
        [
            "20"
        ],
        [
            "21"
        ],
        [
            "24"
        ],
        [
            "26"
        ],
        [
            "26"
        ],
        [
            "233"
        ],
        [
            "Source: World Weather Online (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "There are two pronounced seasons in Candelaria: Dry and hot season from March to May, Wet season from June to December.",
            "Typhoons struck the municipality every three to five years.",
            "The most remarkable are Supertyphoon Angela (Rosing) in 1995, Typhoon Xangsane (Milenyo) in 2006, and Typhoon Rammasun (Glenda) in 2014."
        ],
        [
            "Normal temperatures in Candelaria range from 20 °C (68 °F) to 32 °C (90 °F).",
            "The temperatures became cooler in January with a range of about 18 °C (64 °F), while in April, the hottest month, may rise of up to 36 °C (97 °F)."
        ],
        [
            "Topography"
        ],
        [
            "Candelaria is more elevated in the northern part since it lies at the southern slope of Banahaw and is predominantly agricultural.",
            "There are plantations of coconut and vegetables in its remote barangays.",
            "Most of the inhabitants are having poultry and livestock business and in the remaining part of the municipality are farmlands mostly of rice, corn, and other root crops."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CandelariaYearPop.±% p.a.1918 8,210—    1939 17,686+3.72%1948 21,116+1.99%1960 29,928+2.95%1970 44,031+3.93%1975 49,384+2.33%1980 54,629+2.04%1990 69,969+2.51%1995 80,733+2.72%2000 92,429+2.94%2007 105,997+1.91%2010 110,570+1.55%2015 117,434+1.15%2020 137,881+3.21%Source: Philippine Statistics Authority"
        ],
        [
            "Candelaria has a population of 117,434 as of the 2015 census.",
            "The increase in population became rapid in the 1990s, in 1995, it has a population of 80,733 inhabitants, while in 2000, the population grew to 92,429, with an increase of about 15 percent."
        ],
        [
            "In 2007, the official number of inhabitants in the municipality based on 2007 census is 105,997, or about 4,240 families or 21,243 households.",
            "Most Candelarians reside in Pahinga Norte and Malabanban Norte, the adjacent barangays of the town proper."
        ],
        [
            "As of 2007, almost 93 percent of the population are Roman Catholics, 3.5 percent are Protestants, about 3 percent are members of Iglesia ni Cristo, 0.05 percent are of Islam, 0.97 percent are of other denominations such as Church of Christ / Christian Churches, Pentecostalists, Baptists, Latter Day Saints, Seventh-day Adventist, Jehovah's Witnesses and others."
        ],
        [
            "Language"
        ],
        [
            "Tagalog is widely spoken by the populace.",
            "However, their accent resembles the Tagalog dialect spoken in Batangas owing to its location, and history.",
            "Most of Candelarians came from the neighboring province of Batangas."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Candelaria"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  10.00"
        ],
        [
            "2009  10.62"
        ],
        [
            "2012  12.76"
        ],
        [
            "2015  6.24"
        ],
        [
            "2018  6.23"
        ],
        [
            "2021  15.85"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Busy downtown, Hacienda Inn"
        ],
        [
            "Candelaria is one of the most progressive municipalities in Quezon Province.",
            "Rapid progress have been felt since the 1990s where most of the commercial establishments have been built such as retail merchandising, supermarkets, hardware, fastfood outlets or restaurants, shopping mall, and others.",
            "The Candelaria Public Market, though it is adjacent to Barangay Poblacion, is located on Barangay Pahinga Norte."
        ],
        [
            "In 2024, there is a total inventory of 812 registered establishments.",
            "Most are in retail trade, wholesale, and real estate leasing."
        ],
        [
            "In agriculture, coconut is the most dominant crop of the municipality covering 5,243.50 hectares or 30% of the town's land area."
        ],
        [
            "Our Mother of Perpetual Help Parish Church of Taguan"
        ],
        [
            "Culture"
        ],
        [
            "Candle Festival"
        ],
        [
            "The town fiesta is celebrated on February 5 to honor the patron saint San Pedro Bautista.",
            "Since 2017, Rev.",
            "Msgr.",
            "Melecio Verastigue, started a dance to honor San Pedro Bautista.",
            "It is called INDAK PUGAY.",
            "A dance to honor the martyrdom of the patron saint, San Pedro Bautista."
        ],
        [
            "Since 2005, Monsignor Carlos (Charles) Pedro A. Herrera, the parish priest, started his devotion to Nuestra Senora de Candelaria and honored her with a Candle Festival every February 2.",
            "The celebration was concluded with a procession through the streets of the town featuring the street dancing by the youth of the community in honor of the Blessed Virgin.",
            "A parade of floats representing each of the 25 barangays was, also, featured during the festivities."
        ],
        [
            "A project in honor of the Blessed Mother Mary that will renovate the patio of the San Pedro Bautista Parish Church had been developed on April 22, 2012.",
            "The renovated patio will convert the current parking lot into a multi-purpose open amphitheater for use of the people of Candelaria.",
            "It will provide a venue for children and toddlers playground, jogging/walking path, a rosary garden, a via Dolorosa, and a stage for performances complete with controlled theater lighting.",
            "The playground will be lit with lighting standards.",
            "The fundraising for the project will be accomplished through a 1000 Points of Light campaign where each point of light will be represented by a Candelarian or friends of Candelaria contributing Php5000 or more.",
            "Inauguration is scheduled for February 2, 2013, CANDLE FESTIVAL celebration.",
            "Ground breaking is targeted for August 4, 2012, ARAW NG CANDELARIA.",
            "The community project is expecting every Candelarians around the world to step up and bring their \"POINT OF LIGHT\".",
            "The SPBPC parish council for economic affairs is taking the lead with Dr. Al Cornejo at the helm."
        ],
        [
            "Government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Town hall"
        ],
        [
            "Elected officials"
        ],
        [
            "Municipal council (2022-2025):"
        ],
        [
            "Mayor: George D. Suayan (NPC)"
        ],
        [
            "Vice Mayor: Macario D. Boongaling (NPC)"
        ],
        [
            "Councilors:"
        ],
        [
            "Aileen M. Dellosa (NPC)"
        ],
        [
            "Julius D. Maniebo (NPC)"
        ],
        [
            "Lydelle M. Dizon (Aksyon Demokratiko)"
        ],
        [
            "Rodante A. Padillo (NPC)"
        ],
        [
            "Darren P. de Gala (NPC)"
        ],
        [
            "Anatalia R. Atienza (Aksyon Demokratiko)"
        ],
        [
            "Ma.",
            "Lourdes Bernadette G. Liwanag (NPC)"
        ],
        [
            "Numeriano S. Briones (NPC)"
        ],
        [
            "ABC President: Estelito A. Sulit"
        ],
        [
            "SK Federation President: Ann Ivy Nicole B. Cuadro"
        ],
        [
            "Former heads and mayors (1879–2022)"
        ],
        [
            "Don Simeon Nadres, 1879–1883"
        ],
        [
            "Don Clemente Nadres, 1883–1887"
        ],
        [
            "Don Tomas Cabunag, 1887–1891"
        ],
        [
            "Don Apolinario Gonzales, 1891–1895"
        ],
        [
            "Don Pedro de Gala, 1895–1898"
        ],
        [
            "Don Benigno Nadres, 1898–1900"
        ],
        [
            "Don Elino de Gala, 1900–1902"
        ],
        [
            "Don Herminigildo Nadres, 1908–1912, 1919–1921"
        ],
        [
            "Don Juan Javier, 1912–1916"
        ],
        [
            "Don Generoso de Gala, 1916–1918"
        ],
        [
            "Don Gregorio Remata, 1918–1919"
        ],
        [
            "Don Francisco Fernandez, 1921–1922"
        ],
        [
            "Don Mansueto Javier, 1922–1925"
        ],
        [
            "Don David Reyroso, 1925–1928"
        ],
        [
            "Don Emilio de Gala, 1928–1931"
        ],
        [
            "Dr. Generoso Nadres Sr., 1931–1934"
        ],
        [
            "Dr. Vicente Macasaet, 1934–1937"
        ],
        [
            "Pastor Javier, 1937–1941, 1943–1944, 1945–1946"
        ],
        [
            "Juan Ramos, 1941"
        ],
        [
            "Francisco Malabanan, 1941–1943"
        ],
        [
            "Cresenciano de Gala, 1944–1945"
        ],
        [
            "Felix Ona, 1946–1947, 1955–1959"
        ],
        [
            "Eligio Manalo, 1947–1955"
        ],
        [
            "Venancio Dia, 1959–1967"
        ],
        [
            "Cipriano Maliwanag, 1967–1978"
        ],
        [
            "Pedro Cedeno, 1978–1986"
        ],
        [
            "David Emralino, 1986–1998, 2001–2007"
        ],
        [
            "Isidro de Gala, 1998–2001"
        ],
        [
            "Ferdinand Maliwanag, 1998, 2007-2016"
        ],
        [
            "Macario Boongaling, 2016-2022"
        ],
        [
            "George Suayan, 2022–present"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Welcome arch"
        ],
        [
            "Road network"
        ],
        [
            "There are three major highways that pass throughout the municipality and the town proper.",
            "The South Luzon Expressway Toll Road 4 (TR4) stretching from Santo Tomas, Batangas to Lucena City will pass in the northern part of the municipality, planned to be finished in 2021.",
            "The new expressway will occupy portions of Barangays Bukal Norte, Masalukot II, Masalukot I, Mayabobo, and Mangilag Norte."
        ],
        [
            "The Pan-Philippine Highway (also known as Maharlika Highway or National Highway), passes through the municipality west–east from Barangay Bukal Sur to Barangay Mangilag Sur.",
            "It connects the municipality to its neighboring towns of Tiaong and Sariaya, and cities like San Pablo City in Laguna and Lucena City, the provincial capital."
        ],
        [
            "Rizal Street is the two-lane main road and segment of the Pan-Philippine Highway in Barangay Poblacion.",
            "It connects Barangay Masin Norte and Sur in the west and Malabanban Norte in the east.",
            "Some landmarks located here are the Municipal Hall, Catholic Church, and Plaza Narra."
        ],
        [
            "The Candelaria–San Juan Road (also known as Candelaria-Bolboc Road) is a 16 kilometres (9.9 mi) two-lane highway that starts at the Pan Philippine Highway junction in Barangay Malabanban Norte going straight south to the municipality of San Juan, Batangas.",
            "This is an alternative road for commuters from Metro Manila via Batangas."
        ],
        [
            "The Candelaria Bypass Road (also known as Candelaria Diversion Road) is a two-lane bypass road that serves as an alternative road for commuters from Metro Manila to Batangas and Bicol Region.",
            "Opened in 2012, this 7.8 kilometres (4.8 mi) road bypasses Poblacion."
        ],
        [
            "There are also major roads within the municipality."
        ],
        [
            "Cabunag Street also in Barangay Poblacion is the municipality's main business district.",
            "Most of business establishments such as hardware stores like Licup Builders the oldest hardware store in town, RTWs, pharmacies, footwear, general merchandise, and restaurants are located here.",
            "It also serves as a thoroughfare for local commuters going to nearby barangays such as Pahinga Norte and Masalukot I."
        ],
        [
            "Ramos Street-Masalukot Barangay Road is a road that starts at Maharlika Highway in Barangay Poblacion and ends at Barangay Masalukot III.",
            "This is also an access road to most of subdivisions located in Barangay Masalukot I such as School View Park Subdivision, Village of St. Jude (VSJ), Maria Cristina Village, St. Anthony Subdivision, Villa Macaria Country Homes, Clarisse Subdivision, Faustin Floraville, and others.",
            "There are also schools located along the road, such as Grabsum School Inc. and Dr. Panfilo Castro National High School Annex."
        ],
        [
            "Tibanglan Road is a dirt road that serves as a main access to Barangay Mayabobo from Maharlika Highway in Barangay Malabanban Norte, in front of Iglesia ni Cristo Church."
        ],
        [
            "Pahinga-Kinatihan Road is a barangay road that starts at Cabunag Street down south to Barangay Kinatihan II.",
            "It serves as an access road to Candelaria Bypass Road from the town proper.",
            "Some landmarks located along the road are Peter Paul Philippine Corporation, Pahinga Norte Elementary School, Cocoma, and Villa Katrina Subdivision.",
            "A junction located in Barangay Pahinga Norte right after the spillway across Quiapo River connects it towards Barangay Santa Catalina Norte."
        ],
        [
            "Mangilag-Concepcion Road is a barangay road that starts at Maharlika Highway in Mangilag Sur and an access road to Barangays Mayabobo and Concepcion Banahaw in Sariaya, Quezon.",
            "Some landmarks found here are Dr. Panfilo Castro National High School, Mangilag Norte Elementary School, and Mount Mayabobo."
        ],
        [
            "Public transport"
        ],
        [
            "Provincial buses to and from Metro Manila and Lucena City such as JAC Liner Inc., DLTBCo, JAM Liner, Dela Rosa Liner and Lucena Lines stop at the municipality's designated bus stops in Poblacion."
        ],
        [
            "SUPREME, a bus plying Batangas City-Lucena City route and vice versa also passes through Candelaria (Sambat)."
        ],
        [
            "There are also jeepney terminals located in the town proper.",
            "For passengers going to Lucena City, the terminal is located at the intersection of Rizal Avenue corner Gonzales Street.",
            "For passengers going to San Pablo City, the terminal is located at the intersection of Rizal Avenue corner Del Valle Street.",
            "For passengers going to San Juan, Batangas, the terminal is located in Gonzales Street."
        ],
        [
            "Tricycles are the most common mode of transportation in the municipality.",
            "There are many tricycle terminals in Barangay Poblacion, serving local commuters to the nearby barangays."
        ],
        [
            "Water transport"
        ],
        [
            "Candelaria has no coastline and is one of the inland municipalities of Quezon, together with Dolores, Lucban, Sampaloc, San Antonio, Tayabas, and Tiaong.",
            "The seaport nearest to the municipality is Dalahican Port in Lucena City for passengers going to Marinduque, Masbate, and other island provinces.",
            "Dalahican Port is about 30 kilometers (19 mi) from Candelaria.",
            "Among the international seaports in Luzon, Batangas Port in Batangas City is the nearest.",
            "It would take approximately two hours in a private vehicle to reach from Candelaria, passing through the municipalities of San Juan, Rosario, and Ibaan, Batangas."
        ],
        [
            "Air transport"
        ],
        [
            "Candelaria has no airport, runway or any facility to accommodate air operations.",
            "The nearest airbase in the municipality is the San Fernando Airbase in Lipa City with a distance of about 32 kilometers (20 mi) west of the municipality, while the nearest international airport is Ninoy Aquino International Airport in Metro Manila.",
            "It is formerly served by the Lucena Airport in Lucena that has been closed.",
            "For air travelers, you have to travel for more or less two hours to reach Metro Manila and a couple of minutes more for Ninoy Aquino International Airport in case of traffic obstructions."
        ],
        [
            "Communications"
        ],
        [
            "Candelaria is served by General Telephone System, Inc. (GTSi) and Digitel Telecommunications  (PLDT-Digitel) as the main telecommunication services providers.",
            "GTSi has started its operations in the municipality in 1981, making it the third municipality where it started its operation, the first two are Gumaca in 1977 and Atimonan in 1979."
        ],
        [
            "Internet shops are commonly found in the town proper."
        ],
        [
            "Healthcare"
        ],
        [
            "Candelaria has three hospitals: one public and two private."
        ],
        [
            "Candelaria Municipal Hospital (known as Nursery, built in 1984) - located in Barangay Masin Norte."
        ],
        [
            "Peter Paul Medical Center (formerly Peter Paul Hospital, built in 1948) - located in Regidor St., Barangay Poblacion."
        ],
        [
            "United Candelaria Doctors Hospital (built in 2009) - located in Maharlika Highway near Candelaria Bypass Road, Barangay Mangilag Sur."
        ],
        [
            "The Candelaria Municipal Hospital is built during the administration of then Mayor Pedro Cedeno in 1984.",
            "Peter Paul Medical Center is one of the pioneering hospitals of the municipality, established in 1948.",
            "United Candelaria Doctors Hospital is the newly built medical facility of Candelaria, opened in February 2009."
        ],
        [
            "Each barangay has its own health center for free health services.",
            "More lying-in clinics are located throughout the municipality."
        ],
        [
            "Education"
        ],
        [
            "Pre-school"
        ],
        [
            "Brentley Montessori School"
        ],
        [
            "Brisbane Integrated School"
        ],
        [
            "Primary"
        ],
        [
            "Candelaria Elementary School Main"
        ],
        [
            "Candelaria Elementary School Annexes 1 and 2"
        ],
        [
            "Manuel Luis Quezon Elementary School (Cheng Hua Chinese School)"
        ],
        [
            "GRABSUM School, Inc. (School View)"
        ],
        [
            "Manuel S. Enverga University Foundation Candelaria, Inc."
        ],
        [
            "Headstart Christian Learning Institute"
        ],
        [
            "Trinity Christian Academy"
        ],
        [
            "Buenavista East Elementary School"
        ],
        [
            "Buenavista West Elementary School"
        ],
        [
            "Bukal Norte Elementary School (Mayapyap Annex)"
        ],
        [
            "Bukal Norte Elementary School"
        ],
        [
            "Bukal Sur Elementary School"
        ],
        [
            "Kinatihan I Elementary School"
        ],
        [
            "Kinatihan II Elementary School"
        ],
        [
            "The Lady Mediatrix Institute Inc."
        ],
        [
            "Malabanban Norte Elementary School"
        ],
        [
            "Malabanban Sur Elementary School"
        ],
        [
            "Mangilag Norte Elementary School"
        ],
        [
            "Mangilag Sur Elementary School"
        ],
        [
            "Masalukot I Elementary School"
        ],
        [
            "Masalukot II Elementary School"
        ],
        [
            "Masalukot III Elementary School"
        ],
        [
            "Masalukot IV Elementary School"
        ],
        [
            "Masalukot V Elementary School"
        ],
        [
            "Masin Elementary School"
        ],
        [
            "Mayabobo Elementary School"
        ],
        [
            "Newton Science School Inc."
        ],
        [
            "Pahinga Norte Elementary School"
        ],
        [
            "Pahinga Sur Elementary School"
        ],
        [
            "San Andres Elementary School"
        ],
        [
            "San Isidro Elementary School"
        ],
        [
            "Santa Catalina Norte Elementary School"
        ],
        [
            "Santa Catalina Central School"
        ],
        [
            "SEACOMS (Village of St. Jude Subdivision)"
        ],
        [
            "Tayabas Western Academy"
        ],
        [
            "United Evangelical School of Candelaria, Quezon - (Formerly UCCP Pre-School)"
        ],
        [
            "Secondary"
        ],
        [
            "Manuel S. Enverga University Foundation Candelaria, Inc."
        ],
        [
            "Newton Science School Inc."
        ],
        [
            "GRABSUM School, Inc."
        ],
        [
            "The Lady Mediatrix Institute, Inc."
        ],
        [
            "Tayabas Western Academy"
        ],
        [
            "Santa Catalina National High School"
        ],
        [
            "Bukal Sur National High School"
        ],
        [
            "Dolores Macasaet National High School"
        ],
        [
            "Dr. Panfilo Castro National High School"
        ],
        [
            "Dr. Panfilo Castro National High School (Masalukot I Annex)"
        ],
        [
            "Tertiary"
        ],
        [
            "Tayabas Western Academy"
        ],
        [
            "Manuel S. Enverga University Foundation (Candelaria Campus)"
        ],
        [
            "Tayabas Western Academy"
        ],
        [
            "Compskill Learning Academy"
        ],
        [
            "Chrisville Institute of Technology"
        ],
        [
            "GRABSUM School, Inc."
        ],
        [
            "Notable personalities"
        ],
        [
            "Raimund Marasigan, rock musician of the band Eraserheads, Pedicab, Sandwich, Cambio, Project 1, Squid 9, and Gaijin"
        ],
        [
            "Ahtisa Manalo, Binibining Pilipinas International 2018 and Miss International 2018 1st Runner-Up"
        ],
        [
            "Cesar Bolaños, former Governor of Quezon and Member of Batasang Pambansa, 1984-1987"
        ],
        [
            "Edelissa Ramos, National Gawad Saka Awardee and Quezon Medalya ng Karangalan awardee"
        ],
        [
            "Rio Locsin, actress"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Candelaria |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Act No.",
            "402 (May 17, 1902), Full Title an Act Consolidating the Municipalities of Tiaon, Dolores, Candelaria, and Sariaya in the Province of Tayabas Into Two Municipalities, retrieved February 18, 2023"
        ],
        [
            "^ Act No.",
            "1721 (September 20, 1907), An Act Increasing the Number of Municipalities in the Province of Tayabas From Twenty-four to Twenty-six, by Organizing the Barrio of Candelaria, Now a Part of Sariaya, Into a New Municipality, and Separating From Baler the Former Municipality of Casiguran, Giving the Latter the Same Territory Which It Comprised Prior to the Passage of Act Numbered Fifteen Hundred and Fifty, retrieved February 18, 2023"
        ],
        [
            "^"
        ],
        [
            "\"Candelaria Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved May 23, 2013."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Quezon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b c Webmaster (February 28, 2017).",
            "\"Economic Sector - The Official Website of the Municipality of Candelaria, Quezon\".",
            "Retrieved June 20, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Candelaria, Quezon."
        ],
        [
            "Candelaria Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Quezon Province Business Directory and Travel Guide"
        ],
        [
            "Quezon Province Web Portal"
        ],
        [
            "Lucena City Community Website"
        ],
        [
            "Places adjacent to Candelaria, Quezon"
        ],
        [
            "Dolores"
        ],
        [
            "Mount Banahaw"
        ],
        [
            "Tiaong"
        ],
        [
            "Candelaria"
        ],
        [
            "Sariaya"
        ],
        [
            "San Juan, Batangas"
        ],
        [
            "vte Province of QuezonLucena (capital and largest city)Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Alabat"
        ],
        [
            "Atimonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Calauag"
        ],
        [
            "Candelaria"
        ],
        [
            "Catanauan"
        ],
        [
            "Dolores"
        ],
        [
            "General Luna"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Infanta"
        ],
        [
            "Jomalig"
        ],
        [
            "Lopez"
        ],
        [
            "Lucban"
        ],
        [
            "Macalelon"
        ],
        [
            "Mauban"
        ],
        [
            "Mulanay"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagbilao"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Narciso"
        ],
        [
            "Sariaya"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Tiaong"
        ],
        [
            "Unisan"
        ],
        [
            "Component city"
        ],
        [
            "Tayabas"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Lucena (Administratively independent from the province but grouped under Quezon by the Philippine Statistics Authority.",
            "However, qualified voters of this city are still allowed to participate in the election of provincial officials as part of Quezon’s 2nd Sangguniang Panlalawigan district.)"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Candelaria,_Quezon&oldid=1234266516\""
        ],
        [
            "Category: Municipalities of QuezonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from November 2013All articles needing additional referencesUse mdy dates from January 2023Use Philippine English from January 2023All Wikipedia articles written in Philippine EnglishInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}