{
    "name": "Candoni",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Candoni"
        ],
        [
            "16 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsPangasinanPortuguêsTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°49′N 122°36′E﻿ / ﻿9.82°N 122.6°E﻿ / 9.82; 122.6"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Negros Occidental, Philippines"
        ],
        [
            "Not to be confused with Candon."
        ],
        [
            "Municipality in Negros Island Region, PhilippinesCandoni"
        ],
        [
            "Tabla ValleyMunicipalityMunicipality of CandoniMountain view showing a rice field in a rural area in Candoni"
        ],
        [
            "FlagMap of Negros Occidental with Candoni highlightedOpenStreetMapCandoniLocation within the PhilippinesCoordinates: 9°49′N 122°36′E﻿ / ﻿9.82°N 122.6°E﻿ / 9.82; 122.6CountryPhilippinesRegionNegros Island RegionProvinceNegros OccidentalDistrict"
        ],
        [
            "6th districtFounded1958Barangays9"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRay R. Ruiz • Vice MayorCicero D. Borromeo • RepresentativeMercedes K. Alvarez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Edgy Z. JavellanaMa.",
            "Angelo G. BernardezErvin Junram T. MandaguitPerry L. TorreJohn Ernel M. BorrisDemben D. CatipunanBooth Ian E. SamillanoNoemi Grace D. Benitez"
        ],
        [
            " • Electorate16,307 voters (2022)Area • Revenue₱ 117.9 million (2020) • Assets₱ 332.5 million (2020) • Expenditure₱ 147.3 million (2020) • Liabilities₱ 32.81 million (2020)Service provider • ElectricityNegros Occidental Electric Cooperative (NOCECO)Time zoneUTC+8 (PST)ZIP code6110PSGC064506000IDD : area code +63 (0)34Native languagesHiligaynon Tagalog"
        ],
        [
            "Candoni, officially the Municipality of Candoni  (Hiligaynon: Banwa sang Candoni; Cebuano: Lungsod sa Candoni; Tagalog: Bayan ng Candoni), formerly known as Tabla Valley, is a 4th class municipality in the province of Negros Occidental, Philippines.",
            "According to the 2020 census, it has a population of 23,751 people, making it the least populated municipality in the province."
        ],
        [
            "Etymology"
        ],
        [
            "Candoni was derived from the native phrase Kan Dune, which translates to \"belonging to Dune\", a legendary beautiful maiden named Dionesia who committed suicide after being forced by her parents to marry a man she did not love."
        ],
        [
            "History"
        ],
        [
            "Formerly a barrio of the Municipality of Cauayan, Candoni started as the center of the Tabla Valley Settlement founded in 1935 by Santiago H. Diego, a prominent man from the Municipality of Isabela.",
            "He led a group of settlers with a pioneering spirit and prompted by the desire to have a piece of land they could call their own.",
            "Pooling their resources and organizing themselves into a cooperative they called Tablenos, the settlers started clearing the valley starting from where the town is now located.",
            "They toiled the forests enduring hardships, but many of them died of malaria."
        ],
        [
            "Their efforts were noticed by the Provincial Government who supported them, starting with Gov.",
            "Emilio Gaston to Gov.",
            "Valenciano Gatuslao, who along with then Speaker Gil Montilla, helped them appeal to President Manuel Roxas in Malacanang for tangible government aid, which came in the form of the road from Dancalan, Ilog to Candoni, following the trail blazed by the Tablenos."
        ],
        [
            "Candoni was finally declared a municipality on August 22, 1958, through Executive Order No.",
            "314 signed by President Carlos P. Garcia.",
            "It was inaugurated on August 12, 1961, with Benjamin R. Nava as its first acting mayor."
        ],
        [
            "Recent history of Candoni again showed its people's struggle, this time, against the turmoils brought about by the insurgency problem.",
            "Fed up with being caught in the crossfire of battles between rebels and government forces, the people of Sitio Cantomanyog in Barangay Haba of the town declared their area as a \"Zone of Peace\", the first in the country ever to be declared as such by the residents composed of some 40 families, and this policy is respected by both rebels and government troops."
        ],
        [
            "Geography"
        ],
        [
            "Candoni is located 130 kilometres (81 mi) south-south-west of the provincial capital, Bacolod.",
            "It is approximately four hour drive from Bacolod City aboard a public utility vehicle and about two hours and 45 minutes on a private car.",
            "From Bacolod City, buses are available at Bacolod South Terminal.",
            "From Kabankalan City, one can take the public utility jeepneys or buses going to this town.",
            "Candoni is the third town with highest elevation in Negros Occidental after Salvador Benedicto and San Carlos City."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Candoni, Negros Occidental"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "45(1.8)"
        ],
        [
            "37(1.5)"
        ],
        [
            "62(2.4)"
        ],
        [
            "93(3.7)"
        ],
        [
            "190(7.5)"
        ],
        [
            "259(10.2)"
        ],
        [
            "284(11.2)"
        ],
        [
            "236(9.3)"
        ],
        [
            "244(9.6)"
        ],
        [
            "247(9.7)"
        ],
        [
            "162(6.4)"
        ],
        [
            "86(3.4)"
        ],
        [
            "1,945(76.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.8"
        ],
        [
            "8.4"
        ],
        [
            "12.7"
        ],
        [
            "16.3"
        ],
        [
            "26.7"
        ],
        [
            "28.5"
        ],
        [
            "29.1"
        ],
        [
            "28.0"
        ],
        [
            "27.4"
        ],
        [
            "28.5"
        ],
        [
            "23.4"
        ],
        [
            "15.5"
        ],
        [
            "255.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Barangays"
        ],
        [
            "Candoni is politically subdivided into 9 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Barangay"
        ],
        [
            "Location"
        ],
        [
            "Classification"
        ],
        [
            "Population(May, 2010)"
        ],
        [
            "Population(August, 2015)"
        ],
        [
            "Agboy"
        ],
        [
            "Upland"
        ],
        [
            "Rural"
        ],
        [
            "1,749"
        ],
        [
            "1,902"
        ],
        [
            "Banga"
        ],
        [
            "Upland"
        ],
        [
            "Rural"
        ],
        [
            "1,961"
        ],
        [
            "1,853"
        ],
        [
            "Cabia-an"
        ],
        [
            "Upland"
        ],
        [
            "Rural"
        ],
        [
            "1,316"
        ],
        [
            "1,352"
        ],
        [
            "Caningay"
        ],
        [
            "Upland"
        ],
        [
            "Rural"
        ],
        [
            "3,026"
        ],
        [
            "3,066"
        ],
        [
            "Gatuslao"
        ],
        [
            "Upland"
        ],
        [
            "Rural"
        ],
        [
            "2,433"
        ],
        [
            "2,289"
        ],
        [
            "Haba"
        ],
        [
            "Upland"
        ],
        [
            "Rural"
        ],
        [
            "2,123"
        ],
        [
            "2,335"
        ],
        [
            "Payauan"
        ],
        [
            "Upland"
        ],
        [
            "Rural"
        ],
        [
            "2,346"
        ],
        [
            "2,326"
        ],
        [
            "Poblacion East"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "3,007"
        ],
        [
            "3,386"
        ],
        [
            "Poblacion West"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "3,375"
        ],
        [
            "3,280"
        ],
        [
            "As of 2015, Candoni has a total population of 21,789 and its registered voting population (as of 2015) is 12,449."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CandoniYearPop.±% p.a.1970 10,258—    1975 12,614+4.23%1980 10,831−3.00%1990 16,638+4.39%1995 17,004+0.41%2000 19,987+3.53%2007 21,748+1.17%2010 21,336−0.69%2015 21,789+0.40%2020 23,751+1.71%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Candoni"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  45.00"
        ],
        [
            "2009  41.88"
        ],
        [
            "2012  29.37"
        ],
        [
            "2015  25.49"
        ],
        [
            "2018  24.78"
        ],
        [
            "2021  30.34"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Candoni public market"
        ],
        [
            "Candoni is a fourth class municipality.",
            "It is a hinterland town and heavily dependent on agriculture, its main products are sugarcane, rice, corn and coffee.",
            "Candoni posted more than 200% rice sufficiency for 2017 and 2018."
        ],
        [
            "Financial"
        ],
        [
            "Year"
        ],
        [
            "National Rank^"
        ],
        [
            "Provincial Rank^^"
        ],
        [
            "Assets"
        ],
        [
            "Liabilities"
        ],
        [
            "Net Assets"
        ],
        [
            "Revenue"
        ],
        [
            "2017"
        ],
        [
            "427"
        ],
        [
            "9"
        ],
        [
            "286,665.00"
        ],
        [
            "60,476.00"
        ],
        [
            "226,188.00"
        ],
        [
            "98,036.00"
        ],
        [
            "2016"
        ],
        [
            "1009"
        ],
        [
            "16"
        ],
        [
            "138,747.00"
        ],
        [
            "56,695.00"
        ],
        [
            "82,052.00"
        ],
        [
            "90,144.00"
        ],
        [
            "2015"
        ],
        [
            "806"
        ],
        [
            "15"
        ],
        [
            "120,049.00"
        ],
        [
            "40,234.00"
        ],
        [
            "79,815.00"
        ],
        [
            "79,913.00"
        ],
        [
            "Source: Commission on Audit of the Philippines"
        ],
        [
            "^ Among 1,489 municipalities in 2015 - 2016 and 1,488 in 2017 based on Net Assets."
        ],
        [
            "^^ Among 19 municipalities based on Net Assets."
        ],
        [
            "Tourism"
        ],
        [
            "Candoni have the following tourism sites:"
        ],
        [
            "Sitio Cantomanyog Zone of Peace, Barangay Haba"
        ],
        [
            "Hinarap Falls, Barangay Agboy"
        ],
        [
            "Pineapple Farm, Barangay Gatuslao"
        ],
        [
            "Twin Cave, Barangay West"
        ],
        [
            "Kennington Hill Nature Park, Brgy West and Gatuslao"
        ],
        [
            "Mount Tahutay, Barangay Caningay"
        ],
        [
            "Shang Spring Resort, Barangay East"
        ],
        [
            "Tigmaya-Paco Road"
        ],
        [
            "Zone of Peace"
        ],
        [
            "On the Road to Candoni, Negros Occidental"
        ],
        [
            "The Sitio of Cantomanyog in Barangay Haba was the first Zone of Peace in the Philippines.",
            "Peace Zone culture is so influential that the people of Cantomanyog were able to produce cultural products therefrom like oral history of Cantomanyog, poetry and music to the extent that it inspired a cluster of communities to do same."
        ],
        [
            "The first skirmish between the NPA and the military happened in Southern Negros in September 1971.",
            "With the information that the NPA had a base in the towns of Candoni and Kabankalan, the military immediately sent troops in the said area to hunt down the rebels.",
            "The NPA's popularity in the hinterlands of Southern Negros, where government was seldom seen and felt, could be explained by its ability to dispense swift, revolutionary justice and maintain order in the community.",
            "On April 18, 1989, an undetermined number of NPA guerillas launched a surprise attack on the 7th IB, Alpha Company Detachment at Caningay, Candoni.",
            "The Caningay raid was one of the NPA's most daring attacks on a military outpost in Candoni."
        ],
        [
            "In 1989, on the island of Negros, because of the inhuman conditions in the evacuation centers, nearly 300 persons - most of them were children - died from malnutrition and measles as the result of the U.S.-organized bombing raid, \"Operation Thunderbolt\" in the municipalities of Candoni, Hino–baan, Ilog, Cauayan, Kabankalan and Sipalay popularly referred to as the CHICKS area.",
            "The people of Cantomanyog began to ask themselves, \"Why is this war happening here?\""
        ],
        [
            "In November 1989, the Area Core Group leaders of the Gagmay'ng Kristiyanong Katilingban of Cantomanyog (GKK) or the Basic Ecclesial Community of Cantomanyog (BEC) after their usual panimbahon (community prayer meeting) discussed the peace zone concept.",
            "On December 4, 1989, the Basic Christian Community of Cantomanyog gathered for a General assembly wherein a Resolution to Establish the Zone of Peace was read, passed and approved.",
            "Their simple declaration was delivered to both the Armed Forces of the Philippines and the New People's Army.",
            "The NPA and the AFP respected the Zone of Peace."
        ],
        [
            "On February 16, 1990, during a worship service and Eucharist, Natividad Epalan, a community leader holding her two-year-old child, read a statement declaring the village of Cantomanyog to be the first \"zone of peace\" in the Philippines."
        ],
        [
            "\"Our village is open to everyone whose intentions are good,\" she read.",
            "\"We wish to be free of the danger of weapons of war and death…Therefore, whoever enters this zone of peace should not bring any guns with them.\""
        ],
        [
            "On 25 May 1993, Senator Rodolfo G. Biazon sponsored a resolution passed by the Senate as Resolution No.",
            "435 urging the Executive Department for the declaration of Cantomanyog and the other six Peace Zones as Special Development Areas.",
            "President Ramos, consequently and in cognizance to the Comprehensive Peace Policy, recognized the legitimacy of the said Peace Zones and further declared them as Special Development Areas (SDAs).",
            "Each of the seven SDAs was allocated P5,000,000.00 for community development projects through the then National Program for Unification and Development Council now part of the Office of the Presidential Adviser on the Peace Process under the Office of the President."
        ],
        [
            "Sit-an Cave"
        ],
        [
            "Sit-an Cave is a natural marvel that extends about one hundred fifty meters from its entrance to its hindmost part which resembles a church-like cavern with cool natural pool with overflowing water ranging from knee-high to waistline depth that forms an underground stream running along the columns of stalactites that hung like a pendant from its roof."
        ],
        [
            "Festivals"
        ],
        [
            "The Dinagyaw sa Tablas Festival is the annual town fiesta happen every February 7–11 and it is also called Feast of Our Lady of Lourdes.",
            "The Dinagyaw sa Tablas Festival aims to project and manifest the spirit of cooperation exerted by the Tablenos when they trail blazed the wilderness of the Tabla Velley and established the Tabla Valley settlement that became the predecessor of Candoni."
        ],
        [
            "Dinagyaw came from the word dagyaw a Hiligaynon term which means a group of people helping each other to perform a specific task."
        ],
        [
            "Aside from the annual town fiesta, Candonians also enjoy from multiple Barangay and community fiestas whole year-round."
        ],
        [
            "Education"
        ],
        [
            "Candoni has only one school district, District of Candoni.",
            "There are 18 public elementary schools, 3 public secondary schools and 1 private secondary school.",
            "During the school year 2015–2016, there are 4,335 elementary pupils, 1,271 public high school students and more or less 500 private high school students."
        ],
        [
            "Elementary"
        ],
        [
            "School ID"
        ],
        [
            "School Name"
        ],
        [
            "Barangay"
        ],
        [
            "No.",
            "of Pupils (SY 2015–2016)"
        ],
        [
            "116940"
        ],
        [
            "Agboy ES"
        ],
        [
            "Agboy"
        ],
        [
            "170"
        ],
        [
            "116941"
        ],
        [
            "Bali ES"
        ],
        [
            "Agboy"
        ],
        [
            "88"
        ],
        [
            "116942"
        ],
        [
            "Banga ES"
        ],
        [
            "Banga"
        ],
        [
            "379"
        ],
        [
            "116943"
        ],
        [
            "Cabia-an ES"
        ],
        [
            "Cabia-an"
        ],
        [
            "139"
        ],
        [
            "116944"
        ],
        [
            "Calamunding ES"
        ],
        [
            "Gatuslao"
        ],
        [
            "78"
        ],
        [
            "116945"
        ],
        [
            "Candoni Central ES"
        ],
        [
            "Poblacion West"
        ],
        [
            "1,281"
        ],
        [
            "116947"
        ],
        [
            "Cantacson ES"
        ],
        [
            "Caningay"
        ],
        [
            "90"
        ],
        [
            "116948"
        ],
        [
            "Cantomanyog ES"
        ],
        [
            "Haba"
        ],
        [
            "105"
        ],
        [
            "180519"
        ],
        [
            "Cogon ES"
        ],
        [
            "Gatuslao"
        ],
        [
            "44"
        ],
        [
            "116946"
        ],
        [
            "Galicano Temporosa I Memorial ES"
        ],
        [
            "Caningay"
        ],
        [
            "521"
        ],
        [
            "116949"
        ],
        [
            "Gatuslao ES"
        ],
        [
            "Gatuslao"
        ],
        [
            "298"
        ],
        [
            "116950"
        ],
        [
            "Guinsiliban ES"
        ],
        [
            "Payauan"
        ],
        [
            "78"
        ],
        [
            "116951"
        ],
        [
            "Haba ES"
        ],
        [
            "Haba"
        ],
        [
            "299"
        ],
        [
            "180512"
        ],
        [
            "Nava ES"
        ],
        [
            "Agboy"
        ],
        [
            "60"
        ],
        [
            "116952"
        ],
        [
            "Panacmalan ES"
        ],
        [
            "Poblacion East"
        ],
        [
            "105"
        ],
        [
            "116953"
        ],
        [
            "Payauan ES"
        ],
        [
            "Payauan"
        ],
        [
            "472"
        ],
        [
            "116954"
        ],
        [
            "Salarongon ES"
        ],
        [
            "Haba"
        ],
        [
            "89"
        ],
        [
            "180514"
        ],
        [
            "Soso ES"
        ],
        [
            "Gatuslao"
        ],
        [
            "45"
        ],
        [
            "High school"
        ],
        [
            "School ID"
        ],
        [
            "School Name"
        ],
        [
            "Barangay"
        ],
        [
            "No.",
            "of Students (SY 2015–2016)"
        ],
        [
            "Type"
        ],
        [
            "302606"
        ],
        [
            "Caningay NHS"
        ],
        [
            "Caningay"
        ],
        [
            "402"
        ],
        [
            "Public"
        ],
        [
            "302607"
        ],
        [
            "Caningay NHS - Banga Ext."
        ],
        [
            "Banga"
        ],
        [
            "255"
        ],
        [
            "Public"
        ],
        [
            "302608"
        ],
        [
            "Quirico G. Manzano Memorial NHS"
        ],
        [
            "Poblacion West"
        ],
        [
            "614"
        ],
        [
            "Public"
        ],
        [
            "na"
        ],
        [
            "Our Lady of Lourdes HS"
        ],
        [
            "Poblacion East"
        ],
        [
            "no data"
        ],
        [
            "Private"
        ],
        [
            "There are also two (2) Annex High School Campuses, the Gatuslao Campus under Quirico G. Manzano Memorial NHS and the Payauan Campus under Caningay NHS."
        ],
        [
            "Tertiary"
        ],
        [
            "The Municipal Government of Candoni and Negros Occidental State College of Agriculture (NESCA), now Central Philippines State University (CPSU) entered into a Memorandum of Agreement to install a tertiary school campus.",
            "The Central Philippine State University, Candoni Campus currently offers four (4) 4-year course Programs such as Bachelor in Animal Science, Bachelor in Elementary Education, Bachelor in Secondary Education, Bachelor of Science in Agriculture."
        ],
        [
            "Notable personalities"
        ],
        [
            "Leopoldo Serantes – competed at the 1988 Seoul Olympics in the Light Flyweight (-48 kg) division winning the bronze medal"
        ],
        [
            "Romel Oliveros – a super flyweight national boxer"
        ],
        [
            "Elisheba Etabag Manzano – 2007 Gold Medal (Top 1) – Highest Achievement Award for Certified Internal Auditor exam."
        ],
        [
            "Mary Grace Baloyo – was a First lieutenant in the Philippine Air Force who posthumously received the Philippines' highest military award for courage - the Medal of Valor"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Candoni |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Municipality of Candoni, Profile of Municipality of Candoni.",
            "Published at the Province of Negros Occidental official website"
        ],
        [
            "^"
        ],
        [
            "\"Candoni: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 7 May 2020."
        ],
        [
            "^ \"Total Population by Province, City, Municipality and Barangay: as of May 1, 2010\" (PDF).",
            "2010 Census of Population and Housing.",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on 15 November 2012.",
            "Retrieved 5 March 2013."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Zones of Peace Archived 2013-06-24 at the Wayback Machine, Along the Way - Fr.",
            "Amado Picardal."
        ],
        [
            "^ \"The Official Website of Commission on Higher Education\".",
            "www.ched.gov.ph.",
            "Archived from the original on 2016-08-08."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Candoni."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Candoni"
        ],
        [
            "Cauayan"
        ],
        [
            "Sipalay"
        ],
        [
            "Candoni"
        ],
        [
            "Ilog"
        ],
        [
            "Hinoba-an"
        ],
        [
            "vte Province of Negros OccidentalBacolod (capital and largest city)Municipalities"
        ],
        [
            "Binalbagan"
        ],
        [
            "Calatrava"
        ],
        [
            "Candoni"
        ],
        [
            "Cauayan"
        ],
        [
            "Don Salvador Benedicto"
        ],
        [
            "Enrique B. Magalona"
        ],
        [
            "Hinigaran"
        ],
        [
            "Hinoba-an"
        ],
        [
            "Ilog"
        ],
        [
            "Isabela"
        ],
        [
            "La Castellana"
        ],
        [
            "Manapla"
        ],
        [
            "Moises Padilla"
        ],
        [
            "Murcia"
        ],
        [
            "Pontevedra"
        ],
        [
            "Pulupandan"
        ],
        [
            "San Enrique"
        ],
        [
            "Toboso"
        ],
        [
            "Valladolid"
        ],
        [
            "Component cities"
        ],
        [
            "Bago"
        ],
        [
            "Cadiz"
        ],
        [
            "Escalante"
        ],
        [
            "Himamaylan"
        ],
        [
            "Kabankalan"
        ],
        [
            "La Carlota"
        ],
        [
            "Sagay"
        ],
        [
            "San Carlos"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Talisay"
        ],
        [
            "Victorias"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Bacolod (Administratively independent from the province but grouped under Negros Occidental by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Candoni&oldid=1229042578\""
        ],
        [
            "Categories: Municipalities of Negros OccidentalPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}