{
    "name": "Cantilan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cantilan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°20′08″N 125°58′37″E﻿ / ﻿9.3356°N 125.9769°E﻿ / 9.3356; 125.9769"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Surigao del Sur, Philippines"
        ],
        [
            "Municipality in Caraga, PhilippinesCantilanMunicipalityMunicipality of CantilanCantilan Harbour"
        ],
        [
            "FlagMap of Surigao del Sur with Cantilan highlightedOpenStreetMapCantilanLocation within the PhilippinesCoordinates: 9°20′08″N 125°58′37″E﻿ / ﻿9.3356°N 125.9769°E﻿ / 9.3356; 125.9769CountryPhilippinesRegionCaragaProvinceSurigao del SurDistrict"
        ],
        [
            "1st districtFounded1782Barangays17"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 199.3 million (2020) • Assets₱ 721.5 million (2020) • Expenditure₱ 172.6 million (2020) • Liabilities₱ 131.5 million (2020)Service provider • ElectricitySurigao del Sur 2 Electric Cooperative (SURSECO 2)Time zoneUTC+8 (PST)ZIP code8317PSGC166805000IDD : area code +63 (0)86Native languagesSurigaonon Agusan Cebuano TagalogWebsitewww.cantilan.gov.ph"
        ],
        [
            "Cantilan, officially the Municipality of Cantilan (Surigaonon: Lungsod nan Cantilan; Tagalog: Bayan ng Cantilan), is a 2nd class municipality in the province of Surigao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 34,060 people."
        ],
        [
            "Cantilan is considered the \"Cradle of Towns\" in Surigao del Sur.",
            "It originally encompassed the whole area of Carcanmadcarlan or the present towns of Carrascal, Cantilan, Madrid, Carmen and Lanuza."
        ],
        [
            "History"
        ],
        [
            "Cantilan existed as a settlement for more than three centuries as early as 1622."
        ],
        [
            "According to legend, the word Cantilan originated from the big shell of a bivalve locally called, \"Tilang\".",
            "A couple with beautiful daughters lived close to the location of the big shell.",
            "When suitors came to visit the daughters and were asked their destination, they would answer, “Can Tilang” (meaning “to Tilang’s\").",
            "Eventually, \"Can Tilang\" became \"Cantilan\"."
        ],
        [
            "According to sources, it was created by virtue of the Spanish Royal Decree of 1768 known as Maura Law.",
            "Another source states however, that Fr.",
            "Valerio de San Agustin implemented it in 1782 at \"Daan Lungsod,\" the old town in the coastal area.",
            "It was populated with people from Bayuyo, Ilihan and Calagdan.",
            "They constructed a fortification, a \"Kuta\", (Fort) made of limestone later named as Baluarte de Señor San Miguel, located across the river in the modern Cantilan."
        ],
        [
            "Caraga is obviously named after the old, historic Caraga, an extensive landmass covering several provinces, in the northeastern seaboard of Mindanao whose existence outdated the arrival of the Spaniards in this country."
        ],
        [
            "The people of the old Calagan were originally from Ilihan (now Panikian),  Calagan (now Calagda-an), Parasao (now Palasao) and Bayuyo (now Union, Manga and San Antonio)."
        ],
        [
            "1521 – For the first time, Antonio Pigafetta, the chronicler of Magellan's epic voyage around the world, called this region Calagam or Calagan."
        ],
        [
            "Calagan was among the three choices for Ferdinand Magellan to dock for provisions and trade.",
            "\"Magellan was anxious to resume his voyage and inquired which were the best ports for provisions and trade, wishing to turn of his many articles of barter into gold and spices.",
            "He was told that there were three – Ceylon (Leyte), Zzubu (Cebu) and Calagan, but that Zzubu was the largest and had the most traffic.\""
        ],
        [
            "March 31, 1521 – The celebrated \"Primera Misa\", an Easter Sunday Mass, was held in the Philippine Territory on the order of Ferdinand Magellan.",
            "Two of its prominent attendees were the Butuan brother kings: Rajah Kolambu of Butuan and Rajah Siagu of Calagan."
        ],
        [
            "January 25, 1571  –  Garcia Sierras Chacon was appointed to rule the district of Surigao and Parasao (Cantilan), an encomienda."
        ],
        [
            "1574  – Andres Mirandaola wrote to King Felipe II of Spain that \"much gold is found in the island of Mindanao, in the district of Butuan, Curigao (Surigao) and Parasao (Palasao).",
            "Much gold is mined there.\""
        ],
        [
            "1609  –  The conquistadores arrived in Tandag and constructed a stone fort (a military garrison) to strengthen their conquest of the locals.",
            "This caused"
        ],
        [
            "the Northeastern portion of Mindanao to be raised to the status of a province.",
            "This \"distrito\" was called \"Provincia de Caraga\" with Tandag as the capital."
        ],
        [
            "1622  – The systematic evangelization of Caraga Province began with the arrival of eight Recoletos from Manila.",
            "They arrived in Tandag and branched out to outstations in the districts, namely: Butuan, Surigao, Dinagat, Gigaquit, Numancia, Calagdan (Cantilan), Iranza and Bislig.",
            "They were headed by their Superior Fray Miguel de Santa Maria, OAR."
        ],
        [
            "1622  – According to Erectio Conventum In Insuli Philippinis, the pueblos of Calagdan and Parasao (Palasao) were listed having 700 to 800 Christian families."
        ],
        [
            "1626  –  The Recollect chapter of 1626 appointed Fray Juan de Nicolas as priory of Tandag.",
            "Calagdan was among the priories that year.",
            "On the same year, 6 more priories was established: Bacuag, Tandag, Gigaquit, Butuan, Calagdan, and Dinagat."
        ],
        [
            "1629  – Calagdan disappeared from the list of residential stations."
        ],
        [
            "1700  – Two Spanish soldiers from the fort of Tandag was assigned at Parasao and Calagdan, namely Antonio Garcia and Cristobal Moreno, respectively."
        ],
        [
            "1740  – A map made by Italian mapmaker Giambattista Albrizzi in Venice, Italy mentioned the northern part of Mindanao as \"Manobos\".",
            "Described as a place near the ocean and a river mouth."
        ],
        [
            "1750  – A census copy now on display in a museum in London mentioned the two pueblos of Calagdan (Calagda-an) and Bayuyo (now the present-day Union)."
        ],
        [
            "1752  – Bayuyo, I. St.Jean (an island near Bayuyo ), I.",
            "De General and Bucas are mentioned in a map made by French cartographer Jacques Nicolas Bellin."
        ],
        [
            "1752  –  Moro raiders attacked and burned the two barrios of Bayuyo and Calagdan."
        ],
        [
            "1761  –  A concentrated resettlement of Calagdan, Palasao and Bayuyo in one place had been realized.",
            "The place is located across the river later named as Cantilang."
        ],
        [
            "1767  –  Padre Fray Valero de San Agustin, visited Calagdaan (Cantilang) and established a northern outstation outside Tandag."
        ],
        [
            "1767  –  The Moro pirates attacked Tandag Fort in 1758, 1761, 1767.",
            "But of all these attacks, the worst casualties suffered by the Moros was in 1767 when Fray Valero de San Agustin brought a reinforcement of 200 Calagdaan (Cantilan) fighters led by valiant warriors Francisco Arreza and Santiago Arizobal.",
            "They rode on seven sailboats to Tandag.",
            "After the fierce battle, many Moros were killed and several of their boats were sunk on Tandag river and sea."
        ],
        [
            "1782: Cantilan became a regular parish under Fray Valero de San Agustin, a recollect."
        ],
        [
            "1856: On October 14, a hurricane from the north which turned over east and south increased to an intensity that storm surges changed the whole town into a sea.",
            "Everything was swept away.",
            "On October 15, Cantilan became a wasteland.",
            "The survivors together with the parish priest Fray Modesto Marzo y Casabana then crossed the river and started to build the new Cantilan."
        ],
        [
            "1898: Cantilan total population had reached 10,026."
        ],
        [
            "1918: On December 10, Executive Order No.",
            "52 of American Governor-General Francis Burton Harrison was issued that divided Cantilan into three parts."
        ],
        [
            "World War II – For much of the war Cantilan was a place of refuge for those escaping the Japanese occupation of coastal areas of Mindanao.",
            "The convent there was filled with refugees, including nuns fleeing other areas.",
            "Even a few American civilians who had been living in the Philippines before the war took refuge in Cantilan."
        ],
        [
            "1960: Cantilan became part of the new province of Surigao del Sur."
        ],
        [
            "Cantilan has existed as a settlement for more than three centuries on the two barrios of Bayoyo and Kalagda-an which was then included in the Spanish administration of Tandag as early as 1709.",
            "The settlement of Ilihan was also part of the Cantilan area that time."
        ],
        [
            "Prior to the Spanish regime, inhabitants of Cantilan were Bagani Bankayan Sandigan people, who descended from Malay immigrants.",
            "At times the early settlers were forced to join and fight marauding bands who came for slaves and plundered.",
            "In the process, they built stone walls and a watchtower as can be shown on some ruins of these structures which still exist on the sea coast."
        ],
        [
            "The Spanish arrived and established a settlement at \"Daan Lungsod\" (Old Town) in the early 1700s and (Cantilan was separated from Tandag in 1791).",
            "The Spanish introduced Christianity and a governmental administration headed by a priest."
        ],
        [
            "Compulsory taxation was later featured from Spanish rule.",
            "Other legacies of the Spanish time were the Spanish name given to the local inhabitants and the Spanish words which were added to the local language.",
            "The Jesuit fathers constructed a church in Cantilan in the 1890s – part of the walls still stands near the new church constructed in 1959."
        ],
        [
            "During the Spanish time, local people were frequently attacked by Muslims and so a fort was built at Daan Lungsod which aided in repelling five attacks, ending once and for all these raids.",
            "Other problems were diseases (especially smallpox and other epidemics) were on the rise added with disasters like a typhoon."
        ],
        [
            "In 1856, Daan Lungsod was destroyed by a disastrous typhoon on the night of October 14.",
            "Beginning at midnight and continuing through the entire next day.",
            "A typhoon and series of storm surges rolled over the town sweeping away all but one house and killing 30 people as well as destroying crops and livestock.",
            "The ruins of Daan Lungsod can still be seen on the other side of Cantilan River, but after the storm, it was decided to rebuild the town on its present site."
        ],
        [
            "Before the storm, residents often crossed the river to buy fish from a woman named Tilang.",
            "When asked where they were going, they replied, \"Adto Kan Tilang\"; and the place gradually became known as Kantilang (Cantilan to Spanish).",
            "After the storm, the new town was built in this area, across the river and was named Kantilang or Cantilan."
        ],
        [
            "Throughout the period, Cantilan remained primarily a fishing and agricultural settlement, as it is today.",
            "The area was larger at that time because it comprised the present municipalities of Cantilan, Carrascal, Madrid, Carmen and Lanuza (CarCanMadCarLan)"
        ],
        [
            "The first Americans set foot in Surigao in 1904 and were met some active resistance.",
            "But fighting died out after a relatively short time.",
            "The main American contribution to Filipino life was the restructuring of governmental administration and the public schools.",
            "(Some early teachers were Mr. Bonnie, Mr. & Mrs. Edward Taylor, and Mr. William Hotchkiss)."
        ],
        [
            "During World War II, Cantilangnons were very active as guerillas fighting against the Japanese, who established a garrison in Cantilan from June 1942 to 1944."
        ],
        [
            "The Japanese were headquartered in the present day Municipal Hall and formations were often held at the plaza.",
            "The people were afraid and forced to flee to the mountains or to the outlying island to avoid the Japanese.",
            "In some barrios, like Barangay General Island, the population increased on account of the mass evacuation.",
            "Peacetime at last came when the Japanese finally withdraw their troops from Cantilan because of the invasion of the Americans in Leyte."
        ],
        [
            "Years rolled along after full Independence was granted to the Philippines in 1946.",
            "Cantilan became part of the new province of Surigao del Sur in 1960.",
            "It had also taken and fixed its present boundaries at that time, with the creation of Madrid as a new municipality."
        ],
        [
            "Cantilan remains primarily a rural, agricultural and fishing municipality, but its residents are well known for their high standing standard of education obtained by a large number of professionals who hail from Cantilan."
        ],
        [
            "In more recent times, the logging and timber industry has had an impact in Cantilan, both logging and veneer manufacturing plant operating in this town.",
            "It has also a potential for mining, although no large-scale operations have as yet been undertaken."
        ],
        [
            "Geography"
        ],
        [
            "Cantilan is the second northernmost municipality of CarCanMadCarLan and so also the second northernmost municipality of the province.",
            "The neighbouring municipalities are Carrascal in the north-west and Madrid in the south-east."
        ],
        [
            "Barangays"
        ],
        [
            "Cantilan is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Buntalid and Magasang were constituted as barrios in 1956."
        ],
        [
            "Bugsukan"
        ],
        [
            "Buntalid"
        ],
        [
            "Cabangahan"
        ],
        [
            "Cabas-an"
        ],
        [
            "Calagdaan"
        ],
        [
            "Consuelo"
        ],
        [
            "General Island"
        ],
        [
            "Lininti-an (Poblacion)"
        ],
        [
            "Lobo"
        ],
        [
            "Magasang"
        ],
        [
            "Magosilom (Poblacion)"
        ],
        [
            "Pag-Antayan"
        ],
        [
            "Palasao"
        ],
        [
            "Parang"
        ],
        [
            "San Pedro"
        ],
        [
            "Tapi"
        ],
        [
            "Tigabong"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cantilan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28.7(83.7)"
        ],
        [
            "29.0(84.2)"
        ],
        [
            "29.9(85.8)"
        ],
        [
            "31.0(87.8)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "31.9(89.4)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.2(88.2)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "29.2(84.6)"
        ],
        [
            "30.7(87.2)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "25.5(77.9)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "26.3(79.3)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "27.8(82.0)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "27.8(82.0)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "25.9(78.6)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.4(72.3)"
        ],
        [
            "22.3(72.1)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "23.1(73.6)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "23.1(73.6)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "23.2(73.7)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "906(35.7)"
        ],
        [
            "753(29.6)"
        ],
        [
            "593(23.3)"
        ],
        [
            "412(16.2)"
        ],
        [
            "243(9.6)"
        ],
        [
            "167(6.6)"
        ],
        [
            "145(5.7)"
        ],
        [
            "128(5.0)"
        ],
        [
            "145(5.7)"
        ],
        [
            "227(8.9)"
        ],
        [
            "513(20.2)"
        ],
        [
            "757(29.8)"
        ],
        [
            "4,989(196.3)"
        ],
        [
            "Source: Climate-Data.org"
        ],
        [
            "Cantilan has a tropical rainforest climate (Af) with heavy to very heavy rainfall year-round and with extremely heavy rainfall from December to February."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CantilanYearPop.±% p.a.1903 7,481—    1918 18,594+6.26%1939 18,408−0.05%1948 20,519+1.21%1960 11,793−4.51%1970 16,617+3.48%1975 18,192+1.83%1980 20,889+2.80%1990 24,868+1.76%1995 24,061−0.62%2000 26,553+2.14%2007 28,659+1.06%2010 30,231+1.96%2015 31,492+0.78%2020 34,060+1.55%Source: Philippine Statistics Authority"
        ],
        [
            "The inhabitants of Cantilan are called Cantilangnons.",
            "Its unique dialect is called Cantelangnon, a variant of the Surigaonon language."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cantilan"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  20.00"
        ],
        [
            "2009  25.71"
        ],
        [
            "2012  17.56"
        ],
        [
            "2015  28.64"
        ],
        [
            "2018  19.17"
        ],
        [
            "2021  25.44"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Coast Fishing in Cantilan"
        ],
        [
            "The main part is agriculture (rice, coconut palms), animal breeding (water buffalos, pigs and chickens/roosters) and coastal fishing."
        ],
        [
            "Tourism"
        ],
        [
            "Beach Resort at bay-bay"
        ],
        [
            "Points of interest:"
        ],
        [
            "Tinago Surf Break (Ayoke Island)"
        ],
        [
            "Baluarte Surfing Spot (Baybay II)"
        ],
        [
            "General Island wreck diving"
        ],
        [
            "Tilang Beach"
        ],
        [
            "Malinawa Cool Spring (Parang Cantilan)"
        ],
        [
            "Blue Lagoon"
        ],
        [
            "Sirong Festival"
        ],
        [
            "The Sirong Festival is a mardi-gras parade participated by different contingents from other towns.",
            "A cash price and a trophy awaits to the winner of the street dancing competition and the final showdown (2009 Sirong Festival Champion (SURIGAO CITY, SDN Contingent))."
        ],
        [
            "Transportation"
        ],
        [
            "Town proper"
        ],
        [
            "Pedicabs roam around the streets of Cantilan."
        ],
        [
            "By Land"
        ],
        [
            "Buses (\"Bachelor Express\"), Vans and Jeepneys ply from Cantilan to Tandag and Surigao City v.v.",
            "on the coast-road of Surigao-Tandag.",
            "Roads are semi-concrete."
        ],
        [
            "By Sea"
        ],
        [
            "Inter-island vessels like 2Go ply the Manila-Surigao City routes on regular schedules.",
            "Cokaliong also has schedules from Cebu-Surigao City routes on a daily basis.",
            "The harbour in the Cantilan river can be used by Pump boats only.",
            "On the east side of the Capungan peninsula that separates the Lanuza bay from Carrascal bay exists \"Consuelo Port\" which is a harbour for bigger ships."
        ],
        [
            "By Air"
        ],
        [
            "The closest airports are Surigao Airport (IATA: SUG, ICAO: RPMS) and Butuan Airport (IATA: BXU, ICAO: RPME).",
            "The Tandag Airfield (IATA: TDG, ICAO: RPMW) has limited flights from Manila and Cebu City which started on June 30, 2014."
        ],
        [
            "Education"
        ],
        [
            "Surigao del Sur State University"
        ],
        [
            "Cantilan has both public and private schools from elementary, secondary and tertiary."
        ],
        [
            "Hotchkiss Learning Center"
        ],
        [
            "Cantilan East Central Elementary School"
        ],
        [
            "Cantilan Pilot School"
        ],
        [
            "Cantilan National High School"
        ],
        [
            "Saint Michael's College"
        ],
        [
            "Cantilan Campus of the North Eastern Mindanao State University"
        ],
        [
            "Notable personalities"
        ],
        [
            "Prospero Arreza Pichay, Jr. (Butch Pichay) – Born on June 20, 1950, in Cantilan, Surigao del Sur.",
            "He is the son of Provincial Treasurer Prospero Pichay Sr.",
            "He became the Congressman of Surigao del Sur 1st district from 1998 until 2007."
        ],
        [
            "Lt. Gen. William Hotchkiss III – Born on January 8, 1943, in Cantilan, Surigao del Sur.",
            "He was a member of the famed Blue Diamonds, a combat ready pilot.",
            "On November 29, 1996, he became the 24th Commanding General of the Philippine Air Force.",
            "Further, in line with environmental protection, he is an ex-officio member of the Philippine Eagle Foundation.",
            "He is currently the CAAP (Civil Aviation Authority of the Philippines) Director General."
        ],
        [
            "Gen. Hernando Delfin Carmelo Arreza Iriberri, PMA Class \"Matikas\", 1983 –  became the Commanding General of the Philippine Army (56th) and the 46th Chief of Staff of the Armed Forces of the Philippines."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Cantilan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Historical timeline of Cantilan."
        ],
        [
            "^ Virginia Hansen Holmes, Guerrilla Daughter (Kent, Ohio: Kent State U.",
            "Press, 2009), pp.",
            "119."
        ],
        [
            "^ \"An Act Converting into Barrios Certain Sitios in the Province of Surigao, and Dividing the Barrio of Macalaya into Two Barrios, Municipality of Placer, in the Same Province\".",
            "LawPH.com.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ \"Climate: Cantilan\".",
            "Climate-Data.org.",
            "Retrieved October 26, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Caraga\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Caraga\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Surigao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"BGen.Hernando Iriberri\".",
            "Philippine Daily Inquirer.",
            "Appointed commander of the Army’s 503rd Brigade in Abra province.",
            "Retrieved January 31, 2013."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Cantilan."
        ],
        [
            "Cantilan Profile at PhilAtlas.com"
        ],
        [
            "Cantilan Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Statistische Informationen des NSCB"
        ],
        [
            "The Official Website of Municipality of Cantilan"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Cantilan"
        ],
        [
            "Carrascal"
        ],
        [
            "Santiago, Agusan del Norte"
        ],
        [
            "Cantilan"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Sibagat, Agusan del Sur"
        ],
        [
            "Madrid"
        ],
        [
            "vte Province of Surigao del SurTandag (capital)Municipalities"
        ],
        [
            "Barobo"
        ],
        [
            "Bayabas"
        ],
        [
            "Cagwait"
        ],
        [
            "Cantilan"
        ],
        [
            "Carmen"
        ],
        [
            "Carrascal"
        ],
        [
            "Cortes"
        ],
        [
            "Hinatuan"
        ],
        [
            "Lanuza"
        ],
        [
            "Lianga"
        ],
        [
            "Lingig"
        ],
        [
            "Madrid"
        ],
        [
            "Marihatag"
        ],
        [
            "San Agustin"
        ],
        [
            "San Miguel"
        ],
        [
            "Tagbina"
        ],
        [
            "Tago"
        ],
        [
            "Component cities"
        ],
        [
            "Bislig"
        ],
        [
            "Tandag"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cantilan&oldid=1169006675\""
        ],
        [
            "Category: Municipalities of Surigao del SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}