{
    "name": "Capas",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Capas"
        ],
        [
            "23 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°20′14″N 120°35′24″E﻿ / ﻿15.3372°N 120.59°E﻿ / 15.3372; 120.59"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Tarlac, Philippines"
        ],
        [
            "For Comité de l'Académie pour les Applications de la Science, abbreviated CAPAS, see Belgian Academy Council of Applied Sciences."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Capas\" – news · newspapers · books · scholar · JSTOR (November 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesCapasMunicipalityMunicipality of CapasCapas National Shrine"
        ],
        [
            "FlagSealMotto(s): \"Sa Gobyernong Tapat, Capas ang Aangat.",
            "\"Map of Tarlac with Capas highlightedOpenStreetMapCapasLocation within the PhilippinesCoordinates: 15°20′14″N 120°35′24″E﻿ / ﻿15.3372°N 120.59°E﻿ / 15.3372; 120.59CountryPhilippinesRegionCentral LuzonProvinceTarlacDistrict"
        ],
        [
            "3rd districtFoundedDecember 10, 1712Barangays20"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRoseller B. Rodriguez • Vice MayorAlexander C. Espinosa • RepresentativeNoel N. Rivera • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jeff Darlson D. TicsayFelipe L. OngEstela S. ManlupigJesus M. LopezAlejandro T. DuenasAriel G. BaticanEditha M. YumulNestor D. Sicat"
        ],
        [
            "Area • Revenue₱ 540.4 million (2020) • Assets₱ 934 million (2020) • Expenditure₱ 497.1 million (2020) • Liabilities₱ 342.2 million (2020)Service provider • ElectricityTarlac 2 Electric Cooperative (TARELCO 2)Time zoneUTC+8 (PST)ZIP code2315, 2023 (portions under Clark Freeport and Special Economic Zone)PSGC036904000IDD : area code +63 (0)45Native languagesKapampanganTagalogIlocanoWebsitewww.capastarlac.gov.ph"
        ],
        [
            "Capas, officially the Municipality of Capas (Kapampangan: Balen ning Capas;"
        ],
        [
            "Tagalog: Bayan ng Capas), is a 1st class municipality in the province of Tarlac, Philippines, and one of the richest towns in the province.",
            "The town also consists of numerous subdivisions and exclusive villages."
        ],
        [
            "Capas is being dubbed as the “Tourism Capital of Tarlac.\"",
            "Apart from being known as the final site of the infamous Bataan Death March, it is also known for Mount Pinatubo treks, where thousands of mountaineers and visitors go.",
            "The town has some industrial factories like the PilMiCo."
        ],
        [
            "History"
        ],
        [
            "See also: Camp O'Donnell"
        ],
        [
            "Originally a part of Zambales and Pampanga, its first settlers were the Kapampangan and the Aeta.",
            "It was founded in the year 1710 by the Augustinian Friars.",
            "During the American Colonial period, the Americans built the Camp O'Donell for military installation until when the Japanese used it as a concentration camp during the Bataan Death March as the last stop of the march."
        ],
        [
            "Capas as all other towns in Tarlac province was a part of vast wilderness inhabited by the Abelling tribes known as Aetas.",
            "The history of Capas dates back in the late 16th century when immigrants from Pampanga, Zambales, Pangasinan and the Ilocos region flock into the settlements.",
            "It is considered the oldest town in Tarlac.",
            "Capas became a pueblo (town) in 1710 beginning as a sleepy settlement at a place between Cutcut River in Sitio Pagbatuan and Gudya (present site) founded by Kapitan Mariano Capiendo.",
            "Capas' patron saint is San Nicolas de Tolentino.",
            "September 9–10 is the Capas Town Fiesta.",
            "Tarlac province was founded on May 28, 1874."
        ],
        [
            "In the course of time, the townspeople of Capas were ordered by the Spanish authorities to change their family name of their own choosing on condition such family names begin with letter “C”, the first letter of Capas.",
            "Descendants of the early inhabitants still hold to this day such family names as Capiendo, Capuno, Capitulo, Capule, Capunpun, Cayabyab, Castañeda and Catacutan."
        ],
        [
            "In the 1850s, Capas was a part of the western Pampanga Commandancia Militar de Tarlac which includes the town of Bamban, Concepcion, Victoria, O’Donnell, Murcia, Moriones, Florida Blanca, Porac, Mabalacat, and Magalang."
        ],
        [
            "O'Donnell Field in 1938"
        ],
        [
            "O’Donnell (Patling) was then a bustling pueblo established by the Augustinians Recolletos Mission in the 1800s, named in honor of Carlos O’Donnell y Abreu, the Spanish Minister of State who visited the Patling pueblo.",
            "O’Donnell was reverted as a barrio of Capas by the Philippine Commission of 1902 including Moriones reverted to Tarlac town and Murcia back to Concepcion.",
            "Capas is known in history as the site of the infamous death march concentration camp during World War II."
        ],
        [
            "Of the etymology of Capas, old folks believed it derived its name from a wild vine \"Capas-capas\" or it originated from a tree called Capas in the Aetas dialect, Bulak in Pampango or Capaz in Ilocano."
        ],
        [
            "The town has built the Capas National Shrine.",
            "It was built and is maintained by the Philippine government as a memorial to the Filipino and American soldiers who died in Camp O'Donnell at the end of the Bataan Death March, which totals to almost 70,000 soldiers and back-up civilians."
        ],
        [
            "This is a memorable site, for all Filipino and American veterans, that relates to Veterans Day in the Philippines.",
            "It was once a concentration camp subsequently serving as the burial grounds for thousands of Filipino and American soldiers who perished during World War II.",
            "The site was the ultimate destination point of the Bataan Death March involving Filipino and American soldiers who surrendered in Bataan on April 9, 1942."
        ],
        [
            "Camp O'Donnell was a facility of the United States Air Force in Capas, Tarlac, Philippines.",
            "Before the facility was transferred to the Philippine Air Force, it was first a Philippine Constabulary post then a United States Army facility."
        ],
        [
            "Another site, Santo Domingo Death March Marker, which is located in Capas were about 60,000 Filipino soldiers who were camped and eventually unloaded to start the second phase of the Death March."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "With more than 100,000 populace, an area that is good enough for a city and an income close to ₱250,000,000 becoming a city is not impossible according to Rodriguez.",
            "Enshrouding more than 53 percent of this town's land area, the Bases Conversion and Development Authority (BCDA) has included the municipality of Capas in the design of their Master Plan that is now in process, according to re-elected Mayor Antonio “TJ” Rodriguez."
        ],
        [
            "Rodriguez bared this during his inaugural speech at the oath-taking ceremony of newly elected and re-elected municipal officials held at the Multi-Purpose Hall here Monday morning."
        ],
        [
            "TJ said BCDA claims control of the more than 19,900 hectares as a military reservation, where three of their barangays—Santa Juliana, Maruglu and Bueno—were included, while barangays Sta Lucia, Aranguren, Lawy, and O’Donnell were partly taken."
        ],
        [
            "Being included in BCDA's master plan to make Capas a ‘Green City’ soon, TJ said that this town will become the most beautiful and progressive city in the country with the assurance of preserving the environment."
        ],
        [
            "However, with the forthcoming development, the controversy about the land where some Capasenos built their houses a long time ago is still a big issue.",
            "Rodriguez, however, vowed that he is with his constituents’ side in fighting for their rights over the land where their dwellings are constructed."
        ],
        [
            "He revealed that as early as June 2011, he already wrote a letter to President Benigno Aquino III, requesting the delineation and redistribution of 5,000 hectares of the BCDA area where his constituents resided."
        ],
        [
            "He said he would continue to consult with the stakeholders who will be affected by the BCDA's master plan."
        ],
        [
            "TJ assured Capasenos that with the new set of Sangguniang Bayan members headed by his party mate, Vice Mayor Roseller “Boots” Rodriguez, their vision towards the New Capas or Bayung Capas would be swiftly attained through their full cooperation and coordination with each other."
        ],
        [
            "During the occasion, the mayor enumerated his accomplishments during his first term, announcing the ₱65 million increase of budget from ₱180 million in 2010 to ₱215 million in 2012."
        ],
        [
            "He said his administration is intending to generate more revenues to finance more projects and programs in health, agriculture, housing, infrastructure, disaster preparedness, and other services."
        ],
        [
            "In 2020, house bills 7861 were filed for the conversion of the municipality of Capas into a component city in the province of Tarlac.",
            "Both bills are currently pending with the committee on the local government."
        ],
        [
            "On July 5, 2022, House Bill No.",
            "1186 was filed by Rep. Christian Tell A. Yap which seeks to convert Capas into a component city."
        ],
        [
            "Development of New Clark City"
        ],
        [
            "New Clark City Sports Complex"
        ],
        [
            "New Clark City ground broke in 2016 and is envisioned as a Business Contingency Hub of the National Government where it serves as a backup office should Metro Manila experience emergencies such as earthquakes, floods, and other calamities.",
            "It is located in the BCDA reservation in Capas that used to be a test site of military aircraft when Clark Air Base was under control of the United States.",
            "NCC will also serve as the primary venue of the 2019 Southeast Asian Games."
        ],
        [
            "Geography"
        ],
        [
            "Capas has relatively high ground, hilly places near the mountain range are at an approximate 46 meters.",
            "It is bordered by San Jose on the north, Tarlac City on the north-east, Concepcion on the east, Botolan, Zambales, on the west and south-west and Bamban on the rest of the southern parts.",
            "The west side of the town is mountainous while the east side is a plain.",
            "The town is also known as \"The Gateway to Pinatubo Volcano.\"",
            "The town also consists of Hot springs and several freshwater lakes like the Tambo Lake.",
            "Capas is 108 kilometres (67 mi) north of Manila and is 16 kilometres (9.9 mi) southwest of the provincial capital, Tarlac City."
        ],
        [
            "Many of the streams in the province contain small bits of petrified wood, fish, freshwater crabs, and other animals.",
            "Namria and Dingding creek merge as the two major tributaries to Lucong river in Concepcion.",
            "Most of Tarlac's waterways that originate from Mount Pinatubo pass through Capas, including the Bulsa Moriones River and Santa Lucia River that form Tarlac River."
        ],
        [
            "Barangays"
        ],
        [
            "Capas is politically subdivided into 20 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aranguren — named after Archbishop Jose Aranguren (OAS), the Roman Catholic Administrator of this area during the Spanish mission and colonization time"
        ],
        [
            "Bueno"
        ],
        [
            "Cristo Rey (formerly known as Navy)"
        ],
        [
            "Cubcub (Poblacion)"
        ],
        [
            "Cutcut 1st (Poblacion)"
        ],
        [
            "Cutcut 2nd (Poblacion)"
        ],
        [
            "Dolores (Poblacion)"
        ],
        [
            "Estrada (Calingcuan)"
        ],
        [
            "Lawy"
        ],
        [
            "Manga"
        ],
        [
            "Manlapig"
        ],
        [
            "Maruglu"
        ],
        [
            "O'Donnell"
        ],
        [
            "Santa Juliana"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Domingo 1st (Poblacion)"
        ],
        [
            "Santo Domingo 2nd (Poblacion)"
        ],
        [
            "Santo Rosario (Poblacion)"
        ],
        [
            "Talaga"
        ],
        [
            "The original Capas was Pagbatuan where the Aetas resides before the new settlers came to the now proper town of Capas."
        ],
        [
            "Barangay Cutcut, meaning \"to bury\", or \"burial\", is known for its landfill where garbage from other municipalities is disposed.",
            "Malutung gabun or Red soil has a replica of Capas National Shrine which is sometimes featured on Philippine maps.",
            "Barangay Santo Rosario (Holy Rosary) has Villa De Santo Rosario, Rosary-ville, Small Tokyo which was formerly a Japanese Garrison hence its name, Pascuala which has the most poultries and piggeries in Capas it also has one of the most polluted tributaries to Lucong river because surrounding piggeries have made it wastewaters for pig excrement, despite protests, the government has taken little to no action regarding the pollution caused by piggeries.",
            "Pinagpala which has a sugar-cane farm, mango plantations, etc.",
            "Santo Rosario is also the location of Capas Public Cemetery or Cabu Santu, the original Capas cemetery was once located where the entrance way to Small Tokyo near the Barangay Hall.",
            ", as well as the San Nicolas De Tolentino Parish which is the town church that stands next to the Dominican College of Tarlac.",
            "Other schools in Capas include Capas East Central School, Capas High School (Formerly: Dolores High School), Gabaldon Elementary School, Montessori School of St. Nicholas among others.",
            "Wellspring High School and Capas Christian School are the new private schools."
        ],
        [
            "Cubcub, Cut-Cut II, Santo Domingo I, Santo Domingo II, and Santo Rosario are the town's poblacion and location of the public market.",
            "Santa Rita is among the smallest barrios (barangays) of the municipality but has a church and school.",
            "Barangay Talaga is known for its production of Tinapa or smoked fish, Barangay Dolores has its garden plants and Santo Domingo has the Capas Junction which also has fast-food chains like the town proper.",
            "Barangay Aranguren (aling goring) is home to Poet Laureate Renato Alzadon, who is also known as the current \"Ari ning Parnasong Capampangan\" or \"King of Capampangan Literature\", it is also the location of Capas National Shrine, Sitio Kasulukan, Calumpit, Dalang Baka, Aquino Page Village (Kamatis) and Bullhorn.",
            "Barangay Manlapig has rice fields and is among the liveliest barangays during the evening.",
            "Barangay Lawy is known for being a place for many of the first Ilocano settlers in the municipality.",
            "Barangay Mangga (Mango) used to be filled with the fruit-bearing tree or presumably.",
            "Barangay Estrada is the last stop before reaching Tarlac City through McArthur highway.",
            "Patling, Santa Lucia, Bueno, Maruglu and Santa Juliana are mountainous and hilly while filled with vast lands and forest, presumably the place where the earliest settlers of the town stayed."
        ],
        [
            "Subdivisions and villages"
        ],
        [
            "As one of the richest towns in the province, it consists of numerous subdivisions and exclusive villages."
        ],
        [
            "Dominican Hill Subdivision (Cut-Cut 1st)"
        ],
        [
            "Hilltop Subdivision (Cut-Cut 1st)"
        ],
        [
            "Regina Northview Subdivision (Cut-Cut 1st)"
        ],
        [
            "Villa San Jose (Cut-Cut 1st)"
        ],
        [
            "Doña Lutgarda Subdivision (Cut-Cut I)"
        ],
        [
            "Amaia Scapes (Estrada)"
        ],
        [
            "Villa Generosa (Estrada)"
        ],
        [
            "Villa De Concepcion (Talaga)"
        ],
        [
            "BellaVista (Santo Domingo II)"
        ],
        [
            "Vargas Subdivision (Santo Domingo II)"
        ],
        [
            "Villa Necita (Santo Domingo II)"
        ],
        [
            "Villa De Santo Rosario (Santo Rosario)"
        ],
        [
            "RosaryVille (Santo Rosario)"
        ],
        [
            "Saint Paul Homes (Santo Domingo I)"
        ],
        [
            "Robinson Homes Grand Tierra (Santo Domingo I)"
        ],
        [
            "Cenizal Subdivision (Santo Domingo II)"
        ],
        [
            "Kathrine Ville (Cut-Cut 1st)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Capas, Tarlac"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "5(0.2)"
        ],
        [
            "5(0.2)"
        ],
        [
            "10(0.4)"
        ],
        [
            "23(0.9)"
        ],
        [
            "136(5.4)"
        ],
        [
            "191(7.5)"
        ],
        [
            "245(9.6)"
        ],
        [
            "241(9.5)"
        ],
        [
            "200(7.9)"
        ],
        [
            "108(4.3)"
        ],
        [
            "36(1.4)"
        ],
        [
            "12(0.5)"
        ],
        [
            "1,212(47.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "2.6"
        ],
        [
            "2.5"
        ],
        [
            "4.4"
        ],
        [
            "8.3"
        ],
        [
            "20.9"
        ],
        [
            "24.4"
        ],
        [
            "27.4"
        ],
        [
            "26.9"
        ],
        [
            "25.0"
        ],
        [
            "18.2"
        ],
        [
            "9.2"
        ],
        [
            "3.6"
        ],
        [
            "173.4"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CapasYearPop.±% p.a.1903 6,077—    1918 9,244+2.84%1939 13,178+1.70%1948 16,398+2.46%1960 26,617+4.12%1970 35,515+2.92%1975 42,561+3.70%1980 46,523+1.80%1990 61,205+2.78%1995 81,036+5.40%2000 95,219+3.52%2007 122,084+3.49%2010 125,852+1.11%2015 140,202+2.08%2020 156,056+2.13%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Capas was 156,056 people, with a density of 410 inhabitants per square kilometre or 1,100 inhabitants per square mile."
        ],
        [
            "The people of Capas are predominantly Kapampangan because of their close ties from Pampanga.",
            "Ilocano is also used, but both ethnicities who cannot speak each other's languages tend to speak Tagalog, which is used for administrative functions by the local government, local media and in education.",
            "As the majority of the residents are Kapampangans, most of the Ilocanos speak Kapampangan as first language.",
            "The town is also predominantly Roman Catholic but there are also Christian congregations of some sects, like The United Methodist Church, Iglesia ni Cristo, The Church of Jesus Christ of Latter-day Saints, Jehovah's Witnesses, Baptist and Jesus Miracle Crusade."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Capas"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  11.30"
        ],
        [
            "2009  13.17"
        ],
        [
            "2012  14.28"
        ],
        [
            "2015  13.27"
        ],
        [
            "2018  8.73"
        ],
        [
            "2021  11.44"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Capas is the location of Mount Telakawa or Straw hat Mountain on the boundaries of Santa Juliana and Maruglu.",
            "It also provides access to Mount Pinatubo via the preferred route through Barangay Santa Juliana.",
            "Mount Bueno is the site of Bueno hot springs in Barangay Bueno.",
            "Malatarlak and Salay or Lemon grass grow abundantly on Mor-Asia or Talahib mountain at Sitio Kalangitan.",
            "Mount Canouman is the largest in terms of surface area, known as the mountain of Spirits, it is a dangerous 10-hour walk from Sitio Salangui.",
            "The majority of mountains in Capas are relatively easy climbs.",
            "Mount Dalin, the smaller straw hat mountain is near a 300-meter peak called Prayer Mountain or Peniel where a few rooms are available for rent."
        ],
        [
            "Mount Pinatubo"
        ],
        [
            "Mount Telakawa"
        ],
        [
            "Mount Canouman"
        ],
        [
            "Bueno Hot Springs"
        ],
        [
            "Tambo Lake"
        ],
        [
            "Peniel"
        ],
        [
            "Pinatubo Trail"
        ],
        [
            "Capas National Shrine"
        ],
        [
            "Hanging Bridge"
        ],
        [
            "War Museum at the old Capas PNR Station"
        ],
        [
            "Asia Golf and Spa"
        ],
        [
            "The feast day of San Nicolas De Tolentino is held every 10 September; the origin of the name Capas is disputed but has two prominent sources, it is said that town was either named after the edible plant called Capas-Capas or was taken from the first three letters of the surnames Capitulo, Capunfuerza, Capunpue, Capili, Capongga, Capunpun, Capati, Capil and Capuno, etc.",
            "then adding the letters \"a\" and \"s\" hence forming \"Capas\"."
        ],
        [
            "Capas National Shrine"
        ],
        [
            "The municipality is home to the Capas National Shrine, an obelisk with a central bell, which was built and is maintained by the Philippine government as a memorial to the Filipino and American soldiers who died in Camp O'Donnell at Barangay Aranguren.",
            "during the end of the Bataan Death March.",
            "This is an important site related to Veterans Day in the Philippines, every April 9, the anniversary of the surrender of the defending US and Philippine Commonwealth forces to the Japanese in 1942.",
            "When the raid at Capas on 1945, combined US and Philippine Commonwealth ground troops supporting local recognized guerrillas freed by few thousands of Filipino and American POW's on Bataan Death March and attacking Japanese forces.",
            "This is a memorable site, for all Filipino and Americans veterans.",
            "that relates to Veterans Day in the Philippines.",
            "It was once a concentration camp subsequently serving as the burial grounds for thousands of Filipino and American soldiers who perished during World War II.",
            "The site was the ultimate destination point of the infamous Death March involving Filipino and American soldiers who surrendered in Bataan on April 9, 1942."
        ],
        [
            "Camp O'Donnell was a facility of the United States Air Force in Capas, Tarlac, Philippines.",
            "Before the facility was transferred to the Air Force, it was first a Philippine Constabulary post then a United States Army facility."
        ],
        [
            "Another site, Santo Domingo Death March Marker, which is located in Capas were about 60,000 Filipino soldiers who were camped and eventually unloaded to start the second phase of the Death March."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Capas municipal hallThe following officials assumed their offices on the noon of the 30th day of June, 2022.",
            "Except the Ex-officios of the Sangguniang Bayan"
        ],
        [
            "Mayor"
        ],
        [
            "Atty.",
            "Roseller B. Rodriguez (PDPLaban)"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Alexander Espinosa (PDPLaban)"
        ],
        [
            "Sangguniang Bayan"
        ],
        [
            "Jeff Ticsay (NPC)"
        ],
        [
            "Felipe Ong (NPC)"
        ],
        [
            "Estela Manlupig (NPC)"
        ],
        [
            "Jesus Lopez (NPC)"
        ],
        [
            "Alejandro Dueñas (PDPLaban)"
        ],
        [
            "Ariel Batican (PDPLaban)"
        ],
        [
            "Editha Yumul (PDPLaban)"
        ],
        [
            "Nestor Sicat (PDPLaban)"
        ],
        [
            "Ex-Officio's"
        ],
        [
            "Arnold Arcilla - ABC President"
        ],
        [
            "Victor Valentin - Indigenous' People Representative"
        ],
        [
            "Reymart Catacutan - Federation of the Sangguniang Kabataan President"
        ],
        [
            "Gallery"
        ],
        [
            "Santuario de San Nicolas de Tolentino of Capas church"
        ],
        [
            "Public market"
        ],
        [
            "Mount Arayat as viewed from Capas fields"
        ],
        [
            "MacArthur Highway (N2) looking south, which serves as a main street of the town"
        ],
        [
            "RCS supermarket"
        ],
        [
            "Capas municipal hall during Christmas season"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Capas |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ History of O'Donnell in capastarlac.gov.ph"
        ],
        [
            "^ Villanueva, Noel.",
            "\"AN ACT CONVERTING THE MUNICIPALITY OF CAPAS IN THE PROVINCE OF TARLAC INTO A COMPONENT CITY TO BE KNOWN AS THE CITY OF CAPAS\" (PDF).",
            "House of Representatives.",
            "Archived (PDF) from the original on 2021-04-20.",
            "Retrieved April 20, 2021."
        ],
        [
            "^ Yap, Victor.",
            "\"AN ACT CONVERTING THE MUNICIPALITY OF CAPAS IN THE PROVINCE OF TARLAC INTO A COMPONENT CITY TO BE KNOWN AS THE CITY OF CAPAS\" (PDF).",
            "House of Representatives.",
            "Archived (PDF) from the original on 2021-04-19.",
            "Retrieved April 20, 2021."
        ],
        [
            "^"
        ],
        [
            "\"Province: Tarlac\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Capas: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 5 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Tarlac\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Capas."
        ],
        [
            "Capas Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Capas"
        ],
        [
            "San Jose"
        ],
        [
            "Tarlac City"
        ],
        [
            "Botolan, Zambales"
        ],
        [
            "Capas"
        ],
        [
            "Concepcion"
        ],
        [
            "Bamban"
        ],
        [
            "vte Province of TarlacTarlac City (capital and largest city)Municipalities"
        ],
        [
            "Anao"
        ],
        [
            "Bamban"
        ],
        [
            "Camiling"
        ],
        [
            "Capas"
        ],
        [
            "Concepcion"
        ],
        [
            "Gerona"
        ],
        [
            "La Paz"
        ],
        [
            "Mayantoc"
        ],
        [
            "Moncada"
        ],
        [
            "Paniqui"
        ],
        [
            "Pura"
        ],
        [
            "Ramos"
        ],
        [
            "San Clemente"
        ],
        [
            "San Jose"
        ],
        [
            "San Manuel"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Victoria"
        ],
        [
            "Component city"
        ],
        [
            "Tarlac City"
        ],
        [
            "BarangaysSee: List of barangays in Tarlac"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Capas&oldid=1234293209\""
        ],
        [
            "Category: Municipalities of TarlacHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from November 2012All articles needing additional referencesPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Kapampangan-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}