{
    "name": "Caraga",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Caraga, Davao Oriental"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSimple EnglishSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°19′42″N 126°33′57″E﻿ / ﻿7.3283°N 126.5658°E﻿ / 7.3283; 126.5658"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Davao Oriental, Philippines"
        ],
        [
            "For the Philippine region, see Caraga."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Caraga, Davao Oriental\" – news · newspapers · books · scholar · JSTOR (April 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Davao Region, PhilippinesCaragaMunicipalityMunicipality of Caraga"
        ],
        [
            "FlagNickname: Sunrise Capital of the PhilippinesMap of Davao Oriental with Caraga highlightedOpenStreetMapCaragaLocation within the PhilippinesCoordinates: 7°19′42″N 126°33′57″E﻿ / ﻿7.3283°N 126.5658°E﻿ / 7.3283; 126.5658CountryPhilippinesRegionDavao RegionProvinceDavao OrientalDistrict"
        ],
        [
            "1st districtFoundedOctober 29, 1903Barangays17"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAlicia Basoc Mori • Vice MayorMelody Anne S. Benitez • RepresentativeCorazon N. Malanyaon • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Vilie Clovis M. CayetanoGerardo S. Duma-an Jr.Jemaika M. BalanteGallardo P. HernaezDaisy Jane B. PolancosFranklin P. CayetanoEutiquio B. Pagsac Jr.Brian P. Cruz"
        ],
        [
            " • Electorate28,253 voters (2022)Area • Revenue₱ 255.4 million (2020) • Assets₱ 532.7 million (2020) • Expenditure₱ 203.1 million (2020) • Liabilities₱ 99.24 million (2020)Service provider • ElectricityDavao Oriental Electric Cooperative (DORECO)Time zoneUTC+8 (PST)ZIP code8203PSGC112504000IDD : area code +63 (0)87Native languagesDavawenyo Surigaonon Cebuano Kalagan Kamayo Mandaya"
        ],
        [
            "Caraga, officially the Municipality of Caraga (Cebuano: Lungsod sa Caraga; Tagalog: Bayan ng Caraga), is a 1st class municipality in the province of Davao Oriental, Philippines.",
            "According to the 2020 census, it has a population of 39,704 people.",
            "It is one of the oldest settlements in the island of Mindanao."
        ],
        [
            "The Pusan Point located in the town of Caraga is geographically the easternmost point of the Philippines."
        ],
        [
            "History"
        ],
        [
            "The official founding of Caraga as a municipality was in October 29, 1903, under Organic Act 21, making it one of the oldest towns of the province of Davao Oriental.",
            "As early as 1591 Caraga was already listed as a mission registered under the jurisdiction of Encomienda of Bislig."
        ],
        [
            "The etymology of the word “Caraga” is named after the Kalagan people (Spanish \"Caragan\"), a Mansakan subgroup (related to Visayans) native to the regions of Davao and parts of Caraga who speak the Kalagan languages.",
            "The name itself is from kalagan (literally \" spirited\") which means \"fierce\" or \"brave\"; from kalag (\"spirit\" or \"soul\") in the native animistic anito religions."
        ],
        [
            "Hence, the whole Provincia de Caraga of 1622 was called \"region de gente animosa\", that is \"region of spirited men\".",
            "This being \"spirited men and women\" is grounded on its cultural, religious and political background.",
            "With culture, Caragans were spirited in view of their closeness to nature and attitude towards the creation.",
            "With religiosity, Caragans were spirited as to their belief on the spirits of nature (like the trees \"balete tree\", the rivers and mountains, sun and moon); in fact, they have \"anito worship\" and \"ancestor worship\" led by the dancing priestess (balyan) and the singing priestess (catalunan).",
            "With primitive politics, Caragans were spirited as they invited a \"bagani system\" of governance.",
            "A \"bagani\" is like a \"warrior\" kinglet or datu\" who ruled by banditry and by occupation."
        ],
        [
            "Geography"
        ],
        [
            "The municipality is located 254 kilometres (158 mi) from Davao City, the regional center of Region XI, and 84 kilometres (52 mi) from Mati, the capital town of the province of Davao Oriental on the island of Mindanao.",
            "It lies along the eastern coast of this province, facing the Pacific Ocean.",
            "It is bounded in the north by the Municipality of Baganga in the south by the municipality of Manay, in the west by the Municipality of New Bataan, Compostela Valley Province, and on the east by the Pacific Ocean.",
            "Pusan point of Barangay Santiago is the easternmost point of the Philippines."
        ],
        [
            "Caraga coastline is irregular and the municipality is traversed by the two rivers: Caraga River in the south and Manurigao River in the north."
        ],
        [
            "Land area"
        ],
        [
            "Caraga has a total land area 64,270 hectares (158,800 acres), representing 12.45% of the total land area of the Province of Davao Oriental, and seventeen (17) barangays.",
            "Barangay Pichon occupies the largest land area with 16,300 hectares (40,000 acres) which are 25.35% of the total land area of the municipality.",
            "Barangay D.L Balante, which is located in the south-west of Barangay Poblacion, is the smallest barangay with a land area of 975 hectares (2,410 acres) or 1.51% of the total land area of this municipality."
        ],
        [
            "Barangays"
        ],
        [
            "Caraga is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Alvar"
        ],
        [
            "Caningag"
        ],
        [
            "Don Leon Balante"
        ],
        [
            "Lamiawan"
        ],
        [
            "Manorigao"
        ],
        [
            "Mercedes"
        ],
        [
            "Palma Gil"
        ],
        [
            "Pichon"
        ],
        [
            "Poblacion"
        ],
        [
            "San Antonio"
        ],
        [
            "San Jose"
        ],
        [
            "San Luis"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santiago"
        ],
        [
            "P.M. Sobrecarey"
        ],
        [
            "Climate"
        ],
        [
            "Caraga has a tropical rainforest climate (Af) with very heavy rainfall from December to February and moderate to heavy rainfall in the remaining months."
        ],
        [
            "Climate data for Caraga"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "30.3(86.5)"
        ],
        [
            "31.2(88.2)"
        ],
        [
            "31.9(89.4)"
        ],
        [
            "31.9(89.4)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "31.5(88.7)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.9(89.4)"
        ],
        [
            "31.5(88.7)"
        ],
        [
            "30.7(87.3)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.0(78.8)"
        ],
        [
            "26.1(79.0)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "27.3(81.1)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "27.3(81.1)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "26.9(80.3)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21.8(71.2)"
        ],
        [
            "21.9(71.4)"
        ],
        [
            "22.1(71.8)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "23.1(73.6)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "22.4(72.3)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.5(72.5)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "22.5(72.5)"
        ],
        [
            "22.3(72.1)"
        ],
        [
            "22.4(72.4)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "492(19.4)"
        ],
        [
            "371(14.6)"
        ],
        [
            "300(11.8)"
        ],
        [
            "211(8.3)"
        ],
        [
            "171(6.7)"
        ],
        [
            "130(5.1)"
        ],
        [
            "118(4.6)"
        ],
        [
            "101(4.0)"
        ],
        [
            "97(3.8)"
        ],
        [
            "158(6.2)"
        ],
        [
            "206(8.1)"
        ],
        [
            "386(15.2)"
        ],
        [
            "2,741(107.8)"
        ],
        [
            "Source: Climate-Data.org (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CaragaYearPop.±% p.a.1903 3,180—    1918 6,625+5.01%1939 10,877+2.39%1948 10,838−0.04%1960 12,922+1.48%1970 16,618+2.54%1975 19,672+3.44%1980 22,831+3.02%1990 29,368+2.55%1995 31,617+1.39%2000 33,481+1.24%2007 34,278+0.33%2010 36,912+2.73%2015 40,379+1.72%2020 39,704−0.33%Source: Philippine Statistics Authority"
        ],
        [
            "Based on the 2010 census, the Municipality has a total population of 36,912 people, or about 7.1% of the total population of the province."
        ],
        [
            "Of the 17 barangays comprising the municipality, Pichon has the highest population of 5,188 or 14.1% of the municipality's population.",
            "Barangay Poblacion is the second population barangay at 4,710 equivalent to 12.8% of the total population and this is closely followed by Barangay Sobrecarey which has a population of 4,544 or 12.3% of the population of Caraga."
        ],
        [
            "Barangay Alvar is the least populated barangay contributing only 1.7% or 627 persons to the total populations.",
            "It is followed by Barangay San Miguel, which has 833 people, and Barangay D.L.",
            "Balante which has population of 834 or 2.3% of the entire population."
        ],
        [
            "Language"
        ],
        [
            "Household population by mother tongue (based on 1990 participation rate):"
        ],
        [
            "Cebuano – 30%"
        ],
        [
            "Hiligaynon   -   .22%"
        ],
        [
            "Bagobo   -         .032%"
        ],
        [
            "Bilaan        -      .35%"
        ],
        [
            "Butanon   -    .17%"
        ],
        [
            "Davaweño – 93.45%"
        ],
        [
            "Mandaya – 99%"
        ],
        [
            "Yakan         -   .14%"
        ],
        [
            "Not stated   - .51%"
        ],
        [
            "Economy"
        ],
        [
            "Coconut products are the inhabitants main source of income aside from some lucrative business.",
            "It has a number of eco-tourism resources like the Caraga Lagoon, San Luis Beach, Pusan Point, and some historical heritage like the San Salvador Church Bell from 1802, and the Caraga Fortification with 80 feet (24 m) high stone-built walls."
        ],
        [
            "The municipality of Caraga has sixteen (16) wholesale trade establishment which are mostly involved in the buy and sell agricultural products.",
            "Four of these establishment are found in Barangay Poblacion while the rest are found in other Barangays.",
            "Retail establishment, which includes repair/welding shops, dormitory, lodging houses, cable television, telephone services providers, total to 23, most of which are found in the Poblacion."
        ],
        [
            "The present industries thriving in the locality are the agriculture based, presently there are nine rice /corn mills found in Barangay San Luis, San Antonio, Poblacion, San Pedro, San Jose, and P.M Sobrecarey.",
            "There are also one furniture shop in the poblacion and one handicraft industry making dagmay novelties."
        ],
        [
            "Tourism"
        ],
        [
            "Scenic spots:"
        ],
        [
            "Jubilee Cross, Pusan Point – a 16 feet (4.9 m) Jubilee cross made of cement and sand meant as a landmark of Millennium Sunrise event ushering the historic great Jubilee Year 2000 celebration located at Barangay Santiago, Caraga, Davao Oriental, First Light First Sight."
        ],
        [
            "Santiago Cave – a 6 square metres (65 sq ft) cave near the shoreline before reaching Pusan Point, with century-old human fossils with lengths beyond the standard measure of a native Filipino fossils."
        ],
        [
            "Old Church and Convento – a century-old building of San Salvador Parish, which served as the central mission station of the Spanish missionaries, it is made of Tisa out of the processed shells from the seashores of Caraga, the convento ground floor served as a temporary prison cell sometimes during the Spanish occupation."
        ],
        [
            "Parish Development Center – a T-shaped building within hectare land area of the San Salvador Parish of Caraga which serves as the center for seminars, retreats, and conference overlooking the Pusan Point from the Southeast Pacific Coast."
        ],
        [
            "Tourism Complex – a 3-story building meant to house the Davao Oriental Historical Museum and some historical Artifacts w / utmost significance to the Mandayan Cultural customs and traditions."
        ],
        [
            "Bango Beach Resort"
        ],
        [
            "Kapuka Falls in Lamiawan"
        ],
        [
            "Oguad Falls in Lamiawan"
        ],
        [
            "Sungkuan Falls in P.M. Sobrecarey"
        ],
        [
            "Kiti-kiti Falls in Pichon"
        ],
        [
            "Bawgo Beach in Poblacion, Bawgo"
        ],
        [
            "Friar's Beach (LIKSIM) Beach Resort in Poblacion"
        ],
        [
            "Sunrise at Pusan Point, Barangay Santiago"
        ],
        [
            "Crystal Cave in Santiago"
        ],
        [
            "Philippine Eagle's Nest at Maglahus, P.M. Sobrecarey"
        ],
        [
            "Transportation"
        ],
        [
            "The Davao Oriental–Surigao Coastal Highway passes through the municipality mostly along the coastal area with a total stretch of 33.462 kilometres (20.792 mi).",
            "Provincial Roads which branch out from the National Road to the barangays of P.M Sobrecarey and San Pedro amount to 32.079 kilometres (19.933 mi).",
            "The Municipal Roads which are located in the Urban center of Poblacion have a total stretch of 4.968 kilometres (3.087 mi), 1.316 kilometres (0.818 mi) of which are cemented and the remaining 3.652 kilometres (2.269 mi) are mostly all weather graveled roads."
        ],
        [
            "The municipal has 14 bridges.",
            "4 of these bridges are reinforced concrete, located along the national Road."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Caraga |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Executive Summary – Caraga, Davao Oriental\" (PDF).",
            "Retrieved August 26, 2021."
        ],
        [
            "^ \"Climate: Caraga\".",
            "Climate-Data.org.",
            "Retrieved October 25, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XI (Davao Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XI (Davao Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Davao Oriental\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "External links"
        ],
        [
            "Caraga Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Caraga, Davao Oriental"
        ],
        [
            "New Bataan, Compostela Valley"
        ],
        [
            "Baganga"
        ],
        [
            "Maragusan, Compostela ValleyPantukan, Compostela Valley"
        ],
        [
            "Caraga"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Banaybanay"
        ],
        [
            "Manay"
        ],
        [
            "vte Province of Davao OrientalMati (capital)Municipalities"
        ],
        [
            "Baganga"
        ],
        [
            "Banaybanay"
        ],
        [
            "Boston"
        ],
        [
            "Caraga"
        ],
        [
            "Cateel"
        ],
        [
            "Governor Generoso"
        ],
        [
            "Lupon"
        ],
        [
            "Manay"
        ],
        [
            "San Isidro"
        ],
        [
            "Tarragona"
        ],
        [
            "Component cities"
        ],
        [
            "Mati"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Caraga,_Davao_Oriental&oldid=1222940931\""
        ],
        [
            "Category: Municipalities of Davao OrientalHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2014All articles needing additional referencesUse mdy dates from November 2022Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}