{
    "name": "Carigara",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Carigara"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°18′N 124°41′E﻿ / ﻿11.3°N 124.68°E﻿ / 11.3; 124.68"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Leyte, Philippines"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesCarigaraMunicipalityMunicipality of CarigaraDowntown Area (Real St.)"
        ],
        [
            "FlagSealEtymology: Kan Gara to KalgaraMap of Leyte with Carigara highlightedOpenStreetMapCarigaraLocation within the PhilippinesCoordinates: 11°18′N 124°41′E﻿ / ﻿11.3°N 124.68°E﻿ / 11.3; 124.68CountryPhilippinesRegionEastern VisayasProvinceLeyteDistrict"
        ],
        [
            "2nd districtFounded25 January 1571; 453 years ago (25 January 1571)Named forDatu GaraBarangays49"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEduardo \"Ed\" T. Ong Jr. • Vice MayorJimmy A. Camposano • RepresentativeLolita T. Javier • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Joenlee C. Larraga• Anabella N. Crisostomo• Mildred C. Modesto• Raul Z. Lloren• Lorna A. Marpa• Joselu N. Guia• Kim Anthony G. Agner• Leny T. OngDILG Masterlist of Officials"
        ],
        [
            " • Electorate38,606 voters (2022)Area • Revenue₱ 192.2 million (2020) • Assets₱ 606.1 million (2020) • Expenditure₱ 156.6 million (2020) • Liabilities₱ 160.8 million (2020)Service provider • ElectricityLeyte 3 Electric Cooperative (LEYECO 3) • WaterMetro Carigara Water District (MCWD) • TelecommunicationsBayan Telecommunications, Globe Telecom, Smart Communications, Dito Telecommunity • Cable TVG Sat, Sky Direct, Cignal, SatLiteTime zoneUTC+8 (PST)ZIP code6529PSGC0803715000IDD : area code +63 (0)53Native languagesWaray TagalogMajor Religion Christianity, mainly Roman CatholicismLocal FeastFeast of the Triumph of the Holy CrossFeast Dateevery 16th day of JulyWebsitewww.carigara-leyte.gov.ph"
        ],
        [
            "Carigara (Tagalog:"
        ],
        [
            "Established in 1571, Carigara holds the distinction of being the inaugural town founded in the expansive Eastern Visayas region.",
            "A pivotal development occurred in 1735 when Leyte and Samar were detached from Cebu, forming a unified provincial governance structure with Carigara serving as the premier provincial capital during this era."
        ],
        [
            "Carigara is renowned for its distinct offerings, including pastillas, humba, sundang (machete), and the hubhob delicacy.",
            "Hubhob, a local delight, is crafted from grated cassava, eggs, kalamay, milk, and sugar, cooked within a bagacay (bamboo pole) over charcoal, imparting a unique and flavorful taste to this traditional specialty."
        ],
        [
            "History"
        ],
        [
            "Holy Cross Parish Church, 2022"
        ],
        [
            "Carigara, originally known as \"Kan Gara,\" translates to \"that of Gara\" or simply \"Gara's.\"",
            "Legend has it that Gara hailed from Borneo and was among the unnamed companions of the ten datus who purchased Panay from the Ati (or Aeta) chief Marikudo.",
            "Over time, \"Kan Gara\" transformed into Kalgara for ease of pronunciation, and upon the arrival of the Spaniards, the place was named Carigara, thus adopting its present designation."
        ],
        [
            "As the initial town established in Eastern Visayas, Carigara celebrates its town fiesta every 16th of July, marking the arrival of the Spaniards on July 16, 1569.",
            "This festivity, spanning nearly the entire month of July, is known as the Fiesta of the Holy Cross, commemorating this significant historical event."
        ],
        [
            "Carigara's Attempt for a World Record"
        ],
        [
            "Real Street from above, featuring standing performers."
        ],
        [
            "On July 14, 2018, Carigara made a bold attempt to secure the Guinness World Records for the \"Largest Participants in Philippine Folk Dance,\" showcasing the Kuratsa.",
            "This event formed a part of the town's 423rd fiesta celebration slated for July 16, instilling a sense of pride among the locals and fostering hopes for an economic and tourism upsurge.",
            "The event boasted nearly 5,000 participants, predominantly comprising students, teachers from various schools, municipal employees, representatives from the private sector, and residents.",
            "Carigara had promptly submitted its bid and eagerly awaited official confirmation."
        ],
        [
            "Geography"
        ],
        [
            "Topography"
        ],
        [
            "It is a town in the northern part of Leyte province located right on the shores of Carigara Bay, and surrounded by wide rice fields fanning out towards the mountains in the distance."
        ],
        [
            "Carigara shares borders with Capoocan to the west, Ormoc to the south, Jaro to the southeast, Tunga to the east and Barugo to the northeast."
        ],
        [
            "Flora and Fauna"
        ],
        [
            "Flora"
        ],
        [
            "The climatic and topographical characteristics of Carigara's expansive terrain, encompassing wide rice fields and hilly landscapes, create an optimal environment for cultivating fruit-bearing trees, vegetables, and a variety of crops.",
            "Noteworthy fruit-bearing trees suitable for cultivation include bananas, coconuts, jackfruits, mangoes, guavas, rambutans, santol, and star apples.",
            "In terms of vegetables, gabi, karubasa, pipino, kamalunggay, marigoso, munggos, sitaw, and upo are extensively grown by local farmers and residents, thriving exceptionally well within the community.",
            "Additionally, root crops like kamote and balanghoy flourish alongside rice crops, constituting a substantial part of the agricultural landscape in Carigara."
        ],
        [
            "Fauna"
        ],
        [
            "Carigara features vast highland forests and a diverse fauna, including domesticated animals like carabaos, horses, cats, dogs, chickens, and pigs.",
            "In its wild population, the area is home to snakes, frogs, insects, various lizards, and a variety of birds, among other wildlife species."
        ],
        [
            "Barangays"
        ],
        [
            "Carigara is politically subdivided into 49 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bagong Lipunan"
        ],
        [
            "Balilit"
        ],
        [
            "Barayong"
        ],
        [
            "Barugohay Central"
        ],
        [
            "Barugohay Norte"
        ],
        [
            "Barugohay Sur"
        ],
        [
            "Baybay (Poblacion)"
        ],
        [
            "Binibihan"
        ],
        [
            "Bislig"
        ],
        [
            "Caghalo"
        ],
        [
            "Camansi"
        ],
        [
            "Canal"
        ],
        [
            "Candigahub"
        ],
        [
            "Canfabi"
        ],
        [
            "Canlampay"
        ],
        [
            "Cogon"
        ],
        [
            "Cutay"
        ],
        [
            "East Visoria"
        ],
        [
            "Guindapunan East"
        ],
        [
            "Guindapunan West"
        ],
        [
            "Hiluctogan"
        ],
        [
            "Jugaban (Poblacion)"
        ],
        [
            "Libo"
        ],
        [
            "Lower Hiraan"
        ],
        [
            "Lower Sogod"
        ],
        [
            "Macalpi"
        ],
        [
            "Manloy"
        ],
        [
            "Nauguisan"
        ],
        [
            "Paglaum"
        ],
        [
            "Pangna"
        ],
        [
            "Parag-um"
        ],
        [
            "Parena (Parina)"
        ],
        [
            "Piloro"
        ],
        [
            "Ponong (Poblacion)"
        ],
        [
            "Rizal (Tagak East)"
        ],
        [
            "Sagkahan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Juan"
        ],
        [
            "San Mateo (Poblacion)"
        ],
        [
            "Santa Fe"
        ],
        [
            "Sawang (Poblacion)"
        ],
        [
            "Tagak"
        ],
        [
            "Tangnan"
        ],
        [
            "Tigbao"
        ],
        [
            "Tinaguban"
        ],
        [
            "Upper Hiraan"
        ],
        [
            "Upper Sogod"
        ],
        [
            "Uyawan"
        ],
        [
            "West Visoria"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Carigara, Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "73(2.9)"
        ],
        [
            "56(2.2)"
        ],
        [
            "75(3.0)"
        ],
        [
            "71(2.8)"
        ],
        [
            "114(4.5)"
        ],
        [
            "174(6.9)"
        ],
        [
            "172(6.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "167(6.6)"
        ],
        [
            "161(6.3)"
        ],
        [
            "158(6.2)"
        ],
        [
            "125(4.9)"
        ],
        [
            "1,509(59.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "15.2"
        ],
        [
            "12.5"
        ],
        [
            "16.2"
        ],
        [
            "17.3"
        ],
        [
            "23.9"
        ],
        [
            "27.3"
        ],
        [
            "28.4"
        ],
        [
            "26.9"
        ],
        [
            "26.9"
        ],
        [
            "27.1"
        ],
        [
            "23.8"
        ],
        [
            "19.3"
        ],
        [
            "264.8"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Municipal Hall, 2016"
        ],
        [
            "Population census of CarigaraYearPop.±% p.a.1903 16,382—    1918 17,558+0.46%1939 23,236+1.34%1948 26,803+1.60%1960 26,761−0.01%1970 32,869+2.07%1975 34,194+0.80%1980 34,377+0.11%YearPop.±% p.a.1990 38,863+1.23%1995 42,302+1.60%2000 43,455+0.58%2007 45,696+0.70%2010 47,444+1.38%2015 51,345+1.52%2020 54,656+1.24%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Carigara, Leyte, was 54,656 people, with a density of 460 inhabitants per square kilometre or 1,200 inhabitants per square mile."
        ],
        [
            "Language"
        ],
        [
            "The predominant language in the municipality is Waray-waray, with Cebuano and Tagalog recognized as minority languages.",
            "English functions as the official language, often interspersed with Waray in colloquial exchanges.",
            "Although Spanish maintains residual relevance, its usage is limited to specific contexts and not prevalent in verbal or day-to-day communication."
        ],
        [
            "Faith and Religion"
        ],
        [
            "Carigara is a Christian municipality, and most of the population are Roman Catholics.",
            "There are also adherents of other Christian denominations and sects like the Iglesia ni Cristo, the Church of Jesus Christ of Latter-day Saints, Seventh-day Adventists (Sabadistas), Evangelicals or Born Again Christians, Baptists, Jehovah's Witnesses (Mga Saksi ni Jehova), Protestants, and some more."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Carigara"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  31.40"
        ],
        [
            "2009  32.14"
        ],
        [
            "2012  34.74"
        ],
        [
            "2015  31.20"
        ],
        [
            "2018  25.00"
        ],
        [
            "2021  26.53"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "Festival"
        ],
        [
            "Magara Festival"
        ],
        [
            "On January 25, 2019, Carigara commemorated its inaugural festival, the Magara Festival, coinciding with its 448th founding anniversary.",
            "Magara locally connotes abundance, elegance, and vibrancy.",
            "The inaugural Magara Festival primarily centered on celebrating the town's agricultural richness, local products, historical heritage, and its community."
        ],
        [
            "Events"
        ],
        [
            "Turugpo is a significant public spectacle featuring duels between two male carabaos or two male horses, occurring annually on Black Saturday.",
            "This widely attended event garners immense popularity within the town, drawing thousands of both local and international tourists eager to witness this renowned and culturally significant fight."
        ],
        [
            "Tourism"
        ],
        [
            "Here's a list of some tourist attractions of the municipality of Carigara."
        ],
        [
            "Attractions include:"
        ],
        [
            "Lauron's Boulevard (Brgy.",
            "Baybay & Ponong) This is the place where people can buy street foods like isaw, pork barbecues, and many more."
        ],
        [
            "Carigara Municipal Library and Museum (Brgy.",
            "Baybay)"
        ],
        [
            "Cassidy Elementary School (Brgy.",
            "Ponong) A school famous for its classical-style building."
        ],
        [
            "Datu Gara Shrine (Brgy.",
            "Canal)"
        ],
        [
            "Gawas an Harigue (Brgy.",
            "Baybay) An old house with exposed posts on the sides."
        ],
        [
            "Heroes Shrine (Brgy.",
            "Baybay & Ponong) Located right between Carigara Boulevard and the Kan Gara Gymnasium."
        ],
        [
            "Holy Cross Parish Church (Brgy.",
            "Ponong) The oldest and largest church in Carigara."
        ],
        [
            "Kan Gara Gymnasium (Brgy.",
            "Ponong) The largest gymnasium."
        ],
        [
            "Lumen Ancestral House (Brgy.",
            "Sawang) The only house in the town which serves as a shelter for balinsasayaos."
        ],
        [
            "Plaza Triunfo (Brgy.",
            "Ponong) The largest plaza."
        ],
        [
            "St. Francis Assisi Parish (Brgy.",
            "Jugaban)"
        ],
        [
            "Infrastructures"
        ],
        [
            "Transportation"
        ],
        [
            "Land Transport"
        ],
        [
            "Carigara New Public Terminal, 2021"
        ],
        [
            "Pedicabs are the common mode of transportation within the town proper and the poblacións."
        ],
        [
            "Tricycles and habal-habals on the other hand are commonly used for travelling within the town, especially to the far-flung barangays."
        ],
        [
            "Vans, jeepneys and buses are the mode of transport when travelling to the cities of Tacloban and Ormoc or to the municipalities that are faraway from the town.",
            "There are few bus companies situated in Carigara."
        ],
        [
            "There are new modernized PUVs that travel from Carigara to Tacloban and vice versa issued by its local government on 24 November 2021."
        ],
        [
            "Sea Transport"
        ],
        [
            "Port of Carigara, 2021"
        ],
        [
            "The municipality owns a port that is located in Barangay Baybay where local boats and ships docks."
        ],
        [
            "Healthcare Service"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(January 2022)"
        ],
        [
            "Carigara District Hospital, commonly referred to as CDH, serves as the sole public hospital in the town.",
            "Residents from neighboring towns also visit the hospital to admit their ailing patients, seeking additional medical services and attention."
        ],
        [
            "Utilities"
        ],
        [
            "This section is empty.",
            "You can help by adding to it.",
            "(January 2022)"
        ],
        [
            "Education"
        ],
        [
            "There are a total of 30 elementary schools, 6 high schools (1 private, 4 public, 1 pending construction) and 2 college institutions located on Carigara."
        ],
        [
            "Grade School/Elementary School"
        ],
        [
            "Balilit Elementary School"
        ],
        [
            "Barugohay Norte Elementary School"
        ],
        [
            "Barugohay Sur Elementary School"
        ],
        [
            "Binibihan Elementary School"
        ],
        [
            "C.A.T.A.M.C.S.",
            "(Cong.",
            "Alberto T. Aguja Memorial Central School)"
        ],
        [
            "Caghalo Elementary School"
        ],
        [
            "Camansi Elementary School"
        ],
        [
            "Candigahub Elementary School"
        ],
        [
            "Canfabi ES (Santa Fe ES)"
        ],
        [
            "Canlampay Elementary School"
        ],
        [
            "Carigara II CS"
        ],
        [
            "Cassidy Central School (Cassidy Elementary School)"
        ],
        [
            "Cogon Elementary School"
        ],
        [
            "Guindapunan Elementary School"
        ],
        [
            "Hiluctogan Elementary School"
        ],
        [
            "Hira-an Elementary School"
        ],
        [
            "M. Morales Memorial Elementary School"
        ],
        [
            "Macalpi Elementary School"
        ],
        [
            "Manloy Elementary School"
        ],
        [
            "Nauguisan Elementary School"
        ],
        [
            "Pangna Elementary School"
        ],
        [
            "Parag-um Elementary School"
        ],
        [
            "Ponong Elementary School"
        ],
        [
            "Sagkahan Elementary School"
        ],
        [
            "Sogod Elementary School"
        ],
        [
            "Santa Fe Elementary School"
        ],
        [
            "Tagak Elementary School"
        ],
        [
            "Tigbao Elementary School"
        ],
        [
            "Tinaguban Elementary School"
        ],
        [
            "Uyawan Elementary School"
        ],
        [
            "Secondary School/High School"
        ],
        [
            "Carigara National High School"
        ],
        [
            "Carigara National Vocational School (formerly Carigara School of Fisheries)"
        ],
        [
            "Jugaban National High School"
        ],
        [
            "Sogod National High School"
        ],
        [
            "Holy Cross College of Carigara (Private)"
        ],
        [
            "Parag-um National High School (soon)"
        ],
        [
            "College/University"
        ],
        [
            "Holy Cross College of Carigara"
        ],
        [
            "Eastern Visayas State University (Carigara Campus)"
        ],
        [
            "Notable personalities"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(January 2022) (Learn how and when to remove this message)"
        ],
        [
            "Eduardo Makabenta Sr. - Waray-language poet and translator"
        ],
        [
            "Mike Hanopol - musician, singer-songwriter"
        ],
        [
            "Gallery"
        ],
        [
            "Century-old houses in Brgy.",
            "Jugaban, Carigara, Leyte"
        ],
        [
            "Gawas an Harigue"
        ],
        [
            "Carigara Municipal Library and Museum"
        ],
        [
            "Cassidy Central School"
        ],
        [
            "Plaza Triunfo"
        ],
        [
            "Holy Cross Parish Church"
        ],
        [
            "Carigara Tide Embankment"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Carigara |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Carigara Celebrates 446th Founding Anniversary\".",
            "metrocarigarawd.gov.ph.",
            "21 January 2017.",
            "Retrieved 3 December 2018."
        ],
        [
            "^ \"Carigara attempts Guinness' largest participants in folk dance\".",
            "sunstar.com.ph.",
            "14 July 2018.",
            "Retrieved 28 November 2021."
        ],
        [
            "^"
        ],
        [
            "\"Province:\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Carigara: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 February 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Oldest town in Leyte holding first official festival\".",
            "mb.com.ph.",
            "24 January 2019.",
            "Retrieved 27 November 2021."
        ],
        [
            "^ \"Leyte's animal jousts festival showcases delicacies\".",
            "sunstar.com.ph.",
            "29 March 2016.",
            "Retrieved 29 November 2021."
        ],
        [
            "^ \"\"No animal cruelty\" in Turugpo\".",
            "27 March 2016.",
            "Retrieved 29 November 2021 – via PressReader."
        ],
        [
            "^ \"Schools Directory | Trokis Philippines\".",
            "School Torkis Directory.",
            "Archived from the original on October 30, 2018.",
            "Retrieved October 31, 2018."
        ],
        [
            "^ Sugbo, Victor, ed.",
            "(1995).",
            "Tinipigan: An Anthology of Waray Literature.",
            "Manila, Philippines: National Commission for Culture and the Arts.",
            "p. 271.",
            "OCLC 645852700.",
            "Retrieved 27 September 2019."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Carigara."
        ],
        [
            "Wikisource has the text of the 1911 Encyclopædia Britannica article \"Carigara\"."
        ],
        [
            "Wikivoyage has a travel guide for Carigara."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Carigara"
        ],
        [
            "Carigara Bay"
        ],
        [
            "Barugo"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Tunga"
        ],
        [
            "Ormoc"
        ],
        [
            "Jaro"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Carigara&oldid=1221791815\""
        ],
        [
            "Category: Municipalities of Leyte (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataPages using infobox settlement with possible demonym listPages with Tagalog IPAArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textArticles to be expanded from January 2022All articles to be expandedArticles using small message boxesArticles with empty sections from January 2022All articles with empty sectionsArticles needing additional references from January 2022All articles needing additional referencesCommons category link from WikidataArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}