{
    "name": "Carles",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Carles, Iloilo"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°34′N 123°08′E﻿ / ﻿11.57°N 123.13°E﻿ / 11.57; 123.13"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "Municipality in Western Visayas, PhilippinesCarles"
        ],
        [
            "BadiangMunicipalityMunicipality of Carles(from top: left to right) Cabugao Gamay Island, Sicogon Island, Islas de Gigantes limestone cliff and Bantigue Island sandbar."
        ],
        [
            "FlagSealNickname: Alaska of the PhilippinesMotto: Timbo-ok CarlesMap of Iloilo with Carles highlightedOpenStreetMapCarlesLocation within the PhilippinesCoordinates: 11°34′N 123°08′E﻿ / ﻿11.57°N 123.13°E﻿ / 11.57; 123.13CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "5th districtFoundedJuly 1, 1862Named forJose Maria CarlesBarangays33"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 195.2 million (2020) • Assets₱ 659 million (2020) • Expenditure₱ 174.9 million (2020) • Liabilities₱ 341.2 million (2020)Service provider • ElectricityIloilo 3 Electric Cooperative (ILECO 3)Time zoneUTC+8 (PST)ZIP code5019PSGC0603014000IDD : area code +63 (0)33Native languagesHiligaynon Capisnon TagalogWebsitewww.carles.gov.ph"
        ],
        [
            "Carles, officially the Municipality of Carles (Hiligaynon: Banwa sang Carles, Tagalog: Bayan ng Carles),  is a 2nd class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 72,637 people."
        ],
        [
            "Located on Panay island, it is known for its rich fishing grounds.",
            "It is also known for popular tourist attractions such as the Islas de Gigantes and Sicogon Island."
        ],
        [
            "History"
        ],
        [
            "Settlers first arrived circa 1846 and cleared an area at Punta Bulakawe, north of the current poblacion.",
            "Following an influx of settlers from Aklan and Antique, the settlement fell under Pueblo de Pilar, Capiz.",
            "About 10 years later, the settlement was transferred to the lowland and renamed to Badiang."
        ],
        [
            "In 1860, the first attempt was made to convert the barrio into a municipality but the provincial government of Capiz refused.",
            "Because of this refusal, the town leaders petitioned the governor of Iloilo, Governor Jose Maria Carles, who approved the petition.",
            "On July 1, 1862, the new pueblo was inaugurated and renamed to Carles, in honor to the governor.",
            "First Gobernadorcillo was Alenjandro Buaya."
        ],
        [
            "On January 1, 1904, the Municipio de Carles was demoted from a status of a Barrio to the status of a Barrio Balasan.",
            "This incident disheartened some Carleseños who migrated to other towns and provinces.",
            "But among those who stayed on were the strong willed ones who struggled hard to make Carles an independent municipality.",
            "Headed by Casimiro Andrada, the Carles Separation Movement succeeded in getting the approval of the Carleseños petition for separation from Balasan on January 1, 1920.",
            "Federico A. Ramos was appointed as the first Municipal President of Carles.",
            "It was during the incumbency of Municipal President Enrico Ilanga that the title of the municipal head was changed to Municipal Mayor and continued to be such until today."
        ],
        [
            "Typhoon Haiyan"
        ],
        [
            "Carles was heavily damaged by Typhoon Haiyan.",
            "Buildings were destroyed and more than 1,200 people were displaced by the storm."
        ],
        [
            "Geography"
        ],
        [
            "Carles is the northernmost municipality in the province and is 142 kilometres (88 mi) from the provincial capital, Iloilo City, 71 kilometres (44 mi) from Roxas City, and 141 kilometres (88 mi) from Kalibo."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Carles, Iloilo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "27(81)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "61(2.4)"
        ],
        [
            "39(1.5)"
        ],
        [
            "46(1.8)"
        ],
        [
            "48(1.9)"
        ],
        [
            "90(3.5)"
        ],
        [
            "144(5.7)"
        ],
        [
            "152(6.0)"
        ],
        [
            "145(5.7)"
        ],
        [
            "163(6.4)"
        ],
        [
            "160(6.3)"
        ],
        [
            "120(4.7)"
        ],
        [
            "90(3.5)"
        ],
        [
            "1,258(49.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.3"
        ],
        [
            "9.0"
        ],
        [
            "9.9"
        ],
        [
            "10.0"
        ],
        [
            "18.5"
        ],
        [
            "25.0"
        ],
        [
            "27.4"
        ],
        [
            "26.0"
        ],
        [
            "25.9"
        ],
        [
            "24.9"
        ],
        [
            "17.9"
        ],
        [
            "14.2"
        ],
        [
            "221"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Barangays"
        ],
        [
            "Carles is politically subdivided into 33 Barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Abong"
        ],
        [
            "Alipata (Sicogon Island)"
        ],
        [
            "Asluman (Gigantes Norte)"
        ],
        [
            "Bancal"
        ],
        [
            "Barangcalan"
        ],
        [
            "Barosbos"
        ],
        [
            "Punta Batuanan"
        ],
        [
            "Binuluangan"
        ],
        [
            "Bito-on"
        ],
        [
            "Bolo"
        ],
        [
            "Buaya (Sicogon Island)"
        ],
        [
            "Buenavista"
        ],
        [
            "Isla De Cana"
        ],
        [
            "Cabilao Grande"
        ],
        [
            "Cabilao Pequeño"
        ],
        [
            "Cabuguana"
        ],
        [
            "Cawayan"
        ],
        [
            "Dayhagan"
        ],
        [
            "Gabi (Gigantes Sur)"
        ],
        [
            "Granada (Gigantes Norte)"
        ],
        [
            "Guinticgan"
        ],
        [
            "Lantangan (Gigantes Sur)"
        ],
        [
            "Manlot (Manlot Island)"
        ],
        [
            "Nalumsan"
        ],
        [
            "Pantalan"
        ],
        [
            "Poblacion"
        ],
        [
            "Punta (Bolocawe)"
        ],
        [
            "San Fernando (Sicogon Island)"
        ],
        [
            "Tabugon"
        ],
        [
            "Talingting"
        ],
        [
            "Tarong"
        ],
        [
            "Tinigban"
        ],
        [
            "Tupaz"
        ],
        [
            "Islands"
        ],
        [
            "Eighteen of Carles's barangays are spread out over fourteen islands and minor islets.",
            "The islands under Carles's political jurisdiction are:"
        ],
        [
            "Balbagon Island"
        ],
        [
            "Binuluangan Island"
        ],
        [
            "Calagna-an Island"
        ],
        [
            "Cabugao Island"
        ],
        [
            "Gigantes Norte"
        ],
        [
            "Gigantes Sur"
        ],
        [
            "Himamylan Island"
        ],
        [
            "Linadlaran Island"
        ],
        [
            "Manigonigo Island"
        ],
        [
            "Manlot Island"
        ],
        [
            "Nabunot Island"
        ],
        [
            "Sicogon Island"
        ],
        [
            "Talunan-an Island"
        ],
        [
            "Tomaquin Island"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CarlesYearPop.±% p.a.1903 6,676—    1939 12,185+1.69%1948 18,547+4.78%1960 20,006+0.63%1970 24,501+2.05%1975 27,887+2.63%1980 32,184+2.91%1990 42,648+2.86%1995 46,218+1.52%2000 53,404+3.15%2007 57,673+1.07%2010 62,690+3.08%2015 68,160+1.61%2020 72,637+1.26%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Carles, Iloilo, was 72,637 people, with a density of 700 inhabitants per square kilometre or 1,800 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Carles"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  51.50"
        ],
        [
            "2009  46.76"
        ],
        [
            "2012  35.77"
        ],
        [
            "2015  33.26"
        ],
        [
            "2018  35.79"
        ],
        [
            "2021  35.86"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Carles is the 14th wealthiest town in Iloilo (based on income) in 2009, with an income total of P70,475,987 (2009)"
        ],
        [
            "The agricultural produce of the town includes fish, prawn, crab, rice, corn, sugar, cattle and poultry.",
            "Other industries include bakeries, shell craft and wood furniture."
        ],
        [
            "Maritime resources"
        ],
        [
            "Carles is a significant center for commercial fishing, so much so that it carries the name 'Alaska of the Philippines' - reference to the area's marine resources.",
            "The reason for this is that Carles' water territory lies in the Visayan Sea triangle where the islands of Gigantes are located.",
            "As part of the Coral Triangle, these islands contain some of the most biologically diverse marine resources, and one of the most productive fishing grounds in the country.",
            "Various commercial species are harvested along Carles' waters, including mackerel, barracuda, sardines, shad, pompano, grouper, squid, cuttlefish, shrimp, prawns, shells, seaweed and others."
        ],
        [
            "Infrastructure"
        ],
        [
            "'Bancal Fish Port' is the main fish-landing port in the municipality and is where fish catches from Iloilo, other Panay provinces, Masbate and Romblon are unloaded daily."
        ],
        [
            "Tourism"
        ],
        [
            "Landmark on Islas de Gigantes in Carles"
        ],
        [
            "Gigantes Group of Islands"
        ],
        [
            "One tourist destination in Western Visayas is the Islas de Gigantes or Higantes Group of Islands located in the second class municipality of Carles in northern Iloilo."
        ],
        [
            "The Gigantes group of islands in Carles, Iloilo are endowed with limestone forests, caves, and white-sand beaches.",
            "It is classified as a high urgent conservation priority under the Philippine Biodiversity Conservation Priority-Setting Program (PBCPP).",
            "It is home to a variety of species, two of them endemic: the Gekkonid Lizard (Gekko gigante) and the Island Forest Frog (Platymantis insulatus)."
        ],
        [
            "Sicogon Island"
        ],
        [
            "Sicogón is an island in northern Iloilo, which is part of the municipality of Carles.",
            "It is named after cogon, a type of grass found in abundance on the island.",
            "According to the 2010 census, it has a population of 5,238."
        ],
        [
            "Sicogon was a popular tourist destination However, due to the situation caused by martial law, development stalled and Sicogon's popularity faded in favor of Boracay Island."
        ],
        [
            "Municipal Tourism Center"
        ],
        [
            "Located at Bancal Port, Carles Iloilo is a Tourist assistance, boat reservation, registration and payment center,  they also regulates the rates and accredited the boats for the Gigantes tours.",
            "souvenir items can also be found in the center."
        ],
        [
            "Gallery"
        ],
        [
            "Old Spanish lighthouse in Naburot Island"
        ],
        [
            "One of Carles islets -visited by island-hopping tourists in the summer season"
        ],
        [
            "A typical resort in the islands of Carles"
        ],
        [
            "Bantigue Island's Sandbar during low tide."
        ],
        [
            "Ruin gate of the lighthouse"
        ],
        [
            "Hidden lagoon, locally known as 'Tanque/Tangke'"
        ],
        [
            "Infinity pool in one of the Barangay Guinticgan's resorts"
        ],
        [
            "North and South Gigante Islands seen from the Visayan Sea"
        ],
        [
            "Tumaquin Island from the beach of Sicogon Island"
        ],
        [
            "Antonia Beach"
        ],
        [
            "Transport"
        ],
        [
            "Iloilo International Airport (IATA: ILO, ICAO: RPVI) serves the city of Iloilo as well as the province of Iloilo.",
            "It receives flights from Manila, Cebu, Cagayan de Oro, Davao City, General Santos, Tacloban, Puerto Princesa, Singapore and Hong Kong and is served by three airlines; Philippines AirAsia, Cebu Pacific, and Philippine Airlines."
        ],
        [
            "Roxas Airport (IATA: RXS, ICAO: RPVR) is near to Carles with domestic flights from Cebu and Manila"
        ],
        [
            "Sicogon Airport (IATA: ICO, ICAO: RPSG) is the first and only airport in Carles and Northern Iloilo with domestic flights from and to Manila."
        ],
        [
            "Jeepneys and tricycles are the common public land transport with route Carles-Balasan and vice versa.",
            "The route Carles- Iloilo City and vice versa, and Carles- Roxas City and vice versa is served by Ceres Liner while Carles- Metro Manila and vice versa is served by Dimple Star Bus."
        ],
        [
            "Pumboats are used for transversing the water between the Islands of Carles and Its Mainland with Estancia.",
            "Bancal port serves as the gateway to Gigantes Islands."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Carles |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Municipality of Carles: Brief History\".",
            "www.oocities.org.",
            "Retrieved 7 March 2017."
        ],
        [
            "^ \"Municipality of Carles\".",
            "www.oocities.org.",
            "Retrieved 2023-06-27."
        ],
        [
            "^ \"Provincial board declares Iloilo under state of calamity\".",
            "Archived from the original on 2013-12-08.",
            "Retrieved 2013-12-03."
        ],
        [
            "^"
        ],
        [
            "\"Carles: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 3 May 2020."
        ],
        [
            "^ \"The Carles of Today\".",
            "Retrieved 19 June 2014."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Detourista, Marcos (2011-01-18).",
            "\"Iloilo Financial Profile 2009 - Income Ranking of Iloilo Towns - Explore Iloilo\".",
            "Explore Iloilo.",
            "Retrieved 2023-06-27."
        ],
        [
            "^ a b \"Foundation for the Philippine Environment\".",
            "fpe.ph.",
            "Retrieved 2023-06-27."
        ],
        [
            "^ \"BFAR & NFP Highlights of Accomplishments in 2011\" (PDF).",
            "Bureau of Fisheries and Aquatic Resources.",
            "Archived from the original (PDF) on 2018-03-01."
        ],
        [
            "^ \"DA Invests P29.4M to Transform Northern Iloilo Fish Port into Major Hub\".",
            "rfu07.da.gov.ph.",
            "Retrieved 2023-06-27."
        ],
        [
            "^ \"Gigantes, a call for small islands resiliency\".",
            "7 November 2015."
        ],
        [
            "^ \"Total Population by Province, City, Municipality and Barangay: As of May 1, 2010\" (PDF).",
            "Archived from the original (PDF) on 2012-11-15.",
            "Retrieved 2018-03-01."
        ],
        [
            "^ \"Sicogon Island\".",
            "Exploreiloilo.com.",
            "Retrieved 2013-10-07."
        ],
        [
            "^ JM Hotels (2012-06-26).",
            "\"ILOILO, Heart of the Philippines - Sicogon Island\".",
            "Iloilo.gov.ph.",
            "Archived from the original on 2013-09-27.",
            "Retrieved 2013-10-07."
        ],
        [
            "^ \"Isla de Gigantes: Iloilo's Tourism Giant\".",
            "5 September 2015."
        ],
        [
            "^ Detourista, Marcos.",
            "\"How To Get To & Around Gigantes Islands\".",
            "Explore Iloilo.",
            "Retrieved 2023-06-27."
        ],
        [
            "^ \"How to get to Dimple Star Transport Corporation in las Piñas by Bus?\".",
            "3 June 2023."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Carles, Iloilo."
        ],
        [
            "Iloilo Travel Guide Website Archived 2018-01-13 at the Wayback Machine"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Carles, Iloilo"
        ],
        [
            "Balud, MasbateJintotolo Channel"
        ],
        [
            "Pilar Bay"
        ],
        [
            "Carles"
        ],
        [
            "Visayan Sea"
        ],
        [
            "Pilar, Capiz"
        ],
        [
            "Balasan / Estancia"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Carles,_Iloilo&oldid=1234250152\""
        ],
        [
            "Category: Municipalities of IloiloHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from February 2018Commons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}