{
    "name": "Carmona",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Carmona, Cavite"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°19′N 121°03′E﻿ / ﻿14.32°N 121.05°E﻿ / 14.32; 121.05"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Component city in Cavite, Philippines"
        ],
        [
            "This article's tone or style may not reflect the encyclopedic tone used on Wikipedia.",
            "See Wikipedia's guide to writing better articles for suggestions.",
            "(December 2020) (Learn how and when to remove this message)"
        ],
        [
            "Component city in Calabarzon, PhilippinesCarmonaComponent cityCity of CarmonaLungsod ng CarmonaCarmona River Dam"
        ],
        [
            "FlagSealWordmarkNickname: The Smart CityMotto(s): Bayan Muna Lagi (Filipino)'Our town above all else'Map of Cavite with Carmona highlightedOpenStreetMapCarmonaLocation within the PhilippinesCoordinates: 14°19′N 121°03′E﻿ / ﻿14.32°N 121.05°E﻿ / 14.32; 121.05CountryPhilippinesRegionCalabarzonProvinceCaviteDistrict"
        ],
        [
            "5th districtEstablishedFebruary 20, 1857CityhoodJuly 8, 2023Named forCarmona, Seville, SpainBarangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorDahlia A. Loyola • Vice MayorCesar L. Ines, Jr. • RepresentativeRoy M. Loyola • City Council"
        ],
        [
            "Members"
        ],
        [
            "Leonila A. ManabatCesar M. LoyolaMaximo A. AcbayRoel Z. ManarinDomingo R. TenederoBernie A. OrtizRebecca L. ReyesAmable M. Lontok"
        ],
        [
            " • Electorate58,691 voters (2023)Area • Revenue₱ 861.5 million (2020) • Assets₱ 2,472 million (2020) • Expenditure₱ 595.1 million (2020) • Liabilities₱ 340.5 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code4116PSGC042104000IDD : area code +63 (0)46Native languagesTagalogWebsitecarmonagov.net"
        ],
        [
            "Carmona ("
        ],
        [
            "Carmona is also the newest city in the Philippines; it became a city on July 8, 2023, and it was the 149th city founded in the Philippine archipelago."
        ],
        [
            "Etymology"
        ],
        [
            "By virtue of a decree issued on February 20, 1857, by Queen Isabella II of Spain through Governor General Fernándo Norzagaray y Escudero, Latag became a separate municipality with the name it bears today: Carmona, named after the city of the same name in the province of Seville, Spain."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Carmona was formerly a settlement called Latag, which was annexed to the town of Silang upon the latter's creation in 1595.",
            "The origins of its name are unknown.",
            "In 1856, the settlement's inhabitants demanded the conversion of Latag into a town, spearheaded by Tiburcio Purificacion."
        ],
        [
            "Carmona history started with three brothers who came to the land of Carmona, which was at the time called Labac."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "In 1595, Silang became a town.",
            "The former Sitio Labac became Barrio Latag.",
            "Carmona during that time was just a part of Silang.",
            "This is not surprising because in the early part of the Spanish regime, Silang included what are known today as the municipalities of Indang, San Francisco de Malabon (now General Trias), and Maragondon.",
            "Moreover, Alfonso, Amadeo, and Mendez were mere sitios of Indang; Santa Cruz de Malabon (now Tanza) was a part of San Francisco de Malabon or Malabon Grande; and Magallanes and Ternate were barrios of Maragondon.",
            "Furthermore, Maragondon itself had been a part of the Corregimiento of Mariveles on the opposite side of Manila Bay."
        ],
        [
            "On March 9, 1746, a decree determined the boundaries of Silang and Biñan signed by Mayor Pedro Calderon Enriquez."
        ],
        [
            "On November 15, 1759, two years after securing the independence of Carmona, the principales requested the Governor of Cavite for the reversal of the Canon on communal lands after constructing their own public buildings and irrigation works."
        ],
        [
            "In 1838, the movement of the inhabitants of Latag to become a town started."
        ],
        [
            "On February 20, 1857, due to the great distance to the mother town, the principales and incumbent Cabeza de Barangay of Latag petitioned for its separation and conversion into a municipality.",
            "The new town was called Carmona, after a town of the same name in the Spanish province of Seville."
        ],
        [
            "On April 16, 1857, boundaries between Silang and Carmona were set."
        ],
        [
            "On September 15, 1859, the inhabitants of Carmona returned to managing and ownership of communal lands."
        ],
        [
            "On January 22, 1864, the incumbent gobernadorcillo and principales of Carmona petitioned higher authorities for the abolition of the repartimiento of the communal lands triennially."
        ],
        [
            "In 1872, the communal lands were sold at public auction, which was opposed two years later by Don Gaspar Espiritu in a communication to the Superior Civil Governor."
        ],
        [
            "On October 25, 1874, an event of great significance to the people of Carmona was a strong typhoon, which wrought considerable damage to the public works and private property."
        ],
        [
            "On July 6, 1881, seven years later, the principales of Carmona requested the rectification of the town's boundaries."
        ],
        [
            "During the Philippine Revolution in 1896, the gobernadorcillo of Carmona was Kapitan Damian Ermitano after the administrations of Tiburcio Purificacion, Mariano Mapanoo and Donald C. Virtucio, Augusto Manaog and Fabian Tenedero."
        ],
        [
            "American occupation era"
        ],
        [
            "After the revolution and the occupation of the country by the Americans in 1901, the first local executive of Carmona was Martin Reyes, who was followed next by Marcelo Reyes, Prudencio Torres, Juan Alumia, Estanislao Paular, Marciano Mapanoo, and Juan Zamora."
        ],
        [
            "In 1941, the inhabitants of Carmona renewed the demand for \"homestead\" land."
        ],
        [
            "Philippine independence"
        ],
        [
            "The mayors who assumed office after World War II were Bernardo Hebron, Eulalio Reyes and Cesar Casal and Felino L. Maquinay."
        ],
        [
            "In 1959, the district of San Gabriel and San Jose of Barangay Kabilang Baybay were purchased by the National Government for the relocation of squatters from Metro Manila."
        ],
        [
            "On March 14, 1981, the relocation site, which teemed with people from almost every part of the country and was more popularly known as the resettlement area, became an independent municipality called General Mariano Alvarez."
        ],
        [
            "According to research conducted in 1982, by Sangguniang Bayan members Ernesto Zamora, Salvador P. Manahan, Pio Purificacion, Narciso Levardo, and Romy Laurito, assisted by Municipal Secretary Rogelio D. Paular, it was found out that the history of Carmona began during the 15th century.",
            "As related by a reliable informant, three brothers coming from the mountain of Silang were said to be the first settlers in the place which was then called  \"Latag\", a Tagalog word for \"plain\" due to the numerous hills and plains in the area.",
            "The settlement was not known to other residents of Silang until some of them also went down to the place, cleared some forest areas and established their residence."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "On June 30, 2022, House Bill No.",
            "108 was filed by Cavite's 5th congressional district representative and former Carmona mayor Roy Loyola for the conversion of the municipality of Carmona into a component city.",
            "It was substituted with House Bill No.",
            "3968 filed on August 24, 2022."
        ],
        [
            "On September 5, 2022, the measure was approved by the House of Representatives on final reading.",
            "It was transmitted and received by the Senate on September 6, 2022."
        ],
        [
            "Republic Act No.",
            "11938, a law which will convert Carmona into a component city, was signed by President Bongbong Marcos on February 23, 2023."
        ],
        [
            "A plebiscite was held on July 8, 2023"
        ],
        [
            "Carmona cityhood plebiscite"
        ],
        [
            "Choice"
        ],
        [
            "Votes"
        ],
        [
            "%"
        ],
        [
            " Yes"
        ],
        [
            "30,363"
        ],
        [
            "95.98"
        ],
        [
            "No"
        ],
        [
            "1,016"
        ],
        [
            "3.21"
        ],
        [
            "Valid votes"
        ],
        [
            "31,379"
        ],
        [
            "99.2%"
        ],
        [
            "Invalid or blank votes"
        ],
        [
            "253"
        ],
        [
            "0.8%"
        ],
        [
            "Total votes"
        ],
        [
            "31,632"
        ],
        [
            "100.00"
        ],
        [
            "Registered voters/turnout"
        ],
        [
            "58,691"
        ],
        [
            "56.8%"
        ],
        [
            "Source: Plebiscite result from COMELEC via GMA News"
        ],
        [
            "Geography"
        ],
        [
            "Carmona is located on the easternmost part of the province of Cavite, 48 kilometres (30 mi) south of Manila, 28 kilometres (17 mi) from the provincial capital Imus, and 13 kilometres (8.1 mi) from Biñan.",
            "It is bounded on the north, east and south by the City of Biñan, Municipality of General Mariano Alvarez (GMA) on the north-west and Silang on the south-west.",
            "The geographic coordinates of Carmona are about 14.32° latitude and 121.06° longitude."
        ],
        [
            "The topography of Carmona is generally flat to strongly rolling or sloping, partly lowland and partly hill.",
            "Carmona is divided into four physiographical areas: the lowest lowland area, the lowland area, the central hilly area and the upland mountainous area."
        ],
        [
            "The city is also within the path of a fault line, the Valley Fault System which starts from the Sierra Madre mountains."
        ],
        [
            "Barangays"
        ],
        [
            "Carmona is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios.",
            "The seat of government is in Barangay 4."
        ],
        [
            "Barangay map of Carmona"
        ],
        [
            "Name"
        ],
        [
            "Area"
        ],
        [
            "Population"
        ],
        [
            "Coordinates"
        ],
        [
            "Map"
        ],
        [
            "%"
        ],
        [
            "2020census"
        ],
        [
            "Bancal"
        ],
        [
            "4.05 km2 (1.56 sq mi)"
        ],
        [
            "15.27%"
        ],
        [
            "16,221"
        ],
        [
            "14°17′02″N 121°00′32″E﻿ / ﻿14.284°N 121.009°E﻿ / 14.284; 121.009﻿ (Bancal)"
        ],
        [
            "Barangay 1"
        ],
        [
            "0.13 km2 (0.05 sq mi)"
        ],
        [
            "2.95%"
        ],
        [
            "3,138"
        ],
        [
            "14°18′43″N 121°03′25″E﻿ / ﻿14.312°N 121.057°E﻿ / 14.312; 121.057﻿ (Barangay 1)"
        ],
        [
            "Barangay 2"
        ],
        [
            "0.03 km2 (0.01 sq mi)"
        ],
        [
            "0.63%"
        ],
        [
            "670"
        ],
        [
            "14°18′47″N 121°03′29″E﻿ / ﻿14.313°N 121.058°E﻿ / 14.313; 121.058﻿ (Barangay 2)"
        ],
        [
            "Barangay 3"
        ],
        [
            "0.03 km2 (0.01 sq mi)"
        ],
        [
            "0.82%"
        ],
        [
            "870"
        ],
        [
            "14°18′36″N 121°03′11″E﻿ / ﻿14.310°N 121.053°E﻿ / 14.310; 121.053﻿ (Barangay 3)"
        ],
        [
            "Barangay 4"
        ],
        [
            "0.03 km2 (0.01 sq mi)"
        ],
        [
            "0.61%"
        ],
        [
            "650"
        ],
        [
            "14°18′47″N 121°03′25″E﻿ / ﻿14.313°N 121.057°E﻿ / 14.313; 121.057﻿ (Barangay 4)"
        ],
        [
            "Barangay 5"
        ],
        [
            "0.02 km2 (0.01 sq mi)"
        ],
        [
            "0.50%"
        ],
        [
            "532"
        ],
        [
            "14°18′43″N 121°03′18″E﻿ / ﻿14.312°N 121.055°E﻿ / 14.312; 121.055﻿ (Barangay 5)"
        ],
        [
            "Barangay 6"
        ],
        [
            "0.03 km2 (0.01 sq mi)"
        ],
        [
            "0.69%"
        ],
        [
            "729"
        ],
        [
            "14°18′50″N 121°03′25″E﻿ / ﻿14.314°N 121.057°E﻿ / 14.314; 121.057﻿ (Barangay 6)"
        ],
        [
            "Barangay 7"
        ],
        [
            "0.02 km2 (0.01 sq mi)"
        ],
        [
            "0.67%"
        ],
        [
            "709"
        ],
        [
            "14°18′43″N 121°03′11″E﻿ / ﻿14.312°N 121.053°E﻿ / 14.312; 121.053﻿ (Barangay 7)"
        ],
        [
            "Barangay 8"
        ],
        [
            "0.16 km2 (0.06 sq mi)"
        ],
        [
            "2.94%"
        ],
        [
            "3,125"
        ],
        [
            "14°18′50″N 121°03′18″E﻿ / ﻿14.314°N 121.055°E﻿ / 14.314; 121.055﻿ (Barangay 8)"
        ],
        [
            "Cabilang Baybay"
        ],
        [
            "4.34 km2 (1.68 sq mi)"
        ],
        [
            "7.28%"
        ],
        [
            "7,736"
        ],
        [
            "14°19′01″N 121°03′00″E﻿ / ﻿14.317°N 121.050°E﻿ / 14.317; 121.050﻿ (Cabilang Baybay)"
        ],
        [
            "Lantic"
        ],
        [
            "13.64 km2 (5.27 sq mi)"
        ],
        [
            "23.27%"
        ],
        [
            "24,721"
        ],
        [
            "14°17′53″N 121°02′56″E﻿ / ﻿14.298°N 121.049°E﻿ / 14.298; 121.049﻿ (Lantic)"
        ],
        [
            "Mabuhay"
        ],
        [
            "3.69 km2 (1.42 sq mi)"
        ],
        [
            "11.97%"
        ],
        [
            "12,714"
        ],
        [
            "14°18′40″N 121°02′56″E﻿ / ﻿14.311°N 121.049°E﻿ / 14.311; 121.049﻿ (Mabuhay)"
        ],
        [
            "Maduya"
        ],
        [
            "2.55 km2 (0.98 sq mi)"
        ],
        [
            "9.97%"
        ],
        [
            "10,595"
        ],
        [
            "14°19′19″N 121°03′50″E﻿ / ﻿14.322°N 121.064°E﻿ / 14.322; 121.064﻿ (Maduya)"
        ],
        [
            "Milagrosa"
        ],
        [
            "0.95 km2 (0.37 sq mi)"
        ],
        [
            "22.44%"
        ],
        [
            "23,846"
        ],
        [
            "14°18′29″N 121°02′53″E﻿ / ﻿14.308°N 121.048°E﻿ / 14.308; 121.048﻿ (Milagrosa)"
        ],
        [
            "Land area"
        ],
        [
            "With a total land area of 29,749,874 square meters (320,224,980 sq ft), Carmona represents 2.17% of the total land area of the province.",
            "These areas are currently occupied by 14 barangays of which 7 are considered Poblacion barangays and 7 others are regular barangays.",
            "Barangay Lantic is the largest area while Barangay 2 has the smallest area."
        ],
        [
            "Climate"
        ],
        [
            "Carmona has a Type I climate characterized by two pronounced seasons: dry from November to April and wet during rest of the year.",
            "Maximum rainfall usually occurs from June to September.",
            "The average annual rainfall is 200 millimeters (7.9 in) with a peak of 400 millimeters (16 in) in August."
        ],
        [
            "The average annual temperature is 27.2 °C (81.0 °F).",
            "The highest temperature occurs during the month of May while the lowest occurs during the month of January."
        ],
        [
            "The predominant wind direction comes from the south-west during the month of June to September and from the north-west during the month of October to January, while from February to April, the wind is coming from the southeast, predominantly in the month of May."
        ],
        [
            "The average humidity of Carmona is 81%.",
            "This makes the city cooler than Metro Manila proper where the average humidity is higher."
        ],
        [
            "Climate data for Carmona, Cavite"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "10(0.4)"
        ],
        [
            "10(0.4)"
        ],
        [
            "12(0.5)"
        ],
        [
            "27(1.1)"
        ],
        [
            "94(3.7)"
        ],
        [
            "153(6.0)"
        ],
        [
            "206(8.1)"
        ],
        [
            "190(7.5)"
        ],
        [
            "179(7.0)"
        ],
        [
            "120(4.7)"
        ],
        [
            "54(2.1)"
        ],
        [
            "39(1.5)"
        ],
        [
            "1,094(43)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5.2"
        ],
        [
            "4.5"
        ],
        [
            "6.4"
        ],
        [
            "9.2"
        ],
        [
            "19.7"
        ],
        [
            "24.3"
        ],
        [
            "26.9"
        ],
        [
            "25.7"
        ],
        [
            "24.4"
        ],
        [
            "21.0"
        ],
        [
            "12.9"
        ],
        [
            "9.1"
        ],
        [
            "189.3"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Soil properties"
        ],
        [
            "The eastern side of Cavite consists of Carmona clay loam with streaks of Carmona clay loam steep phase and Carmona sandy clay loam.",
            "This type of soil is granular with tuffaceous material and concretions.",
            "It is hard and compact when dry, sticky and plastic when wet.",
            "This type of soil is planted with rice with irrigation or sugarcane without irrigation.",
            "Fruit trees such as mango, avocado and citrus are also grown in this type of soil."
        ],
        [
            "Mineral resources"
        ],
        [
            "Cavite coastal areas have marl and conglomerate sedimentary rocks and some igneous rocks which are prominent in the high, mountainous regions of the western part of the province.",
            "Carmona reserves and deposits of sand, clay and gravel materials are found in Sitio Ulong Tubig, Mabuhay."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CarmonaYearPop.±% p.a.1903 2,606—    1918 2,818+0.52%1939 5,394+3.14%1948 5,597+0.41%1960 8,212+3.25%1970 20,123+9.36%1975 51,004+20.50%1980 65,014+4.97%1990 28,247−8.00%1995 35,686+4.48%2000 47,856+6.49%2007 68,135+4.99%2010 74,986+3.55%2015 97,557+5.14%2020 106,256+1.69%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Carmona, Cavite, was 106,256 people, with a density of 3,600 inhabitants per square kilometre or 9,300 inhabitants per square mile."
        ],
        [
            "In the 2010 census, Carmona had a total population of 74,986 which represented a total number of households at 14,885."
        ],
        [
            "Population density"
        ],
        [
            "The highest densities are found in the Poblacion area (Barangays 1–8) and Barangays Milagrosa and Maduya, where land areas are significantly lower than the other barangays.",
            "Barangay Lantic posted development of the Kuok Property within the Lantic area; it is expected that the density will increase within the ten-year period."
        ],
        [
            "Population distribution"
        ],
        [
            "Carmona's population is concentrated in Barangays 1–8 at the Poblacion area.",
            "Barangay Lantic is the most populated barangay, which posted a total population of 24,721.",
            "Dense population is also found in Barangay 9, the central business district of the municipality.",
            "Most population catalysts such as banks, town center, and commercial establishments are found in the Poblacion area."
        ],
        [
            "Language"
        ],
        [
            "The main language spoken is Tagalog.",
            "In some areas they speak Chabacano or Chavacano, sometimes referred to by linguists as Philippine Creole Spanish, a Spanish-based creole language spoken in the Philippines.",
            "English is considered as the second language and is widely used as medium of communication in business and higher education.",
            "Other Philippine languages spoken are Waray, Bicolano, Cebuano, Ilokano, Pangasinense, and Hiligaynon.",
            "Chinese and Spanish are also spoken by some local residents."
        ],
        [
            "Religion"
        ],
        [
            "The majority of inhabitants are composed of Roman Catholics, Protestants and other non-denominational groups."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Carmona"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  5.00"
        ],
        [
            "2009  3.43"
        ],
        [
            "2012  3.00"
        ],
        [
            "2015  3.76"
        ],
        [
            "2018  4.01"
        ],
        [
            "2021  10.86"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Cottage industries include metal works, metalcraft, footwear industries, concrete products, tricycle assembly, rattan handicrafts, and bakeries.",
            "Manufacturing firms engaged in handicraft (bags and shoes), furniture making, business retailing, personal and business services, and food-based enterprises contribute to the municipality's trade and commerce.",
            "Mercantile activities in the municipality are concentrated in the Poblacion area and along Governor's Drive.",
            "Carmona has been classified as a first-class municipality since July 1996, brought about by industrialization, real estate development, and commercial activities."
        ],
        [
            "Carmona's progress accelerated after the conversion of more than 50 hectares (120 acres) of farmlands into industrial areas in 1998.",
            "Garment industries, steel fabrication, microchips and semi-conductors, tool fabrication, bus assembly, bulb factories, die casting, and other small and medium-scale industries currently operate in the municipality.",
            "These investments continue to provide local employment, generate export earnings, increase municipal revenues, and serve as vehicles for technology transfer.",
            "Foreign investments are pouring in as export-oriented industries continue to flourish."
        ],
        [
            "Employment rate: Out of a potential labor force of 24,918 (members 15 years old and older who are actively seeking work), 98.03% are employed, while 1.97% are unemployed.",
            "The presence of 8 industrial estates and 2 industrial compounds contributes largely to the high employment rate of the municipality."
        ],
        [
            "Agriculture"
        ],
        [
            "An irrigation dam in Carmona."
        ],
        [
            "A rice field in Carmona."
        ],
        [
            "The economy of Carmona is generally agricultural.",
            "Almost half of its total land area is devoted to agriculture."
        ],
        [
            "In 2000, the total land area devoted to agriculture was 609 hectares (1,500 acres) or 19.7% of the total land area of Carmona.",
            "230 hectares (570 acres) are irrigated areas all of which are currently planted with rice and vegetables, 30 hectares (74 acres) are upland rice areas, 122.5 hectares (303 acres) are for diversified trees and crops, and the 211.5 hectares (523 acres) are considered pasture land."
        ],
        [
            "There are 217 farmers in the Municipality engaged in planting and farming.",
            "Crops and livestock farmers are distributed among 14 barangays of Carmona."
        ],
        [
            "However, with the implementation of the CALABARZON growth area, the municipality of Carmona has slowly become an industrial enclave in the province.",
            "The advent of industrialization has threatened the agricultural base of Carmona.",
            "As of April 1999, land used for rice production has gone down; sugarcane plantation has decreased considerably and those land uses for other crops and vegetables totaled 84.5 hectares (209 acres) during the same year."
        ],
        [
            "At present, the programs and services of the Department of Agriculture (DA) are focused on five priority programs: a sustained self-sufficiency program for rice and corn, strengthening of production market linkage, an acceleration of livelihood program, aggressive assistance to organizational development of farmers, and assistance to agriculture-related priority programs of other government agencies."
        ],
        [
            "Crop production"
        ],
        [
            "The major crops produced in the municipality are lowland and upland rice and sugarcane.",
            "Other crops grown are corn, vegetables, root crops, and fruit trees."
        ],
        [
            "Fruits and vegetables production"
        ],
        [
            "In 2000, an area covering some 23.5 hectares (58 acres) was planted with various crops and fruit trees.",
            "These yielded an estimated 444 meters (1,457 ft) of assorted products."
        ],
        [
            "Livestock and poultry production"
        ],
        [
            "Livestock and poultry raising in the municipality are largely backyard family enterprises.",
            "Animals raised are generally for home consumption and an additional income source for the family.",
            "Total production of livestock and poultry in 1999 registered a head count of 7,907.",
            "Pigs raised both for human consumption or for breeding purposes are estimated at 1,675, while the equally popular poultry raising produced about 4,472 head.",
            "An estimated 1,013 head of cattle, 31 head of carabaos and 716 goats were also produced.",
            "Based on reports of the municipal Agricultural Officer, the total livestock and poultry production in the municipality is still below the sufficiency level for beef, pork meat and eggs."
        ],
        [
            "Industry"
        ],
        [
            "People's Technology Complex"
        ],
        [
            "Industrialization accounts for the rapid growth of Carmona's business community from an otherwise quaint agricultural town in the 1950s into the growing city of today.",
            "Brought about by huge capital from the national government, the industrial complexes bolstered the increase of the city's revenues and the change in the people's lifestyle."
        ],
        [
            "There are eight existing industrial complexes located in the city limits.",
            "Its proximity to Manila and at the same time being the gateway to the Calabarzon area made Carmona a promising venue for business."
        ],
        [
            "On the other hand, the local government has been very supportive of the investors.",
            "There are 114 factories in eight industrial parks/complexes to date.",
            "At present there are the eight industrial complexes strewn along the Governor's Drive, in a total of 419.31 hectares (1,036.1 acres), making up 13.56% of the town's land area.",
            "Ranging from 9 to 100 hectares (22 to 247 acres), these industrial estates are complete with amenities, secured, and in close coordination with the municipal government through the Carmona Business Club and other agencies."
        ],
        [
            "Commercial and financial"
        ],
        [
            "Carmona Public Market"
        ],
        [
            "One of the biggest commercial subdivisions in town is the Macaria Business Park in Barangay Mabuhay which houses a WalterMart branch in its 13.13-hectare (32.4-acre) lot.",
            "Recently, fast food chains and restaurants have been opened to compete for regular patronage at the Paseo de Carmona in Barangay Maduya."
        ],
        [
            "Moreover, numerous traders and retailers are housed in the bustling Carmona Public Market."
        ],
        [
            "The bulk of commercial activities come from wholesale/retail enterprises, which comprise a total of 619 establishments.",
            "There are also service-related establishments: businesses, food shops and amusement operators, with 35 banks and other lending institutions.",
            "Among the major banking institutions that cater to the financial needs of businesses in Carmona and neighboring towns are Bank of the Philippine Islands (BPI), Metrobank, Banco de Oro (BDO), Chinatrust Bank, Chinabank, Rizal Commercial Banking Corporation (RCBC), and Unionbank."
        ],
        [
            "Government"
        ],
        [
            "Seal of the former Municipality of Carmona, used until its cityhood."
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Panlungsod"
        ],
        [
            "The city of Carmona is governed by a city mayor designated as its local chief executive and by a city council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and councilors are elected directly by the people through an election that is being every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "List of local government officials since June 30, 2022."
        ],
        [
            "Members of the City Council of Carmona(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Chief Executive of the City of Carmona"
        ],
        [
            "Mayor Dahlia A. Loyola"
        ],
        [
            "Presiding Officer of the City Council of Carmona"
        ],
        [
            "Vice Mayor Cesar L. Ines Jr."
        ],
        [
            "Members of the City Council"
        ],
        [
            "Leonila A. Manabat"
        ],
        [
            "Cesar M. Loyola"
        ],
        [
            "Maximo A. Acbay"
        ],
        [
            "Roel Z. Manarin"
        ],
        [
            "Domingo R. Tenedero"
        ],
        [
            "Bernie A. Ortiz"
        ],
        [
            "Rebecca L. Reyes"
        ],
        [
            "Amable M. Lontok"
        ],
        [
            "Former municipal mayors"
        ],
        [
            "Marcelino P. Clarito"
        ],
        [
            "Marcelo Reyes"
        ],
        [
            "Martin Reyes"
        ],
        [
            "Prudencio Torres"
        ],
        [
            "Marcelo Reyes (re-elected)"
        ],
        [
            "Juan R. Alumia"
        ],
        [
            "Estanislao G. Paular (1931–1937)"
        ],
        [
            "Marciano Mapanoo (1938–1941)"
        ],
        [
            "Candido G. Hebron (1942–1943)"
        ],
        [
            "Juan Zamora (1943–1944)"
        ],
        [
            "Alfredo Anulat (1944–1945)"
        ],
        [
            "Arsenio Mapalad (1945–1946)"
        ],
        [
            "Bernardo B. Hebron (1946–1955)"
        ],
        [
            "Eulalio Reyes (1955–1956)"
        ],
        [
            "Cesar E. Casal (1956–1979)"
        ],
        [
            "Felino L. Maquinay (1980–1986)"
        ],
        [
            "Estelito Torres (OIC, 1986–1988)"
        ],
        [
            "Felino Maquinay (1988 – February 1990)"
        ],
        [
            "Rolando Rosas (February 1990 – 1995)"
        ],
        [
            "Roy M. Loyola (1995–2004; 2007–2010; 2019–2022)"
        ],
        [
            "Dahlia A. Loyola (2004–2007; 2010–2019; 2022–present)"
        ],
        [
            "Healthcare"
        ],
        [
            "Carmona Hospital & Medical Center"
        ],
        [
            "The Pagamutang Panglungsod ng Carmona (lit.",
            "'Carmona City Hospital' and the Rural Health Unit (RHU) are government-owned and run healthcare facilities in the town."
        ],
        [
            "The main health center in the city is located in Barangay 4.",
            "A total of eleven barangay health centers, or substations, of the RHU are established in different barangays."
        ],
        [
            "In addition to the rural health units and the Pagamutang Panglungsod, there are also private clinics and hospitals operating in the city.",
            "Eleven clinics are privately owned, and one clinic is under the supervision of government health workers."
        ],
        [
            "Education"
        ],
        [
            "Cavite State University – Carmona campus"
        ],
        [
            "Interior of Carmona National High School, a rainbow can be seen in the sky"
        ],
        [
            "The education sector in Carmona has improved in many aspects of endeavor.",
            "In line with the local government's thrust of enhancing quality education, the Department of Education (DepEd), particularly the District of Carmona and Carmona National High School, with the full support of the local government unit, implemented various programs and projects that intensified the education sector's efforts to achieve its goals."
        ],
        [
            "As early as 1995, various programs for the improvement of quality education started with a vision of producing competitive students at both the elementary and secondary levels.",
            "Carmona posted a literacy rate of 89%.",
            "The local government started with the computerization of all schools.",
            "Each public school was given computer units, and students were provided with computer lessons.",
            "This is in consonance with the belief that modern technology and equipment are considered factors in enhancing better education.",
            "To address the increasing number of enrollees and students, the LGU conceptualized the construction of 2-story buildings in different schools in Carmona."
        ],
        [
            "At present, the municipality has a substantial number of classrooms and teachers to meet the learning needs of the school-age population.",
            "As of the school year 2005–2006, the municipality has 50 educational institutions, 28 of which are public schools and 17 are privately run.",
            "The public schools are categorized into 18 pre-schools, 9 elementary schools, 1 junior high school, 1 senior high school, and 1 tertiary school.",
            "The private educational institutions are composed of 10 pre-schools, 7 elementary schools, 3 secondary/high schools, and a computer college."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Carmona |  (DILG)"
        ],
        [
            "^ a b c \"Comprehensive Land Use Plan, 2021-2030\".",
            "Carmona Government.",
            "pp. 25–26.",
            "Retrieved August 12, 2023."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Batas Pambansa Blg.",
            "75 (June 13, 1980), An Act Creating the Municipality of General Mariano Alvarez in the Province of Cavite, retrieved February 8, 2022"
        ],
        [
            "^ Presidential Proclamation No.",
            "2033 (November 11, 1980), Setting the date for the holding of a plebiscite to decide the creation of the municipality of General Mariano Alvarez, province of Cavite, retrieved February 8, 2022"
        ],
        [
            "^ \"AN ACT CONVERTING THE MUNICIPALITY OF CARMONA IN THE PROVINCE OF CAVITE INTO A COMPONENT CITY TO BE KNOWN AS THE CITY OF CARMONA\" (PDF).",
            "House of Representatives.",
            "August 23, 2022.",
            "Retrieved September 5, 2022."
        ],
        [
            "^ Fernandez, Daniza (January 24, 2023).",
            "\"Bill converting Carmona municipality into city hurdles Senate on 2nd reading\".",
            "INQUIRER.net.",
            "Retrieved January 31, 2023."
        ],
        [
            "^ \"Press Release - PRIB: Senate approves Carmona cityhood bill\".",
            "legacy.senate.gov.ph.",
            "Retrieved January 31, 2023."
        ],
        [
            "^ Republic Act No.",
            "11938 (February 24, 2023), An Act Converting the Municipality of Carmona in the Province of Cavite into a component city to be known as the City of Carmona (PDF), retrieved February 24, 2023"
        ],
        [
            "^ \"House OKs bill converting Carmona, Cavite into a city\".",
            "politics.com.ph.",
            "September 5, 2022.",
            "Retrieved January 31, 2023."
        ],
        [
            "^ Tamayo, Bernadette E. (January 30, 2023).",
            "\"Senate approves bill converting Carmona into a city\".",
            "The Manila Times.",
            "Retrieved January 31, 2023."
        ],
        [
            "^ \"Carmona's cityhood plebiscite set July 8\".",
            "Manila Standard.",
            "March 27, 2023.",
            "Retrieved March 30, 2023."
        ],
        [
            "^ de Leon, Dwight (July 8, 2023).",
            "\"Plebiscite day: Voters decide on proposed city conversion of Carmona, Cavite\".",
            "Rappler.",
            "Retrieved July 8, 2023."
        ],
        [
            "^ Post from CNN Philippines' Twitter account, July 8, 2023.",
            "Retrieved July 8, 2023."
        ],
        [
            "^ de Leon, Dwight (July 5, 2023).",
            "\"Fast Facts: July 8 plebiscite seeking conversion into city of Carmona, Cavite\".",
            "Rappler.",
            "Retrieved July 8, 2023."
        ],
        [
            "^ Jaymalin, Mayen (July 7, 2023).",
            "\"All set for Carmona cityhood plebiscite\".",
            "The Philippine Star.",
            "Retrieved July 8, 2023."
        ],
        [
            "^ a b Santos, Jamil (July 8, 2023).",
            "\"Carmona, Cavite cityhood wins in plebiscite\".",
            "GMA News.",
            "Retrieved July 8, 2023."
        ],
        [
            "^ Sevillano, Stephanie (July 4, 2023).",
            "\"Over 58K voters set to join plebiscite on Carmona's cityhood\".",
            "Philippine News Agency.",
            "Retrieved July 8, 2023."
        ],
        [
            "^ a b c \"Socio-Economic Profile\" (PDF).",
            "Archived from the original (PDF) on September 11, 2011.",
            "Retrieved January 27, 2011."
        ],
        [
            "^ \"Phivolcs cites need to prepare for earthquakes | Manila Bulletin\".",
            "Manila Bulletin.",
            "Archived from the original on October 24, 2009.",
            "Retrieved March 25, 2011."
        ],
        [
            "^ http://www.phivolcs.dost.gov.ph/images/active/Hazard%20Maps/Active%20Fault%20Maps/Valley_fault_maps/metro_manila_q.pdf"
        ],
        [
            "^"
        ],
        [
            "\"Carmona: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 12, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cavite\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ a b c Demography | Carmona Cavite, Philippines"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Local Economy | Carmona Cavite, Philippines"
        ],
        [
            "^ \"Carmona Business Profile\".",
            "Archived from the original on February 25, 2017.",
            "Retrieved November 9, 2010."
        ],
        [
            "^ \"Municipal Mayors of Carmona\".",
            "Carmona.",
            "Retrieved April 29, 2015."
        ],
        [
            "^ Social Sector | Carmona Cavite, Philippines"
        ],
        [
            "^ Education"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Carmona, Cavite."
        ],
        [
            "Official website"
        ],
        [
            "Official website of Cavite"
        ],
        [
            "Places adjacent to Carmona, Cavite"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "Biñan, Laguna"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "Carmona"
        ],
        [
            "Biñan, Laguna"
        ],
        [
            "Silang"
        ],
        [
            "Articles related to Carmona, Cavite"
        ],
        [
            "vte Province of CaviteTrece Martires  (de facto capital), Imus  (de jure capital)  Dasmariñas (largest city)Municipalities"
        ],
        [
            "Alfonso"
        ],
        [
            "Amadeo"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "Indang"
        ],
        [
            "Kawit"
        ],
        [
            "Magallanes"
        ],
        [
            "Maragondon"
        ],
        [
            "Mendez"
        ],
        [
            "Naic"
        ],
        [
            "Noveleta"
        ],
        [
            "Rosario"
        ],
        [
            "Silang"
        ],
        [
            "Tanza"
        ],
        [
            "Ternate"
        ],
        [
            "Component cities"
        ],
        [
            "Bacoor"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Tagaytay"
        ],
        [
            "Trece Martires"
        ],
        [
            "vteCalabarzon (Region IV-A)CAvite, LAguna, BAtangas, Rizal, QueZONRegional center"
        ],
        [
            "Calamba"
        ],
        [
            "Provinces"
        ],
        [
            "Batangas"
        ],
        [
            "Cavite"
        ],
        [
            "Laguna"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Lucena"
        ],
        [
            "Component cities"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Batangas City"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "Calaca"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Lipa"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tanauan"
        ],
        [
            "Tayabas"
        ],
        [
            "Trece Martires"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Antipolo"
        ],
        [
            "Batangas City"
        ],
        [
            "Imus (de jure)"
        ],
        [
            "Lucena"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Trece Martires (de facto)"
        ],
        [
            "Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alabat"
        ],
        [
            "Alaminos"
        ],
        [
            "Alfonso"
        ],
        [
            "Alitagtag"
        ],
        [
            "Amadeo"
        ],
        [
            "Angono"
        ],
        [
            "Atimonan"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Baras"
        ],
        [
            "Bauan"
        ],
        [
            "Bay"
        ],
        [
            "Binangonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Cainta"
        ],
        [
            "Calatagan"
        ],
        [
            "Calauag"
        ],
        [
            "Calauan"
        ],
        [
            "Candelaria"
        ],
        [
            "Cardona"
        ],
        [
            "Catanauan"
        ],
        [
            "Cavinti"
        ],
        [
            "Cuenca"
        ],
        [
            "Dolores"
        ],
        [
            "Famy"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Luna"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Ibaan"
        ],
        [
            "Indang"
        ],
        [
            "Infanta"
        ],
        [
            "Jalajala"
        ],
        [
            "Jomalig"
        ],
        [
            "Kalayaan"
        ],
        [
            "Kawit"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Liliw"
        ],
        [
            "Lobo"
        ],
        [
            "Lopez"
        ],
        [
            "Los Baños"
        ],
        [
            "Lucban"
        ],
        [
            "Luisiana"
        ],
        [
            "Lumban"
        ],
        [
            "Mabini"
        ],
        [
            "Mabitac"
        ],
        [
            "Macalelon"
        ],
        [
            "Magallanes"
        ],
        [
            "Magdalena"
        ],
        [
            "Majayjay"
        ],
        [
            "Malvar"
        ],
        [
            "Maragondon"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Mauban"
        ],
        [
            "Mendez"
        ],
        [
            "Morong"
        ],
        [
            "Mulanay"
        ],
        [
            "Nagcarlan"
        ],
        [
            "Naic"
        ],
        [
            "Nasugbu"
        ],
        [
            "Noveleta"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Paete"
        ],
        [
            "Pagbilao"
        ],
        [
            "Pagsanjan"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pila"
        ],
        [
            "Pililla"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Rizal"
        ],
        [
            "Rodriguez"
        ],
        [
            "Rosario (Batangas)"
        ],
        [
            "Rosario (Cavite)"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Mateo"
        ],
        [
            "San Narciso"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Sariaya"
        ],
        [
            "Silang"
        ],
        [
            "Siniloan"
        ],
        [
            "Taal"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Talisay"
        ],
        [
            "Tanay"
        ],
        [
            "Tanza"
        ],
        [
            "Taysan"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Ternate"
        ],
        [
            "Tiaong"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "Unisan"
        ],
        [
            "Victoria"
        ],
        [
            "Barangays"
        ],
        [
            "Batangas (List)"
        ],
        [
            "Cavite (List)"
        ],
        [
            "Laguna (List)"
        ],
        [
            "Quezon (List)"
        ],
        [
            "Rizal (List)"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Carmona,_Cavite&oldid=1230035799\""
        ],
        [
            "Categories: Cities in CaviteComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasAll articles with dead external linksArticles with dead external links from November 2016Articles with permanently dead external linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataWikipedia articles with style issues from December 2020All articles with style issuesUse mdy dates from November 2022Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishArticles containing Tagalog-language textArticles containing Filipino-language textPages using infobox settlement with possible motto listCoordinates on WikidataPages with Tagalog IPACommons category link from WikidataOfficial website different in Wikidata and WikipediaArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}