{
    "name": "Carmen",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Carmen, Cotabato"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°12′N 124°47′E﻿ / ﻿7.2°N 124.78°E﻿ / 7.2; 124.78"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cotabato, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Carmen, Cotabato\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Soccsksargen, PhilippinesCarmenMunicipalityMunicipality of CarmenProvincial road"
        ],
        [
            "FlagSealMap of Cotabato with Carmen highlightedOpenStreetMapCarmenLocation within the PhilippinesCoordinates: 7°12′N 124°47′E﻿ / ﻿7.2°N 124.78°E﻿ / 7.2; 124.78CountryPhilippinesRegionSoccsksargenProvinceCotabatoDistrict"
        ],
        [
            "3rd districtFoundedNovember 15, 1956Barangays28"
        ],
        [
            " (see Barangays)Government  • TypeSangguniang Bayan • MayorRogelio T. Taliño • Vice MayorRoger Ryan J. Taliño • RepresentativeJose I. Tejada • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Alberto G. RiveraJaime P. SilladorDelfos A. ManampanBenjamin A. Patricio Jr.Anathy L. NaquitquitanArsenio D. ColagoJusto B. Saberola Jr.Elmer A. Badoy"
        ],
        [
            " • Electorate39,448 voters (2022)Area"
        ],
        [
            " • Revenue₱ 465 million (2020) • Assets₱ 1,023 million (2020) • Expenditure₱ 378.4 million (2020) • Liabilities₱ 153.7 million (2020)Service provider • ElectricityCotabato Electric Cooperative (COTELCO)Time zoneUTC+8 (PST)ZIP code9408PSGC124702000IDD : area code +63 (0)64Native languagesHiligaynon Cebuano Maguindanao Iranun TagalogWebsitewww.carmen-cotabatoprov.gov.ph"
        ],
        [
            "Carmen, officially the Municipality of Carmen (Hiligaynon: Banwa sang Carmen; Maguindanaon: Inged nu Karmin, Jawi: ايڠد نو كرمين; Cebuano: Lungsod sa Carmen; Tagalog: Bayan ng Carmen), is a 1st class municipality in the province of Cotabato, Philippines.",
            "According to the 2020 census, it has a population of 79,140 people."
        ],
        [
            "History"
        ],
        [
            "Carmen derived its name from surveyor del Carmen, chief of the Cadastral Survey Party, who in 1924 conducted a survey in the area.",
            "During the American period, Carmen and Kabacan belonged to one municipal district under Pikit.",
            "It was by virtue of Presidential Proclamation NO.",
            "46 and, was reinforced by Executive Order No.",
            "214 issued by the then President Ramon Magsaysay last November 15, 1956 when Carmen was created as a separate and distinct town of Kabacan."
        ],
        [
            "When created a municipality, it was composed of Thirty Eight (38) barangays.",
            "Ten barangays were either claimed or ceded to the two adjacent municipalities, Banisilan and President Roxas.",
            "Six by the municipality of Banisilan and four to the municipality of President Roxas.",
            "Now, only twenty eight (28) barangays remain in which are presently inhabited by the so-called Tri-people composed of the Christians, the Muslims and Indigenous Peoples belonging to the Manobo-Aromanon ethnic group."
        ],
        [
            "Before it was named Carmen, early inhabitants called this large tract of land \"Kalalaw\" a Maguindanaon term meaning \"jar of water\", because legend tells that there was once a big Balite tree with a continuous reservoir of water under its dense foliage, that even in long dry seasons, it had never dried up."
        ],
        [
            "Later on, when early settlers came and cultivated large portions of land in what is now the Poblacion, the whole place was unofficially called \"Landing\" because of the Landing Field reservation of approximately two hundred (200) hectares.",
            "The name \"Landing\" later on changed to Carmen in honor of del Carmen."
        ],
        [
            "The present Christian in this place are an immigrants from Luzon and Visayas.",
            "They are brought here by sheer pioneering spirit inspired by widespread rumors of this \"Land of Opportunity and Promise\".",
            "Their settlement started during the American regime.",
            "When the Americans launched their policy of attraction to the Muslims providing advanced technology, economic and educational advancement and the art of government.",
            "The first Christian settlers came from Cebu and established settlements at Pikit.",
            "Then adventurers followed them from Luzon and Visayas most notably the Ilongos and the Ilocanos who came in great numbers."
        ],
        [
            "The territory was reduced when, through Batas Pambansa Blg.",
            "141 of 1982, twelve barangays  were separated to create the municipality of Banisilan."
        ],
        [
            "Manili Massacre"
        ],
        [
            "Main article: Manili massacre"
        ],
        [
            "The Manili massacre refers to the mass murder of 70-79 Moro Muslims, including women and children, committed in a mosque in Manili, Carmen, on June 19, 1971.",
            "The Muslim residents of the town had gathered in their mosque to participate in a supposed peace talk with Christian groups when a group of armed men dressed in uniforms similar to those worn by members of the Philippine Constabulary opened fire on them."
        ],
        [
            "It was suspected that the Ilaga militant group were the attack's perpetrators, but there were also allegations that the Philippine Constabulary had collaborated with the Ilaga.",
            "No one was found culpable for the incident; Feliciano Lucas, also known as \"Commander Toothpick\", the Ilaga leader who was the prime suspect in the crime, was released after he \"surrendered\" to Ferdinand Marcos at the Malacañang Palace.",
            "The incident resulted in increased hostilities between Moro Muslims and Christians.",
            "In response to the incident, former Libyan leader Muammar Gaddafi provided military aid to the secessionist group Moro National Liberation Front."
        ],
        [
            "Partial inclusion to the Bangsamoro"
        ],
        [
            "In 2019, seven barangays were among the 63 in the province which became part of the Special Geographic Area of the newly-created Bangsamoro,"
        ],
        [
            "In 2023, the Bangsamoro Parliament approved the creation of eight new municipalities in the area."
        ],
        [
            "Geography"
        ],
        [
            "The Municipality of Carmen is geographically located at about the points 124.8 degrees east and 7.2 degrees north.",
            "It is bound on the north by the Province of Bukidnon, on the east by the municipalities of Pres.",
            "Roxas and Kabacan, on the south by the Province of Maguindanao, and on the west by the Municipality of Aleosan.",
            "It is embraced from the north-east, then east, then south by the Mulita and the Rio Grande rivers; from the north-west, then west, then south-west, by the Malitubog and Maridagao rivers.",
            "It is approximately 28 kilometers away from the capital town of Kidapawan."
        ],
        [
            "Barangays"
        ],
        [
            "Carmen is politically subdivided into 21 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Aroman"
        ],
        [
            "Bentangan"
        ],
        [
            "Cadiis"
        ],
        [
            "General Luna"
        ],
        [
            "Katanayanan"
        ],
        [
            "Kibenes"
        ],
        [
            "Kibudtongan"
        ],
        [
            "Kilala"
        ],
        [
            "Kimadzil"
        ],
        [
            "Lanoon"
        ],
        [
            "Liliongan"
        ],
        [
            "Lumayong"
        ],
        [
            "Macabenban"
        ],
        [
            "Malapag"
        ],
        [
            "Manili"
        ],
        [
            "Palanggalan"
        ],
        [
            "Poblacion"
        ],
        [
            "Ranzo"
        ],
        [
            "Tacupan"
        ],
        [
            "Tambad"
        ],
        [
            "Tonganon"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Carmen, Cotabato"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "38(1.5)"
        ],
        [
            "24(0.9)"
        ],
        [
            "29(1.1)"
        ],
        [
            "31(1.2)"
        ],
        [
            "50(2.0)"
        ],
        [
            "56(2.2)"
        ],
        [
            "52(2.0)"
        ],
        [
            "49(1.9)"
        ],
        [
            "39(1.5)"
        ],
        [
            "47(1.9)"
        ],
        [
            "54(2.1)"
        ],
        [
            "35(1.4)"
        ],
        [
            "504(19.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.1"
        ],
        [
            "7.5"
        ],
        [
            "10.0"
        ],
        [
            "11.5"
        ],
        [
            "19.7"
        ],
        [
            "20.8"
        ],
        [
            "19.4"
        ],
        [
            "18.5"
        ],
        [
            "16.3"
        ],
        [
            "18.5"
        ],
        [
            "18.4"
        ],
        [
            "12.8"
        ],
        [
            "183.5"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "The municipality has an average temperature of 28 °C (82 °F) with a mean maximum of 32 °C (90 °F) and mean minimum of 23 °C (73 °F).",
            "The coldest part of the year are the months of December, January and February while the hottest are the months of April, May, June, August, and September.",
            "It has two (2) distinct seasons, the wet and the dry seasons.",
            "The farming season starts in early June and ends in late November when the dry season begins.",
            "Typhoon is seldom felt in the area as it is located outside the typhoon belt.",
            "This condition is very suitable to nearly every type of productive agricultural activity."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CarmenYearPop.±% p.a.1918 1,686—    1939 5,727+6.00%1960 25,768+7.42%1970 42,840+5.21%1975 22,956−11.76%1980 35,895+9.35%1990 36,213+0.09%1995 40,261+2.01%2000 45,909+2.85%2007 65,670+5.06%2010 82,469+8.64%2015 95,921+2.92%2020 79,140−3.71%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Carmen, Cotabato, was 79,140 people, with a density of 71 inhabitants per square kilometre or 180 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Carmen"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  39.40"
        ],
        [
            "2009  50.41"
        ],
        [
            "2012  56.39"
        ],
        [
            "2015  52.33"
        ],
        [
            "2018  39.30"
        ],
        [
            "2021  40.55"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Since the municipality is an agricultural area, most of the industries are agri-based.",
            "Seven barangays have cono rice mills a barangay have kiskisan, 4 barangays have rubber roller mills.",
            "Total is 13 cono rice mill, 12 kiskisan and 5 rubber rollers.",
            "There is a bright prospect on cottage industries, which utilized raw materials like rattan and bamboo.",
            "Rattan craft in barangays Dado could possibly generate employment to its residents.",
            "The 40 hectares bamboo plantation at Barangay Guiling can provide fro raw materials to the bamboo craft at Kitacubong.",
            "This cottage industry is gaining support and acceptance from local residents considering the affordability and its unique qualities.",
            "Technology transfer and skills training have been conducted in the area.",
            "Its clients are the prospective entrepreneurs in rattan, bamboo and coconut crafts.",
            "Recipients of the training and development seminars are: RIC Camansi, Lower Dado, Pacao, Raradangan the DTI-CARP has establish a Multi-Purpose Hot dryer at Barangay Pacao, the said project generate employment and income from drying service.",
            "Barangay Parauran and Pacao could possibly support a fruit juice making industry, the 500 mango trees could adequately supplies for this industry."
        ],
        [
            "Natural resources"
        ],
        [
            "The commonly known minerals present in the municipality are sand and gravel which volume and potential are good sources for quarrying but which up to the present are mostly untapped.",
            "Other metallic substance of high commercial value are known to be present but these are still unexplored."
        ],
        [
            "Other resources present in the municipality are the large volume of limestone that can be processed into cement.",
            "Guano also abounds in numerous caves in the municipality such as in barangays Liliongan and Tonganon.",
            "Guano can be manufactured into fertilizers."
        ],
        [
            "Government"
        ],
        [
            "List of former chief executives"
        ],
        [
            "Dima Dalid (1968–1972)"
        ],
        [
            "Gonzalo O. Cuarenta (1992–1995)"
        ],
        [
            "Rogelio Taliño (1995–2007)"
        ],
        [
            "Noemi J. Taliño (2007–2010)"
        ],
        [
            "Rogelio T. Taliño (2010–2019)"
        ],
        [
            "Moises C. Arendain (2019–2022)"
        ],
        [
            "Tourism"
        ],
        [
            "Liliongan cave, a natural cave with beautiful stalactite and stalagmites formations inside underground creek and thick layer of guano could also be found inside the cave.",
            "It is located at Barangay Liliongan, Carmen."
        ],
        [
            "Kavurunan Festival celebrates the culture and tradition of the distinct Indigenous people (IP) of the different tribes located in the town of Carmen, Cotabato.",
            "The Festivals name is derived from the indigenous Manobo tribe word meaning \"gathering\".",
            "This festival also celebrates the coming together of the three ethnic groups located in the area which are the indigenous people, Christians, and Muslims."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Carmen |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Batas Pambansa Blg.",
            "141\".",
            "Legislative Digital Resources.",
            "Senate of the Philippines.",
            "February 8, 1982.",
            "Retrieved March 10, 2024."
        ],
        [
            "^ Cabrera, Ferdinandh (November 21, 2019).",
            "\"NorthCot turns over 63 barangays to Bangsamoro region\".",
            "MindaNews.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ Fonbuena, Carmela (February 8, 2019).",
            "\"63 out of 67 barangays in Cotabato to join Bangsamoro region\".",
            "Rappler.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ \"Proclamation No.",
            "656, s. 2019\".",
            "Legislative Digital Resources.",
            "Senate of the Philippines.",
            "January 21, 2019.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ Arguillas, Carolyn (January 14, 2019).",
            "\"67 villages in 7 North Cot towns will vote in Feb. 6 Bangsamoro plebiscite\".",
            "MindaNews.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ \"Republic Act No.",
            "11054\".",
            "Legislative Digital Resources.",
            "Senate of the Philippines.",
            "July 27, 2018.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ Fernandez, Edwin (August 18, 2023).",
            "\"BARMM approves creation of 8 new towns\".",
            "Philippine News Agency.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ Patinio, Ferdinand (March 4, 2024).",
            "\"Nearly 90K voters to join plebiscite on creation of 8 Cotabato towns\".",
            "Philippine News Agency.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ Medenilla, Samuel (April 10, 2024).",
            "\"Plebiscite for SGA in BARMM set April 13\".",
            "BusinessMirror.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ Patinio, Ferdinand (April 14, 2024).",
            "\"North Cotabato residents vote to create 8 municipalities in BARMM\".",
            "Philippine News Agency.",
            "Retrieved April 14, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: North Cotabato\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Carmen: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 30 January 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XII (Soccsksargen)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XII (Soccsksargen)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of North Cotabato\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ Total Population, Household Population, Number of Households, and Average Household Size by Region, Province, and City/Municipality: Philippines, 2020.",
            "PSA.",
            "23 March 2022."
        ],
        [
            "^ \"PSA Board Resolution No.",
            "13, Series of 2021: Approving and Adopting the Third Quarter 2021 Philippine Standard Geographic Code Updates to Include the Bangsamoro Autonomous Region in Muslim Mindanao (Barmm) and Correct the Names of 37 Barangays\" (PDF).",
            "Philippine Statistics Authority.",
            "2021.",
            "Retrieved April 1, 2022."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Carmen Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Carmen, Cotabato"
        ],
        [
            "Banisilan"
        ],
        [
            "Kadingilan, Bukidnon"
        ],
        [
            "Damulog, BukidnonPresident Roxas"
        ],
        [
            "Libungan"
        ],
        [
            "Carmen"
        ],
        [
            "AntipasMatalam"
        ],
        [
            "Aleosan"
        ],
        [
            "Pikit / Datu Montawal, Maguindanao"
        ],
        [
            "Kabacan"
        ],
        [
            "vte Province of CotabatoKidapawan (capital)Municipalities"
        ],
        [
            "Alamada"
        ],
        [
            "Aleosan"
        ],
        [
            "Antipas"
        ],
        [
            "Arakan"
        ],
        [
            "Banisilan"
        ],
        [
            "Carmen"
        ],
        [
            "Kabacan"
        ],
        [
            "Libungan"
        ],
        [
            "Magpet"
        ],
        [
            "Makilala"
        ],
        [
            "Matalam"
        ],
        [
            "Midsayap"
        ],
        [
            "M'lang"
        ],
        [
            "Pigcawayan"
        ],
        [
            "Pikit"
        ],
        [
            "President Roxas"
        ],
        [
            "Tulunan"
        ],
        [
            "Component city"
        ],
        [
            "Kidapawan"
        ],
        [
            "Related"
        ],
        [
            "Symbols"
        ],
        [
            "Special Geographic Area (part of Bangsamoro)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Carmen,_Cotabato&oldid=1233992590\""
        ],
        [
            "Categories: Municipalities of CotabatoPopulated places on the Rio Grande de MindanaoPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Maguindanaon-language textArticles containing Cebuano-language textArticles containing Tagalog-language textWikipedia articles needing clarification from June 2016All articles with unsourced statementsArticles with unsourced statements from August 2019Pages using the Kartographer extension"
        ]
    ]
}