{
    "name": "Catanauan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Catanauan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°35′30″N 122°19′30″E﻿ / ﻿13.5917°N 122.325°E﻿ / 13.5917; 122.325"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Quezon, Philippines"
        ],
        [
            "Municipality in Calabarzon, PhilippinesCatanauanMunicipalityMunicipality of CatanauanMunicipal Hall"
        ],
        [
            "FlagSealNickname: Heart of the Bondoc PeninsulaMap of Quezon with Catanauan highlightedOpenStreetMapCatanauanLocation within the PhilippinesCoordinates: 13°35′30″N 122°19′30″E﻿ / ﻿13.5917°N 122.325°E﻿ / 13.5917; 122.325CountryPhilippinesRegionCalabarzonProvinceQuezonDistrict"
        ],
        [
            "3rd districtFoundedJanuary 20, 1686Barangays46"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRamon A. Orfanel • Vice MayorManuel B. Montano • RepresentativeReynante U. Arrogancia • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Rodgie L. CasalRixon B. ComisoJohn B. de ImusMayla S. NatividadRodolfo B. PardillaGodofredo A. OrfanelEderlinda S. RamosAntonio Paterno A. Avila"
        ],
        [
            " • Electorate44,042 voters (2022)Area • Revenue₱ 259.7 million (2020) • Assets₱ 867.4 million (2020) • Expenditure₱ 225.2 million (2020) • Liabilities₱ 370.3 million (2020)Service provider • ElectricityQuezon 1 Electric Cooperative (QUEZELCO 1)Time zoneUTC+8 (PST)ZIP code4311PSGC045610000IDD : area code +63 (0)42Native languagesTagalogWebsitewww.catanauan.gov.ph"
        ],
        [
            "Catanauan, officially the Municipality of Catanauan (Tagalog: Bayan ng Catanauan),  is a 1st class municipality in the province of Quezon, Philippines.",
            "According to the 2020 census, it has a population of 72,752 people."
        ],
        [
            "History"
        ],
        [
            "The existence of Catanauan as a pueblo (town) was first recorded in the map of Father Pedro Murillo dated on 1734.",
            "The petition dated 1685 of Bishop Andres Gonzales of Nueva Caceres, now known as Naga City in the Bicol Region, requesting the king of Spain to have Masbater and the Pueblo of Catanauan assigned to Recollect Order was reflective of the early creation of Catanauan.",
            "The recognized foundation date of the Municipality was January 20, 1686."
        ],
        [
            "In the late 18th and 19th century, there were frequent Moro raids.",
            "These occurrences prompted the people to construct two small stone forts or watch towers (magkatanawan) mounted with artillery.",
            "Santa Maria watch tower was located at Lot 21 psc-2 near the present wharf is located.",
            "Castillo watch tower stood at the intersection of present Rizal and Boncan Street.",
            "Hence, the name Catanauan was so derived."
        ],
        [
            "Geography"
        ],
        [
            "The landscape of Catanauan is described as hilly, rolling and mountainous with isolated flat lands.",
            "The existing rivers and creeks serve as potential for effective drainage, more especially the Catanauan River.",
            "Catanuan has slopes ranging from 0–13% to 15% and above.",
            "The most elevated portion is at barangay San Jose which has a slope of 60% and greater.",
            "Susceptibility to erosion is directly proportional to the slope percentage and degree of susceptibility."
        ],
        [
            "Catanauan is 135 kilometres (84 mi) from Lucena and 265 kilometres (165 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Catanauan is politically subdivided into 46 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Ajos"
        ],
        [
            "Anusan"
        ],
        [
            "Barangay 1 (Poblacion)"
        ],
        [
            "Barangay 2 (Poblacion)"
        ],
        [
            "Barangay 3 (Poblacion)"
        ],
        [
            "Barangay 4 (Poblacion)"
        ],
        [
            "Barangay 5 (Poblacion)"
        ],
        [
            "Barangay 6 (Poblacion)"
        ],
        [
            "Barangay 7 (Poblacion)"
        ],
        [
            "Barangay 8 (Poblacion)"
        ],
        [
            "Barangay 9 (Poblacion)"
        ],
        [
            "Barangay 10(Poblacion)"
        ],
        [
            "Bolo"
        ],
        [
            "Bulagsong"
        ],
        [
            "Camandiison"
        ],
        [
            "Canculajao"
        ],
        [
            "Catumbo"
        ],
        [
            "Cawayanin Ibaba"
        ],
        [
            "Cawayanin Ilaya"
        ],
        [
            "Cutcutan"
        ],
        [
            "Dahican"
        ],
        [
            "Doongan Ibaba"
        ],
        [
            "Doongan Ilaya"
        ],
        [
            "Gatasan"
        ],
        [
            "Macpac"
        ],
        [
            "Madulao"
        ],
        [
            "Matandang Sabang Kanluran"
        ],
        [
            "Matandang Sabang Silangan"
        ],
        [
            "Milagrosa"
        ],
        [
            "Navitas"
        ],
        [
            "Pacabit"
        ],
        [
            "San Antonio Magcupa"
        ],
        [
            "San Antonio Pala"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Anyao)"
        ],
        [
            "San Pablo (Suha)"
        ],
        [
            "San Roque (Uoyon)"
        ],
        [
            "San Vicente Kanluran"
        ],
        [
            "San Vicente Silangan"
        ],
        [
            "Santa Maria (Dao)"
        ],
        [
            "Tagabas Ibaba"
        ],
        [
            "Tagabas Ilaya"
        ],
        [
            "Tagbacan Ibaba"
        ],
        [
            "Tagbacan Ilaya"
        ],
        [
            "Tagbacan Silangan"
        ],
        [
            "Tuhian"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Catanauan, Quezon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31(1.2)"
        ],
        [
            "23(0.9)"
        ],
        [
            "25(1.0)"
        ],
        [
            "30(1.2)"
        ],
        [
            "85(3.3)"
        ],
        [
            "145(5.7)"
        ],
        [
            "182(7.2)"
        ],
        [
            "153(6.0)"
        ],
        [
            "172(6.8)"
        ],
        [
            "150(5.9)"
        ],
        [
            "113(4.4)"
        ],
        [
            "68(2.7)"
        ],
        [
            "1,177(46.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.3"
        ],
        [
            "8.5"
        ],
        [
            "9.7"
        ],
        [
            "11.3"
        ],
        [
            "18.3"
        ],
        [
            "23.2"
        ],
        [
            "26.6"
        ],
        [
            "25.4"
        ],
        [
            "25.9"
        ],
        [
            "24.2"
        ],
        [
            "19.7"
        ],
        [
            "15.2"
        ],
        [
            "219.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally.)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CatanauanYearPop.±% p.a.1903 4,108—    1918 5,742+2.26%1939 10,416+2.88%1948 11,166+0.78%1960 17,168+3.65%1970 34,365+7.18%1975 38,473+2.29%1980 42,121+1.83%1990 48,019+1.32%1995 52,420+1.66%2000 57,736+2.09%2007 65,705+1.80%2010 65,832+0.07%2015 71,073+1.47%2020 72,752+0.46%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Catanauan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  50.00"
        ],
        [
            "2009  27.83"
        ],
        [
            "2012  30.58"
        ],
        [
            "2015  26.17"
        ],
        [
            "2018  11.34"
        ],
        [
            "2021  22.49"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "One of the major agricultural trades by the populace is copra buying and selling."
        ],
        [
            "Government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Elected officials"
        ],
        [
            "Mayor: Ramon A. Orfanel"
        ],
        [
            "Vice-Mayor: Manuel B. Montano"
        ],
        [
            "Municipal councilors:"
        ],
        [
            "Rodgie L. Casal"
        ],
        [
            "Rixon B. Comiso"
        ],
        [
            "John B. de Imus"
        ],
        [
            "Mayla S. Natividad"
        ],
        [
            "Mayla S. Natividad"
        ],
        [
            "Ederlinda SR. Ramos"
        ],
        [
            "Godofredo A. Orfanel"
        ],
        [
            "Ederlinda S. Ramos"
        ],
        [
            "Francisco Joseven Cañeda, PPLB President, Municipal Councilor"
        ],
        [
            "Rycamiel Natividad, SK President, Municipal Councilor"
        ],
        [
            "Security"
        ],
        [
            "Catanauan is one of the towns in Bondoc Peninsula where members of the NPA are active.",
            "Last February 21, 2017, an attempt to set a pay-loader on fire at a batching plant in barangay Cutcutan was thwarted thanks to the immediate response of the local police, the army and firemen."
        ],
        [
            "Culture"
        ],
        [
            "Town fiesta"
        ],
        [
            "December 8 - immaculate conception church town fiesta"
        ],
        [
            "Boling-Boling festival"
        ],
        [
            "Immaculate Conception Parish Church"
        ],
        [
            "\"Boling-Boling\" is an old age practice particular to Catanauanins, which is celebrated annually starting on the Sunday and ends on Tuesday preceding Ash Wednesday and signals the start of the Lenten Season.",
            "Participants roam around the town garbed in any costume they may fancy.",
            "Most of them wear colourful clown-like clothes while others imitate anybody whom they despise and make fun of them.",
            "It is the Pinoy version of carnival.",
            "No one can tell exactly when and how this practice started, not even the oldest resident of this town located at the heart of Bondoc Peninsula.",
            "Senior women wearing brightly coloured dresses and hats with flowers sing and dance from one house to another to solicit cash donations, half of which is given to the local Parish Church for its expenses during the Lenten Season activities and the other half for their own group's civic projects.",
            "Boling-Boling comes from the Visayan word Boling, which means dirt.",
            "This reminds us that we are sinners and that we need to repent, do some spiritual cleansing and get ourselves ready for the Lenten Season.",
            "In earlier times, Catanauanins had a grandiose merry-making during the Boling-Boling as, starting the following day, which is Ash Wednesday, they will keep silent suspending all merry-makings until the Black Saturday in reverence to the Lenten Season.",
            "Some men skimpily clad in their undergarments put on mud or grease with charcoal all over their bodies and roam around the town trying to scare young women and children for fun."
        ],
        [
            "Catanauan excavations"
        ],
        [
            "Catanauan, Quezon is a coastal third-class municipality of the western Bondoc Peninsula, with the municipality of Mulanay on its south and southeast.",
            "It has coordinates of 13° 35' 30\" N, 122° 19' 30\" E, and its town has a total land area of 266 kilometers.",
            "Catanauan has a population of 57, 736 people in 11, 283 households.",
            "(2000 Philippine Census).",
            "The town proper faces Mompog pass and Marinduque Island, and borders the municipality of General Luna in the north-west, the municipality of Buenavista in the north-east."
        ],
        [
            "The archaeological potential of Catanauan was brought to light in 2006 when Mr. Deo Cuerdo, citizen and cultural advocate of the municipality,  reported to the University of the Philippines Archaeological Studies Program (UP-ASP)  and the National Museum, cases of accidentally uncovered archaeological materials due to development projects, earthmoving activities, and even illegal diggings.",
            "The reported archaeological materials were mostly of jar burials.",
            "UP-ASP conducted a preliminary archaeological survey in 2008, and discovered three sites.",
            "Since then, there have been a total of 8 excavation seasons in 2008, 2010, 2011, 2012, 2013, 2014, 2015, 2016 and most recently in January 2017."
        ],
        [
            "Sites"
        ],
        [
            "In the Catanauan excavations, there were 4 main sites; Napa site locality 1, Napa site locality 4, Campo site, and Comiso site.",
            "Each contain their own distinct artifacts and discoveries."
        ],
        [
            "Napa Site Locality 1"
        ],
        [
            "Napa Site (Code IV-2008-Q5) was the primary excavation site, containing multiple trenches along with 3 main assemblages; SM1, SM2, and SM3, or “Stone Markers”.",
            "This is where most jar burials and tools were found."
        ],
        [
            "Napa Site Locality 4"
        ],
        [
            "Locality 4 is a second location close to locality 1 with four active trenches containing multiple jar burials in very tight clusters, along with coral markers and lids scattered throughout."
        ],
        [
            "Kampo Santo Site"
        ],
        [
            "This location, initially a 20th-century cemetery, was excavated with the hopes of discovering similar human remains, but unidentified markers were discovered, which purpose has not yet been determined."
        ],
        [
            "Comiso Property Sites"
        ],
        [
            "This survey site was one of the earliest to be excavated and surveyed.",
            "Located in Barangay Matandang Sabang Kanluran, this site was heavily stirred up and roiled by quarrying sand.",
            "It was later discovered that this was once also another burial site.",
            "Its similarities though to other burial sites remain unclear."
        ],
        [
            "Jar Burials"
        ],
        [
            "Catanauan, Quezon has been known for the numerous jar burials that have been recovered there.",
            "Even before the recent excavations in the site, locals have already reported that some jar burials in the site were uncovered through development projects, and that they were able to dig up a series of jar burials with human remains.",
            "As the site is very archaeologically rich, the Archaeological Studies Program of the University of the Philippines, Diliman and the Australia National University have been conducting research and excavations in Catanauan through the Catanauan Archaeological and Heritage Project since 2008."
        ],
        [
            "The Napa site in Barangay Tuhian, Catanauan is a very significant place for archaeological research.",
            "Most of the jar burials found in Catanauan were recovered from this site.",
            "In the 2008 excavation, a lot of jar burials with their human remains were found in Locality 1, Napa site, specifically in trenches 4 and 6.",
            "The jars found were mostly earthenware.",
            "Different types of coral slabs and rocks served as jar covers.",
            "The jars were used for primary and secondary burials.",
            "Paz, et al.",
            "(2008) inferred that people “went back to uncover the jars, take out the human remains in the jars, and when events dictated, a new body was placed in the old jar”.",
            "Some excavated jars were also used for child burials.",
            "Aside from human bones, different-colored glass beads, gastropods and fragments of metal were found inside the jars.",
            "Boat-shaped burial markers were also found in the site."
        ],
        [
            "In 2010, more jar burials have been recovered as additional trenches were opened.",
            "One very distinct jar was the jar found in Trench 13 because of its unique features.",
            "It was the only jar from the site which had earthenware as its cover (Paz, et al., 2010).",
            "It was oval-shaped and neonate remains were found inside it.",
            "Paz, et al.",
            "(2010) stated that as of 2010, there are 28 definite jar burials for the Napa site and they are at least a thousand years old."
        ],
        [
            "Comiso Property site is another jar burial site in Catanauan.",
            "It is less than 10 km away from the Napa site.",
            "Burial jar sherds and fragments of human remains were found on the surface of the site (Paz, et al., 2010).",
            "The jar burials were found under shell middens.",
            "However, unlike the jars in Napa site, there were no Chinese glass beads found in the Comiso site.",
            "This may mean that the Comiso site is older than the Napa site (Paz, et al., 2011)."
        ],
        [
            "Artifacts"
        ],
        [
            "Various artifacts have been excavated from Catanauan sites.",
            "These artifacts consists of burial jars, Earthenware sherds, skeletal remains, and shell middens."
        ],
        [
            "In 2006, a sand quarry accidentally uncovered at least 5 jar burials containing human skeletal remains in Kanlagkit, Barangay Matandang Sabang Kanluran.",
            "At least three sandpits were left partially open, with the backfill containing earthenware sherds and skeletal fragments (mostly long bone)."
        ],
        [
            "During the 2008 excavation a shell midden was exposed.",
            "The area where local inhabitants dug up burial jars with human remains was abundant in limestone slab fragments, earthenware sherds, and human skeletal fragments.",
            "Below the discovered shell midden were a few shells and pottery.",
            "Even below that, two small, well fired reddish earthenware pot sherds were found.",
            "Some glass beads were also found.",
            "A child (neonate) burial was found inside a small earthenware pot 40 cm in diameter, with yellow glass beads buried along with it.",
            "Another burial (a female, from studying the pelvic bone) was discovered, and this had sherds from a small pot and a cylindrical artifact."
        ],
        [
            "Catanauan Dagger"
        ],
        [
            "Archaeological digs by the Catanauan Archeological and Heritage Project (CAHP) have unearthed a unique iron dagger with an intricately carved bone hilt found at a jar burial site in the municipality facing Marinduque across the waters of the Mompog Pass.",
            "There is evidence that Catanauan's burial practices date back at least 2,000 years, making them part of an ancient Filipino funerary custom that has been found in the eastern part of the central Philippines.",
            "Large earthenware jars were buried along the sandy shores and covered with slabs of coralline or volcanic stone to preserve the bodies.",
            "Grave woods, either personal belongings or votive offerings for the afterlife, were buried alongside the deceased."
        ],
        [
            "It was found in a burial jar in Napa Site Locality 4 in 2017 during the CAHP's 9th field season, with the bone hilt in two pieces and four iron shards making up the blade.",
            "Many bone fragments were discovered under human remains.",
            "Another item found in the burial jar was an assortment of colored glass beads.",
            "The dagger blade measures 14 centimeters in length, and the finger-fitting hilt grip is composed of bone and organic material, likely wood, with alternating layers.",
            "These tiny holes, which might be used to attach accessories and even inlaid with the stated glass beads, make its ornamental, asymmetrical pommel end or hilt end stand out.",
            "Some believe that the pommel's design and carved features imply the shape of a boat."
        ],
        [
            "On May 18, 2022, the dagger is now on display at the National Museum of Natural History in Manila, Philippines, as part of the museum's collection of other artifacts."
        ],
        [
            "Heritage Work"
        ],
        [
            "To facilitate several forms of public archaeology and heritage work in the duration of the field season in the Napa site, crew members were oriented to always explain the significance of the archaeological project, at a community level and at larger scale of Philippine culture, to the community members and walk-in groups observing the excavation.",
            "The team also held day trips for student coming from different schools like San Isidro National High School - Catanauan, Tayuman National High School, Busdak National High School and ASTI College, mostly coming from near cities and/or provinces.",
            "In addition, they updated the tarpaulin signage at the Locality 1 site, Napa site, that explains the study of archaeology and highlights of the findings so far."
        ],
        [
            "The team also actively participated in the fiesta celebrations of Tuhian.",
            "As part of the celebration, the team is given a chance to explain to the public community what the project is all about.",
            "At the end of the season, the team mounted and left a three-panel exhibit of the results from the first season of excavation (2008).",
            "The exhibit explained what archaeology is, the findings and result of the project, and its significance to Philippine history and heritage.",
            "They made the exhibit movable so they can move it due to events and gatherings in the barangay."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Catanauan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Catanauan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved January 25, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Quezon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Mallari, Delfin T. Jr. \"NPA attempt to burn heavy equipment in Quezon foiled\".",
            "Philippine Daily Inquirer.",
            "Retrieved July 31, 2017."
        ],
        [
            "^ Mallari, Delfin T. Jr. \"NPA attempt to burn heavy equipment in Quezon foiled\".",
            "Philippine Daily Inquirer.",
            "Retrieved July 31, 2017."
        ],
        [
            "^ \"Catanauan Archaeological and Heritage Project\".",
            "catanauanproject.com.",
            "Archived from the original on June 9, 2015.",
            "Retrieved December 9, 2015."
        ],
        [
            "^ Paz; et al.",
            "(2008).",
            "\"The Catanauan Archaeological and Heritage Project : report on the excavation of Napa site, locality 1 and 2, Catanuan, Bondoc Peninsula, Quezon Province\".",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ Paz; et al.",
            "(2010).",
            "\"The Catanauan Archaeological and Heritage Project: Report on Excavation and Surveys, Catanauan, Bondoc Peninsula, Quezon Province\".",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ Paz; et al.",
            "(2011).",
            "\"The Catanauan Archaeological and Heritage Project: Report on the 3rd Excavation Season, Catanauan, Bondoc Peninsula, Quezon Province\".",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ Rallonza, Nico; Pineda, Anna; Cave, Christine; Knox, Elizabeth L. \"The Catanauam Archaeological and Heritage Project Report on the 4th Excavation, 2012\".",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ \"National Museum of the Philippines unveils 2,000-year-old Catanauan Dagger\".",
            "GMA News Online.",
            "Retrieved May 18, 2022."
        ],
        [
            "Sources"
        ],
        [
            "Paz, et al.",
            "(2008) The Catanauan Archaeological and Heritage Project : report on the excavation of Napa site, locality 1 and 2, Catanuan, Bondoc Peninsula, Quezon Province"
        ],
        [
            "Paz, et al.",
            "(2008)  Preliminary Archaeological Survey on the Municipality of Catanauan, Bondoc Peninsula, Quezon Province"
        ],
        [
            "Paz, et al.",
            "(2010) The Catanauan Archaeological and Heritage Project: Report on Excavation and Surveys, Catanauan, Bondoc Peninsula, Quezon Province"
        ],
        [
            "Paz, et al.",
            "(2011) The Catanauan Archaeological and Heritage Project: Report on the 3rd Excavation Season, Catanauan, Bondoc Peninsula, Quezon Province"
        ],
        [
            "Paz, et al.",
            "(2012) The Catanauan Archaeological and Heritage Project: Report on the 4th Excavation Season, Catanauan, Bondoc Peninsula, Quezon Province"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Catanauan."
        ],
        [
            "Catanauan Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Catanauan"
        ],
        [
            "General Luna"
        ],
        [
            "Lopez"
        ],
        [
            "Buenavista"
        ],
        [
            "Catanauan"
        ],
        [
            "Mongpong PassSanta Cruz, Marinduque"
        ],
        [
            "Mulanay"
        ],
        [
            "vte Province of QuezonLucena (capital and largest city)Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Alabat"
        ],
        [
            "Atimonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Calauag"
        ],
        [
            "Candelaria"
        ],
        [
            "Catanauan"
        ],
        [
            "Dolores"
        ],
        [
            "General Luna"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Infanta"
        ],
        [
            "Jomalig"
        ],
        [
            "Lopez"
        ],
        [
            "Lucban"
        ],
        [
            "Macalelon"
        ],
        [
            "Mauban"
        ],
        [
            "Mulanay"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagbilao"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Narciso"
        ],
        [
            "Sariaya"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Tiaong"
        ],
        [
            "Unisan"
        ],
        [
            "Component city"
        ],
        [
            "Tayabas"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Lucena (Administratively independent from the province but grouped under Quezon by the Philippine Statistics Authority.",
            "However, qualified voters of this city are still allowed to participate in the election of provincial officials as part of Quezon’s 2nd Sangguniang Panlalawigan district.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Catanauan&oldid=1227679948\""
        ],
        [
            "Categories: Populated places established in 1700Municipalities of Quezon1700 establishments in the Spanish EmpireHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listCS1 errors: missing periodicalArticles with short descriptionShort description is different from WikidataUse Philippine English from June 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from June 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}