{
    "name": "Claveria",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Claveria, Misamis Oriental"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°36′36″N 124°53′41″E﻿ / ﻿8.61°N 124.89472°E﻿ / 8.61; 124.89472"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Misamis Oriental, Philippines"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesClaveriaMunicipalityMunicipality of ClaveriaMount Sumagaya"
        ],
        [
            "FlagMap of Misamis Oriental with Claveria highlightedOpenStreetMapClaveriaLocation within the PhilippinesCoordinates: 8°36′36″N 124°53′41″E﻿ / ﻿8.61°N 124.89472°E﻿ / 8.61; 124.89472CountryPhilippinesRegionNorthern MindanaoProvinceMisamis OrientalDistrict"
        ],
        [
            "2nd districtFoundedJuly 22, 1950Barangays24"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMeraluna S. Abrogar • Vice MayorReynante L. Salvaleon • RepresentativeYevgeny Vincente B. Emano • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Cesar F. EscoroRicardo Richard C. dela CruzGerardo D. BarrosVerano V. CaabayMagdalena V. DumaluanAlfred A. AzcunaJoecard Y. DalmanMarcelo B. Dalen"
        ],
        [
            " • Electorate37,635 voters (2022)Area • Revenue₱ 68.46 million (2020) • Assets₱ 862.4 million (2020) • Expenditure₱ 278.7 million (2020) • Liabilities₱ 190.8 million (2020)Service provider • ElectricityMisamis Oriental 2 Rural Electric Cooperative (MORESCO 2)Time zoneUTC+8 (PST)ZIP code9004PSGC104306000IDD : area code +63 (0)88Native languagesCebuano Binukid Subanon TagalogWebsitewww.claveriamisor.gov.ph"
        ],
        [
            "Claveria, officially the Municipality of Claveria (Cebuano: Lungsod sa Claveria; Tagalog: Bayan ng Claveria), is a 1st class municipality in the province of Misamis Oriental, Philippines.",
            "According to the 2020 census, it has a population of 52,478 people."
        ],
        [
            "It is the only landlocked municipality of Misamis Oriental as well as the largest in terms of land area in the province."
        ],
        [
            "History"
        ],
        [
            "The town was once named Tikala, a native term for “wonder”.",
            "Tikala was once ruled by Datu Manlumupog, a warrior of the native aborigines known as the “Higaunons”, meaning people of the land.",
            "The Higaunons observed simple living but with high regard to nature.",
            "For them, the vast and rich environment they have means life to them and this is manifested by their unique datu system, e.g., Datu for Agriculture – Igbabasuk; Datu for Hunting – Panumanud; Datu for water respect – Bulalakaw, etc."
        ],
        [
            "Despite the simple way of life, they were kept united by their Sacred Code named as Bungkatel Ha Bulawan, which under its teaching, land is a gift from the supreme creator for all men, the Magbabaya.",
            "Land is life, thus, must be taken care of under the stewardship of the great, great-great ancestors whose spirits continue to keep watching over it so it could be used for generation to generation."
        ],
        [
            "In 1912, a Spanish Jesuit missionary and the curate of Jasaan named Fr.",
            "Juan Yras came over the place and renamed Tikala to Claveria in honor of the Spanish Governor-General of the Philippines Don Narciso Claveria y Zaldua."
        ],
        [
            "Politically, Claveria was under the Municipal District of the province of Bukidnon.",
            "Upon the passage of an Act No.",
            "2968, otherwise known as the Artadi Law, it was separated from Bukidnon and was ceded to the province of Misamis Oriental on February 21, 1921, under the administrative control of the Municipal District of Balingasag (MPDC LGU Claveria)."
        ],
        [
            "Claveria attained its stature as an independent municipality of the province of Misamis Oriental on July 22, 1950, by virtue of the Executive Order (E.O.)",
            "No.",
            "334 issued by then President Elpidio Quirino."
        ],
        [
            "On February 2, 1998, Cebu Pacific Flight 387 crashed on the slopes of Mount Sumagaya, a 2,248-meter mountain under the jurisdiction of Claveria.",
            "All 104 people aboard the plane were killed."
        ],
        [
            "Geography"
        ],
        [
            "It is bounded by a series of coastal towns and a component city.",
            "From Villanueva to Gingoog to the north, north-west, and west; Bukidnon to the south; and Agusan del Norte to the east.",
            "The municipality can be accessed via public transportation (Van-for-Hires, Jeepneys) from the province's capital, Cagayan de Oro.",
            "It will take an hour to commute to get in the town's Poblacion."
        ],
        [
            "Claveria is the largest among the 23 towns of Misamis Oriental comprising one-third of the total land area of the province.",
            "The current total land area of the municipality measures 825 km2 as per 2006 data reduced from its original of 894.90 km2 base from 1990 records.",
            "Territorial land dispute has been claimed by several neighboring areas such as the city of Gingoog, towns of Balingasag, Villanueva, Jasaan, and Malitbog of Bukidnon."
        ],
        [
            "Barangays"
        ],
        [
            "Claveria is politically subdivided into 24 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Ani-e"
        ],
        [
            "Aposkahoy"
        ],
        [
            "Bulahan"
        ],
        [
            "Cabacungan"
        ],
        [
            "D.G.",
            "Pelaez"
        ],
        [
            "Gumaod"
        ],
        [
            "Hinaplanan"
        ],
        [
            "Kalawitan"
        ],
        [
            "Lanise"
        ],
        [
            "Luna"
        ],
        [
            "Madaguing"
        ],
        [
            "Malagana"
        ],
        [
            "Minalwang"
        ],
        [
            "Mat-I"
        ],
        [
            "Panampawan"
        ],
        [
            "Parmbugas"
        ],
        [
            "Patrocinio"
        ],
        [
            "Plaridel"
        ],
        [
            "Poblacion"
        ],
        [
            "Punong"
        ],
        [
            "Rizal"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Tamboboan"
        ],
        [
            "Tipolohon"
        ],
        [
            "Topography"
        ],
        [
            "The town has a generally rugged topography, characterized by gently rolling hills and mountains with cliffs and escarpments.",
            "The soil is classified as Jasaan clay, with a deep soil profile (greater than 1 m) and rapid drainage.",
            "It is generally acidic (pH 3.9 to 5.2), with low cation exchange capacity (CEC), low to moderate organic matter content (1.8%), high aluminium saturation, and low levels of available phosphorus and exchangeable potassium."
        ],
        [
            "Climate"
        ],
        [
            "Claveria has a rainfall distribution of five or six wet months (>200 mm/month) and two or three dry months (<100 mm/month).",
            "Rainfall patterns throughout the municipality vary with elevation, with the upper areas having a relatively greater amount of rainfall than the lower areas.",
            "The rainfall pattern strongly influences cropping patterns and land use across Claveria's landscape.",
            "Naturally the town is the only municipality of the province which has a cooler temperature ranging below 22 degrees Celsius in as much as 16 degrees Celsius and lower in the higher areas."
        ],
        [
            "Climate data for Claveria, Misamis Oriental"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "327(12.9)"
        ],
        [
            "254(10.0)"
        ],
        [
            "185(7.3)"
        ],
        [
            "128(5.0)"
        ],
        [
            "215(8.5)"
        ],
        [
            "273(10.7)"
        ],
        [
            "248(9.8)"
        ],
        [
            "243(9.6)"
        ],
        [
            "214(8.4)"
        ],
        [
            "246(9.7)"
        ],
        [
            "271(10.7)"
        ],
        [
            "271(10.7)"
        ],
        [
            "2,875(113.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "24.3"
        ],
        [
            "21.1"
        ],
        [
            "22.5"
        ],
        [
            "20.6"
        ],
        [
            "28.3"
        ],
        [
            "28.8"
        ],
        [
            "29.4"
        ],
        [
            "29.0"
        ],
        [
            "28.0"
        ],
        [
            "28.3"
        ],
        [
            "26.0"
        ],
        [
            "24.2"
        ],
        [
            "310.5"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population"
        ],
        [
            "Population census of ClaveriaYearPop.±% p.a.1918 2,025—    1939 12,939+9.23%1948 26,330+8.21%1960 14,281−4.97%1970 16,816+1.65%1975 23,363+6.82%1980 29,088+4.48%YearPop.±% p.a.1990 31,130+0.68%1995 39,020+4.32%2000 41,109+1.12%2007 43,514+0.79%2010 44,544+0.86%2015 48,906+1.80%2020 52,478+1.40%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Claveria, Misamis Oriental, was 52,478 people, with a density of 91 inhabitants per square kilometre or 240 inhabitants per square mile."
        ],
        [
            "Population of Claveria by barangay"
        ],
        [
            "Name of Barangay"
        ],
        [
            "2007 census"
        ],
        [
            "2010 census"
        ],
        [
            "Ani-e"
        ],
        [
            "3,198"
        ],
        [
            "3,083"
        ],
        [
            "Aposkahoy"
        ],
        [
            "2,402"
        ],
        [
            "2,280"
        ],
        [
            "Bulahan"
        ],
        [
            "1,311"
        ],
        [
            "1,179"
        ],
        [
            "Cabacungan"
        ],
        [
            "1,308"
        ],
        [
            "1,398"
        ],
        [
            "Pelaez (Don Gregorio Pelaez)"
        ],
        [
            "862"
        ],
        [
            "912"
        ],
        [
            "Gumaod"
        ],
        [
            "1,248"
        ],
        [
            "1,384"
        ],
        [
            "Hinaplanan"
        ],
        [
            "2,857"
        ],
        [
            "2,930"
        ],
        [
            "Kalawitan"
        ],
        [
            "423"
        ],
        [
            "530"
        ],
        [
            "Lanise"
        ],
        [
            "2,087"
        ],
        [
            "2,071"
        ],
        [
            "Luna"
        ],
        [
            "1,519"
        ],
        [
            "1,506"
        ],
        [
            "Madaguing"
        ],
        [
            "901"
        ],
        [
            "952"
        ],
        [
            "Malagana"
        ],
        [
            "2,157"
        ],
        [
            "2,346"
        ],
        [
            "Minalwang"
        ],
        [
            "1,722"
        ],
        [
            "1,578"
        ],
        [
            "Mat-i"
        ],
        [
            "3,074"
        ],
        [
            "3,223"
        ],
        [
            "Panampawan"
        ],
        [
            "630"
        ],
        [
            "678"
        ],
        [
            "Pambugas"
        ],
        [
            "765"
        ],
        [
            "812"
        ],
        [
            "Patrocinio"
        ],
        [
            "3,084"
        ],
        [
            "2,870"
        ],
        [
            "Plaridel"
        ],
        [
            "1,592"
        ],
        [
            "1,601"
        ],
        [
            "Poblacion"
        ],
        [
            "7,685"
        ],
        [
            "8,747"
        ],
        [
            "Punong"
        ],
        [
            "504"
        ],
        [
            "598"
        ],
        [
            "Rizal"
        ],
        [
            "974"
        ],
        [
            "932"
        ],
        [
            "Santa Cruz"
        ],
        [
            "1,179"
        ],
        [
            "1,129"
        ],
        [
            "Tamboboan"
        ],
        [
            "1,278"
        ],
        [
            "1,129"
        ],
        [
            "Tipolohon"
        ],
        [
            "704"
        ],
        [
            "637"
        ],
        [
            "Total"
        ],
        [
            "43,514"
        ],
        [
            "44,544"
        ],
        [
            "Ethnicities and language"
        ],
        [
            "Although the original inhabitants of Claveria are the indigenous Higaonons, most of its inhabitants are descendants of Visayans mainly from Cebu and Bohol who migrated long before the Spaniards arrived.",
            "Other residents of the municipality include Bicolanos, Ilocanos, Ivatans, Kapampangans, Pangasinans and Tagalogs from Luzon and Hiligaynons and Warays from Visayas, including their descendants."
        ],
        [
            "Although Cebuano or Binisaya/Bisaya is widely spoken in Claveria, majority of the population can speak Filipino the national language and as well as English which is commonly use in schools and government offices.",
            "There is a native tribe in the municipality that has their own dialect, the Higaonons which also speaks their \"Binukid\" tongue or Higaonon language.",
            "Binisaya/Bisaya is the conversational language spoken by Claverians at home.",
            "Other languages spoken are Ilocano, Ivatan, Kapampangan and Hiligaynon, to varying degrees by their respective communities within the municipality."
        ],
        [
            "Religion"
        ],
        [
            "Approximately over 85% of the populace are Roman Catholics and the rest comprises the Protestants and others.",
            "Every barangay has their own Catholic parish churches with one in Poblacion serves as the mother parish for the entire town.",
            "The Our Lady of Lourdes Parish church is the center of Catholic faith within the municipality.",
            "There is also a notable group situated in Barangay Aposkahoy known as Doalnara which is a community of people who has their own belief making the talk abouts among the locals.",
            "It has been controversial in the past years due to its peculiar way of living among its followers.",
            "Although the town's community has various religious beliefs, people all live peacefully and harmoniously altogether."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Claveria"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  46.10"
        ],
        [
            "2009  57.07"
        ],
        [
            "2012  39.08"
        ],
        [
            "2015  44.02"
        ],
        [
            "2018  22.10"
        ],
        [
            "2021  30.08"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The local economy is mainly an agricultural area.",
            "Its income basically comes from crop production, freshwater products, and livestock or poultry output.",
            "Crop production includes vegetables, corn, root crops, coffee, and rice.",
            "The plantation of tomato and bell pepper is a common site in the vicinity."
        ],
        [
            "Government"
        ],
        [
            "Municipal Hall Facade"
        ],
        [
            "The municipality of Claveria is governed by a town Mayor and a Vice Mayor which takes office in absence of the former.",
            "The municipal council is compose of 8 coming from the town, 1 from the president of the Barangay Captain's League and 1 from the president of Sangguniang Kabataan (Youth Council) Chairman's League of Claveria totalling a number of 10 councilors (kagawad)."
        ],
        [
            "Education"
        ],
        [
            "The town is the seat of the premier agriculture school of the entire province, the University of Science and Technology of Southern Philippines – Claveria Campus (formerly MOSCAT).",
            "Claveria has a total of 7 National High Schools and 2 Central Schools.",
            "All 24 barangays has its own Elementary School.",
            "There are also privately run pre-schools, grade schools, and secondary school operating in the municipality."
        ],
        [
            "Private Schools"
        ],
        [
            "University of Science and Technology of Southern Philippines - Claveria Campus"
        ],
        [
            "Our Lady of Lourdes Academy of Claveria"
        ],
        [
            "Cherubims Learning Center Inc."
        ],
        [
            "Doalnara Agricultural Academy"
        ],
        [
            "Central Schools"
        ],
        [
            "Claveria Central School"
        ],
        [
            "Mat-i Central School"
        ],
        [
            "Public Secondary Schools"
        ],
        [
            "Mat-i National High School"
        ],
        [
            "Aposkahoy National High School"
        ],
        [
            "Rizal National High School"
        ],
        [
            "Hinaplanan National High School"
        ],
        [
            "Malagana National High School"
        ],
        [
            "Patrocinio National High School"
        ],
        [
            "Dr. Gerardo Sabal Memorial National High School"
        ],
        [
            "Tertiary"
        ],
        [
            "University of Science and Technology of Southern Philippines (USTsP) - Claveria Campus"
        ],
        [
            "Notable personalities"
        ],
        [
            "Aquilino Pimentel Jr."
        ],
        [
            "Aquilino Pimentel Jr. - commonly known as Nene Pimentel, is a Filipino politician who served as the President of the Senate of the Philippines from 2000 to 2001.",
            "He is the father of former Senate President Aquilino Pimentel III."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Claveria |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c Claveria's Climate Research Archives"
        ],
        [
            "^"
        ],
        [
            "\"Claveria: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Misamis Oriental\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Mindanao Silk Mulberry Farm"
        ],
        [
            "^ \"State College\".",
            "Archived from the original on 2008-01-20.",
            "Retrieved 2019-07-04."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Claveria, Misamis Oriental."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Claveria, Misamis Oriental"
        ],
        [
            "Salay"
        ],
        [
            "Balingoan / Medina / Gingoog"
        ],
        [
            "Buenavista, Agusan del Norte"
        ],
        [
            "LagonglongBalingasagJasaan"
        ],
        [
            "Claveria"
        ],
        [
            "Las Nieves, Agusan del Norte"
        ],
        [
            "Villanueva"
        ],
        [
            "Malitbog, Bukidnon / Impasugong, Bukidnon"
        ],
        [
            "Esperanza, Agusan del Sur"
        ],
        [
            "vte Province of Misamis OrientalCagayan de Oro (capital and largest city)Municipalities"
        ],
        [
            "Alubijid"
        ],
        [
            "Balingasag"
        ],
        [
            "Balingoan"
        ],
        [
            "Binuangan"
        ],
        [
            "Claveria"
        ],
        [
            "Gitagum"
        ],
        [
            "Initao"
        ],
        [
            "Jasaan"
        ],
        [
            "Kinoguitan"
        ],
        [
            "Lagonglong"
        ],
        [
            "Laguindingan"
        ],
        [
            "Libertad"
        ],
        [
            "Lugait"
        ],
        [
            "Magsaysay"
        ],
        [
            "Manticao"
        ],
        [
            "Medina"
        ],
        [
            "Naawan"
        ],
        [
            "Opol"
        ],
        [
            "Salay"
        ],
        [
            "Sugbongcogon"
        ],
        [
            "Tagoloan"
        ],
        [
            "Talisayan"
        ],
        [
            "Villanueva"
        ],
        [
            "Component cities"
        ],
        [
            "El Salvador"
        ],
        [
            "Gingoog"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Cagayan de Oro (Administratively independent from the province but grouped under Misamis Oriental by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Claveria,_Misamis_Oriental&oldid=1232358347\""
        ],
        [
            "Categories: Municipalities of Misamis OrientalPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}