{
    "name": "Compostela",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Compostela, Davao de Oro"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°40′N 126°05′E﻿ / ﻿7.67°N 126.08°E﻿ / 7.67; 126.08"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Davao de Oro, Philippines"
        ],
        [
            "Municipality in Davao Region, PhilippinesCompostelaMunicipalityMunicipality of Compostela"
        ],
        [
            "FlagEtymology: Campus Stellae (i.e., \"field of the stars\")Map of Davao de Oro with Compostela highlightedOpenStreetMapCompostelaLocation within the PhilippinesCoordinates: 7°40′N 126°05′E﻿ / ﻿7.67°N 126.08°E﻿ / 7.67; 126.08CountryPhilippinesRegionDavao RegionProvinceDavao de OroDistrict"
        ],
        [
            "1st districtFoundedAugust 1, 1948Barangays16"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 300.8 million (2020) • Assets₱ 866.3 million (2020) • Expenditure₱ 315.2 million (2020) • Liabilities₱ 315.9 million (2020)Service provider • ElectricityDavao del Norte Electric Cooperative (DANECO)Time zoneUTC+8 (PST)ZIP code8803PSGC118201000IDD : area code +63 (0)87Native languagesDavawenyo Cebuano Kalagan Mansaka Ata Manobo TagalogWebsitewww.compostela.gov.ph"
        ],
        [
            "Compostela, officially the Municipality of Compostela (Cebuano: Lungsod sa Compostela; Tagalog: Bayan ng Compostela), is a 1st class municipality in the province of Davao de Oro, Philippines.",
            "According to the 2020 census, it has a population of 89,884 people."
        ],
        [
            "Etymology"
        ],
        [
            "There are no written records as to how Compostela got its name.",
            "Folklore tells that the area was a temporary Spanish settlement, a Campo de Castila (literally, \"Field of Spaniards\") populated by Spaniards from what is now Davao Oriental.",
            "Another legend holds that a Spanish friar from the eastern coasts of Mindanao came to the place, bringing with him a statue of Saint James the Apostle, patron of his native Santiago de Compostela in Spain.",
            "The priest then christened the region after his own birthplace.."
        ],
        [
            "History"
        ],
        [
            "Compostela is one of several towns sitting on the vast plains of Davao de Oro.",
            "Its development started before World War II, when the area was still a forest and the only inhabitants were indigenous Mandayas who chose to settle along the Agusan River."
        ],
        [
            "Before the outbreak of World War II, the area in what is now the province which the town of Compostela currently belongs was one of the Bureau of Non-Christian Tribes for Mindanao.",
            "Its office was based at Dansalan, Lanao under the directorship of Teofisto Guingona, Sr., who was then exercising government control over provinces and municipal districts of Mindanao.",
            "However, the bureau was abolished right after the war.",
            "The valley was then formed into Compostela-Monkayo Districts and subdivided into three small districts: Monkayo, Compostela and Camansa.",
            "Compostela was governed by Mr. Bonifacio Garcia as the District Mayor appointed by the Governor of Davao which during that time was still one province with the capitol at Davao City.",
            "Local government functions were performed by the governor and the district mayors were only ceremonial leaders."
        ],
        [
            "Road construction of the Davao-Agusan National Highway extended up to Camp Kalaw, a Philippine Constabulary detachment located at what is now the town of Monkayo.",
            "Compostela Proper, then the popular name of Compostela, was accessible via Agusan River with embarkation at Kilometer 106 (now Barangay Bankerohan Sur of Montevista).",
            "Settlers from Luzon and the Visayas started to settle in Compostela, lured by a promise of vast agricultural lands so fertile and rich if you are determined and able-bodied.",
            "That was in 1939 and some of those who came to settle in Compostela to tame the wilderness are the Garcia's of Talibon, Bohol; the Galenzoga's of Baybay, Leyte; the Maquilan's of Mandawe, Cebu; the Regaña's of Samar; the Estrada's of Luzon and the Bayubay's of Ilocos.",
            "These pioneers lived in harmony with the native Mandayas; among them were the Blanco's, the Manzanares', the Braose's, the Adao's and the Fabian's.",
            "Third generation of both these pioneers and natives are still in Compostela today."
        ],
        [
            "When World War II in the country broke out in 1942, most of the people evacuated to hinterlands of the valley leaving their farms behind.",
            "Also at this time, the Philippine Civil Assistance Unit (PCAU) established a civil government at Kilometer 90, now Nabunturan, and installed Juanito Regaña as the Municipal District Mayor of Compostela."
        ],
        [
            "After the war in 1945, the people came back to their farms which now became a virtual forest.",
            "Those who came back again tilled the soil and settled permanently in the place.",
            "Also during these times, Governor Antonio Lanzar appointed Mr. Formoso Piansay as Municipal District Mayor of Compostela."
        ],
        [
            "On August 1, 1948, an Executive Order No.",
            "156 was signed by then President Elpidio Quirino, organizing into four regular municipalities under the names of Compostela, New Leyte, Gov.",
            "Generoso and Trinidad, and the Municipal Districts of Compostela, Moncayo, Saug, Camansa, Surup, Sigaboy, Batulaki and Caburan, all in the Province of Davao, was soon made defunct and were either made, or joined, into regular municipalities."
        ],
        [
            "In 1949, all municipal districts were abolished thus paving a way for the creation of new municipalities and Compostela with the seat of government at Km.",
            "90 became a regular municipality with Mayor Lauro Arabejo as the appointed mayor.",
            "Compostela Proper then was only a barrio of the original Compostela municipality.",
            "It is accessible by boat powered by outboard motors that ply from Compostela Proper to Km.",
            "106 via Agusan River.",
            "From Km.",
            "106, people go to the government center at km.",
            "90 Nabunturan by hiking or riding."
        ],
        [
            "Then in the early 1950s, road construction going to Compostela Proper started via km.",
            "102 which is now Montevista.",
            "One of the engineers of the Bureau of Public Highways was Engineer Prospero S. Amatong."
        ],
        [
            "In 1955, the barrio (barangay) of New Sabonga was transferred to this town from Asuncion."
        ],
        [
            "On June 23, 1957, then President Carlos P. Garcia signed Republic Act No.",
            "2038 which separated Compostela from Nabunturan.",
            "The first Mayor appointed by President Carlos P. Garcia was then Mayor Pio P. Galenzoga, one of the pioneer settlers."
        ],
        [
            "In the same year the sitios of Kao, Magkagong, Margosan, Matilo, Magangit, Cabacungan, Tigbatinao and Camanlangan were constituted into a barrio known as Santo Niño."
        ],
        [
            "At the time, Compostela was an incongruous mixture of wooden-roofed houses concentrated along the Agusan River which was properly known as \"dungguanan\" (embarkation).",
            "This area later became its center of trade and commerce or Poblacion."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Compostela is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Bagongon"
        ],
        [
            "Gabi"
        ],
        [
            "Lagab"
        ],
        [
            "Mangayon"
        ],
        [
            "Mapaca"
        ],
        [
            "Maparat"
        ],
        [
            "New Alegria"
        ],
        [
            "Ngan"
        ],
        [
            "Osmeña"
        ],
        [
            "Panansalan"
        ],
        [
            "Poblacion"
        ],
        [
            "San Jose"
        ],
        [
            "San Miguel"
        ],
        [
            "Siocon"
        ],
        [
            "Tamia"
        ],
        [
            "Aurora"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Compostela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "160(6.3)"
        ],
        [
            "127(5.0)"
        ],
        [
            "96(3.8)"
        ],
        [
            "62(2.4)"
        ],
        [
            "141(5.6)"
        ],
        [
            "197(7.8)"
        ],
        [
            "185(7.3)"
        ],
        [
            "186(7.3)"
        ],
        [
            "183(7.2)"
        ],
        [
            "181(7.1)"
        ],
        [
            "128(5.0)"
        ],
        [
            "111(4.4)"
        ],
        [
            "1,757(69.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "20.0"
        ],
        [
            "17.2"
        ],
        [
            "15.9"
        ],
        [
            "13.9"
        ],
        [
            "23.8"
        ],
        [
            "27.2"
        ],
        [
            "28.1"
        ],
        [
            "28.2"
        ],
        [
            "27.0"
        ],
        [
            "27.0"
        ],
        [
            "21.3"
        ],
        [
            "18.7"
        ],
        [
            "268.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CompostelaYearPop.±% p.a.1939 2,716—    1948 9,649+15.13%1960 20,444+6.46%1970 17,159−1.73%1975 23,084+6.13%1980 30,538+5.75%1990 53,546+5.78%1995 55,030+0.51%2000 61,667+2.47%2007 69,849+1.73%2010 81,934+5.98%2015 87,474+1.25%2020 89,884+0.54%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Compostela was 89,884 people, with a density of 310 inhabitants per square kilometre or 800 inhabitants per square mile."
        ],
        [
            "Population"
        ],
        [
            "The first record of municipality's population enumerated in census was in 1939 with a total population of 2,716.",
            "Compostela then was still a municipal district composed of municipalities of the district."
        ],
        [
            "By virtue of Executive Order 156 issued by President Elpidio Quirino, Compostela officially became a municipality on August 1, 1948."
        ],
        [
            "In 1960, the municipality's recorded population was 20,444.",
            "This was attributed to the fact that the municipality started to emerge and the influx of settlers from all over the country flocked to the municipality owing to its vast land.",
            "Another factor that contributed to this population was the logging operation of Valderrama Lumber Manufacturers Co., Incorporated."
        ],
        [
            "In 1970, the population of the town declined by -3,285 or -16.07 percent.",
            "This was attributed by the creation of the Municipality of New Bataan into a municipality taken from Compostela in 1966."
        ],
        [
            "Apparently, the biggest increase in population of the municipality was in 1990 with a registered population of 53,546.",
            "There was an increase of 23,008 or 75.34 percent from the 1980s population.",
            "This remarkable increase was attributed by the thousands of gold prospectors flocked to Compostela when gold deposits was discovered in Sitios Kantigbao, Mambusao, Pulang-lupa and Bango of Barangay Ngan in 1983 to 1988."
        ],
        [
            "In 1995, only 1,484 or 2.77 percent increase was recorded with an average growth rate of 0.55 percent."
        ],
        [
            "During the 1990 census, the municipality's population grew up to 61,667, posting an increase of 6,637 persons or 12.06 percent over the 1990 figure."
        ],
        [
            "Urban-Rural Distribution/Density"
        ],
        [
            "As of the 2010 census, Barangay Poblacion, being the only urban barangay, has the highest number of population among the sixteen (16) barangays of Compostela with 26,773 or 32.7 percent of the municipality's total population; it is followed by Barangay Ngan (9.4 percent) and Barangay San Miguel (9.0 percent).",
            "Barangay Panansalan, on the other hand, Barangay is the least populated barangay with 906 people of 1.1 percent to the total population."
        ],
        [
            "Poblacion, the most inhabited barangay has a population density of 52.0 persons per hectare, and Tamia, on the other hand, is the least densely populated barangay with 0.73 persons per hectare."
        ],
        [
            "Sex Distribution/Composition"
        ],
        [
            "In 2000, males outnumbered females with a sex ratio of 106.26 males for every 100 females.",
            "Males dominated the age group 79 years and below while females in the age group 80 and over."
        ],
        [
            "Age group 5 to 9 dominated the municipality's total population with 14.34 percent share to the population.",
            "This is followed by age group 10–14 with 13.72 percent and then by those aged 15–19 years with 11.01 percent."
        ],
        [
            "Marital Status"
        ],
        [
            "Out of 45,010 household population 10 years old and over, 45.23 percent were single; 44.97 percent were married; 3.32 percent were widowed; 0.78 percent were separated; and those with other marital arrangements registered at 5.70 percent."
        ],
        [
            "Single males prevailed over single females (55.47 percent), married (50.03 percent), separated (50.14 percent), and among those with other marital arrangements (50.95 percent).",
            "On contrary, most of the widowed were females (72.26 percent)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Compostela"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  31.70"
        ],
        [
            "2009  26.54"
        ],
        [
            "2012  27.03"
        ],
        [
            "2015  27.61"
        ],
        [
            "2018  25.25"
        ],
        [
            "2021  17.18"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Since its establishment the town slowly rose from a backward infant municipality into one of the progressive towns of the valley.",
            "Its vast flat lands become the major rice production area of Davao Province when the National Irrigation Administration-Asian Development Bank (NIA-ADB) constructed an irrigation system in the early part of 1970 that serve the south-western portion of the municipality.",
            "Also, cavendish bananas are produced here by the Ayala Conglomerate and Multi-National Dole (Stanfilco), Philippines, Incorporated.",
            "But its progress is owed much to the spirit of the people who came and stayed in Compostela.",
            "The realization of their dream is discerned today of the bustling urban center that can boast of modern amenities and updated educational centers."
        ],
        [
            "Local government"
        ],
        [
            "Elected officials 2022-2025:"
        ],
        [
            "Municipal Mayor: Levi S. Ebdao"
        ],
        [
            "Municipal Vice- Mayor:  Ricky P. Hechanova"
        ],
        [
            "Council members:"
        ],
        [
            "Jase Karl M. Ang"
        ],
        [
            "Engr.",
            "Alan M. Calalas"
        ],
        [
            "Danielo B. Pelegrino"
        ],
        [
            "Engr.",
            "Elmer Paul Bangcasan"
        ],
        [
            "Haidee C. Suarez-Jimenez"
        ],
        [
            "Harry Cabiling"
        ],
        [
            "Juric G. Blanco"
        ],
        [
            "Rogelio Econar"
        ],
        [
            "Gil P. Blanco - Indigenous People's Representative"
        ],
        [
            "Mylene P. Bacote - SKMF President"
        ],
        [
            "Lolito C. Pavia - Liga Ng Mga Barangay President (OIC)"
        ],
        [
            "Education"
        ],
        [
            "Colleges:"
        ],
        [
            "Legacy College of Compostela (LCC)"
        ],
        [
            "Davao de Oro State College (DDOSC), formerly Compostela Valley State College"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Compostela |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Making the Barrio of New Sabonga in the Municipality of Saug, Province of Davao, As a Part of the Municipality of Compostela of the Same Province\".",
            "LawPH.com.",
            "Archived from the original on 2012-07-22.",
            "Retrieved 2011-04-11."
        ],
        [
            "^ \"An Act Dividing the Municipality of Compostela, Province of Davao, into Two Municipalities, One to Retain the Name \"Compostela,\" and the Other to Be Known As the Municipality of Nabunturan\".",
            "LawPH.com.",
            "Retrieved 2011-04-11."
        ],
        [
            "^ \"An Act Creating the Barrio of Santo Niño, Municipality of Compostela, Province of Davao\".",
            "LawPH.com.",
            "Retrieved 2011-04-12."
        ],
        [
            "^"
        ],
        [
            "\"Province: Compostela Valley\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Compostela: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 16 November 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region XI (Davao Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XI (Davao Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Compostela Valley\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"List of Elected City/Municipal Candidates\" (PDF).",
            "Intramuros, Manila, Philippines: Commission on Elections (COMELEC).",
            "13 May 2019.",
            "Retrieved 26 February 2020."
        ],
        [
            "External links"
        ],
        [
            "Compostela Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Compostela, Davao de Oro"
        ],
        [
            "Montevista"
        ],
        [
            "Monkayo"
        ],
        [
            "Cateel, Davao Oriental"
        ],
        [
            "Compostela"
        ],
        [
            "Nabunturan"
        ],
        [
            "New Bataan"
        ],
        [
            "Baganga, Davao Oriental"
        ],
        [
            "vte Province of Davao de OroNabunturan (capital)  Monkayo (largest municipality)Municipalities"
        ],
        [
            "Compostela"
        ],
        [
            "Laak"
        ],
        [
            "Mabini"
        ],
        [
            "Maco"
        ],
        [
            "Maragusan"
        ],
        [
            "Mawab"
        ],
        [
            "Monkayo"
        ],
        [
            "Montevista"
        ],
        [
            "Nabunturan"
        ],
        [
            "New Bataan"
        ],
        [
            "Pantukan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Compostela,_Davao_de_Oro&oldid=1194739174\""
        ],
        [
            "Categories: Municipalities of Davao de OroPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from June 2016Pages using the Kartographer extension"
        ]
    ]
}