{
    "name": "Corcuera",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Corcuera"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsनेपालीनेपाल भाषाPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°48′N 122°03′E﻿ / ﻿12.8°N 122.05°E﻿ / 12.8; 122.05"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Romblon, Philippines"
        ],
        [
            "For the surname, see Corcuera (surname)."
        ],
        [
            "Municipality in Mimaropa, PhilippinesCorcueraMunicipalityMunicipality of CorcueraCorcuera, Romblon as seen from Banton, Romblon"
        ],
        [
            "FlagMap of Romblon with Corcuera highlightedOpenStreetMapCorcueraLocation within the PhilippinesCoordinates: 12°48′N 122°03′E﻿ / ﻿12.8°N 122.05°E﻿ / 12.8; 122.05CountryPhilippinesRegionMimaropaProvinceRomblonDistrict"
        ],
        [
            "Lone districtFounded1574Named forSebastián Hurtado de CorcueraBarangays15"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 64.37 million (2020) • Assets₱ 185.3 million (2020) • Expenditure₱ 50.5 million (2020) • Liabilities₱ 26.45 million (2020)Service provider • ElectricityRomblon Electric Cooperative (ROMELCO)Time zoneUTC+8 (PST)ZIP code5514PSGC1705906000IDD : area code +63 (0)42Native languagesBantoanon TagalogPatron saintSaint Joseph of Workers"
        ],
        [
            "Corcuera, officially the Municipality of Corcuera (Asi: Banwa it Corcuera, Filipino: Bayan ng Corcuera), is a 5th class municipality in the province of Romblon, Philippines.",
            "According to the 2020 census, it has a population of 10,112 people."
        ],
        [
            "Encompassing the entirety of Simara Island, the municipality is named after the Spanish governor-general Sebastián Hurtado de Corcuera who ruled the Philippines from 1635 to 1644 on behalf of King Philip IV of Spain."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "The island's name, Simara, was derived from the local word sima, meaning \"hook\", which refers to how the island looks like."
        ],
        [
            "Modern history"
        ],
        [
            "Aerial view of Corcuera Point, Simara Island, 1935"
        ],
        [
            "The first Justice of Peace was Liborio Fabiala.",
            "He was appointed on 1 August 1901.",
            "The year American Civil Government started in the province and the whole country.",
            "In 1910, during the American colonization period, the town was visited by the American survey ship Fathomer which conducted hydrographic surveys and depth sounding in the waters around Simara Island.",
            "Its American crew also constructed a lighthouse which is still standing today.",
            "At that time, Corcuera was still administered as part of Banton municipality on nearby Banton Island.",
            "In January 1931, Corcuera was granted local autonomous government by virtue of Chief Executive Order No.",
            "292, Series of 1930 initiated by then Governor Manuel T. Albero.",
            "Corcuera then became the third island municipality in the province.",
            "The inauguration of Corcuera as a maiden municipality was held on February 3, 1931."
        ],
        [
            "During World War II, the Japanese established a garrison at Tanro-aw Hill in the island.",
            "On March 10, 1945, American and Filipino soldiers who were liberating the Philippines from Japanese occupation launched a task force from Mindoro to liberate the islands of Romblon and Simara.",
            "On March 12, elements from Companies B and C of the 19th Infantry, 24th Division of the US 8th Army landed in Simara led by 1st Lt. David B. Bernard.",
            "They were assisted by the USS Haas, skippered by Lt. Cmdr.",
            "A. M. White."
        ],
        [
            "After four days of mortar and naval bombardment and heavy fighting, the Americans were able to subdue the Japanese in Tanro-aw and liberate the island.",
            "The fighting left 118 Japanese, 10 Americans, and one Filipino dead."
        ],
        [
            "Geography"
        ],
        [
            "Corcuera has a total land area of 23.40 km2.",
            "It is hemmed in by bodies of water from all sides: on the north and east by the Sibuyan Sea; on the south and east by Tablas Strait.",
            "It is a hilly, volcanic island with many hot springs, while stretches of flat land lie along its northern coast."
        ],
        [
            "Barangays"
        ],
        [
            "Corcuera is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alegria"
        ],
        [
            "Ambulong"
        ],
        [
            "Colongcolong"
        ],
        [
            "Gobon"
        ],
        [
            "Guintiguiban"
        ],
        [
            "Ilijan"
        ],
        [
            "Labnig"
        ],
        [
            "Mabini"
        ],
        [
            "Mahaba"
        ],
        [
            "Mangansag"
        ],
        [
            "Poblacion"
        ],
        [
            "San Agustin"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Tacasan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Corcuera, Romblon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31(1.2)"
        ],
        [
            "20(0.8)"
        ],
        [
            "25(1.0)"
        ],
        [
            "39(1.5)"
        ],
        [
            "152(6.0)"
        ],
        [
            "269(10.6)"
        ],
        [
            "314(12.4)"
        ],
        [
            "285(11.2)"
        ],
        [
            "303(11.9)"
        ],
        [
            "208(8.2)"
        ],
        [
            "95(3.7)"
        ],
        [
            "70(2.8)"
        ],
        [
            "1,811(71.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "9.5"
        ],
        [
            "7.1"
        ],
        [
            "9.0"
        ],
        [
            "11.3"
        ],
        [
            "21.0"
        ],
        [
            "25.7"
        ],
        [
            "28.1"
        ],
        [
            "26.5"
        ],
        [
            "27.3"
        ],
        [
            "24.6"
        ],
        [
            "16.5"
        ],
        [
            "12.1"
        ],
        [
            "218.7"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CorcueraYearPop.±% p.a.1903 1,892—    1939 4,004+2.10%1948 5,158+2.85%1960 6,510+1.96%1970 7,805+1.83%1975 8,739+2.29%1980 9,479+1.64%1990 9,438−0.04%1995 9,658+0.43%2000 10,972+2.77%2007 10,883−0.11%2010 9,935−3.26%2015 10,283+0.66%2020 10,112−0.33%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2015 census, it has a population of 10,283 people.",
            "Majority of this population speak the vernacular Asi language, which is also spoken in Banton, Concepcion, Calatrava, and Odiongan.",
            "The island's inhabitants are predominantly Roman Catholic, with a small number of Protestants, Iglesia ni Cristo, and Jehovah's Witnesses."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Corcuera"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "2006  60.40"
        ],
        [
            "2009  46.61"
        ],
        [
            "2012  47.42"
        ],
        [
            "2015  34.02"
        ],
        [
            "2018  19.90"
        ],
        [
            "2021  10.09"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Corcuera has a primarily agricultural economy, with rice and copra farming, as well as fishing, as the main sources of livelihood.",
            "There is also an indigenous raffia palm handicraft industry.",
            "Other crops grown in the island are root crops (such as cassava, sweet potatoes), fruits and vegetables.",
            "The locals also engage in livestock raising for local consumption."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Philippine municipality"
        ],
        [
            "As a municipality in the Province of Romblon, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "Pursuant to Chapter II, Title II, Book III of Republic Act 7160 or the Local Government Code of 1991, the municipal government is composed of a mayor (alkalde), a vice mayor (bise alkalde) and members (kagawad) of the legislative branch Sangguniang Bayan alongside a secretary to the said legislature, all of which are elected to a three-year term and are eligible to run for three consecutive terms."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "The mayor of Corcuera is the municipal executive of the town.",
            "The incumbent mayor and vice mayor as of 30 June 2019 are Elmer M. Fruelda and Aubrey \"Apple\" Fondevilla respectively, both from the Nacionalista Party."
        ],
        [
            "Term"
        ],
        [
            "Mayor"
        ],
        [
            "Vice Mayor"
        ],
        [
            "1931 - 1935"
        ],
        [
            "Atanacio Faminiano y Fallar(as 1st mayor of Maghali municipality)"
        ],
        [
            "1935 - 1939"
        ],
        [
            "Fausto Fallaria"
        ],
        [
            "1939 - 1943"
        ],
        [
            "Sergio Fondevilla y Fabregas"
        ],
        [
            "1943 - 1947"
        ],
        [
            "Martin Fetalino"
        ],
        [
            "1947 - 1951"
        ],
        [
            "Anastacio Falejo y Falogme"
        ],
        [
            "1951 - 1955"
        ],
        [
            "Mateo Ferry"
        ],
        [
            "1955 - 1959"
        ],
        [
            "Vidal Fallaria y Fondevilla"
        ],
        [
            "1959 - 1963"
        ],
        [
            "Ernesto Falculan y Fallarme"
        ],
        [
            "1963 - 1970"
        ],
        [
            "Senen Fanlo y Fallaria"
        ],
        [
            "1970 - 1971"
        ],
        [
            "Nicolas Fajarillo y Fabito"
        ],
        [
            "1971 - 1980"
        ],
        [
            "Josefino Fajilago y Fondevilla"
        ],
        [
            "30 June 1980 - 30 June 1986"
        ],
        [
            "Senen Fanlo y Fallaria"
        ],
        [
            "30 June 1986 - 30 June 1989"
        ],
        [
            "Nicolas Fajarillo y Fabito"
        ],
        [
            "30 June 1989 - 30 June 1992"
        ],
        [
            "30 June 1992 - 30 June 1995"
        ],
        [
            "30 June 1995 - 30 June 1998"
        ],
        [
            "Bibiano Fanlo y Miñon"
        ],
        [
            "30 June 1998 - 30 June 2001"
        ],
        [
            "30 June 2001 - 30 June 2004"
        ],
        [
            "30 June 2004 - 30 June 2007"
        ],
        [
            "Marlon Fojas y Falculan"
        ],
        [
            "Ada Fronda y Manzala"
        ],
        [
            "30 June 2007 - 9 May 2009"
        ],
        [
            "Eddie Mazo y Fondevilla"
        ],
        [
            "Marlon Fojas y Falculan"
        ],
        [
            "9 May 2009 - 30 June 2010"
        ],
        [
            "Dennis Fetalvero y Fajarillob"
        ],
        [
            "30 June 2010 - 30 June 2013"
        ],
        [
            "Rachel Bañares y Miñon"
        ],
        [
            "Elmer Fruelda y Mallorca"
        ],
        [
            "30 June 2013 - 30 June 2016"
        ],
        [
            "30 June 2016 - 30 June 2019"
        ],
        [
            "30 June 2019 - 30 June 2022"
        ],
        [
            "Elmer Fruelda y Mallorca"
        ],
        [
            "Aubrey \"Apple\" Fondevilla"
        ],
        [
            "30 June 2022 - incumbent"
        ],
        [
            "a  Died in office."
        ],
        [
            "b  Served in acting capacity."
        ],
        [
            "c  Resigned."
        ],
        [
            "Tourism"
        ],
        [
            "Corcuera has a number of historical and cultural attractions.",
            "Tourist spots on the island include:"
        ],
        [
            "Cotta Tower: This tower is what remains of a Spanish fort constructed between 1860 and 1865 by Fr.",
            "Agustin de San Pedro, also known as El Padre Capitan, to ward off Muslim pirates.",
            "It is situated on a hill overlooking Barangay Poblacion and is an easy 150-meter hike from the town plaza."
        ],
        [
            "Tanro-aw Hill: Located in Barangay Vicente, it is the site of a Japanese garrison during World War II."
        ],
        [
            "Panorama Point: A roadside lookout in Barangay Tacasan where passing inter-island shipping vessels can be viewed.",
            "The area also shelters boats during inclement weather."
        ],
        [
            "Immaculate Conception Grotto: Located at the summit of Mount Anradoon in Barangay Mangansag, this grotto of the Immaculate Conception offers devotees a place to go and pray during Lenten season."
        ],
        [
            "Payayasog: This testes-like structure that hangs along the bank of the sea in Barangay Mangansag was formed by geological and wave movement."
        ],
        [
            "Mangansag Beach: A white sand beach in Barangay Mangansag dotted with tall palm trees and volcanic boulders along pristine waters."
        ],
        [
            "Colong-Colong Beach: A sandy beach with pristine waters which is a picnic destination for local folks and returning residents."
        ],
        [
            "Mahaba Beach: This is a long stretch of white beaches along pristine waters north of the island."
        ],
        [
            "Guin-iwagan Cave: This cave in Barangay Mahaba features a dome-like structure that abounds in stalagmites and stalactites.",
            "There is a pool of cool water where one can swim."
        ],
        [
            "Lis-ong Cave: This cave in Barangay Colong-Colong has stalactite and stalagmite deposits."
        ],
        [
            "Transportation"
        ],
        [
            "As seas surrounding Corcuera can be rough during the wet season, the best time to visit the island is from March to May during the dry (summer) season.",
            "This is also the typical time for Asi families living in Metro Manila or abroad to visit the island since it coincides with the Lenten season and barangay fiestas."
        ],
        [
            "By sea"
        ],
        [
            "Corcuera is accessible via RORO vessels that ply the Manila-Odiongan, Batangas City-Odiongan, Lucena City-San Agustin, or the Roxas-Odiongan route.",
            "From Odiongan, Corcuera can be reached by jeepney and motorized boat via Calatrava, Romblon."
        ],
        [
            "By air"
        ],
        [
            "The closest airport with active airline service is Tugdan Airport in Alcantara, Romblon.",
            "Fil-Asian Airways offers four weekly flights to Romblon from Manila.",
            "From Alcantara, Corcuera can be reached in 5–6 hours by jeepney and motorized boats from Calatrava."
        ],
        [
            "Within the island, the main forms of transportation are passenger motorcycles (known elsewhere as habal-habal) and motorized boats.",
            "A circumferential road connects the 15 barangays of Corcuera to each other."
        ],
        [
            "References"
        ],
        [
            "^ a b \"Halalan 2019 Philippine Election Results\".",
            "ABS-CBN News."
        ],
        [
            "^  Municipality of Corcuera |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Corcuera Island: A Hidden Paradise of Romblon\".",
            "BusinessMirror.",
            "4 May 2013.",
            "Retrieved 16 September 2014."
        ],
        [
            "^ a b Simara History Simara.com Retrieved on 2012-04-14."
        ],
        [
            "^ a b A Coin in the Sand Simara.com Retrieved on 2013-03-30."
        ],
        [
            "^"
        ],
        [
            "\"Corcuera: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Poverty Incidence, 2000\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"Poverty Incidence, 2003\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"Poverty Incidence, 2006\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"Poverty Incidence, 2012\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Poverty Incidence, 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Providing for a Local Government Code of 1991\".",
            "The LawPhil Project.",
            "8th Congress of the Republic of the Philippines.",
            "Retrieved April 21, 2014."
        ],
        [
            "^ a b \"Philippines Election Results\".",
            "Archived from the original on 2016-05-30.",
            "Retrieved 2016-05-14."
        ],
        [
            "^ a b \"2013 Election Results: Corcuera, Romblon | Comelec Live Data | Philippine National and Local Elections | Updated Real Time\".",
            "election-results.rappler.com."
        ],
        [
            "^ a b \"Corcuera, Romblon Elections\".",
            "Archived from the original on 2016-05-30.",
            "Retrieved 2016-05-14."
        ],
        [
            "^ \"Corcuera election results\".",
            "ABS-CBN."
        ],
        [
            "^ \"How to get to Romblon\".",
            "Romblon Lifestyles.",
            "Archived from the original on 28 February 2015.",
            "Retrieved 11 August 2014."
        ],
        [
            "^ \"Fil-Asian Airways completes inaugural flight\".",
            "Philippine Flight Network.",
            "24 June 2013.",
            "Retrieved 11 August 2014."
        ],
        [
            "^ \"SkyJet to make Romblon accessible to tourists\".",
            "Philippine Flight Network.",
            "3 July 2013.",
            "Retrieved 11 August 2014."
        ],
        [
            "External links"
        ],
        [
            "Corcuera Profile at PhilAtlas.com"
        ],
        [
            "Corcuera Profile - Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Website of Simara Island, Romblon Archived 2012-08-28 at the Wayback Machine"
        ],
        [
            "Places adjacent to Corcuera"
        ],
        [
            "BantonSibuyan Sea"
        ],
        [
            "Concepcion / Sibuyan Sea"
        ],
        [
            "Corcuera"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "Sibuyan SeaCalatrava"
        ],
        [
            "vte Province of RomblonRomblon (capital)  Odiongan (largest municipality)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Banton"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Calatrava"
        ],
        [
            "Concepcion"
        ],
        [
            "Corcuera"
        ],
        [
            "Ferrol"
        ],
        [
            "Looc"
        ],
        [
            "Magdiwang"
        ],
        [
            "Odiongan"
        ],
        [
            "Romblon"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Corcuera&oldid=1211426854\""
        ],
        [
            "Categories: Municipalities of RomblonIsland municipalities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}