{
    "name": "Cortes",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cortes, Bohol"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°43′N 123°53′E﻿ / ﻿9.72°N 123.88°E﻿ / 9.72; 123.88"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bohol, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Cortes, Bohol\" – news · newspapers · books · scholar · JSTOR (September 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Visayas, PhilippinesCortesMunicipalityMunicipality of CortesCortes, Bohol"
        ],
        [
            "FlagMap of Bohol with Cortes highlightedOpenStreetMapCortesLocation within the PhilippinesCoordinates: 9°43′N 123°53′E﻿ / ﻿9.72°N 123.88°E﻿ / 9.72; 123.88CountryPhilippinesRegionCentral VisayasProvinceBoholDistrict"
        ],
        [
            "1st districtBarangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorLynn Iven P. Lim • Vice MayorRodrigo Dennis Butawan Uy • RepresentativeEdgardo M. Chatto • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Niño H. LumanasFelix A. YanaLuisa J. JumamilAntonino O. SansanMedardo T. Tatad Jr.Lois Ira LimTeodulo B. SumabongRolando D. De La Torre"
        ],
        [
            " • Electorate11,748 voters (2022)Area • Revenue₱ 92.31 million (2020) • Assets₱ 224.5 million (2020) • Expenditure₱ 89.15 million (2020) • Liabilities₱ 32.09 million (2020)Service provider • ElectricityBohol 1 Electric Cooperative (BOHECO 1)Time zoneUTC+8 (PST)ZIP code6341PSGC071216000IDD : area code +63 (0)38Native languagesBoholano dialect Cebuano Tagalog"
        ],
        [
            "Cortes, officially the Municipality of Cortes (Cebuano: Munisipalidad sa Cortes; Tagalog: Bayan ng Cortes),  is a 5th class municipality in the province of Bohol, Philippines.",
            "According to the 2020 census, it has a population of 18,344 people."
        ],
        [
            "The town fiesta is held every 16 January in honor of the holy child Jesus, the Santo Niño."
        ],
        [
            "History"
        ],
        [
            "The history of Cortes dates back to pre-Hispanic times – there already was a form of government way before the coming of the Spaniards.",
            "The town was known as \"Malabago\" after its chief, who was a contemporary of King Lomod, otherwise known as Tamblot – the first Boholano to raise arms against the Spanish conquistadors."
        ],
        [
            "The Malabago settlement was situated in the upland territory of the present day Cortes near the Abatan River while that of Tamblot was at barangay Viga in the lowlands of Antequera which stretches to the riverside valleys opposite that of Malabago beyond the present day Abatan Bridge.",
            "The people of Malabago have a culture of their own and recorded their day-to-day activities in their own writing using unique characters which they carved out on a piece of bamboo using a knife called panggi or supok.",
            "Malabago then was a farming community that cultivated the land and made rice paddies in the north and east lowlands."
        ],
        [
            "Tamblot's reign started in early 1600 AD and the uprising in 1621 was triggered when a Spanish priest want to take back a silver church bell (Lingganayng Ugis) which he gave to Tamblot in order to put it up in a church he built at Malabago.",
            "Tamblot resented such a move; refused to give the bell back and so started the feud between him and the Spaniards.",
            "Supporting Tamblot during the uprising, the Malabago settlement was destroyed by the Spaniards in 1621."
        ],
        [
            "The settlement was transferred to Bahian which was also destroyed by the Spaniards.",
            "Again the people settled at Ylaya at the upper part of the river.",
            "Not accessible by boats, the people had to berth near the mouth of the river which they eventually called as \"Dayhangan\", meaning \"berthing place\"."
        ],
        [
            "The people chose to live near the mouth of the river and along the swamps.",
            "Their main livelihood was to catch fish, so the new settlement was called \"Pamingwitan\" ('a place where one can catch fish using a fishing rod').",
            "In 1793 or 94, an independent parish was established."
        ],
        [
            "\"Pamingwitan\" was renamed \"Cortes\".",
            "The town was probably established in 1862 during the construction of the Catholic church with the settlements of Malabago, Pamingwitan and Dayhangan jointed into one and called \"Pueblo de Cortes\".",
            "Toponymy suggests: named after Cortes the town in Navarre of northern Spainnamed after the Spanish conquistador, Hernán Cortés (who himself came from i.",
            ")derivation from the Spanish word \"cortesimo\" meaning \"most courteous\"."
        ],
        [
            "The parish was dedicated to the Santo Niño.",
            "The inhabitants of the town were baptized and given instructions in the Catholic faith.",
            "Although the church was built in 1880, the bell tower's upper register was completed only in the 20th century.",
            "A boys' school building was constructed in 1895."
        ],
        [
            "The town of Cortes played a prominent role during World War II.",
            "The inhabitants of the town formed a bolo battalion to fight the Japanese Invaders.",
            "Yet in 1942, the town was overwhelmed by the Japanese; houses were burned down and the school building was occupied and used as a garrison.",
            "Cortes was liberated from the Japanese a few days after the arrival of the Americans in Tagbilaran on 11 April 1945.",
            "In less than a month, the whole province of Bohol was officially declared liberated on 25 May 1945, by Major General William H. Arnold, Commander of the Americal Division."
        ],
        [
            "Geography"
        ],
        [
            "Cortes is 10 kilometres (6.2 mi) northeast of Tagbilaran.",
            "Located high up on a plateau, the town occupies a total land area of 27.32 square kilometres (10.5 sq mi)."
        ],
        [
            "Barangays"
        ],
        [
            "Cortes is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 071216001   De la Paz"
        ],
        [
            " 15.4%"
        ],
        [
            " 2,824"
        ],
        [
            " 2,546"
        ],
        [
            "  ▴"
        ],
        [
            " 1.04%"
        ],
        [
            " 071216002   Fatima"
        ],
        [
            " 6.0%"
        ],
        [
            " 1,105"
        ],
        [
            " 962"
        ],
        [
            "  ▴"
        ],
        [
            " 1.40%"
        ],
        [
            " 071216003   Loreto"
        ],
        [
            " 8.2%"
        ],
        [
            " 1,504"
        ],
        [
            " 1,388"
        ],
        [
            "  ▴"
        ],
        [
            " 0.81%"
        ],
        [
            " 071216004   Lourdes"
        ],
        [
            " 9.9%"
        ],
        [
            " 1,808"
        ],
        [
            " 1,668"
        ],
        [
            "  ▴"
        ],
        [
            " 0.81%"
        ],
        [
            " 071216005   Malayo Norte"
        ],
        [
            " 7.7%"
        ],
        [
            " 1,418"
        ],
        [
            " 1,291"
        ],
        [
            "  ▴"
        ],
        [
            " 0.94%"
        ],
        [
            " 071216006   Malayo Sur"
        ],
        [
            " 3.6%"
        ],
        [
            " 658"
        ],
        [
            " 596"
        ],
        [
            "  ▴"
        ],
        [
            " 0.99%"
        ],
        [
            " 071216007   Montserrat"
        ],
        [
            " 2.6%"
        ],
        [
            " 471"
        ],
        [
            " 391"
        ],
        [
            "  ▴"
        ],
        [
            " 1.88%"
        ],
        [
            " 071216008   New Lourdes"
        ],
        [
            " 5.3%"
        ],
        [
            " 977"
        ],
        [
            " 699"
        ],
        [
            "  ▴"
        ],
        [
            " 3.40%"
        ],
        [
            " 071216009   Patrocinio"
        ],
        [
            " 4.0%"
        ],
        [
            " 741"
        ],
        [
            " 685"
        ],
        [
            "  ▴"
        ],
        [
            " 0.79%"
        ],
        [
            " 071216010   Poblacion"
        ],
        [
            " 7.5%"
        ],
        [
            " 1,367"
        ],
        [
            " 1,273"
        ],
        [
            "  ▴"
        ],
        [
            " 0.71%"
        ],
        [
            " 071216011   Rosario"
        ],
        [
            " 4.0%"
        ],
        [
            " 734"
        ],
        [
            " 668"
        ],
        [
            "  ▴"
        ],
        [
            " 0.95%"
        ],
        [
            " 071216012   Salvador"
        ],
        [
            " 6.6%"
        ],
        [
            " 1,208"
        ],
        [
            " 1,105"
        ],
        [
            "  ▴"
        ],
        [
            " 0.90%"
        ],
        [
            " 071216013   San Roque"
        ],
        [
            " 5.9%"
        ],
        [
            " 1,091"
        ],
        [
            " 1,022"
        ],
        [
            "  ▴"
        ],
        [
            " 0.66%"
        ],
        [
            " 071216014   Upper de la Paz"
        ],
        [
            " 5.7%"
        ],
        [
            " 1,048"
        ],
        [
            " 1,000"
        ],
        [
            "  ▴"
        ],
        [
            " 0.47%"
        ],
        [
            "Total"
        ],
        [
            "18,344"
        ],
        [
            "15,294"
        ],
        [
            " ▴"
        ],
        [
            "1.83%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cortes, Bohol"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "102(4.0)"
        ],
        [
            "85(3.3)"
        ],
        [
            "91(3.6)"
        ],
        [
            "75(3.0)"
        ],
        [
            "110(4.3)"
        ],
        [
            "141(5.6)"
        ],
        [
            "121(4.8)"
        ],
        [
            "107(4.2)"
        ],
        [
            "111(4.4)"
        ],
        [
            "144(5.7)"
        ],
        [
            "169(6.7)"
        ],
        [
            "139(5.5)"
        ],
        [
            "1,395(55.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.6"
        ],
        [
            "14.8"
        ],
        [
            "16.5"
        ],
        [
            "16.7"
        ],
        [
            "23.9"
        ],
        [
            "26.4"
        ],
        [
            "25.6"
        ],
        [
            "24.1"
        ],
        [
            "24.4"
        ],
        [
            "26.3"
        ],
        [
            "23.7"
        ],
        [
            "20.5"
        ],
        [
            "261.5"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CortesYearPop.±% p.a.1903 6,644—    1918 7,877+1.14%1939 8,652+0.45%1948 7,959−0.92%1960 7,908−0.05%1970 8,853+1.13%1975 9,056+0.46%1980 9,350+0.64%1990 10,527+1.19%1995 11,133+1.05%2000 12,702+2.87%2007 14,586+1.93%2010 15,294+1.74%2015 16,954+1.98%2020 18,344+1.56%Source: Philippine Statistics Authority"
        ],
        [
            "Medium of discourse is usual Visayan (Cebuano), but English is the medium of instruction in all schools in the town starting from the primary grades.",
            "People also understand Filipino."
        ],
        [
            "The people of Cortes in majority are Roman Catholics."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cortes"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  26.40"
        ],
        [
            "2009  26.90"
        ],
        [
            "2012  15.87"
        ],
        [
            "2015  15.88"
        ],
        [
            "2018  12.50"
        ],
        [
            "2021  14.49"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Main Health Station"
        ],
        [
            "Cortes is the site of the southern Industrial Projects and its subsidiary, Rolling Mills, which produces colored and non-colored galvanized iron for roofing.",
            "Rolling Mills is situated high up on a plateau overlooking the Abatan River."
        ],
        [
            "The town is known for its handmade paper and papercrafts, similar to washi, but made with indigenous fibers."
        ],
        [
            "The town is also known for handmade paper products chosen now as the town's priority product under the Department of Trade and Industry's One Town, One Product (OTOP) Program.",
            "Aside from the manufacturing and handicraft industries, the people of Cortes are also into agribusiness."
        ],
        [
            "Sand taken from the Abatan River, and which usually finds its way to construction sites in Tagbilaran, is likewise another source of income for the people of Cortes.",
            "Flat-bottomed boats made of marine plywood carry the sand which has to be dug up from the river bed with waist-high waters – back-breaking work for those involved."
        ],
        [
            "The Local Government Unit (LGU) of Cortes is also developing eco-tourism.",
            "One major project is the development of the docking port, envisaged to be the starting point for cruises on the Abatan River, which flows through five towns."
        ],
        [
            "Other projects include the establishment of daycare centers in each of the town's 14 barangays.",
            "Health stations will also be constructed.",
            "The nine sources of water supply are now installed with automatic chlorinator injection system to insure the health of residents.",
            "A reservoir will also be constructed in De la Paz."
        ],
        [
            "Tourism"
        ],
        [
            "The town of Cortes has several tourism sites that yet need further development in order to attract foreign tourists.",
            "The Bacong River Heritage Conservation Tour for paddling and river trekking enthusiasts has been set up.",
            "Other sites such as the Larga Vista, an old stone building and the municipal hall are must-see."
        ],
        [
            "Abatan River"
        ],
        [
            "Main article: Abatan River"
        ],
        [
            "The Abatan River is one of its natural assets.",
            "The river winds through the town of Antequera and from the town of Balilihan for an estimated length of 20 kilometres (12 mi).",
            "It opens at the Cortes nipa swamp, the most extensive nipa swamp in Bohol."
        ],
        [
            "In former days when roads were scarce, the river served as a waterway for the people to and from the interior towns.",
            "Now, the government has seen its potential for tourism after the success of the Loboc River tours and it is now being developed."
        ],
        [
            "Kayak exploration and stand-up paddle boarding are now available and can be arranged."
        ],
        [
            "Cortes church"
        ],
        [
            "Cortes Church"
        ],
        [
            "The church of Cortes is the Santo Niño parish church.",
            "It is situated high up on a hill and like all Bohol churches is cruciform shape.",
            "The church dates back to the 19th century although the bell tower's upper register was not completed until the 20th century."
        ],
        [
            "The church is made up of cut coral stone blocks.",
            "A portico is in front of an older façade and floral carving frames the doorway.",
            "It has frescoes on its ceilings.",
            "The main retablo has twisted Solomonic columns and profusely carved flanges in the baroque idiom."
        ],
        [
            "Bilibili Spring"
        ],
        [
            "Bilibili Spring is another site envisioned for development by the local government for it will be the first stop of the proposed river cruise.",
            "The spring is located in Malayo Norte."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Cortes |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Bohol Cortes Town\".",
            "www.bohol-philippines.com.",
            "Retrieved February 18, 2019."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Cortes: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bohol\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Handmade Paper of Cortes Bohol Philippines\"."
        ],
        [
            "^ \"The Abatan Life River Tour in Bohol\".",
            "official website of the Tourism Office of the Province of Bohol.",
            "Bohol Tourism Office.",
            "3 December 2014.",
            "Retrieved 4 December 2017."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Cortes, Bohol."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Cortes"
        ],
        [
            "Municipality of Cortes"
        ],
        [
            "History of Cortes"
        ],
        [
            "Cortes Municipality"
        ],
        [
            "Places adjacent to Cortes, Bohol"
        ],
        [
            "Maribojoc"
        ],
        [
            "Antequera"
        ],
        [
            "Maribojoc Bay (Cebu Strait)"
        ],
        [
            "Cortes"
        ],
        [
            "Balilihan"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Corella"
        ],
        [
            "vte Province of BoholTagbilaran (capital and largest city)Municipalities"
        ],
        [
            "Alburquerque"
        ],
        [
            "Alicia"
        ],
        [
            "Anda"
        ],
        [
            "Antequera"
        ],
        [
            "Baclayon"
        ],
        [
            "Balilihan"
        ],
        [
            "Batuan"
        ],
        [
            "Bien Unido"
        ],
        [
            "Bilar"
        ],
        [
            "Buenavista"
        ],
        [
            "Calape"
        ],
        [
            "Candijay"
        ],
        [
            "Carmen"
        ],
        [
            "Catigbian"
        ],
        [
            "Clarin"
        ],
        [
            "Corella"
        ],
        [
            "Cortes"
        ],
        [
            "Dagohoy"
        ],
        [
            "Danao"
        ],
        [
            "Dauis"
        ],
        [
            "Dimiao"
        ],
        [
            "Duero"
        ],
        [
            "Garcia Hernandez"
        ],
        [
            "Getafe"
        ],
        [
            "Guindulman"
        ],
        [
            "Inabanga"
        ],
        [
            "Jagna"
        ],
        [
            "Lila"
        ],
        [
            "Loay"
        ],
        [
            "Loboc"
        ],
        [
            "Loon"
        ],
        [
            "Mabini"
        ],
        [
            "Maribojoc"
        ],
        [
            "Panglao"
        ],
        [
            "Pilar"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Sagbayan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Sevilla"
        ],
        [
            "Sierra Bullones"
        ],
        [
            "Sikatuna"
        ],
        [
            "Talibon"
        ],
        [
            "Trinidad"
        ],
        [
            "Tubigon"
        ],
        [
            "Ubay"
        ],
        [
            "Valencia"
        ],
        [
            "Component city"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Islands"
        ],
        [
            "Balicasag"
        ],
        [
            "Banacon"
        ],
        [
            "Bansaan"
        ],
        [
            "Bilangbilangan"
        ],
        [
            "Bohol"
        ],
        [
            "Cabilao"
        ],
        [
            "Cabulan"
        ],
        [
            "Hingotanan"
        ],
        [
            "Jandayan"
        ],
        [
            "Jao"
        ],
        [
            "Juagdan"
        ],
        [
            "Lapinig"
        ],
        [
            "Mahanay"
        ],
        [
            "Malingin"
        ],
        [
            "Mantatao"
        ],
        [
            "Maomawan"
        ],
        [
            "Pamilacan"
        ],
        [
            "Pangangan"
        ],
        [
            "Panglao"
        ],
        [
            "Sagasa"
        ],
        [
            "Sandingan"
        ],
        [
            "Tintinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cortes,_Bohol&oldid=1208542805\""
        ],
        [
            "Categories: Municipalities of Bohol1862 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2012All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}