{
    "name": "Culion",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Culion"
        ],
        [
            "23 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიКырык марыBahasa MelayuNederlands日本語Norsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°53′40″N 120°01′07″E﻿ / ﻿11.8944°N 120.0186°E﻿ / 11.8944; 120.0186"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Palawan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Culion\" – news · newspapers · books · scholar · JSTOR (November 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Mimaropa, PhilippinesCulionMunicipalityMunicipality of CulionCulion Skyline"
        ],
        [
            "FlagSealMap of Palawan with Culion highlightedOpenStreetMapCulionLocation within the PhilippinesCoordinates: 11°53′40″N 120°01′07″E﻿ / ﻿11.8944°N 120.0186°E﻿ / 11.8944; 120.0186CountryPhilippinesRegionMimaropaProvincePalawanDistrict"
        ],
        [
            "1st districtFoundedFebruary 19, 1992Barangays14 (see Barangays)Government  • TypeSangguniang Bayan • MayorMa.",
            "Virginia N. de Vera • Vice MayorAlister S. Leyson • RepresentativeFranz Josef George E. Alvarez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Cecilia C. CunananRonald H. AlcantaraLeonilo R. SarmientoJovel Marie A. BallescaAlejandro G. AstorFel Ford G. SolasWarnell F. DayandanteHaydee M. Fonte"
        ],
        [
            " • Electorate13,979 voters (2022)Area"
        ],
        [
            " • Revenue₱ 191.8 million (2020) • Assets₱ 244.3 million (2020) • Expenditure₱ 196.9 million (2020) • Liabilities₱ 47.34 million (2020)Service provider • ElectricityBusuanga Island Electric Cooperative (BISELCO)Time zoneUTC+8 (PST)ZIP code5315PSGC1705322000IDD : area code +63 (0)48Native languagesCalamian Tagbanwa Palawano Tagalog"
        ],
        [
            "Culion, officially the Municipality of Culion (Tagalog: Bayan ng Culion),  is a 3rd class municipality in the province of Palawan, Philippines.",
            "According to the 2020 census, it has a population of 23,213 people."
        ],
        [
            "Culion consists primarily of Culion Island as well as 41 minor surrounding islands, as part of the Calamian group of islands."
        ],
        [
            "It was a former leprosarium, starting in 1906 under the American colonial regime until the American commonwealth of the Philippines era.",
            "Although leprosy on the island-town was abolished in the 1980s, it was only in 2006 when it was declared a leprosy-free area by the World Health Organization."
        ],
        [
            "History"
        ],
        [
            "Spanish colonial period"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(August 2018) (Learn how and when to remove this message)"
        ],
        [
            "Aside from churches, the Spaniards built defensive fortifications in strategic places in Taytay, Cuyo, Agutaya, Linapacan, including a watch tower and fort in the locality of Libis in Culion."
        ],
        [
            "In 1858, Calamianes was divided into 2 provinces, \"Castilla\" and \"Asturias\".",
            "Castilla, which included northern Palawan, retained its capital of Taytay.",
            "Asturias extended south to Balabac.",
            "In 1873, the capital of Palawan was changed from Taytay to Cuyo.",
            "The French anthropologist Alfred Marche traveled the Philippines and documented his research of many places.",
            "French Ambassador Pirre Revol in particular translated Marche's account of the Calamianes, and Culion."
        ],
        [
            "Marche refers to Culion as the principal village of the Calamianes.",
            "The fact that a boat from Manila \"touches Culion once a month\" attests to the growing economy of the place at that time.",
            "Marche's description of the place and people he met in the 1880s are important indicators of the ethnography of Calamianes since more than a hundred years ago."
        ],
        [
            "The primacy of Culion as a leading settlement community of the Calamianes is further supported by the fact that a Justice of the peace resided and held office in Culion.",
            "Claudio Sandoval y Rodriguez a Spanish mestizo from Jaro, Iloilo married Evarista Manlavi daughter of a rich landowner from Cuyo.",
            "Claudio Sandoval became Jezgado de Paz de Culion, Calamianes and held office sometime in the late 1880s.",
            "The seal of Claudio's office was found stamped on handwritten circular dated December 11, 1889 that he sent to all within Culion's \"roriedad y sus visitas\" warning residents of the penalties that will be imposed on them should they be caught gambling.",
            "Culion's \"visitas\" included the island of Busuanga and other areas in Calamianes."
        ],
        [
            "A remnant of the fort in San Pedro located somewhere in Burabud is a testimony of a rich history of Culion.",
            "In the early 1990s, it was thought that this fort was already invaded by the roots of balete trees.",
            "This was built by the Spanish friars (Augustinian Recollects) and is older than the one we now see in Culion proper, the Immaculate Conception Church built by the Jesuits.",
            "This fort in San Pedro was more or less built on the same span of time as that of the forts in Agutaya, Taytay and Cuyo which all still stand today preserved by the Palawan government."
        ],
        [
            "American commonwealth and Culion as a leprosarium"
        ],
        [
            "Main article: Culion leper colony"
        ],
        [
            "Members of the Culion leper colony in an undated photograph.",
            "The women in the center appear to be playing the kulintang traditional instrument."
        ],
        [
            "When the treaty of Paris was signed on December 10, 1898, wherein Spain sold the Philippines to the United States for 20 million dollars, the funding of Culion as a reservation is closely related to the early efforts of the Americans to establish some form of public health policy in the Philippines as part of their long-term intentions to occupy the archipelago."
        ],
        [
            "One of the motivating factors for the creation of the Manila Board of Health was traditional belief that the maintenance of public health required the isolation of cases of leprosy from the rest of the public.",
            "After an investigation of a number of sites, the island of Culion was selected as a segregation colony in 1901.",
            "On October 27, 1902, the Second Philippine Commission appropriated an initial amount of $50,000 for the establishment of Culion under the Secretary of Interior Dean C. Worcester and Director of Health Victor G. Heiser.",
            "On August 22, 1904, Luke E. Wright, the American Civil Governor of the Government of the Philippine Islands, signed Executive Order No.",
            "35 which transferred the jurisdiction and control of Culion from the Municipality of Coron, reserving the same as a leper colony and a government stock farm."
        ],
        [
            "Timeline"
        ],
        [
            "On May 27, 1906, the first contingent of 370 patients from Cebu was brought to Culion by two Coast Guard cutters, the Polillo and the Mindanao."
        ],
        [
            "On September 12, 1907, Act 1711 of the Philippine Commission was passed that gave full responsibility to the Director of Health for the compulsory segregation of the lepers, and confinement and treatment in Culion."
        ],
        [
            "Between 1906 and 1910 the Americans rounded up 5,303 leprosy afflicted individuals and brought them to the colony.",
            "On July 18, 1912, acting Governor General Newton Gilbert signed EO No.",
            "35 in which he further defined the territory of the leper colony and government stock farm."
        ],
        [
            "In 1913, a special coinage issue was minted in aluminum by a private firm for the inmates of the Colony.",
            "Further special coinage issues would be minted for them at the Manila Mint from 1920 to 1930.",
            "A special paper money issue was generated during World War II for their use as well."
        ],
        [
            "In 1917, Section 1066 of Act No.",
            "2711 (Revised Administrative Act) provided that the Department Head through the Director of Health shall have jurisdiction over the colony and its waters for the efficient management of the sanitarium."
        ],
        [
            "On June 18, 1952, Congress passed R.A. No.",
            "753 which transferred administrative control to the Director of Hospitals.",
            "In 1964, the Secretary of Health again took administrative control and enforcement of rules and regulations over all the lands and waters of Culion Leper Colony as provided under Section 106 of the Revised Administrative Code.",
            "Sections 1060 to 1071 of RA no.",
            "753 was later repealed by Republic Act No.",
            "4073, an Act further liberalizing the Treatment of Leprosy by Amending and Repealing Certain Sections of the Revised Administrative Code, resulting in the loss of jurisdiction by the Department of Health over the natural resources of Culion."
        ],
        [
            "In 1979, a Culion Committee was created under Letter of Instructions No.",
            "796.",
            "The Ministry of Human Settlements conceived and organized in 1982 an alternative development approach for residents of Culion under the Culion Development Project (CDP).",
            "This was later amended by Executive Order No.",
            "241 on July 24, 1987, that transferred the said committee and the CDP to the Palawan Integrated Area Development Project (PIADP) of the National Council on Integrated Area Development (NACIAD).",
            "This transfer did not however affect the jurisdiction of DOH over the Culion Leper Colony."
        ],
        [
            "On June 22, 1988, Congress passed R.A. No.",
            "6659 that authorized qualified residents of Culion Leper Colony to vote for the elective provincial officials of the Province of Palawan.",
            "In 1991, Speaker Ramon Mitra and House Representative David Ponce De Leon introduced a house bill for the creation of the Municipality of Culion.",
            "On February 12, 1992, President Corazon C. Aquino signed Republic Act 7193 creating the Municipality of Culion in the Province of Palawan."
        ],
        [
            "May 8, 1995 was when the first election of municipal and barangay officials of Culion was held resulting in the election of Mr. Hilarion M. Guia and Mr. Emiliano Marasigan Jr. as its first duly elected Mayor and Vice Mayor, respectively."
        ],
        [
            "On October 29, 1998, through Department of Health Administrative Order No.",
            "20-A Series of 1998, administrative control and authority over the Municipality of Culion was officially transferred from the Department of Health to the Municipality ending nearly one century of administrative control by the health department over Culion Island."
        ],
        [
            "Fishing boats in Culion"
        ],
        [
            "On March 12, 2001, Republic Act 9032 signed by President Gloria Macapacal Arroyo expanded the area of jurisdiction of the Municipality of Culion, Province of Palawan, amending for the purpose Republic Act 7193.",
            "The barangays of Balala, Baldat, Binudac, Culango, Galoc, Jardin, Libis, Luac, Malaking Patag, Osmeña and Tiza were declared legally existent upon the creation of the Municipality of Busuanga to the Municipality of Culion.",
            "Barangays Burabod and Halsey were transferred from the Municipality of Busuanga to the Municipality of Culion subject to ratification by plebiscite in the two municipalities of Culion and Busuanga.",
            "Barangay Carabao for the Tagbanua indigenous cultural community was likewise created subject to ratification by plebiscite in Culion."
        ],
        [
            "While on July 15, 2002, plebiscites held in Culion and Busuanga simultaneously with the election of barangay officials and Sangguniang Kabataan representatives resulted in the ratification of the transfer of Halsey and Burabod to Culion and the creation of Barangay Carabao."
        ],
        [
            "In May 2018, the Culion Museum and Archives was nominated by the Philippines to the Memory of the World Register – Asia and the Pacific.",
            "The archive's declaration of passage or failure will be announced on a later date."
        ],
        [
            "June 18, 2018, the Culion Leprosy Archives was officially inscribed to the Memory of the World Register – Asia and the Pacific."
        ],
        [
            "Geography"
        ],
        [
            "Culion island satellite image captured by Sentinel-2 in 2016"
        ],
        [
            "Culion is an island situated at the northernmost part of Palawan.",
            "It is part of the Calamian Archipelago in northern Palawan that also includes the municipalities of Busuanga, Coron, and Linapacan.",
            "During the Spanish Period, these were known as Las Islas de Calamianes, Provincia de España."
        ],
        [
            "The municipality has a land area of 500 square kilometres (190 sq mi) which includes the 41 surrounding islands and measures a total of 1,191.39 square kilometres (460.00 sq mi) including its territorial water.",
            "Its largest island, Culion Island, has an area of 389 square kilometres (150 sq mi).",
            "It is bounded on the north by Busuanga Island, on the east by the Coron Reef, on the south by Linapacan Island, and on the west by the South China Sea."
        ],
        [
            "The Culion sea is teeming with a total of 201 fish species including commercially important fish like Lapu-lapu (Groupers), Kanuping (Sweetlip Emperor), Maya-Maya (Snapper), Tanguige (Spanish Mackerel), Dalagang Bukid (Blue and Gold Fusiliers) and Bisugo (Breams).",
            "Squid, cuttlefish, shrimps, crabs, shellfish and sea cucumber or trepang are plentiful."
        ],
        [
            "Three ecosystems sustain the rich marine life of Culion: mangroves, seagrass, and corals.",
            "17 mangrove species cover the coastline of Culion.",
            "9 seagrass species and 47 coral genera representing 60% of the total genera found in the Philippines are found in Culion."
        ],
        [
            "Barangays"
        ],
        [
            "Culion is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Balala"
        ],
        [
            "Baldat"
        ],
        [
            "Binudac"
        ],
        [
            "Burabod"
        ],
        [
            "Culango"
        ],
        [
            "De Carabao"
        ],
        [
            "Galoc"
        ],
        [
            "Halsey"
        ],
        [
            "Jardin"
        ],
        [
            "Libis"
        ],
        [
            "Luac"
        ],
        [
            "Malaking Patag"
        ],
        [
            "Osmeña"
        ],
        [
            "Tiza"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Culion, Palawan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "21(70)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "30(1.2)"
        ],
        [
            "26(1.0)"
        ],
        [
            "39(1.5)"
        ],
        [
            "58(2.3)"
        ],
        [
            "192(7.6)"
        ],
        [
            "283(11.1)"
        ],
        [
            "341(13.4)"
        ],
        [
            "323(12.7)"
        ],
        [
            "317(12.5)"
        ],
        [
            "231(9.1)"
        ],
        [
            "119(4.7)"
        ],
        [
            "56(2.2)"
        ],
        [
            "2,015(79.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.3"
        ],
        [
            "8.5"
        ],
        [
            "12.4"
        ],
        [
            "16.3"
        ],
        [
            "23.5"
        ],
        [
            "27.1"
        ],
        [
            "28.4"
        ],
        [
            "27.3"
        ],
        [
            "27.6"
        ],
        [
            "26.3"
        ],
        [
            "19.2"
        ],
        [
            "13.6"
        ],
        [
            "240.5"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CulionYearPop.±% p.a.1995 13,024—    2000 14,302+2.03%2007 17,194+2.57%2010 19,543+4.77%2015 20,139+0.57%2020 23,213+2.83%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Culion was 23,213 people, with a density of 46 inhabitants per square kilometre or 120 inhabitants per square mile."
        ],
        [
            "The original people of Culion are the Tagbanuas, a cultural minority group that lives by fishing and food gathering.",
            "While preserving their native customs and traditions, the Tagbanuas are greatly influenced by Muslim culture and social organization."
        ],
        [
            "Early trading activities attracted people from other parts of Palawan, like Calamianen and Cuyonon, who came and stayed in Culion as their new home."
        ],
        [
            "Today, however, the Tagbanuas no longer practice many of their cultural traditions and many of them have been converted to Christianity.",
            "They are largely marginalized, making up only about 8% of Culion's total population.",
            "Barangay Carabao, under Republic Act 9032, was established for these indigenous people.",
            "They were also granted Certificates of Ancestral Domain under Republic Act 8371, also known as the Indigenous Peoples' Rights Act of 1997."
        ],
        [
            "The establishment of the leper colony in 1906, Hansenites and hospital staff were brought to Culion from different parts of the Philippines bringing their customs, habits, dialects, and regional characteristics, and the influx of migrants in the last three decades have understandably made Culion an heterogeneous population."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Culion"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  40.80"
        ],
        [
            "2009  28.47"
        ],
        [
            "2012  23.61"
        ],
        [
            "2015  24.94"
        ],
        [
            "2018  15.77"
        ],
        [
            "2021  40.16"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "In popular culture"
        ],
        [
            "The 2019 film Culion depicts the island's history during the 1940s when the disease was considered a life sentence."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Culion |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Culion Island\".",
            "Encyclopædia Britannica.",
            "Retrieved April 7, 2011."
        ],
        [
            "^ Ronald Fettes Chapman (1982).",
            "Leonard Wood and leprosy in the Philippines: the Culion Leper Colony, 1921-1927.",
            "University Press of America.",
            "pp. 85–86.",
            "ISBN 0-8191-1977-6.",
            "OL 4094674M."
        ],
        [
            "^ Bartolome, Jessica (August 27, 2017).",
            "\"Inside Culion, the Philippines' \"Island of No Return\"\".",
            "GMA News."
        ],
        [
            "^ a b \"Republic Act No.",
            "7193 - An Act Creating the Municipality of Culion in the Province of Palawan\".",
            "Chan Robles Virtual Law Library.",
            "19 February 1992.",
            "Retrieved 28 January 2016."
        ],
        [
            "^ \"PH NatCom visits Culion Island in Palawan\".",
            "UNESCO Philippines.",
            "2017."
        ],
        [
            "^ a b \"Nomination Information – Memory of the World Committee for Asia and the Pacific\".",
            "www.mowcapunesco.org."
        ],
        [
            "^ a b \"Culion Leprosy Archives (2018) – Memory of the World Committee for Asia and the Pacific\".",
            "www.mowcapunesco.org.",
            "June 18, 2018."
        ],
        [
            "^ Dr. Heiser, V., An American Doctor's Odyssey W. W. Norton & Company, 1936."
        ],
        [
            "^"
        ],
        [
            "\"Compostela: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 17 November 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Silvestre, Edmund (December 6, 2019).",
            "\"MMFF entry 'Culion' to mount red carpet world premiere in Culion, Palawan\".",
            "Sunstar Manila.",
            "Archived from the original on December 9, 2019.",
            "Retrieved December 26, 2019."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Culion."
        ],
        [
            "Culion Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Culion"
        ],
        [
            "Busuanga / Coron"
        ],
        [
            "South China Sea"
        ],
        [
            "Culion"
        ],
        [
            "Sulu Sea"
        ],
        [
            "Linapacan"
        ],
        [
            "Sulu Sea / Agutaya"
        ],
        [
            "vte Province of PalawanPuerto Princesa (capital and largest city)Municipalities"
        ],
        [
            "Aborlan"
        ],
        [
            "Agutaya"
        ],
        [
            "Araceli"
        ],
        [
            "Balabac"
        ],
        [
            "Bataraza"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Busuanga"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Coron"
        ],
        [
            "Culion"
        ],
        [
            "Cuyo"
        ],
        [
            "Dumaran"
        ],
        [
            "El Nido"
        ],
        [
            "Kalayaan"
        ],
        [
            "Linapacan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Narra"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "San Vicente"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Taytay"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Puerto Princesa (Administratively independent from the province but grouped under Palawan by the Philippine Statistics Authority.)"
        ],
        [
            "vteThe 40 largest islands of the Philippines"
        ],
        [
            "Alabat"
        ],
        [
            "Balabac"
        ],
        [
            "Basilan"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bucas Grande"
        ],
        [
            "Bugsuk"
        ],
        [
            "Burias"
        ],
        [
            "Busuanga"
        ],
        [
            "Calayan"
        ],
        [
            "Camiguin"
        ],
        [
            "Camiguin de Babuyanes"
        ],
        [
            "Cebu"
        ],
        [
            "Catanduanes"
        ],
        [
            "Culion"
        ],
        [
            "Dinagat"
        ],
        [
            "Dumaran"
        ],
        [
            "Guimaras"
        ],
        [
            "Jolo"
        ],
        [
            "Leyte"
        ],
        [
            "Lubang"
        ],
        [
            "Luzon"
        ],
        [
            "Masbate"
        ],
        [
            "Marinduque"
        ],
        [
            "Mindanao"
        ],
        [
            "Mindoro"
        ],
        [
            "Negros"
        ],
        [
            "Olutanga"
        ],
        [
            "Palawan"
        ],
        [
            "Panaon"
        ],
        [
            "Panay"
        ],
        [
            "Polillo"
        ],
        [
            "Samal"
        ],
        [
            "Samar"
        ],
        [
            "Siargao"
        ],
        [
            "Sibuyan"
        ],
        [
            "Siquijor"
        ],
        [
            "Tablas"
        ],
        [
            "Tawitawi"
        ],
        [
            "Ticao"
        ],
        [
            "Islands portal"
        ],
        [
            "See also"
        ],
        [
            "Geography of the Philippines"
        ],
        [
            "Island groups of the Philippines"
        ],
        [
            "List of islands"
        ],
        [
            "Authority control databases International"
        ],
        [
            "FAST"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Spain"
        ],
        [
            "Germany"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Culion&oldid=1220041436\""
        ],
        [
            "Categories: Calamian IslandsCulion leper colonyIsland municipalities in the PhilippinesMunicipalities of PalawanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from November 2012All articles needing additional referencesCoordinates on WikidataArticles containing Tagalog-language textArticles needing additional references from August 2018Commons category link from WikidataArticles with FAST identifiersArticles with VIAF identifiersArticles with BNE identifiersArticles with GND identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}