{
    "name": "Cuyo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cuyo, Palawan"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°51′N 121°01′E﻿ / ﻿10.85°N 121.02°E﻿ / 10.85; 121.02"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Palawan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Cuyo, Palawan\" – news · newspapers · books · scholar · JSTOR (December 2009) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Mimaropa, PhilippinesCuyoMunicipalityMunicipality of CuyoManamoc Island"
        ],
        [
            "FlagSealMap of Palawan with Cuyo highlightedOpenStreetMapCuyoLocation within the PhilippinesCoordinates: 10°51′N 121°01′E﻿ / ﻿10.85°N 121.02°E﻿ / 10.85; 121.02CountryPhilippinesRegionMimaropaProvincePalawanDistrict"
        ],
        [
            "1st districtBarangays17"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMark L. delos Reyes • Vice MayorAndrew L. Ong • RepresentativeFranz Josef George E. Alvarez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ronald P. SabuyaEdwin G. TimbancayaRonaldo C. Caabay Jr.Edwin A. dela TorreMichael S. CervanciaEdna C. TominesRaymundo M. Fernandez Jr.Pablito M. Cervancia"
        ],
        [
            " • Electorate14,912 voters (2022)Area • Revenue₱ 124.4 million (2020) • Assets₱ 291.8 million (2020) • Expenditure₱ 97.34 million (2020) • Liabilities₱ 122.7 million (2020)Service provider • ElectricityPalawan Electric Cooperative (PALECO)Time zoneUTC+8 (PST)ZIP code5318PSGC175310000IDD : area code +63 (0)48Native languagesCuyonon Palawano TagalogWebsitewww.cuyopalawan.gov.ph"
        ],
        [
            "Cuyo, officially the Municipality of Cuyo (Cuyonon: Banwa 'ang Cuyo, Tagalog: Bayan ng Cuyo),  is a 4th class municipality in the province of Palawan, Philippines.",
            "According to the 2020 census, it has a population of 23,489 people."
        ],
        [
            "Its territory includes the western half of Cuyo Island, as well as Bisucay, Caponayan, Cauayan, Imalaguan, Lubid, Manamoc, Pamalican, Pandan, Round, and Quiminatin islands, all part of the Cuyo Archipelago."
        ],
        [
            "Cuyo is the oldest town in Palawan which has a culture of its own and was preserved for more than 350 years.",
            "During the Spanish colonization of the Philippines, Cuyo became the second capital of Palawan after Puerto Princesa from 1873 to 1903."
        ],
        [
            "From the sea, Cuyo Island's first visible landmark is a lighthouse by the pier.",
            "Many of the streets leading to the town have already been cemented but the town has preserved the Hispanic plaza-iglesia structures.",
            "Dominating the town centre is Cuyo's 1860 church, convent, and fort built by the Spanish and finished in 1680.",
            "Nearby stands a schoolhouse, and a monument of national hero Jose Rizal."
        ],
        [
            "The municipality is served by Cuyo Airport in the neighboring municipality of Magsaysay.",
            "The town and its cultural and natural environs are being considered to be nominated in the tentative list for UNESCO World Heritage Site declaration in the future."
        ],
        [
            "History"
        ],
        [
            "Oriental traders were early discoverers of the Cuyo group of islands and introduced barter trading with the locals."
        ],
        [
            "Later, the Malay chief Matuod and his people arrived in big boats called sakayan and formed settlements on Cuyo.",
            "The Islamic chieftain Datu Magbanua later also settled on Cuyo, later consolidating his power so that chieftains from other islands recognized his rule.",
            "Other Cuyunon chieftains in nearby islands include Datu Cabaylo of Taytay, Datu Macanas of Busuanga and Datu Cabangon whose domain stretched South of Taytay towards Puerto Princesa.",
            "The Malays brought with them their dances, and when blended with native dance, the \"Soriano\", it became known as the \"pondo-pondo\" one of the most popular folk dances even up to the present."
        ],
        [
            "During the rule of Datu Magbanua, three Chinese arrived on the island and settled also on Cuyo.",
            "The Chinese discovered gold deposits in Mount Aguado and introduced gold mining, smith working, pottery, and other handicrafts.",
            "The natives of Cuyo became suspicious of their presence and later expelled them.",
            "They sailed to Ilongilong (today known as Iloilo) and formed another settlement called Parián."
        ],
        [
            "In 1622, the Conde de San Agustín, together with five Spanish missionaries, colonised the island they named Cuyo.",
            "The friendly character of the people proved to be a blessing to the Spaniards, who found it easy converting the native population to Catholicism.",
            "They immediately baptised some 500 inhabitants, however, many still regarded their indigenous Cuyonon religion as sacred and continued to perform Cuyonon rituals.",
            "The supreme deity of the Cuyunon people was Diwata ng Kagubatan (literally goddess of the forest), who was honored in a celebrated feast, periodically held atop of Mount Caimamis in Cuyo Island.",
            "When most of the natives were converted to Christianity during the Spanish Era, about 2/3 of the converted Cuyunon were still celebrating her feast, angering the Spanish imperialists.",
            "The situation led the Spanish authorities to intensify their evangelization and governance efforts, which included the forced Roman Catholic conversion of the Cuyonon people, burning of houses of non-Catholic Cuyonons, and massive slavery.",
            "Later, the Spanish called Diwata ng Kagubatan as Virgen Del Monte, in another bid to rebrand the deity as 'Catholic'.",
            "Prior to the institution of the Provincia de Calamianes, Cuyo was directly administered as part of the Island of Panay, while Coron islands were administered by the Spanish authorities of Mindoro."
        ],
        [
            "In 1636, a powerful fleet under the Muslim Datu Tagul raided Cuyo and other places in Palawan.",
            "In Cuyo, the Muslims attacked the church and clergy house.",
            "They set the town on fire and took with them prisoners including a priest, Fr.",
            "Francisco de Jesús María.",
            "They then sailed to Agutaya and Culion, where they pillaged and attacked defenceless civilians.",
            "The raiders abducted another priest from Culion, Fr.",
            "Alonzo de San Agustín, as he was saying Mass.",
            "A Spanish naval flotilla of six vessels and 250 men under Captain Nicolas Gonzáles met the returning pirates with their loot and booty on December 21, 1636.",
            "Datu Tagul was killed, 300 of his men captured, and 120 prisoners were freed.",
            "The two captured priests were killed."
        ],
        [
            "In 1957, the following sitios were converted to barrios: Emilod"
        ],
        [
            "Geography"
        ],
        [
            "Cuyo Archipelago, with elevations (in feet)."
        ],
        [
            "Cuyo Island is the largest island of the Cuyo Archipelago, about 13 kilometers (8.1 mi) long, 7.5 kilometers (4.7 mi) wide, and with an area of 57 square kilometers (22 sq mi).",
            "Mount Bonbon with an elevation of 817 feet (249 m) is the highest mountain in Cuyo island.",
            "The Island is under the jurisdiction of the municipalities of Cuyo and Magsaysay.",
            "The poblacion of Cuyo is home to a Spanish fort, which shelters a church and a convent in its high stone walls."
        ],
        [
            "Barangays"
        ],
        [
            "Cuyo is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "In 1956, sitio Danawan was elevated into a barrio."
        ],
        [
            "Balading"
        ],
        [
            "Bancal (Poblacion)"
        ],
        [
            "Cabigsing (Poblacion)"
        ],
        [
            "Caburian"
        ],
        [
            "Caponayan"
        ],
        [
            "Catadman (Poblacion)"
        ],
        [
            "Funda"
        ],
        [
            "Lagaoriao (Poblacion)"
        ],
        [
            "Lubid"
        ],
        [
            "Manamoc"
        ],
        [
            "Maringian"
        ],
        [
            "Lungsod (Poblacion)"
        ],
        [
            "Pawa"
        ],
        [
            "San Carlos"
        ],
        [
            "Suba"
        ],
        [
            "Tenga-tenga (Poblacion)"
        ],
        [
            "Tocadan (Poblacion)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Cuyo, Palawan (1981–2012, extremes 1905–2012)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "33.6(92.5)"
        ],
        [
            "33.6(92.5)"
        ],
        [
            "35.4(95.7)"
        ],
        [
            "38.4(101.1)"
        ],
        [
            "37.2(99.0)"
        ],
        [
            "35.6(96.1)"
        ],
        [
            "35.0(95.0)"
        ],
        [
            "35.0(95.0)"
        ],
        [
            "35.0(95.0)"
        ],
        [
            "34.8(94.6)"
        ],
        [
            "34.6(94.3)"
        ],
        [
            "33.4(92.1)"
        ],
        [
            "38.4(101.1)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30.3(86.5)"
        ],
        [
            "30.7(87.3)"
        ],
        [
            "31.9(89.4)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "32.1(89.8)"
        ],
        [
            "31.5(88.7)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "30.6(87.1)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "27.8(82.0)"
        ],
        [
            "28.0(82.4)"
        ],
        [
            "28.8(83.8)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "29.7(85.5)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "28.5(83.3)"
        ],
        [
            "28.6(83.5)"
        ],
        [
            "28.6(83.5)"
        ],
        [
            "28.7(83.7)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "28.7(83.7)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "25.4(77.7)"
        ],
        [
            "25.3(77.5)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "26.3(79.3)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "25.5(77.9)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "25.8(78.4)"
        ],
        [
            "26.2(79.2)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "25.8(78.4)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "20.1(68.2)"
        ],
        [
            "19.0(66.2)"
        ],
        [
            "20.4(68.7)"
        ],
        [
            "19.2(66.6)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "21.3(70.3)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "21.1(70.0)"
        ],
        [
            "21.3(70.3)"
        ],
        [
            "21.2(70.2)"
        ],
        [
            "19.4(66.9)"
        ],
        [
            "19.0(66.2)"
        ],
        [
            "19.0(66.2)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "7.4(0.29)"
        ],
        [
            "3.1(0.12)"
        ],
        [
            "19.8(0.78)"
        ],
        [
            "41.6(1.64)"
        ],
        [
            "193.1(7.60)"
        ],
        [
            "327.3(12.89)"
        ],
        [
            "402.9(15.86)"
        ],
        [
            "391.2(15.40)"
        ],
        [
            "341.5(13.44)"
        ],
        [
            "302.8(11.92)"
        ],
        [
            "112.3(4.42)"
        ],
        [
            "52.5(2.07)"
        ],
        [
            "2,195.6(86.44)"
        ],
        [
            "Average rainy days (≥ 0.1 mm)"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "3"
        ],
        [
            "13"
        ],
        [
            "19"
        ],
        [
            "21"
        ],
        [
            "19"
        ],
        [
            "20"
        ],
        [
            "16"
        ],
        [
            "6"
        ],
        [
            "4"
        ],
        [
            "124"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "82"
        ],
        [
            "82"
        ],
        [
            "81"
        ],
        [
            "80"
        ],
        [
            "82"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "83"
        ],
        [
            "82"
        ],
        [
            "83"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CuyoYearPop.±% p.a.1903 12,773—    1918 14,791+0.98%1939 17,492+0.80%1948 17,599+0.07%1960 20,394+1.24%1970 12,534−4.75%1975 12,839+0.48%1980 14,692+2.73%YearPop.±% p.a.1990 15,294+0.40%1995 16,694+1.65%2000 18,257+1.94%2007 20,040+1.29%2010 21,847+3.19%2015 22,360+0.44%2020 23,489+0.97%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Cuyo, Palawan, was 23,489 people, with a density of 280 inhabitants per square kilometer or 730 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cuyo"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  28.80"
        ],
        [
            "2009  20.37"
        ],
        [
            "2012  13.84"
        ],
        [
            "2015  10.01"
        ],
        [
            "2018  11.38"
        ],
        [
            "2021  21.03"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Fort Cuyo"
        ],
        [
            "Further information: Fort Cuyo"
        ],
        [
            "During the early Spanish period, purposely to protect the Cuyonon from sporadic Moro attacks, Fort Cuyo was constructed and finished in 1680.",
            "The original complex of stone and mortar was a square with four bastions.",
            "The present complex, which occupies 1 hectare (2.5 acres), is a solid rectangular edifice with walls 10 meters (33 ft) high and 2 meters (6 ft 7 in) thick.",
            "It has a tall belfry and watchtowers; its cannons, which face the sea, are now fired only during town celebrations.",
            "as one of the most ancient and unique forts in the Philippines.",
            "Unique in the sense that you can find the church, the convent and the Perpetual Adoration chapel all within the fort."
        ],
        [
            "In 1762 one of the British ships that invaded Manila fired at the Cuyo fort but it was not damaged at all.",
            "Another fort was started at Lucbuan seven kilometres away on the east side of Cuyo island, but it was never finished.",
            "In 1873, the capital of Paragua (present day Palawan) was transferred to Cuyo from Taytay."
        ],
        [
            "Culture"
        ],
        [
            "Despite its long history Cuyo has held back the hands of time and preserved its rich cultural heritage preserved since more than 350 years."
        ],
        [
            "The tipano band, a flute and drum marching band that is more similar to a corps of drums or a fife and drum corps, and the de kwerdas (string band), supply background music on important social occasions.",
            "They also accompany singers and render dance music like the pinundo-pundo.",
            "The tipano is reserved for the ati-ati, sinulog, and komedya."
        ],
        [
            "Both ensembles use available instruments and instrumentalists.",
            "The tipano core is basically two drums and four to seven transverse mouth flutes with six finger-holes.",
            "One or two tipano \"nga maite\" (small flutes) and three or four tipano \"nga mabael\" (larger flutes) are played with a redublante (snare drum), bombo (single tenor or bass drum), and sometimes a pair of platilyo.",
            "The de kwerdas has two or three sabel, and occasionally a guitar, a bajo (six-stringed bass), a banjo, and a banduria, with the occasional flutes and percussion (in modern ensembles an electric guitar is also used).",
            "In Cuyonon music the \"akompanimento\" refers to the harmonic accompaniment-principal or \"primera\" to the first or highest voice, and \"segunda\" to the second."
        ],
        [
            "The Cuyonon youth celebrate love with song during the post-harvest courting season.",
            "The Cancion, a popular serenade, is sung with the strumming of a five - or six-stringed guitar in the distinctive punctual manner.",
            "Parting is a familiar concern in Cuyunon love songs.",
            "Examples of love songs are \"Napopongao Ako\", \"Ang Gegma\", \"Ploning\", \"Daragang Taga Cuyo\", \"Konsomision\", \"Ako Maski Bayan\", \"Tiis Manong Pido\", \"Nagpamasiar Ako\", and \"Komosta\"."
        ],
        [
            "Cuyonon dances have evolved from native and Spanish influences.",
            "Among these are the Pastores (the Christmas dance of the sheppherds), the Chotis (from the German schothische), Lanceros de Cuyo (local French guadrille), Birginia (Virginia reel or square dance), Paraguanen (a romantic comic duet), and La Jota Paragua (a Castillan-type jota using bamboo castanets and manton).",
            "The island is known for the Mazurka de Cuyo, a social dance with characteristic mazurka steps.",
            "Another popular dance is the Pinundo-pundo, a stylish wedding dance marked by sudden pauses, its first two parts, featuring solo dances of the boy and the girl, are followed by the suring, a love play between the couple."
        ],
        [
            "The Cuyonon have developed the art of merging song, dance, and drama.",
            "Cuyo's Sayaw is a colorful enactment of a story heightened by the music of a string band.",
            "It is presented by five pairs of youth arranged in two lines, fully costumed and made up, and bearing props like flowers, crowns, and even knives.",
            "After an introductory dance, the leading couple proceed to relate the tale, sometimes using verse.",
            "The topic may be anything, from everyday occurrences to special events like winning the sweepstakes.",
            "This story is then interpreted in dance and ended with a finale."
        ],
        [
            "Feast of St. Augustine"
        ],
        [
            "Yearly on August 28, Cuyo Island celebrates San Agustin's feast, currently dubbed as the Purongitan Festival, marked as the main celebration of Cuyo town."
        ],
        [
            "On the eve of the fiesta, a cultural presentation featuring the traditional performing arts and sometimes a separate show of modern songs and dances may be presented.",
            "The feast day is begun with a morning mass (sometimes a High Mass officiated by the bishop) and followed by the Ati-ati, a legacy of the Aklanon migrants who left an impact to the town.",
            "Folk from the nearby islands board barotos (boats) to view the parade which recreates the confrontation of San Agustin and the native \"savages\".",
            "Participants portray the Aeta by darkening their bodies with soot and painting their faces with anyel (indigo).",
            "They don foot-high headgear of coconut ginit fiber adorned with chicken feathers, and decorate their costumes with coconut leaves.",
            "The men, clad in loin cloths, carry spears, bows and arrows, or bolo.",
            "The women, wearing patadyong and beaded necklaces, carry baskets with a tumpline."
        ],
        [
            "For years the participants from the town form two lines, one of men and the other of women.",
            "The director signals the start of the singing by striking his cane on the ground.",
            "This is followed by a spontaneous dance characterized by sways, hops, jumps, and the jerking of weapons accompanied by chanting; the director also signals the end of the dance.",
            "The village captain and his family may recite a series of verses.",
            "The director is then approached by the last to recite, customarily the role belongs to youngest child of the barangay captain's family assigned."
        ],
        [
            "As the floats of San Agustin and other saints enter the church at the end of the procession, the participants kneel, prostrate themselves, or sing while performing skipping steps before the images.",
            "The merrymaking intensifies when the alakayo, a dancing clown, chases the ladies, stopping only when coins are thrown to him on the ground.",
            "The alakayo collects the coins with his mouth."
        ],
        [
            "Today the dancing Ati-Ati are composed of groups of individuals from the villages of the town, which perform to a percussion band with flutes and guitars, a specialized combined form of the tipano and de kwerdas."
        ],
        [
            "Meanwhile, the panapatan performance are staged in front of various houses for a fee.",
            "These are mostly excerpts of the komedya and ati-ati known as komedya sa kalye and ati-ati sa bukid, the performers of which use simpler clothing than in the more elaborate full-length performances.",
            "Ati-ati sa bukid is sung and danced to celebrate a fruitful harvest.",
            "Today it is usually danced by young boys wearing masks or indigo-painted faces."
        ],
        [
            "Another pantomime, innocentes, recreates the descent of the \"savages\" from the hills to pay tribute to San Agustin.",
            "They are wearing coconut fibre masks and red striped shirts.",
            "The participants frolic and fence with sticks."
        ],
        [
            "Komedya or moro-moro performances are larger (with some 50 actors) and more refined than the ati-ati.",
            "The clash between the Muslims and the Christians is further dramatized by background music; commonly used tunes are the pasadoble, marchas, giyera, and kasal."
        ],
        [
            "The same subject is portrayed by the sinulog.",
            "The Christians are identified by their black costumes, kampilan, and elongated shields; the Muslims by their red turbans and waistbands, and round shields.",
            "The participants may wear masks or paint their faces.",
            "Both groups, usually of six dancers each, sometimes perform to the beating of tin cans.",
            "Alternate steps of offense and defense, e.g., advancing and retreating, with corresponding movements of weapons, are followed by circular formations simulating scenes of strategy plotting."
        ],
        [
            "Aguado pilgrimage"
        ],
        [
            "Mt.",
            "Aguado features life-size Stations of the Cross constructed from the foot to the peak of the mountain.",
            "Cuyonon devotees, visitors and tourists make the annual pilgrimage to Mt.",
            "Aguado as part of the penitential rites done in Cuyo during the Holy Week particularly on Holy Thursday."
        ],
        [
            "Education"
        ],
        [
            "Elementary Schools"
        ],
        [
            "Antipolo Elementary School"
        ],
        [
            "Balading Elementary School"
        ],
        [
            "Caponayan Elementary School"
        ],
        [
            "Cuyo Central School"
        ],
        [
            "Cuyo Miller School"
        ],
        [
            "Lubid Elementary School"
        ],
        [
            "Manamoc Elementary School"
        ],
        [
            "Maringian Elementary School"
        ],
        [
            "P.A.B.N.",
            "Bisucay Elementary School"
        ],
        [
            "P.A.B.N.",
            "Funda Elementary School"
        ],
        [
            "Pamitinan Elementary School"
        ],
        [
            "Pawa Elementary School"
        ],
        [
            "Suba Elementary School"
        ],
        [
            "Secondary Schools"
        ],
        [
            "Cuyo National High School"
        ],
        [
            "GAMNHS BISUCAY"
        ],
        [
            "Manamoc National High School"
        ],
        [
            "Pawa National High School"
        ],
        [
            "Saint Joseph Academy - Cuyo"
        ],
        [
            "San Carlos National High School"
        ],
        [
            "Suba National High School"
        ],
        [
            "Tertiary School"
        ],
        [
            "Palawan State University"
        ],
        [
            "See also"
        ],
        [
            "Islands portalPhilippines portal"
        ],
        [
            "List of islands of the Philippines"
        ],
        [
            "Saint Joseph Academy - Cuyo"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Cuyo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Cuyo Archived March 4, 2012, at the Wayback Machine, Official Website of the Province of Palawan.",
            "Accessed November 9, 2012."
        ],
        [
            "^ \"Cuyunon Island by Lydia Mary De Leon\".",
            "Archived from the original on March 4, 2010.",
            "Retrieved April 3, 2010."
        ],
        [
            "^ Republic Act No.",
            "1750 (June 21, 1957), An Act Converting the Sitio of Emilod, Municipality of Cuyo, Province of Palawan, into a Barrio of Said Municipality, The Corpus Juris, retrieved September 22, 2023"
        ],
        [
            "^ Republic Act No.",
            "1769 (June 21, 1957), An Act Creating the Barrio of Balading in the Municipality of Cuyo, Province of Palawan, The Corpus Juris, retrieved September 22, 2023"
        ],
        [
            "^ Republic Act No.",
            "3426 (June 18, 1961), An Act Creating the Municipality of Magsaysay in the Province of Palawan, The Corpus Juris, retrieved September 22, 2023"
        ],
        [
            "^ a b c \"Cuyo Island, Palawan, Philippines\".",
            "Ako Cuyonon.",
            "Retrieved November 9, 2012."
        ],
        [
            "^ \"An Act Converting the Sitio of Danawan, Municipality of Cuyo, Province of Palawan, into a Barrio of Said Municipality\".",
            "LawPH.com.",
            "Archived from the original on July 10, 2012.",
            "Retrieved April 12, 2011."
        ],
        [
            "^"
        ],
        [
            "\"Cuyo, Palawan Climatological Normal Values\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on October 13, 2018.",
            "Retrieved October 13, 2018."
        ],
        [
            "^"
        ],
        [
            "\"Cuyo, Palawan Climatological Extremes\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on October 13, 2018.",
            "Retrieved October 13, 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Palawan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Cuyo Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "2000 Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Cuyo, Palawan"
        ],
        [
            "AgutayaSulu Sea"
        ],
        [
            "Taytay / Sulu Sea"
        ],
        [
            "Cuyo"
        ],
        [
            "Magsaysay"
        ],
        [
            "Araceli / Sulu Sea"
        ],
        [
            "Sulu SeaCagayancillo"
        ],
        [
            "vte Province of PalawanPuerto Princesa (capital and largest city)Municipalities"
        ],
        [
            "Aborlan"
        ],
        [
            "Agutaya"
        ],
        [
            "Araceli"
        ],
        [
            "Balabac"
        ],
        [
            "Bataraza"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Busuanga"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Coron"
        ],
        [
            "Culion"
        ],
        [
            "Cuyo"
        ],
        [
            "Dumaran"
        ],
        [
            "El Nido"
        ],
        [
            "Kalayaan"
        ],
        [
            "Linapacan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Narra"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "San Vicente"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Taytay"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Puerto Princesa (Administratively independent from the province but grouped under Palawan by the Philippine Statistics Authority.)"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cuyo,_Palawan&oldid=1229346038\""
        ],
        [
            "Category: Municipalities of PalawanHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from December 2009All articles needing additional referencesUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cuyonon-language textArticles containing Tagalog-language textArticles with specifically marked weasel-worded phrases from November 2021Articles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}