{
    "name": "Dagami",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Dagami"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°03′40″N 124°54′11″E﻿ / ﻿11.0611°N 124.9031°E﻿ / 11.0611; 124.9031"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Leyte, Philippines"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesDagamiMunicipalityMunicipality of DagamiWelcome sign"
        ],
        [
            "FlagSealMap of Leyte with Dagami highlightedOpenStreetMapDagamiLocation within the PhilippinesCoordinates: 11°03′40″N 124°54′11″E﻿ / ﻿11.0611°N 124.9031°E﻿ / 11.0611; 124.9031CountryPhilippinesRegionEastern VisayasProvinceLeyteDistrict"
        ],
        [
            "2nd districtFounded1565Barangays65"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorInday Delusa • Vice MayorBunny Bardillon • RepresentativeLolita T. Javier • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Judy C. Dumduma, Jr.• Rolando A. Bud-oy• Andres Bryan M. Bayona• Jose Jingle Sudario• Caridad B. Cabidog• Jetromus Jose S. Bardillon• Susan O. Mendoza• Reynaldo O. TreceñeDILG Masterlist of Officials"
        ],
        [
            " • Electorate25,801 voters (2022)Area • Revenue₱ 138.3 million (2020) • Assets₱ 409.3 million (2020) • Expenditure₱ 135.5 million (2020) • Liabilities₱ 47.21 million (2020)Service provider • ElectricityDon Orestes Romualdez Electric Coperative (DORELCO)Time zoneUTC+8 (PST)ZIP code6515PSGC0803717000IDD : area code +63 (0)53Native languagesWaray TagalogWebsitewww.dagami-leyte.gov.ph"
        ],
        [
            "Dagami (IPA:"
        ],
        [
            "Waray-Waray is the language spoken by the residents called Dagamin-on."
        ],
        [
            "It is classified as a third class municipality and mere dependent on agriculture such as coconut, rice and corn farming.",
            "The employment rate is 63% of the total population workforce in the municipality.",
            "Its total land area of 161.5 square kilometers, equivalent to 16,165 hectares.",
            "More than half of its plains on the eastern side is cultivated for rice and corn farming while the western side is planted with coconut trees.",
            "Coconut production is a major source of income.Tubâ and copra - the white raw material from the coconut where coconut oil is extracted."
        ],
        [
            "The town of Dagami is famous for its local delicacies called binagól (a distinct dessert made from sweetened large mashed taro called talian packed inside a leaf-covered coconut shell), and morón (a kind of sweetened rice cake, optionally added with peanuts or chocolate wrapped inside a banana leaf) and sagmani."
        ],
        [
            "The town of Dagami, Leyte celebrates its feast every 27 May, to honor the town's patron, St. Joseph.",
            "They also celebrate this along with their festival, the Dinagamihan Festival"
        ],
        [
            "Etymology"
        ],
        [
            "When the Spanish conquistadors arrived in Leyte in 1521, trade mostly took place in the villages bordering the sea, where Dagilan was located.",
            "Locals indicate the name \"Dagami\" first arose during a confrontation between a group of Spaniards and a group of farmers during the Spanish colonial period:"
        ],
        [
            "One harvest season, Spanish soldiers inquired a group of men and women harvesting rice nearby the name of the community that was a few meters away.",
            "The natives thought that they were asking for a definite term for the field after rice had been harvested and answered, \"Dinagami, a Senior.\"",
            "The Spanish had such difficulty in pronouncing Dinagami that the natives ridiculed them.",
            "Having felt insulted, one of the civil guards shouted angrily in Spanish, \"Dagami or Dawian makes no difference!",
            "This place is Dagami, Dagami, Dagami!",
            "You Indios!",
            "What a queer language you speak.\"",
            "From then on, Dagilan was changed to Dagami by the village folk who thought the name was most suited for the place."
        ],
        [
            "History"
        ],
        [
            "St. Joseph Parish Church, where the statue of the town's patron saint, St. Joseph, is enshrined"
        ],
        [
            "According to legend, the island of Leyte was once divided into kingdoms or sultanates:"
        ],
        [
            "The most powerful sultanate in the island was Dagaran, the sultanate ruled by Diwaranda Mohammed.",
            "He had daughter named Sayajamburan who was sought by men everywhere.",
            "The nearby kingdoms were Bumbaran and Kahagna, sultanates of King Mapandara and King Mabanig, respectively.",
            "King Mapandara had a son named Bantugan who was the commander of his father's army and was sought after by many women because of his strength and good looks.",
            "Sayajamaburan was secretly enamored by Bantugan's physical and intellectual prowess.",
            "Bantugan has asked of her hand but was refused although he knew he had hopes of winning her in the end.",
            "The ruler of Kahagna, King Mabanig, was also a close rival of Bantugan.",
            "He was wealthy and got along well with everyone.",
            "When Sayajamaburan's father was dying, he chose Bantugan as his daughter's husband.",
            "Two days before the scheduled wedding, there was rejoicing everywhere except for King Mabanig who declared war against Bantugan's kingdom.",
            "Bantugan came out victorious and the wedding took place.",
            "Bumbaran, Dagaran and Kahagna then became one by affinity and conquest.",
            "The fusion of the three kingdoms made Dagara more powerful and respected."
        ],
        [
            "In 1478, two hundred years after the three sultanates unite into one kingdom, changes took place.",
            "Its capital, Dagilan, increased in population.",
            "The culture and social life of the kingdom further evolved with the entry of the Chinese and the Hindus.",
            "The people engaged in trade both with Asia and Europe."
        ],
        [
            "When the Spanish conquistadors arrived in Leyte in 1521, trade mostly took place in the villages bordering the sea, where Dagilan was located."
        ],
        [
            "Pulahan leader Faustino Ablen after he was captured by the Philippine Constabulary at his mountain hideout in Dagami on June 11, 1907"
        ],
        [
            "From 1902 to 1907 the Pulahanes challenged the American authorities in Leyte, led by Faustino Ablen (\"Papa Faustino\"), an illiterate peasant who assumed the title of pope.",
            "Ablen claimed to have supernatural powers and sold anting-anting that would render one invisible to the enemy and holy oil that could cure any ailment.",
            "In some battles, the Pulahanes managed to deploy five hundred to one thousand men.",
            "The government was so alarmed that it offered a 2000 peso reward for Papa Faustino, dead or alive.",
            "US Major General Leonard Wood sent four battalions of the US Army to Leyte to crush the rebellion.",
            "On June 11, 1907, a detachment of Philippine Scouts chanced upon four Pulahan fighters and opened fire.",
            "Three men escaped, but one was captured.",
            "He was Papa Faustino.",
            "With his capture, the rebellion in Leyte came to an end."
        ],
        [
            "During the second World War, Dagami became one of the major battlegrounds between American and Japanese forces.",
            "Its mountain ranges served as cover for the Japanese between their base in Ormoc City as the American forces were advancing during liberation.",
            "Hilabago became a major Japanese army base.",
            "The U.S. military built an access road to the upland mountain but with traces still visible today."
        ],
        [
            "Division into new towns"
        ],
        [
            "Dagami became the provincial capital of Leyte when the administration transferred to the interior lands after Dulag was ransacked and burned down by the Moro pirates which were constantly pillaging coastal towns and villages on Philippine islands.",
            "Around this time, the capital of the Spanish colonial government was still in Cebu."
        ],
        [
            "Clerico-military was the existing type of government that the Spaniards had imposed during the early period of colonization in the Philippines, with the church providing leadership among local people while the military providing the security aspects on securing the islands."
        ],
        [
            "When the Jesuits mission first landed in the Philippines, they were assigned to evangelize the island of Leyte and Samar and were allowed to establish their first rectory in Dagami."
        ],
        [
            "As early as 1613, the Jesuits mission established its rectory in what is now the Saint Joseph complex beside the municipal hall complex.",
            "This made the town a cabicera or the equivalent of provincial capital since around that period Palo and Tacloban were not existing yet."
        ],
        [
            "When the Jesuits were expelled in all dominions of the Spanish crown including the Philippines, the Augustinian mission which succeeded them transferred and established their mission in Palo and declared it as a town in 1768."
        ],
        [
            "In 1783, Burauen was carved out from the barrios of Dagami to become a separate town.",
            "Burauen used to be a missionary church under the diocese of Dagami."
        ],
        [
            "In 1883, the town of Pastrana was carved out from the barrios of Dagami.",
            "Years later, it reverted as part of Dagami in 1893 until it was finally settled as a separate municipality in 1912."
        ],
        [
            "In 1953, barangay Tabontabon together with other barangays of Dagami and Tanauan, were incorporated to constitute a new town of Tabontabon."
        ],
        [
            "In 1957, the barrios of Capahu-an and Guingawan were transferred to the newly founded town of Tabontabon, which used to be a barangay of Dagami."
        ],
        [
            "Geography"
        ],
        [
            "Dagami is bounded by Binahaan River across the municipality of Jaro on the northwest and the municipality of Pastrana, on the northeast.",
            "The municipality of Palo borders in the east while the municipality of Tanauan borders on the southeast.",
            "It is bounded in the south by the municipality of Tabontabon."
        ],
        [
            "In the west, it borders with the municipality of"
        ],
        [
            "Burauen and"
        ],
        [
            "Albuera."
        ],
        [
            "Over the mountain range on Dagami's western upland part, it borders with Ormoc City on the northwest."
        ],
        [
            "The town is located 32 kilometres (20 mi) from the provincial capital, Tacloban City."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Dagami, Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "78(3.1)"
        ],
        [
            "57(2.2)"
        ],
        [
            "84(3.3)"
        ],
        [
            "79(3.1)"
        ],
        [
            "118(4.6)"
        ],
        [
            "181(7.1)"
        ],
        [
            "178(7.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "172(6.8)"
        ],
        [
            "180(7.1)"
        ],
        [
            "174(6.9)"
        ],
        [
            "128(5.0)"
        ],
        [
            "1,598(62.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.7"
        ],
        [
            "13.8"
        ],
        [
            "17.3"
        ],
        [
            "18.5"
        ],
        [
            "23.2"
        ],
        [
            "26.5"
        ],
        [
            "27.1"
        ],
        [
            "26.0"
        ],
        [
            "26.4"
        ],
        [
            "27.5"
        ],
        [
            "24.6"
        ],
        [
            "21.0"
        ],
        [
            "268.6"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Barangays"
        ],
        [
            "Dagami is politically subdivided into 65 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Abaca"
        ],
        [
            "Abre"
        ],
        [
            "Balilit"
        ],
        [
            "Balugo"
        ],
        [
            "Banayon"
        ],
        [
            "Bayabas"
        ],
        [
            "Bolirao"
        ],
        [
            "Buenavista"
        ],
        [
            "Buntay"
        ],
        [
            "Caanislagan"
        ],
        [
            "Cabariwan"
        ],
        [
            "Cabuloran"
        ],
        [
            "Cabunga-an"
        ],
        [
            "Calipayan"
        ],
        [
            "Calsadahay"
        ],
        [
            "Caluctogan"
        ],
        [
            "Calutan"
        ],
        [
            "Camono-an"
        ],
        [
            "Candagara"
        ],
        [
            "Canlingga"
        ],
        [
            "Cansamada East"
        ],
        [
            "Cansamada West"
        ],
        [
            "Capulhan"
        ],
        [
            "Digahongan"
        ],
        [
            "Guinarona"
        ],
        [
            "Hiabangan"
        ],
        [
            "Hilabago"
        ],
        [
            "Hinabuyan"
        ],
        [
            "Hinologan"
        ],
        [
            "Hitumnog"
        ],
        [
            "Katipunan"
        ],
        [
            "Lapu-lapu Pob.",
            "(Dist.",
            "2)"
        ],
        [
            "Lobe-lobe"
        ],
        [
            "Lobe-lobe East"
        ],
        [
            "Los Martires"
        ],
        [
            "Lusad Pob.",
            "(Dist.",
            "6)"
        ],
        [
            "Macaalang"
        ],
        [
            "Maliwaliw"
        ],
        [
            "Maragondong"
        ],
        [
            "Ormocay"
        ],
        [
            "Palacio"
        ],
        [
            "Panda"
        ],
        [
            "Paraiso"
        ],
        [
            "Patoc"
        ],
        [
            "Plaridel"
        ],
        [
            "Poponton"
        ],
        [
            "Rizal"
        ],
        [
            "Salvacion"
        ],
        [
            "Sampaguita"
        ],
        [
            "Sampao East Pob.",
            "(Dist.",
            "9)"
        ],
        [
            "Sampao West Pob.",
            "(Dist.",
            "8)"
        ],
        [
            "San Antonio Pob.",
            "(Dist.",
            "5)"
        ],
        [
            "San Benito"
        ],
        [
            "San Jose Pob.",
            "(Dist.",
            "1)"
        ],
        [
            "San Roque Pob.",
            "(Dist.",
            "3)"
        ],
        [
            "Santa Mesa Pob.",
            "(Dist.",
            "7)"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sawahon"
        ],
        [
            "Sirab"
        ],
        [
            "Tagkip"
        ],
        [
            "Talinhugon"
        ],
        [
            "Tin-ao"
        ],
        [
            "Tunga Pob.",
            "(Dist.",
            "4)"
        ],
        [
            "Tuya"
        ],
        [
            "Victoria"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of DagamiYearPop.±% p.a.1903 12,591—    1918 17,803+2.34%1939 22,776+1.18%1948 20,361−1.24%1960 18,777−0.67%1970 19,846+0.55%1975 21,026+1.17%1980 22,021+0.93%YearPop.±% p.a.1990 25,606+1.52%1995 27,039+1.03%2000 29,240+1.69%2007 30,451+0.56%2010 31,490+1.23%2015 35,147+2.11%2020 36,178+0.57%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Dagami, Leyte, was 36,178 people, with a density of 220 inhabitants per square kilometre or 570 inhabitants per square mile."
        ],
        [
            "The people of Dagami speak Waray, a native language of Leyte and Samar.",
            "Waray is closely related to other Visayan languages particularly Hiligaynon and to a lesser extent Cebuano which is spoken by people of greater geographic proximity mainly in western municipalities of Leyte and of entire Southern Leyte."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Dagami"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  30.60"
        ],
        [
            "2009  34.99"
        ],
        [
            "2012  46.17"
        ],
        [
            "2015  38.96"
        ],
        [
            "2018  33.68"
        ],
        [
            "2021  31.21"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Rice and coconut production is the primary economic source of income for the townsfolk.",
            "Aside from farming, food processing is another source of income for the town of Dagami.",
            "Recently, an upsurge in labor export (OFWs) have contributed to remittances of income from abroad.",
            "Commercial businesses are limited to retailing while trading activities are limited to rice and copra trading."
        ],
        [
            "Despite popularity of its indigenous food product - the Binagol, Dagami has yet to maximize its economic potentials, such as creation of labor during its production line, income to be generated from sales, and revenue for the local government in terms of income taxes."
        ],
        [
            "Chief economic products of the municipality are the following:"
        ],
        [
            "Copra - Production of copra - a by-product of coconut tree fruit is the main industry of the townfolks.",
            "The growth of local economy is highly dependent on copra production due to price fluctuation in the market of its by-products such as oil, dissicated coconuts, and other raw materials made from leaves, bark, and the coconut fruit itself."
        ],
        [
            "Rice - Rice farming is the second source of livelihood for the people of Dagami.",
            "Almost half of the land area is planted with different variety of rice stocks.",
            "It is likewise the second most traded product in the town next to copra."
        ],
        [
            "Binagol - The town of Dagami is known for its local delicacy, the \"Binagol\" - a sweet, glutinous mixture of cassava, legume crop and other ingredients cooked with filling made of sugar, coconut and milk placed in a coconut shell or \"bagul\" and wrapped with banana leaves.",
            "Dagami also has other local delicacies such as \"Sagmani\", and \"Moron\".",
            "The \"binagol\" is sold in the city market primarily in Tacloban City while some reach the international markets."
        ],
        [
            "Tuba - Tuba is a well-known drink to Leyteños.",
            "Aside from copra production, the gathering of this product from coconut sap is another source of livelihood for Dagami-ons.",
            "\"Tuba\" is then traded in the market by local entrepreneurs but often sold directly by the gatherers."
        ],
        [
            "Finance"
        ],
        [
            "Dagami's total Internal Revenue Allotment (IRA) for fiscal year 2009 is P49,212,979, placing the town at no.",
            "17 among the 41 towns of Leyte.",
            "From year 2003 to 2009 alone, Dagami has generated P249,089,980 for the municipal government.",
            "This is on top of local revenue sources which are the business and real property taxes including levies, fees and other charges."
        ],
        [
            "Fiscal year"
        ],
        [
            "Amount of I.R.A."
        ],
        [
            "2003"
        ],
        [
            "28,766,859"
        ],
        [
            "2004"
        ],
        [
            "28,750,702"
        ],
        [
            "2005"
        ],
        [
            "28,745,616"
        ],
        [
            "2006"
        ],
        [
            "34,028,285"
        ],
        [
            "2007"
        ],
        [
            "37,554,040"
        ],
        [
            "2008"
        ],
        [
            "42,031,499"
        ],
        [
            "2009"
        ],
        [
            "49,212,979"
        ],
        [
            "2010"
        ],
        [
            "54,888,115"
        ],
        [
            "2011"
        ],
        [
            "59,682,268"
        ],
        [
            "2012"
        ],
        [
            "57,732,620"
        ],
        [
            "2013"
        ],
        [
            "data unavailable"
        ],
        [
            "2014"
        ],
        [
            "71,524,283"
        ],
        [
            "2015"
        ],
        [
            "82,221,650"
        ],
        [
            "2016"
        ],
        [
            "89,989,649"
        ],
        [
            "2017"
        ],
        [
            "data unavailable"
        ],
        [
            "2018"
        ],
        [
            "data unavailable"
        ],
        [
            "Tourism"
        ],
        [
            "Mount Amandewing, the highest point in Leyte Province."
        ],
        [
            "Rivers"
        ],
        [
            "The town of Dagami is traversed by many rivers and streams upland.",
            "The biggest river is Panda River which cuts across the town's north-east section.",
            "Sawahon River is among its tributaries which is also joined up stream by its major tributaries such as Hilabago River, Kababatuan Dako (Greater Stones) River and Kababatuan Guti (Smaller Stones) River."
        ],
        [
            "During the rainy season, when these rivers rise, the downtown or Poblacion is flooded causing damages to property.",
            "A river dike which is also a diversion road was built to protect the town center.",
            "But as the river rises higher than the dike, it overflows causing more water to flood the town center."
        ],
        [
            "Mountains"
        ],
        [
            "The majestic Mount Amandiwing located near Dagami is the highest peak in Leyte.",
            "The imposing mountain is a protected natural park where wildlife such as pigs, deer and monkeys are hunted by local hunters despite by a local ban.",
            "During the 1960s, a logging concession was permitted to cut its virgin forests but the concessionaire never replanted trees.",
            "Locals exploited the situation by farming the logged area and creating coconut plantations."
        ],
        [
            "The mountain is best viewed from the town proper.",
            "On approach to the town proper, the mountain is an imposing majestic hill where smokes billow from different parts like chimneys.",
            "Up in the mountain near its peak, one could see the vast Pacific Ocean."
        ],
        [
            "Government"
        ],
        [
            "Municipal Hall of Dagami, Leyte"
        ],
        [
            "The Millennium Arc - the main entrance to the town square, where the Dagami Municipal Hall is located."
        ],
        [
            "Esmeralda Ortega"
        ],
        [
            "The incumbent Municipal Mayor of Dagami is Abundio I. Delusa, popularly known to Dagamin-ons as \"DEO\".",
            "Delusa was first elected as Dagami's Boholano mayor in May 2013, defeating \"Koko Ortega\"."
        ],
        [
            "List of former chief executives"
        ],
        [
            "Mayor"
        ],
        [
            "Start of term"
        ],
        [
            "Ending of term"
        ],
        [
            "1"
        ],
        [
            "Pedro Sudario"
        ],
        [
            "1895"
        ],
        [
            "1901"
        ],
        [
            "2"
        ],
        [
            "Fabian Perido"
        ],
        [
            "1901"
        ],
        [
            "1906"
        ],
        [
            "3"
        ],
        [
            "Cecilio Limchaypo"
        ],
        [
            "1907"
        ],
        [
            "1910"
        ],
        [
            "4"
        ],
        [
            "Simeon Cañete"
        ],
        [
            "1911"
        ],
        [
            "1914"
        ],
        [
            "5"
        ],
        [
            "Ciriaco Bayona"
        ],
        [
            "1915"
        ],
        [
            "1921"
        ],
        [
            "6"
        ],
        [
            "Antonio Ubaldo"
        ],
        [
            "1922"
        ],
        [
            "1924"
        ],
        [
            "7"
        ],
        [
            "Atilano Cinco"
        ],
        [
            "1925"
        ],
        [
            "1937"
        ],
        [
            "8"
        ],
        [
            "Homobono Bardillon"
        ],
        [
            "1938"
        ],
        [
            "1941"
        ],
        [
            "9"
        ],
        [
            "Cesar Sudario, Sr."
        ],
        [
            "1941"
        ],
        [
            "1944"
        ],
        [
            "10"
        ],
        [
            "Meliton Iroy, Sr."
        ],
        [
            "1945"
        ],
        [
            "1945"
        ],
        [
            "11"
        ],
        [
            "Pablo Ontimare, Sr."
        ],
        [
            "January 1947"
        ],
        [
            "June 1947"
        ],
        [
            "12"
        ],
        [
            "Fermin Lymchaypo"
        ],
        [
            "June 1947"
        ],
        [
            "December 1947"
        ],
        [
            "13"
        ],
        [
            "Cesario Sudario, Sr."
        ],
        [
            "1948"
        ],
        [
            "1951"
        ],
        [
            "14"
        ],
        [
            "Fernando Sudario, Sr."
        ],
        [
            "1952"
        ],
        [
            "1955"
        ],
        [
            "15"
        ],
        [
            "Pablo Ibañez"
        ],
        [
            "1956"
        ],
        [
            "1959"
        ],
        [
            "16"
        ],
        [
            "Felipe Quinia"
        ],
        [
            "1960"
        ],
        [
            "1963"
        ],
        [
            "17"
        ],
        [
            "Serafin Nicolas, Sr."
        ],
        [
            "1964"
        ],
        [
            "1967"
        ],
        [
            "18"
        ],
        [
            "Juan C. Vertulfo, Jr."
        ],
        [
            "1968"
        ],
        [
            "1980"
        ],
        [
            "19"
        ],
        [
            "Necitas M. Martillo"
        ],
        [
            "1980"
        ],
        [
            "April 1986"
        ],
        [
            "20"
        ],
        [
            "Pablo M. Ontimare, Jr."
        ],
        [
            "April 1986"
        ],
        [
            "November 1986"
        ],
        [
            "21"
        ],
        [
            "Olimpio O. Salvatierra"
        ],
        [
            "December 1986"
        ],
        [
            "January 1987"
        ],
        [
            "22"
        ],
        [
            "Adolfo A. Ortega"
        ],
        [
            "1987"
        ],
        [
            "1992"
        ],
        [
            "23"
        ],
        [
            "Benedicto C. Ortega"
        ],
        [
            "June 30, 1992"
        ],
        [
            "June 30, 1995"
        ],
        [
            "24"
        ],
        [
            "Adolfo A. Ortega"
        ],
        [
            "June 30, 1995"
        ],
        [
            "October 2001"
        ],
        [
            "25"
        ],
        [
            "Gavino Dario O. Berino III"
        ],
        [
            "October 20, 2001"
        ],
        [
            "June 30, 2004"
        ],
        [
            "26"
        ],
        [
            "Esmeralda B. Ortega"
        ],
        [
            "July 1, 2004"
        ],
        [
            "June 30, 2013"
        ],
        [
            "27"
        ],
        [
            "Abundio I. Delusa"
        ],
        [
            "July 1, 2013"
        ],
        [
            "present"
        ],
        [
            "b  At this time, after the People Power Revolution, President Corazon Aquino forced the resignation of all local government unit heads and appointed officers in charge in their place."
        ],
        [
            "Municipal seal"
        ],
        [
            "The Dagami Municipal Seal represents the town's humble achievements.",
            "The center of the seal shows the town's Municipal Hall (above), the seat of Dagami's local government.",
            "Its upper left side features the St. Joseph Parish of Dagami and the other side shows a faucet that represents Dagami as the source of fresh water of the Leyte Metropolitan Water District (LMWD), the local distributor of fresh water in the 1st District Leyte, namely where the capital of the Province is, Tacloban City.",
            "The lower part of the Seal on the left side symbolizes the Municipality's dependency on agriculture, and the other side features the local delicaicies of the town, especially the \"Binagol\" or sometimes known as \"Lidguid\".",
            "The major colors of the seal are green and yellow, the colours of the St. Joseph Parish, where the statue of the town's Patron Saint, St. Joseph is enshrined and beautifully presented in a wooden and hand-decorated altar."
        ],
        [
            "Education"
        ],
        [
            "Local townfolks recognize the importance of education, hence local leaders are working very hard to provide the people access to education as most prominent higher educational institutions in Leyte are in the provincial capital, Tacloban City, Tabontabon, and Tanauan.",
            "When the town became the capital of the Jesuits, the friars established a school which still stands today."
        ],
        [
            "Primary Schools"
        ],
        [
            "Almost all barangays in the town have primary and intermediate schools.",
            "The five major elementary schools are Dagami North Central School, Dagami South Central School, both situated just a few meters apart in the town proper, Patoc Elementary School in the north, Guinarona Elementary School in the West and Balilit Elementary School in the south."
        ],
        [
            "Secondary Schools"
        ],
        [
            "The town has eight secondary schools in different locations within the town; seven public high schools and one private high school run by a local parish."
        ],
        [
            "Of the eight secondary schools, three are senior high schools and five are junior high schools."
        ],
        [
            "The senior high schools are Patoc Senior High School, Guinarona Senior High School and Sta.",
            "Mesa Senior High School."
        ],
        [
            "Patoc is the only village with separate campuses for elementary, junior high school and senior high school, all within its administrative jurisdiction.",
            "Barangay Patoc is now distinguished as the only barangay government unit within the municipality of Dagami having three separate campuses for basic education."
        ],
        [
            "Patoc National High School used to be integrated within the campus of Patoc Elementary School until it established its own campus beginning in 1986.",
            "With the implementation of K-12 reform for basic education, a separate campus for senior high school program was established in another location."
        ],
        [
            "The newest secondary high school to open is Cansamada National High School in Barangay Cansamada East which is the southernmost village of the town."
        ],
        [
            "The lone private, Catholic-run high school is Saint Joseph High School located in the town center.",
            "It is one of the oldest schools in the Philippines established by the Jesuits in the 1600s when they first established their rectory in the town upon landing in Philippine islands during the early century of Spain's conquest of the Philippines."
        ],
        [
            "A tertiary training institute in Patoc was attempted but was short-lived due to lack of funding as it was run privately by the local parish.",
            "The"
        ],
        [
            "Huron Institute which opened as a vocational training center assisted by the Technical Education and Skills Development Authority or TESDA, closed down after a couple of years in operation with some of its graduates gainly employed afterwards."
        ],
        [
            "Further reading"
        ],
        [
            "Leyte: Towns' Historical Legends By Francisco Tantuico, Jr."
        ],
        [
            "2007 Town Fiesta Programme by the Dagami Fiesta Committee"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Dagami |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^  https://en-us.topographic-map.com/maps/olw0/Dagami/.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Leyte\".",
            "Philippine Information Agency.",
            "Archived from the original on 2019-07-29.",
            "Retrieved 2019-07-29."
        ],
        [
            "^ Constantino, Renato (1975).",
            "The Philippines: A Past Revisited (PDF)."
        ],
        [
            "^ The Colonial Odyssey of Leyte by Rolando Borrinaga and Father Cantius J. Kobak OFM, an English translation of Reseña de la Provincia de Leyte por Manuel Artigas y Cuerva."
        ],
        [
            "^ \"An Act Transferring the Barrios of Capahu-an and Guingawan, Municipality of Dagami, Province of Leyte, to the Municipality of Tabontabon\".",
            "LawPH.com.",
            "Retrieved 2011-04-12."
        ],
        [
            "^"
        ],
        [
            "\"Dagami: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 February 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Dagami."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Dagami"
        ],
        [
            "Pastrana"
        ],
        [
            "Ormoc"
        ],
        [
            "Dagami"
        ],
        [
            "Tanauan"
        ],
        [
            "Burauen"
        ],
        [
            "Tabontabon"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Dagami&oldid=1164035685\""
        ],
        [
            "Category: Municipalities of Leyte (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 errors: missing titleCS1 errors: bare URLCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from August 2011Articles with unsourced statements from October 2011Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}