{
    "name": "Dasol",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Dasol"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIgboIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°59′23″N 119°52′50″E﻿ / ﻿15.98964°N 119.88053°E﻿ / 15.98964; 119.88053"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pangasinan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Dasol\" – news · newspapers · books · scholar · JSTOR (November 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesDasolMunicipalityMunicipality of DasolWelcome arc"
        ],
        [
            "SealMap of Pangasinan with Dasol highlightedOpenStreetMapDasolLocation within the PhilippinesCoordinates: 15°59′23″N 119°52′50″E﻿ / ﻿15.98964°N 119.88053°E﻿ / 15.98964; 119.88053CountryPhilippinesRegionIlocos RegionProvincePangasinanDistrict"
        ],
        [
            "1st districtFounded1 January 1911Barangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRizalde J. Bernal • Vice MayorEdgardo C. Fontelera • RepresentativeArthur F. Celeste • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Angelo Emmanuel M. GabuyoMark Anthony J. CarreraNelson C. EspinosaLoreto B. RiazaManuel B. RiveraGerardo M. RiveraJon Ray S. AseoRichard B. Garcia"
        ],
        [
            " • Electorate23,178 voters (2022)Area • Revenue₱ 137.7 million (2020) • Assets₱ 470.6 million (2020) • Expenditure₱ 105.9 million (2020) • Liabilities₱ 76.79 million (2020)Service provider • ElectricityPangasinan 1 Electric Cooperative (PANELCO 1) • WaterDasol Water District • TelecommunicationsSmart  Globe  Digitel • Cable & SatelliteCignal  Sky Direct  G SatTime zoneUTC+8 (PST)ZIP code2411PSGC015519000IDD : area code +63 (0)75Native languagesPangasinan Tagalog Ilocano SambalMajor religions Roman Catholic  Iglesia ni Cristo  Iglesia Filipina Independiente  Protestantism Feast date1st Friday of LentPatron saintSaint Vincent FerrerWebsitewww.dasol.gov.ph"
        ],
        [
            "Dasol, officially the Municipality of Dasol (Pangasinan: Baley na Dasol; Ilocano: Ili ti Dasol; Tagalog: Bayan ng Dasol), is a 3rd class municipality in the province of Pangasinan, Philippines.",
            "According to the 2020 census, it has a population of 31,355 people."
        ],
        [
            "Dasol is a popular town for the production of commercial salts.",
            "Seawater is fed into large ponds and water is drawn out through natural evaporation which allows the salt to be harvested.",
            "Dasol Bay occupies the whole coastline of Dasol and it is where the town gets its saltwater."
        ],
        [
            "Dasol is 302 kilometers (188 mi) north from Metro Manila and 96 kilometers (60 mi) from Lingayen."
        ],
        [
            "Etymology"
        ],
        [
            "Dasol landmark"
        ],
        [
            "The town got its name from the medicinal herb \"dosol\" which abound in the locality during the Spanish period.",
            "The leaves of this herbal plant are greenish and oval in shape.",
            "It is a tuber relatively very low in height.",
            "It was commonly used to cure infected wounds, but was found to have the unusual characteristic of miraculously disappearing (abandoning its post) for unknown reason never to be located again.",
            "Its name was frequently mispronounced as Dasol by the Spaniards, so that when the place was established as municipality in the 19th century, Dasol became its official name."
        ],
        [
            "History"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "As early as 1878, Dasol was part of municipality of San Isidro de Potot, which also include the present-day municipalities of Mabini (at that time was named as Barrio Balincaguin), and Burgos, in Zambales province.",
            "At that time, there were few people lived in Dasol.",
            "Balincaguin was the most thickly populated barrio and later became an independent municipality.",
            "The people, in their desire for better living conditions, moved to the south-west.",
            "They found good fishing grounds and they decided to stay along the coast in the barrio of Uli, Dasol.",
            "Dasol was repopulated by the Ilocano settlers from Paoay, Ilocos Norte headed by Don Matias Guiang in 1830."
        ],
        [
            "Philippine Revolution"
        ],
        [
            "A revolutionary group was organized in the Central Luzon on January 14, 1898, under General Francisco Macabulos.",
            "The Pangasinan sub-group was headed by Vicente del Prado, who together with Daniel Maramba reached an understanding to launch an attack on Spanish situations.",
            "On March 7, 1898, a simultaneous attack was suddenly made upon convents in number of towns of western Pangasinan (then as northern Zambales).",
            "Areas of San Isidro de Potot, Dasol (proper), and Eguia were among attacked.",
            "The Spanish detachments in these towns and around fifty Spanish friars were defeated."
        ],
        [
            "American invasion era"
        ],
        [
            "Secession from Zambales and other towns"
        ],
        [
            "On November 7, 1903, the northern part of Zambales was annexed to the province of Pangasinan by virtue of Act No.",
            "1004.",
            "The municipalities ceded were Alaminos, Bolinao, Anda, San Isidro de Potot, Bani, Agno, and Infanta.",
            "Townsfolk cited alleged lack of concern for the towns' interest and welfare by the Zambales provincial government and was encouraged to join Pangasinan province.",
            "However, for allegedly the same reason, there was a movement to rejoin Zambales, which clamor was aroused by the incumbency of then President Ramon Magasaysay, a Zambales-born president in the middle of the 1950s.",
            "This proposal was wiped out completely when Governor Aguedo Agbayani of Pangasinan became the governor."
        ],
        [
            "In 1911, by virtue of Executive Order No.",
            "25, signed by Governor-General William Cameron Forbes, Dasol seceded from San Isidro de Potot, San Isidro de Potot was renamed as Burgos (in honor of José Apolonio Burgos) and Balincaguin was renamed as Mabini (in honor of Apolinario Mabini)."
        ],
        [
            "Boundary issues"
        ],
        [
            "Ever since its creation, the boundaries of Dasol with the municipalities of Burgos, Mabini and Infanta remain vague, for what the leaders of Dasol had claimed to be the boundaries then agreed upon and as allegedly borne out by records, are no longer respected by the respective officials of said adjoining municipalities.",
            "Instead, they have encroached into Dasol's domain.",
            "During the incumbency of Mayor Liceralde, he made an attempt to settle Dasol's boundary with Mabini, but even after two separate conferences between the officials of the two towns were already had, each group was adamant in its own version.",
            "Considering that there was no visible sign of a probability for an amicable settlement of the dispute, the idea was abandoned so as to give way to court battle.",
            "He allegedly said that it was time-consuming to gather relevant documentary evidence (parol evidence no longer available due to the death of reliable witnesses) that would clinch the case for Dasol.",
            "The same appears to be true with respect to the other boundary conflicts."
        ],
        [
            "Japanese occupation"
        ],
        [
            "Dasol Bay witnessed several naval battles in World War II.",
            "On August 23, 1944, while searching for new targets, the American submarines USS Harder and USS Hake were attacked by Kaibokan CD-22 and PB-102 (ex-USS Stewart (DD-224)).",
            "Thinking that it was just a Japanese minesweeper and a three-stack Thai destroyer Phra Ruang, the Japanese vessel operated in consort with the anti-submarine vessel attacked and sank the Harder through with depth charges.",
            "The Hake was also attacked but escaped and arrived at Fremantle Harbor, Australia on September 24, 1944."
        ],
        [
            "On November 6, 1944, while guarding convoy Ma-Ta 31, the Japanese cruiser Kumano was attacked by a US submarine wolf-pack consisting of the Batfish, the Guitarro, the Bream, theRaton and the Ray.",
            "In all, the American submarines launched 23 torpedoes towards the convoy, two of which struck the Kumano.",
            "The first hit destroyed the ship's recently replaced bow, and the second damaged its starboard engine room.",
            "The Kumano escaped and was towed to Dasol Bay by the cargo ship Doryo Maru, and from there the ship was moved to the beach and underwent repairs.",
            "On November 25, 1944, the Kumano came under aerial attack by aircraft launched by the USS Ticonderoga.",
            "Five torpedoes and four 500 pound bombs struck the ship, and rolled over and sank in about 31 m (100 ft) of water."
        ],
        [
            "Geography"
        ],
        [
            "Dasol is a small town in western Pangasinan, situated in a plateau.",
            "It is bounded on the north by the municipalities of Burgos and Mabini, the mineral-rich Zambales mountains in the east, the municipality of Infanta on the south, and the vast South China Sea on the west.",
            "It has an area of about 230 square kilometers."
        ],
        [
            "Barangays"
        ],
        [
            "Barangays of Dasol"
        ],
        [
            "Dasol is politically subdivided into 18 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alilao"
        ],
        [
            "Amalbalan"
        ],
        [
            "Bobonot"
        ],
        [
            "Eguia"
        ],
        [
            "Gais-Guipe"
        ],
        [
            "Hermosa"
        ],
        [
            "Macalang"
        ],
        [
            "Magsaysay"
        ],
        [
            "Malacapas"
        ],
        [
            "Malimpin"
        ],
        [
            "Osmeña"
        ],
        [
            "Petal"
        ],
        [
            "Poblacion"
        ],
        [
            "San Vicente"
        ],
        [
            "Tambac"
        ],
        [
            "Tambobong"
        ],
        [
            "Uli"
        ],
        [
            "Viga"
        ],
        [
            "Dasol had seven barrios (now called barangay) when it was created.",
            "These were Tambobong, Tanobong, Uli, Malacapas, Bongalon, Alilao and Poblacion.",
            "Eguia was then part of Infanta and was annexed to Dasol in 1925.",
            "As years went by and due to its increasing population, two more barrios were created.",
            "Eguia was divided to form other three barangays namely Macalang, Viga and Tambac.",
            "Then came the time when Tambobong was to create Magsaysay and Tanobong (Malimpin) was divided to create San Vicente.",
            "Later, Bongalon (Hermosa) was divided to create Petal out of its two sitios Penec and Espital and from Alilao, two more barangays were formed now known as Amalbalan and Gais-Guipe.",
            "The sitios of Macalang, Pantol, Tapac and Pagdagaan were constituted into a barrio of Macalang by virtue of Republic Act 1707."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Dasol, Pangasinan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "4.3(0.17)"
        ],
        [
            "19.1(0.75)"
        ],
        [
            "27.3(1.07)"
        ],
        [
            "45.2(1.78)"
        ],
        [
            "153.3(6.04)"
        ],
        [
            "271.3(10.68)"
        ],
        [
            "411.1(16.19)"
        ],
        [
            "532(20.9)"
        ],
        [
            "364.4(14.35)"
        ],
        [
            "182.5(7.19)"
        ],
        [
            "56.3(2.22)"
        ],
        [
            "24.4(0.96)"
        ],
        [
            "2,091.2(82.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "5"
        ],
        [
            "14"
        ],
        [
            "17"
        ],
        [
            "22"
        ],
        [
            "23"
        ],
        [
            "21"
        ],
        [
            "13"
        ],
        [
            "7"
        ],
        [
            "4"
        ],
        [
            "134"
        ],
        [
            "Source: World Weather Online (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of DasolYearPop.±% p.a.1918 3,107—    1939 7,472+4.27%1948 9,141+2.27%1960 11,043+1.59%1970 12,955+1.61%1975 15,304+3.40%1980 16,957+2.07%1990 19,671+1.50%1995 23,551+3.43%2000 25,381+1.62%2007 27,027+0.87%2010 26,991−0.05%2015 29,110+1.45%2020 31,355+1.47%Source: Philippine Statistics Authority"
        ],
        [
            "Religions"
        ],
        [
            "Jehovah's Witnesses"
        ],
        [
            "Roman Catholic Church"
        ],
        [
            "Philippine Independent Church"
        ],
        [
            "Iglesia ni Cristo"
        ],
        [
            "United Methodist Church"
        ],
        [
            "Assembly of God"
        ],
        [
            "Pentecostal"
        ],
        [
            "Seventh Day Adventist"
        ],
        [
            "Iglesia Mistica De Dios"
        ],
        [
            "Jesus is Lord"
        ],
        [
            "Lord of the Harvests"
        ],
        [
            "Economy"
        ],
        [
            "Salt Evaporation Pond Industry"
        ],
        [
            "Poverty incidence of Dasol"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  31.00"
        ],
        [
            "2009  25.31"
        ],
        [
            "2012  17.60"
        ],
        [
            "2015  12.84"
        ],
        [
            "2018  13.14"
        ],
        [
            "2021  22.98"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The basic livelihood of the town includes salt making, small scale fishing, bagoong making, charcoal making, fruitwine making, and farming (mostly rice crops)."
        ],
        [
            "An average family raises only PhP 5,561.67 and spends PhP 4,506.58 mostly for basic needs."
        ],
        [
            "Majority of Dasol's income came from commercial salt making, with 14 major salt producers in the municipality."
        ],
        [
            "Dasol is rich in non-metallic resources.",
            "It has 360,230,000 m³ of limestone and 5,245 metric tons of guano."
        ],
        [
            "About 0.5 km2 of Dasol is used for commercial crops mostly for rice and vegetable production.",
            "The municipality have several coconut and mango plantations.",
            "Since it lie on the Zambales Mountain Range, the municipality have 6,513 mango fruit bearing trees.",
            "One of the plantations is the Carolina Farm and Mango Orchard owned by Menardo Jimenez, former GMA Network president."
        ],
        [
            "Most of Dasol's livestock includes poultry, swine, cattle, goats, and carabaos with 6,370 livestock raisers all across the municipality."
        ],
        [
            "Mining Areas"
        ],
        [
            "Barangay Tambac"
        ],
        [
            "Barangay Viga"
        ],
        [
            "Registered Mining Operators:"
        ],
        [
            "A & P Mineral Trading"
        ],
        [
            "Government"
        ],
        [
            "Dasol Municipal Hall"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Dasol, belonging to the first congressional district of the province of Pangasinan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Arthur F. Celeste"
        ],
        [
            "Mayor"
        ],
        [
            "Rizalde J. Bernal"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Edgardo C. Fontelera"
        ],
        [
            "Councilors"
        ],
        [
            "Angelo Emmanuel M. Gabuyo"
        ],
        [
            "Mark Anthony J. Carrera"
        ],
        [
            "Nelson C. Espinosa"
        ],
        [
            "Loreto B. Riaza"
        ],
        [
            "Manuel B. Rivera"
        ],
        [
            "Gerardo M. Rivera"
        ],
        [
            "Jon Ray S. Aseo"
        ],
        [
            "Richard B. Garcia"
        ],
        [
            "ABC President"
        ],
        [
            "Rolando Basuel"
        ],
        [
            "Political History"
        ],
        [
            "No record has been found regarding the reign of a governardorcillo in this municipality but records show that there was already an organized government, with Santos Jimenez, Vicente Liceralde, Gaspar Estrada and Pedro Estrada as early capitan municipáles."
        ],
        [
            "Cornelio Estrada was the capitan municipál from 1898 until 1900.",
            "At the height of the Katipunan resistance against the Americans, Francisco Bernal was the capitan municipál."
        ],
        [
            "During the time San Isidro Putot was established, the town had been under three rulers, who ruled in different terms, namely:  Lucas Bonilla (1899–1901), Nazario Nacar (1901–1903), and Paulino Mendoza (1904–1908)."
        ],
        [
            "When Dasol municipality was created, Apolonio Casipit was its first president.",
            "He was succeeded by Leandro Cristobal from 1912 to 1916.",
            "Calixto Tobias was the municipal president from 1916.",
            "In 1918, Tobias was assassinated by an unknown assailant.",
            "His unexpired term was served by his vice mayor, Severino delos Reyes.",
            "In the following election,  Apolonio Casipit won and served his second term from 1918 to 1920.",
            "Succeeding him was Pedro dela Rosa from 1921 to 1925."
        ],
        [
            "In the years 1925 to 1932,  Marcelo Jimenez was elected and served for two consecutive terms.",
            "In the following election, Flaviano Cristobal served as the last Municipal President from 1932 to 1935.",
            "He was elevated as Dasol's first Municipal Mayor, when the Commonwealth Government was established.",
            "He was followed by Juan Castro (1937–1939).",
            "Mayor Castro failed to serve the entire period of his term due to health conditions making his vice mayor, Emiliana R. Jimenez as Acting Municipal Mayor for the unexpired term (1940).",
            "In the next election, Flaviano Cristobal ran again and won, making him as the Municipal Mayor of Dasol at the outbreak of the second world war.",
            "He was forced to vacate the office in 1944 when he joined guerilla movement intervention.",
            "His vice mayor, Teodoro Milgar served as acting mayor for the unexpired term.",
            "When Philippine Independence came in 1946,  Marcelo A. Jimenez was appointed by President Roxas as Acting Municipal Mayor.",
            "Like Mayor Castro, Mayor Jimenez failed to serve the entire period of his term in the same year."
        ],
        [
            "Isidro Bustria served the unexpired term of Marcelo A. Jimenez from 1946 until 1948.",
            "In the 1948 election, Damaso E. Rivera won and served as municipal mayor.",
            "In 1950, Rivera failed to finish his term and his vice mayor, Segundo Basuel, served his unexpired term.",
            "In 1952, Cristino R. Jimenez won and served for four consecutive terms (1952–1967), winning three re-elections.",
            "In 1968, Ramon G. Liceralde won as mayor.",
            "1976 local elections was suspended due to the existence of martial law.",
            "Liceralde, was so far the only lawyer-mayor of Dasol.",
            "In 1978, Benjamin Ochotorena was appointed Municipal Mayor until 1980.",
            "Ludovico R. Espinosa was elected and served as mayor from July 1980 until the government reorganization on June 10, 1986, by President Corazon Aquino.",
            "Manuel Bunao was appointed OIC Mayor from June 16, 1986, to November 17, 1986.",
            "Espinosa appealed and he was reinstalled on November 18, 1986.",
            "In June 1988, he was elected and served a new mandate.",
            "In the May 11, 1992 elections, Espinosa was defeated by Sergio N. Jimenez.",
            "Jimenez also defeated Espinosa in two successive elections (1995,1998).",
            "Due to term limits set by the Philippine Local Government Code of 1991, Sergio Jimenez gave way to his wife, Angelita Ocampo-Jimenez to run for the 2001 elections.",
            "Mrs. Jimenez won beating Vice Mayor Moises Alejos.",
            "In the 2004 elections, Mrs. Jimenez won her second term unchallenged.",
            "In the 2007 elections, Councilor Noel Nacar challenged Jimenez and won as new mayor of Dasol.",
            "He then served for three consecutive terms.",
            "In the 2016 elections, Nacar had his daughter run for mayor as his successor but was defeated by Eric Verzosa, son of former PNP Director General Jesus Verzosa."
        ],
        [
            "Festivals"
        ],
        [
            "Dasol Feast dates 2020-2050"
        ],
        [
            "Year"
        ],
        [
            "From"
        ],
        [
            "To"
        ],
        [
            "2020"
        ],
        [
            "February 27"
        ],
        [
            "February 29"
        ],
        [
            "2021"
        ],
        [
            "February 17"
        ],
        [
            "February 19"
        ],
        [
            "2022"
        ],
        [
            "March 2"
        ],
        [
            "March 4"
        ],
        [
            "2023"
        ],
        [
            "February 22"
        ],
        [
            "February 24"
        ],
        [
            "2024"
        ],
        [
            "February 14"
        ],
        [
            "February 16"
        ],
        [
            "2025"
        ],
        [
            "March 5"
        ],
        [
            "March 7"
        ],
        [
            "2026"
        ],
        [
            "February 18"
        ],
        [
            "February 20"
        ],
        [
            "2027"
        ],
        [
            "February 10"
        ],
        [
            "February 12"
        ],
        [
            "2028"
        ],
        [
            "March 1"
        ],
        [
            "March 3"
        ],
        [
            "2029"
        ],
        [
            "February 14"
        ],
        [
            "February 16"
        ],
        [
            "2030"
        ],
        [
            "March 6"
        ],
        [
            "March 8"
        ],
        [
            "2031"
        ],
        [
            "February 26"
        ],
        [
            "February 28"
        ],
        [
            "2032"
        ],
        [
            "February 11"
        ],
        [
            "February 13"
        ],
        [
            "2033"
        ],
        [
            "March 2"
        ],
        [
            "March 4"
        ],
        [
            "2034"
        ],
        [
            "February 22"
        ],
        [
            "February 24"
        ],
        [
            "2035"
        ],
        [
            "February 7"
        ],
        [
            "February 9"
        ],
        [
            "2036"
        ],
        [
            "February 27"
        ],
        [
            "March 1"
        ],
        [
            "2037"
        ],
        [
            "February 18"
        ],
        [
            "February 20"
        ],
        [
            "2038"
        ],
        [
            "March 10"
        ],
        [
            "March 12"
        ],
        [
            "2039"
        ],
        [
            "February 23"
        ],
        [
            "February 25"
        ],
        [
            "2040"
        ],
        [
            "February 15"
        ],
        [
            "February 17"
        ],
        [
            "2041"
        ],
        [
            "March 6"
        ],
        [
            "March 8"
        ],
        [
            "2042"
        ],
        [
            "February 19"
        ],
        [
            "February 21"
        ],
        [
            "2043"
        ],
        [
            "February 11"
        ],
        [
            "February 13"
        ],
        [
            "2044"
        ],
        [
            "March 2"
        ],
        [
            "March 4"
        ],
        [
            "2045"
        ],
        [
            "February 22"
        ],
        [
            "February 24"
        ],
        [
            "2046"
        ],
        [
            "February 7"
        ],
        [
            "February 9"
        ],
        [
            "2047"
        ],
        [
            "February 27"
        ],
        [
            "March 1"
        ],
        [
            "2048"
        ],
        [
            "February 19"
        ],
        [
            "February 21"
        ],
        [
            "2049"
        ],
        [
            "March 3"
        ],
        [
            "March 5"
        ],
        [
            "2050"
        ],
        [
            "February 23"
        ],
        [
            "February 25"
        ],
        [
            "Dasol celebrates the annual feast of its Catholic patron Saint Vincent Ferrer every first Friday of Lent (after Ash Wednesday).",
            "Dasol follows the tradition of every Filipino fiesta.",
            "At sunrise, a thanksgiving mass is rendered simultaneously in all Roman Catholic Church and Philippine Independent Church locations in Dasol.",
            "at 9:00 AM, a parade of all public officials and government employees are held at Barangay Poblacion public roads.",
            "In the afternoon, an open sports tournament sponsored by the Youth Council are held in the municipal hall compound.",
            "By the evening, senior citizen organizations and Filipino-American organizations celebrate a cocktail party at the municipal auditorium.",
            "Most of the attendants do ballroom dancing."
        ],
        [
            "During the months of April and May barangay-based feasts were celebrated."
        ],
        [
            "Gallery"
        ],
        [
            "Dasol Bay sunset"
        ],
        [
            "Beach in Barangay Tambobong"
        ],
        [
            "Dasol Public Market"
        ],
        [
            "\"Old Town\""
        ],
        [
            "See also"
        ],
        [
            "Salt evaporation pond"
        ],
        [
            "USS Harder (SS-257), a US submarine submerged in the Battle of Dasol Bay, World War II"
        ],
        [
            "USS Ticonderoga (CV-14), US aircraft carrier"
        ],
        [
            "Japanese cruiser Kumano, a Japanese cruiser"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Dasol |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ \"Dasol topographic map\".",
            "topographic map."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Act No.",
            "1004 (November 20, 1903), An Act Annexing the Northern Part of the Province of Zambales to the Province of Pangasinan and Providing That the Southern Part Thereof Shall Continue as Separate Province Under the Name of Zambales, Senate of the Philippines Legislative Digital Resources, retrieved July 8, 2023"
        ],
        [
            "^"
        ],
        [
            "\"Dasol, Pangasinan: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 14 September 2014."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Pangasinan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "Dasol Fiesta Souvenir – Published by the Municipal Government of Dasol (no ISBN Code)"
        ],
        [
            "Island, beach, bridge, and sunset photos taken by Bill Lovelock, La Hermosa Beach Resort"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Dasol."
        ],
        [
            "Dasol Profile at PhilAtlas.com"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines Archived 2017-07-02 at the Wayback Machine"
        ],
        [
            "Official website"
        ],
        [
            "Dasol at the Pangasinan Government Website Archived 2019-07-03 at the Wayback Machine"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Dasol"
        ],
        [
            "Burgos"
        ],
        [
            "South China Sea /"
        ],
        [
            "Da Nang, Vietnam"
        ],
        [
            "Dasol"
        ],
        [
            "Mabini"
        ],
        [
            "Dasol Bay"
        ],
        [
            "Infanta"
        ],
        [
            "vte Province of PangasinanLingayen (capital)  San Carlos City (largest city)Municipalities"
        ],
        [
            "Agno"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Anda"
        ],
        [
            "Asingan"
        ],
        [
            "Balungao"
        ],
        [
            "Bani"
        ],
        [
            "Basista"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos"
        ],
        [
            "Calasiao"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lingayen"
        ],
        [
            "Mabini"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Natividad"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Rosales"
        ],
        [
            "San Fabian"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Quintin"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sison"
        ],
        [
            "Sual"
        ],
        [
            "Tayug"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "San Carlos"
        ],
        [
            "Urdaneta"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan (Administratively independent from the province but grouped under Pangasinan by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Pangasinan"
        ],
        [
            "vte Local Government Units of One Pangasinan Alliance"
        ],
        [
            "Alaminos"
        ],
        [
            "Agno"
        ],
        [
            "Anda"
        ],
        [
            "Bani"
        ],
        [
            "Bolinao"
        ],
        [
            "Burgos"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Mabini"
        ],
        [
            "Sual"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Dasol&oldid=1222336109\""
        ],
        [
            "Category: Municipalities of PangasinanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from November 2012All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}