{
    "name": "Don Carlos",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Don Carlos, Bukidnon"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°40′51″N 124°59′43″E﻿ / ﻿7.6808°N 124.9953°E﻿ / 7.6808; 124.9953"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Don Carlos, Bukidnon\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesDon CarlosMunicipalityMunicipality of Don Carlos"
        ],
        [
            "FlagSealNickname: Little Vigan of BukidnonMap of Bukidnon with Don Carlos highlightedOpenStreetMapDon CarlosLocation within the PhilippinesCoordinates: 7°40′51″N 124°59′43″E﻿ / ﻿7.6808°N 124.9953°E﻿ / 7.6808; 124.9953CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "3rd districtFoundedJune 18, 1966Barangays29"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMa.",
            "Victoria O. Pizarro • Vice MayorJude D. Palmada • RepresentativeJose Ma.",
            "R. Zubiri Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Wilhelmino O. Abrena Jr.Chloe Rey L. MateoKeith Anthony L. KoticoPredesbendo B. GaidTyrone Paul L. AgredaSegundo D. Absuelo Jr.Marivic R. MontesclarosJame Poe M. Campoamor"
        ],
        [
            " • Electorate45,927 voters (2022)Area • Revenue₱ 250.3 million (2020) • Assets₱ 939.8 million (2020) • Expenditure₱ 200.5 million (2020) • Liabilities₱ 436.5 million (2020)Service provider • ElectricityFirst Bukidnon Electric Cooperative (FIBECO)Time zoneUTC+8 (PST)ZIP code8712PSGC101304000IDD : area code +63 (0)88Native languagesWestern Bukidnon Manobo Binukid Cebuano Ata Manobo TagalogWebsitewww.doncarlos.gov.ph"
        ],
        [
            "Don Carlos, officially the Municipality of Don Carlos (Cebuano: Lungsod sa Don Carlos; Tagalog: Bayan ng Don Carlos), is a 1st class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 69,273 people."
        ],
        [
            "History"
        ],
        [
            "The first people who settled this place before was a certain Datu Andarol, his wife Ba-e Mahanu, and their son Datu ‘Mangginayun’.",
            "Datu Andarol was a ruler and the leader of the Manobo tribe settling the village of Minduso, which was the old name of Don Carlos.",
            "The place was covered with forests and access by outlanders was prohibited unless permitted by the datu.",
            "Minduso was the home of Datu Andarol's descendants.",
            "Upon the arrival of the Spaniards, the datu was succeeded by his son, Datu Mangginayun.",
            "With their contacts with the Spaniards and missionaries, Spanish naming conventions and Christianity was introduced, and Datu Mangginayun adopted the name \"Antonio\", hence his full name was now Datu ‘Mangginayun’ Antonio Sagandilan Sr.",
            "He was married to Ba-e Antonina Manlayuan.",
            "His leadership reflects that of his father, as he implemented tribal laws and settled criminal offenses, particularly murder.",
            "As the leader of his tribal community, he also presided wedding ceremonies and settled dowries."
        ],
        [
            "The first popular Spanish stranger who approached Datu ‘Mangginayun’ Antonio Sr. was Tomás Sandoval.",
            "He requested a parcel of land that he intend to borrow and to till, the datu conceded to his request.",
            "As part of the agreement, Tomás was to give the part of his harvest as a share to the datu.",
            "Several years later, another Spaniard by the name of \"Elizalde\" came and, like Tomás, requested the datu for lands to establish ranches.",
            "The lands lent by the datu to Elizalde were: lands in Pantil-pantilan, Migtutugop, the lands along the Mulita river, the today-famous Squash Mountain, and the Tugas Falls.",
            "As the agricultural ventures of these two Spaniards flourished, Cebuanos (referred by the Lumads, or natives, as \"Dumagats\") and other Spaniards who came from Cagayan de Misamis and other coastal towns of Misamis were encouraged to settle and populate the area that comprises the present-day Don Carlos."
        ],
        [
            "Census registry for the settlers of Minduso was only located at Ramag (Manobo for ‘breakfast’), which has a fully established local government facilities and would later be known as Maramag.",
            "Antonio Sr.'s son, Datu ‘Mangginayun’ Antonio Sagandilan Jr. was born on March 17, 1917, at Miuvan (now Barangay Sinangguyan) and had his birth registered at Maramag.",
            "Antonio Jr. was drafted into the USAFFE before World War II and completed his training with the rank of corporal.",
            "However, he was called upon to fight on the outbreak of war, and his family did nothing about it."
        ],
        [
            "When the war ended, Antonio Jr. succeeded his father in the leadership of his tribe as a datu in 1946.",
            "He was first a tribal councilor, and later became a barangay captain of the whole of Minduso.",
            "During his time of service, Señora Remedios ‘Meding’ Fortich de Ozamis personally visited Antonio Jr. and she petitioned the name change of Miuvan (which is now Barangay Sinangguyan) to ‘Don Carlos’ in his husband's memory, Don Carlos Azcona Fortich, and as a gratitude for living in the land which the Sagandilans flourished.",
            "At first, the datu declined, as the flourishing enclave has significance for their patrimony.",
            "Eventually, under Republic Act No.",
            "4800, Minduso and other neighboring villages and barangays were clustered to form the municipality of Don Carlos in 1966."
        ],
        [
            "Executive Order No.",
            "161, issued on August 17, 1965, by President Diosdado Macapagal of the Philippines, delineated the establishment of the municipality of Don Carlos in Bukidnon province, in accordance with Section 68 of the Revised Administrative Code.",
            "This executive order delineated various barrios, formerly under Maramag municipality, and constituted them into an autonomous municipality named Don Carlos, with its administrative hub situated in Don Carlos Sur.",
            "The order meticulously outlined the territorial boundaries of Don Carlos municipality, which began from a designated point at the junction of Pulangui and Maramag rivers, extending in a northwesterly direction along the Maramag river, and then due west to the east side of Sayre Highway.",
            "From there, it followed specific coordinates and distances to include neighboring areas until it returned to the point of origin."
        ],
        [
            "The municipality of Don Carlos as herein organized shall have the following boundaries:"
        ],
        [
            "“From point 1, on the attached plan, located at the junction of Pulangui and Maramag rivers at longitude 125°-2′-00” E. with latitude 7°-42‘-00″ N., more or less;"
        ],
        [
            "thence following through the Maramag river in northwesterly direction towards its upper stream at the head of the waterfall of said river at longitude 125°-1′-00″ E. and latitude 7°-43′-00″ N. to point 2;"
        ],
        [
            "thence moving due west to the east side of Sayre Highway, distance of 700 meters to point 3;"
        ],
        [
            "thence moving in the same direction to the opposite of said Highway a distance of 60 meters to point 4;"
        ],
        [
            "thence moving due west toward the east bank of the Mulita river at longitude 124°-55’-10″ E.,"
        ],
        [
            "and latitude 7°-42′-50″ N. a distance of 9 kilometers and 430 meters more or less to point 5;"
        ],
        [
            "thence moving in the same course to the opposite side of same river a distance of 70 meters;"
        ],
        [
            "thence moving due west until it reaches the east bank of Kidangguin river at longitude 124o-49′-00″ E., and latitude 7°-42′-50″ N. a distance of 10 kilometers point 7;"
        ],
        [
            "thence moving in southerly direction following the center of said river towards the lower stream at longitude 124°-51‘-00″ E. and latitude 7°-38′-00″ N. more or less point 8;"
        ],
        [
            "thence moving due east passing through the northmost and highest Peak of Rauban Hill located on the west of Bocboc marsh to the west bank of Mulita river at longitude 124°-56′-00″ E. and latitude 7°-38‘-00″ N, distance of 10 kilometers and 150 meters to point 9;"
        ],
        [
            "thence following the center of said river in northeasterly direction toward the upper stream until it reaches the junction of Kitaotao creek and Mulita river otherwise known as M.B.M.",
            "No.",
            "1 of Pls.",
            "#112 equivalent to point 10;"
        ],
        [
            "thence following through the center of Kitaotao creek toward the upper stream until it reaches the Sayre Highway at M.B.M.",
            "No.",
            "3 of Pls.",
            "#112, as point 12;"
        ],
        [
            "thence moving due east toward the west bank of the Pulangui river at longitude 125°-31′-00” E. with latitude 7°-39′-00″ N. more or less to point 13;"
        ],
        [
            "thence following through the center of the Pulangui river moving upper stream to point 1, point of beginning, containing an entire area of 18,450 hectares, more or less."
        ],
        [
            "(Based on the technical description furnished by the Office of the Highway District Engineer of Bukidnon of the sketch plan or map of the proposed municipality of Don Carlos prepared by the said Office and on file in this Office, Scale: 1:50,000)."
        ],
        [
            "This decree supplemented Republic Act No.",
            "4800, enacted by the Philippine Congress on June 18, 1966, which officially created the Municipality of Don Carlos, segregating specified barrios from Maramag municipality.",
            "Under this act, the first mayor, vice-mayor, and councilors of the new municipality were to be elected in the 1967 general elections for local officials.",
            "This legislative action aimed to facilitate effective governance and ensure the sustained viability of both Don Carlos and Maramag municipalities.",
            "(Source: https://lawphil.net/statutes/repacts/ra1966/ra_4800_1966.html)"
        ],
        [
            "Geography"
        ],
        [
            "Political map of Don Carlos, showing its 29 barangays"
        ],
        [
            "Don Carlos is situated in the southern part of the province.",
            "It is located 61 kilometres (38 mi) south of the City of Malaybalay, 161 kilometres (100 mi) from Cagayan de Oro, 180 kilometres (110 mi) from the Cotabato City, 160 kilometres (99 mi) from Davao City, and 1,575 kilometres (979 mi) from south of Manila.",
            "The town is bounded by the municipalities of Maramag in the north, Kitaotao in the south, Quezon in the east, Pangantucan and Kadingilan in the west.",
            "The town is known for its famous landmark, Lake Pinamaloy."
        ],
        [
            "Soil type"
        ],
        [
            "There are 3 types of soil that cover the municipality.",
            "These soils, which are generally clay, are Kidapawan Clay, Adtuyon Clay and Macolod Clay."
        ],
        [
            "Topography"
        ],
        [
            "The terrain of the municipality of Don Carlos is generally flat except the mountain range on the eastern part of the municipality.",
            "The highest elevation is 700 metres (2,300 ft) above sea level and the lowest elevation is 300 metres (980 ft) below sea level."
        ],
        [
            "Slope"
        ],
        [
            "Flat to gently sloping areas ranging in slope from 0-8% is the most prevalent terrain in the municipality, which covers 198.96 km2 (93.09%) of the total land area of the municipality.",
            "Moderately sloping to undulating lands ranging in slope from 8-18% occupies approximately 7.65 km2.",
            "Rolling to moderately steep lands, sloping from 18 to 30%, covers 4.19 km2 of land.",
            "Areas with slope above 30% covers 2920.09 km2."
        ],
        [
            "Climate"
        ],
        [
            "The municipality's climate falls under the third type.",
            "Climate under this type experiences rainy season in the months of April to September.",
            "The latest data from the DA shows that the months July to November registered the highest average annual rainfall that reached its peak in the month of July at 642 millimetres (25.3 in)."
        ],
        [
            "Climate data for Don Carlos, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "21(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "44(1.7)"
        ],
        [
            "27(1.1)"
        ],
        [
            "32(1.3)"
        ],
        [
            "35(1.4)"
        ],
        [
            "76(3.0)"
        ],
        [
            "117(4.6)"
        ],
        [
            "108(4.3)"
        ],
        [
            "108(4.3)"
        ],
        [
            "94(3.7)"
        ],
        [
            "100(3.9)"
        ],
        [
            "76(3.0)"
        ],
        [
            "46(1.8)"
        ],
        [
            "863(34.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.3"
        ],
        [
            "8.1"
        ],
        [
            "8.5"
        ],
        [
            "9.6"
        ],
        [
            "21.0"
        ],
        [
            "24.9"
        ],
        [
            "25.0"
        ],
        [
            "24.2"
        ],
        [
            "22.5"
        ],
        [
            "23.4"
        ],
        [
            "17.7"
        ],
        [
            "11.4"
        ],
        [
            "206.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Don Carlos is politically subdivided into 29 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Map of Don Carlos showing its 29 barangays."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101304001   Cabadiangan"
        ],
        [
            " 0.7%"
        ],
        [
            " 497"
        ],
        [
            " 460"
        ],
        [
            "  ▴"
        ],
        [
            " 0.78%"
        ],
        [
            " 101304002   Bocboc"
        ],
        [
            " 3.9%"
        ],
        [
            " 2,724"
        ],
        [
            " 2,668"
        ],
        [
            "  ▴"
        ],
        [
            " 0.21%"
        ],
        [
            " 101304003   Buyot"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,072"
        ],
        [
            " 1,038"
        ],
        [
            "  ▴"
        ],
        [
            " 0.32%"
        ],
        [
            " 101304004   Calaocalao"
        ],
        [
            " 4.1%"
        ],
        [
            " 2,806"
        ],
        [
            " 2,720"
        ],
        [
            "  ▴"
        ],
        [
            " 0.31%"
        ],
        [
            " 101304005   Don Carlos Norte"
        ],
        [
            " 9.7%"
        ],
        [
            " 6,718"
        ],
        [
            " 5,889"
        ],
        [
            "  ▴"
        ],
        [
            " 1.33%"
        ],
        [
            " 101304006   Embayao"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,154"
        ],
        [
            " 1,099"
        ],
        [
            "  ▴"
        ],
        [
            " 0.49%"
        ],
        [
            " 101304008   Kalubihon"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,188"
        ],
        [
            " 1,207"
        ],
        [
            "  ▾"
        ],
        [
            " −0.16%"
        ],
        [
            " 101304009   Kasigkot"
        ],
        [
            " 1.8%"
        ],
        [
            " 1,226"
        ],
        [
            " 1,193"
        ],
        [
            "  ▴"
        ],
        [
            " 0.27%"
        ],
        [
            " 101304010   Kawilihan"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,058"
        ],
        [
            " 1,053"
        ],
        [
            "  ▴"
        ],
        [
            " 0.05%"
        ],
        [
            " 101304011   Kiara"
        ],
        [
            " 4.0%"
        ],
        [
            " 2,793"
        ],
        [
            " 2,684"
        ],
        [
            "  ▴"
        ],
        [
            " 0.40%"
        ],
        [
            " 101304012   Kibatang"
        ],
        [
            " 3.2%"
        ],
        [
            " 2,238"
        ],
        [
            " 2,147"
        ],
        [
            "  ▴"
        ],
        [
            " 0.42%"
        ],
        [
            " 101304013   Mahayahay"
        ],
        [
            " 1.4%"
        ],
        [
            " 970"
        ],
        [
            " 833"
        ],
        [
            "  ▴"
        ],
        [
            " 1.53%"
        ],
        [
            " 101304014   Manlamonay"
        ],
        [
            " 2.4%"
        ],
        [
            " 1,639"
        ],
        [
            " 1,556"
        ],
        [
            "  ▴"
        ],
        [
            " 0.52%"
        ],
        [
            " 101304015   Maraymaray"
        ],
        [
            " 4.5%"
        ],
        [
            " 3,112"
        ],
        [
            " 3,593"
        ],
        [
            "  ▾"
        ],
        [
            " −1.43%"
        ],
        [
            " 101304016   Mauswagon"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,164"
        ],
        [
            " 1,081"
        ],
        [
            "  ▴"
        ],
        [
            " 0.74%"
        ],
        [
            " 101304017   Minsalagan"
        ],
        [
            " 1.3%"
        ],
        [
            " 877"
        ],
        [
            " 817"
        ],
        [
            "  ▴"
        ],
        [
            " 0.71%"
        ],
        [
            " 101304018   New Nongnongan (Masimag)"
        ],
        [
            " 2.9%"
        ],
        [
            " 2,001"
        ],
        [
            " 1,909"
        ],
        [
            "  ▴"
        ],
        [
            " 0.47%"
        ],
        [
            " 101304019   New Visayas"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,027"
        ],
        [
            " 1,055"
        ],
        [
            "  ▾"
        ],
        [
            " −0.27%"
        ],
        [
            " 101304020   Old Nongnongan"
        ],
        [
            " 2.6%"
        ],
        [
            " 1,800"
        ],
        [
            " 1,748"
        ],
        [
            "  ▴"
        ],
        [
            " 0.29%"
        ],
        [
            " 101304021   Pinamaloy"
        ],
        [
            " 4.0%"
        ],
        [
            " 2,797"
        ],
        [
            " 2,596"
        ],
        [
            "  ▴"
        ],
        [
            " 0.75%"
        ],
        [
            " 101304022   Don Carlos Sur (Poblacion)"
        ],
        [
            " 16.4%"
        ],
        [
            " 11,385"
        ],
        [
            " 11,069"
        ],
        [
            "  ▴"
        ],
        [
            " 0.28%"
        ],
        [
            " 101304023   Pualas"
        ],
        [
            " 3.4%"
        ],
        [
            " 2,326"
        ],
        [
            " 2,342"
        ],
        [
            "  ▾"
        ],
        [
            " −0.07%"
        ],
        [
            " 101304024   San Antonio East"
        ],
        [
            " 1.1%"
        ],
        [
            " 796"
        ],
        [
            " 820"
        ],
        [
            "  ▾"
        ],
        [
            " −0.30%"
        ],
        [
            " 101304025   San Antonio West"
        ],
        [
            " 2.3%"
        ],
        [
            " 1,600"
        ],
        [
            " 1,479"
        ],
        [
            "  ▴"
        ],
        [
            " 0.79%"
        ],
        [
            " 101304026   San Francisco"
        ],
        [
            " 0.8%"
        ],
        [
            " 575"
        ],
        [
            " 545"
        ],
        [
            "  ▴"
        ],
        [
            " 0.54%"
        ],
        [
            " 101304027   San Nicolas (Banban)"
        ],
        [
            " 7.1%"
        ],
        [
            " 4,949"
        ],
        [
            " 4,438"
        ],
        [
            "  ▴"
        ],
        [
            " 1.10%"
        ],
        [
            " 101304028   San Roque"
        ],
        [
            " 1.0%"
        ],
        [
            " 701"
        ],
        [
            " 831"
        ],
        [
            "  ▾"
        ],
        [
            " −1.69%"
        ],
        [
            " 101304029   Sinangguyan"
        ],
        [
            " 5.9%"
        ],
        [
            " 4,081"
        ],
        [
            " 3,796"
        ],
        [
            "  ▴"
        ],
        [
            " 0.73%"
        ],
        [
            " 101304030   Bismartz"
        ],
        [
            " 2.4%"
        ],
        [
            " 1,685"
        ],
        [
            " 1,668"
        ],
        [
            "  ▴"
        ],
        [
            " 0.10%"
        ],
        [
            "Total"
        ],
        [
            "69,273"
        ],
        [
            "64,334"
        ],
        [
            " ▴"
        ],
        [
            "0.74%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Don CarlosYearPop.±% p.a.1970 32,668—    1975 35,252+1.54%1980 35,038−0.12%1990 45,815+2.72%1995 51,083+2.06%2000 55,495+1.79%2007 60,870+1.28%2010 64,334+2.03%2015 66,959+0.76%2020 69,273+0.67%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Don Carlos, Bukidnon, was 69,273 people, with a density of 320 inhabitants per square kilometre or 830 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Don Carlos"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  39.50"
        ],
        [
            "2009  41.95"
        ],
        [
            "2012  37.58"
        ],
        [
            "2015  38.97"
        ],
        [
            "2018  27.06"
        ],
        [
            "2021  26.54"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Commerce and trade"
        ],
        [
            "Commercial activities in the municipality of Don Carlos pass through a network of various commercial establishments that scatter all over the municipality.",
            "Sari-sari stores dominate these establishments with heavy concentration in barangay centers, especially in barangay Don Carlos Sur."
        ],
        [
            "Based on CY 2000 records of the Municipal Treasurer's Office (MTO), the municipality of Don Carlos had a total of 350 commercial establishments, majority of these commercial establishments are engaged in retailing, merchandising, food and beverage, catering and servicing."
        ],
        [
            "Agriculture"
        ],
        [
            "Don Carlos is an agricultural municipality.",
            "It is endowed with vast tracts of fertile agricultural lands coupled with a favorable climate.",
            "Many people in the area are greatly dependent on the produce of the land.",
            "Being the main source of income of the municipality, agriculture utilizes about 149.5894 km2 of land, representing 70% of the total land area of the municipality for the production of various crops."
        ],
        [
            "In terms of production, in the year 1998, rice yielded 3,156.60 metric tons both in irrigated and rainfed farms.",
            "White and yellow corn production accounted to 39,086.10 metric tons covering 66.98 km2 representing 11.78% to agricultural area.",
            "sugarcane production as second major crop next to corn, covers a physical area of 50 km2 representing 33.42% with a total production of 21,000 metric tons."
        ],
        [
            "The cash crops include leafy green vegetables, fruits, legumes and root crops.",
            "Coconut, sugarcane, banana, jackfruit, cacao and rubber comprise the commercial crops.",
            "Commercial crops cover 24.4194 km2 and has a total production 2,523.75 metric tons."
        ],
        [
            "Tourism"
        ],
        [
            "The Municipality of Don Carlos is naturally endowed with sites which have been seen with strong potentials to be tourist destinations.",
            "These are the uncommercialized Lake Pinamaloy in Barangay Pinamaloy; the Sinangguyan and Kahulugan Waterfalls in Barangay Sinangguyan; and the Linking Caves and Spring in Barangay San Antonio East."
        ],
        [
            "Lake Pinamaloy"
        ],
        [
            "Lake Pinamaloy also known as Tourism Lake has an approximate area of 0.6 km2.",
            "It is considered as a landmark and tourist attraction, thus a development plan has been prepared and was submitted to the Department of Tourism as a blueprint of the program."
        ],
        [
            "Sinangguyan and Kahulugan Falls"
        ],
        [
            "Combined to the other tourism sites of the municipality is the Sinangguyan and Kahulugan falls, which both have the approximate height of 20 to 25 meters."
        ],
        [
            "Linking Caves and Spring"
        ],
        [
            "Located in San Antonio East, the Linking Caves and Spring adds tourism boost to the place.",
            "Reason enough that a proposal has been made to develop its nature into a swimming pool."
        ],
        [
            "Evidently, these sites are enriched with innate natural physical features.",
            "Private sector and government efforts would be done to explore these potentials with extensive promotions in order to draw investors and encourage development and tourists."
        ],
        [
            "Transportation"
        ],
        [
            "Airport"
        ],
        [
            "Don Carlos will be the site of the proposed Bukidnon Domestic Airport which will be located at the unused former Maraymaray Airstrip in the municipality's Barangay Maraymaray.",
            "The sequestered airstrip was previously owned by the Cojuancos.",
            "The Bukidnon Airport Development Project was included in the Department of Transportation's budget for 2018.",
            "Funds for the construction and improvement of all road networks leading to the proposed airport have been allocated by the DPWH.",
            "Construction of the domestic airport was scheduled in 2018.",
            "It will be the fourth domestic airport operating in Northern Mindanao following Laguindingan Airport in Misamis Oriental, Labo Airport in Ozamiz City and Camiguin Airport in Camiguin."
        ],
        [
            "The Bukidnon Airport spans an area of 149,000 square meters within its boundaries, with the Passenger Terminal Building (PTB) occupying 3,600 square meters and will be able to accommodate up to 425 passengers.",
            "Situated in Barangay Maraymaray, the airport's construction began in 2019 and is scheduled to continue until 2026 as per contractual obligation, with ongoing construction activities."
        ],
        [
            "The airport is owned and operated by the Civil Aviation Authority of the Philippines (CAAP) and will serve as a crucial transportation hub for the Province of Bukidnon.",
            "Its runway specifications include:"
        ],
        [
            "Phase I: 1260 meters x 30 meters"
        ],
        [
            "Phase III: 1560 meters x 30 meters"
        ],
        [
            "Phase IV: 2100 meters x 45 meters"
        ],
        [
            "The Civil Aviation Authority of the Philippines cannot specify the destinations Bukidnon Airport will serve, as this depends on which airlines choose to operate in the said airport."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Don Carlos |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "161, s. 1965\".",
            "Official Gazette.",
            "Government of the Philippines.",
            "August 17, 1965.",
            "Retrieved 14 June 2024.",
            "This article incorporates text from this source, which is in the public domain."
        ],
        [
            "^"
        ],
        [
            "\"Don Carlos: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ PROJECT WATCH: New Bukidnon (Don Carlos) Development Airport to start this year; P425 million budget allocated"
        ],
        [
            "^ \"Bukidnon airport to break ground in May 2018\" by Ruby Leonora R. Balistoy on April 28, 2018 (Philippine Information Agency – PIA Official)"
        ],
        [
            "External links"
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Don Carlos, Bukidnon"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Quezon"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kitaotao"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Don_Carlos,_Bukidnon&oldid=1229696357\""
        ],
        [
            "Categories: Municipalities of BukidnonPopulated places on the Rio Grande de MindanaoHidden categories: Pages using gadget WikiMiniAtlasSource attributionCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}