{
    "name": "Donsol",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Donsol"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°54′30″N 123°35′53″E﻿ / ﻿12.9083°N 123.5981°E﻿ / 12.9083; 123.5981"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Sorsogon, Philippines"
        ],
        [
            "For the film of the same name, see Donsol (film)."
        ],
        [
            "Municipality in Bicol Region, PhilippinesDonsolMunicipalityMunicipality of DonsolPort of Donsol"
        ],
        [
            "FlagSealNickname: Whale Shark Tourism Capital of the PhilippinesMap of Sorsogon with Donsol highlightedOpenStreetMapDonsolLocation within the PhilippinesCoordinates: 12°54′30″N 123°35′53″E﻿ / ﻿12.9083°N 123.5981°E﻿ / 12.9083; 123.5981CountryPhilippinesRegionBicol RegionProvinceSorsogonDistrict"
        ],
        [
            "1st districtFounded1668Barangays51"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorTeodoro De Guzman • Vice MayorJosephine Alcantara-Cruz • RepresentativeEvelina G. Escudero • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ma.",
            "Christiana R. AbetriaTeodoro B. de GuzmanNicolas A. NatoMary Antoinette G. AquinoHelene A. GarayArgel D. HernandezJerome R. Alcantara IIVictor V. Alim"
        ],
        [
            " • Electorate30,878 voters (2022)Area • Revenue₱ 172.7 million (2020) • Assets₱ 623.7 million (2020) • Expenditure₱ 184.3 million (2020) • Liabilities₱ 288 million (2020)Service provider • ElectricitySorsogon 2 Electric Cooperative (SORECO 2)Time zoneUTC+8 (PST)ZIP code4715PSGC056207000IDD : area code +63 (0)56Native languages"
        ],
        [
            "East Miraya"
        ],
        [
            "Tagalog"
        ],
        [
            "Websitewww.donsol.gov.ph"
        ],
        [
            "Donsol, officially the Municipality of Donsol, (Central Bikol: Banwaan kan Donsol; Tagalog: Bayan ng Donsol) is a 3rd class municipality in the province of Sorsogon, Philippines.",
            "According to the 2020 census, it has a population of 50,281 people."
        ],
        [
            "Donsol is 66 kilometres (41 mi) from Sorsogon City, 571 kilometres (355 mi) from Manila, and 94 kilometres (58 mi) from Legazpi City."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Donsol is politically subdivided into 51 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alin"
        ],
        [
            "Awaii (Poblacion)"
        ],
        [
            "Banban"
        ],
        [
            "Bandi"
        ],
        [
            "Banuang Gurang"
        ],
        [
            "Baras"
        ],
        [
            "Bayawas"
        ],
        [
            "Bororan Barangay 1 (Poblacion)"
        ],
        [
            "Cabugao"
        ],
        [
            "Central Barangay 2 (Poblacion)"
        ],
        [
            "Cristo"
        ],
        [
            "Dancalan"
        ],
        [
            "De Vera"
        ],
        [
            "Gimagaan"
        ],
        [
            "Girawan"
        ],
        [
            "Gogon"
        ],
        [
            "Gura"
        ],
        [
            "Juan Adre"
        ],
        [
            "JR Cawaling"
        ],
        [
            "Mabini"
        ],
        [
            "Malapoc"
        ],
        [
            "Malinao"
        ],
        [
            "Market Site Barangay 3 (Poblacion)"
        ],
        [
            "New Maguisa"
        ],
        [
            "Ogod (Crossing)"
        ],
        [
            "Old Maguisa"
        ],
        [
            "Orange"
        ],
        [
            "Pangpang"
        ],
        [
            "Parina"
        ],
        [
            "Pawala"
        ],
        [
            "Pinamanaan"
        ],
        [
            "Poso Pob.",
            "(Barangay 5)"
        ],
        [
            "Punta Waling-Waling (Poblacion)"
        ],
        [
            "Rawis (Poblacion Brgy)"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Rafael"
        ],
        [
            "San Ramon"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Cruz (Itunggan)"
        ],
        [
            "Sevilla"
        ],
        [
            "Sibago"
        ],
        [
            "Suguian"
        ],
        [
            "Tagbac"
        ],
        [
            "Tinanogan"
        ],
        [
            "Tongdol"
        ],
        [
            "Tres Marias (Poblacion Brgy)"
        ],
        [
            "Tuba"
        ],
        [
            "Tupas"
        ],
        [
            "Vinisitahan"
        ],
        [
            "Lourdes"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Donsol, Sorsogon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "65(2.6)"
        ],
        [
            "44(1.7)"
        ],
        [
            "42(1.7)"
        ],
        [
            "39(1.5)"
        ],
        [
            "87(3.4)"
        ],
        [
            "150(5.9)"
        ],
        [
            "184(7.2)"
        ],
        [
            "153(6.0)"
        ],
        [
            "163(6.4)"
        ],
        [
            "154(6.1)"
        ],
        [
            "127(5.0)"
        ],
        [
            "100(3.9)"
        ],
        [
            "1,308(51.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.9"
        ],
        [
            "9.2"
        ],
        [
            "11.0"
        ],
        [
            "12.5"
        ],
        [
            "19.6"
        ],
        [
            "24.3"
        ],
        [
            "26.5"
        ],
        [
            "25.0"
        ],
        [
            "25.5"
        ],
        [
            "24.4"
        ],
        [
            "19.4"
        ],
        [
            "15.1"
        ],
        [
            "226.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of DonsolYearPop.±% p.a.1903 6,685—    1918 10,656+3.16%1939 18,050+2.54%1948 20,681+1.52%1960 23,703+1.14%1970 30,548+2.57%1975 32,310+1.13%1980 33,785+0.90%1990 33,159−0.19%1995 36,013+1.56%2000 39,995+2.27%2007 43,996+1.32%2010 47,563+2.88%2015 49,711+0.84%2020 50,281+0.22%Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "The majority of the population speak Eastern Miraya, an Albay Bikol language of Inland Bikol group of languages.",
            "The language is also spoken in four towns of Albay and some parts of Pilar and Castilla, Sorsogon.",
            "It is mutually intelligible with Western Miraya.",
            "People of Donsol can also speak and understand Tagalog or Filipino, the national language, and English."
        ],
        [
            "Religion"
        ],
        [
            "The majority of the people adhere to Catholicism and each barangay has a patron saint and fiestas are held annually.",
            "Iglesia ni Cristo is the second largest religion of the population and has several local congregations in the municipality."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Donsol"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  54.60"
        ],
        [
            "2009  47.30"
        ],
        [
            "2012  44.13"
        ],
        [
            "2015  46.80"
        ],
        [
            "2018  37.10"
        ],
        [
            "2021  37.54"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(February 2013) (Learn how and when to remove this message)"
        ],
        [
            "Whale shark (butanding) viewing"
        ],
        [
            "Butanding whale shark in Donsol, Sorsogon"
        ],
        [
            "Swimming with whale sharks, locally known as butanding, was featured as the Best Animal Encounter in Asia by Time magazine in 2004.",
            "Whale sharks can be seen between November and June, with presence peaking between February and May."
        ],
        [
            "The presence of whale sharks in the town of Donsol was known to the local residents for more than 100 years, but the locals believed these gentle giants were dangerous.",
            "This wrong notion changed when on December 26, 1997, a group of scuba divers led by Romir Aglugub – a PADI diving instructor, discovered their presence, interacted with, and came in contact with the whale sharks.",
            "Even the members of the diving group of Romir were having second thoughts about whether the fish is docile, until the instructor led the way into the water and came in contact with the whale sharks.",
            "Copy of video footage taken by the group was passed on to the media and the WWF-Philippines.",
            "By March 1998, Donsol became world-class tourist destination and now known as the “Whale Shark Capital of the World”."
        ],
        [
            "Interaction with the whale sharks is regulated by the local Department of Tourism (DOT) office.",
            "WWF guidelines are generally observed to protect the sharks.",
            "Rules include limiting the number of swimmers per boat to six, prohibiting scuba divers, and requiring staying farther than three meters from the sharks."
        ],
        [
            "In recent years the number of male sharks has out-numbered female sharks by 20:1.",
            "Generally, the females that are seen are large mature adults in the 7m ~ 9m range.",
            "Increasing numbers of sharks show propeller marks on their backs.",
            "Anecdotal evidence from local fishermen suggests that prop strikes are from fishing boats in the off-season, rather than from tourist boats during the main February–June tourist season."
        ],
        [
            "In 2006 five sharks were found dead on the surface of the water, within 30 miles of Donsol.",
            "They had all been shot at close range.",
            "One shark had 13 bullet wounds to the head.",
            "The locals blame this on commercial fishermen shooting the sharks if they are caught in their nets.",
            "Manta rays, which are also protected in the Philippines, are also over-fished and sold in local markets in the Sorsogon area."
        ],
        [
            "Groups from Singapore, Hong Kong, Taiwan, and the Philippines make up the largest groups of visitors.",
            "Most tourists book guided tours with dive centers familiar with whale shark interaction."
        ],
        [
            "Food"
        ],
        [
            "A fruit stand in DonsolBicolano delicacies are plentiful in Donsol.",
            "Bicolano cuisine is well known for dishes cooked in \"gata\" or coconut cream.",
            "A famous dish to try is \"laing\" or \"gabi\", which is dried taro leaves cooked in coconut cream with cuts of meat or fish.",
            "Another famous Bicolano dish available in Donsol is \"Bicol Express\" which is pork stir fried with shrimp paste, heavy coconut cream, and green chilli peppers.",
            "It is a spicy dish that is best eaten with hot, steamed rice.",
            "A Filipino favourite is a dish called Sisig.",
            "Sisig is deep fried pork simmered in Calamansi juice, salt, pepper, and chilli peppers.",
            "It is eaten with hot, steamed rice or as a bar snack.",
            "There are a few restaurants in Donsol that serve these dishes."
        ],
        [
            "Accommodations"
        ],
        [
            "Tourism continues to develop piecemeal in Donsol.",
            "The first hotel in the area is the Amor Farm Beach Resort, established in 1997, followed by the Woodland Beach Resort in 1998 that started off as a family vacation house.",
            "Interest to visit the quaint and quiet town grew as soon as news of whale shark sightings grew amongst the international marine biologist community.",
            "Tourists can now avail rooms that cater to all financial budgets, from the backpacker to the family vacationer from various resorts and homestays in Donsol."
        ],
        [
            "Most establishments accept only cash, but there is an ATM in Donsol located inside the Municipal Town Hall.",
            "There now are several resorts that accept credit cards.",
            "Giddy's Place PADI Dive Resort in the town center and Elysia Beach Resort in Dancalan are two of them.",
            "Landlines are non-existent in Donsol and most rely on mobile telephones.",
            "Internet service came to Donsol in 2008 using cellular technology.",
            "There are a few internet shops in town."
        ],
        [
            "Other attractions"
        ],
        [
            "Donsol has a not so known, but equally unique, night firefly tour and shrimp-catching night tour available all-year round.",
            "Donsol also is becoming the best jump-off and base for divers to the Manta Bowl and San Miguel Island in Ticao due to the existence of better tourist facilities than the other rural towns.",
            "Diving in Donsol itself is not allowed.",
            "Donsol also is a great trekking and biking site, due mainly to the abundance of hilly areas and fields."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Donsol |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Donsol, Sorsogon : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 December 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Sorsogon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Donsol."
        ],
        [
            "Wikivoyage has a travel guide for Donsol."
        ],
        [
            "Donsol Profile at PhilAtlas.com"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2016-03-04 at the Wayback Machine"
        ],
        [
            "LGU Profile of Donsol, Sorsogon"
        ],
        [
            "WWF's Community-Based Ecotourism and Coastal Resources Management Project in Donsol, Sorsogon"
        ],
        [
            "Places adjacent to Donsol"
        ],
        [
            "Pio Duran, Albay"
        ],
        [
            "Jovellar, Albay"
        ],
        [
            "Daraga, Albay"
        ],
        [
            "Burias Pass"
        ],
        [
            "Donsol"
        ],
        [
            "Pilar"
        ],
        [
            "Ticao Pass"
        ],
        [
            "vte Province of SorsogonSorsogon City (capital and largest city)Municipalities"
        ],
        [
            "Barcelona"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castilla"
        ],
        [
            "Donsol"
        ],
        [
            "Gubat"
        ],
        [
            "Irosin"
        ],
        [
            "Juban"
        ],
        [
            "Magallanes"
        ],
        [
            "Matnog"
        ],
        [
            "Pilar"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Component city"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Donsol&oldid=1222958051\""
        ],
        [
            "Category: Municipalities of SorsogonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles needing additional references from February 2013All articles needing additional referencesCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}