{
    "name": "Dulag",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Dulag, Leyte"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°57′09″N 125°01′54″E﻿ / ﻿10.9525°N 125.03167°E﻿ / 10.9525; 125.03167"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Leyte, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Dulag, Leyte\" – news · newspapers · books · scholar · JSTOR (June 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesDulagMunicipalityMunicipality of DulagChurch of Dulag"
        ],
        [
            "FlagMap of Leyte with Dulag highlightedOpenStreetMapDulagLocation within the PhilippinesCoordinates: 10°57′09″N 125°01′54″E﻿ / ﻿10.9525°N 125.03167°E﻿ / 10.9525; 125.03167CountryPhilippinesRegionEastern VisayasProvinceLeyteDistrict"
        ],
        [
            "2nd districtBarangays45"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMildred Joy P. Que • Vice MayorJade A. Agullo • RepresentativeLolita T. Javier • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Vicente C. Petilos• Roubel P. Dugos• Miguel O. Castro• Nelson M. Lauzon• Jerson Simon P. Veloso• Victor B. Cadayong• Rona C. Yu• Michael K. BautistaDILG Masterlist of Officials"
        ],
        [
            " • Electorate32,877 voters (2022)Area • Revenue₱ 168.7 million (2020) • Assets₱ 751.8 million (2020) • Expenditure₱ 136.7 million (2020) • Liabilities₱ 96.64 million (2020)Service provider • ElectricityDon Orestes Romualdez Electric Coperative (DORELCO)Time zoneUTC+8 (PST)ZIP code6505PSGC0803718000IDD : area code +63 (0)53Native languagesWaray TagalogWebsitewww.dulag-leyte.gov.ph"
        ],
        [
            "Dulag (IPA:"
        ],
        [
            "This coastal town has 11,007 hectares of land and lies 36 kilometres (22 mi) south of the concurrent regional center of Eastern Visayas and the administrative capital of provincial government of Leyte, Tacloban."
        ],
        [
            "Popularly known as the \"Liberation Town\", Dulag survived and has risen from the ruins of the Second World War and at present time, a thriving coastal town fronting Leyte Gulf."
        ],
        [
            "In 1954, the barrios of Mayorga, Andres Bonifacio, Talisay, San Roque, Burgos, Liberty, Union, Ormocay, Wilson, and the southern portion of barrio of Cogon Bingcay was separated to form the town of Mayorga, Leyte."
        ],
        [
            "Etymology"
        ],
        [
            "Dulag was a vital center of commerce in the eastern sector of the Leyte Island.",
            "Local and foreign ships docked at its seaport carrying merchants from seafaring nations who barter their products for local materials like abaca, copra, tobacco, rice and wine with the natives.",
            "Large warehouses Casa Sontua, Casa Petiksi, Casa Limpingco, Casa Ortega, Casa Gotauangco, and Casa Florentino lined the coastal shores of Dulag and fostered trading from neighboring towns Dagami, Tabontabon, Burauen, La Paz, MacArthur (formerly Taraguna), Julita and Mayorga.",
            "Goods from these towns were exported through Dulag to foreign countries."
        ],
        [
            "Other etymological versions explaining how Dulag got its name includes \"dulao\" (the medical herb turmeric, Curcuma longa),\"nagdudulag\" (bones of wild animals scattered by hunters; scattered settlers), and \"dalag\" (vernacular term for catfish, Ictalutus punctatus, thriving along Candao River)."
        ],
        [
            "History"
        ],
        [
            "Dulag is one of the few barangays in Leyte that antedated the discovery of the Philippines in 1521.",
            "It is situated in the eastern coast of Leyte.",
            "There are several versions as to how Dulag got its name.",
            "The first was that in the early years of the 18th century, the town was already a flourishing community, the center of trade and commerce in eastern Leyte.",
            "The town then was considered the center of commercial activities going on thus it was named Dulag, the German term for center."
        ],
        [
            "Another version states that it is the etymological variation of a certain herb called \"dulao\" which grew abundantly in the area.",
            "Dulao is a kind of plant which is yellowish-green in color used as a food seasoning for a local dish.",
            "Because of its abundance, the place was called after this herb."
        ],
        [
            "The third version states that there was a time when bones of different kinds of animals were scattered all around the place.",
            "Whenever people would see bones all around, they always commented, \"nagdudulag hin tul-an.\"",
            "This means that bones were scattered all around.",
            "The word nagdudulag was then shortened to Dulag."
        ],
        [
            "The last version says that the name could have come from the name of the first settler whom legend says was named Dulagdulag."
        ],
        [
            "The first Jesuit missionaries arrived at Dulag in September 1595.",
            "An encomendero, Don Pedro Hernandez brought them in his boat from Cebu.",
            "The missionaries, Fr.",
            "Alonzo de Humanes and Fr.",
            "Juan del Campo, first coaxed the natives to settle within the limits of the sitio instead of living far from each other.",
            "After this was accomplished, the Jesuit fathers built a church and a convent."
        ],
        [
            "A nucleus of some 60 boys from Palo was formed by the fathers for the first mission school in Dulag.",
            "In the church compound they were taught their three R's and religion.",
            "Using the crudest of materials, the boys learned the Spanish language and helped serve as interpreters to the missionaries on their missions.",
            "The burden of supporting the boys began to tell on the resources of the padres but periodic allowances from the encomendero permitted them to continue with their studies.",
            "The school was patterned after a Jesuit school in Antipolo in Luzon, which the Jesuits had founded earlier."
        ],
        [
            "Dulag became a booming locality by May 1596.",
            "It became the centrum of commercial activities.",
            "The Jesuits made great progress at conversion.",
            "They became successful especially when the principales of the town allowed themselves to be baptized."
        ],
        [
            "Years of peace were suddenly broken when on October 29, 1603, Moro raiders ravaged the town.",
            "Wild confusion followed after the arrival of 70 vintas full of Moros.",
            "Some of the precious possessions of the church were fortunately evacuated before the Moros finally landed on the shores of Dulag."
        ],
        [
            "Bolisan, the Moro leader sailed away to Surigao after 700 captives and rich loot had safely been stored in the holds of their vintas.",
            "Fr.",
            "Hurtado, one of the missionary priests was himself a captive.",
            "During the years that followed, the padre was able to teach Christianity to the Moros.",
            "He was later ransomed and returned to Dulag."
        ],
        [
            "The Moro raids were said to have burned 10 churches in Leyte.",
            "Sacred images were destroyed, sacred vessels were looted, and new Christians enslaved."
        ],
        [
            "After the Moro raids, more misfortune struck the town.",
            "Two typhoons destroyed the church and laid waste the harvest of the season.",
            "An earthquake of violent proportions followed this.",
            "In 1610, a locust invasion destroyed more crops.",
            "In September 1611, more typhoons added to the desolation of the people.",
            "As if to climax the lean years, the Moros returned in 1613, destroyed the church and town, burned the harvest and carried of men, women and children to be sold as slaves.",
            "The parish priest, Fr.",
            "Pascual Acuña was also captured by the Moros.",
            "He was later released in exchange for a Moro chief named Pagdalunan who was captured by the Spaniards."
        ],
        [
            "Before the Jesuits left in 1768, they had built a brick church under the avocation of the Nativity of Our Lady.",
            "It was significantly called the \"Refugio.\""
        ],
        [
            "After the expulsion of the Jesuits, the Augustinians took over then parish.",
            "Fr.",
            "Cipriano Barbasan is specially remembered for enlarging and remodeling the church.",
            "He was responsible for the ornamentation of the church altar and the construction of lookout towers of the hills of Calbasag and Mount Laberanan in San Jose.",
            "Both were solid edifices of brick which served as places of refuge during subsequent attacks by the Moros."
        ],
        [
            "In 1843, the first Franciscan parish priest arrived.",
            "Under the direction of Fr.",
            "Francisco Rosas, the first road to Abuyog was constructed."
        ],
        [
            "A long line of gobernadorcillos ruled the town.",
            "From Basilio de Paz to Hilario Saño, the town progressed further.",
            "During the revolutionary period, Julio Villagracia and Rosendo Cornel governed.",
            "Like other towns, Dulag suffered from depredations of the insurrectors and the pulahanes."
        ],
        [
            "Dulag airfield in 1944"
        ],
        [
            "During the American regime, Emilio Celso Abad was elected the first capitan.",
            "The steady progress of the town resulted in the expansion of the town limits."
        ],
        [
            "Marcial Lagunzad was the mayor of Dulag when the Japanese occupied the town.",
            "He was tactful, so many lives were spared but he died during the early days of the liberation during an American bombing raid."
        ],
        [
            "The landing of the American forces, which took place from October 17 to 20, 1944 took a heavy toll on the Municipality's townspeople.",
            "The church, public buildings as well as residences were razed to the ground.",
            "The streets that used to be concrete and asphalt crumbled to rubble after concentrated American shelling."
        ],
        [
            "For a time, after the shelling of Dulag, the seat of government was transferred to Mayorga, one of the barrios.",
            "Slowly, the people returned to the town and under the leadership of Mayor Nicolas Bautista, Dulag was rebuilt."
        ],
        [
            "Geography"
        ],
        [
            "Dulag covers 11,007 hectares in land area in the eastern side of Leyte Island fronting the Gulf of Leyte.",
            "The terrain is characterized mainly by generally flat sloping land rolling terrain in the western section."
        ],
        [
            "From Tacloban City, one can reach Dulag by land traversing the 36 kilometres (22 mi) route via the Maharlika Highway.",
            "Travel time usually takes three-quarter minutes to full one hour."
        ],
        [
            "Leyte Gulf washes its western shores in Dulag.",
            "The town is bounded 12 kilometers to the north by the Municipality of Tolosa; to the west, about 7 kilometers lies the Municipality of Julita; and 7 kilometers south is the Municipality of Mayorga."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Dulag, Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "78(3.1)"
        ],
        [
            "57(2.2)"
        ],
        [
            "84(3.3)"
        ],
        [
            "79(3.1)"
        ],
        [
            "118(4.6)"
        ],
        [
            "181(7.1)"
        ],
        [
            "178(7.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "172(6.8)"
        ],
        [
            "180(7.1)"
        ],
        [
            "174(6.9)"
        ],
        [
            "128(5.0)"
        ],
        [
            "1,598(62.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.7"
        ],
        [
            "13.8"
        ],
        [
            "17.3"
        ],
        [
            "18.5"
        ],
        [
            "23.2"
        ],
        [
            "26.5"
        ],
        [
            "27.1"
        ],
        [
            "26.0"
        ],
        [
            "26.4"
        ],
        [
            "27.5"
        ],
        [
            "24.6"
        ],
        [
            "21.0"
        ],
        [
            "268.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "The prevailing climate type is similar in all eastern coastal towns of the province.",
            "The climate is type 2 in category wherein there is no definite dry or wet season throughout.",
            "Rainfall is more or less evenly distributed throughout the year.",
            "Maximum rainfall is from November to January.",
            "During weather disturbances (typhoon) some barangays are easily flooded.",
            "These barangays are found along Daang Maharlika, along the Daguitan River, and within the poblacion.",
            "Among these are Barangays Barbo, Alegre, Fatima, Salvacion; Districts of Combis, Market Site and Cambula, and the elementary school therewith, though there is no definite pattern of occurrence."
        ],
        [
            "Water Resources"
        ],
        [
            "Being the foremost basic need of man, the absence of clean and sanitary pipe water system throughout the locality is a big problem.",
            "Most water sources came from tube pumps, dug wells, aside from few places with faucet potable water system."
        ],
        [
            "Per 2006 Barangay Profile Survey on sources of potable water supply, the following result revealed that out of the total number of households, only about 513 or 5.98% are dependent on owned-use faucet system of potable water, where households get water supply from a faucet inside the house/yard directly connected to a water pipeline from their own water system (electric pump)."
        ],
        [
            "There are 2,299 households or 26.80% that take their drinking water from a tube/pipe well (jetmatic/pitcher pump) for private use of the household, 637 household or 11.87 takes their water from a deep well of another household or establishment or from a deep well constructed for public use."
        ],
        [
            "Some important uses water are for taking a shower, taking a bath, washing hands, brushing teeth and washing dishes.",
            "Other use water to flush and clean the toilet, wash vehicles, and even water the plants."
        ],
        [
            "Out of 8,580 households, 58.93% or about 5,057 household got water from their own Jetmatic/Pitcher Pump for their laundry and/or bathing.",
            "Other sources were recipient of community water system (2.03%), owned electric pumps (5.07%), shared to an electric water pump (1.94%), shared to a Jetmatic/Pitcher Pump from a neighbor (14.56%), dug well (14.56%) and some get water from peddlers (2.91%)."
        ],
        [
            "Barangays"
        ],
        [
            "Dulag is politically subdivided into 45 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "In 1957, the sitio of Inawangan was converted into barrio Kamitok."
        ],
        [
            "Alegre"
        ],
        [
            "Arado"
        ],
        [
            "Bulod"
        ],
        [
            "Batug"
        ],
        [
            "Bolongtohan"
        ],
        [
            "Cabacungan"
        ],
        [
            "Cabarasan"
        ],
        [
            "Cabatoan"
        ],
        [
            "Calipayan"
        ],
        [
            "Calubian"
        ],
        [
            "Camitoc"
        ],
        [
            "Camote"
        ],
        [
            "Dacay"
        ],
        [
            "Del Carmen"
        ],
        [
            "Del Pilar"
        ],
        [
            "Fatima"
        ],
        [
            "General Roxas"
        ],
        [
            "Luan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Maricum"
        ],
        [
            "Barbo (Poblacion Sawang)"
        ],
        [
            "Buntay (Poblacion Sawang)"
        ],
        [
            "Cambula (Poblacion Sawang)"
        ],
        [
            "Candao (Poblacion Sawang)"
        ],
        [
            "Catmonan (Poblacion Sawang)"
        ],
        [
            "Combis (Poblacion Sawang)"
        ],
        [
            "Highway (Poblacion Sawang)"
        ],
        [
            "Market Site (Poblacion Sawang)"
        ],
        [
            "San Miguel (Poblacion Sawang)"
        ],
        [
            "Serrano (Poblacion Sawang)"
        ],
        [
            "Sungi (Poblacion Sawang)"
        ],
        [
            "Rawis"
        ],
        [
            "Rizal"
        ],
        [
            "Romualdes"
        ],
        [
            "Sabang Daguitan"
        ],
        [
            "Salvacion"
        ],
        [
            "San Agustin"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Rafael"
        ],
        [
            "San Vicente"
        ],
        [
            "Tabu"
        ],
        [
            "Tigbao"
        ],
        [
            "Victory"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of DulagYearPop.±% p.a.1903 14,884—    1918 22,551+2.81%1939 28,693+1.15%1948 31,185+0.93%1960 24,292−2.06%1970 26,770+0.97%1975 26,674−0.07%1980 28,219+1.13%YearPop.±% p.a.1990 33,020+1.58%1995 34,742+0.96%2000 38,897+2.45%2007 40,570+0.58%2010 41,757+1.05%2015 47,300+2.40%2020 48,992+0.69%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Dulag, Leyte, was 48,992 people, with a density of 440 inhabitants per square kilometre or 1,100 inhabitants per square mile."
        ],
        [
            "Dulag population density is higher than the national density.",
            "This means that considering the total land area of the municipality and its present population, Dulag is considered a low density town.",
            "There are 4 people living in a hectare tract of land or 400 people living in every square kilometer.",
            "Within the municipality, Barangay Buntay had a high population density of 154 persons per hectare, followed by Barangay Candao, and Barangay Market Site with 62 persons per hectare and 50 persons per hectare, respectively."
        ],
        [
            "The age structure of the population of Dulag deviated from the usual pyramid shape.",
            "The age group 10–14 years old had the largest population with 11.46%, followed by 5–9 years old (11.44%).",
            "The male populace constitutes about 50.57% of the total population, and about 49.42% are female.",
            "This becomes a one is to one (1:1) gender ratio."
        ],
        [
            "Based from the 2006 Barangay Profile Survey data, the total dependents of the municipality represented about 17,761 while the working group is 26,382.",
            "This means that each working individual will support an average of 1.4 heads as dependent."
        ],
        [
            "Language and Literacy"
        ],
        [
            "A current survey on mother-tongue languages used in Dulag households reveals that 97.75% (43,148) of the 44,143 residents are Waray speaking; 1.17% (516) speaks Cebuano; and 1.06% speaks Tagalog.",
            "This result reinforces that Dulag is indeed a Waray-waray speaking town."
        ],
        [
            "Waray-waray is a language in the Visayan language family spoken in the provinces of Samar, Northern Samar, Eastern Samar, Leyte (eastern portion), and Biliran in the Philippines.",
            "This Austronesian language has several dialects and remains to be an integral part of the Filipino language with about 6,000,000 speakers."
        ],
        [
            "Religion"
        ],
        [
            "Our Lady of Refuge Parish Church"
        ],
        [
            "Majority of the residents of Dulag are Roman Catholic as they comprise 97.21% participation rate.",
            "Smaller religious groups such as Members Church of God International, popularly known as Ang Dating Daan, Iglesia ni Cristo, Dulag Christian Bible Church (Non-Denominational, Born Again, Christian), Born Again, Baptist, Jehovah's Witnesses, UCCP, etc.",
            "share the remainder 2.79% of the total population."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Dulag"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  32.20"
        ],
        [
            "2009  33.56"
        ],
        [
            "2012  33.57"
        ],
        [
            "2015  31.46"
        ],
        [
            "2018  24.63"
        ],
        [
            "2021  27.57"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "The residents and territories of Dulag are governed by the barangay, municipal, provincial and national governments of the Philippines."
        ],
        [
            "Dulag is subdivided into 45 barangays (the basic political unit in governance in the Philippines).",
            "Of the 45 barangays, 11 are within the urbanized poblacion (town proper); while, 34 are situated in the rustic countryside."
        ],
        [
            "The barangay plays a pivotal role as the planning and implementing unit of government policies, programs and activities.",
            "Each barangay is led and governed by its Barangay Officials.",
            "The Barangay considered as a Local Government Unit (LGU) same as the Provincial and the Municipal Government.",
            "It is composed of a Punong Barangay (Barangay Captain/Chief), a Sanguniang Barangay (Barangay Council) with seven Barangay Kagawads (Barangay Members) who are all duly-elected by their constituents, and a Sangguniang Kabataan (Youth Council) Chairman afforded with full membership status in the council after being duly-elected but only by the barangay's youth sector.",
            "Thus, there are eight members of the Legislative Council in a barangay.",
            "Each Kagawad serves as chair of a committee.",
            "Three members are appointed to carry out the functions of each committee.",
            "Below are the committees in the Barangay Council:"
        ],
        [
            "Peace and Order Committee,"
        ],
        [
            "Appropriations, Finance and Ways and Means Committee,"
        ],
        [
            "Education Committee,"
        ],
        [
            "Health Committee,"
        ],
        [
            "Agriculture Committee,"
        ],
        [
            "Tourism Committee,"
        ],
        [
            "Infrastructure Committee, and"
        ],
        [
            "Youth and Sports Committee."
        ],
        [
            "The Punong-bayan/Meyor/Alkalde (Municipal Mayor) is the chief executive officer of the town.",
            "As mandated by the 1991 Local Government Code of the Philippines authored by Sen. Aquilino Pimentel Jr., the Mayor has the power to:"
        ],
        [
            "exercise general supervision and control over all programs, projects, services, and activities of the city government;"
        ],
        [
            "enforce all laws and ordinances relative to the governance of the city and in the exercise of the appropriate corporate powers provided for in the said code, implement all approved policies, programs, projects, services and activities of the city;"
        ],
        [
            "initiate and maximize the generation of resources and revenues, and apply the same to the implementation of development plans, program objectives and priorities, particularly those resources and revenues programmed for citywide growth;"
        ],
        [
            "ensure the delivery of basic services and the provision of adequate public facilities; and"
        ],
        [
            "exercise such other powers that may be prescribed by law or ordinance."
        ],
        [
            "Next in the line of succession in the Municipal Government is the Pangalawang Punong-bayan/Bise-Alkade (Vice Mayor) who is concurrently the presiding officer of the Sangguniang Bayan (Municipal Council).",
            "Aside from being the presiding officer in the Municipal Council, the Vice Mayor may also appoint officials and employees of the Municipal Council, assume the office of the Municipal Mayor and its powers, duties and functions for the unexpired term of the latter in the event of permanent vacancy, and exercise such powers and perform such other duties and functions as may be prescribed by law or ordinance."
        ],
        [
            "The local legislature of Dulag is called the Sangguniang Bayan (Municipal Council).",
            "Ten Konsehal (Councilors) represent their constituents.",
            "The council is composed of eight Councilors, plus the President of the local Association of Barangay Councils (ABCs), and the President of the Federation of Sangguniang Kabataan (SK) as ex-officio members.",
            "It is the Municipal Vice Mayor who serves as its presiding officer, and may only vote to \"break the tie\" should there be a stalemate during floor deliberations."
        ],
        [
            "The council is divided into several committees to which council matters are referred prior to floor deliberations.",
            "The committees are composed of five council members each, inclusive of the respective committee chairmen and vice-chairmen.",
            "Although the council's powers are basically legislative in nature, they may exercise certain quasi-judicial functions, especially on matters requiring thorough investigation and fact-finding procedures."
        ],
        [
            "In accordance to the Local Government Code of the Philippines, the Municipal Council may therefore:"
        ],
        [
            "approve ordinances and pass resolutions necessary for an efficient and effective city government;"
        ],
        [
            "generate and maximize the use of resources and revenues for the development plans, program objectives and priorities of the city, with particular attention to industrial development and citywide growth and progress;"
        ],
        [
            "enact ordinances granting franchises and authorizing the issuance of permits or licenses, upon such conditions and for such purposes intended to promote the general welfare of the inhabitants of the city;"
        ],
        [
            "regulate activities relative to the use of land, buildings and structures within the city in order to promote general welfare;"
        ],
        [
            "approve ordinances which shall ensure the efficient and effective delivery of basic services and facilities for Parañaque's citizenry; and,"
        ],
        [
            "exercise such other powers and perform such other duties and functions as may be prescribed by law or ordinance."
        ],
        [
            "It is also required of the Barangay Councils to submit their respective legislations and budget schedules to the City Council for the latter's review and recommendation for the Mayor's approval."
        ],
        [
            "The Municipal Officials serve three-year terms and are allowed a maximum of three consecutive terms in their respective positions.",
            "However, they may run for the same office again only after one term of non-incumbency for such functions."
        ],
        [
            "Dulag, along with rest of the towns in Leyte, is governed by the Provincial Government of Leyte.",
            "The Provincial Government is headed by the Gobernador (Governor) and assisted by the Bise-Gobernador (Vice Governor) and the Bokal (duly elected Board Members and ex officio members) of the Sangguniang Panlalawigan (Provincial Board).",
            "The provincial officials have similar if not the same functions as the municipal officials.",
            "Provincial officials have greater scope of authority as they govern on the interest of the constituents within the province."
        ],
        [
            "Tourism"
        ],
        [
            "World War II veterans who witnessed on October 20, 1944, the landing of Gen. Douglas MacArthur during the Battle of Leyte Gulf."
        ],
        [
            "Veterans claim that the General did not land in Palo, Leyte as history books have stated.",
            "But instead, Gen. MacArthur landed first in Dulag, Leyte.",
            "The veterans had several evidences to substantiate their claims."
        ],
        [
            "An evidence of such claim is the tourist attraction \"Hill 120\" in Dulag, Leyte.",
            "Another proof is that when the General landed he passed by an old church.",
            "Based from accounts, the said Dulag church fits the description given by the veterans."
        ],
        [
            "The other one is that a few days upon the return of General MacArthur in Philippine soil,  Forces of Liberation in Leyte with the Philippine Commonwealth troops made Dulag's neighboring town Tolosa a U.S. Navy base, the 6th of 13th Air Force.",
            "It was in Tanghas, a barangay in Tolosa, where the famous American composer Irving Berlin, first performed his renowned composition Heaven Watch the Philippines for his Filipino audience with then Philippine President Sergio Osmeña and Gen. Carlos P. Romulo.",
            "Tolosa is a next town after Dulag."
        ],
        [
            "Healthcare"
        ],
        [
            "The Municipal Health Office is manned by one Municipal Health Physician (MHP), two Public Health Nurses (PHN), eight Rural Health Midwives (RHM), one Rural Sanitary Inspector (RSI), one Medical Technologist, one Dental Aide, four Medical Aide/Clerks, two Utility Workers and two Volunteer Nurses.",
            "Each RHM have their own catchment area which is composed of three to four barangays.",
            "One RHM is assigned in the Main Health Center.",
            "Despite difficulties, the Municipal Health Office delivers health services regularly to their constituents."
        ],
        [
            "The programs and services implemented by the Rural Health Unit are: National Tuberculosis Control Program (NTP), Health and Sanitation, Maternal and Child Health Care (MCHC), Nutrition, Expanded Program on Immunization (EPI), Control of Diarrheal Disease, Leprosy Control and Family Planning.",
            "These programs and services are implemented throughout the municipality through the effort of the Rural Health Personnel with the help of the Barangay Health Workers (BHW), Barangay Nutrition Scholars (BNS) and trained hilots practitioners in their respective barangays."
        ],
        [
            "Education"
        ],
        [
            "The two school districts of Dulag under the Department of Education (DepEd) oversee the implementation of the programs and thrusts of the department.",
            "It is currently undergoing changes in order to achieve the goal Quality Education and Education For All."
        ],
        [
            "The 2 districts are composed of twenty-nine (29) elementary schools.",
            "Dulag North consists of 20 Elementary/Primary Schools while Dulag South District is composed of 19 Elementary School."
        ],
        [
            "Secondary Education is being provided by six National High Schools: The Dulag National High School, San Jose National High School, Cabacungan National High School, Cabatoan National High School, Calubian Integrated School and Rizal National High School."
        ],
        [
            "Tertiary Education offered by Eastern Visayas State University- Dulag Satellite Campus caters to the tertiary education needs of the constituents."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Dulag |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Creating the Municipality of Mayorga in the Province of Leyte\".",
            "LawPH.com.",
            "Retrieved 2011-04-11."
        ],
        [
            "^"
        ],
        [
            "\"Dulag: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 February 2020."
        ],
        [
            "^ \"An Act Converting the Sitio of Inawangan, Municipality of Dulag, Province of Leyte, into a Barrio of Said Municipality to Be Known As the Barrio of Kamitok\".",
            "LawPH.com.",
            "Archived from the original on 2012-07-13.",
            "Retrieved 2011-04-12."
        ],
        [
            "^ \"An Act Changing the Name of Barrio Mat-i in the Municipality of Dulag, Province of Leyte, to President Roxas\".",
            "LawPH.com.",
            "Archived from the original on 2012-07-28.",
            "Retrieved 2011-04-12."
        ],
        [
            "^ \"An Act Changing the Name of Barrio Cogon-bingkay in the Municipality of Dulag, Province of Leyte, to Salvacion\".",
            "LawPH.com.",
            "Archived from the original on 2012-07-13.",
            "Retrieved 2011-04-12."
        ],
        [
            "^ \"An Act Converting the Sitio of Pamoblaran in the Municipality of Dulag, Province of Leyte, into a Barrio to Be Known As the Barrio of San Antonio\".",
            "LawPH.com.",
            "Archived from the original on 2012-07-16.",
            "Retrieved 2011-04-12."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Dulag, Leyte."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-05-30 at the Wayback Machine"
        ],
        [
            "Places adjacent to Dulag, Leyte"
        ],
        [
            "Tolosa"
        ],
        [
            "Julita"
        ],
        [
            "Dulag"
        ],
        [
            "Leyte Gulf"
        ],
        [
            "Mayorga"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Dulag,_Leyte&oldid=1207977396\""
        ],
        [
            "Category: Municipalities of Leyte (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2013All articles needing additional referencesCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from April 2022Commons category link from WikidataWebarchive template wayback linksArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}