{
    "name": "Dumangas",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Dumangas"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°50′N 122°43′E﻿ / ﻿10.83°N 122.72°E﻿ / 10.83; 122.72"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "Municipality in Western Visayas, PhilippinesDumangasMunicipalityMunicipality of DumangasSt.",
            "Augustine Church, first built in 1572"
        ],
        [
            "FlagSealMap of Iloilo with Dumangas highlightedOpenStreetMapDumangasLocation within the PhilippinesCoordinates: 10°50′N 122°43′E﻿ / ﻿10.83°N 122.72°E﻿ / 10.83; 122.72CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "4th districtFounded1572Barangays45"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorBraeden John Q. Biron • Vice MayorRonaldo B. Golez • RepresentativeFerjenel G. Biron • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ian Joel M. DolendoJasmin G. OcampoGuisseppe Karl D. GumbanRoger D. DiasnesGeovanie D. LachicaRandy B. SuspeñeRose Marie D. DoromalGeorge A. Acepcion"
        ],
        [
            " • Electorate49,775 voters (2022)Area • Revenue₱ 230.1 million (2020) • Assets₱ 607.6 million (2020) • Expenditure₱ 167.2 million (2020) • Liabilities₱ 131.6 million (2020)Service provider • ElectricityIloilo 2 Electric Cooperative (ILECO 2)Time zoneUTC+8 (PST)ZIP code5006PSGC063018000IDD : area code +63 (0)33Native languagesHiligaynon Ati TagalogWebsitewww.dumangas.gov.ph"
        ],
        [
            "Dumangas, officially the Municipality of Dumangas (Hiligaynon: Banwa sang Dumangas, Tagalog: Bayan ng Dumangas),  is a 1st class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 73,899 people."
        ],
        [
            "Etymology"
        ],
        [
            "Local stories written regarding the origin of the name of the town stated: \"A Spaniards resting under two closely growing mango trees asked a native of the name of the place.",
            "Thinking that he was asked of the name of the trees under which the Spaniard was resting, he answered in crude Spanish \"dos manggas\", meaning two mango trees.",
            "Another version which is the most probable, tells about Legazpi's Spanish-French officer and a creole who was one of the leaders of the foraging party who come to Araut.",
            "Having seen mango trees growing abundantly in the place, he gave a verbal report to the Adelantado upon is return to Cebu mentioning \"Sitio Du Manggas\" as the place they got plenty of food.",
            "Being a creole and was accustomed to substandard Spanish he mispronounced the Spanish article \"de\" as \"du\" thus, the place was identified and recorded as \"Pueblo de Dumangas\"."
        ],
        [
            "History"
        ],
        [
            "Early settlement"
        ],
        [
            "The old village of Dumangas started as a settlement of old Malays who made a clearing along the Talaguis River and established a community sometime in the 12th or 13th century.",
            "The community was called Araut ( variant of Jalaud ), the term is derived from the old Malayan word laut meaning sea or pa-laut or laud which means towards the sea.",
            "When the Spaniards arrived in Panay they found the coastal village of Araut, a thriving agricultural community.",
            "According to Friar Gaspar de San Agustín, O.S.A., \"...in the ancient times, there was a trading center and a court of the most illustrious nobility in the whole island.\"",
            "at Jalaur/Jalaud river in the vicinity of Dumangas."
        ],
        [
            "During the first few years of Spanish arrival in the Islands, the Spaniards established their first settlement in Leyte and Butuan.",
            "The Spanish settlement in Cebu was often attacked by Portuguese invaders and aside from that the Island of Cebu had a shortage of food provision to support the Spaniards.",
            "Miguel Lopez de Legazpi, sent various expeditions to look for food and to find another settlement other than Cebu to evade the attacks from the Portuguese explorers.",
            "The royal treasurer to the Philippines Guido de Lavezaris writes (June 5, 1569) to King Philip II of Spain that the danger of Portuguese attack leads the Spaniards to remove their camp to Panay.",
            "The governor general Miguel Lopez de Legazpi sent Mateo del Sanz who landed in Araut (now Dumangas) in June 1565 and “found many provisions and the inhabitants hospitable”.",
            "The colonizers were able to get enough food supplies and went back to Cebu to report to Legazpi what they had found."
        ],
        [
            "Hispanization"
        ],
        [
            "In June 1565, Captain Luis de la haya left Cebu for Araut.",
            "With him was Fray Juan de Alva, an Augustinian friar ordered by his superiors to preach and to convert the people of Araut to Christianity.",
            "The inhabitants then were animistic believers.",
            "Like other pre-Hispanic Filipinos, they worshipped environmental spirits, but Fray de Alva did not find much difficulty in converting the natives, to the new faith.",
            "Of the early Augustinian fathers who came to Panay, he was the first to learn the native tongue which was Kinaray-a, hence and as such he can relate to the people easily.",
            "Shortly he was able to initiate the construction, of a church with the help of the coverts in 1572."
        ],
        [
            "In the 16th century, Araut gained prominence, being the first community trodded by the Spaniards when they came to Panay.",
            "It was also the first town in Panay to have received the blessing of Christianity and first to have a temporary church erected."
        ],
        [
            "In 1605, thirty years after it was established as a town (founded in 1572) the Spanish clergy, who then ruled the community together with the cabeza de barangay, changed the name Araut to Dumangas."
        ],
        [
            "Fifty nine years later the church was again razed to the ground.",
            "Bair and Robertson recorded:"
        ],
        [
            "\" it was Saturday March 15, 1687 the church and the house in Dumangas was burned.",
            "Burned together with the edifices were offering (actually tributes of natives) from Cebu and other Visayan Island and 2,000 canvas of rice which was stored in the hours.\""
        ],
        [
            "Dumangas and world trade"
        ],
        [
            "Before the opening of Iloilo to foreign trade, Dumangas have produced huge quantities of the rice.",
            "In 1842, the rice shipped from Iloilo were drawn mainly from the vast plains of Dumangas and its neighboring towns.",
            "The opening of the port of Iloilo to foreign trade in 1855 paved way for further progress in Dumangas.",
            "The town had indirectly shared on the lucrative trade.",
            "Sugar became the main bulk of production and export which were produced in farms called haciendas.",
            "Local sugar planters built sugar mills for local production of muscovado sugar sold to Chinese merchants."
        ],
        [
            "Revolutionary period of Dumangas"
        ],
        [
            "When revolution broke out in Luzon in 1896, the revolutionaries spread quickly throughout the country.",
            "However, most of the fighting were centered in Luzon.",
            "Alarmed by the possibility that the revolution might spread to Visayas and Mindanao, Colonel Ricardo Monet, the Commander of the Spanish Forces in the Visayas came to Dumangas in the early part of 1898 to recruit volunteers to help defend the colonial government.",
            "Colonel Monet appointed Don Mariano Dolar better known as Tente Mariano to organize the voluntaries but the latter primer, the young and brave Don Quintin Salas and was asked to organize the cuerpos voluntaries of Dumangas.",
            "Unknown to Spanish authorities, the volunteers organized by Quintin Salas were trained to be revolutionaries."
        ],
        [
            "Pursuant to agreed points of the revolution, simultaneous with other towns, Dumangas, \"Cried for Freedom and Liberty\" on October 28, 1898.",
            "They easily subdued the civil guards in the town of Dumangas, Quintin Salas and his rayadillo army continued to liberated leaving only the capital – Iloilo City.",
            "On December 24, 1898, the Spanish Colonial Government headed by Don Diego de los Rios surrendered Iloilo City to the revolutionaries.",
            "Upon the surrender of the Spaniards a revolutionary government was established in the province and Don Simon Deocampo was appointed administrator of Dumangas."
        ],
        [
            "On December 28, 1898, four days capitulation of the Spaniards to the rebel forces of Iloilo, the American troops under Gen. Marcus Miller arrived.",
            "The American Armanda was stranded at Iloilo Bay for 45 days for Iloilo government did not allow them to land unless approved by Gen. Emilio Aguinaldo.",
            "This incident was known in history as \" Iloilo Fiasco \"."
        ],
        [
            "The Filipino – American hostilities broke out in Manila on February 4, 1889, and on February 11, the American forces bombarded Iloilo City.",
            "Due to inadequate arms, the Ilonggo revolutionaries retreated from the city.",
            "Slowly, the towns of Iloilo fell in the hands of the Americans.",
            "When the American soldiers reached Dumangas, they made the Dumangas Church as their headquarters.",
            "They experienced fierce retaliations from the rayadillo in Dumangas led by Col. Quintin Salas.",
            "There were ambushes initiated by Salas and his rayadillo in Sitio Ambacan in barrio Calao with Sgt.",
            "Salvador Dolar as in-charge and at Lublub Bridge under the leadership of Lts.",
            "Juan Decolongon and Felipe Togonon resulting to the death of a certain Capt.",
            "Smith of the American Army.",
            "The ambuscades of the rayadillo angered the Americans that they burned the whole poblacion.",
            "It was because of the said arson that no colonial houses in Dumangas can be seen today."
        ],
        [
            "When Don Simon Deocampo, the revolutionary government administrator of Dumangas surrendered to the Americans in the late 1899, the administration of the town was changed to Provisional American Military Government under the leadership of Frederick Wilson."
        ],
        [
            "Even with the establishment of the military government, Col. Salas with the support of the Dumangasanon continued to defy the Americans.",
            "After realizing that he was left alone in the battlefield because his companion had already accepted the Benevolent Assimilation Policy of the Americans, he surrendered on October 4, 1901, earning the title as the \"Bravest Ilonggo Revolutionary\".",
            "After the surrender of Salas, a civil administration was established.",
            "With it, the Dumangasanon accepted the American colonial rule and peace was restored."
        ],
        [
            "American colonial administration"
        ],
        [
            "The surrender of Col. Salas to the Americans marked the restoration of peace in Dumangas.",
            "Dumangasanon who left the town during the war started to return and rehabilitated their war torn lives and livelihood.",
            "Since there was no fully constituted authority to administer the town, a committee was formed headed by Don Urbano Dolar, who simultaneously organized a police force to maintain peace and order."
        ],
        [
            "In 1903, Dumangas was fused with Barotac Nuevo for the third time, with the seat of administration in the former.",
            "However, due to irregularities committed by some elected official, the seat was transferred to Barotac Nuevo a year after.",
            "The two towns were again separated in 1910 after the people of Dumangas led by Vicente Doronila petitioned the colonial government for autonomy.",
            "It was granted and Doronila became the Municipal Mayor."
        ],
        [
            "Japanese occupation"
        ],
        [
            "After forty years of peace and freedom, the Filipinos and Dumangasanons in particular were again faced with another war – against the Japanese signaled by the bombing of Pearl Harbor in Hawaii on December 8, 1941.",
            "One by one, the island of the archipelago were subjugated by the Japanese.",
            "They reached Dumangas in 1942 and established garrison and a puppet government.",
            "Jose Dimzon was appointed Puppet Mayor and Tomasito Buenaflor as Chief of Police.",
            "These two persons had sacrificed a great deal to save numerous Dumangasanon from the cruelty of the Japanese.",
            "Even with the establishment of a puppet government, thelocal government of Dumangas continued to exist in concealment with Julito Diasnes Sr. as the town head.",
            "Tomas Confesor organized the Civil Resistance Movement and fought against the invaders.",
            "Many men of Dumangas were enlisted to the cause.",
            "As guerilla's they attacked the Japanese garrisons and undertook ambuscades.",
            "The people of the town left their homes and sought refuge in the interior barrios to escape the Japanese atrocities.",
            "These evacuations changed the dismal barrio life at the bank of the Halauod River; where most of the evacuees from the town proper and Iloilo City were concentrated.",
            "To lessen their fears and difficulties the people conducted sports tournament, dances and cockfights.",
            "Sitio Talauguis was transformed to an important business center, as it became a trading port of goods from Iloilo City, Negros, Guimaras and other towns of Iloilo.",
            "During the Japanese occupation, Macario Peralta Jr., freed most of Panay from Japanese imperialism, including Dumangas, thus other allied guerillas in other provinces from Romblon, Palawan, Marinduque and portions of Masbate and Mindoro, considered majority liberated Panay, the \"Primus inter pares\" in their alliance.",
            ": 110"
        ],
        [
            "Philippine Republic"
        ],
        [
            "After the war, the political arena in Dumangas was dominated by some pre – war personalities and some new faces who have tried their luck in politics.",
            "One of them was Atty.",
            "Gaudencio Demaisip who has elected Congressman in 1948.",
            "In his capacity he brought many improvement in his native town.",
            "Politics then in Dumangas was the battleground for the bright, able and service oriented Dumangasanonn.",
            "Election after election, many successful Dumangasanon rose to prominence by occupying important government post.",
            "During their terms of office they labored hard to propel the town towards progress.",
            "Among them was Atty.",
            "Ramon Duremdes, who was apromising lawyer upon his entrance to the political sphere as mayor from 1960 to 1969.",
            "Atty.",
            "Duremdes administration was marked with numerous projects which helped uplift the economic and social status of his townsmates.",
            "Under his administration were the construction of the Dumangas Emergency Hospital, the Dacutan Wharf, barangay feeder roads and bridges among others.",
            "Duremdes love concern for Dumangas were manifested by the services he rendered and the developments he brought to the town.",
            "He bid for vice – governorship in 1971 and won, the office he held up in 1992."
        ],
        [
            "When Mayor Duremdes transferred to the provincial Capital, the administration of the town was taken over by Jesus Decolongon Jr. by the virtue of his victory in the 1969 election.",
            "During his term he worked hard to further improve the town.",
            "Among his project was the rehabilitation of the public market, paving the streets, the construction of the hall of justice and many others.",
            "Mayor Decolongon was dubbed as the only mayor who served Dumangas for a quarter of a century."
        ],
        [
            "Another Dumangasanon came into limelight during the 1978 election, Dr. Narciso Dolar Monfort who was elected Congressman, a position he held up to the present (tough with interruption when he run for senator in 1982).",
            "He had brought marvelous improvements in Dumangas.",
            "It was through his initiative that two colleges were established in the town.",
            "In addition to these, were the establishment of a telephone system and waterworks, rehabilitation of roads, repair of bridges and schools to name a few.",
            "The landmark project he undertook was the construction of the coastal road connecting Dumangas to Iloilo City, shortening the travel time and consequently decongesting the traffic in the city.",
            "Congressman Monfort showed hid intense love for Dumangas through the unparalleled improvements he brought to the town which made life easier and comfortable."
        ],
        [
            "Mayor Danilo Deocampo is not being counted last in terms of improvements, in the town.",
            "Many projects of national funding were enacted through his efforts.",
            "His milestone project was rehabilitation of town market.",
            "Mayor Deocampo's sincerity and love for Dumangas is visible through the project he implemented."
        ],
        [
            "When Mayor Rolando Biaca Distura catapulted to power, tandemned with the leadership of Vice Mayor Rose Marie Duremdes- Doromal, a remarkable change visibly surfaced."
        ],
        [
            "Foremost is the consistent rally to address the five- old leadership focus namely: (1) Stability of peace and Order condition; (2) Improvement of the Delivery of the Basic Services Emphasizing on Health and"
        ],
        [
            "Sanitation; (3) Economic Development Geared Towards Agricultural and Aquaculture Productivity; (4) Enhancement of Education Program; and (5) Protection and Preservation Ecology and Coastal Resources."
        ],
        [
            "Serving his second term now Mayor Distura proved his capability and extraordinary leadership and administrative skills.",
            "The municipal hall of Dumangas became one of the few municipal halls that are fully air conditioned aside from the numerous renovation and face- lifting of the 85- year old edifice."
        ],
        [
            "Agricultural development is enhanced by the rehabilitation of irrigation system, farm to market roads and technical support to farmers.",
            "Recently the PAGASA opened its Agro-Met in Dumangas that would benefit not only the farmers but the whole community as well."
        ],
        [
            "Mayor Distura with the help of Congressman Monfort, rehabilitated the town plaza making it a good place for recreation at day and a nice promenade at night.",
            "The auditorium was roofed securing the activities held in the place from rain.",
            "What have been enumerated are only few of the numerous programs and the projects of the present administration."
        ],
        [
            "The present administrations have carved a name for Dumangas through its achievement that gained national recognition.",
            "The town from second to the last for several years leaped to second place and third place in the Clean and Green Program of the Provincial Government.",
            "The town's Peace and Order Council became a Grand Slam winner for consistently topping the National Search for Outstanding Peace and Order Council of the Philippines.",
            "These are only a few of the numerous distinctions received by the town under the leadership of Mayor Distura."
        ],
        [
            "Geography"
        ],
        [
            "Dumangas is 25 kilometres (16 mi) from Iloilo City.",
            "Dumangas is located northeast of Iloilo City.",
            "Surrounded by the towns of Barotac Nuevo in the east, Zarraga in the west, Pototan in the north, and the island of Guimaras in the southwest and the island of Negros in the east.",
            "It has a lot of tributaries like the rivers of Barasan, Agdarupan, Paloc, Talusan, Dumangas, Sulangan, Talauguis, and Jalaur.",
            "Natural features found in Dumangas includes the mountains and hills of Ermita, Binaobao, and Rosario.",
            "Sulangan has its own mini version of the \"tinagong dagat\" where a spring can be found and Binaobao has the Matagsing and Lacaran has the Elehan Caves.",
            "Main sights in the town includes the Lacaran Beach, Bacay Beach, Nalooyan Beach, Tinagong Dagat, fishponds in many barangays, the Aglipayan Church, the Ermita Shrine, the San Agustin Catholic Church, the RoRo Port, the coastal road, and seafood restaurants found in the Monfort Coastal Road."
        ],
        [
            "Barangays"
        ],
        [
            "Former flag of Dumangas"
        ],
        [
            "Dumangas is politically subdivided into 45 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Burgos-Regidor (Poblacion)"
        ],
        [
            "Aurora-del Pilar (Poblacion)"
        ],
        [
            "Buenaflor-Embarcadero (Poblacion)"
        ],
        [
            "Lopez Jaena-Rizal (Poblacion)"
        ],
        [
            "J.M.",
            "Basa-Mabini Bonifacio (Poblacion)"
        ],
        [
            "Bacay"
        ],
        [
            "Bacong"
        ],
        [
            "Balabag"
        ],
        [
            "Balud"
        ],
        [
            "Bantud"
        ],
        [
            "Bantud Fabrica"
        ],
        [
            "Baras"
        ],
        [
            "Barasan"
        ],
        [
            "Bolilao"
        ],
        [
            "Calao"
        ],
        [
            "Cali"
        ],
        [
            "Cansilayan"
        ],
        [
            "Capaliz"
        ],
        [
            "Cayos"
        ],
        [
            "Compayan"
        ],
        [
            "Dacutan"
        ],
        [
            "Ermita"
        ],
        [
            "PD Monfort South (Guinsampanan)"
        ],
        [
            "Ilaya 1st"
        ],
        [
            "Ilaya 2nd"
        ],
        [
            "Ilaya 3rd"
        ],
        [
            "Jardin"
        ],
        [
            "Lacturan"
        ],
        [
            "PD Monfort North (Lublub)"
        ],
        [
            "Managuit"
        ],
        [
            "Maquina"
        ],
        [
            "Nanding Lopez"
        ],
        [
            "Pagdugue"
        ],
        [
            "Paloc Bigque"
        ],
        [
            "Paloc Sool"
        ],
        [
            "Patlad"
        ],
        [
            "Pulao"
        ],
        [
            "Rosario"
        ],
        [
            "Sapao"
        ],
        [
            "Sulangan"
        ],
        [
            "Tabucan"
        ],
        [
            "Talusan"
        ],
        [
            "Tambobo"
        ],
        [
            "Tamboilan"
        ],
        [
            "Victorias"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Iloilo, Philippines (1961–1990, extremes 1903–2012)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "34.7(94.5)"
        ],
        [
            "35.5(95.9)"
        ],
        [
            "39.0(102.2)"
        ],
        [
            "37.5(99.5)"
        ],
        [
            "37.8(100.0)"
        ],
        [
            "37.5(99.5)"
        ],
        [
            "35.2(95.4)"
        ],
        [
            "34.8(94.6)"
        ],
        [
            "37.8(100.0)"
        ],
        [
            "35.4(95.7)"
        ],
        [
            "34.8(94.6)"
        ],
        [
            "34.5(94.1)"
        ],
        [
            "39.0(102.2)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.7(85.5)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "30.7(87.3)"
        ],
        [
            "30.4(86.7)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "30.9(87.6)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.1(79.0)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "29.1(84.4)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "24.6(76.3)"
        ],
        [
            "25.1(77.2)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "16.5(61.7)"
        ],
        [
            "16.7(62.1)"
        ],
        [
            "18.6(65.5)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "20.2(68.4)"
        ],
        [
            "21.0(69.8)"
        ],
        [
            "19.5(67.1)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "19.8(67.6)"
        ],
        [
            "19.2(66.6)"
        ],
        [
            "19.4(66.9)"
        ],
        [
            "18.3(64.9)"
        ],
        [
            "16.5(61.7)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "39.9(1.57)"
        ],
        [
            "19.1(0.75)"
        ],
        [
            "27.1(1.07)"
        ],
        [
            "47.7(1.88)"
        ],
        [
            "117.9(4.64)"
        ],
        [
            "255.2(10.05)"
        ],
        [
            "313.2(12.33)"
        ],
        [
            "363.7(14.32)"
        ],
        [
            "266.8(10.50)"
        ],
        [
            "264.1(10.40)"
        ],
        [
            "174.8(6.88)"
        ],
        [
            "64.2(2.53)"
        ],
        [
            "1,953.7(76.92)"
        ],
        [
            "Average rainy days (≥ 0.1 mm)"
        ],
        [
            "11"
        ],
        [
            "7"
        ],
        [
            "7"
        ],
        [
            "6"
        ],
        [
            "14"
        ],
        [
            "18"
        ],
        [
            "21"
        ],
        [
            "20"
        ],
        [
            "19"
        ],
        [
            "18"
        ],
        [
            "15"
        ],
        [
            "14"
        ],
        [
            "170"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "82"
        ],
        [
            "80"
        ],
        [
            "75"
        ],
        [
            "73"
        ],
        [
            "77"
        ],
        [
            "82"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "84"
        ],
        [
            "84"
        ],
        [
            "83"
        ],
        [
            "81"
        ],
        [
            "Source 1: Climate Charts"
        ],
        [
            "Source 2: Deutscher Wetterdienst (rainy days),"
        ],
        [
            "Demographics"
        ],
        [
            "Dumangas Municipal Hall"
        ],
        [
            "Population census of DumangasYearPop.±% p.a.1903 12,428—    1918 19,894+3.19%1939 24,539+1.00%1948 29,336+2.00%1960 30,127+0.22%1970 35,284+1.59%1975 38,999+2.03%1980 41,241+1.12%1990 49,913+1.93%1995 51,092+0.44%2000 56,291+2.10%2007 62,769+1.51%2010 66,108+1.90%2015 69,108+0.85%2020 73,899+1.33%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Dumangas, Iloilo, was 73,899 people, with a density of 570 inhabitants per square kilometre or 1,500 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Dumangas"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  25.20"
        ],
        [
            "2009  15.98"
        ],
        [
            "2012  21.35"
        ],
        [
            "2015  21.01"
        ],
        [
            "2018  14.14"
        ],
        [
            "2021  16.17"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Rice planting in Dumangas"
        ],
        [
            "Dumangas' economy is centered on agriculture and livestock are predominant.",
            "It is home of the Haw-as Festival.",
            "Dumangas continues to retain its provincial standing, but whose commitment to certain fundamental community values and innovation has produced many in the way of medicine, law, and education.",
            "The town is one of the seven first class municipalities in Iloilo and the richest and the most populated municipality in the fourth District of Iloilo.",
            "It is also a fast-growing municipality and expected to become a component city in the future."
        ],
        [
            "Infrastructure"
        ],
        [
            "Wharf"
        ],
        [
            "The wharf in the Municipality of Dumangas is located at Barangay Dacutan, 6.2 km from the Poblacion area.",
            "This wharf serves as a landing area for pump boats and motor boats carrying fish, rice, salt, sugar, woods, etc.",
            "from Negros and Guimaras Islands to Dumangas and other part of Iloilo and vice versa."
        ],
        [
            "Port"
        ],
        [
            "The Port of Dumangas is one of the major ports operating in the Province of Iloilo.",
            "It is located in Sitio Nalu-oyan at Barangay Sapao, Dumangas, Iloilo.",
            "Roll-on Roll-Off (RORO) Vessels carrying passengers and cargoes plying Dumangas, Iloilo – Bacolod and vice versa are now operational."
        ],
        [
            "It also serves as an outlet for rice, sugar, fish products, etc.",
            "for central and eastern towns of Iloilo."
        ],
        [
            "Municipal Slaughter House"
        ],
        [
            "Dumangas is one of the biggest poultry and livestock raising municipalities in the Province of Iloilo.",
            "A modern Slaughterhouse was established and constructed at Barangay Balabag, this Municipality to accommodate the bulk of poultry and livestock being slaughtered within the municipality."
        ],
        [
            "The slaughterhouse is strategically located in Barangay Balabag, which is accessible to other poultry-and livestock-raising municipalities such as Barotac Nuevo, Zarraga, Pototan and New Lucena."
        ],
        [
            "Ice Plant"
        ],
        [
            "The Municipal Ice Plant was constructed beside the Municipal Slaughterhouse at Barangay Balabag.",
            "It is funded through the Department of Agriculture Regional Field Unit VI (DA-RFU VI) and the National Meat Inspection Commission (NMIC).",
            "Specifically, the DA-RFU VI had intended P1.5M for the Ice Plant building and the P5M from the NMIC for the Ice Plant equipment."
        ],
        [
            "Meat needs to reach its target market in good quality.",
            "The role of the Municipal Ice Plant is to ensure that the slaughterhouse operation will provide quality meat to the customers."
        ],
        [
            "At present, the Ice Plant was rented by local entrepreneur and is fully operational or at service to those who need its product."
        ],
        [
            "Irrigation System"
        ],
        [
            "The National Irrigation Administration (NIA) for the purpose of increasing rice production among farmers, is maintaining irrigation system in the Municipality of Dumangas.",
            "5,948.95 has.",
            "of rice land in the municipality are considered as irrigated areas.",
            "Portions of this area which cannot be reach by the irrigation system from the NIA has tube wells “tasok” as their source of water for irrigation."
        ],
        [
            "Power"
        ],
        [
            "The Municipality is being supplied with electricity by the Iloilo Electric Cooperative II (ILECO II) sub-station located at Barangay Pagdugue, Dumangas, and Iloilo.",
            "Source of power from this sub-station is directly supplied by the NAPOCOR with a capacity of 5 M.V.A.",
            "(Mega Volt Amperes), which supplies the area of Dumangas, Zarraga and Barotac Nuevo.",
            "100% of the barangays in the Municipality of Dumangas are connected to this electrical grid."
        ],
        [
            "Water"
        ],
        [
            "The Municipality of Dumangas is being supplied with potable water by the Dumangas-Barotac Nuevo Water District (DBNWD) with its main office located at P.D.",
            "Monfort North, Dumangas, Iloilo.",
            "Water sources comes from 5 Pumping Stations located at Barangays Cali, P.D.",
            "Monfort North (Lublub), Calao, Sulangan and Pagdugue capacity were turn down due to el niño phenomenon.",
            "Before Cali yields 81ps, 11lps, 15lps, 25lps now its well yields only 4lps, 6lps, 8lps, 10lps and additional of Pagdugue which 7lps respectively.",
            "Based on the capacity of these sources, there is insufficient supply of water due to higher demand, DBNWD put up a water filtration plant to augment the need of residents and future industries rises within the municipality and DBNWD utilized Jalaur River for its another source of potable water and will deliver 5,000 cum/day which is sufficient enough to the Municipality of Dumangas up to year 2021.",
            "Presently there is a total of 2,115 concessionaries in the municipality 2,072 of which are residential and institutional, 43 are commercial and industrial."
        ],
        [
            "Out of the 45 barangays in the Municipality of Dumangas, 39 Barangays are now being served by the DBNWD and there are still 6 barangays which are not served by DBNWD and are now in the priority plan of the Water District for expansion especially those areas identified for commercial and industrial purposes"
        ],
        [
            "Historical sites and landmarks"
        ],
        [
            "Saint Augustine Catholic Parish or Dumangas Church is of Gothic architectural style.",
            "The present church was constructed under the supervision of Father Fernando Llorente in 1887 and finished by Father Rafael Murillo in 1896.",
            "It was declared as a National Landmark by the National Historical Institute."
        ],
        [
            "Ruins of First Stone Church in Panay in Barangay Ermita was built in 1569 by Capt.",
            "Luis de la Haya, together with Augustinian Father Juan de Alva.",
            "It was declared a National Landmark by the National Historical Institute."
        ],
        [
            "Dumangas Public Plaza"
        ],
        [
            "Siete Pecados Islands Lighthouse"
        ],
        [
            "Monument of Col. Quintin D. Salas in Dumangas Public Plaza"
        ],
        [
            "Source:"
        ],
        [
            "Education"
        ],
        [
            "Private Schools"
        ],
        [
            "St. Augustine Catholic School"
        ],
        [
            "Dumangas Christian School, Inc. (Burgos-Regidor)"
        ],
        [
            "Dumangas Christian School (Tabucan)"
        ],
        [
            "Dumangas Baptist Development Academy, Inc.,"
        ],
        [
            "St. Louis de Montfort Academy"
        ],
        [
            "St. Isidore the Farmer Church School"
        ],
        [
            "Dumangas Doane Fundamental Academy"
        ],
        [
            "Dumangas Seventh Day Adventist School, Inc."
        ],
        [
            "Higher Education Institutions"
        ],
        [
            "Iloilo State College of Fisheries - Dumangas Campus (formerly Dumangas Polytechnic College)"
        ],
        [
            "Iloilo Science and Technology University - Dumangas Campus (formerly Purificacion Dolar Monfort College- WVCST Branch)"
        ],
        [
            "Secondary"
        ],
        [
            "P. D. Monfort National Science High School"
        ],
        [
            "Dumangas National High School"
        ],
        [
            "Pagdugue National High School"
        ],
        [
            "Cayos National High School"
        ],
        [
            "Primary"
        ],
        [
            "Dumangas Central Elementary School"
        ],
        [
            "P.D.",
            "Monfort Central Elementary School"
        ],
        [
            "Bacay Elementary School"
        ],
        [
            "Balabag Elementary School"
        ],
        [
            "Bantud Fabrica Elementary School"
        ],
        [
            "Bantud-Managuit Elementary School"
        ],
        [
            "Cali Elementary School"
        ],
        [
            "Cayos Elementary School"
        ],
        [
            "Dacutan Elementary School"
        ],
        [
            "Ermita Elementary School"
        ],
        [
            "Maquina Elementary School"
        ],
        [
            "Patlad Elementary School"
        ],
        [
            "Pulao Elementary School"
        ],
        [
            "Sapao Elementary School"
        ],
        [
            "Sulañgan Elementary School"
        ],
        [
            "Lacturan Primary School"
        ],
        [
            "Alyag Primary School"
        ],
        [
            "Tubigan Elementary school"
        ],
        [
            "Bacong Elementary School"
        ],
        [
            "Barasan Primary School"
        ],
        [
            "Bolilao Elementary School"
        ],
        [
            "Calao Elementary School"
        ],
        [
            "Cansilayan Elementary School"
        ],
        [
            "Pagdugue Elementary School"
        ],
        [
            "Paloc Bigque Elementary School"
        ],
        [
            "Paloc Sool Elementary School"
        ],
        [
            "Rosario Elementary School"
        ],
        [
            "Tamboilan Elementary School"
        ],
        [
            "Nanding Lopez Primary School"
        ],
        [
            "Capaliz Primary School"
        ],
        [
            "Media"
        ],
        [
            "105.3 Dream Radio"
        ],
        [
            "List of television and radio stations in Iloilo City"
        ],
        [
            "Notable people"
        ],
        [
            "Godofredo Pedolin Orig, artist see on Municipal of Dumangas the portrait of every mayor."
        ],
        [
            "Hiligaynon writer Peter Solis Nery, a Palanca Awards Hall of Fame awardee, and the first Filipino author invited to the Sharjah International Book Fair."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Dumangas |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Mamuel Merino, O.S.A., ed., Conquistas de las Islas Filipinas (1565–1615), Madrid: Consejo Superior de Investigaciones Cientificas, 1975, pp.",
            "374–376."
        ],
        [
            "^ \"Iloilo History Part 2\"."
        ],
        [
            "^ Lapham, R., and Norling, B., 1996, Lapham's Raiders, Lexington: The University Press of Kentucky,ISBN 0813119499"
        ],
        [
            "^ \"From Araut to Dumangas a History of a Town | Welcome to Dumangas Website\".",
            "Archived from the original on 2016-07-29.",
            "Retrieved 2016-07-06."
        ],
        [
            "^"
        ],
        [
            "\"Province: Iloilo\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Climate (Average Weather) Data\".",
            "Climate Charts.",
            "Archived from the original on 11 May 2011.",
            "Retrieved 13 March 2011."
        ],
        [
            "^"
        ],
        [
            "\"Klimatafel von Iloilo / Insel Panay / Philippinen\" (PDF).",
            "Baseline climate means (1961–1990) from stations all over the world (in German).",
            "Deutscher Wetterdienst.",
            "Retrieved 5 April 2017."
        ],
        [
            "^"
        ],
        [
            "\"Iloilo City Climatological Extremes\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on 14 October 2018.",
            "Retrieved 14 October 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Iloilo Attractions | Province of Iloilo\".",
            "iloilo.gov.ph.",
            "Archived from the original on 2016-05-19."
        ],
        [
            "^ \"The Philippines Tourist Attractions and Latest News\"."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Dumangas."
        ],
        [
            "Wikisource has the text of the 1905 New International Encyclopedia article  \"Dumangas\"."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-05-09 at the Wayback Machine"
        ],
        [
            "Places adjacent to Dumangas"
        ],
        [
            "Pototan"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Zarraga"
        ],
        [
            "Dumangas"
        ],
        [
            "Guimaras Strait"
        ],
        [
            "Iloilo StraitBuenavista, Guimaras"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Dumangas&oldid=1231661676\""
        ],
        [
            "Categories: Municipalities of Iloilo1572 establishments in the PhilippinesPopulated places established in 1572Port cities and towns in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 German-language sources (de)CS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Tagalog-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}