{
    "name": "Dupax del Norte",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Dupax del Norte"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°18′27″N 121°06′07″E﻿ / ﻿16.3075°N 121.1019°E﻿ / 16.3075; 121.1019"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Nueva Vizcaya, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Dupax del Norte\" – news · newspapers · books · scholar · JSTOR (December 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesDupax del NorteMunicipalityMunicipality of Dupax del NorteDowntown area"
        ],
        [
            "FlagSealMap of Nueva Vizcaya with Dupax del Norte highlightedOpenStreetMapDupax del NorteLocation within the PhilippinesCoordinates: 16°18′27″N 121°06′07″E﻿ / ﻿16.3075°N 121.1019°E﻿ / 16.3075; 121.1019CountryPhilippinesRegionCagayan ValleyProvinceNueva VizcayaDistrict"
        ],
        [
            "Lone districtBarangays15"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 163.5 million (2020) • Assets₱ 387.4 million (2020) • Expenditure₱ 160.1 million (2020) • Liabilities₱ 84.65 million (2020)Service provider • ElectricityNueva Vizcaya Electric Cooperative (NUVELCO)Time zoneUTC+8 (PST)ZIP code3706PSGC025007000IDD : area code +63 (0)78Native languagesGaddang Ilocano TagalogWebsitedupaxdelnorte.gov.ph"
        ],
        [
            "Dupax del Norte, officially the Municipality of Dupax del Norte (Gaddang: Ili na Dupax del Norte; Ilocano: Ili ti Dupax del Norte; Tagalog: Bayan ng Hilagang Dupax), is a 3rd class municipality in the province of Nueva Vizcaya, Philippines.",
            "According to the 2020 census, it has a population of 33,295 people."
        ],
        [
            "Dupax del Norte, situated on the south-eastern part of Nueva Vizcaya, has a total land area of 396 square kilometers.",
            "It is bounded by the town of Kasibu in the north, Alfonso Castañeda in the east, Dupax del Sur in the south, and Bambang in the west.",
            "It has wide tracts of virgin forests, rich, fertile plains and valleys with mineral deposits and has a climate suitable for agriculture."
        ],
        [
            "Etymology"
        ],
        [
            "The origin of the name Dupax stems from the Isinay term \"dopaj,\" denoting \"to recline in utter relaxation and repose\","
        ],
        [
            "Prior to the establishment of Dupax, the site of what would be its town proper served as a camp for hunters from surrounding tribal settlements."
        ],
        [
            "The area, either a plain or a valley, was located near their hunting grounds, and became their settlement as the town of Dopaj.",
            "The name later changed into Dupax when the Spaniards, upon their arrival, substituted letter \"j\" for \"x\" for convenience."
        ],
        [
            "History"
        ],
        [
            "The town of Dupax was first discovered by Luis Pérez Dasmariñas in 1591.",
            "Eighteen years later, the mission was established by the Dominicans, but was later abandoned due to territorial disputes with the Franciscans."
        ],
        [
            "Colonization seemed difficult for decades.",
            "In 1717, Fr.",
            "Alejandro Cacho came on mission to Dupax and established Christian communities."
        ],
        [
            "In the early 18th century, Dupax was inhabited by three tribes."
        ],
        [
            "As early as 1928, during the term of Municipal President Inocencio Suzon, there were attempts to transfer the town hall to Barrio Malasin (poblacion of the present Dupax del Norte) from the poblacion (the present poblacion of Dupax del Sur).",
            "On November 28, 1931, during the incumbency of Municipal President Tranquilino Orden, the Municipal Council has approved Resolution No.",
            "94 sponsored by Councilor Victoriano Barroga proposing the transfer of the seat of the municipal government from the old poblacion to Malasin.",
            "Congressman Leonardo B. Perez sponsored a bill on that matter."
        ],
        [
            "Dupax then was the largest municipality in Nueva Vizcaya in terms of land area"
        ],
        [
            "In 1979, through Batas Pambansa Blg.",
            "27 approved by Marcos, four barangays and a sitio in the municipality, along with parts of Dupax del Sur, were separated to constitute into a municipality, Alfonso Castañeda."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Municipal hall"
        ],
        [
            "Dupax del Norte is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Belance"
        ],
        [
            "Binuangan"
        ],
        [
            "Bitnong"
        ],
        [
            "Bulala"
        ],
        [
            "Inaban"
        ],
        [
            "Ineangan"
        ],
        [
            "Lamo"
        ],
        [
            "Mabasa"
        ],
        [
            "Macabenga"
        ],
        [
            "Malasin (Poblacion)"
        ],
        [
            "Munguia"
        ],
        [
            "New Gumiad"
        ],
        [
            "Oyao"
        ],
        [
            "Parai"
        ],
        [
            "Yabbi"
        ],
        [
            "Mabasa"
        ],
        [
            "Mabasa (Iloko for \"wet\") is a barangay of Dupax del Norte.",
            "It was one of the oldest barrio of Dupax (when the town was not yet divided into two).",
            "Mabasa was originally called San Roque, named by the parish priest of Dupax after the saint of hunters because the place then was a thick forest where game was abundant such as deer and wild pigs."
        ],
        [
            "The first settlers of San Roque were Ilokano migrants from the town of Paoay in Ilocos Norte and from Alcala and San Nicolas towns in Pangasinan.",
            "They travelled by foot and by horses and carabaos through San Nicolas, passing through Imugan, Santa Fe, Nueva Vizcaya.",
            "The migrants settled at Sitio Poonan (later called Puongan).",
            "The family of Apolonio Vadil was the first settler in Poungan.",
            "Old records from the Roman Catholic Church in Dupax del Sur showed that the daughter of Apolonio Vadil, Tomasa, was baptized on October 10, 1887."
        ],
        [
            "More migrants came and settled along the Apean (Apayan) River from Puongan upstream and occupied the western part of the barrio now called Riverside East and Riverside West.",
            "The settlers found the place always flowing with abundant water coming from a spring in the eastern part of the barrio, and so they called the place \"Nabasa\" which means \"wet\" in Iloko language.",
            "It was later officially called \"Mabasa\" changing from the old name of \"San Roque.\""
        ],
        [
            "Inaban"
        ],
        [
            "The name came from the Iloko word Inabaan which means a place where there are plenty of gabi (taro) plants, locally known as “ABA”.",
            "In the early days, giant gabi plants with leaves as big as umbrellas thrived in the vicinity of this barangay."
        ],
        [
            "A story goes that many years ago when the place was still thickly covered with flora and fauna,  and was a favorite hunting ground, a hunter once hit a big male deer with his spear.",
            "However, the deer was not mortally wounded and it decided to attack the hunter.",
            "The man and the deer fought for about an hour but in the end, the man triumphed over the animal but the hunter was seriously wounded.",
            "Alone,  he tried to find his way home.",
            "But then it began to rain, he sought shelter under the big leaves of the gabi plants.",
            "Unfortunately, the hunter died because of his wounds and days after, his remains were found under the gabi plants."
        ],
        [
            "During World War II, American soldiers pronounced the word Inabaan into Inaban."
        ],
        [
            "Inaban was formally created in 1963 as a barangay of Dupax (now Dupax del Norte) by virtue of Republic Act No.",
            "3590."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Dupax del Norte, Nueva Vizcaya"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "18(64)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "21(70)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "21(0.8)"
        ],
        [
            "28(1.1)"
        ],
        [
            "34(1.3)"
        ],
        [
            "58(2.3)"
        ],
        [
            "160(6.3)"
        ],
        [
            "179(7.0)"
        ],
        [
            "226(8.9)"
        ],
        [
            "225(8.9)"
        ],
        [
            "215(8.5)"
        ],
        [
            "168(6.6)"
        ],
        [
            "59(2.3)"
        ],
        [
            "32(1.3)"
        ],
        [
            "1,405(55.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "7.5"
        ],
        [
            "8.5"
        ],
        [
            "10.9"
        ],
        [
            "14.9"
        ],
        [
            "23.9"
        ],
        [
            "25.7"
        ],
        [
            "26.7"
        ],
        [
            "25.3"
        ],
        [
            "24.9"
        ],
        [
            "18.6"
        ],
        [
            "11.8"
        ],
        [
            "8.9"
        ],
        [
            "207.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Dupax del NorteYearPop.±% p.a.1975 14,818—    1980 16,743+2.47%1990 20,904+2.24%1995 22,142+1.08%2000 23,196+1.00%2007 23,816+0.36%2010 25,697+2.80%2015 27,514+1.31%2020 33,295+3.82%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Dupax del Norte had a population of 33,295.",
            "The population density was 96 inhabitants per square kilometre (250/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Dupax del Norte"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  16.50"
        ],
        [
            "2009  11.40"
        ],
        [
            "2012  14.55"
        ],
        [
            "2015  12.82"
        ],
        [
            "2018  14.22"
        ],
        [
            "2021  10.05"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Dupax del Norte, belonging to the lone congressional district of the province of Nueva Vizcaya, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Luisa L. Cuaresma"
        ],
        [
            "Mayor"
        ],
        [
            "Timothy Joseph E. Cayton"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Victorino V. Prado"
        ],
        [
            "Councilors"
        ],
        [
            "Juan Paolo E. Cayton"
        ],
        [
            "Jimmy Balisi"
        ],
        [
            "Ric Ronelson D. Asuncion"
        ],
        [
            "Arnel A. Herrera"
        ],
        [
            "Joey Oldico"
        ],
        [
            "Agie Arsenio"
        ],
        [
            "Penly Apasao"
        ],
        [
            "Roland Mabitasan"
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Nueva Vizcaya governs the town's public education system.",
            "The division office is a field office of the DepEd in Cagayan Valley region.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Notable personalities"
        ],
        [
            "Carlos Padilla (September 19, 1944 – May 5, 2023), a Filipino politician who serves as governor of Nueva Vizcaya from 2016 up until his death on 2023."
        ],
        [
            "Sister cities"
        ],
        [
            "San Pedro, Laguna"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Dupax del Norte |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c d e f \"Dupax del Norte\".",
            "Province of Nueva Vizcaya.",
            "Government of the Philippines.",
            "Retrieved May 5, 2023."
        ],
        [
            "^ a b c d e f g h \"Dupax del Sur\".",
            "Province of Nueva Vizcaya.",
            "Government of the Philippines.",
            "Retrieved May 5, 2023."
        ],
        [
            "^ a b c d e f g h i \"About Us\".",
            "Municipality of Dupax del Norte.",
            "Government of the Philippines.",
            "Retrieved May 5, 2023."
        ],
        [
            "^ \"Republic Act No.",
            "1181\".",
            "The Corpus Juris.",
            "Corpus Juris.",
            "June 20, 1954.",
            "Retrieved May 7, 2023."
        ],
        [
            "^ \"Towns: Dupax del Norte\".",
            "Retrieved May 7, 2023."
        ],
        [
            "^ \"Republic Act No.",
            "6372\".",
            "Legislative Digital Resources.",
            "Senate of the Philippines.",
            "August 16, 1971.",
            "Retrieved May 6, 2023."
        ],
        [
            "^ a b \"Presidential Decree No.",
            "586\".",
            "The LawPhil Project.",
            "Arellano Law Foundation.",
            "November 20, 1974.",
            "Retrieved May 6, 2023."
        ],
        [
            "^ \"Batas Pambansa Blg.",
            "27\".",
            "The LawPhil Project.",
            "Arellano Law Foundation.",
            "April 20, 1979.",
            "Retrieved May 6, 2023."
        ],
        [
            "^"
        ],
        [
            "\"Dupax del Norte: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 4 July 2021."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Nueva Vizcaya\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Dupax Del Norte | Nueva Vizcaya Election Results\".",
            "GMA News.",
            "13 May 2022.",
            "Retrieved 10 April 2024."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Dupax del Norte."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-12-21 at archive.today"
        ],
        [
            "RA 6372 - Creating the Municipality of Dupax del Sur"
        ],
        [
            "PD 586 - Amending RA 6372, inserting new sections"
        ],
        [
            "Places adjacent to Dupax del Norte"
        ],
        [
            "Bambang"
        ],
        [
            "Kasibu"
        ],
        [
            "Dupax del Sur"
        ],
        [
            "Dupax del Norte"
        ],
        [
            "Nagtipunan, Quirino"
        ],
        [
            "Alfonso Castañeda"
        ],
        [
            "vte Province of Nueva VizcayaBayombong (capital and largest municipality)Municipalities"
        ],
        [
            "Alfonso Castañeda"
        ],
        [
            "Ambaguio"
        ],
        [
            "Aritao"
        ],
        [
            "Bagabag"
        ],
        [
            "Bambang"
        ],
        [
            "Bayombong"
        ],
        [
            "Diadi"
        ],
        [
            "Dupax del Norte"
        ],
        [
            "Dupax del Sur"
        ],
        [
            "Kasibu"
        ],
        [
            "Kayapa"
        ],
        [
            "Quezon"
        ],
        [
            "Santa Fe"
        ],
        [
            "Solano"
        ],
        [
            "Villaverde"
        ],
        [
            "BarangaysSee: List of barangays in Nueva Vizcaya"
        ],
        [
            "Authority control databases: Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Dupax_del_Norte&oldid=1229017748\""
        ],
        [
            "Category: Municipalities of Nueva VizcayaHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from December 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Gaddang-language textArticles containing Ilocano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from May 2023Commons category link is on WikidataWebarchive template archiveis linksArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}