{
    "name": "El Nido",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "El Nido, Palawan"
        ],
        [
            "27 languages"
        ],
        [
            "Bikol CentralCatalàCebuanoChavacano de ZamboangaDanskDeutschEspañolفارسیFrançais한국어IlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlands日本語Norsk bokmålPangasinanPortuguêsSvenskaTagalogTürkçeTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°11′44″N 119°24′27″E﻿ / ﻿11.19556°N 119.4075°E﻿ / 11.19556; 119.4075"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Palawan, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesEl NidoMunicipalityMunicipality of El NidoView of El Nido"
        ],
        [
            "FlagSealMap of Palawan with El Nido highlightedOpenStreetMapEl NidoLocation within the PhilippinesCoordinates: 11°11′44″N 119°24′27″E﻿ / ﻿11.19556°N 119.4075°E﻿ / 11.19556; 119.4075CountryPhilippinesRegionMimaropaProvincePalawanDistrict"
        ],
        [
            "1st districtFounded1916RenamedJune 17, 1954Barangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEdna G. Lim • Vice MayorLuningning L. Batoy • RepresentativeFranz Josef George E. Alvarez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Christine Nicole G. LimGeraldo B. DiazBernardo D. LegaspiRosano G. LlaneraMateo A. CantubaJun M. MonesEdnalyn B. NangitJohn Rostum T. Vidal"
        ],
        [
            " • Electorate33,692 voters (2022)Area • Revenue₱ 444.3 million (2020) • Assets₱ 1,413 million (2020) • Expenditure₱ 322.3 million (2020) • Liabilities₱ 417 million (2020)Service provider • ElectricityPalawan Electric Cooperative (PALECO)Time zoneUTC+8 (PST)ZIP code5313PSGC1705312000IDD : area code +63 (0)48Native languagesPalawano TagalogWebsitewww.elnidopalawan.gov.ph"
        ],
        [
            "El Nido, officially the Municipality of El Nido (Cuyonon: Banwa i'ang El Nido, Tagalog: Bayan ng El Nido), is a 1st class municipality in the province of Palawan, Philippines.",
            "According to the 2020 census, it has a population of 50,494 people."
        ],
        [
            "It is about 420 kilometres (260 mi) south-west of Manila, it is known for its white-sand beaches, coral reefs, and limestone cliffs, as well as for being the gateway to the Bacuit archipelago."
        ],
        [
            "History"
        ],
        [
            "El Nido, also known as Bacuit, has been inhabited by humans since at least 2680 BC, possibly as early as 22,000 years ago."
        ],
        [
            "The town traces its roots from a small Tagbanwa village called Talindak.",
            "Sometime in the 16th century, waves of migrants from Cuyo Islands settled in the area.",
            "In the 1800s, the Spaniards arrived, and they moved to the area where the present-day Población and Mabini are located."
        ],
        [
            "During the Spanish colonial era, the town was under the jurisdiction of the Municipality of Taytay, which was the capital of the former Province of Calamianes from 1818, and the Province of Castilla, the area of what is now known as northern Palawan, from 1858.",
            "It remained part of Taytay until 1916, when it formally became an independent municipality.",
            "The new municipality was then known as Bacuit."
        ],
        [
            "On June 17, 1954, Republic Act No.",
            "1140"
        ],
        [
            "In 1957, the following barrios were created:"
        ],
        [
            "Villa Paz comprising the sitios of New Igabas, Candolay, Malapaho, Mabeñgeten, Dewel, Nalbekan, and Lapia;"
        ],
        [
            "Bebeladan comprising the sitios of Mainlong, Bolabod, Balete, Culiong, Codongnon, Vigan, Pagawanen, Langeblangeban, Talulap, Bocboc, Miadiao, Avirawan, Pita, Deboluan, Balay-Bacaco, Kiminawit, Pamontonan, Simpian, Binabanan, Tegas, and Pinacpanacan;"
        ],
        [
            "Bagong-Bayan comprising the sitios of Manogtog, Cadleman, Pinagtual, Omao, Nami, Tebey, Bato, Tuñgay, Cataaban, and Lomocob;"
        ],
        [
            "Pasadeña comprising the sitios of Lamoro, Cagbatang, Bulalacao, Pinañganteñgan, Quinawañgan, Nagbaclao, Colantod, Loblob, and Badiang;"
        ],
        [
            "Sibaltan comprising the sitios of Turatod, Buluang, Santa Monica, Senodioc, Laolao, Caboñgan, Tapic, Panian, Guitan, Loro, and Nagcalasag;"
        ],
        [
            "Barotuan comprising the sitios of Taberna, Locaroc, Nagpan, Yocoton, Calitang, Wawa, Makinit, Canoling, Mabañgaon, and Mapeldeten;"
        ],
        [
            "San Fernando comprising the sitios of Panian, Madorianen, Dipnay, Maubog, Guenleng, Palabuayan, Parañgaycayan, San Pablo, and Olac-olacan; and,"
        ],
        [
            "Villa Libertad comprising the sitios of Calelenday, Taolili, Boloc, Inigtan, Mepague, Matolatolaon, Dao, Batbat, Madacotdacot, Nasigdan, Semenled, Bancalen, and Cagbanaba."
        ],
        [
            "Geography"
        ],
        [
            "Aerial view of Bucana, in the northern part of El Nido"
        ],
        [
            "El Nido is situated in Bacuit Bay and covers a land area of 465.1 square kilometres (179.6 sq mi)."
        ],
        [
            "Together with Sulu Archipelago, Sabah, and the South China Sea, El Nido, being part of Palawan, is located in the tectonically active and seismically active Sunda Plate,"
        ],
        [
            "Barangays"
        ],
        [
            "El Nido is politically subdivided into eighteen barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Four of these barangays are situated in the Población (town proper) and are also known by their respective zones."
        ],
        [
            "Bagong Bayan"
        ],
        [
            "Buena Suerte (Zone II)"
        ],
        [
            "Barotuan"
        ],
        [
            "Bebeladan"
        ],
        [
            "Corong-corong (Zone IV)"
        ],
        [
            "Mabini (formerly Oton)"
        ],
        [
            "Manlag"
        ],
        [
            "Masagana (Zone III)"
        ],
        [
            "New Ibajay"
        ],
        [
            "Pasadeña"
        ],
        [
            "Maligaya (Zone I)"
        ],
        [
            "San Fernando"
        ],
        [
            "Sibaltan"
        ],
        [
            "Teneguiban"
        ],
        [
            "Villa Libertad"
        ],
        [
            "Villa Paz"
        ],
        [
            "Bucana"
        ],
        [
            "Aberawan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for El Nido, Palawan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "25(77)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "20(68)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "6(0.2)"
        ],
        [
            "0(0)"
        ],
        [
            "12(0.5)"
        ],
        [
            "39(1.5)"
        ],
        [
            "117(4.6)"
        ],
        [
            "351(13.8)"
        ],
        [
            "435(17.1)"
        ],
        [
            "375(14.8)"
        ],
        [
            "159(6.3)"
        ],
        [
            "159(6.3)"
        ],
        [
            "45(1.8)"
        ],
        [
            "12(0.5)"
        ],
        [
            "1,710(67.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "17"
        ],
        [
            "25"
        ],
        [
            "26"
        ],
        [
            "24"
        ],
        [
            "20"
        ],
        [
            "19"
        ],
        [
            "9"
        ],
        [
            "4"
        ],
        [
            "154"
        ],
        [
            "Source: World Weather Online (modelled/calculated data, not measured locally)"
        ],
        [
            "The climate in El Nido is distinguished by two seasons: dry, from December to May, and wet, from June to November.",
            "April and May are typically the driest, while the heaviest rainfall occurs around August.",
            "The northeast wind blows from December to March, occasionally interchanging with the north wind from December to February.",
            "The southwest wind is felt from June to October while the east wind, the mildest of all winds, blows during April and May."
        ],
        [
            "The average temperature ranges from a low of 22 °C (72 °F) to a high of 33 °C (91 °F).",
            "The coolest temperatures are usually experienced during January, while the hottest temperatures are felt in April and May."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of El NidoYearPop.±% p.a.1918 1,789—    1939 2,280+1.16%1948 2,306+0.13%1960 4,075+4.86%1970 7,358+6.08%1975 8,749+3.53%1980 11,657+5.91%YearPop.±% p.a.1990 18,832+4.91%1995 21,948+2.91%2000 27,029+4.57%2007 30,249+1.56%2010 36,191+6.74%2015 41,606+2.69%2020 50,494+3.88%Source: Philippine Statistics Authority"
        ],
        [
            "Calle Real in El Nido"
        ],
        [
            "In the 2020 census, the population of El Nido was 50,494 people, with a density of 55 inhabitants per square kilometre or 140 inhabitants per square mile."
        ],
        [
            "The first town census of 1918 showed El Nido having a population of 1,789.",
            "In the period between 1980 and 1990, the population grew to 18,832."
        ],
        [
            "According to the 2007 census, El Nido has a population of 30,249 people in 6,311 households in its eighteen barangays.",
            "Eighty-five percent of the population are living in the rural barangays, while only fifteen percent of them are in the Población area."
        ],
        [
            "Ethnic groups"
        ],
        [
            "The original settlers of El Nido were the Tagbanwas and Cuyunons.",
            "Throughout the centuries, there has been a constant migration of Tagalogs, Hiligaynon, Bicolanos, Ilocanos, Chinese and Spaniards.",
            "There are also a small number of Japanese and Koreans.",
            "Intermarriage between ethnic and linguistic groups is not uncommon in El Nido."
        ],
        [
            "Languages"
        ],
        [
            "The main language is Filipino (Tagalog).",
            "In addition, many people are very proficient in English, Hiligaynon, other Visayan languages, and Bicolano.",
            "A small but significant percentage of the population speaks or comprehends Cuyonon, the native language of the Cuyo Islands and most parts of Palawan."
        ],
        [
            "Economy"
        ],
        [
            "Fishing boats in El Nido"
        ],
        [
            "Poverty incidence of El Nido"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  47.30"
        ],
        [
            "2009  29.69"
        ],
        [
            "2012  27.08"
        ],
        [
            "2015  22.11"
        ],
        [
            "2018  16.32"
        ],
        [
            "2021  15.35"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The main industries of El Nido are fishing, agriculture and tourism, being a popular diving location.",
            "Edible nest-gathering"
        ],
        [
            "As a tourist destination, El Nido has been included in Condé Nast Traveler's list of \"20 Most Beautiful Beaches in the World,\""
        ],
        [
            "Government"
        ],
        [
            "Municipal Hall"
        ],
        [
            "El Nido is governed by a mayor and a vice mayor, who are elected to three-year terms.",
            "The mayor is the executive head and leads the municipality's departments to execute the municipal ordinances and improve public services.",
            "The vice mayor heads the legislative council consisting of eight councilors, more commonly known as Sangguniang Bayan members.",
            "The municipal council is in charge of creating the municipality's policies in the form of ordinances and resolutions."
        ],
        [
            "Seal"
        ],
        [
            "The municipality seal shows a silhouette of the territory of El Nido inside an armor-shaped picture.",
            "The famous marble and limestone cliffs represent the nesting ground of the swiftlets.",
            "Behind it is the oil rig, representing the areas within its administrative boundaries that are found to be rich in oil and natural gas such as the Malampaya Sound, which is 50 kilometers At the bottom of the picture is the rice field, with the carabao head superimposed at the center, and on the other side, the sea, with the fish and the squid in situated the middle, representing farming and fishing, the two main industries of its people."
        ],
        [
            "Protected area status"
        ],
        [
            "A lagoon in El Nido"
        ],
        [
            "Corong Corong Beach"
        ],
        [
            "Establishment"
        ],
        [
            "In 1984, the then Ministry of Natural Resources issued Administrative Order No.",
            "518, establishing a 360 square kilometres (140 sq mi) maritime area in El Nido as a turtle sanctuary.",
            "In 1991, the rest of Bacuit Bay, including its island and islets, was proclaimed by the Philippine government as a marine reserve.",
            "A year later, by Administrative Order No.",
            "14 Series of 1992 of the Department of Environment and Natural Resources, this area was expanded even further.",
            "In 1998, its status was elevated to that of a protected area, including the terrestrial ecosystem of El Nido and portions of Taytay."
        ],
        [
            "Extent and scope"
        ],
        [
            "The El Nido-Taytay Managed Resource Protected Area is the largest marine sanctuary in the Philippines."
        ],
        [
            "The provincial government has mobilized its citizenry to actively participate in various environmental conservation and protection programs, such as the \"Bantay Gubat\" for forest protection, and the \"Bantay Dagat\" for marine life preservation."
        ],
        [
            "As a protected area, the Philippine government spends approximately US$ 180,000 annually to protect and manage its natural resources."
        ],
        [
            "El Nido, one of the country's most diverse ecosystems, is protected for its unique flora, fauna, and pristine geologic formations.",
            "These include:"
        ],
        [
            "limestone cliffs, the home of the swiftlets"
        ],
        [
            "50 white sand beaches"
        ],
        [
            "5 types of forest (the lowland evergreen rainforests found in the mainland and islands such as Miniloc, Lagen, and Pangulasian; semi-deciduous forests; forests over limestone; beach forests; the mangrove forests found mostly around major rivers and creeks in the mainland)"
        ],
        [
            "3 major marine habitats"
        ],
        [
            "16 endemic and 10 threatened species of birds (including the Palawan hornbill, the Palawan shama, the Palawan tit, Palawan scops owl, and the Palawan peacock pheasant)"
        ],
        [
            "6 species of marine mammals endemic to Palawan (including dolphins and its native dugong)"
        ],
        [
            "The Palawan tree shrew, the Palawan stink badger, the Palawan spiny rat, the Palawan anteater, and the northern Palawan tree squirrel"
        ],
        [
            "4 species of endangered marine turtles (hawksbill, olive ridley, leatherback and green sea turtles)"
        ],
        [
            "100 species of corals, 45 of which belong to the genera of hard corals"
        ],
        [
            "813 species of fish"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Air"
        ],
        [
            "Island Transvoyager's Dornier 228 aircraft at Lio Airport"
        ],
        [
            "El Nido Airport, also known as Lio Airport, is the primary and sole airport serving the town of El Nido."
        ],
        [
            "Roads"
        ],
        [
            "The main roads of El Nido are organized around a set of radial and circumferential roads that radiate and circle in and around the town proper and its rural barangays.",
            "Its interconnected roads are connected to the major highway that leads to Puerto Princesa, Palawan's capital.",
            "Daily buses and jeepneys depart at San Jose Terminal in Puerto Princesa for El Nido.",
            "Tricycles are used for short-distance trips around the town proper."
        ],
        [
            "The 60 kilometres (37 mi) national road between Taytay and El Nido was rehabilitated, and this has helped boost tourism and business activity in the area."
        ],
        [
            "Seaports and piers"
        ],
        [
            "The main port in El Nido, which is under the jurisdiction of the Philippine Ports Authority (PPA), is located in Buena Suerte (Zone II), although several small and accessible wharves, such as the San Fernando pier, are being used in other rural barangays.",
            "Several ferries and other sea vessels owned by Atienza Shipping Lines and San Nicholas Shipping Lines have regular trips from Manila to El Nido."
        ],
        [
            "Utilities"
        ],
        [
            "The Población area is part of the service areas of electric utility, Palawan Electric Cooperative (PALECO), a division of the National Power Corporation operating with 0.423 megawatts of electricity."
        ],
        [
            "Education"
        ],
        [
            "El Nido has more than ten public elementary and secondary schools located in most of its barangays.",
            "El Nido Central School and El Nido National High School, which are both located at the Poblacion, have the largest facilities and number of students, among these schools.",
            "Recently, the Palawan State University opened its El Nido campus in New Ibajay, offering extramural programs and studies.",
            "Some of the lower-grade schools are located in Calitang, such as Calitang Elementary School, Pasadeña Elementary School, Barutoan Elementary School, Bucana Elementary School, and Lamoro Elementary School."
        ],
        [
            "See also"
        ],
        [
            "Philippines portal"
        ],
        [
            "El Nido Airport"
        ],
        [
            "List of renamed cities and municipalities in the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of El Nido |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b c d e f g \"El Nido Tourism\".",
            "Archived from the original on July 10, 2011.",
            "Retrieved May 18, 2012."
        ],
        [
            "^ a b c d Destination: El Nido.",
            "Accessed 24, 2008."
        ],
        [
            "^ History of Palawan Archived January 15, 2009, at the Wayback Machine.",
            "Campersponit website.",
            "Accessed January 26, 2009."
        ],
        [
            "^ \"Republic Act no.",
            "1140\".",
            "Chan Robles Virtual Law Library.",
            "Retrieved on October 20, 2010."
        ],
        [
            "^ \"An Act Creating Certain Barrios in the Municipality of El Nido, Province of Palawan\".",
            "LawPH.com.",
            "Archived from the original on July 11, 2012.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ \"An Act Changing the Name of Barrio Oton, Municipality of El Nido, Province of Palawan, to Mabini\".",
            "LawPH.com.",
            "Archived from the original on July 13, 2012.",
            "Retrieved April 13, 2011."
        ],
        [
            "^ a b Official Website of the Province of Palawan.",
            "Accessed August 28, 2008.",
            "Archived August 27, 2008, at the Wayback Machine"
        ],
        [
            "^ a b c Palawan Council for Sustainable Development: Protected Areas.",
            "Accessed September 5, 2008."
        ],
        [
            "^ a b On Shaky Ground Archived December 18, 2009, at the Wayback Machine."
        ],
        [
            "^ North Palawan Block, Philippines--Its Relation to Asian Mainland and Role in Evolution of South China Sea.",
            "Accessed March 29, 2010."
        ],
        [
            "^"
        ],
        [
            "\"El Nido, Philippines: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved September 15, 2014."
        ],
        [
            "^ a b Philippine Country.",
            "Accessed August 25, 2008."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ El Nido: Info.",
            "Accessed August 24, 2008."
        ],
        [
            "^ 2000 Census of Population and Housing: Palawan.",
            "Accessed August 27, 2008.",
            "Archived August 23, 2008, at the Wayback Machine"
        ],
        [
            "^ Population Census 2007 Press Release.",
            "Accessed August 27, 2008 Archived August 25, 2008, at the Wayback Machine"
        ],
        [
            "^ \"Municipality of El Nido\".",
            "Philippine National Statistical Coordination Board.",
            "Retrieved on October 20, 2010."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Guardians of the bird nests.",
            "Accessed September 5, 2008."
        ],
        [
            "^ \"The 25 Best Island Beaches in the World: 2020 Readers' Choice Awards\".",
            "February 24, 2015."
        ],
        [
            "^ The Philippines' best beaches and islands Archived November 7, 2012, at the Wayback Machine.",
            "CNN Go website.",
            "Accessed May 15, 2012."
        ],
        [
            "^ El Nido named Best Philippine Beach.",
            "ABS-CBN website.",
            "Accessed May 15, 2012."
        ],
        [
            "^ Destination of the Month: El Nido, Palawan Archived August 4, 2017, at the Wayback Machine.",
            "Wow Philippines UK website.",
            "Accessed May 15, 2012."
        ],
        [
            "^ a b c \"The Pearl Of The Philippines Is El Nido.",
            "Facts and useful information.",
            "How to get to El Nido\".",
            "perispalawantraveljournal.blogspot.com.",
            "Retrieved August 26, 2008."
        ],
        [
            "^ Oil exploration firm sells stake in Cadlao oilfield Accessed September 5, 2008."
        ],
        [
            "^ a b UNESCO:El Nido-Taytay Managed Resource Area.",
            "August 26, 2008."
        ],
        [
            "^ Palawan Tourism Council Archived May 16, 2008, at the Wayback Machine"
        ],
        [
            "^ El Nido Tourism Protected Area Archived October 4, 2011, at the Wayback Machine.",
            "Accessed March 29, 2010."
        ],
        [
            "^ a b Palawan Council for Sustainable Development: El Nido - Taytay Managed Resource Protected Area.",
            "Accessed 26, 2008"
        ],
        [
            "^ a b c El Nido as a Protected Area.",
            "Accessed August 24, 2008."
        ],
        [
            "^ The ceramic corals of El Nido.",
            "Accessed September 10, 2008.",
            "Archived May 14, 2006, at the Wayback Machine"
        ],
        [
            "^ El Nido: Transportation"
        ],
        [
            "^ Official Website of the Province of Palawan: Infrastructure.",
            "Accessed September 10, 2008.",
            "Archived August 27, 2008, at the Wayback Machine"
        ],
        [
            "^ a b Official Website of the Province of Palawan: Public utilities.",
            "Accessed August 28, 2008.",
            "Archived August 27, 2008, at the Wayback Machine"
        ],
        [
            "^ El Nido FAQs Archived March 10, 2009, at the Wayback Machine.",
            "Accessed March 29, 2010."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for El Nido."
        ],
        [
            "Wikimedia Commons has media related to El Nido, Palawan."
        ],
        [
            "Palawan Council for Sustainable Development: Palawan Flora and Fauna"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Local Governance Performance Management System Archived January 6, 2016, at the Wayback Machine"
        ],
        [
            "Places adjacent to El Nido, Palawan"
        ],
        [
            "South China Sea"
        ],
        [
            "Sulu Sea / Linapacan"
        ],
        [
            "South China Sea"
        ],
        [
            "El Nido"
        ],
        [
            "Sulu Sea"
        ],
        [
            "Taytay"
        ],
        [
            "vte Province of PalawanPuerto Princesa (capital and largest city)Municipalities"
        ],
        [
            "Aborlan"
        ],
        [
            "Agutaya"
        ],
        [
            "Araceli"
        ],
        [
            "Balabac"
        ],
        [
            "Bataraza"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Busuanga"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Coron"
        ],
        [
            "Culion"
        ],
        [
            "Cuyo"
        ],
        [
            "Dumaran"
        ],
        [
            "El Nido"
        ],
        [
            "Kalayaan"
        ],
        [
            "Linapacan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Narra"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "San Vicente"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Taytay"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Puerto Princesa (Administratively independent from the province but grouped under Palawan by the Philippine Statistics Authority.)"
        ],
        [
            "vteProtected areas in MimaropaNational parks"
        ],
        [
            "Mounts Iglit–Baco"
        ],
        [
            "Naujan Lake"
        ],
        [
            "Puerto Princesa Subterranean River"
        ],
        [
            "Natural parks"
        ],
        [
            "Apo Reef"
        ],
        [
            "Mount Guiting-Guiting"
        ],
        [
            "Tubbataha Reef"
        ],
        [
            "Protected landscapes"
        ],
        [
            "Mount Mantalingajan"
        ],
        [
            "Protected landscapes and seascapes"
        ],
        [
            "Malampaya Sound"
        ],
        [
            "Game refuge and bird sanctuaries"
        ],
        [
            "Calauit Safari Park"
        ],
        [
            "Palawan"
        ],
        [
            "Managed resource protected areas"
        ],
        [
            "El Nido"
        ],
        [
            "Watershed forest reserves"
        ],
        [
            "Calatrava-San Andres-San Agustin"
        ],
        [
            "Palawan"
        ],
        [
            "Torrijos"
        ],
        [
            "Wildlife sanctuaries"
        ],
        [
            "Mount Malindig-Marinduque"
        ],
        [
            "Mount Calavite"
        ],
        [
            "Rasa Island"
        ],
        [
            "Protected areas of the Philippines"
        ],
        [
            "vteWorld Heritage Sites in the PhilippinesCultural"
        ],
        [
            "Baroque Churches of the Philippines (San Agustin, Paoay, Santa Maria, Miagao)"
        ],
        [
            "Historic Town of Vigan"
        ],
        [
            "Rice Terraces of the Philippine Cordilleras (Batad, Bangaan, Hungduan, Mayoyao Central, Nagacadan)"
        ],
        [
            "Natural"
        ],
        [
            "Mount Hamiguitan Range Wildlife Sanctuary"
        ],
        [
            "Puerto Princesa Subterranean River National Park"
        ],
        [
            "Tubbataha Reef"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=El_Nido,_Palawan&oldid=1227335628\""
        ],
        [
            "Categories: Municipalities of PalawanProtected areas of the PhilippinesBeaches of the PhilippinesTourist attractions in PalawanHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from April 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cuyonon-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}