{
    "name": "El Salvador",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "El Salvador, Misamis Oriental"
        ],
        [
            "22 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°34′N 124°31′E﻿ / ﻿8.57°N 124.52°E﻿ / 8.57; 124.52"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Not to be confused with El Salvador.Component city in Misamis Oriental, Philippines"
        ],
        [
            "Component city in Northern Mindanao, PhilippinesEl Salvador"
        ],
        [
            "TagnipaComponent cityCity of El SalvadorFrom left to right: Divine Mercy Shrine; Barangay Poblacion of El Salvador; Our Lady of the Snows Parish Church"
        ],
        [
            "FlagSealAnthem: Tagnipan-ong ParaisoMap of Misamis Oriental with El Salvador highlightedOpenStreetMapEl SalvadorLocation within the PhilippinesCoordinates: 8°34′N 124°31′E﻿ / ﻿8.57°N 124.52°E﻿ / 8.57; 124.52CountryPhilippinesRegionNorthern MindanaoProvinceMisamis OrientalDistrict"
        ],
        [
            "2nd districtFoundedJune 15, 1948CityhoodJune 27, 2007 (Lost cityhood in 2008 and 2010)Affirmed CityhoodFebruary 15, 2011Barangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorEdgar S. Lignes • Vice MayorMark William U. Tan • RepresentativeYevgeny Vicente B. Emano • City Council"
        ],
        [
            "Members"
        ],
        [
            "John Mark T. NobleKent Tristan O. LignesJeen Ellen Grace Y. ClarinReynaldo L. Dangcal JrRafael Pedro C. BaculioNorie Lou M. EnerioEduardo A. AyuntingVacant"
        ],
        [
            " • Electorate44,389 voters (2022)Area • Revenue₱ 575.3 million (2020) • Assets₱ 1,747 million (2020) • Expenditure₱ 470.5 million (2020) • Liabilities₱ 558.6 million (2020)Service provider • ElectricityMisamis Oriental 1 Rural Electric Cooperative (MORESCO 1)Time zoneUTC+8 (PST)ZIP code9017PSGC104307000IDD : area code +63 (0)88Native languagesCebuano Binukid Subanon TagalogFeast dateSunday after EasterCatholic dioceseArchdiocese of Cagayan de OroPatron saintThe Divine MercyWebsiteelsalvadorcity.gov.ph"
        ],
        [
            "El Salvador, officially the City of El Salvador (Cebuano: Dakbayan sa El Salvador; Filipino: Lungsod ng El Salvador), is a 6th class component city in the province of Misamis Oriental, Philippines.",
            "According to the 2020 census, it has a population of 58,771 people."
        ],
        [
            "The city serves as a pilgrimage site for Divine Mercy devotees.",
            "It is also known by its former name Tagnipa, which residents still refer to up to this day."
        ],
        [
            "History"
        ],
        [
            "During Spanish colonial era, a soldier named Alejandro Acusar sailed with his family from Bohol to the area what is now El Salvador to seek a new life.",
            "From a distance while sailing, they sighted a place and decided to dock.",
            "They found a place to have abundant nipa huts, in which they named it Taganipa, Tagnipa or Taguipa.",
            "Acusar and his small family had then established themselves through farming and fishing.",
            "A wave of migrants from Bohol later followed as well as settlers from Luzon, other parts of Visayas and neighboring areas surrounding Taganipa settled in the area following years later, establishing themselves as farmers and fisherfolks."
        ],
        [
            "El Salvador was created from the barrios of El Salvador and Molugan with their sitios known as Sala, Sambulawan, Sinaloc, Lagtang, Talaba, Kalabaylabay and Hinigdaan, formerly part of Cagayan de Misamis, Misamis Oriental, in 1948."
        ],
        [
            "Etymology"
        ],
        [
            "The municipality's name means \"the savior\" in Spanish, pertaining that Taganipa provided crops of corn and vegetables to the neighboring places struck by famine at some point in the municipality's history.",
            "Soon these places were saved by famine through continuous agricultural support from Taganipa, resulting to be renamed as El Salvador to people's approval."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "For further information, see League of Cities of the Philippines v. COMELEC."
        ],
        [
            "On June 27, 2007, the municipality of El Salvador becomes a city in the province of Misamis Oriental after ratification of Republic Act 9435."
        ],
        [
            "The Supreme Court declared the cityhood law of El Salvador and 15 other cities unconstitutional after a petition filed by the League of Cities of the Philippines in its ruling on November 18, 2008.",
            "On December 22, 2009, the cityhood law of El Salvador and 15 other municipalities regain its status as cities again after the court reversed its ruling on November 18, 2008.",
            "On August 23, 2010, the court reinstated its ruling on November 18, 2008, causing El Salvador and 15 cities to become regular municipalities.",
            "Finally, on February 15, 2011, El Salvador becomes a city again including the 15 municipalities declaring that the conversion to cityhood met all legal requirements."
        ],
        [
            "After six years of legal battle, in its board resolution, the League of Cities of the Philippines acknowledged and recognized the cityhood of El Salvador and 15 other cities."
        ],
        [
            "Geography"
        ],
        [
            "El Salvador is located in the Province of Misamis Oriental in Northern Mindanao (Region X).",
            "It is bordered by the Municipality of Alubijid to the west, Opol to the east and Manticao and Naawan to the south.",
            "On the north, lies Macajalar Bay of the Bohol Sea."
        ],
        [
            "Barangays"
        ],
        [
            "El Salvador is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "One forms the center of the city (poblacion) whereas the other 14 are in the outlying areas.",
            "Some of them are even several kilometers away from the center of the city."
        ],
        [
            "Amoros"
        ],
        [
            "Bolisong"
        ],
        [
            "Cogon"
        ],
        [
            "Himaya"
        ],
        [
            "Hinigdaan"
        ],
        [
            "Kalabaylabay"
        ],
        [
            "Molugan"
        ],
        [
            "Pedro S. Baculio (Bolo-Bolo)"
        ],
        [
            "Poblacion"
        ],
        [
            "Quibonbon"
        ],
        [
            "Sambulawan"
        ],
        [
            "San Francisco de Asis (Calongonan)"
        ],
        [
            "Sinaloc"
        ],
        [
            "Taytay"
        ],
        [
            "Ulaliman"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for El Salvador City, Misamis Oriental"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "271(10.7)"
        ],
        [
            "217(8.5)"
        ],
        [
            "193(7.6)"
        ],
        [
            "178(7.0)"
        ],
        [
            "344(13.5)"
        ],
        [
            "423(16.7)"
        ],
        [
            "362(14.3)"
        ],
        [
            "358(14.1)"
        ],
        [
            "329(13.0)"
        ],
        [
            "320(12.6)"
        ],
        [
            "322(12.7)"
        ],
        [
            "260(10.2)"
        ],
        [
            "3,577(140.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "23.2"
        ],
        [
            "19.5"
        ],
        [
            "22.0"
        ],
        [
            "22.8"
        ],
        [
            "29.6"
        ],
        [
            "28.9"
        ],
        [
            "30.3"
        ],
        [
            "29.8"
        ],
        [
            "28.1"
        ],
        [
            "28.8"
        ],
        [
            "26.1"
        ],
        [
            "24.1"
        ],
        [
            "313.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of El SalvadorYearPop.±% p.a.1903 4,315—    1948 16,899+3.08%1960 10,521−3.87%1970 14,529+3.28%1975 16,915+3.10%1980 20,446+3.86%1990 26,721+2.71%1995 31,500+3.13%2000 34,650+2.06%2007 41,905+2.66%2010 44,848+2.50%2015 50,204+2.17%2020 58,771+3.15%Source: Philippine Statistics Authority"
        ],
        [
            "Ethnicities and Religion"
        ],
        [
            "Local inhabitants of El Salvador, known as Salvadoreños/Salvadoreñas (also spelled Salbadorenyos/Salbadorenyas) or Tagnipan-ons, consists of Visayans who are the descendants of Christian migrants mostly from Bohol and Cebu; the indigenous Higaonons who first settled in the area; and the descendants of other Christian settlers from Ilocandia, Cagayan Valley, Cordillera Administrative Region, Central Luzon, Calabarzon, Marinduque, Mindoro, Bicolandia in Luzon and Panay and Negros Occidental in Visayas."
        ],
        [
            "Majority of Tagnipan-ons are Roman Catholic Christians, represented by about 85%, including charismatics.",
            "The rest belongs to other Christian denominations such as Evangelical churches, Baptists, Seventh-Day Adventist church, Iglesia Filipina Independiente (Aglipayan church), Members Church of God International/Ang Dating Daan (MCGI, ADD), Iglesia ni Cristo, Pentecostal church and Presbyterian church."
        ],
        [
            "Language"
        ],
        [
            "Cebuano is the main language of El Salvador spoken by the majority, though Higaonon is the native language spoken by eponymous Higaonons who are indigenous inhabitants of El Salvador and the rest of Misamis Oriental.",
            "The city has also sizeable speakers of Bohol dialect of Cebuano.",
            "Tagalog/Filipino and English are also spoken and used for business, government affairs and in local academe.",
            "Other languages spoken in El Salvador are Subanon, Hiligaynon, Ilocano and Kapampangan."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of El Salvador"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  45.10"
        ],
        [
            "2009  38.83"
        ],
        [
            "2012  23.69"
        ],
        [
            "2015  27.06"
        ],
        [
            "2018  13.33"
        ],
        [
            "2021  23.50"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "El Salvador hosts several companies, plants and factories west of Misamis Oriental.",
            "These are Asia Brewery, Tanduay Rhum, Virgin Cola Bottling Plant (Visayas and Mindanao region distributor), Highland Fresh Daily Products, Monark Equipment, Zest-O, WL Foods Corporation and Universal Robina Corporation."
        ],
        [
            "With regards to financial institutions, Rural Bank of El Salvador and lending institutions such as FICCO, Oro Coop, M Lhuillier and others are accessible at office hours in this place."
        ],
        [
            "Attractions"
        ],
        [
            "Divine Mercy Shrine, located in the Divine Mercy Hills, PSB-Ulaliman which is overlooking Macajalar Bay.",
            "The shrine has a 50-foot statue of the Divine Mercy Christ, the biggest in Asia.",
            "It serves as a pilgrimage site for the Divine Mercy devotees.",
            "As a pilgrimage and sacred site, visitors are not allowed to wear shorts and other revealing clothing.",
            "Those who do so will be forced to cover themselves with a blue cloth provided by the shrine administrators."
        ],
        [
            "Burias Island, located just a few kilometers off the coast of Molugan or about 3 km west of the town of Opol.",
            "Not to be confused with the island of the same name, located northeast of Masbate in Bicol Region."
        ],
        [
            "El Salvador Night Café and Market, is set up on Friday nights at Barangay Poblacion.",
            "Tagnipa-ons and visitors gather to have barbecue, enjoy the live band music, beer, and also the great bargains from the nearby Night Market"
        ],
        [
            "Our Lady of Snows Parish Church, newly constructed church located within the city."
        ],
        [
            "Abaga & Sikiop Falls, Located in barangay San Francisco de Asis."
        ],
        [
            "Tag-ilas Falls, Located in barangay Hinigdaan."
        ],
        [
            "Tuburan Spring, Located in barangay Poblacion ."
        ],
        [
            "House of Pasalubong, Located in Zone 2, Barangay Poblacion"
        ],
        [
            "Mindanao PAGASA Regional Division (MPRSD) compound, located in Barangay Molugan and home to the first and only planetarium in Mindanao operated by PAGASA."
        ],
        [
            "Culture"
        ],
        [
            "Feast day:"
        ],
        [
            "August 5 (Our Lady of Snows)"
        ],
        [
            "August 16 (Saint Roch (aka San Roque))"
        ],
        [
            "Charter day: June 27"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "El Salvador city can be reached via plane through Laguindingan Airport, then about less than 10 minutes bus ride east.",
            "Like any other place the national highway snakes through it.",
            "Visitors and locals can go around the city by just hailing a \"sikad-sikad\" or motorboat, \"jeepneys\" or motorcycles to the outlying barangays."
        ],
        [
            "Communication"
        ],
        [
            "PLDT and MISORTEL are among the major phone lines, also transmitters or \"cell sites\" for all major \"telecom\" providers like Globe, Smart and Dito are serviceable in this city.",
            "Internet access is also available.",
            "Internet cafes can be found in various places in within the city.",
            "Broadband service is also available."
        ],
        [
            "References"
        ],
        [
            "^  City of El Salvador |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"An act creating the municipality of El Salvador, province of Misamis Oriental\".",
            "LawPH.com.",
            "Archived from the original on July 10, 2012.",
            "Retrieved April 8, 2011."
        ],
        [
            "^"
        ],
        [
            "\"El Salvador: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved April 29, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Misamis Oriental\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Mindanao's first and only planetarium opens in Misamis Oriental\".",
            "Rappler.",
            "May 20, 2024.",
            "Retrieved May 20, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to El Salvador, Misamis Oriental."
        ],
        [
            "Official website of the City Government of El Salvador"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived March 3, 2016, at the Wayback Machine"
        ],
        [
            "Places adjacent to El Salvador, Misamis Oriental"
        ],
        [
            "Macajalar Bay"
        ],
        [
            "Alubijid"
        ],
        [
            "El Salvador"
        ],
        [
            "Opol"
        ],
        [
            "Naawan"
        ],
        [
            "Manticao"
        ],
        [
            "Articles Related to El Salvador, Misamis Oriental"
        ],
        [
            "vte Province of Misamis OrientalCagayan de Oro (capital and largest city)Municipalities"
        ],
        [
            "Alubijid"
        ],
        [
            "Balingasag"
        ],
        [
            "Balingoan"
        ],
        [
            "Binuangan"
        ],
        [
            "Claveria"
        ],
        [
            "Gitagum"
        ],
        [
            "Initao"
        ],
        [
            "Jasaan"
        ],
        [
            "Kinoguitan"
        ],
        [
            "Lagonglong"
        ],
        [
            "Laguindingan"
        ],
        [
            "Libertad"
        ],
        [
            "Lugait"
        ],
        [
            "Magsaysay"
        ],
        [
            "Manticao"
        ],
        [
            "Medina"
        ],
        [
            "Naawan"
        ],
        [
            "Opol"
        ],
        [
            "Salay"
        ],
        [
            "Sugbongcogon"
        ],
        [
            "Tagoloan"
        ],
        [
            "Talisayan"
        ],
        [
            "Villanueva"
        ],
        [
            "Component cities"
        ],
        [
            "El Salvador"
        ],
        [
            "Gingoog"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Cagayan de Oro (Administratively independent from the province but grouped under Misamis Oriental by the Philippine Statistics Authority.)"
        ],
        [
            "vteNorthern Mindanao (Region X)Regional center"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Provinces"
        ],
        [
            "Bukidnon"
        ],
        [
            "Camiguin"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Iligan"
        ],
        [
            "Component cities"
        ],
        [
            "El Salvador"
        ],
        [
            "Gingoog"
        ],
        [
            "Malaybalay"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Tangub"
        ],
        [
            "Valencia"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Malaybalay"
        ],
        [
            "Mambajao"
        ],
        [
            "Oroquieta"
        ],
        [
            "Tubod"
        ],
        [
            "Municipalities"
        ],
        [
            "Aloran"
        ],
        [
            "Alubijid"
        ],
        [
            "Bacolod"
        ],
        [
            "Baliangao"
        ],
        [
            "Balingasag"
        ],
        [
            "Balingoan"
        ],
        [
            "Baloi"
        ],
        [
            "Baroy"
        ],
        [
            "Baungon"
        ],
        [
            "Binuangan"
        ],
        [
            "Bonifacio"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Calamba"
        ],
        [
            "Catarman"
        ],
        [
            "Clarin"
        ],
        [
            "Claveria"
        ],
        [
            "Concepcion"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Don Victoriano Chiongbian"
        ],
        [
            "Gitagum"
        ],
        [
            "Guinsiliban"
        ],
        [
            "Impasugong"
        ],
        [
            "Initao"
        ],
        [
            "Jasaan"
        ],
        [
            "Jimenez"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kapatagan"
        ],
        [
            "Kauswagan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kinoguitan"
        ],
        [
            "Kitaotao"
        ],
        [
            "Kolambugan"
        ],
        [
            "Lagonglong"
        ],
        [
            "Laguindingan"
        ],
        [
            "Lala"
        ],
        [
            "Lantapan"
        ],
        [
            "Libertad"
        ],
        [
            "Libona"
        ],
        [
            "Linamon"
        ],
        [
            "Lopez Jaena"
        ],
        [
            "Lugait"
        ],
        [
            "Magsaysay (Lanao del Norte)"
        ],
        [
            "Magsaysay (Misamis Oriental)"
        ],
        [
            "Mahinog"
        ],
        [
            "Maigo"
        ],
        [
            "Malitbog"
        ],
        [
            "Mambajao"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Manticao"
        ],
        [
            "Maramag"
        ],
        [
            "Matungao"
        ],
        [
            "Medina"
        ],
        [
            "Munai"
        ],
        [
            "Naawan"
        ],
        [
            "Nunungan"
        ],
        [
            "Opol"
        ],
        [
            "Panaon"
        ],
        [
            "Pangantucan"
        ],
        [
            "Pantao Ragat"
        ],
        [
            "Pantar"
        ],
        [
            "Plaridel"
        ],
        [
            "Poona Piagapo"
        ],
        [
            "Quezon"
        ],
        [
            "Sagay"
        ],
        [
            "Salay"
        ],
        [
            "Salvador"
        ],
        [
            "San Fernando"
        ],
        [
            "Sapad"
        ],
        [
            "Sapang Dalaga"
        ],
        [
            "Sinacaban"
        ],
        [
            "Sugbongcogon"
        ],
        [
            "Sultan Naga Dimaporo"
        ],
        [
            "Sumilao"
        ],
        [
            "Tagoloan (Lanao del Norte)"
        ],
        [
            "Tagoloan (Misamis Oriental)"
        ],
        [
            "Talakag"
        ],
        [
            "Talisayan"
        ],
        [
            "Tangcal"
        ],
        [
            "Tubod"
        ],
        [
            "Tudela"
        ],
        [
            "Villanueva"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=El_Salvador,_Misamis_Oriental&oldid=1224758253\""
        ],
        [
            "Categories: Cities in Misamis OrientalPopulated places established in 19481948 establishments in the PhilippinesCatholic pilgrimage sitesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse mdy dates from July 2022Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using infobox settlement with possible demonym listArticles containing Cebuano-language textArticles containing Filipino-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}