{
    "name": "Enrile",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Enrile, Cagayan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°33′44″N 121°42′04″E﻿ / ﻿17.5622°N 121.7011°E﻿ / 17.5622; 121.7011"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cagayan, Philippines"
        ],
        [
            "This article is about a municipality in the Philippines.",
            "For the Filipino politician, see Juan Ponce Enrile."
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesEnrileMunicipalityMunicipality of EnrileMunicipal Hall of Enrile"
        ],
        [
            "FlagSealNickname: Peanut Capital of the PhilippinesMotto(s): Awan Na Matalan, Awan Nga KalippananMap of Cagayan with Enrile highlightedOpenStreetMapEnrileLocation within the PhilippinesCoordinates: 17°33′44″N 121°42′04″E﻿ / ﻿17.5622°N 121.7011°E﻿ / 17.5622; 121.7011CountryPhilippinesRegionCagayan ValleyProvinceCagayanDistrict"
        ],
        [
            "3rd districtNamed forPasqual Enrile y AlcedoBarangays22"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMiguel B. Decena Jr. • Vice MayorChristina G. Magbitang • RepresentativeJoseph \"Jojo\" L. Lara • Sangguniang Panlalawigan"
        ],
        [
            "List"
        ],
        [
            "• Atty.",
            "Mila Perpetua Catabay-Lauigan• Perla Tumaliuan• Pastor Rosauro Rodrigo Resuello• Rodrigo De Asis"
        ],
        [
            " • Electorate23,072 voters (2022)AreaService provider • ElectricityCagayan 1 Electric Cooperative (CAGELCO 1)Time zoneUTC+8 (PST)ZIP code3501PSGC021512000IDD : area code +63 (0)78Native languagesIbanag Ilocano TagalogLent CulturePadafungMajor religionsRoman CatholicCatholic dioceseDiocese of TuguegaraoPatron saintOur Lady of SnowsFestivalPeanut Festival (Mappalabbet)"
        ],
        [
            "Enrile, officially the Municipality of Enrile (Itawis: Babalay yo Enrile; Ibanag: Ili nat Enrile; Ilocano: Ili ti Enrile; Tagalog: Bayan ng Enrile),  is a 3rd class municipality in the province of Cagayan, Philippines.",
            "According to the 2020 census, it has a population of 36,705 people."
        ],
        [
            "Enrile lies on the southernmost part of Cagayan, bounded by Sta.",
            "Maria, Isabela to the south, by the mighty Cagayan River  to the east, by Solana and Tuguegarao to the north, and Rizal, Kalinga to the west."
        ],
        [
            "The town is predominantly an agricultural town where the majority of its population derive their income from farming.",
            "It has a land area of 18,451.3 hectares unevenly distributed to the 22-barangays of the municipality.",
            "Its main products are rice, corn, peanut, tobacco and vegetables."
        ],
        [
            "Its citizens are called Itawes because they speak the Itawis dialect (locally called Itawit).",
            "Ilocanos and Tagalogs have settled at the western barangays and have blended very well in the mainstream of Itawes life."
        ],
        [
            "Etymology"
        ],
        [
            "The municipality was named after Spanish Governor-General Pasqual Enrile y Alcedo.",
            "Cabug was the original name of Enrile when it was a barrio of Tuguegarao.",
            "It was established as a separate town in September 1849 and named in honor of the Spanish Governor General Pascual Enrile during the Spanish regime."
        ],
        [
            "History"
        ],
        [
            "The History of Enrile dates as early as 1690.",
            "According to Father Juan Paguere, it was just a wide and long stretch of virgin land located at the southernmost end of the province of Cagayan.",
            "In 1718, the colonial government ordered the place to become one of the barrios of Tuguegarao.",
            "It was named \"Cabugag\" or in short Cabug, the dialect term for hunchback for the first settler was a man with this deformity.",
            "So the place was named after him.",
            "The name \"Cabug\" is engraved on the town's first church bell which is still found in the steeple."
        ],
        [
            "In 1724, the Dominican Friars thought of giving the barrios their Patron Saint.",
            "Cabug was given \"Nuestra Señora de las Caldas\".",
            "The prominent residents of the barrio had chosen the sixth day of August as her feast day.",
            "As years went by, the land area and population of the barrio increased with surprising figures.",
            "The Cagayan River which flowed close to the barrio site gradually changed its course and moved towards Cataggaman as flood plains were formed.",
            "The non-Christian inhabitants called Kalingas gradually deserted the barrio and migrated westward to the Mountain Province.",
            "As a result, more agricultural lands were cleared and cultivated.",
            "Tobacco and corn were the chief crops of the people."
        ],
        [
            "In September 1849, the colonial government ordered the separation of Cabug from the Municipality of Tuguegarao to become a town by itself.",
            "The new town was named Enrile in honor of Governor Pascual Enrile who was responsible for building roads in the northern part of Luzon during those days.",
            "The separation of Enrile from Tuguegarao led to a change of its patron saint.",
            "The population unanimously adopted \"Nuestra Señora de las Nieves\" as its patron Saint.",
            "The fifth day of August was chosen as her feast day."
        ],
        [
            "Sinupac, a hinterland of Enrile, was the hiding place of Emilio Aguinaldo and his revolutionary forces while evading pursuit from American forces during the First Philippine Republic.",
            "The locals prepared feasts for the president during his refuge."
        ],
        [
            "Geography"
        ],
        [
            "Enrile lies on the southernmost part of Cagayan, bounded by Sta.",
            "Maria, Isabela to the south, by the mighty Cagayan River to the east, by Solana and Tuguegarao City to the north and by the province of Kalinga to the west."
        ],
        [
            "Barangays"
        ],
        [
            "Enrile is politically subdivided into 22 barangays.",
            "Each barangay consists of puroks.",
            "(Some areas are still referred to their old names as sitios.)"
        ],
        [
            "Alibago"
        ],
        [
            "Barangay II"
        ],
        [
            "Barangay IV"
        ],
        [
            "Batu"
        ],
        [
            "Divisoria"
        ],
        [
            "Inga"
        ],
        [
            "Lanna"
        ],
        [
            "Lemu Norte"
        ],
        [
            "Lemu Sur"
        ],
        [
            "Liwan Norte"
        ],
        [
            "Liwan Sur"
        ],
        [
            "Maddarulug Norte"
        ],
        [
            "Maddarulug Sur"
        ],
        [
            "Magalalag East"
        ],
        [
            "Magalalag West (San Nicolas)"
        ],
        [
            "Marracuru"
        ],
        [
            "Roma Norte"
        ],
        [
            "Roma Sur"
        ],
        [
            "San Antonio"
        ],
        [
            "San Jose (Barangay III-A)"
        ],
        [
            "San Roque (Barangay III-B)"
        ],
        [
            "Villa Maria (Barangay I)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Enrile, Cagayan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "25(77)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "155(6.1)"
        ],
        [
            "113(4.4)"
        ],
        [
            "89(3.5)"
        ],
        [
            "58(2.3)"
        ],
        [
            "127(5.0)"
        ],
        [
            "131(5.2)"
        ],
        [
            "154(6.1)"
        ],
        [
            "184(7.2)"
        ],
        [
            "151(5.9)"
        ],
        [
            "247(9.7)"
        ],
        [
            "221(8.7)"
        ],
        [
            "292(11.5)"
        ],
        [
            "1,922(75.6)"
        ],
        [
            "Average rainy days"
        ],
        [
            "19.6"
        ],
        [
            "14.8"
        ],
        [
            "13.4"
        ],
        [
            "12"
        ],
        [
            "19.4"
        ],
        [
            "19.8"
        ],
        [
            "23"
        ],
        [
            "25"
        ],
        [
            "23"
        ],
        [
            "19.4"
        ],
        [
            "19.1"
        ],
        [
            "21.6"
        ],
        [
            "230.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Land Area"
        ],
        [
            "Enrile has a land area of 18,451.3 hectares unevenly distributed to the 22 barangays of the municipality and predominantly agricultural where the majority of its inhabitants derive their income from farming."
        ],
        [
            "Topography"
        ],
        [
            "Enrile is bounded by hills and mountains on both North and West.",
            "Area with low elevation is about 20 meters above sea level at the Eastern part which lies close to the river boundaries.",
            "The highest elevation is found Northwest which is approximately 800 meters above sea level."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of EnrileYearPop.±% p.a.1903 5,999—    1918 7,237+1.26%1939 9,506+1.31%1948 11,130+1.77%1960 16,095+3.12%1970 19,431+1.90%1975 20,957+1.53%1980 23,403+2.23%YearPop.±% p.a.1990 25,608+0.90%1995 28,736+2.18%2000 29,062+0.24%2007 29,719+0.31%2010 32,553+3.37%2015 35,834+1.85%2020 36,705+0.47%Source: Philippine Statistics Authority with a density of 200 inhabitants per square kilometre or 520 inhabitants per square mile."
        ],
        [
            "Enrile's citizens are called Itawes because they speak the Itawis language.",
            "Ilocanos and Tagalogs have settled at the western barangays and have blended very well in the mainstream of Itawes life."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Enrile"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  24.80"
        ],
        [
            "2009  19.76"
        ],
        [
            "2012  19.69"
        ],
        [
            "2015  12.60"
        ],
        [
            "2018  10.21"
        ],
        [
            "2021  11.12"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Enrile is predominantly an agricultural town where the majority of its population derive their income from farming.",
            "It has a land area of 18,451.3 hectares unevenly distributed to the 22-barangays of the municipality.",
            "Its main products are rice, corn, peanut, tobacco and vegetables."
        ],
        [
            "Peanut Production"
        ],
        [
            "The Department of Agriculture (DA) has declared the town of Enrile in Cagayan as the \"peanut capital of the Philippines\" for its \"noteworthy contribution\" to the development of the local peanut industry, with experts citing the soil suitability of the town – sandy to sandy-loam – and its unique ability to produce peanut year-round.",
            "One estimate of the town's production places a volume of 1,800 metric tons per year or 8 to 10 percent of the national supply."
        ],
        [
            "Enrile is home to 800 peanut farmers cultivating 700 hectares of farmlands with a potential expansion area of another 800 hectares.",
            "\"With improved production and yield, Enrile may be able to fill up a portion, if not all, of the import requirement for peanut of 15,060 metric tons,\" Alviar added."
        ],
        [
            "Local Business"
        ],
        [
            "Agro - Trade Fair located at the side of Municipal Hall."
        ],
        [
            "Kimikarlai - Turingan Sports Center and Airconditioned Cockpit Arena (Bunagan St.)"
        ],
        [
            "Kimikarlai Construction Supply and Services (Santiago - Tuguegarao Road)"
        ],
        [
            "Kimikarlai Gamefarm (Bunagan St.)"
        ],
        [
            "Kimikarlai Hardware and Construction Services (Brgy.",
            "Villa Maria)"
        ],
        [
            "Lai Gasoline Station (Brgy.",
            "Villa Maria)"
        ],
        [
            "Lai Gasoline Station (Santiago - Tuguegarao Road)"
        ],
        [
            "Lai Grains and Palay Gasoline Station (Bunagan St.)"
        ],
        [
            "M.B.",
            "Decena Jr. Livestock"
        ],
        [
            "Transportation"
        ],
        [
            "Passenger jeepneys, tricycles and other private transportation vehicles service all routes within and outside Enrile.",
            "Kalesa is also driven within the Poblacion and some barangays only."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Enrile, belonging to the third legislative district of the province of Cagayan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Joseph L. Lara"
        ],
        [
            "Governor"
        ],
        [
            "Manuel N. Mamba"
        ],
        [
            "Mayor"
        ],
        [
            "Miguel B. Decena, Jr."
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Christina G. Magbitang"
        ],
        [
            "Councilors"
        ],
        [
            "Jay Ann O. Aguirre"
        ],
        [
            "Maria Rosabell R. Herrera"
        ],
        [
            "Jacinto T. Tuddao"
        ],
        [
            "Peter B. Decena"
        ],
        [
            "Romeo B. Battung"
        ],
        [
            "Sergio B. Turingan"
        ],
        [
            "Agapita C. Macarubbo"
        ],
        [
            "Juan B. Carag, Jr."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Joseph L. Lara"
        ],
        [
            "Governor"
        ],
        [
            "Manuel N. Mamba"
        ],
        [
            "Mayor"
        ],
        [
            "Miguel B. Decena Jr."
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Expedito C. Taguibao"
        ],
        [
            "Councilors"
        ],
        [
            "Christina G. Magbitang"
        ],
        [
            "Romeo B. Battung"
        ],
        [
            "Maria Rosabell R. Herrera"
        ],
        [
            "Juan B. Carag Jr."
        ],
        [
            "Sergio B. Turingan"
        ],
        [
            "Joseph M. Amistad"
        ],
        [
            "Jacinto T. Tuddao"
        ],
        [
            "Mercuria T. Gaffud"
        ],
        [
            "Local chief executives"
        ],
        [
            "Gobernadorcillos"
        ],
        [
            "A. Spanish Regime – 1849 to 1896"
        ],
        [
            "Don Vicente Bunagan"
        ],
        [
            "Don Marcelo Guzman"
        ],
        [
            "Don Martin Fortunato"
        ],
        [
            "Don Lorenzo de los Reyes"
        ],
        [
            "Don Pio Cepeda"
        ],
        [
            "Don Mariano Guzman"
        ],
        [
            "Don Carlos Argonza"
        ],
        [
            "Don Agapito Lappay"
        ],
        [
            "Don Pedro Bunagan"
        ],
        [
            "Don Vicente Carag"
        ],
        [
            "Don Patricio Gacutan"
        ],
        [
            "Don Cayatano Fortunato"
        ],
        [
            "Municipal Captain"
        ],
        [
            "1.",
            "Don Cornelio Bunagan – 1896 – 1898"
        ],
        [
            "Municipal Mayors"
        ],
        [
            "Vicente Babaran         1900-1902"
        ],
        [
            "Tomas Carag               1902-1903"
        ],
        [
            "Matias Bunagan         1903-1904"
        ],
        [
            "Agapito Guzman         1904-1906"
        ],
        [
            "Cipriano Pagulayan           1906-1909"
        ],
        [
            "Vicente Babaran              1909-1913"
        ],
        [
            "Nicolas Pauig                1913-1917"
        ],
        [
            "Generoso Palattao             1917-1920"
        ],
        [
            "Pedro Cumigad                   1920-1924"
        ],
        [
            "Jacinto Camacam               1924-1926"
        ],
        [
            "Francisco Turingan           1926-1931"
        ],
        [
            "Joaquin Accad                     1931-1935"
        ],
        [
            "Felix Babaran                     1935-1943"
        ],
        [
            "Rufino Luyun                       1943-1945(Japanese Regime)"
        ],
        [
            "Agustin Palattao                 March 1945 to June 30, 1945 (Military)"
        ],
        [
            "Anastacio Luyun                 1945-1946 (Appointed)"
        ],
        [
            "Jose Babaran                     1947-1951"
        ],
        [
            "Gorgonio Manauis             January 1, 1952, to March 27, 1952"
        ],
        [
            "Benigno Carag                   Serving the rest of the term of Mayor Manauis (deceased), he being the elected Vice Mayor."
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Cagayan governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "References"
        ],
        [
            "^ \"Area of Coverage\".",
            "ATI in Cagayan Valley.",
            "Archived from the original on December 23, 2021.",
            "Retrieved December 23, 2021."
        ],
        [
            "^  Municipality of Enrile |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Commission on Audit Report - Cagayan\".",
            "coa.gov.ph.",
            "Commission on Audit.",
            "Retrieved May 24, 2021."
        ],
        [
            "^ \"Commission on Audit Report - Cagayan (Enrile)\".",
            "coa.gov.ph.",
            "Commission on Audit.",
            "Retrieved May 24, 2021."
        ],
        [
            "^ \"Commission on Audit Report - Cagayan (Enrile)\".",
            "Commission on Audit.",
            "Retrieved May 24, 2021."
        ],
        [
            "^ \"COA Report - Enrile, Cagayan\".",
            "coa.gov.ph.",
            "Commission on Audit.",
            "Retrieved May 24, 2021."
        ],
        [
            "^ \"COA Report - Enrile, Cagayan\".",
            "Retrieved May 24, 2021."
        ],
        [
            "^ \"COA Report - Enrile, Cagayan\".",
            "Retrieved May 24, 2021."
        ],
        [
            "^"
        ],
        [
            "\"Enrile, Cagayan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved November 3, 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cagayan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"2022 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 10, 2022."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 10, 2022."
        ],
        [
            "^ \"History of DepED SDO Cagayan\".",
            "DepED SDO Cagayan | Official Website of DepED SDO Cagayan.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Enrile, Cagayan"
        ],
        [
            "Solana / TuguegaraoCagayan River"
        ],
        [
            "Solana"
        ],
        [
            "Enrile"
        ],
        [
            "Cagayan River / Tuguegarao"
        ],
        [
            "Rizal, Kalinga"
        ],
        [
            "Santa Maria, Isabela"
        ],
        [
            "vte Province of CagayanTuguegarao (capital and largest city)Municipalities"
        ],
        [
            "Abulug"
        ],
        [
            "Alcala"
        ],
        [
            "Allacapan"
        ],
        [
            "Amulung"
        ],
        [
            "Aparri"
        ],
        [
            "Baggao"
        ],
        [
            "Ballesteros"
        ],
        [
            "Buguey"
        ],
        [
            "Calayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "Claveria"
        ],
        [
            "Enrile"
        ],
        [
            "Gattaran"
        ],
        [
            "Gonzaga"
        ],
        [
            "Iguig"
        ],
        [
            "Lal-lo"
        ],
        [
            "Lasam"
        ],
        [
            "Pamplona"
        ],
        [
            "Peñablanca"
        ],
        [
            "Piat"
        ],
        [
            "Rizal"
        ],
        [
            "Sanchez Mira"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Solana"
        ],
        [
            "Tuao"
        ],
        [
            "Component city"
        ],
        [
            "Tuguegarao"
        ],
        [
            "BarangaysSee: List of barangays in Cagayan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Enrile,_Cagayan&oldid=1233853748\""
        ],
        [
            "Categories: Municipalities of CagayanPopulated places on the Rio Grande de CagayanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Pages using infobox settlement with possible motto listCoordinates on WikidataArticles containing Ibanag-language textArticles containing Ilocano-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}