{
    "name": "Esperanza",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Esperanza, Masbate"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°44′13″N 124°02′30″E﻿ / ﻿11.7369°N 124.0417°E﻿ / 11.7369; 124.0417"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Masbate, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Esperanza, Masbate\" – news · newspapers · books · scholar · JSTOR (January 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bicol Region, PhilippinesEsperanza"
        ],
        [
            "HalabangbaybayMunicipalityMunicipality of EsperanzaGawas Beach"
        ],
        [
            "FlagMap of Masbate with Esperanza highlightedOpenStreetMapEsperanzaLocation within the PhilippinesCoordinates: 11°44′13″N 124°02′30″E﻿ / ﻿11.7369°N 124.0417°E﻿ / 11.7369; 124.0417CountryPhilippinesRegionBicol RegionProvinceMasbateDistrict"
        ],
        [
            "3rd districtFoundedMay 7, 1959Barangays20"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFernando P. Talisic • Vice MayorRodolfo P. Pepito • RepresentativeWilton T. Kho • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Cicero S. ConagMichael C. Comedia Sr.Melito M. CamonRodel D. PepitoFelix A. Ponce Jr.Raymond Ivan M. DiamosRobert D. GuizAldrin B. Jao"
        ],
        [
            " • Electorate12,747 voters (2022)Area • Revenue₱ 185.7 million (2020) • Assets₱ 339.5 million (2020) • Expenditure₱ 84.18 million (2020) • Liabilities₱ 75.23 million (2020)Service provider • ElectricityMasbate Electric Cooperative (MASELCO)Time zoneUTC+8 (PST)ZIP code5407PSGC054109000IDD : area code +63 (0)56Native languagesCebuano Masbateño Tagalog"
        ],
        [
            "Esperanza, officially the Municipality of Esperanza,  is a 5th class municipality in the province of Masbate, Philippines.",
            "According to the 2020 census, it has a population of 17,534 people."
        ],
        [
            "About 60% of the population lives along the coastline, most of whom are fishermen.",
            "It is about 4 hours travel south of Masbate City with some roads and highways still undeveloped."
        ],
        [
            "Esperanza has several beaches, among them Gamay Na Baybay Beach, Talisay (Punta) Beach and Manok Manok Beach.",
            "Esperanza is a predominantly Cebuano speaking municipality, with a majority of its settlers tracing their ancestries from northern Cebu, particularly from Bogo.",
            "Esperanza is one of the four municipalities which are predominantly Cebuano speaking in the province of Masbate."
        ],
        [
            "History"
        ],
        [
            "People in the 1970s to early 1990s were heavily dependent on the water resources in the so-called Kapayawan, which means \"deep well\".",
            "It is the only safe water source for the majority of the people living in the area.",
            "In 2000, Esperanza was finally connected to the electricity grid supplied by MASELCO which benefited 80% of the households in the area."
        ],
        [
            "In 2006, President Gloria Arroyo defined Esperanza to be the most accessible town in Masbate going to Samar, Leyte and Cebu.",
            "That is the primary reason why the National Government constructed the port to serve as a roll-on/roll-off (RORO) gateway.",
            "The RORO vessels coming from Masbate docks at the RORO Port located at Barangay Polambato, Bogo, Cebu."
        ],
        [
            "Esperanza is about Four (4) hours land travel South from Masbate City, the last municipality in the south located between Placer in north-west and Pio V Corpus in southeast and considered as among the smallest in the island.",
            "Esperanza was initially one of the barangays of the town of Placer."
        ],
        [
            "In early 1915, a group of first settlers , due to its elongated shoreline and white fine sand.",
            "Halabangbaybay at that era was a green-mountainous forest community.",
            "It was not recognized as a barrio or even a mere sitio."
        ],
        [
            "In the 1940s, Halabangbaybay became a sitio of the barrio Alegria in Cataingan.",
            "Soon after, it was converted into a barrio named Esperanza as a barangay of Placer in 1948 (the year the barrio Placer was separated from Cataingan and constituted as its own municipality) and Pablo M. Conag served as the “teniente del Barrio”.",
            "The name Esperanza means \"Hope\" in reference to the first group of migrants in 1915 who hoped for a better life by settling on the present day area of Esperanza."
        ],
        [
            "In the mid-1950s, Lawyer Alfonso E. Conag"
        ],
        [
            "On July 2, 1959, the set of municipal officials started to hold office and Santos Edem Conag, the eldest son of Felimo Serafin Conag, became the first elected mayor."
        ],
        [
            "As of August 1, 2007, Esperanza has a total population of 16,834 according to National Statistic Office data."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Esperanza is politically subdivided into 20 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "There are 11 barangays which located along the coastal line and nine in farm areas with an estimated of seventy 70% of the population belongs to the fisher folks."
        ],
        [
            "Agoho"
        ],
        [
            "Almero"
        ],
        [
            "Baras"
        ],
        [
            "Domorog"
        ],
        [
            "Guadalupe"
        ],
        [
            "Iligan"
        ],
        [
            "Labangtaytay"
        ],
        [
            "Labrador"
        ],
        [
            "Libertad"
        ],
        [
            "Magsaysay"
        ],
        [
            "Masbaranon"
        ],
        [
            "Poblacion"
        ],
        [
            "Potingbato"
        ],
        [
            "Rizal"
        ],
        [
            "San Roque"
        ],
        [
            "Santiago"
        ],
        [
            "Sorosimbajan"
        ],
        [
            "Tawad"
        ],
        [
            "Tunga"
        ],
        [
            "Villa"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Esperanza, Masbate"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "39(1.5)"
        ],
        [
            "34(1.3)"
        ],
        [
            "42(1.7)"
        ],
        [
            "36(1.4)"
        ],
        [
            "73(2.9)"
        ],
        [
            "109(4.3)"
        ],
        [
            "118(4.6)"
        ],
        [
            "108(4.3)"
        ],
        [
            "129(5.1)"
        ],
        [
            "136(5.4)"
        ],
        [
            "112(4.4)"
        ],
        [
            "89(3.5)"
        ],
        [
            "1,025(40.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.6"
        ],
        [
            "9.7"
        ],
        [
            "12.0"
        ],
        [
            "13.0"
        ],
        [
            "20.5"
        ],
        [
            "25.3"
        ],
        [
            "26.2"
        ],
        [
            "24.8"
        ],
        [
            "25.2"
        ],
        [
            "25.9"
        ],
        [
            "21.9"
        ],
        [
            "17.9"
        ],
        [
            "235"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Weather in Esperanza is generally divided into two seasonal weather patterns known locally as the Amihan and Habagat seasons.",
            "In the Tagalog language, Amihan means a cool north-east wind, and Habagat means west or south-west wind; south-west monsoon.",
            "Amihan and Habagat seasons are generally associated respectively with the El Niño and La Niña global weather patterns.",
            "The Amihan season is characterized by moderate temperatures, little or no rainfall, and a prevailing wind from the east.",
            "The Habagat season is characterized by hot and humid weather, frequent heavy rainfall, and a prevailing wind from the west."
        ],
        [
            "On Esperanza, the main indicator of the switch between the Amihan and Habagat seasonal patterns is the switch in wind direction.",
            "In most years this transition is abrupt and occurs overnight.",
            "In some years there is a period of perhaps a week or two where the wind will switch between Amihan and Habagat patterns several times before settling into the pattern for the new season.",
            "As a rule of thumb, Labangtatay will be in the Habagat weather pattern from sometime in September or October to sometime in May or June and in the Amihan weather pattern for the remainder of the year.",
            "These dates can vary in individual years, though."
        ],
        [
            "Daytime temperatures on Esperanza generally range from 77 to 90 °F (25-32 °C) from the beginning of the Amihan season into February or March, increase to the 82-100 °F (28-38 °C) range until the onset of the Habagat season, and moderate back to the 77-90 °F (25-32 °C) range with the return of the Amihan season.",
            "During Tropical Storm periods, temperatures can fall below 68 °F (20 °C).",
            "Tropical Storms can impact Esperanza at any time of year, but are most likely to be seen during the Habagat season."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of EsperanzaYearPop.±% p.a.1960 10,671—    1970 11,513+0.76%1975 12,427+1.54%1980 14,191+2.69%1990 14,674+0.34%1995 17,023+2.82%YearPop.±% p.a.2000 16,209−1.04%2007 16,834+0.52%2010 17,357+1.12%2015 18,568+1.29%2020 17,534−1.12%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Esperanza, Masbate, was 17,534 people, with a density of 260 inhabitants per square kilometre or 670 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Esperanza"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  49.90"
        ],
        [
            "2009  45.50"
        ],
        [
            "2012  44.24"
        ],
        [
            "2015  48.20"
        ],
        [
            "2018  31.68"
        ],
        [
            "2021  25.72"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Transportation"
        ],
        [
            "Esperanza beach"
        ],
        [
            "In Esperanza, the two main modes of transport are via motor-tricycles along the main road or by walking along the beaches.",
            "Pedicabs are also available for transport along the beachfront path.",
            "Other means of transportation include mountain bikes, quad bikes, and motorbikes, all of which can be rented."
        ],
        [
            "To explore around the island's coast, motorized bancas and sailing paraws are available for rent.",
            "These are outrigger canoes and are a common sight in waters around the island.",
            "The sailing paraw is a narrow hulled boat with outriggers on either side and with passengers sometimes seated on a trampoline platform between the outrigger supports.",
            "These are extremely fast off the wind but can be unwieldy for inexperienced sailors."
        ],
        [
            "References"
        ],
        [
            "^ \"Executive Order No.",
            "337, s. 1959 | GOVPH\".",
            "7 May 1959.",
            "Archived from the original on 11 May 2021.",
            "Retrieved 16 October 2019."
        ],
        [
            "^  Municipality of Esperanza |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "337, s. 1959 | GOVPH\".",
            "7 May 1959.",
            "Archived from the original on 11 May 2021.",
            "Retrieved 16 October 2019."
        ],
        [
            "^"
        ],
        [
            "\"Province: Masbate\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Esperanza: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 23 June 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Masbate\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Esperanza, Masbate."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-12-21 at archive.today"
        ],
        [
            "Places adjacent to Esperanza, Masbate"
        ],
        [
            "Placer"
        ],
        [
            "Cataingan"
        ],
        [
            "Pio V. Corpuz"
        ],
        [
            "Esperanza"
        ],
        [
            "Visayan Sea"
        ],
        [
            "Visayan Sea"
        ],
        [
            "vte Province of MasbateMasbate City (capital and largest city)Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Batuan"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Dimasalang"
        ],
        [
            "Esperanza"
        ],
        [
            "Mandaon"
        ],
        [
            "Milagros"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Palanas"
        ],
        [
            "Pio V. Corpus"
        ],
        [
            "Placer"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Pascual"
        ],
        [
            "Uson"
        ],
        [
            "Component city"
        ],
        [
            "Masbate City"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Esperanza,_Masbate&oldid=1222940633\""
        ],
        [
            "Categories: Municipalities of MasbatePolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataCommons category link from WikidataWebarchive template archiveis linksPages using the Kartographer extension"
        ]
    ]
}