{
    "name": "Gamu",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Gamu"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°03′N 121°50′E﻿ / ﻿17.05°N 121.83°E﻿ / 17.05; 121.83"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "For the Japanese footballer, see Gamu Tasaka."
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesGamuMunicipalityMunicipality of GamuSanta Rosa de Lima Church"
        ],
        [
            "FlagSealNickname(s): Gateway to Mallig Plains  Mother Town of the 2nd District  Oldest Town of Mallig PlainsMap of Isabela with Gamu highlightedOpenStreetMapGamuLocation within the PhilippinesCoordinates: 17°03′N 121°50′E﻿ / ﻿17.05°N 121.83°E﻿ / 17.05; 121.83CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "2nd districtFoundedDecember 5, 1741Barangays16"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 139.2 million (2020) • Assets₱ 249.3 million (2020) • Expenditure₱ 121.9 million (2020) • Liabilities₱ 72.33 million (2020)Service provider • ElectricityIsabela 2 Electric Cooperative (ISELCO 2)Time zoneUTC+8 (PST)ZIP code3301PSGC023113000IDD : area code +63 (0)78Native languagesIbanag Ilocano TagalogWebsitewww.gamu-isabela.gov.ph"
        ],
        [
            "Gamu"
        ],
        [
            "Etymology"
        ],
        [
            "The name Gamu or gamu-t in ancient texts refers to the roots of tall grasses, akin to those of cogon grass, deeply embedded in the soil.",
            "Gamu was originally called 'Gamut', likely from a local plant whose roots were made into a type of medicine ('gamot').",
            "From Fr.",
            "Jose Bugarin's Ibanag dictionary as follows:"
        ],
        [
            "\"Gamu-t, root or stump  a town whose patroness is St. Rosa de Lima, under of the province of Cagayan until the year 1839, when the province of Nueva Vizcaya was established, and was added to it.\""
        ],
        [
            "History"
        ],
        [
            "Gamu was founded in December 5, 1741 as a result of the merging of the towns of Batavag (near present-day Lullutan in Ilagan) and Itugod (now barangay Lenzon).",
            "The town was established on its present site as a compromise for residents of the two towns and also the fact that both towns were too few in population to survive on their own.",
            "The population problem was later partially resolved through the forced settlement of conquered tribes into the town by the Spanish."
        ],
        [
            "Originally part of the Cagayan Valley, Gamu was later annexed to Nueva Vizcaya when the province was established on May 24, 1856.",
            "Subsequently, on March 31, 1859, it became part of Isabela with the subdivision of Cagayan Valley and the creation of the Province of Isabela."
        ],
        [
            "San Gabriel de Batauag, the first mission to Christianize the area, was established by Dominican missionaries in 1612, led by Father Luis Flores and his assistant, Fr.",
            "Juan de Sta Ana.",
            "The mission was initially situated in Batauag, now known as Lulutan, a barrio in Ilagan.",
            "However, due to grievances and maltreatment by the Spaniards, the natives of Batauag revolted, leading to the abandonment of the mission."
        ],
        [
            "In 1673, the mission was restored by Fr.",
            "Pedro Sanchez and Fr.",
            "Geronimo Ullos.",
            "Despite resistance from some natives, Fr.",
            "Pedro Jimenez, appointed as Ambassador of Peace, successfully persuaded many to settle in Cabagan and Itugod.",
            "Consequently, the towns of Cabagan, Itugod, and Santa Rosa de Gamu-t emerged from the original seven envisioned by the mission."
        ],
        [
            "Santa Rosa de Gamu-t and Our Lady of Victories of Itugod merged on December 5, 1741, due to financial constraints, with Gamu serving as the central settlement.",
            "Fr.",
            "Martin Fernandez constructed the church and planned the town, which was annexed to Gamu-t in 1774.",
            "In 1779, the two entities merged under the leadership of Fr.",
            "Sanin, with Gamu as the central seat of the mission."
        ],
        [
            "Initially under the care of Dominican Fathers until 1922, Gamu saw a transition during the American Regime when Fr.",
            "Felix Domingo, a Filipino secular priest, took charge.",
            "The La Salette missionaries assumed responsibility for Gamu from 1962 to 1977."
        ],
        [
            "In December 1949, an earthquake devastated the church and convent, leading to the construction of a wooden church in 1950-1951 adjacent to the ruins of the Spanish Church."
        ],
        [
            "Geography"
        ],
        [
            "Gamu is located in the central part of the province of Isabela.",
            "It is 7 kilometres (4.3 mi) away from the provincial capital, Ilagan, and 391 kilometres (243 mi) from the country's capital, Manila."
        ],
        [
            "It is bounded on the north by the city of Ilagan, or the north-west by the municipality of Quirino, on the south by the municipality of Reina Mercedes and on the south-west by the municipality of Burgos, and on the Southeast by the municipality of Naguilian."
        ],
        [
            "Gamu has a total land area of 129.40 square kilometers with 16 barangays, 3 of which are classified as urban barangays, District I, II, and III, and the rest are considered rural barangays."
        ],
        [
            "Barangays"
        ],
        [
            "Gamu is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Barangays District I, II, and III are considered as urban (highlighted in bold) while the rest are rural."
        ],
        [
            "Barcolan"
        ],
        [
            "Buenavista"
        ],
        [
            "Dammao"
        ],
        [
            "District I (Poblacion)"
        ],
        [
            "District II (Poblacion)"
        ],
        [
            "District III (Poblacion)"
        ],
        [
            "Furao"
        ],
        [
            "Guibang"
        ],
        [
            "Lenzon"
        ],
        [
            "Linglingay"
        ],
        [
            "Mabini"
        ],
        [
            "Pintor"
        ],
        [
            "Rizal"
        ],
        [
            "Songsong"
        ],
        [
            "Union"
        ],
        [
            "Upi"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Gamu, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31.2(1.23)"
        ],
        [
            "23(0.9)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "28.1(1.11)"
        ],
        [
            "113.5(4.47)"
        ],
        [
            "141.4(5.57)"
        ],
        [
            "176.4(6.94)"
        ],
        [
            "236.6(9.31)"
        ],
        [
            "224.9(8.85)"
        ],
        [
            "247.7(9.75)"
        ],
        [
            "222.9(8.78)"
        ],
        [
            "178(7.0)"
        ],
        [
            "1,651.4(65)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "144"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of GamuYearPop.±% p.a.1903 3,581—    1918 6,096+3.61%1939 18,201+5.35%1948 11,744−4.75%1960 18,762+3.98%1970 12,586−3.91%1975 13,635+1.62%1980 16,922+4.41%YearPop.±% p.a.1990 19,141+1.24%1995 22,765+3.30%2000 25,901+2.81%2007 27,479+0.82%2010 28,657+1.54%2015 29,904+0.81%2020 30,655+0.49%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Gamu, Isabela, was 30,655 people, with a density of 240 inhabitants per square kilometre or 620 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Gamu"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  14.80"
        ],
        [
            "2009  14.84"
        ],
        [
            "2012  16.19"
        ],
        [
            "2015  13.29"
        ],
        [
            "2018  15.25"
        ],
        [
            "2021  13.92"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Military"
        ],
        [
            "Camp Melchor F. dela Cruz, the headquarters of the 5th Infantry Division of the Philippine Army, is located in barangay Upi."
        ],
        [
            "Culture"
        ],
        [
            "The town celebrated the Kuliglig Festival on August 23, 2013, following an executive order issued by the municipal government to officially proclaim it as the official festivity of the town."
        ],
        [
            "Tourism"
        ],
        [
            "Gamu is noted for having the most number of Roman Catholic churches in the entire province of Isabela.",
            "These churches are often visited by pilgrims and frequented by travelers all over the country to pay homage to each of the respective Roman Catholic icons to whom each of the churches were dedicated and named after."
        ],
        [
            "The National Shrine of Our Lady of the Visitation of Guibang was elevated into a National Shrine in 1986 by the Catholic Bishops Conference of the Philippines (CBCP) through the initiative of Miguel Purugganan, then Bishop of the Diocese of Ilagan.",
            "It is where the Marian image of the Our Lady of the Visitation of Guibang is enshrined."
        ],
        [
            "The Cathedral of Saint Michael the Archangel is located along the National Highway in Barangay Upi.",
            "It is where the episcopal seat of the Roman Catholic Diocese of Ilagan is located since 2013, when it was transferred from Saint Ferdinand Cathedral in neighboring Ilagan."
        ],
        [
            "The Poor Clare Monastery in Barangay Guibang is a church and monastery that was built and dedicated to Saint Clare of Assisi.",
            "It was established in 1991 by Poor Clare nuns from Cabuyao, Laguna through the assistance of the Roman Catholic Diocese of Ilagan and help from civic-minded benefactors."
        ],
        [
            "The Saint Rose of Lima Church is a Baroque-style 18th century structure dedicated to the town's patron saint, Saint Rose of Lima.",
            "It is notably the oldest church in the town and one of the only remaining churches of its kind in the province of Isabela.",
            "On June 27, 2019, the National Museum of the Philippines and the National Commission for Culture and the Arts (NCCA) recognized the Saint Rose of Lima Church and its surrounding complex as an Important Cultural Property of the Philippines.",
            "The unveiling of the historical marker was done on May 12, 2023."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipality of Gamu is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Gamu Municipal Council(2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative"
        ],
        [
            "Ed Christopher S. Go"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Timoteo M. Galanza"
        ],
        [
            "Municipal Vice-Mayor"
        ],
        [
            "Mitzi P. Cumigad"
        ],
        [
            "Municipal Councilors"
        ],
        [
            "Sheryl L. Labbuanan"
        ],
        [
            "March Luigi E. Cumigad"
        ],
        [
            "Estela C. Burkley"
        ],
        [
            "Camilo A. Preza"
        ],
        [
            "Reynante D. Agustin"
        ],
        [
            "Felicisimo Caro"
        ],
        [
            "Norberto Labayog"
        ],
        [
            "Dante D. Martinez"
        ],
        [
            "Congress representation"
        ],
        [
            "Gamu, belonging to the second legislative district of the province of Isabela, currently represented by Hon.",
            "Ed Christopher S. Go."
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Gamu |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Salgado, Pedro.",
            "\"Specific Irraya Missions in Northern and Mid Isabela\".",
            "Cagayan Valley and Easter Cordillera: 1581-1898, Volume I. Rex Publishing.",
            "pp.",
            "459–464."
        ],
        [
            "^ \"HISTORY OF GAMU\".",
            "PDF Coffee.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b \"Facts and Figures of Gamu, Isabela\".",
            "Retrieved July 11, 2014."
        ],
        [
            "^"
        ],
        [
            "\"Province: Isabela\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^ \"Gamu, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved October 31, 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"IKA-51ST DEATH ANNIVERSARY NI COL. MELCHOR F. DELACRUZ, GINUNITA\".",
            "RMN.",
            "November 10, 2022.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ \"Philippines Reveals Locations of 4 New Strategic Sites for US Military Pact\".",
            "VOA.",
            "April 3, 2023.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ \"Shrine of Our Lady of the Visitation of Guibang\".",
            "Kheem Caparas of Vigattin Tourism.",
            "vigattintourism.com.ph.",
            "Retrieved June 22, 2012."
        ],
        [
            "^ \"Papal nuncio dedicates newly rebuilt national shrine in Isabela\".",
            "CBCP News.",
            "interaksyon.philstar.com.",
            "Retrieved February 17, 2023."
        ],
        [
            "^ Darang, Josephine (September 22, 2013).",
            "\"Pope Francis transfers episcopal seat of Diocese of Ilagan to Gamu, Isabela\".",
            "Philippine Daily Inquirer.",
            "Retrieved March 29, 2015."
        ],
        [
            "^ \"Unveiling of Historical Marker of the Saint Rose of Lima Church Complex issued by the National Museum of the Philippines\".",
            "Official Facebook Page of Dr. Alexander Troy Miano / DOT RO2 PH.",
            "facebook.com.",
            "Retrieved May 12, 2023."
        ],
        [
            "^ \"Gamu, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved May 15, 2022."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines Archived October 26, 2017, at the Wayback Machine"
        ],
        [
            "Gamu at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Municipality of Gamu"
        ],
        [
            "Places adjacent to Gamu"
        ],
        [
            "Quirino"
        ],
        [
            "Ilagan"
        ],
        [
            "Burgos"
        ],
        [
            "Gamu"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Naguilian"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Gamu&oldid=1221118097\""
        ],
        [
            "Categories: Municipalities of Isabela (province)Populated places on the Rio Grande de CagayanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Pages using infobox settlement with possible nickname listCoordinates on WikidataPages with Tagalog IPAArticles containing Ilocano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from April 2024Webarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}