{
    "name": "Gandara",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Gandara, Samar"
        ],
        [
            "17 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°00′47″N 124°48′42″E﻿ / ﻿12.013°N 124.8118°E﻿ / 12.013; 124.8118"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Samar, Philippines"
        ],
        [
            "This article has multiple issues.",
            "Please help improve it or discuss these issues on the talk page.",
            "(Learn how and when to remove these template messages)"
        ],
        [
            "This article may contain an excessive amount of intricate detail that may interest only a particular audience.",
            "Please help by spinning off or relocating any relevant information, and removing excessive detail that may be against Wikipedia's inclusion policy.",
            "(August 2015) (Learn how and when to remove this message)"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Gandara, Samar\" – news · newspapers · books · scholar · JSTOR (May 2013) (Learn how and when to remove this message)"
        ],
        [
            "This article possibly contains original research.",
            "Please improve it by verifying the claims made and adding inline citations.",
            "Statements consisting only of original research should be removed.",
            "(May 2016) (Learn how and when to remove this message)"
        ],
        [
            " (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesGandaraMunicipalityMunicipality of GandaraAerial view of the Poblacion"
        ],
        [
            "FlagSealEtymology: BangahonMotto(s): An ungod nga Gandareño nahigugma ha bungto; ha sulod ha gawas permi malimpyo.Map of Samar with Gandara highlightedOpenStreetMapGandaraLocation within the PhilippinesCoordinates: 12°00′47″N 124°48′42″E﻿ / ﻿12.013°N 124.8118°E﻿ / 12.013; 124.8118CountryPhilippinesRegionEastern VisayasProvinceSamarDistrict"
        ],
        [
            "1st districtNamed forJosé de la Gándara y NavarroBarangays69"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorWarren Tan Aguilar • Vice MayorElias Correche Delector • RepresentativeStephen James Tan • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Mark A. Agoy-agoy• Jennelyn C. Berbes• Miguel V. Ricalde• Joel S. Oliva• George S. Ramirez• Emilio C. Romo• Beatriz T. Cambe• Rene C. DelectorDILG Masterlist of Officials"
        ],
        [
            " • Electorate26,753 voters (2022)Area • Revenue₱ 214.7 million (2020) • Assets₱ 403.2 million (2020) • Expenditure₱ 198.6 million (2020)Service provider • ElectricitySamar 1 Electric Cooperative (SAMELCO 1)Time zoneUTC+8 (PST)ZIP code6706PSGC086007000IDD : area code +63 (0)55Native languagesWaray TagalogWebsitewww.lgugandarasamar.gov.ph"
        ],
        [
            "Gandara, officially the Municipality of Gandara (Waray: Bungto han Gandara),  is a 2nd class municipality in the province of Samar, Philippines.",
            "According to the 2020 census, it has a population of 35,242 people."
        ],
        [
            "History"
        ],
        [
            "The town was formerly named Bangahon, but its population was resettled to its current location on September 29, 1902.",
            "After settling in its new location, the name Gandara was given to it in commemoration of the former Governor-General José de la Gándara y Navarro."
        ],
        [
            "By virtue of Batas Pambansa Blg.",
            "11 approved in 1978, 29 barangays were separated to create the new municipality of San Jorge."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Gandara is politicaly subdivided into 70 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Adela Heights"
        ],
        [
            "Arong 1"
        ],
        [
            "Arong 2 (1998)"
        ],
        [
            "Balocawe"
        ],
        [
            "Bangahon"
        ],
        [
            "Beslig"
        ],
        [
            "Buao"
        ],
        [
            "Bunyagan"
        ],
        [
            "Burabod I"
        ],
        [
            "Burabod II"
        ],
        [
            "Calirocan"
        ],
        [
            "Canhumawid"
        ],
        [
            "Caparangasan"
        ],
        [
            "Caranas"
        ],
        [
            "Carmona"
        ],
        [
            "Casab-ahan"
        ],
        [
            "Casandig"
        ],
        [
            "Catorse de Agosto"
        ],
        [
            "Caugbusan"
        ],
        [
            "Concepcion"
        ],
        [
            "Diaz"
        ],
        [
            "Dumalo-ong"
        ],
        [
            "Elcano"
        ],
        [
            "Gerali"
        ],
        [
            "Gereganan"
        ],
        [
            "Giaboc"
        ],
        [
            "Hampton"
        ],
        [
            "Hetebac"
        ],
        [
            "Himamaloto"
        ],
        [
            "Hinayagan"
        ],
        [
            "Hinugacan"
        ],
        [
            "Hiparayan"
        ],
        [
            "Jasminez"
        ],
        [
            "Lungib"
        ],
        [
            "Mabuhay"
        ],
        [
            "Macugo"
        ],
        [
            "Malayog"
        ],
        [
            "Marcos"
        ],
        [
            "Minda"
        ],
        [
            "Nacube"
        ],
        [
            "Nalihugan"
        ],
        [
            "Napalisan"
        ],
        [
            "Natimonan"
        ],
        [
            "Ngoso"
        ],
        [
            "Palambrag"
        ],
        [
            "Palanas"
        ],
        [
            "Piñaplata"
        ],
        [
            "Pizarro"
        ],
        [
            "Pologon"
        ],
        [
            "Purog"
        ],
        [
            "Rawis"
        ],
        [
            "Rizal"
        ],
        [
            "Samoyao"
        ],
        [
            "San Agustin"
        ],
        [
            "San Antonio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pelayo"
        ],
        [
            "San Ramon"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santo Niño"
        ],
        [
            "Senibaran"
        ],
        [
            "Sidmon"
        ],
        [
            "Tagnao"
        ],
        [
            "Tambongan"
        ],
        [
            "Tawiran"
        ],
        [
            "Tigbawon"
        ],
        [
            "Geo-Political Boundaries"
        ],
        [
            "Gomezville (Home Owners Association)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Gandara, Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "72(2.8)"
        ],
        [
            "52(2.0)"
        ],
        [
            "65(2.6)"
        ],
        [
            "62(2.4)"
        ],
        [
            "87(3.4)"
        ],
        [
            "129(5.1)"
        ],
        [
            "153(6.0)"
        ],
        [
            "124(4.9)"
        ],
        [
            "147(5.8)"
        ],
        [
            "157(6.2)"
        ],
        [
            "139(5.5)"
        ],
        [
            "117(4.6)"
        ],
        [
            "1,304(51.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.4"
        ],
        [
            "13.4"
        ],
        [
            "16.8"
        ],
        [
            "18.0"
        ],
        [
            "22.0"
        ],
        [
            "25.3"
        ],
        [
            "26.2"
        ],
        [
            "24.2"
        ],
        [
            "24.9"
        ],
        [
            "26.0"
        ],
        [
            "23.3"
        ],
        [
            "20.8"
        ],
        [
            "258.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Downdown Gandara"
        ],
        [
            "Population census of GandaraYearPop.±% p.a.1903 12,014—    1918 14,320+1.18%1939 18,507+1.23%1948 25,048+3.42%1960 24,883−0.06%1970 28,307+1.30%1975 30,600+1.57%1980 24,764−4.14%1990 23,673−0.45%1995 27,263+2.68%2000 28,866+1.23%2007 31,222+1.09%2010 31,943+0.83%2015 34,434+1.44%2020 35,242+0.46%Source: Philippine Statistics Authority"
        ],
        [
            "Based on latest 2014 survey, the total population was 33,264, consisting of 17,046 males and 16,218 females.",
            "The number of households was 6,653, with an average household size of 4.87 persons and a density of 68/km2.",
            "Built-up Area population density at town proper 6,652 along Carline Area is 4,992, Coastal Area is 5,751 and Rural Area is 5,748."
        ],
        [
            "Economy"
        ],
        [
            "Queseo, native cheese delicacy of Gandara"
        ],
        [
            "The municipality of Gandara is known for its products such as queseo (kesong puti),"
        ],
        [
            "Tourism"
        ],
        [
            "Maria Diana’s Chapel located in the Gandara Public Cemetery"
        ],
        [
            "Miraculous cadaver of Maria Diana"
        ],
        [
            "Maria Diana’s Chapel"
        ],
        [
            "Gandara is the home also of the well-known corpse of Maria Diana Alvarez believed to be miraculous by the Gandareños."
        ],
        [
            "Karabaw Festival"
        ],
        [
            "A festival which pays tribute to the draft animal that helps people till their farms and provides milk for Gandara’s local white cheese delicacy called “Queseo”.",
            "The festival itself has proven a lot in terms of creativity and uniqueness.",
            "In fact, it has already won 7 times in the Samar Day Celebration observed every August 11 where all municipalities and cities in Samar gather at the provincial capitol in Catbalogan to perform and compete."
        ],
        [
            "Annual Fluvial Parade"
        ],
        [
            "The traditional fluvial procession along the river of Gandara held every month of September is a significant and mainstay event of the yearly fiesta celebration."
        ],
        [
            "Fluvial procession along the river of Gandara passing under Gandara bridge"
        ],
        [
            "Bangahon Church Ruins"
        ],
        [
            "The Ruins of Bangahon is a historical landmark near the right fork of Gandara river.",
            "It was once a town during the revolutionary period, but was abandoned by the old residents who later found the present town of Gandara."
        ],
        [
            "Great Fire of Gandara"
        ],
        [
            "Old Church (Poblacion) and the Harvardian Schools memorabilia Photographies were lost on this fire, the Town Library (Harvardian School) were also damaged by this fire.",
            "The Fire started somewhere at an Electric Utility Post near Aguilar Residence and spread by a radius to the Second street."
        ],
        [
            "San Jose Rapids"
        ],
        [
            "The Rapids are geolocated near Matuguinao, actually it is the Gandara River and Matuguinao River (river source) formed by rock formation, the word (Panaog) in local folks."
        ],
        [
            "Education"
        ],
        [
            "Elementary and Kinder School"
        ],
        [
            "Gandara Central Elementary School"
        ],
        [
            "Gandara Central Elementary School started with the construction of Gabaldon School Buildings.",
            "The Gabaldon School Buildings or simply known as the Gabaldons is a term used to refer to heritage school buildings in the Philippines built during the American Colonial Era.",
            "They are noted for the architecture inspired from the bahay kubo and bahay na bato.",
            "As of about 2024, there are 2,045 Gabaldon School Buildings throughout the Philippines."
        ],
        [
            "The Gabaldon School Buildings, also referred to as the Gabaldons, originated from Act No.",
            "1801 or the Gabaldon Law, a legislation written by Isauro Gabaldón of the Philippine Assembly in 1907.",
            "The law provided for the funding of ₱1 million for the construction of modern public schools across the Philippine Islands from 1908 to 1915."
        ],
        [
            "Like Gabaldon, first educators are from other Countries with earlier Educational System, the Old Katon Cristiana and the University of Santo Tomas system to 'pass-on' the Education"
        ],
        [
            "learned."
        ],
        [
            "By the turn of 20th Century, pupils/students populations are increasing, some are migrants and other from within the town, the former (DECS) - Ministry/Department of Education Culture and Sports now DepEd (Department of Education) decided to create partition on the interior Barrios Schools and along the Road Schools."
        ],
        [
            "Gandara Central School I"
        ],
        [
            "Gandara Central School II"
        ],
        [
            "Miracle Haven Kinder School"
        ],
        [
            "Secondary education"
        ],
        [
            "Saint Michael's High School, Incorporated (SMHSi)"
        ],
        [
            "From 1663 to 1768, Bangajon was administered by a priest from the Catbalogan Cabeccera Residencia who had the multiple duties of administering also the Tinago (Tarangnan) and sometimes the Hibatang (now Calbayog) visitas.",
            "In 1663, Moro pirates reached the village of Bangajon.",
            "After ransacking the village, they burned it.",
            "But the Jesuits missionaries were undaunted.",
            "They rebuilt the village and built a church made of stone and roofed with zinc and partly with nipa.",
            "It measured “26 fathoms (stones) in length wall thickness, 9 fathoms (stones) in width  , 4 ½ fathoms (stones) in height” (about 48 meters in length, 16.5 m. in width and 4.5 m. in height).",
            "The church was dedicated to St. Michael de Archangel.",
            "They also built a convento of the same materials and two parochial schools (one for boys and another for girls) and a casa real of wood."
        ],
        [
            "After the fire in 1876, a tribunal and an escuela were also constructed under the direction of Fr.",
            "Geronimo Asenjo.",
            "They also continued with the education of the people, especially the children.",
            "The older residents of Gandara remember that the first book they used in the school was the Katon Cristiana.",
            "Graduation from school was simple.",
            "Any pupil who could recite the contents of the whole book from memory was graduated.",
            "Then they writer sent to the barrios to teach the Katon Christiana."
        ],
        [
            "In 1901, the town principalia held a session extraordinaria on April 14, 1901 and passed an Act to build a new town and to transfer its location to the sitio of Dumalo-ong (present-day site of Gandara).",
            "When peace finally came to Samar in 1902, the people went about the reconstruction of the town and the church.",
            "Religious activities were resumed.",
            "Gandaranhons celebrated their first fiesta with their new Mayor on September 29, 1903 after years of war."
        ],
        [
            "Franciscan missionaries returned to Gandara in 1910 after the new Diocese of Calbayog was established.",
            "Franciscan priests assigned to Gandara from 1910 to 1926 were Fr.",
            "Juan Vicente Carmona, O.F.M., Fr.",
            "Roman Perez, O.F.M.",
            "and Fr.",
            "Victoriano Ranera.",
            "O.F.M."
        ],
        [
            "Early in the sixties, Msgr.",
            "Ponciano Figueroa, then parish priest of Gandara, together with the mayor, Mayor Ramon Tan Diaz, established the St. Michael High School, the first and only Catholic school in the town."
        ],
        [
            "Ramon T. Diaz National High School (RTDNHS)"
        ],
        [
            "Piñaplata Integrated School"
        ],
        [
            "List of Parish Priest assigned to Bangajon/Gandara"
        ],
        [
            "1711 Fr.",
            "Joannes Ramon"
        ],
        [
            "1722 Fr.",
            "Bartholomeus de Sugo (with Calbiga)"
        ],
        [
            "1724 Fr.",
            "Ignatius de Echavarria (with Tinago)"
        ],
        [
            "1725-1726 Fr.",
            "Antonius Diaz (with Tinago)"
        ],
        [
            "1727 Fr.",
            "Gregorius Davosa"
        ],
        [
            "1728 Fr.",
            "Bernardino Ortiz (with Tinago)"
        ],
        [
            "1731 Fr.",
            "Josephus Chacon (with Hibatang)"
        ],
        [
            "1735 Fr.",
            "Josephus Chacon (with Tinago)"
        ],
        [
            "1737-1739 Fr.",
            "Petrus Bolos (with Tinago)"
        ],
        [
            "1742 Fr.",
            "Joannes Bautista (with Calbayog)"
        ],
        [
            "1747-1749 Fr.",
            "Michael Catarrola (with Tinago)"
        ],
        [
            "1751-1752 Fr.",
            "Pedrus Patelani (with Calbayog)"
        ],
        [
            "Franciscan Administration (1768-1898)"
        ],
        [
            "1769 Fr.",
            "Juan Salguero"
        ],
        [
            "1771 Fr.",
            "Joaquin Polo de Rojas"
        ],
        [
            "1772 Fr.",
            "Juan Mora"
        ],
        [
            "1774-1776 Fr.",
            "Juan Mora (with Calbayog)"
        ],
        [
            "1777 Fr.",
            "Juan Bautista Belloc"
        ],
        [
            "1778 Fr.",
            "Onofre del Montejo"
        ],
        [
            "1779-1781 Fr.",
            "Juan Bautista Velloc"
        ],
        [
            "1782-June 1783 Fr.",
            "Onofre del Montejo"
        ],
        [
            "Dec. 1784 Fr.",
            "Juan Bautista Velloc (with Calbayog)"
        ],
        [
            "June 1786 Fr.",
            "Joaquin Jose Martinez (with Calbayog)"
        ],
        [
            "1787-1811 Fr.",
            "Juan Bautista Velloc (who died in Tarangnan on May 21, 1812)"
        ],
        [
            "1813-1816 Vacant"
        ],
        [
            "1817-1819 Fr.",
            "Felix Carreon (who was also parish priest of Catbalogan)"
        ],
        [
            "1820, 1825-1826, 1828-1829, 1831-1832 – Vacant"
        ],
        [
            "1834 Fr.",
            "Juan Garibo"
        ],
        [
            "1835-1841 Fr.",
            "Felix Fernandez de Jesus y Maria"
        ],
        [
            "1843 Fr.",
            "Domingo de Madrid"
        ],
        [
            "1844-1855 Fr.",
            "Juan del Fregenal"
        ],
        [
            "1856-1859 Vacant"
        ],
        [
            "1861-1864 Fr.",
            "Saturnino Bajo"
        ],
        [
            "1865-1867 Vacant"
        ],
        [
            "1868 Ynterino"
        ],
        [
            "1870 Vacant"
        ],
        [
            "1871 (now renamed Gandara), vacant"
        ],
        [
            "1870-1876 Fr.",
            "Santos Aparicio"
        ],
        [
            "1877-1882 Fr.",
            "Geronimo Asenjo"
        ],
        [
            "1882-1883 Fr.",
            "Millan Vicente"
        ],
        [
            "1885-1894 Fr.",
            "Manuel Benavente"
        ],
        [
            "1897-1898 Fr.",
            "Hermenegildo Hernandez"
        ],
        [
            "Transition Period (1898-1910)"
        ],
        [
            "1908-1910 Fr.",
            "Juan Vicente Carmona, O.F.M."
        ],
        [
            "Diocese of Calbayog"
        ],
        [
            "1910-1914 Fr.",
            "Juan Vicente Carmona, O.F.M."
        ],
        [
            "1914-20 Fr.",
            "Roman Perez O.F.M."
        ],
        [
            "1921-26 Fr.",
            "Victoriano Ranera, O.F.M."
        ],
        [
            "1926-37 Fr.",
            "Doroteo de la Vega, O.F.M."
        ],
        [
            "1937-45 Fr.",
            "Gregorio Talbo"
        ],
        [
            "1941-47 Fr.",
            "Pablo Lanuevo, Fr.",
            "Angel Hobayan (Assistant)"
        ],
        [
            "1947-50 Fr.",
            "Francisco Tizon"
        ],
        [
            "Visiting priests: Fr.",
            "Jose Corr, Fr.",
            "Jaime Collins, Fr.",
            "C. Connoly, Fr.",
            "Domingo Tome"
        ],
        [
            "1950 Fr.",
            "Wenceslao Lagunzad"
        ],
        [
            "1950-1951 Fr.",
            "Fortunato Planea"
        ],
        [
            "1951-1960 Fr.",
            "Francisco Tizon, Fr.",
            "Jose Pacoli"
        ],
        [
            "1960-1968 Fr.",
            "Ponciano Figueroa"
        ],
        [
            "1966 Fr.",
            "Ponciano Figueroa, Fr.",
            "Juan Franzuela"
        ],
        [
            "1966 Fr.",
            "Juan Papel"
        ],
        [
            "Jan-May 1967 Fr.",
            "Orlando Tizon"
        ],
        [
            "June 1967-1970 Fr.",
            "Nicodemus Ricalde"
        ],
        [
            "1970-1973 Fr.",
            "Emilio Bernardo"
        ],
        [
            "1973-1974 Team Ministry: Msgr.",
            "Ricardo Tancinco, Fr.",
            "Bernabe B. Sison, Fr.",
            "Miguel Java"
        ],
        [
            "1975-1976 Fr.",
            "Simplicio Robles"
        ],
        [
            "1977-1979 Fr.",
            "Simplicio Robles, Fr.",
            "Leonardo Sison, Msgr.",
            "Ricardo Tancinco"
        ],
        [
            "1980-1986 Fr.",
            "Paulino Singzon, Fr.",
            "Leonardo Sison"
        ],
        [
            "1986-1987 Fr.",
            "Felicito Baybay"
        ],
        [
            "1987-1989 Fr.",
            "Perfecto Nacional"
        ],
        [
            "1989-1990 Msgr.",
            "Anastacio Labutin"
        ],
        [
            "1990-1997 Fr.",
            "Ramon Daguman"
        ],
        [
            "1997-2001 Fr.",
            "Romeo Manzanero"
        ],
        [
            "2001-2005 Fr.",
            "Teofanes Tabones"
        ],
        [
            "2005-2009 Team Ministry: Fr.",
            "Jose Balasbas, Fr.",
            "Erwin Rodriguez, Fr.",
            "Roger Abaigar"
        ],
        [
            "2009-present Team Ministry: Fr.",
            "Rolando Guiuan, Fr.",
            "Guillermo Alorro III"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Gandara |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Batas Pambansa Blg.",
            "11 (December 6, 1978), BAn Act Creating the Municipality of San Jorge in the Province of Samar, The LawPhil Project - Arellano Law Foundation, Inc., retrieved March 22, 2023"
        ],
        [
            "^ \"Gandara: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved February 29, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Samar (Western Samar)\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Samar to boost delicacies via 'Secret Kitchen' drive | Philippine Canadian Inquirer\".",
            "Retrieved April 22, 2020."
        ],
        [
            "^ \"Officially the Municipality of Gandara, is a 2nd class municipality in the province of Samar, Philip\".",
            "CHARLES LOMINOQUE.",
            "Archived from the original on July 28, 2021.",
            "Retrieved April 23, 2020."
        ],
        [
            "^ agrimag (August 4, 2018).",
            "\"Native Carabaos Do Well in Niche Markets\".",
            "Agriculture Monthly.",
            "Retrieved April 23, 2020."
        ],
        [
            "^ gandara-samar-promotes-delicacy-made-carabaos-milk-421119 (July 26, 2015).",
            "\"Gandara, Samar promotes delicacy made with carabao's milk\".",
            "SunStar.",
            "Retrieved April 23, 2020.",
            "{{cite news}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ \"OVP's carabao dispersal to boost Samar town cheese production\".",
            "Philippine News Agency.",
            "Retrieved April 23, 2020."
        ],
        [
            "^ \"Move over, Gandara Park: Samar unveils the real Gandara\".",
            "The Philippine Star.",
            "Retrieved April 23, 2020."
        ],
        [
            "^ Sanchez, Korina (March 27, 2016).",
            "\"Hulog ng Langit\".",
            "Rated K."
        ],
        [
            "^ Journal, The Calbayog.",
            "\"KARABAW FESTIVAL OF GANDARA, SAMAR\".",
            "KARABAW FESTIVAL OF GANDARA, SAMAR.",
            "Retrieved April 22, 2020."
        ],
        [
            "^ carabao-festival-triumphs-samar-day-297606 (August 13, 2013).",
            "\"Carabao Festival triumphs in Samar Day\".",
            "SunStar.",
            "Retrieved April 22, 2020.",
            "{{cite news}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ Labro, Vicente S. \"A festive day of pride for Samareños\".",
            "Philippine Daily Inquirer.",
            "Retrieved April 22, 2020."
        ],
        [
            "^ \"MUNICIPALITY OF GANDARA, SAMAR\".",
            "MUNICIPALITY OF GANDARA, SAMAR.",
            "Retrieved April 22, 2020."
        ],
        [
            "^ \"Gandara - Samar Destinations\".",
            "www.localphilippines.com.",
            "Retrieved April 23, 2020."
        ],
        [
            "^ \"Officially the Municipality of Gandara, is a 2nd class municipality in the province of Samar, Philip\".",
            "CHARLES LOMINOQUE.",
            "Archived from the original on July 28, 2021.",
            "Retrieved April 23, 2020."
        ],
        [
            "^ \"Samar Island Spots\".",
            "Trexplore the Adventures.",
            "Retrieved April 23, 2020."
        ],
        [
            "^ \"Bangahon Spanish Church Ruins, Province of Samar, Eastern Visayas, Philippines\".",
            "ph.geoview.info.",
            "Retrieved April 22, 2020."
        ],
        [
            "^ \"Map - Gandara, Samar (Gandara) - MAPALL.COM\".",
            "174.127.109.64.",
            "Retrieved April 22, 2020."
        ],
        [
            "^ \"Ramon T. Diaz Memorial High School: Tuition & Application | Edukasyon.ph\".",
            "www.edukasyon.ph.",
            "Retrieved April 22, 2020."
        ],
        [
            "^ \"Ramon T. Diaz MHS\".",
            "Entranceuniversity.",
            "Retrieved April 22, 2020."
        ],
        [
            "^ \"Piñaplata Integrated School - , Gandara, Western Samar - Public High School\".",
            "www.philippinecompanies.com.",
            "Retrieved April 22, 2020."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Gandara, Samar."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived March 4, 2016, at the Wayback Machine"
        ],
        [
            "Places adjacent to Gandara, Samar"
        ],
        [
            "Calbayog"
        ],
        [
            "Silvino Lobos, Northern Samar"
        ],
        [
            "Matuguinao"
        ],
        [
            "Santa Margarita"
        ],
        [
            "Gandara"
        ],
        [
            "San Jose de Buan"
        ],
        [
            "Samar Sea"
        ],
        [
            "Pagsanghan / Tarangnan"
        ],
        [
            "San Jorge"
        ],
        [
            "vte Province of SamarCatbalogan (capital)  Calbayog (largest city)Municipalities"
        ],
        [
            "Almagro"
        ],
        [
            "Basey"
        ],
        [
            "Calbiga"
        ],
        [
            "Daram"
        ],
        [
            "Gandara"
        ],
        [
            "Hinabangan"
        ],
        [
            "Jiabong"
        ],
        [
            "Marabut"
        ],
        [
            "Matuguinao"
        ],
        [
            "Motiong"
        ],
        [
            "Pagsanghan"
        ],
        [
            "Paranas"
        ],
        [
            "Pinabacdao"
        ],
        [
            "San Jorge"
        ],
        [
            "San Jose de Buan"
        ],
        [
            "San Sebastian"
        ],
        [
            "Santa Margarita"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Tagapul-an"
        ],
        [
            "Talalora"
        ],
        [
            "Tarangnan"
        ],
        [
            "Villareal"
        ],
        [
            "Zumarraga"
        ],
        [
            "Component cities"
        ],
        [
            "Calbayog"
        ],
        [
            "Catbalogan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Gandara,_Samar&oldid=1233434113\""
        ],
        [
            "Category: Municipalities of Samar (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listAll articles with dead external linksArticles with dead external links from May 2024Articles with permanently dead external linksArticles with short descriptionShort description is different from WikidataWikipedia articles that are excessively detailed from August 2015All articles that are excessively detailedWikipedia articles with style issues from August 2015All articles with style issuesArticles needing additional references from May 2013All articles needing additional referencesArticles that may contain original research from May 2016All articles that may contain original researchArticles with multiple maintenance issuesUse mdy dates from November 2022Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}