{
    "name": "Glan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Glan, Sarangani"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 5°49′N 125°12′E﻿ / ﻿5.82°N 125.2°E﻿ / 5.82; 125.2"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Sarangani, Philippines"
        ],
        [
            "Municipality in Soccsksargen, PhilippinesGlanMunicipalityMunicipality of GlanOther transcription(s) • JawiڠلنGlan Golden Municipal Hall"
        ],
        [
            "FlagSealMap of Sarangani with Glan highlightedOpenStreetMapGlanLocation within the PhilippinesCoordinates: 5°49′N 125°12′E﻿ / ﻿5.82°N 125.2°E﻿ / 5.82; 125.2CountryPhilippinesRegionSoccsksargenProvinceSaranganiDistrict"
        ],
        [
            "Lone districtBarangays31 (see Barangays)Government  • TypeSangguniang Bayan • MayorVictor James B. Yap Sr. • Vice MayorVictor James P. Yap Jr. • RepresentativeSteve Solon • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ricardo Q. Roque Jr.Kayrud W. AlegadoNazarius D. WataJoselito A. EscobarElsan Faith R. EngkongLydia B. HizolerCarlos A. HomoEdwin D. Pacaldo"
        ],
        [
            " • Electorate77,140 voters (2022)Area"
        ],
        [
            " • Revenue₱ 388.2 million (2020) • Assets₱ 1,067 million (2020) • Expenditure₱ 312.8 million (2020) • Liabilities₱ 201.9 million (2020)Service provider • ElectricitySouth Cotabato 2 Electric Cooperative (SOCOTECO 2)Time zoneUTC+8 (PST)ZIP code9517PSGC128002000IDD : area code +63 (0)83Native languagesCebuano Tboli Sarangani Sangirese Tagalog  MaguindanaonWebsitewww.glan.gov.ph"
        ],
        [
            "Glan, officially the Municipality of Glan (Cebuano: Lungsod sa Glan; Maguindanaon: Inged nu Glan, Jawi: ايڠد نوڠلن; Tagalog: Bayan ng Glan), is a 1st class municipality in the province of Sarangani, Philippines.",
            "According to the 2020 census, it has a population of 109,547 people."
        ],
        [
            "Glan is located east of Sarangani Bay, west of Davao Occidental, and north of the Celebes Sea.",
            "Barangay Sufatubo as the largest barangay in Glan, It is largely based on agriculture with a high level production of copra.",
            "Aquaculture is the second biggest income earner, notably milkfish and shrimps culture.",
            "Other agricultural products are coconuts, maize, sugarcane, bananas, pineapples, mangoes, pork, eggs, beef, and fish."
        ],
        [
            "The economy accelerated in 2010s due to advances in global communication technology and the finishing of a modern highway, which improved trade and transport.",
            "The municipality is classified as he \"heritage town\" by cultural conservationists, including members of the National Commission for Culture and the Arts due to the many well-preserved ancestral houses and heritage structures within the municipality.",
            "The Heritage Conservation Society suggested an ordinance, similar to the ordinance in Vigan, that would protect Glan's heritage houses and aesthetics in 2014 for centuries to come.",
            "Some conservationists have also suggested for the town's inclusion in the Philippines tentative list for UNESCO World Heritage Site enlistment."
        ],
        [
            "History"
        ],
        [
            "Agricultural Colony No.",
            "9 Monument, Glan, Sarangani"
        ],
        [
            "In the early efforts of Independence from American administration, Sergio Osmeña, Sr. the president of the first convention of provincial governors had joined those nationalists who petitioned Governor William Howard Taft to allow the formation of a political party advocating immediate independence for the Philippines in 1902.",
            "Sergio Osmeña, while a governor of Cebu, he was elected as the first Speaker of national assembly in 1907 and uses the venue to request further more Filipino control in the colony or “Filipinization” of the colony.",
            "From 1907 to 1916, the executive power of the Philippines was vested in an American Governor General, assisted by the departmental secretaries.",
            "Under the Osmeña Act, which passed by the Philippine Legislature a portion of this act “which provides the colonization to all parts of Mindanao that includes Jolo, Sulo and Basilan.” Hence, the distribution of land in Mindanao, program by the Bureau of Land “Free” otherwise known as “Homestead”, comprises twenty four (24) hectares track of agricultural land in addition to townsite lot of nine hundred twenty (920) square meters to give free and distributed to Filipino families from all walks of life from Luzon and Visayas willing to owned and occupy land in Mindanao.",
            "Hence, this was known as sakada people migrated to Mindanao by way of shipment from Luzon and other parts of the Visayas."
        ],
        [
            "In 1912, arriving at the port of Surigao where the office of the bureau of land under American supervision.",
            "A noticed outside the office which read “Immediate Hiring of Workers” and willing to travel to all parts of Mindanao.",
            "Thus, Elpidio Empasis Barcelona, a very poor young Spanish Filipino mestizo hails from Tanke, Talisay in island of Cebu at the age of sixteen (16) became an employee of the Bureau of Land, under an American supervision in Land Survey Party.",
            "He works as a “transit man” and was designated as an assistant to the Engineering Land Surveyor due to his knowledge in mathematics.",
            "Experienced in surveying, his first assignment was from Butuan, Davao, and others parts of Cotabato, Pikit, Pagalungan, Midsayap as far as Zamboanga, Jolo, Sulo and Basilan.",
            "Also in 1912, back to area of Cotabato member of survey party led by an American geodetic engineer, continued their task of surveying, until they reached the most southern part of Cotabato, now called “GLAN”, which was then unexplored before.",
            "The existence of the biggest form of trees with approximate diameter of five to six feet, the least was four feet in diameter.",
            "There were very few existing houses of Blaans and Maguindanaons, who were native inhabitants in the area, numbered not more than seven houses or shanties near the banks of the river, and there were also others who lived in shanties at the hinterland.",
            "They found no Christians alike, the place was still unknown its name.",
            "A member of the survey party, approached a certain native Maguindanaon man who happened sharpening his long bladed bolo, and asked the native in Cebuano, “amigo, unsay nga’an ning dapita, ning lugaraha?” (Friend, what's the name of this area, this place?).",
            "The man did not actually understand Cebuano, as he thought the stranger was asking what he was doing he answered “GALANG” means sharpening in Maguindanaon.",
            "Then and there, the member of the survey party reported to Barcelona the name of the place is “Galang”.",
            "By mistake, it was named in the surveyed place and was established in the department of agriculture in a lot plan as “Colony No.",
            "9- Glan”.",
            "The man was later known as Po Mangalaw."
        ],
        [
            "Elpidio Empasis Barcelona made a written request to his American supervisor and recommended to the Bureau of Land Secretary to be reassigned in Cotabato colony no.",
            "9 to assist SACADA people from Visayas in filing their free-patent application, relative to distribution and location of their homestead and also with corresponding lot number.",
            "Barcelona request's was granted.",
            "On ground that this new unexplored land (Colony No.",
            "9) must be distributed to people Christians alike and also includes the native Blaans and Maguindanaons."
        ],
        [
            "Barcelona wrote a letter to his families back in Carcar, Cebu, inviting them and their neighbors to come and the people from San Fernando, Naga, and other parts of Cebu joined in going to a place now called Glan.",
            "These people from Carcar and neighboring towns in Cebu decided themselves by majority to charter another ship, that directly to land at its seashores at the valley of Glan.",
            "The arrival of first ship landed was on October 8, 1914.",
            "They were Fermin Adarna, Braulio Jimenez, Gavino Avila, Severino Maribosa, Esperidion Cania, Agapito Morales, Perpetuo Cellona, Luis Onin, Macario Ebona, Mamerto Del Pilar, Bernabe Flores, Jose Sarcon, Felipe Onay, Tomas Ugdamin, Damaso Intig and Eulogio Villaluz."
        ],
        [
            "The second wave of southward arrival was on March 10, 1915.",
            "They were Gil Alcober, Gonzalo Cabilao, Primo Alcoriza, Braulio Calinawan, Baldomero Alducente, Gil Caliza, Gaspar Alido, Mateo Du, Urbano Alinsunurin, Felipe De Goma, Macario Alinsugay, Anatalio Flores, Graciano Algarme, Eusebio Lapis, Maximo Baclaan, Clemente Pangalao, Andres Barcelona, Eugenio Pangalao, Enrique Barcelona, Higino Paras, Arcadio Baring, Miguel Reyes, Francisco Bendigoza, Hospicio Sarmiento, Marcelo Bukog, Timoteo Sarmiento, Mariano Alinsugay and Gavino Tabanao."
        ],
        [
            "These were the first Sacadas who built the town Glan.",
            "Later, Tranquilino Ruiz was assigned as Colony Supervisor around 1917 in Glan."
        ],
        [
            "Heritage Town"
        ],
        [
            "The municipality is classified by members of the National Commission for Culture and the Arts as a heritage town.",
            "However, no ordinance or law has yet to be legislated for protection of Glan's heritage structures and colonial roads.",
            "A Vigan-type ordinance has been suggested by the Heritage Conservation Society, so that the town may be added to the Philippines UNESCO Tentative List in the future."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Glan is politically subdivided into 31 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Baliton"
        ],
        [
            "Batotuling"
        ],
        [
            "Batulaki"
        ],
        [
            "Big Margus"
        ],
        [
            "Burias"
        ],
        [
            "Cablalan"
        ],
        [
            "Calabanit"
        ],
        [
            "Calpidong"
        ],
        [
            "Congan"
        ],
        [
            "Cross"
        ],
        [
            "Datalbukay"
        ],
        [
            "E. Alegado"
        ],
        [
            "Glan Padidu"
        ],
        [
            "Gumasa"
        ],
        [
            "Ilaya"
        ],
        [
            "Kaltuad"
        ],
        [
            "Kapatan"
        ],
        [
            "Lago"
        ],
        [
            "Laguimit"
        ],
        [
            "Mudan"
        ],
        [
            "New Aklan"
        ],
        [
            "Pangyan"
        ],
        [
            "Poblacion"
        ],
        [
            "Rio Del Pilar"
        ],
        [
            "San Jose"
        ],
        [
            "San Vicente"
        ],
        [
            "Small Margus"
        ],
        [
            "Sufatubo"
        ],
        [
            "Taluya"
        ],
        [
            "Tango"
        ],
        [
            "Tapon"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Glan, Sarangani"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "129(5.1)"
        ],
        [
            "106(4.2)"
        ],
        [
            "148(5.8)"
        ],
        [
            "180(7.1)"
        ],
        [
            "261(10.3)"
        ],
        [
            "316(12.4)"
        ],
        [
            "295(11.6)"
        ],
        [
            "274(10.8)"
        ],
        [
            "220(8.7)"
        ],
        [
            "238(9.4)"
        ],
        [
            "243(9.6)"
        ],
        [
            "181(7.1)"
        ],
        [
            "2,591(102.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.4"
        ],
        [
            "16.2"
        ],
        [
            "19.5"
        ],
        [
            "22.8"
        ],
        [
            "27.6"
        ],
        [
            "27.9"
        ],
        [
            "26.5"
        ],
        [
            "25.7"
        ],
        [
            "24.0"
        ],
        [
            "26.6"
        ],
        [
            "27.2"
        ],
        [
            "23.5"
        ],
        [
            "284.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of GlanYearPop.±% p.a.1918 6,309—    1939 9,364+1.90%1948 20,342+9.00%1960 31,320+3.66%1970 37,879+1.92%1975 38,218+0.18%1980 48,882+5.04%1990 60,382+2.14%1995 73,768+3.82%2000 83,051+2.57%2007 102,676+2.97%2010 106,518+1.35%2015 118,263+2.01%2020 109,547−1.49%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Glan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  37.20"
        ],
        [
            "2009  46.96"
        ],
        [
            "2012  49.03"
        ],
        [
            "2015  52.61"
        ],
        [
            "2018  39.30"
        ],
        [
            "2021  45.22"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Glan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Glan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 15 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XII (Soccsksargen)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XII (Soccsksargen)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Sarangani\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Glan Profile at PhilAtlas.com"
        ],
        [
            "Glan Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Glan Municipal Profile at the Province of Sarangani Official Website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2016-03-04 at the Wayback Machine"
        ],
        [
            "Places adjacent to Glan, Sarangani"
        ],
        [
            "Malapatan"
        ],
        [
            "Maasim / Sarangani Bay"
        ],
        [
            "Glan"
        ],
        [
            "Jose Abad Santos, Davao Occidental"
        ],
        [
            "Celebes Sea"
        ],
        [
            "vte Province of SaranganiAlabel (capital)Municipalities"
        ],
        [
            "Alabel"
        ],
        [
            "Glan"
        ],
        [
            "Kiamba"
        ],
        [
            "Maasim"
        ],
        [
            "Maitum"
        ],
        [
            "Malapatan"
        ],
        [
            "Malungon"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Glan,_Sarangani&oldid=1215231188\""
        ],
        [
            "Category: Municipalities of SaranganiHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Maguindanaon-language textArticles containing Tagalog-language textWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}