{
    "name": "Goa",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Goa, Camarines Sur"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsŚlůnskiSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°41′54″N 123°29′20″E﻿ / ﻿13.6983°N 123.4889°E﻿ / 13.6983; 123.4889"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Camarines Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Goa, Camarines Sur\" – news · newspapers · books · scholar · JSTOR (November 2016) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bicol Region, PhilippinesGoaMunicipalityMunicipality of GoaMunicipal Hall"
        ],
        [
            "FlagMap of Camarines Sur with Goa highlightedOpenStreetMapGoaLocation within the PhilippinesCoordinates: 13°41′54″N 123°29′20″E﻿ / ﻿13.6983°N 123.4889°E﻿ / 13.6983; 123.4889CountryPhilippinesRegionBicol RegionProvinceCamarines SurDistrict"
        ],
        [
            "4th districtFounded1777Barangays34"
        ],
        [
            " (see Barangays)Government  • TypeSangguniang Bayan • MayorMarcel S. Pan • Vice MayorAlfredo P. Gonzaga III • RepresentativeArnulf Bryan B. Fuentebella • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Antolin P. RespallHanna-Len I. BroquezaMarcel Michael P. PanPinky A. PuntualNemia B. LimProtacio C. Pena Jr.Amiel O. BellezaEly B. Cariño"
        ],
        [
            " • Electorate39,926 voters (2022)Area • RevenuePHP ₱ 231.8 million (2020) • Assets₱ 631.9 million (2020) • Expenditure₱ 189 million (2020) • Liabilities₱ 214.9 million (2020)Service provider • ElectricityCamarines Sur 4 Electric Cooperative  (CASURECO 4)Time zoneUTC+8 (PST)ZIP code4422PSGC051715000IDD : area code +63 (0)54Native languagesCentral BikolTagalogWebsitewww.goa.gov.ph"
        ],
        [
            "Goa, officially the Municipality of Goa (Central Bikol: Banwaan kan Goa; Tagalog: Bayan ng Goa), is a 1st class municipality in the province of Camarines Sur, Philippines.",
            "According to the 2020 census, it has a population of 71,368 people."
        ],
        [
            "The current municipal mayor is Marcel Pan, succeeded Racquel Lim."
        ],
        [
            "History"
        ],
        [
            "The town of Goa was originally situated at Barangay Salog which was then known as “Visita de Salog”, comprising the barrios of Lalud (now known as barangay Salog), Himagaan, Matacla, and Payatan.",
            "Lalud is found along the banks of Cagaycay River and is about five kilometers away from the present site of the town center."
        ],
        [
            "The “Visita” was established in 1701 by Franciscan Missionary Fr.",
            "Matias de Valdesoto and was attached to the parish of Manguiring, Calabanga.",
            "By 1729, it was declared independent and was later converted into a pueblo.",
            "The settlement center was later transferred to the present site because a disastrous flood swept the houses down the river and the inhabitants needed more land for planting.",
            "The original settlers found in the new site a wide stretch of plain land with brooks and rivers.",
            "There were scattered areas of swampland where 'gajo, a native slender cane plant the locals used for arrow shafts, grow in wild profusion."
        ],
        [
            "In 1777, Franciscan Friar Fr.",
            "Juan Abalay, from the Portuguese colony of Goa, came to administer the parish.",
            "It was on his arrival that the village was converted into a town with the official name of Pueblo de Goa.",
            "Fr.",
            "Abalay was instrumental in naming the town Goa, motivated presumably for two reasons: to perpetuate the memory of his birthplace and to give official confirmation to the name which the place has been known for some time corrupted allegedly by the Spaniards from “gajo”."
        ],
        [
            "On arrival, Fr.",
            "Abalay found Gregorio de los Reyes as Pueblo Headman and Santiago Evangelista, Juan de los Santos, Pedro Paraiso, Francisco Jacinto, Andres de la Trinidad and Lucas Delfin as council members.",
            "Fr.",
            "Abalay named Pedro de los Reyes son of the reigning Headman, “Cabeza de Barangay” in the cabeseria De Barangay del Pueblo De Goa.",
            "The German traveler, Feodor Jagor, found Goa a thriving municipality in 1863 when he scouted for guides who could accompany him climb Mount Isarog.",
            "In about the same year, the parish started the gigantic project of building a stone church and convent.",
            "The church, of Roman Gothic design and the convent, half stone and half wood, were completed in 1887.",
            "It took almost two decades of hard labor and involved every man, woman and child who was old enough to carry a piece of stone (known as cellar) to finish the project.",
            "A school building of stone was constructed soon across the street on the right side of the convent, to house the classes of the “Primera Enseñanza”.",
            "Another structure of the Segunda Enseñanza was added about the time the Revolution broke out in 1896."
        ],
        [
            "For the duration of the revolution and until the arrival of the Americans in 1900, Goa was governed by a local detachment of the revolutionary forces.",
            "The inhabitants called this period “Gobierno Filipino”.",
            "They elected the first “Presidente” upon the implementation of the Maura Law.",
            "Jose Perfecto, headed the civil authorities with the “Cabezas de Barangay”, the past “Capitanes Municipales” serving as the local town council."
        ],
        [
            "Laureano Pan was the first to serve as the local executive (1901-1903) in Goa during the American occupation.",
            "The establishment of the first American school was hastened by the unexpected capture of “Commandante” Faustino Perfecto, in-charge of a contingent of KKK troops stationed at Panagan River, by the American troops on the road to Naga.",
            "The American school opened in 1902 with Samuel D. Broadley as the supervising teacher.",
            "The first three American teachers were Stickney, Cappage, and Tabor, a colored American.",
            "Evidently, the Americans realized as early as then, the strategic location and prominence of the town in Partido area.",
            "From 1904 up to the end of the decade, Goa was one of only four places in Ambos Camarines with intermediate classes up to grade seven.",
            "The others were Nueva Caceres (Naga City), Daet and Iriga.",
            "The national road connecting Goa to Naga via Anayan was constructed in 1917.",
            "It was also in 1917 when the construction of the Municipal Hall was started which was completed in 1922.",
            "With the first automobile that traveled the Naga-Partido road, modernization slowly flowed in.",
            "In 1925, Jose Centenera, installed the first electric generator that lighted the town until the Japanese occupation.",
            "In the same year, he also opened a movie house, which featured serialized silent movies.",
            "In 1926, Goa had a modern concrete market pavilion and abattoir to replace the old market building."
        ],
        [
            "The traditional Open Market day on Sunday, was initiated in 1945, though this is no longer true today since as the trade and commercial center in the 3rd District of Camarines Sur, every day is already a market day.",
            "It was also in 1946 that Goa donated parcels of land to the Province of Camarines Sur for the establishment of Partido High School (converted to Partido National High School, then to Partido State College and now as Partido State University).",
            "Telecommunication service by telegraph was provided in 1950.",
            "The Goa Civic Square, an open park surrounded by huge acacia trees where the locals of Goa held almost all public activities – from amateur singing contest to political fora, benefit dances, fiesta celebrations, summer basketball competitions, etc., was constructed between 1952 and 1954.",
            "Next was the construction of the ABC Building between 1968 and 1971 under ABC President Alberto A. Din.",
            "The Camp Jovi Fuentebella in Lamon became the National Jamboree site in 1983.",
            "There was a trend of constructing covered basketball courts in majority of the municipalities in the country in the early nineties.",
            "By 1993, the Goa Civic Square was converted to become the covered Goa Sports Complex that now exists in front of the Goa Municipal Hall."
        ],
        [
            "On January 30, 1986, Mayor Lorenzo Padua was campaigning for President Ferdinand Marcos during the 1986 Philippine presidential election on his motorcycle when he was assassinated by the unknown gunmen."
        ],
        [
            "Geography"
        ],
        [
            "Goa is bounded by the Municipality of Tinambac on the west, Municipalities of Tinambac and Lagonoy on the north, by Municipalities of Tinambac and Tigaon on the south, by Municipalities of San Jose and Lagonoy on the east."
        ],
        [
            "Goa has a total land area of 20,618 hectares (50,950 acres) or about 3.99% of the province' land area.",
            "Its distance from the nearest municipality, San Jose, is 3 kilometres (1.9 mi), the Capital Town of Pili is 37 kilometres (23 mi), while Naga City is 52 kilometres (32 mi).",
            "Furthermore, Goa's distance from Manila via Daet, Camarines Norte, is about 500 kilometres (310 mi) and via Quirino Highway is approximately 380 kilometres (240 mi)."
        ],
        [
            "Barangays"
        ],
        [
            "Goa is politically subdivided into 34 barangays.",
            "Each barangay consists of puroks or Zones and some have sitios."
        ],
        [
            "Currently, there are 10 of which located within the poblacion/urban area and the remaining are considered rural barangays.",
            "The largest barangay is Hiwacloy having an area of 1,818.87 hectares (4,494.5 acres) and the farthest barangay is Tamban which is about 28 kilometres (17 mi) from the poblacion area."
        ],
        [
            "Abucayan"
        ],
        [
            "Bagumbayan Grande (Poblacion)"
        ],
        [
            "Bagumbayan Pequeño (Poblacion)"
        ],
        [
            "Balaynan"
        ],
        [
            "Belen (Poblacion)"
        ],
        [
            "Buyo"
        ],
        [
            "Cagaycay"
        ],
        [
            "Catagbacan"
        ],
        [
            "Digdigon"
        ],
        [
            "Gimaga"
        ],
        [
            "Halawig-Gogon"
        ],
        [
            "Hiwacloy"
        ],
        [
            "La Purisima (Poblacion)"
        ],
        [
            "Lamon"
        ],
        [
            "Matacla"
        ],
        [
            "Maymatan"
        ],
        [
            "Maysalay"
        ],
        [
            "Napawon"
        ],
        [
            "Panday (Poblacion)"
        ],
        [
            "Payatan"
        ],
        [
            "Pinaglabanan"
        ],
        [
            "Salog"
        ],
        [
            "San Benito (Poblacion)"
        ],
        [
            "San Isidro West"
        ],
        [
            "San Isidro (Poblacion)"
        ],
        [
            "San Jose (Poblacion)"
        ],
        [
            "San Juan Bautista (Poblacion)"
        ],
        [
            "San Juan Evangelista (Poblacion)"
        ],
        [
            "San Pedro (formerly Aroro)"
        ],
        [
            "Scout Fuentebella (West)"
        ],
        [
            "Tabgon"
        ],
        [
            "Tagongtong"
        ],
        [
            "Tamban (Mabini)"
        ],
        [
            "Taytay"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Goa, Camarines Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "33(91)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(83)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "82.88(3.26)"
        ],
        [
            "137.93(5.43)"
        ],
        [
            "63.69(2.51)"
        ],
        [
            "78.31(3.08)"
        ],
        [
            "229.42(9.03)"
        ],
        [
            "288.31(11.35)"
        ],
        [
            "280.99(11.06)"
        ],
        [
            "112.39(4.42)"
        ],
        [
            "210.87(8.30)"
        ],
        [
            "599.07(23.59)"
        ],
        [
            "194.80(7.67)"
        ],
        [
            "454.30(17.89)"
        ],
        [
            "2,732.96(107.59)"
        ],
        [
            "Average rainy days"
        ],
        [
            "24"
        ],
        [
            "28"
        ],
        [
            "18"
        ],
        [
            "20"
        ],
        [
            "24"
        ],
        [
            "29"
        ],
        [
            "31"
        ],
        [
            "27"
        ],
        [
            "27"
        ],
        [
            "30"
        ],
        [
            "29"
        ],
        [
            "31"
        ],
        [
            "318"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of GoaYearPop.±% p.a.1903 8,988—    1918 11,091+1.41%1939 13,411+0.91%1948 13,487+0.06%1960 24,663+5.16%1970 32,516+2.80%1975 34,049+0.93%1980 36,254+1.26%1990 39,888+0.96%1995 43,206+1.51%2000 48,490+2.50%2007 54,035+1.50%2010 58,503+2.93%2015 63,308+1.51%2020 71,368+2.38%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Goa, Camarines Sur, was 71,368 people, with a density of 350 inhabitants per square kilometre or 910 inhabitants per square mile."
        ],
        [
            "While the population of Partido District grew at irregular paces during the decade, Goa has consistently to be the second most highly populated in the district next to Tinambac.",
            "In year 2000, the municipality has a population of 48,490 with a 14% share to the district's total population of 341,487.",
            "Meanwhile, Tinambac has the highest share of 15% to the district's population which is only a percent higher than of Goa."
        ],
        [
            "In 1995, Partido reached its highest growth rate of 2.58% but it dropped to 1.46% in year 2000.",
            "But Goa, on the other hand, showed a consistent average growth rate of 0.96% in 1990, 1.51% in 1995 and the highest rate of 2.50% in 2000.",
            "During the 2007 census, the municipality's population ballooned to 54,035."
        ],
        [
            "Isarog Agta Language"
        ],
        [
            "In 2010, UNESCO released its 3rd world volume of Endangered Languages in the World, where 3 critically endangered languages were in the Philippines.",
            "One of these languages in the Isarog Agta language which has an estimated speaker of 5 people in the year 2000.",
            "The language was classified as Critically Endangered, meaning the youngest speakers are grandparents and older, and they speak the language partially and infrequently and hardly pass the language to their children and grandchildren anymore.",
            "If the remaining 150 people do not pass their native language to the next generation of Isarog Agta people, their indigenous language will be extinct within a period of 1 to 2 decades."
        ],
        [
            "The Isarog Agta people live within the circumference of Mount Isarog, though only 5 of them still know their indigenous language.",
            "They are one of the original Negrito settlers in the entire Philippines.",
            "They belong to the Aeta people classification, but have distinct language and belief systems unique to their own culture and heritage."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Goa"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  33.90"
        ],
        [
            "2009  41.18"
        ],
        [
            "2012  27.47"
        ],
        [
            "2015  35.43"
        ],
        [
            "2018  28.56"
        ],
        [
            "2021  36.04"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Goa is a bustling commercial center in the Partido area.",
            "It has 2 shopping malls LCC Mall and 101 Shopping Center.",
            "It has several banks as well."
        ],
        [
            "It has 3 radio stations that broadcast all across Camarines Sur extending to some parts of Camarines Norte, and Albay, The 99.3 Kakampi Partido, 94.5 Favorite Music Radio, 87.7 Brigada News FM."
        ],
        [
            "Due to Goa's geography it has become a commercial center and also a stop for tourists going to Caramoan islands, Partido islands or Catanduanes."
        ],
        [
            "Infrastructure"
        ],
        [
            "Goa is accessible from Naga City through a one and half-hour drive along the Fuentebella Highway.",
            "Two bus companies including air conditioned vans and jeepneys regularly ply the route to Goa.",
            "Jeepneys and trimobiles that convey people and products to and from the poblacion provide access to interior barangays."
        ],
        [
            "All barangays are accessible through regular transportation services.",
            "Goa's road system spans a 117.435 kilometres (72.971 mi) network interconnecting the various barangays in the municipality.",
            "Presently, it has 26.35 kilometres (16.37 mi) of barangay roads, 54.1 kilometres (33.6 mi) of national roads, 27.35 kilometres (16.99 mi) of provincial roads and 9.36 kilometres (5.82 mi) of municipal roads.",
            "Majority of the roads however, are gravel roads (46.84 kilometres (29.11 mi)) particularly those at the barangay level.",
            "Meanwhile, 96.91% of the municipal roads are concreted.",
            "There are 38 bridges in the municipality with a total length of 435.60 meters.",
            "Of which, 74.52% were constructed by the DPWH, 14% by PEO, 9.64% by LGU and 1.84 by barangay administration."
        ],
        [
            "Electricity in Goa is provided by the local electric cooperative (CASURECO IV).",
            "In 2001, a total of 7,702 households are connected to the power cooperative energizing the 34 barangays of the municipality, however there still 2,316 households in the rural areas that are dependent on kerosene for lighting purposes"
        ],
        [
            "Environment protection"
        ],
        [
            "Goa's environment sector revolves on two aspects: the forest environment and the urban environment.",
            "The protection of the forest environment is presently being handled by the DENR through the Office of the Protected Area Superintendent for Mt.",
            "Isarog National Park.",
            "The LGU, together with NGO representatives, is a member of the Protected Area Management Board.",
            "Such representation ensures Goa's participation in the protection of its portion in Mount Isarog.",
            "The urban environment protection is covered by the municipality's Goa Ecological Waste Management Program (GEWAMP) which deals mainly in aspects of solid waste management, pollution control and monitoring of toxic emissions from industries.",
            "The GEWAMP is equipped with heavy equipment transport utilities which regularly collect solid waste in commercial areas and urban barangays.",
            "The collected garbage is being dumped in a 16-hectare controlled dump site in San Isidro West located 11 kilometers away from the town proper."
        ],
        [
            "Healthcare"
        ],
        [
            "Hospitals/Clinics:"
        ],
        [
            "St. John Hospital - San Jose St., Goa, Camarines Sur"
        ],
        [
            "Goa Municipal Infirmary - Barangay Tagongtong (Temporary Location / beside PNP Headquarters)"
        ],
        [
            "Rural Health Unit 1 - Burgos Street, Goa, Camarines Sur"
        ],
        [
            "Sales Maternity Clinic & Lying In - Borja Street, Goa, Camarines Sur"
        ],
        [
            "St. Gerard Majela Lying In Clinic - Halawig-gogon, Goa, Camarines Sur"
        ],
        [
            "Radio Communications Group / First Responders"
        ],
        [
            "This Municipality has different radio operators in town, some of them are illegal operators, some are licensed hams and with ROC issued by the National Telecommunications Commission."
        ],
        [
            "146.225 MHz - REACT KABALIKAT"
        ],
        [
            "144.540 MHz - DX4PR (Partido Enthusiasts Amateur Radio League, Inc.)"
        ],
        [
            "147.380 MHz - KABALIKAT CiviC-Communicators 160 Chapter (Partido Area)"
        ],
        [
            "145.580 MHz - Illegal habitat and modulation of commercial radio operators in Bicol Region.",
            "(As per NTC-RFAT, 144.000 MHz to 146.000 MHz frequency range belongs to all ham/amateur licensed radio users.)"
        ],
        [
            "Education"
        ],
        [
            "This municipality has different secondary and tertiary schools accredited by the Commission on Higher Education, the Technical Education and Skills Development Authority, the Department of Education, and the Department of Science and Technology."
        ],
        [
            "The town of Goa is also the home of the premier high school in the whole Bicol region, the Philippine Science High School Bicol Region Campus at Barangay Tagontong.",
            "PSHS-BRC is one of the campuses of the PSHS system."
        ],
        [
            "Tertiary schools"
        ],
        [
            "Partido State University - (formerly Partido High School, Partido National High School and Partido State College)- San Juan Bautista St., Goa, Camarines Sur"
        ],
        [
            "Worldtech Resources Institute (WRI Partido Branch) - Rizal Street, Goa, Camarines Sur"
        ],
        [
            "Partido College (College Department) - Tambuco St., Goa, Camarines Sur"
        ],
        [
            "Global IT - Rizal St., Goa, Camarines Sur"
        ],
        [
            "Fatima School of Science and Technology - San Juan Bautista St., Goa, Camarines Sur"
        ],
        [
            "Goa Community College - La Purisima St., Goa, Camarines Sur"
        ],
        [
            "Secondary schools"
        ],
        [
            "Goa National High School - Taytay, Goa, Camarines Sur"
        ],
        [
            "Goa Science High School - Tagongtong, Goa, Camarines Sur"
        ],
        [
            "New Partido High School - Catagbacan, Goa, Camarines Sur"
        ],
        [
            "Payatan National High School - Payatan, Goa, Camarines Sur"
        ],
        [
            "Visita de Salog High School - Salog, Goa, Camarines Sur"
        ],
        [
            "Juan L. Filipino Memorial High School - Buyo, Goa, Camarines Sur"
        ],
        [
            "Pinaglabanan National High School - Pinaglabanan, Goa, Camarines Sur"
        ],
        [
            "Tabgon National High School - Tabgon, Goa, Camarines Sur"
        ],
        [
            "St. Paul Academy (Catholic School) - Delgado St., Goa Camarines Sur"
        ],
        [
            "Partido College (High School Department) - Tambuco St., Goa, Camarines Sur"
        ],
        [
            "Philippine Science High School Bicol Region Campus (PSHS-BRC) - Tagongtong, Goa, Camarines Sur"
        ],
        [
            "Media"
        ],
        [
            "Past broadcast media"
        ],
        [
            "HOT FM 103.9 (Radyo Natin FM National Network of Manila Broadcasting Company)"
        ],
        [
            "DWTP (Ang Tambuli kan Partido) - exist in 1994"
        ],
        [
            "107.1 DWRL-FM (Ang Radyo para sa Tawo)"
        ],
        [
            "96.9 DWFA FM RADIO AMIGO (Rinconada Broadcasting Corp.)"
        ],
        [
            "Rhythm FM 97.9 (Community Training Station 2006–2008)"
        ],
        [
            "105.5 Muews Radio (lately became Politician Broadcast Practice)"
        ],
        [
            "105.5 KISS FM \"More Music, More Variety\" 2008-2012 (Underground Radio Station)"
        ],
        [
            "105.7 Farm Radio \"Ang Radyong Kaserbisyo Mo\" A Non Political, Non Partisan Radio Station in Partido Area"
        ],
        [
            "102.3 WoW FM \"Ito ang Radyo ko\" 2015-2016 (Underground Radio Station)"
        ],
        [
            "100.9 KM Kakampi Mo - Naga Relay (Sorsogon Broadcasting Corporation)"
        ],
        [
            "100.9 Partido News FM"
        ],
        [
            "Existing Broadcast Media"
        ],
        [
            "94.5 Radyo Partido FMR (Philippine Collective Media Corporation)"
        ],
        [
            "103.3 Partido State University - Campus Radio"
        ],
        [
            "87.7 Brigada News FM Partido (Relay Station)"
        ],
        [
            "99.3 Kakampi Partido (Subic Broadcasting Corporation)"
        ],
        [
            "103.7 KISS FM - \"Ang Bagong Tambayan sa FM\" (Amapola Broadcasting System)"
        ],
        [
            "Low Power Broadcast Media"
        ],
        [
            "96.5 The Bee - Independent Radio Broadcasting"
        ],
        [
            "88.8 Mart FM - Pasay Road Matacla"
        ],
        [
            "Internet Streaming Broadcast"
        ],
        [
            "Cool FM Hits - Data Base at Goa Town"
        ],
        [
            "Isarog Radio Broadcast - Data Base Goa Town"
        ],
        [
            "Classic Radio - Your Home, Your Music - Database at Goa, Camarines Sur"
        ],
        [
            "Kaserbisyo Mo - News & Music"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Goa |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Goa, Camarines Sur: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved October 29, 2017."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Camarines Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Goa, Camarines Sur."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Standard Geographic Code Archived February 18, 2017, at the Wayback Machine"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Official Website of the Province of Camarines Sur Archived April 12, 2007, at the Wayback Machine"
        ],
        [
            "Places adjacent to Goa, Camarines Sur"
        ],
        [
            "Tinambac"
        ],
        [
            "Lagonoy"
        ],
        [
            "Calabanga"
        ],
        [
            "Goa"
        ],
        [
            "San Jose"
        ],
        [
            "Mount Isarog"
        ],
        [
            "Tigaon"
        ],
        [
            "vte Province of Camarines SurPili (capital)  Naga (largest city)Municipalities"
        ],
        [
            "Baao"
        ],
        [
            "Balatan"
        ],
        [
            "Bato"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Caramoan"
        ],
        [
            "Del Gallego"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Goa"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Lupi"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Nabua"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "Presentacion"
        ],
        [
            "Ragay"
        ],
        [
            "Sagñay"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Component city"
        ],
        [
            "Iriga"
        ],
        [
            "Independent component city"
        ],
        [
            "Naga (Administratively independent from the province but grouped under Camarines Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Goa,_Camarines_Sur&oldid=1228132918\""
        ],
        [
            "Category: Municipalities of Camarines SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Articles needing additional references from November 2016All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Central Bikol-language textArticles containing Tagalog-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}