{
    "name": "Guagua",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Guagua"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°58′N 120°38′E﻿ / ﻿14.97°N 120.63°E﻿ / 14.97; 120.63"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pampanga, Philippines"
        ],
        [
            "For other uses, see Guagua (disambiguation)."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Guagua\" – news · newspapers · books · scholar · JSTOR (December 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesGuagua"
        ],
        [
            "UauaMunicipalityMunicipality of GuaguaDowntown area"
        ],
        [
            "FlagMap of Pampanga with Guagua highlightedOpenStreetMapGuaguaLocation within the PhilippinesCoordinates: 14°58′N 120°38′E﻿ / ﻿14.97°N 120.63°E﻿ / 14.97; 120.63CountryPhilippinesRegionCentral LuzonProvincePampangaDistrict"
        ],
        [
            "2nd districtFoundedMay 15, 1590Barangays31"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAnthony Joseph S. Torres • Vice MayorBenjamin L. Lim Jr. • RepresentativeGloria Macapagal Arroyo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Joan M. CarreonRoanne Leonila R. EnriquezMichelle R. CorpuzMichael C. MagilimanAmos R. GuilasJovy D. TulioEugene Paul E. PonioHomer D. Garcia"
        ],
        [
            " • Electorate64,500 voters (2022)Area • Revenue₱ 375.3 million (2020) • Assets₱ 602.7 million (2020) • Expenditure₱ 312.3 million (2020) • Liabilities₱ 180.2 million (2020)Service provider • ElectricityPampanga 2 Electric Cooperative (PELCO 2)Time zoneUTC+8 (PST)ZIP code2003PSGC0305407000IDD : area code +63 (0)45Native languagesKapampangan TagalogWebsitewww.guagua.gov.ph"
        ],
        [
            "Guagua, officially the Municipality of Guagua (Kapampangan: Balen ning Guagua; Tagalog: Bayan ng Guagua), is a 1st class municipality in the province of Pampanga, Philippines.",
            "According to the 2020 census, it has a population of 128,893 people."
        ],
        [
            "Etymology"
        ],
        [
            "Wawa, which means \"river mouth\" (Kapampangan: alua or bukana), was the earliest recorded form of the town's name according to records dating back to 1590.",
            "The town is strategically located along a river which played a vital role in trade and transportation during the precolonial era."
        ],
        [
            "Wawa was already a prosperous settlement when Spanish colonists took control of the town in the year 1561, from then on calling it Guagua, which is a Hispanised form of the original name.",
            "Indeed, archeological artifacts have been excavated in a nearby town which affirmed the existence of a prehistoric community in Guagua."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Early inhabitants opted to stay in the town because it was here that they could engage in barter trade with people from different islands, along with other means of livelihood like fishing and farming.",
            "The navigable river with which the town was endowed allowed shipping vessels to transport commodities to and from other chief localities, particularly the imperial Manila."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "The first cargo boat to arrive in Guagua was the Doña Dominga on May 7, 1884.",
            "Much later it was followed by the steamships Kaibigan and Kababayan, which anchored at the pier in Bgy Santo Niño, better known as the Yañgco Landing."
        ],
        [
            "In 1892, when the Manila–Mabalacat railroad was inaugurated, Guagua was virtually the port of embarkation to and from Manila that served the province.",
            "The Chinese have long been part in Guagua's social and economic mainstream."
        ],
        [
            "In the 18th century, they sought refuge in the town to escape discrimination and persecution in Manila.",
            "After their near-total slaughter, the Chinese lived in relative peace while they freely practiced their craft and mingled hand-in-hand with the local residents.",
            "The Chinese residents were merchants, masons, woodcarvers, carpenters, agriculturists and labourers.",
            "Their influence on the cultural and economic life of Guagua cannot be overlooked.",
            "The town could not have prospered so well without the economic services provided by the Chinese."
        ],
        [
            "The town took significant part in the revolutionary struggles against the foreign intruders.",
            "A house near a church was made a secret cell of the Katipuneros in August 1897."
        ],
        [
            "In March 1898, a massacre of all Spanish sympathisers in Guagua marked the end of Spanish colonialism and the outset of American rule.",
            "Moreover, during the Philippine–American War and the ensuing Second World War, Guagua became an important battleground."
        ],
        [
            "American invasion era"
        ],
        [
            "At the turn of the twentieth century, a new system of education was introduced and made popular and available to the Filipinos.",
            "The Guagua Elementary School in Barangay Santa Filomena, is believed to be the first to be established in the town in the year 1901.",
            "Later in that year, an English teacher came to Betis district and opened a primary school which functioned on a regular basis.",
            "During that period, the town of Betis to the east was abolished, turning into a township of Guagua."
        ],
        [
            "In 1908, Colegio del Sagrado Corazón de Jesús (now Saint Mary's Academy) in Barangay San Roque was established in a two-storey building in downtown, donated by a charitable matron."
        ],
        [
            "Commerce was further improved when the San Fernando–Guagua line of the railroad was chartered on November 17, 1907."
        ],
        [
            "Later in 1918, Guagua National Institute (now Guagua National Colleges) in Barangay Santa Filomena was founded in the convento of the local church.",
            "Further, in 1941, the then-parish priest felt the need for another high school in town, so he opened Saint Michael's College."
        ],
        [
            "Philippine independence"
        ],
        [
            "In November 1959, nine rural barrios (now barangays) of Guagua were granted a 50-year electrification franchise, with the electricity provided by the National Power Corporation."
        ],
        [
            "At the overthrow of the Marcos dictatorship in 1986, the local government carried out a sustainable development program to address the town's destitute state.",
            "From its income classification in 1986 as a third-class municipality, Guagua grew to a first-class one.",
            "Guagua garnered several outstanding citations for its achievement, including of several \"Most Outstanding LGU\" awards."
        ],
        [
            "Guagua was severely devastated by the eruption of Mount Pinatubo in 1991."
        ],
        [
            "Geography"
        ],
        [
            "Guagua is bounded on the north by the towns of Bacolor and Santa Rita; on the south by the towns of Sasmuan and Lubao; on the east, Macabebe and Sasmuan; and on the west, Porac and Floridablanca."
        ],
        [
            "It is 10 kilometres (6.2 mi) from the capital city of San Fernando, 27 kilometres (17 mi) from Angeles City, and 76 kilometres (47 mi) from Metro Manila."
        ],
        [
            "Topography"
        ],
        [
            "The town is mostly flat and is suitable to any kind of development; agricultural, industrial, commercial and others.",
            "It is only a meter above sea level."
        ],
        [
            "Soil type"
        ],
        [
            "In general, the soils of Guagua are of recent alluvial origin consisting of fine sand, silt loam and hydrosol.",
            "The average chemical analysis of its top soils is : nitrogen, 0.02 to 0.1; phosphorus, 0.06 to 0.28; potassium, 0.46 to 1.74; organic carbon, 0.41 to 3.02; and pH value (acidity and alkalinity), 5.61 to 6.99."
        ],
        [
            "Flora and fauna"
        ],
        [
            "The climate and topographical features of the vast land of Guagua make it ideal for the growing of fruit trees and vegetables.",
            "Among the fruit trees most fitting to be planted are mangoes, guavas, santol, star apples, and bananas.",
            "For vegetables, sitao, upo, ampalaya, gabi and cucumber are the most commonly produced by farmers and which thrive best in the community."
        ],
        [
            "Being void of forest areas, its fauna are mostly the domesticated ones like, chicken, ducks, cattle, and others."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Guagua, Pampanga"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "8(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "15(0.6)"
        ],
        [
            "34(1.3)"
        ],
        [
            "138(5.4)"
        ],
        [
            "203(8.0)"
        ],
        [
            "242(9.5)"
        ],
        [
            "233(9.2)"
        ],
        [
            "201(7.9)"
        ],
        [
            "126(5.0)"
        ],
        [
            "50(2.0)"
        ],
        [
            "21(0.8)"
        ],
        [
            "1,280(50.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.7"
        ],
        [
            "4.1"
        ],
        [
            "6.5"
        ],
        [
            "11.2"
        ],
        [
            "21.2"
        ],
        [
            "24.9"
        ],
        [
            "27.7"
        ],
        [
            "26.5"
        ],
        [
            "25.5"
        ],
        [
            "21.8"
        ],
        [
            "12.6"
        ],
        [
            "5.6"
        ],
        [
            "191.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Guagua is divided into four (4) districts, subdivided into 31 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Poblacion district"
        ],
        [
            "Bancal"
        ],
        [
            "Plaza Burgos"
        ],
        [
            "San Nicolas 1st"
        ],
        [
            "San Pedro"
        ],
        [
            "San Rafael"
        ],
        [
            "San Roque"
        ],
        [
            "Santa Filomena"
        ],
        [
            "Santo Cristo"
        ],
        [
            "Santo Niño"
        ],
        [
            "Pangulo district"
        ],
        [
            "San Vicente (Ebus)"
        ],
        [
            "Lambac"
        ],
        [
            "Magsaysay"
        ],
        [
            "Maquiapo"
        ],
        [
            "Natividad"
        ],
        [
            "Pulungmasle"
        ],
        [
            "Rizal"
        ],
        [
            "Ascomo"
        ],
        [
            "Jose Abad Santos (Siran)"
        ],
        [
            "Locion district"
        ],
        [
            "San Pablo"
        ],
        [
            "San Juan 1st"
        ],
        [
            "San Jose"
        ],
        [
            "San Matias"
        ],
        [
            "San Isidro"
        ],
        [
            "San Antonio"
        ],
        [
            "Betis district"
        ],
        [
            "San Agustin"
        ],
        [
            "San Juan Bautista"
        ],
        [
            "San Juan Nepomuceno"
        ],
        [
            "San Miguel"
        ],
        [
            "San Nicolas 2nd"
        ],
        [
            "Santa Ines"
        ],
        [
            "Santa Ursula"
        ],
        [
            "San Rafael was constituted from Dock Island in 1956."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of GuaguaYearPop.±% p.a.1903 15,151—    1918 15,962+0.35%1939 22,331+1.61%1948 34,738+5.03%1960 40,126+1.21%1970 58,270+3.80%1975 65,336+2.32%1980 72,609+2.13%YearPop.±% p.a.1990 88,290+1.97%1995 95,363+1.45%2000 96,858+0.33%2007 104,601+1.07%2010 111,199+2.25%2015 117,430+1.04%2020 128,893+1.85%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Guagua, Pampanga, was 128,893 people, with a density of 2,600 inhabitants per square kilometre or 6,700 inhabitants per square mile."
        ],
        [
            "Religion"
        ],
        [
            "Roman Catholic 88%, Iglesia ni Cristo 5%, Members Church of God International 3%, Seventh-day Adventists 2%, Others (Including Protestantism, Aglipayan, Buddhism, Islam and Other Religionist) 2%."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Guagua"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "9"
        ],
        [
            "2006  4.10"
        ],
        [
            "2009  7.44"
        ],
        [
            "2012  3.84"
        ],
        [
            "2015  7.73"
        ],
        [
            "2018  3.59"
        ],
        [
            "2021  8.40"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "1937 Town hall"
        ],
        [
            "The town of Guagua belongs to the Second district of Pampanga, along with the towns in the south-western part of the province.",
            "Like other towns in the Philippines, Guagua is governed by a mayor and vice mayor who are elected to three-year terms.",
            "The mayor is the executive head and leads the town's departments in executing the ordinances and improving public services.",
            "The vice mayor heads a legislative council (Sangguniang Bayan) consisting of councilors from the Barangays of Barrios."
        ],
        [
            "1937 Heritage Town hall"
        ],
        [
            "The seat of Government is vested upon the Mayor and other elected officers who hold office at the Town hall.",
            "The Sangguniang Bayan is the center of legislation."
        ],
        [
            "Education"
        ],
        [
            "Immaculate Concepcion Academy"
        ],
        [
            "St. Mary's Academy"
        ],
        [
            "Guagua National Colleges"
        ],
        [
            "For elementary and high school education, Guagua has numerous schools."
        ],
        [
            "Public"
        ],
        [
            "Bancal Elementary School"
        ],
        [
            "Betis Elementary School"
        ],
        [
            "Guagua Elementary School"
        ],
        [
            "San Agustin Elementary School"
        ],
        [
            "San Juan Nepomuceno Elementary School"
        ],
        [
            "San Miguel Elementary School"
        ],
        [
            "San Pedro Elementary School"
        ],
        [
            "San Rafael Elementary School"
        ],
        [
            "Santa Ines Elementary School"
        ],
        [
            "Santa Ursula Elementary School"
        ],
        [
            "Ascomo Elementary School"
        ],
        [
            "Lambac Elementary School"
        ],
        [
            "Magsaysay Elementary School"
        ],
        [
            "Maquiapo Elementary School"
        ],
        [
            "Mauli Elementary School"
        ],
        [
            "Natividad Elementary School"
        ],
        [
            "Pulungmasle Elementary School"
        ],
        [
            "Rizal Elementary School"
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "San Antonio Elementary School - San Isidro PS (Annex)"
        ],
        [
            "San Juan 1st Elementary School"
        ],
        [
            "San Matias Elementary School"
        ],
        [
            "San Vicente Elementary School"
        ],
        [
            "Siran Elementary School"
        ],
        [
            "Talang Elementary School"
        ],
        [
            "Guillermo D. Mendoza National High School"
        ],
        [
            "Betis National High School"
        ],
        [
            "Natividad NationalHigh School"
        ],
        [
            "Pulungmasle High School"
        ],
        [
            "Private"
        ],
        [
            "Natividad Adventist Elementary School"
        ],
        [
            "St. Mary's Academy of Guagua"
        ],
        [
            "Psalms Academy of Pampanga"
        ],
        [
            "EZEE Center for the Arts and School Inc."
        ],
        [
            "Mary the Queen College (Pampanga), Inc."
        ],
        [
            "Guagua National Colleges"
        ],
        [
            "Immaculate Conception Academy"
        ],
        [
            "St. Angela's Academy"
        ],
        [
            "Pulungmasle Ecumenical Learning Center"
        ],
        [
            "Maria Montessori School of Guagua"
        ],
        [
            "Landmarks and List of Cultural Properties"
        ],
        [
            "The town has interesting culture and heritage attractions and landmarks, including Rufino Santos Catholic Center, Capt.",
            "Ruben P. Sonco Freedom Square, Monument of Aurelio Tolentino (1867-1915).",
            "The Guagua National Colleges is also declared as a national historical landmark by the National Historical Commission of the Philippines during the college's 75th Foundation anniversary in 1993."
        ],
        [
            "Cultural Property wmph identifier"
        ],
        [
            "Site name"
        ],
        [
            "Description"
        ],
        [
            "Province"
        ],
        [
            "City or municipality"
        ],
        [
            "Address"
        ],
        [
            "Coordinates"
        ],
        [
            "Image"
        ],
        [
            "Saint James the Apostle Parish Church"
        ],
        [
            "declared a National Cultural Treasure by the National Museum of the Philippines"
        ],
        [
            "Pampanga"
        ],
        [
            "Guagua, Pampanga"
        ],
        [
            "Barangay San Nicolas II"
        ],
        [
            "14°58′32″N 120°38′35″E﻿ / ﻿14.975596°N 120.642936°E﻿ / 14.975596; 120.642936﻿ (Saint James the Apostle Parish Church)"
        ],
        [
            "Immaculate Conception Parish Church"
        ],
        [
            "18th-century Roman Catholic church, with marker from the National Historical Commission of the Philippines"
        ],
        [
            "Pampanga"
        ],
        [
            "Guagua, Pampanga"
        ],
        [
            "Barangay Plaza Burgos"
        ],
        [
            "14°57′53″N 120°38′03″E﻿ / ﻿14.964644°N 120.634049°E﻿ / 14.964644; 120.634049﻿ (Immaculate Conception Parish Church)"
        ],
        [
            "The Lopez Mansion (The Guagua Mansion)"
        ],
        [
            "Built in 1929 by the sugar magnate, Don Alejandro Lopez (b.",
            "May 16, 1883) of Guagua.",
            "It was coined as the first all-concrete house in Pampanga and in the 1935 telephone directory the house was named as “The Pride of Guagua Pampanga”.",
            "The Lopez Mansion was restored in 2016 to be an events venue and was renamed as The Guagua Mansion."
        ],
        [
            "Pampanga"
        ],
        [
            "Guagua, Pampanga"
        ],
        [
            "72 San Nicholas 1st"
        ],
        [
            "Guagua, Pampanga"
        ],
        [
            "14°58′07″N 120°38′03″E﻿ / ﻿14.968628°N 120.634161°E﻿ / 14.968628; 120.634161﻿ (The Lopez Mansion (The Guagua Mansion))"
        ],
        [
            "Goseco Ancestral House"
        ],
        [
            "Pampanga"
        ],
        [
            "Guagua, Pampanga"
        ],
        [
            "Barangay Plaza Burgos"
        ],
        [
            "14°57′52″N 120°38′04″E﻿ / ﻿14.964421°N 120.634447°E﻿ / 14.964421; 120.634447﻿ (Goseco Ancestral House)"
        ],
        [
            "Rizal Monument"
        ],
        [
            "Pampanga"
        ],
        [
            "Guagua, Pampanga"
        ],
        [
            "Barangay Plaza Burgos"
        ],
        [
            "14°57′57″N 120°37′59″E﻿ / ﻿14.965949°N 120.633126°E﻿ / 14.965949; 120.633126﻿ (Rizal Monument)"
        ],
        [
            "Guagua Municipal Hall"
        ],
        [
            "Built in 1937"
        ],
        [
            "Pampanga"
        ],
        [
            "Guagua, Pampanga"
        ],
        [
            "Barangay Plaza Burgos"
        ],
        [
            "14°57′54″N 120°38′01″E﻿ / ﻿14.965006°N 120.633609°E﻿ / 14.965006; 120.633609﻿ (Guagua Municipal Hall)"
        ],
        [
            "Santiago Apostol Parish Church"
        ],
        [
            "Main article: Betis Church"
        ],
        [
            "The 1607 Santiago Apostol Parish Church, commonly known as Betis Church is a Baroque (heritage) Church, located in Guagua, Pampanga (Betis Area).",
            "It is a Spanish-era church declared a National Cultural Treasure by the National Museum of the Philippines and the NCCA (under R.A. 4896 as amended by P.D.",
            "374 and R.A. 8492), on November 5, 2001 (one of only 26 churches in the country bestowed that honor).",
            "It is part of the Ecclesiastical Provinces of the Archdiocese of San Fernando.",
            "In 2009, the National Museum installed a marker of its 2005 Proclamation."
        ],
        [
            "Immaculate Conception Parish Church"
        ],
        [
            "Main article: Immaculate Conception Church (Guagua)"
        ],
        [
            "The first church edifice was constructed in 1587 but was unfortunately razed by fire.",
            "The current Church structure was constructed in 1772 under the administration of the Augustinians.",
            "The Church was greatly improved in 1862 until 1870.",
            "The interiors are simple and the centerpiece attraction is the main altar, a creation of noted local artist Willy Layug.",
            "While still simple, the exteriors on the other hand, are marked by massive strength.",
            "The Cathedral-type church is located immediately adjacent to the Guagua Municipal Building and houses the Cardinal Santos Catholic Center and the Immaculate Conception Parochial School."
        ],
        [
            "Notes"
        ],
        [
            "^ wmph is an internal identifier used by Wikimedia Philippines to identify the monument.",
            "This is not an official identifier, and only shown temporarily in the templates until the government creates an updated complete list."
        ],
        [
            "References"
        ],
        [
            "^ \"Guagua set to celebrate 427th founding anniversary\".",
            "SunStar.",
            "April 2, 2018.",
            "Archived from the original on December 23, 2018.",
            "Retrieved December 23, 2018."
        ],
        [
            "^  Municipality of Guagua |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Guagua town to get power\".",
            "The Manila Times.",
            "The Manila Times Publishing Company, Inc. November 6, 1959. p. 2-A.",
            "The barrios to be served are San Matias, San Jose, Natividad, Ebus, Lambac, Pulungmasle, Maquiapo, Rizal and Siram."
        ],
        [
            "^ \"Guagua: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Archived from the original on March 27, 2022.",
            "Retrieved May 5, 2020."
        ],
        [
            "^ \"An Act Creating the Barrio of San Rafael in the Municipality of Guagua, Province of Pampanga\".",
            "LawPH.com.",
            "Archived from the original on July 23, 2012.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Baroque Catholic Church - Cultural Heritage Travel Guide | Philippine Islands Travel Guide\".",
            "Archived from the original on March 6, 2012.",
            "Retrieved November 12, 2012."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Guagua, Pampanga."
        ],
        [
            "Guagua Profile at PhilAtlas.com"
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived March 4, 2016, at the Wayback Machine"
        ],
        [
            "Places adjacent to Guagua"
        ],
        [
            "Porac"
        ],
        [
            "Santa Rita"
        ],
        [
            "Bacolor"
        ],
        [
            "Floridablanca"
        ],
        [
            "Guagua"
        ],
        [
            "Lubao / Sasmuan"
        ],
        [
            "Minalin"
        ],
        [
            "vte Province of PampangaSan Fernando (capital)  Angeles City (largest city)Municipalities"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Candaba"
        ],
        [
            "Floridablanca"
        ],
        [
            "Guagua"
        ],
        [
            "Lubao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Masantol"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Porac"
        ],
        [
            "San Luis"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Component cities"
        ],
        [
            "Mabalacat"
        ],
        [
            "San Fernando"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Angeles (Administratively independent from the province but grouped under Pampanga by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Guagua&oldid=1222672041\""
        ],
        [
            "Category: Municipalities of PampangaHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from December 2012All articles needing additional referencesUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Coordinates on WikidataPages using infobox settlement with possible demonym listArticles containing Kapampangan-language textArticles containing Tagalog-language textCommons category link from WikidataOfficial website different in Wikidata and WikipediaWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}