{
    "name": "Guiguinto",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Guiguinto"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSimple EnglishSvenskaTagalogاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°50′N 120°53′E﻿ / ﻿14.83°N 120.88°E﻿ / 14.83; 120.88"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bulacan, Philippines"
        ],
        [
            "Municipality in Central Luzon, PhilippinesGuiguintoMunicipalityMunicipality of GuiguintoMunicipal Hall"
        ],
        [
            "FlagNickname: Garden Haven Of BulacanMotto: Sugod Makabagong Guiguinto!Map of Bulacan with Guiguinto highlightedOpenStreetMapGuiguintoLocation within the PhilippinesCoordinates: 14°50′N 120°53′E﻿ / ﻿14.83°N 120.88°E﻿ / 14.83; 120.88CountryPhilippinesRegionCentral LuzonProvinceBulacanDistrict"
        ],
        [
            "5th districtFoundedJanuary 1, 1915Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAgatha Paula A. Cruz • Vice MayorBanjo S. Estrella • RepresentativeAmbrosio C. Cruz Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Estrelita P. AballaAlbert L. EstrellaRicardo B. JoseLarra Monica V. MarianoJulius V. FigueroaAnnabelle A. GarciaRandall B. PingolCornelio C. Ramos"
        ],
        [
            " • Electorate75,003 voters (2022)Area • Revenue₱ 650.4 million (2020) • Assets₱ 1,137 million (2020) • Expenditure₱ 553.5 million (2020) • Liabilities₱ 440.5 million (2020)Utilties • ElectricityMeralcoTime zoneUTC+8 (PST)ZIP code3015PSGC031408000IDD : area code +63 (0)44Native languagesTagalogWebsiteguiguinto.gov.ph"
        ],
        [
            "Guiguinto, officially the Municipality of Guiguinto (Tagalog: Bayan ng Guiguinto),  is a first class municipality in the province of Bulacan, Philippines.",
            "According to the 2020 census, it has a population of 113,415 people.",
            "It is 34 kilometers (21 mi) from Manila and 11 kilometers (6.8 mi) from Malolos City."
        ],
        [
            "With the continuous expansion of Metro Manila, Guiguinto is part of Manila's built-up area which reaches San Ildefonso, Bulacan at its northernmost part."
        ],
        [
            "It is the birthplace of composer Constancio De Guzman, known for writing songs like \"Maalaala Mo Kaya\".",
            "It also houses the Immaculate Conception Seminary, a Diocesan Seminary of the Diocese of Malolos located in barangay Tabe.",
            "The appellation “Guiguinto” literally translates to “Gold” (ginto for Tagalog, gintu for Kapampangan) for the early conquistadores came and saw this town on a harvest season when it lushes in golden rice stalks against the sun."
        ],
        [
            "History"
        ],
        [
            "Guiguinto began as a barrio of Bulakan, the former provincial capital of Bulacan.",
            "It is said that Spaniards set up an army post in the barrio to serve as a resting place for forces going to Northern Luzon.",
            "In those days, travel throughout Guiguinto was difficult and slow down to cross single file over a narrow bamboo bridge.",
            "Their Filipino guides would cry out, \"Hinto\" (Tagalog for stop).",
            "The Spaniards thought this was the name \"Hihinto\".",
            "The Spaniards substituted \"Gui\" (with hard \"g\") for the Tagalog \"Hi\".",
            "The place has since been called Guiguinto.",
            "Because the city is a farm area and the whole land looks like gold when it is harvest season of ricegrains that is why it was called Guiguinto, from the Tagalog word \"Ginto\" or Gold in English or will become a golden city in the future or \"Giginto\" or \"Will turn into Gold\".",
            "On the other hand, old timers say that on moonlight nights, a golden bull emerges from the church and goes down to the nearby river to quench his thirst.",
            "It then returns to the church, ascends at the altar and disappears.",
            "The elders' aid that there are buried jars of gold in town, as indicated by the bull, and that is why the town was called Guiguinto.",
            "It became an encomienda in the 1591 but the ecclesiastical administration was under Bulakan Convent and it was established as a town in 1641."
        ],
        [
            "In 1800, an Augustinian friar erected a small chapel in what is now barrio Santa Rita.",
            "In 1873, roads were constructed in barrio Malis.",
            "The people barrios of Pritil, Tabe, and Cutcut even those days were mostly farmers.",
            "During Holy Week, villagers of barrio Tuktukan held contest for the hardest egg shells (chicken, duck or goose by knocking eggs together (Tuktukan)).",
            "The women tried to help each other in singing the \"Panica\"."
        ],
        [
            "Just before the outbreak of the revolution of 1896, the town people of Guiguinto were ordered to sleep in the town at night and to work in their fields only in the day.",
            "This was said to have been suggested by the town priest to the authorities because of rumors that many of the town people were joining the secret revolutionary society, the Katipunan.",
            "Guiguinto eventually contributed many soldiers to the 1896 revolution."
        ],
        [
            "At the time of American occupation, the new colonizers reorganized the Province of Bulacan into 19 municipalities from the original 26.",
            "Under populated town were subordinated with the large one and the town of Guiguinto was integrated in the town of Bulakan for almost 11 years.",
            "In 1915, Guiguinto regain its township again with Antonio Figueroa as its municipal mayor of the modern period.",
            "The town's population was then about 4,000.",
            "The 1960 census placed Guiguinto's population at 10,629.",
            "Guiguinto is bounded on the east by the town of Balagtas, on the west by Malolos City, on the north by Plaridel, and on the south by Bulacan."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Guiguinto is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 031408001   Cutcut"
        ],
        [
            " 2.6%"
        ],
        [
            " 2,940"
        ],
        [
            " 2,701"
        ],
        [
            "  ▴"
        ],
        [
            " 0.85%"
        ],
        [
            " 031408002   Daungan"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,800"
        ],
        [
            " 1,384"
        ],
        [
            "  ▴"
        ],
        [
            " 2.66%"
        ],
        [
            " 031408003   Ilang‑Ilang"
        ],
        [
            " 5.0%"
        ],
        [
            " 5,628"
        ],
        [
            " 4,436"
        ],
        [
            "  ▴"
        ],
        [
            " 2.41%"
        ],
        [
            " 031408004   Malis"
        ],
        [
            " 14.3%"
        ],
        [
            " 16,223"
        ],
        [
            " 13,957"
        ],
        [
            "  ▴"
        ],
        [
            " 1.52%"
        ],
        [
            " 031408005   Panginay"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,528"
        ],
        [
            " 1,159"
        ],
        [
            "  ▴"
        ],
        [
            " 2.80%"
        ],
        [
            " 031408006  Poblacion"
        ],
        [
            " 3.6%"
        ],
        [
            " 4,099"
        ],
        [
            " 3,852"
        ],
        [
            "  ▴"
        ],
        [
            " 0.62%"
        ],
        [
            " 031408007   Pritil"
        ],
        [
            " 4.6%"
        ],
        [
            " 5,172"
        ],
        [
            " 4,165"
        ],
        [
            "  ▴"
        ],
        [
            " 2.19%"
        ],
        [
            " 031408008   Pulong Gubat"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,879"
        ],
        [
            " 3,186"
        ],
        [
            "  ▾"
        ],
        [
            " −5.14%"
        ],
        [
            " 031408009   Santa Cruz"
        ],
        [
            " 10.8%"
        ],
        [
            " 12,216"
        ],
        [
            " 11,639"
        ],
        [
            "  ▴"
        ],
        [
            " 0.48%"
        ],
        [
            " 031408010   Santa Rita"
        ],
        [
            " 12.1%"
        ],
        [
            " 13,687"
        ],
        [
            " 13,163"
        ],
        [
            "  ▴"
        ],
        [
            " 0.39%"
        ],
        [
            " 031408011   Tabang"
        ],
        [
            " 7.8%"
        ],
        [
            " 8,832"
        ],
        [
            " 7,332"
        ],
        [
            "  ▴"
        ],
        [
            " 1.88%"
        ],
        [
            " 031408012   Tabe"
        ],
        [
            " 7.3%"
        ],
        [
            " 8,310"
        ],
        [
            " 7,204"
        ],
        [
            "  ▴"
        ],
        [
            " 1.44%"
        ],
        [
            " 031408013   Tiaong"
        ],
        [
            " 6.7%"
        ],
        [
            " 7,640"
        ],
        [
            " 7,279"
        ],
        [
            "  ▴"
        ],
        [
            " 0.49%"
        ],
        [
            " 031408015   Tuktukan"
        ],
        [
            " 8.6%"
        ],
        [
            " 9,776"
        ],
        [
            " 9,050"
        ],
        [
            "  ▴"
        ],
        [
            " 0.77%"
        ],
        [
            "Total"
        ],
        [
            "113,415"
        ],
        [
            "90,507"
        ],
        [
            " ▴"
        ],
        [
            "2.28%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Guiguinto, Bulacan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "6(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "6(0.2)"
        ],
        [
            "17(0.7)"
        ],
        [
            "82(3.2)"
        ],
        [
            "122(4.8)"
        ],
        [
            "151(5.9)"
        ],
        [
            "123(4.8)"
        ],
        [
            "124(4.9)"
        ],
        [
            "99(3.9)"
        ],
        [
            "37(1.5)"
        ],
        [
            "21(0.8)"
        ],
        [
            "792(31.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "2.5"
        ],
        [
            "11.7"
        ],
        [
            "6.6"
        ],
        [
            "17.7"
        ],
        [
            "22.2"
        ],
        [
            "25.2"
        ],
        [
            "23.7"
        ],
        [
            "23.2"
        ],
        [
            "17.9"
        ],
        [
            "9.2"
        ],
        [
            "5.2"
        ],
        [
            "168.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of GuiguintoYearPop.±% p.a.1903 3,948—    1918 4,847+1.38%1939 6,199+1.18%1948 7,979+2.84%1960 10,629+2.42%1970 16,075+4.22%1975 20,590+5.09%1980 27,751+6.15%1990 44,532+4.84%1995 52,575+3.16%2000 67,571+5.53%2007 89,225+3.91%2010 90,507+0.52%2015 99,730+1.87%2020 113,415+2.56%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Guiguinto, was 113,415 people, with a density of 4,100 inhabitants per square kilometer or 11,000 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "AcroCity (formerly T12 Polo Land Industrial Estates)"
        ],
        [
            "Poverty incidence of Guiguinto"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  5.00"
        ],
        [
            "2009  4.12"
        ],
        [
            "2012  4.28"
        ],
        [
            "2015  5.66"
        ],
        [
            "2018  5.48"
        ],
        [
            "2021  11.38"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "A quarter of its 2,512 hectares (6,210 acres) was converted into nurseries giving livelihood to 500 families of gardeners and landscapers.",
            "Mayor Isagani Pascual announced that the landscaping business in Guiguinto is now a ₱50 million industry.",
            "Jojo Sebastian, chair of the Guiguinto Garden City Cooperative stated that their garden stores sell ₱100,000 to ₱300,000 plants and contracts for garden and landscapes designs a month."
        ],
        [
            "San Miguel Corporation is developing a new community called AcroCity (formerly T12 Polo Land Industrial Estates) in Barangay Tabang.",
            "It is a 15-hectare (37-acre) industrial and commercial complex with 56 warehouses and is envisioned as a lifestyle hub."
        ],
        [
            "Healthcare"
        ],
        [
            "Luzon Alliance Medical Center"
        ],
        [
            "In 2024, Development Bank of the Philippines under its DBP SHIELD program, granted a PHP1.6-billion loan for the construction of 10-story Luzon Alliance Medical Center, Inc. (LAMCI).",
            "Guiguinto's biggest private hospital was founded by President Dr. Oscar Evangelista, Chairman Dr. Roberto De Leon, and Dra.",
            "Maria Socorro Caldevida with Ospital ng Guiguinto administrator, Dr. Paul Ruel C. Camiña, medical director."
        ],
        [
            "Attractions"
        ],
        [
            "San Ildefonso Parish Church"
        ],
        [
            "Santa Rita Parish Church"
        ],
        [
            "Guiguinto Gardens in Santa Cruz and Tabang"
        ],
        [
            "Garden City in Santa Cruz"
        ],
        [
            "Guiguinto Municipal Garden in Poblacion"
        ],
        [
            "C.M.",
            "Farm in Cut-Cut"
        ],
        [
            "Golden Shower in Tabe"
        ],
        [
            "Alcor Center in Tiaong"
        ],
        [
            "Hidden Mountain Rocks in Tiaong"
        ],
        [
            "Luntiang Paraiso in Tabang"
        ],
        [
            "Guiguinto station"
        ],
        [
            "Camp Hotel and Resort in Pritil"
        ],
        [
            "Klir Waterpark Resort in Santa Rita"
        ],
        [
            "St. Agatha Hotel and Resort in Santa Rita"
        ],
        [
            "Halamanan Festival"
        ],
        [
            "Established in 1999 by Mayor Ambrosio Cruz, Jr., the Halamanan Festival has since become the brand of the Municipality of Guiguinto.",
            "It was conducted in gratitude and recognition Guiguinto's dear patron, St. Ildephonsus (San Ildefonso), who held every January 23.",
            "It is considered that grand Street Dancing Festival, the participation of dancers from the schools and villages of Guiguinto and be in different towns of Bulacan.",
            "They adorned the garments as flowers and more.",
            "Besides the celebration for the feast of San Ildefonso was also a means to further pitting and display capabilities and \"galing\" of Guiguinteño in various fields of horticulture as landscaping, propagation seedling, plant growing, flower cutting, arranging and interior decorating."
        ],
        [
            "Gallery"
        ],
        [
            "February 20, 1944 Bantayog ng mga Bayani"
        ],
        [
            "Bulacan Welcome Arch (Santa Cruz)"
        ],
        [
            "The Tabang Toll Barrier (NLEX)"
        ],
        [
            "Acro Residences"
        ],
        [
            "TESDA Regional Training Center Central Luzon"
        ],
        [
            "New Guiguinto station in Barangay Tabang"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Guiguinto |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Guiguinto: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 12, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bulacan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Green paradise\".",
            "Manila Bulletin."
        ],
        [
            "^ \"BIZ BUZZ: Bulacan rising, AcroCity growing\".",
            "Philippine Daily Inquirer.",
            "August 1, 2023.",
            "Retrieved September 9, 2023."
        ],
        [
            "^ Velez, Freddie (December 11, 2023).",
            "\"Guiguinto's modern private hospital to be completed in 2025 - Bulacan solon\".",
            "Manila Bulletin.",
            "Retrieved June 14, 2024."
        ],
        [
            "^ \"DBP grants P1.6-B financing aid to C. Luzon hospital firm\".",
            "Philippine News Agency.",
            "February 24, 2022.",
            "Retrieved June 14, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Guiguinto."
        ],
        [
            "Guiguinto Bulacan"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Guiguinto"
        ],
        [
            "Plaridel"
        ],
        [
            "Malolos"
        ],
        [
            "Guiguinto"
        ],
        [
            "Balagtas"
        ],
        [
            "Bulakan"
        ],
        [
            "vte Province of BulacanMalolos (capital)  San Jose del Monte (largest city)Municipalities"
        ],
        [
            "Angat"
        ],
        [
            "Balagtas"
        ],
        [
            "Bocaue"
        ],
        [
            "Bulakan"
        ],
        [
            "Bustos"
        ],
        [
            "Calumpit"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Guiguinto"
        ],
        [
            "Hagonoy"
        ],
        [
            "Marilao"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Pandi"
        ],
        [
            "Paombong"
        ],
        [
            "Plaridel"
        ],
        [
            "Pulilan"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Maria"
        ],
        [
            "Component cities"
        ],
        [
            "Baliwag"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Guiguinto&oldid=1234440773\""
        ],
        [
            "Category: Municipalities of BulacanHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from March 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from March 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using infobox settlement with possible demonym listArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}