{
    "name": "Guimba",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Guimba"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°39′38″N 120°45′54″E﻿ / ﻿15.6606°N 120.765°E﻿ / 15.6606; 120.765"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Nueva Ecija, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Guimba\" – news · newspapers · books · scholar · JSTOR (July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesGuimbaMunicipalityMunicipality of GuimbaGuimba Town Hall"
        ],
        [
            "SealNickname(s): Mushroom Capital of Nueva Ecija  Organic Farming Capital of Nueva EcijaMap of Nueva Ecija with Guimba highlightedOpenStreetMapGuimbaLocation within the PhilippinesCoordinates: 15°39′38″N 120°45′54″E﻿ / ﻿15.6606°N 120.765°E﻿ / 15.6606; 120.765CountryPhilippinesRegionCentral LuzonProvinceNueva EcijaDistrict"
        ],
        [
            "1st districtFounded1897Barangays64"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJesulito E. Galapon • Vice MayorDarlene Jahne Antoinette N. Beltran • RepresentativeEstrellita B. Suansing • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "John Carlo DizonStephanie AlvarezKent NatividadJulius Gregfort LumangAnthony UbaldoVirgilio FabrosJohnny EstabilloBonbon M. Dizon"
        ],
        [
            " • Electorate77,606 voters (2022)Area • Revenue₱ 382 million (2020) • Assets₱ 1,068 million (2020) • Expenditure₱ 320.7 million (2020) • Liabilities₱ 515.6 million (2020)Service provider • ElectricityNueva Ecija 2 Area 1 Electric Cooperative (NEECO 2 A1)Time zoneUTC+8 (PST)ZIP code3115PSGC034911000IDD : area code +63 (0)44Native languagesIlocano TagalogWebsiteguimba-ne.com"
        ],
        [
            "Guimba, officially the Municipality of Guimba (Tagalog: Bayan ng Guimba; Ilocano: Ili ti Guimba), is a 1st class municipality in the province of Nueva Ecija, Philippines.",
            "According to the 2020 census, it has a population of 127,653 people."
        ],
        [
            "It was incorporated by the King of Spain by virtue of a royal decree in 1897."
        ],
        [
            "Etymology"
        ],
        [
            "Guimba came from the Ilocano term 'Gebba' which was the process of heating molded clay pots in a pit until they turn reddish and durable.",
            "Tree stumps were made into large pieces of charcoal.",
            "The live charcoals were placed underneath the clay pots.",
            "After a few hours these were hardened and ready to bring out from the pit and ready for use."
        ],
        [
            "The story goes, once a Spanish visited the place where most of the residents are engaged in pottery making.",
            "The foreigner stopped and asked the earth-bakers this question in a nasalized manner, 'Que lugar este?'.",
            "The foreigner asked what this place was.",
            "The natives misunderstood the question and were asked what they were doing, so they answered “GEBBA” pointing to the ground.",
            "The Spaniard repeated the word as they left the place “GHEBHA” after years have gone by the name of the place was hispanized into Guimba when the Spaniard founded the town as Pueblo en la provincia de Nueva Ecija.",
            "This pottery-making tradition is prevalent even in other barangays outside the central area of the town.",
            "An example is Barangay Pasong Intsik, which was named after 'old jars containing Chinese remains' were once found beneath a bridge."
        ],
        [
            "The early Ilocano settlers brought with them the wonder image of Apo San Juan so they called the place San Juan de Guimba.",
            "In the American period, a resolution on the town separated the term 'Guimba' from 'Apo San Juan', thus its present name.",
            "But Apo San Juan remains as its Patron Saint.",
            "The pottery traditions of the indigenous settlers were later disintegrated and lost due to population influx from the Ilocos region and other areas in the south."
        ],
        [
            "History"
        ],
        [
            "Aerial view of Guimba, circa 1930s"
        ],
        [
            "What is now the town of Guimba was once a vast ecological rainforest which was part of the Central Luzon Rainforest during precolonial time, before the arrival of the Spanish.",
            "The area is believed to be inhabited by no permanent communities, rather, it is inhabited by hunter-gatherer societies, mainly Ilonggots.",
            "The area was once part of the huge territory that the Empire of Tondo, with its capital in a much forested Manila.",
            "In the collapse of the Empire of Tondo after the subjugation of Brunei, the area transitioned into a free zone once again, where hunter-gatherers abounded.",
            "The area is also believed to once have been visited by migrating Aetas, Cordillerans, Ilokanos, and Ilonggots."
        ],
        [
            "The first Ilocano settlers, arriving in wooden carts and horsebacks, cleared the thick forests and planted the first rice seeds on February 20, 1865, according to an old record found by Guimba's former Parish priest, Rev.",
            "Agustin \"Gus\" Polong, MSC.",
            "They called the area 'San Juan de Guimba' in honor of the patron saint the settlers brought from Ilocos, San Juan, and combined it with the pot-making industry called 'gebba' which they used to do in the old land.",
            "Since then, rice became the primary agricultural crop in the area.",
            "Due to this, it became the province of Nueva Ecija's traditional top rice-producing area in the 20th century."
        ],
        [
            "More settlers arrived mostly from the towns of Bacarra, Paoay, and Candon in the Ilocos.",
            "Among the families who came were the Galapons, Mateos, Cudals, Padres, Cayogs, Romanos, Silvestres, Capinpuyans, Batangans, Faigals, Ramoses, Sumawangs, and Catabonas.",
            "What would be the town of Guimba was a relatively organized community when the Spanish colonialists arrived and appointed Don Luis De Ocampo as the first Gobernadorcillo, and later, Don Pablo Ramos and Santiago Cudal."
        ],
        [
            "The Spanish left and the Americans came and in 1912, the town's name was abbreviated to Guimba with Don Alfonso Faigal as the first Alcalde Mayor.",
            "St. John the Evangelist remained its patron saint.",
            "The first municipal hall was also built during this year in what is now known as Faigal Street.",
            "The Plaza Municipal evolved and what became the public market opened."
        ],
        [
            "A foot bridge was constructed during the administration of the late Agustin Vigilia, Alcalde Mayor.",
            "This foot bridge was constructed across the Binituran River leading to the northern barrios like San Andres, Balbalino, Gueset, Baybayabas, Cinence, Nangabulan to barangay Talugtug from the Parairo Street.",
            "Later, the bridge was demolished and transferred to the present site north of Faigal St.",
            "This was known as Faigal Bridge going to the north, to the municipality of Talugtug.",
            "Other infrastructures were put up with the public market and cleared the space for the Municipal Plaza, now the midtown municipal park."
        ],
        [
            "In 1941, during the Japanese regime, Juan Villamar was appointed Municipal Mayor.",
            "During World War II, the Imperial Japanese military forces entered and occupied Guimba in 1942.",
            "At daybreak of January 26, to February 15, 1945, advance reconnaissance units of the American troops under the U.S. Army 6th Infantry Division and aided by the local Filipino soldiers of the Philippine Commonwealth Army 2nd, 22nd, 25th and 26th Infantry Division liberated Guimba and, within hours, established outposts nine miles farther to the east along the Licab River and La Paz.",
            "Combined U.S. and Philippine Commonwealth military forces liberated the town of Guimba in 1945 and ended World War II."
        ],
        [
            "In 1963, Dr. Virgilio Calica was the Mayor and it was during his term that the old Municipal Hall was constructed, the present site of the present municipal hall constructed in year 2004.",
            "This building was demolished during the administration of Jose Bopet Dizon and the new Municipal Hall was constructed and occupied in 2006."
        ],
        [
            "In 2006, Guimba became a first class municipality."
        ],
        [
            "Geography"
        ],
        [
            "Guimba is located on the western part of the province.",
            "It is 152 kilometres (94 mi) north-west of Manila, the country's capital, 36 kilometres (22 mi) from Cabanatuan, and 50 kilometres (31 mi) from Palayan, the provincial capital."
        ],
        [
            "Land"
        ],
        [
            "Guimba covers a land area of 25,853.2330 hectares.",
            "It have three recognized types of soil in its territory:"
        ],
        [
            "Bantug Clay loam"
        ],
        [
            "Guingua slit loam"
        ],
        [
            "San Fabian Clay loam"
        ],
        [
            "Barangays"
        ],
        [
            "Guimba is politically subdivided into 64 barangays.",
            "Each barangay consist of 7 puroks and some have sitios."
        ],
        [
            "Four are considered urban barangays while 60 are classified as rural barangays."
        ],
        [
            "Agcano"
        ],
        [
            "Ayos Lomboy"
        ],
        [
            "Bacayao"
        ],
        [
            "Bagong Barrio"
        ],
        [
            "Balbalino"
        ],
        [
            "Balingog East"
        ],
        [
            "Balingog West"
        ],
        [
            "Banitan"
        ],
        [
            "Bantug"
        ],
        [
            "Bulakid"
        ],
        [
            "Bunol"
        ],
        [
            "Caballero"
        ],
        [
            "Cabaruan"
        ],
        [
            "Caingin Tabing Ilog"
        ],
        [
            "Calem"
        ],
        [
            "Camiing"
        ],
        [
            "Cardinal"
        ],
        [
            "Casongsong"
        ],
        [
            "Catimon"
        ],
        [
            "Cavite"
        ],
        [
            "Cawayan Bugtong"
        ],
        [
            "Consuelo"
        ],
        [
            "Culong"
        ],
        [
            "Escaño"
        ],
        [
            "Faigal"
        ],
        [
            "Galvan"
        ],
        [
            "Guiset"
        ],
        [
            "Lamorito"
        ],
        [
            "Lennec"
        ],
        [
            "Macamias"
        ],
        [
            "Macapabellag"
        ],
        [
            "Macatcatuit"
        ],
        [
            "Manacsac"
        ],
        [
            "Manggang Marikit"
        ],
        [
            "Maturanoc"
        ],
        [
            "Maybubon"
        ],
        [
            "Naglabrahan"
        ],
        [
            "Nagpandayan"
        ],
        [
            "Narvacan I"
        ],
        [
            "Narvacan II"
        ],
        [
            "Pacac"
        ],
        [
            "Partida I"
        ],
        [
            "Partida II"
        ],
        [
            "Pasong Intsik"
        ],
        [
            "Saint John District (Poblacion)"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Bernardino"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "San Roque"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Veronica District (Poblacion)"
        ],
        [
            "Santo Cristo District (Poblacion)"
        ],
        [
            "Saranay District (Poblacion)"
        ],
        [
            "Sinulatan"
        ],
        [
            "Subol"
        ],
        [
            "Tampac I"
        ],
        [
            "Tampac II & III"
        ],
        [
            "Triala"
        ],
        [
            "Yuson"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Guimba, Nueva Ecija"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "4(0.2)"
        ],
        [
            "6(0.2)"
        ],
        [
            "7(0.3)"
        ],
        [
            "12(0.5)"
        ],
        [
            "61(2.4)"
        ],
        [
            "89(3.5)"
        ],
        [
            "96(3.8)"
        ],
        [
            "99(3.9)"
        ],
        [
            "81(3.2)"
        ],
        [
            "88(3.5)"
        ],
        [
            "37(1.5)"
        ],
        [
            "13(0.5)"
        ],
        [
            "593(23.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "2.5"
        ],
        [
            "3.0"
        ],
        [
            "4.1"
        ],
        [
            "6.3"
        ],
        [
            "15.8"
        ],
        [
            "19.4"
        ],
        [
            "22.5"
        ],
        [
            "21.6"
        ],
        [
            "20.1"
        ],
        [
            "17.5"
        ],
        [
            "9.6"
        ],
        [
            "4.0"
        ],
        [
            "146.4"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "There are two types of climate in the town.",
            "Dry season from November to June.",
            "And rainy seasons from July to October."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of GuimbaYearPop.±% p.a.1903 7,218—    1918 15,490+5.22%1939 27,681+2.80%1948 33,029+1.98%1960 38,148+1.21%1970 50,261+2.79%1975 55,781+2.11%1980 58,847+1.08%YearPop.±% p.a.1990 73,363+2.23%1995 77,935+1.14%2000 87,295+2.46%2007 96,116+1.34%2010 104,894+3.23%2015 118,655+2.38%2020 127,653+1.45%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Guimba"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  35.10"
        ],
        [
            "2009  25.18"
        ],
        [
            "2012  20.70"
        ],
        [
            "2015  18.92"
        ],
        [
            "2018  4.30"
        ],
        [
            "2021  14.51"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Guimba is one of the most developed and fastest growing municipalities in the province of Nueva Ecia, together with the towns of Talavera and Cabiao.",
            "Guimba has experienced rapid urban growth in the past few years.",
            "The town has an employment rate of 74%"
        ],
        [
            "Most Guimbanians derive their income from agriculture.",
            "As such, the agriculture sector ranks first in terms of generating employment for the populace.",
            "At the end of year 2006, Guimba had a total labor force of 38,120."
        ],
        [
            "Guimba economy revolves mainly on agriculture.",
            "However, there are also cottages, small and medium scale industries.",
            "Local producers are involved in the manufacture of furniture, food processing, panara making, native rice cakes, palay buying, auto parts, clothing, subdivisions, cosmetics, medicine, and construction."
        ],
        [
            "As of 2017, Guimba has a total income of P289,497,138.89; assets of P556,825,821.59; liabilities of P165,318,650.14, and equity of P296,965,545.59"
        ],
        [
            "Shopping Centers and Supermarkets"
        ],
        [
            "Puregold Guimba"
        ],
        [
            "Primark Town Center Guimba"
        ],
        [
            "Friendship Supermarket"
        ],
        [
            "Legarda supermarket"
        ],
        [
            "ABC supermarket"
        ],
        [
            "Robinsons Easymart"
        ],
        [
            "Lamart"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Municipal elected official (2022–present):"
        ],
        [
            "Dr. Jesulito Galapon, Mayor"
        ],
        [
            "Darlene Jahne Antoinette Beltran, Vice Mayor"
        ],
        [
            "Councilors:"
        ],
        [
            "John Carlo P. Dizon"
        ],
        [
            "Stephanie A. Alvarez - Dacanay"
        ],
        [
            "Kent C. Natividad"
        ],
        [
            "Julius Gregfort DG.",
            "Lumang"
        ],
        [
            "Anthony P. Ubaldo"
        ],
        [
            "King Virgil Fabros"
        ],
        [
            "Johnny Estabillo"
        ],
        [
            "Remedios D. Agapito"
        ],
        [
            "List of former mayors"
        ],
        [
            "Spanish Period:"
        ],
        [
            "Don Luis de Ocampo"
        ],
        [
            "Don Pablo Ramos"
        ],
        [
            "Don Santiago Cudal"
        ],
        [
            "American Period to Contemporary Period:"
        ],
        [
            "Don Alfonso Faigal (1865-1868)"
        ],
        [
            "Don Gines Ongjiangco (1869-1872)"
        ],
        [
            "Don Juan Sarmiento (1873-1876)"
        ],
        [
            "Don Saturnino Santiago (1877-1880)"
        ],
        [
            "Don Pablo Medina (1881-1884)"
        ],
        [
            "Don Cenon Rico (1885-1888)"
        ],
        [
            "Don Andres Afan Salvador (1889-1891)"
        ],
        [
            "Don Martin Bagain (1892-1895)"
        ],
        [
            "Don Esteban Dubal (1896-1899)"
        ],
        [
            "Don Luis De Ocampo (1900-1903)"
        ],
        [
            "Don Pablo Ramos (1910-1912)"
        ],
        [
            "Don Santiago Cudal (1912-1916)"
        ],
        [
            "Don Simon Sawit (1916-1919)"
        ],
        [
            "Don Eusebio Tabaquin (1921-1922)"
        ],
        [
            "Don Felix Ramento (1922-1925)"
        ],
        [
            "Don Agustin Vigilia (1925-1928)"
        ],
        [
            "Don Alfonso Faigal (1928-1937)"
        ],
        [
            "Don Juan Villamar (1941-1943)"
        ],
        [
            "Don Pedro Corpus (1943-1945)"
        ],
        [
            "Don Anacleto Ramos (1945-1948)"
        ],
        [
            "Gil Dizon (1948-1952)"
        ],
        [
            "Arsenio Padre (1953-1955)"
        ],
        [
            "Virgilio Calica (1956-1957)"
        ],
        [
            "Inocencio Garampil (1964-1967)"
        ],
        [
            "Severino Bernardino (1968-1980)"
        ],
        [
            "Virgilio Calica (1981-1983)"
        ],
        [
            "Anastacio Ortiz (1983-1984)"
        ],
        [
            "Jose Dizon (1988-1992)"
        ],
        [
            "Cesar V. Cucio (1992-1995)"
        ],
        [
            "Nestor Bernardino (1995-1998)"
        ],
        [
            "Jose Lucius Pocholo Dizon (1998-2007)"
        ],
        [
            "Jose Francis Stevens Dizon (2007–2016)"
        ],
        [
            "Jose Dizon (2016-2023)"
        ],
        [
            "Culture"
        ],
        [
            "Intangible Cultural Heritage"
        ],
        [
            "The Ragragsak ti Guimba is the annual festival of Guimba.",
            "It is composed of various events that begins at February and ends at March, preparations normally start at January.",
            "The highlights include opening Mass, Ms. Guimba, basketball competitions, Ms.",
            "Gay, Mr.",
            "Teen, band, and street dancing which is the most popular."
        ],
        [
            "The town formerly was known for its potteries, which were introduced by its first settlers from the Ilocos region.",
            "However, the tradition vanished sometime before or after the Philippine Revolution."
        ],
        [
            "The town also possessed a rice-pounding tradition during full moons, however, the tradition vanished during the martial law period in the 1980s."
        ],
        [
            "Tangible Cultural Heritage"
        ],
        [
            "Façade of Guimba Church"
        ],
        [
            "In accordance to Article V Section 4 of the National Heritage Act of 2009 Republic Act 10066, the Philippine Registry of Cultural Property (PRECUP), the repository of all information pertaining to cultural properties in the Philippines deemed significant to Filipino cultural heritage, was established and came to effect last 2009."
        ],
        [
            "Aside from cultural agencies of the government, the law also mandates the Cultural Office of the LGU to establish a \"Local Important Cultural Properties List and Documents\" as declared by the Sanggunian.",
            "These are cultural properties which are significant to local culture and history of Guimba."
        ],
        [
            "Among the ways to register a cultural property in the PRECUP are: (1) Local government units, through their cultural offices, shall likewise maintain an inventory of cultural property under its jurisdiction and shall furnish the commission a copy of the same; and (2) Private collectors and owners shall register their cultural property to the National Museum.",
            "Registered cultural properties shall remain in the possession of their private owners."
        ],
        [
            "A building, monuments, or zone aged 50 and above is considered a 'heritage structure.'",
            "Archives, books, and works of art with high significance to local culture and history is considered a 'heritage object.'",
            "All of which can be registered in the PRECUP."
        ],
        [
            "The Municipality of Guimba, as of 2017, has yet to submit any cultural property to the PRECUP."
        ],
        [
            "The cultural properties of Guimba that may be submitted for registration in the PRECUP includes:"
        ],
        [
            "St. John the Baptist Parish Church, known also as Guimba Church - known for its intricate depiction of the mysteries of Christ at its two aisles, its huge altar painting depicting heaven and earth ruled by God, and its ceiling painting which depict rice stalks, the town's main product"
        ],
        [
            "Old Municipal Building - established during the American period and has been the former seat of power of the municipality"
        ],
        [
            "Ruins of the Philippine National Railway Station in Guimba - which is one of the few connective rail stations in Nueva Ecija"
        ],
        [
            "Triala's Mansion - formerly owned by Nueva Ecija's revolutionary leader, General Manuel Tinio"
        ],
        [
            "Faigal Bridge and other Spanish and American period bridges within the municipality"
        ],
        [
            "Historic Guimba Public Cemetery"
        ],
        [
            "Various Spanish and American Era Ancestral Houses - many need urgent conservation as many houses have been demolished already in favor of non-traditional cement buildings"
        ],
        [
            "Various barangay landmark sculptures like those in Pasong Inchik's intersection road"
        ],
        [
            "Various artifacts and books in Guimba's heritage centers"
        ],
        [
            "Our Lady of the Sacred Heart College of Guimba campus - one of the oldest educational institution in the town"
        ],
        [
            "Bartolome National High School - possesses the Gabaldon architectural style, a unique architectural style of the Philippines"
        ],
        [
            "AJH Native Kambingan owned by Jennifer R. Romano-offers native and exotic delicacies."
        ],
        [
            "AJH Executive Bar"
        ],
        [
            "JRomano Farm Supply-offers free delivery and low prices"
        ],
        [
            "Environmental Heritage"
        ],
        [
            "Prior to Spanish arrival, the entire town of Guimba was completely covered with rainforests.",
            "Philippine deer, Luzon warty pig, bleeding heart doves, and Philippine eagles were present as locals or passerby species.",
            "In the American period, agriculture was increased and the forest cover began to deplete.",
            "By the end of the 21st century, all big aves and wild mammals went extinct, while the forest cover was calculated to be less than 5% of its original extent."
        ],
        [
            "Infrastructure"
        ],
        [
            "Roads total length:"
        ],
        [
            "National roads - 41.76 km (25.95 mi)"
        ],
        [
            "Provincial roads - 44.70 km (27.78 mi)"
        ],
        [
            "Municipal - 15.60 km (9.69 mi)"
        ],
        [
            "Barangay - 153.72 km (95.52 mi)"
        ],
        [
            "More than half of Guimba's energy is taken from hydro power plants, making it a sustainable town."
        ],
        [
            "Its communications is mainly handled by Digitel, while Globe, Touch Mobile, Dito, and Smart are the predominant cellphone services used."
        ],
        [
            "Healthcare"
        ],
        [
            "Guimba District Hospital - Brgy.",
            "Pacac, Guimba, Nueva Ecija"
        ],
        [
            "Guimba General Hospital, Inc. - Bagain St. Santa Veronica District, Guimba, Nueva Ecija"
        ],
        [
            "Guimba Community Hospital (Guimba Meternity & Lying-in Clinic) - Saranay District, Guimba Nueva Ecija"
        ],
        [
            "Other clinics and Brgy.",
            "health centers served the populace around the Municipality of Guimba."
        ],
        [
            "Education"
        ],
        [
            "Education in Guimba is taught by various educational institutions in the municipality which offer mostly Information Technology, Hotel and Restaurant Management, and Teacher Education.",
            "Other courses are subsidized by Nueva Ecija's only state university, Central Luzon State University, located in the municipality of Munoz and other colleges in Cabanatuan, the province' regional economic center.",
            "Guimba's educational institutions include:"
        ],
        [
            "Our Lady of the Sacred Heart College, Inc or OLSHCO formerly OLSHA (Barangay St. John)"
        ],
        [
            "La Fortuna College Guimba Branch (Barangay Santa Veronica)"
        ],
        [
            "AMA Computer Learning Center Guimba Branch (Ongjianco St, Barangay St. Veronica)-Bankrupted"
        ],
        [
            "College for Research and Technology or CRT (Saranay District)"
        ],
        [
            "World Citi College or WCC (Barangay Saranay)"
        ],
        [
            "ETO School of Science and Technology (Barangay Santa Veronica)"
        ],
        [
            "BLUN - Bonifacio Luz Natividad Educational Foundation (St. John District, Guimba, Nueva Ecija)"
        ],
        [
            "Bartolome Sangalang National High School (formerly, Guimba National High School.",
            "Barangay St. John)"
        ],
        [
            "Triala National High School (Barangay Triala)"
        ],
        [
            "Nagpandayan High School (Barangay Nagpandayan)"
        ],
        [
            "Galvan National High School (Barangay Galvan)"
        ],
        [
            "San Andres National High School(Barangay San Andres)"
        ],
        [
            "Pacac High School (Barangay Pacac)"
        ],
        [
            "Manacsac High School (formerly Nagpandayan High School Annex.",
            "Barangay Manacsac)"
        ],
        [
            "Bartolome Sangalang National High School Annex (Barangay macatcatuit)"
        ],
        [
            "College of Advance Technology and Management (Barangay San Roque)"
        ],
        [
            "Guimba has a literacy rate of 97%."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Guimba |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Guimba: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 4 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Nueva Ecija\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Annual Audit Report\".",
            "Commission on Audit.",
            "Retrieved 19 October 2018."
        ],
        [
            "^ \"The ultimate travel guide for tourist\".",
            "Department of Tourism.",
            "Retrieved 19 October 2018."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Guimba."
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2016-03-04 at the Wayback Machine"
        ],
        [
            "https://journalnews.com.ph/guimba-vm-umupo-bilang-bagong-mayor/"
        ],
        [
            "https://halalanresults.abs-cbn.com/local/nueva-ecija/guimba"
        ],
        [
            "Places adjacent to Guimba"
        ],
        [
            "Nampicuan"
        ],
        [
            "Cuyapo / Talugtug"
        ],
        [
            "Ramos, TarlacPura, Tarlac"
        ],
        [
            "Guimba"
        ],
        [
            "Science City of Muñoz"
        ],
        [
            "Victoria, Tarlac"
        ],
        [
            "Licab / Quezon"
        ],
        [
            "Santo Domingo"
        ],
        [
            "vte Province of Nueva EcijaPalayan (capital)  Cabanatuan (largest city)Municipalities"
        ],
        [
            "Aliaga"
        ],
        [
            "Bongabon"
        ],
        [
            "Cabiao"
        ],
        [
            "Carranglan"
        ],
        [
            "Cuyapo"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Guimba"
        ],
        [
            "Jaen"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Llanera"
        ],
        [
            "Lupao"
        ],
        [
            "Nampicuan"
        ],
        [
            "Pantabangan"
        ],
        [
            "Peñaranda"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Leonardo"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Zaragoza"
        ],
        [
            "Component cities"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Jose"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Guimba&oldid=1227759364\""
        ],
        [
            "Category: Municipalities of Nueva EcijaHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from July 2020All articles needing additional referencesPages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles containing Ilocano-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}