{
    "name": "Guimbal",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Guimbal"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°40′N 122°19′E﻿ / ﻿10.67°N 122.32°E﻿ / 10.67; 122.32"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "Not to be confused with Hélicoptères Guimbal."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Guimbal\" – news · newspapers · books · scholar · JSTOR (February 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Western Visayas, PhilippinesGuimbalMunicipalityMunicipality of GuimbalGuimbal Church of the St. Nicolas of Tolentino Parish"
        ],
        [
            "FlagSealNickname: \"The Town of the Rising Sun & Sons\"Map of Iloilo with Guimbal highlightedOpenStreetMapGuimbalLocation within the PhilippinesCoordinates: 10°40′N 122°19′E﻿ / ﻿10.67°N 122.32°E﻿ / 10.67; 122.32CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "1st districtFounded1703Barangays33"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJennifer Garin • Vice MayorMary Ann S. Lujao • RepresentativeJanette L. Garin • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Christy Love C. MargaricoReina Paz G. AlipaoFidel G. Gellangarin Sr.Ivy S. GequinianaGegato G. GilMarcelino G. Gelvero, Sr.Jo Marie S. TemeloTita G. Garrucha"
        ],
        [
            " • Electorate24,008 voters (2022)Area • Revenue₱ 126.6 million (2020) • Assets₱ 383.7 million (2020) • Expenditure₱ 85.74 million (2020) • Liabilities₱ 45.77 million (2020)Service provider • ElectricityIloilo 1 Electric Cooperative (ILECO 1)Time zoneUTC+8 (PST)ZIP code5022PSGC063020000IDD : area code +63 (0)33Native languagesKaray-a Hiligaynon Tagalog"
        ],
        [
            "Guimbal, officially the Municipality of Guimbal (Kinaray-a: Banwa kang Guimbal; Hiligaynon: Banwa sang Guimbal; Tagalog: Bayan ng Guimbal), is a 4th class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 35,022 people."
        ],
        [
            "With a 9 kilometres (5.6 mi) shoreline facing the blue waters of Panay Gulf, it has attracted tourists from different places because of its scenic beaches and inland resorts."
        ],
        [
            "Guimbal produces mango in Iloilo as well as other seasonal fruits.",
            "Farming and fishing are among the main sources of livelihood of its people."
        ],
        [
            "History"
        ],
        [
            "The first reference to Guimbal by such name in Spanish records appeared in Father Coco's appendix to Medina's “The History of the Augustinian Order in the Philippines” where it referred to the establishment of a convent in Guimbal, Iloilo in 1590."
        ],
        [
            "A closer fact compared to some other writings showed that the name of the municipality was derived from a musical instrument called guimba drum.",
            "The Spaniards discovered the settlers using the instrument to warn the people of the coming of the raiding Moro pirates who used to loot the town and capture the natives to be sold as slaves in Mindanao.",
            "To show gratitude to the instrument, with high spirit and pride as the unconquered people, the inhabitants had named their settlement Guimbal."
        ],
        [
            "Geography"
        ],
        [
            "Guimbal, a coastal municipality, is located at the south-western part of Iloilo province.",
            "It is situated between the coordinates of 1250 57’ longitude, and 100 39’ latitude.",
            "It is 29 kilometres (18 mi) from Iloilo City, and has a total land area of 4,461 hectares (11,020 acres).",
            "It is only six feet above sea level, and has varying features in terms of its slopes and elevation."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Guimbal, Iloilo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "19(0.7)"
        ],
        [
            "17(0.7)"
        ],
        [
            "26(1.0)"
        ],
        [
            "37(1.5)"
        ],
        [
            "119(4.7)"
        ],
        [
            "191(7.5)"
        ],
        [
            "258(10.2)"
        ],
        [
            "260(10.2)"
        ],
        [
            "248(9.8)"
        ],
        [
            "196(7.7)"
        ],
        [
            "97(3.8)"
        ],
        [
            "39(1.5)"
        ],
        [
            "1,507(59.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "7.2"
        ],
        [
            "5.2"
        ],
        [
            "8.3"
        ],
        [
            "11.9"
        ],
        [
            "22.3"
        ],
        [
            "26.5"
        ],
        [
            "28.3"
        ],
        [
            "28.2"
        ],
        [
            "27.3"
        ],
        [
            "26.4"
        ],
        [
            "18.7"
        ],
        [
            "11.8"
        ],
        [
            "222.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Type I climate, characterized by two district seasons: dry season, which falls from December to May, and the wet season, which is from June to December."
        ],
        [
            "Barangays"
        ],
        [
            "Guimbal is politically subdivided into 33 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "There are 11 barangays located within the Poblacion (Town Center) and the rest are outside poblacion."
        ],
        [
            "Anono-o"
        ],
        [
            "Bacong"
        ],
        [
            "Baras"
        ],
        [
            "Binanua-an"
        ],
        [
            "Bongol San Miguel"
        ],
        [
            "Bongol San Vicente"
        ],
        [
            "Bulad"
        ],
        [
            "Buluangan"
        ],
        [
            "Cabasi"
        ],
        [
            "Cabubugan"
        ],
        [
            "Calampitao"
        ],
        [
            "Camangahan"
        ],
        [
            "Igcocolo"
        ],
        [
            "Iyasan"
        ],
        [
            "Lubacan"
        ],
        [
            "Nahapay"
        ],
        [
            "Nanay Tatay Gusto ko Tinapay"
        ],
        [
            "Nalundan"
        ],
        [
            "Nanga"
        ],
        [
            "Nito-an"
        ],
        [
            "Particion"
        ],
        [
            "Sipitan-Badiang"
        ],
        [
            "Sta.",
            "Rosa-Laguna"
        ],
        [
            "Poblacion Area:"
        ],
        [
            "Bagumbayan"
        ],
        [
            "Balantad-Carlos Fruto"
        ],
        [
            "Burgos-Gengos"
        ],
        [
            "Generosa-Cristobal Colon"
        ],
        [
            "Gerona-Gimeno"
        ],
        [
            "Girado-Magsaysay"
        ],
        [
            "Gotera"
        ],
        [
            "Libo-on-Gargaritano-Gonzales"
        ],
        [
            "Pescadores"
        ],
        [
            "Rizal-Tuguisan"
        ],
        [
            "Torreblanca-Blumentritt"
        ],
        [
            "Demographics"
        ],
        [
            "New Guimbal Municipal Hall"
        ],
        [
            "Population census of GuimbalYearPop.±% p.a.1903 7,530—    1918 23,964+8.02%1939 11,128−3.59%1948 11,862+0.71%1960 13,487+1.08%1970 16,306+1.91%1975 18,041+2.05%1980 19,502+1.57%1990 23,478+1.87%1995 26,316+2.16%2000 27,707+1.11%2007 29,724+0.97%2010 32,325+3.10%2015 33,820+0.86%2020 35,022+0.69%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Guimbal, Iloilo, was 35,022 people, with a density of 790 inhabitants per square kilometre or 2,000 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Guimbal"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  21.00"
        ],
        [
            "2009  15.83"
        ],
        [
            "2012  11.42"
        ],
        [
            "2015  16.75"
        ],
        [
            "2018  11.46"
        ],
        [
            "2021  11.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Transportation"
        ],
        [
            "A 45-minute drive from Iloilo City, Guimbal is accessible from all points of Panay Island.",
            "its baranggays are served by municipal and other provincial jeepneys and buses that pass through the town and by almost 180 tricycles and 350 motorbikes playing their respective routes.",
            "The transport of farm products to the poblacion and the city is made easy by farm-to-market roads."
        ],
        [
            "Government"
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the municipal council (2019 - 2022):"
        ],
        [
            "Mayor: Kobe Bryant"
        ],
        [
            "Vice Mayor: Kawhi Leonard"
        ],
        [
            "SB Members:"
        ],
        [
            "Damian Lillard"
        ],
        [
            "Giannis Antetokoumnpo"
        ],
        [
            "Nikola Jokic"
        ],
        [
            "Stephen Curry"
        ],
        [
            "Kevin Durant"
        ],
        [
            "LeBron James"
        ],
        [
            "Russell Westbrook"
        ],
        [
            "Paul George"
        ],
        [
            "Liga.",
            "Pres.",
            "Luka Doncic"
        ],
        [
            "SK Pres.",
            "James Harden"
        ],
        [
            "Culture"
        ],
        [
            "Bantayan Festival: A celebration of the birth of a new history and culture of the people of Guimbal as a tribute and reverence to the triumphant struggle of its ancestors for meaningful existence.The magic of the Gimba (drum) and the Bantayan (watchtower) are the major features of the festival.",
            "The festival also features dance drama, drum, float & street dancing competition, film festival, cultural shows, beauty pageant, paraw & boat racing, fluvial parade, musical concerts and many other presentations."
        ],
        [
            "Disyembre sa Guimbal Celebration: A two-week pompous and extravagant celebration of Christmas which started in 1975, and is held from 16th to 25 December.",
            "It has gained popular support from all sector in the municipality that made it successful annual celebration."
        ],
        [
            "Annual Town Fiesta: Celebrated every 10 September in honor of St. Nicholas of Tolentino, the town's patron saint, and this week-long celebration reflects the kind of people Guimbalanon's are festive.",
            "Various activities are lined up, making celebration colorful."
        ],
        [
            "Holy Week celebration (Bari-Bari): A unique observance in the Lenten season, parishioners religiously preserve the tradition of the catholic faith of remembering and observing the passion of Lord Jesus Christ.",
            "People put up the 14 kapiyas depicting the 14 station of the cross along the lansangan.",
            "After the procession of Holy Thursday and good Friday, people do the bari-bari taking the route of the procession to take a closer look of the kapiyas.",
            "Holy week is also a time of reunions, homecoming and other social gatherings for the Guimbalanons."
        ],
        [
            "Tourism"
        ],
        [
            "Old Guimbal Municipal Hall"
        ],
        [
            "Guimbal Public Plaza"
        ],
        [
            "Guimbal Church: The 400-year-old church is made of yellow adobe and coral stones, one of the oldest in the country."
        ],
        [
            "Moro Watchtowers: Originally, there were four structures located in different sites along the shoreline area in the poblacion.",
            "Only three are still intact and renovated to its original condition through the Department of Tourism.",
            "These are the 17th Century structures used as look-out for raiding Moro pirates.",
            "Like the church, it was also constructed through force labor."
        ],
        [
            "Guimbal Steel Bridge: Constructed during the American period.",
            "The construction was ordered by US President Roosevelt.",
            "It is approximately 0.350 kilometers long and made of Pittsburgh Steel, which were imported from Virginia, USA.",
            "It is the longest steel bridge in Western Visayas."
        ],
        [
            "Public Plaza: Known for its beautiful ornamental plants and landscapes, the plaza is described by many as the little Luneta of southern Iloilo.",
            "It is well-maintained and well-lighted at night.",
            "It can be likened to a European labyrinth."
        ],
        [
            "New Municipal Building: Guimbal's symbol of public service, the new municipal building houses local and national government offices in the municipality.",
            "It is branded by many as the “Parthenon of Western Visayas.” In front of the Athenian conceived open coliseum and an amphitheatre where cultural shows, programs, sports, activities, and public gatherings are held.",
            "One can experience being in the golden age of history just walking around."
        ],
        [
            "Taytay Tigre: A short bridge constructed during the Spanish colonial period.",
            "It is commonly known as “Taytay Tigre” because of the tiger stone structure made part of its approaches on both sides guarding the bridge before one enters the poblacion.",
            "It was reconstructed through donation from a veteran Guimbalanon."
        ],
        [
            "Ayaw-ayaw Monument: Situated on a hill, near Nahapay Elementary School.",
            "It is a life-size replica of Andres Bonifacio, father of Philippine Revolution standing proud with his bolo on his right hand.",
            "Ayaw-ayaw is a word that signifies opposition from anything or anyone.",
            "The monument was erected on the site where early American soldiers met resistance from revolutionaries.",
            "It is a symbol of bravery, a manifestation of deep love for true freedom and independence shown by revolutionaries who resisted foreign dominion."
        ],
        [
            "Education"
        ],
        [
            "Secondary"
        ],
        [
            "Guimbal National High School in the Poblacion Area"
        ],
        [
            "Camangahan National High School in Barangay Camangahan"
        ],
        [
            "Nalundan National High School in Barangay Nalundan"
        ],
        [
            "Particion National High School in Barangay Particion"
        ],
        [
            "Integrated Schools"
        ],
        [
            "Cabasi-Sta.",
            "Rosa Integrated School, Sta.",
            "Rosa-Laguna"
        ],
        [
            "Nanga Integrated School, Nanga"
        ],
        [
            "Elementary"
        ],
        [
            "Guimbal Central Elementary School, Poblacion Area"
        ],
        [
            "Atty.",
            "Blas and Maria Gerona Memorial Elementary School, Cabubugan"
        ],
        [
            "Buluangan Elementary School, Buluangan"
        ],
        [
            "Camangahan Elementary School, Camangahan"
        ],
        [
            "P.G.",
            "Garin Memorial Elementary School, Bulad"
        ],
        [
            "Igcocolo Elementary School, Igcocolo"
        ],
        [
            "Nahapay Elementary School, Nahapay"
        ],
        [
            "Nalundan Elementary School, Nalundan"
        ],
        [
            "Particion Elementary School, Partition"
        ],
        [
            "Sipitan-Badiang Elem.",
            "School, Sipitan- Badiang"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Guimbal |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Guimbal: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 3 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Guimbal."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-05-09 at the Wayback Machine"
        ],
        [
            "Municipality of Guimbal Official Website"
        ],
        [
            "Places adjacent to Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Tubungan"
        ],
        [
            "Miag-ao"
        ],
        [
            "Guimbal"
        ],
        [
            "Tigbauan"
        ],
        [
            "Panay Gulf"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Guimbal&oldid=1228976741\""
        ],
        [
            "Category: Municipalities of IloiloHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from February 2013All articles needing additional referencesCoordinates on WikidataArticles containing Kinaray-a-language textArticles containing Hiligaynon-language textArticles containing Tagalog-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}