{
    "name": "Guinobatan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Guinobatan"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°11′N 123°36′E﻿ / ﻿13.18°N 123.6°E﻿ / 13.18; 123.6"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Albay, Philippines"
        ],
        [
            "Municipality in Bicol Region, PhilippinesGuinobatanMunicipalityMunicipality of GuinobatanOur Lady of the Assumption Church of Guinobatan"
        ],
        [
            "FlagSealNickname: The Sparkling Gem of BicolMap of Albay with Guinobatan highlightedOpenStreetMapGuinobatanLocation within the PhilippinesCoordinates: 13°11′N 123°36′E﻿ / ﻿13.18°N 123.6°E﻿ / 13.18; 123.6CountryPhilippinesRegionBicol RegionProvinceAlbayDistrict"
        ],
        [
            "3rd districtFounded1688Founded byDon Francisco BagamasbadBarangays44"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPaul \"Chino\" N. Garcia"
        ],
        [
            "\"PDP-LBN\" • Vice MayorAnn \"Gemma\" Y. Ongjoco"
        ],
        [
            "\"NUP\" • RepresentativeFernando T. Cabredo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Kathleen Mae O. PaduaJulio S. Tingzon IVPrimo M. PintorMary Ann G. AmanoMarelen G. FloresRobert M. BañagaRicky S. MatzaRolando P. Palabrica"
        ],
        [
            " • Electorate58,205 voters (2022)Area • Revenue₱ 273.4 million (2020) • Assets₱ 814.1 million (2020) • Expenditure₱ 263.6 million (2020) • Liabilities₱ 249.1 million (2020)Service provider • ElectricityAlbay Electric Cooperative (ALECO) • WaterGuinobatan Water DistrictTime zoneUTC+8 (PST)ZIP code4503PSGC050504000IDD : area code +63 (0)52Native languagesTagalog, East Miraya BikolFeast dateAugust 15Catholic dioceseDiocese of LegazpiPatron saintNuestra Señora de la AsuncionWebsitewww.guinobatan.gov.ph"
        ],
        [
            "Guinobatan, officially the Municipality of Guinobatan (Central Bikol: Banwaan kan Guinobatan; East Miraya Bikol: Banwa ning Guinobatan; Tagalog: Bayan ng Guinobatan), is a 1st class municipality in the province of Albay, Philippines.",
            "According to the 2020 census, it has a population of 85,786 people."
        ],
        [
            "The town is the birthplace of General Simeón Ola, the last Filipino general to surrender to the Americans after the Philippine–American War."
        ],
        [
            "History"
        ],
        [
            "Legend"
        ],
        [
            "This section contains too many or overly lengthy quotations.",
            "Please help summarize the quotations.",
            "Consider transferring direct quotations to Wikiquote or excerpts to Wikisource.",
            "(October 2016)"
        ],
        [
            "In the research work \"Guinobatan Through the Times,\" the following version of the legend is stated:"
        ],
        [
            "In a region on Mayon's slopes lay a village.",
            "It was dotted with huts whose roofs were made of nipa, as well as with a number of stone houses.",
            "In the village was a church, and inside the belfry was a Golden Bell.",
            "So great was the bell that when rung, the sound could be heard from miles away.",
            "The sound could even reach the land of the Moros.",
            "The Moros, made curious by the sound of the bell, sent spies so that they would know what kind of bell was producing so loud and peculiar a sound.",
            "The spies were amazed and surprised to find out that the townspeople rang was made of pure gold.",
            "They went back to the land of the Moros eager to report their findings to their superiors.",
            "Motivated by greed, the Moros assembled a squad to plunder the bell.",
            "When they arrived at the village, they pillaged the community and torched houses.",
            "They attempted to force the people to tell them where the Golden Bell was.",
            "Their attempts failed.",
            "Many were still able to flee.",
            "The fleeing townsfolk knew where the bell was, and they hid the bell underneath the roots of trees.",
            "However, an old man was left in the village.",
            "As he was the only person left in the town; Moros tortured him so that he would tell the raiders where the Golden Bell was.",
            "The old man, however, did not know.",
            "Finding no use for the old man, the Moros killed him.",
            "They tried to pursue the townspeople, but they were too far away to be captured.",
            "Instead, they went to the woods in search of the Golden Bell.",
            "They uprooted every tree underneath which they believed the Golden Bell was hidden.",
            "Their efforts proved futile.",
            "Hence, with empty hands the Moros went back to their land, while the townspeople went back to the village to rebuild their lives, which had always been under threat from Moro pillagers and natural calamities; from bad harvests and oppressive encomienderos.",
            "The townspeople also kept the valued Golden Bell safe from anyone who tried to steal it.",
            "Seeing the uprooted trees, the townsfolk named their area “Guinobatan” meaning “a place where trees were uprooted.” So ends the legend."
        ],
        [
            "Some versions also state that the town's name is derived from Ginabutan, meaning \"a place where trees or plants were uprooted.\""
        ],
        [
            "History under foreign rule"
        ],
        [
            "Luis Née, a botanist, reached Bicol in January 1792, accompanying the expedition of Capt.",
            "Alejandro Malaspina.",
            "Née explored towns near Mayon and including the area now known as Guinobatan.",
            "He noted that \"trees grew in exuberance making the foothills impenetrable in many parts.\""
        ],
        [
            "Dr. Leonilo R. Palacio of Guinobatan's Republic Colleges mentioned in an essay entitled \"Guinobatan and its Church\" that \"in 1672, the Parish of Guinobatan was already mentioned in books as a visita of the Municipality of Camalig.\""
        ],
        [
            "In 1890, the title of the gobernadorcillo was changed to Capitan Municipal.",
            "The Municipal Law of 1894 guaranteed that the term of the local executive would be extended from two years to four years.",
            "Also among the salient provisions of the law was the election of 12 vocales, equivalent to today's councilors.",
            "In 1895, the Colegio de San Buenaventura was also built, making Guinobatan the centre for higher education in Albay."
        ],
        [
            "Cabezas and principales elected the gobernadorcillo until 1863.",
            "Until 1847, Guinobatan belonged to Camarines.",
            "During the said year, the towns of Quipia, Camalig and Donsol (now in Sorsogon) were ceded to Albay, in exchange for the towns of the Partido de Lagonoy.",
            "From 1730 to 1818, the town transferred from one place to another.",
            "In 1730, it was on a site now called Binanuahan.",
            "From there, it was the relocated to Bubulusan.",
            "During the eruption of 1814, citizens opted to evacuate to higher ground, in Mauraro."
        ],
        [
            "American colonization"
        ],
        [
            "During the Philippine Revolution and the Philippine–American War (1898-1911), most of the schoolhouses built by the Spaniards were destroyed by constant artillery fire, most of which came from the Americans.",
            "As part of the \"pacification\" campaign of the Americans, engineers and architects were sent to the Philippines to oversee the construction of public works.",
            "Engr.",
            "Edward K. Bourne and famed urban planner Daniel Burnham, among other American architects and engineers, were instructed to go to Manila.",
            "In response, the Philippine Commission passed Act No.",
            "268 which created the Bureau of Architecture and Construction of Public Buildings.",
            "Mr. Bourne was appointed as its head.",
            "In 1907, the Philippine Assembly was formed.",
            "Angel Roco of Mauraro, Guinobatan represented Albay in the Assembly.",
            "The same year, Assemblyman Isauro Gabaldon of Nueva Ecija authored an act which appropriated ₱ 1 million between 1907 and 1915 for \"construction of schoolhouses of strong materials in barrios with guaranteed daily attendance of not less than sixty pupils…\" Passing into law as Act No.",
            "1801, the act became known as the \"Gabaldon Act\".",
            "Among the salient provisions was that no school could receive more than ₱ 4,000 unless the municipality to which the school belonged contributed at least 50% of the total amount granted to the school by the Gabaldon Act.",
            "The Gabaldon Act stipulated that only on land owned by the municipality could schools be constructed.",
            "Fifty-one \"Gabaldons\" were completed by 1911, and by 1916, four hundred five more were constructed.",
            "Among those completed between 1911 and 1916 was Guinobatan Central School blg.",
            "1 or the Guinobatan East Central School's Gabaldon Building."
        ],
        [
            "Potenciano Gregorio's Bikol language musical composition \"Sarung Banggi\" premiered at the town fiesta in Guinobatan in August 1910."
        ],
        [
            "Geography"
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 244.43 square kilometres (94.37 sq mi)  constituting 9.49% of the 2,575.77-square-kilometre- (994.51 sq mi) total area of Albay."
        ],
        [
            "The town of Guinobatan is located at 13°11′N 123°36′E﻿ / ﻿13.18°N 123.6°E﻿ / 13.18; 123.6.",
            "The territory of Guinobatan is bordered by a number of municipalities: Camalig on the east, Jovellar on the south, Pio Duran on the south-west, Ligao on the north-west.",
            "On the north-east, the town shares with Malilipot, Santo Domingo, Daraga, Tabaco and Legazpi, a common point in the crater of Mayon Volcano.",
            "Guinobatan is 17 kilometres (11 mi) from Legazpi City and 510 kilometres (320 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Guinobatan is politically subdivided into 44 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 050504001   Agpay"
        ],
        [
            " 0.6%"
        ],
        [
            " 482"
        ],
        [
            " 451"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 050504002   Balite"
        ],
        [
            " 0.7%"
        ],
        [
            " 585"
        ],
        [
            " 524"
        ],
        [
            "  ▴"
        ],
        [
            " 1.11%"
        ],
        [
            " 050504003   Banao"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,074"
        ],
        [
            " 1,018"
        ],
        [
            "  ▴"
        ],
        [
            " 0.54%"
        ],
        [
            " 050504004   Batbat"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,373"
        ],
        [
            " 1,314"
        ],
        [
            "  ▴"
        ],
        [
            " 0.44%"
        ],
        [
            " 050504005   Binogsacan Lower"
        ],
        [
            " 2.2%"
        ],
        [
            " 1,889"
        ],
        [
            " 1,716"
        ],
        [
            "  ▴"
        ],
        [
            " 0.96%"
        ],
        [
            " 050504049   Binogsacan Upper"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,131"
        ],
        [
            " 1,067"
        ],
        [
            "  ▴"
        ],
        [
            " 0.58%"
        ],
        [
            " 050504006   Bololo"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,442"
        ],
        [
            " 1,363"
        ],
        [
            "  ▴"
        ],
        [
            " 0.56%"
        ],
        [
            " 050504007   Bubulusan"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,399"
        ],
        [
            " 1,189"
        ],
        [
            "  ▴"
        ],
        [
            " 1.64%"
        ],
        [
            " 050504009   Calzada"
        ],
        [
            " 3.2%"
        ],
        [
            " 2,787"
        ],
        [
            " 2,662"
        ],
        [
            "  ▴"
        ],
        [
            " 0.46%"
        ],
        [
            " 050504010   Catomag"
        ],
        [
            " 0.9%"
        ],
        [
            " 796"
        ],
        [
            " 713"
        ],
        [
            "  ▴"
        ],
        [
            " 1.11%"
        ],
        [
            " 050504011   Doña Mercedes"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,411"
        ],
        [
            " 1,472"
        ],
        [
            "  ▾"
        ],
        [
            " −0.42%"
        ],
        [
            " 050504012   Doña Tomasa (Magatol)"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,352"
        ],
        [
            " 1,197"
        ],
        [
            "  ▴"
        ],
        [
            " 1.22%"
        ],
        [
            " 050504013   Ilawod"
        ],
        [
            " 2.6%"
        ],
        [
            " 2,209"
        ],
        [
            " 2,101"
        ],
        [
            "  ▴"
        ],
        [
            " 0.50%"
        ],
        [
            " 050504015   Inamnan Grande"
        ],
        [
            " 2.5%"
        ],
        [
            " 2,177"
        ],
        [
            " 1,986"
        ],
        [
            "  ▴"
        ],
        [
            " 0.92%"
        ],
        [
            " 050504014   Inamnan Pequeño"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,756"
        ],
        [
            " 1,636"
        ],
        [
            "  ▴"
        ],
        [
            " 0.71%"
        ],
        [
            " 050504016   Inascan"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,481"
        ],
        [
            " 1,359"
        ],
        [
            "  ▴"
        ],
        [
            " 0.86%"
        ],
        [
            " 050504017   Iraya"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,771"
        ],
        [
            " 2,006"
        ],
        [
            "  ▾"
        ],
        [
            " −1.24%"
        ],
        [
            " 050504018   Lomacao"
        ],
        [
            " 2.4%"
        ],
        [
            " 2,096"
        ],
        [
            " 2,002"
        ],
        [
            "  ▴"
        ],
        [
            " 0.46%"
        ],
        [
            " 050504021   Maguiron"
        ],
        [
            " 2.5%"
        ],
        [
            " 2,118"
        ],
        [
            " 2,110"
        ],
        [
            "  ▴"
        ],
        [
            " 0.04%"
        ],
        [
            " 050504022   Maipon"
        ],
        [
            " 4.6%"
        ],
        [
            " 3,944"
        ],
        [
            " 2,214"
        ],
        [
            "  ▴"
        ],
        [
            " 5.94%"
        ],
        [
            " 050504023   Malabnig"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,145"
        ],
        [
            " 1,117"
        ],
        [
            "  ▴"
        ],
        [
            " 0.25%"
        ],
        [
            " 050504024   Malipo"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,760"
        ],
        [
            " 1,690"
        ],
        [
            "  ▴"
        ],
        [
            " 0.41%"
        ],
        [
            " 050504025   Malobago"
        ],
        [
            " 2.2%"
        ],
        [
            " 1,867"
        ],
        [
            " 1,818"
        ],
        [
            "  ▴"
        ],
        [
            " 0.27%"
        ],
        [
            " 050504026   Maninila"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,482"
        ],
        [
            " 1,437"
        ],
        [
            "  ▴"
        ],
        [
            " 0.31%"
        ],
        [
            " 050504027   Mapaco"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,460"
        ],
        [
            " 1,463"
        ],
        [
            "  ▾"
        ],
        [
            " −0.02%"
        ],
        [
            " 050504008   Marcial O. Rañola (Cabaloaon)"
        ],
        [
            " 0.6%"
        ],
        [
            " 537"
        ],
        [
            " 633"
        ],
        [
            "  ▾"
        ],
        [
            " −1.63%"
        ],
        [
            " 050504029   Masarawag"
        ],
        [
            " 4.4%"
        ],
        [
            " 3,760"
        ],
        [
            " 3,553"
        ],
        [
            "  ▴"
        ],
        [
            " 0.57%"
        ],
        [
            " 050504030   Mauraro"
        ],
        [
            " 7.0%"
        ],
        [
            " 5,980"
        ],
        [
            " 5,145"
        ],
        [
            "  ▴"
        ],
        [
            " 1.52%"
        ],
        [
            " 050504031   Minto"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,726"
        ],
        [
            " 1,707"
        ],
        [
            "  ▴"
        ],
        [
            " 0.11%"
        ],
        [
            " 050504032   Morera"
        ],
        [
            " 3.0%"
        ],
        [
            " 2,602"
        ],
        [
            " 1,878"
        ],
        [
            "  ▴"
        ],
        [
            " 3.31%"
        ],
        [
            " 050504034   Muladbucad Grande"
        ],
        [
            " 2.4%"
        ],
        [
            " 2,079"
        ],
        [
            " 2,010"
        ],
        [
            "  ▴"
        ],
        [
            " 0.34%"
        ],
        [
            " 050504033   Muladbucad Pequeño"
        ],
        [
            " 2.4%"
        ],
        [
            " 2,051"
        ],
        [
            " 1,920"
        ],
        [
            "  ▴"
        ],
        [
            " 0.66%"
        ],
        [
            " 050504035   Ongo"
        ],
        [
            " 1.1%"
        ],
        [
            " 942"
        ],
        [
            " 930"
        ],
        [
            "  ▴"
        ],
        [
            " 0.13%"
        ],
        [
            " 050504036   Palanas"
        ],
        [
            " 0.5%"
        ],
        [
            " 427"
        ],
        [
            " 736"
        ],
        [
            "  ▾"
        ],
        [
            " −5.30%"
        ],
        [
            " 050504038  Poblacion"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,336"
        ],
        [
            " 1,352"
        ],
        [
            "  ▾"
        ],
        [
            " −0.12%"
        ],
        [
            " 050504040   Pood"
        ],
        [
            " 0.7%"
        ],
        [
            " 583"
        ],
        [
            " 287"
        ],
        [
            "  ▴"
        ],
        [
            " 7.34%"
        ],
        [
            " 050504042   Quibongbongan"
        ],
        [
            " 3.0%"
        ],
        [
            " 2,595"
        ],
        [
            " 2,286"
        ],
        [
            "  ▴"
        ],
        [
            " 1.28%"
        ],
        [
            " 050504041   Quitago"
        ],
        [
            " 2.6%"
        ],
        [
            " 2,236"
        ],
        [
            " 1,760"
        ],
        [
            "  ▴"
        ],
        [
            " 2.42%"
        ],
        [
            " 050504043   San Francisco"
        ],
        [
            " 3.8%"
        ],
        [
            " 3,302"
        ],
        [
            " 2,909"
        ],
        [
            "  ▴"
        ],
        [
            " 1.28%"
        ],
        [
            " 050504044   San Jose (Ogsong)"
        ],
        [
            " 1.0%"
        ],
        [
            " 853"
        ],
        [
            " 721"
        ],
        [
            "  ▴"
        ],
        [
            " 1.70%"
        ],
        [
            " 050504045   San Rafael"
        ],
        [
            " 4.5%"
        ],
        [
            " 3,884"
        ],
        [
            " 3,880"
        ],
        [
            "  ▴"
        ],
        [
            " 0.01%"
        ],
        [
            " 050504046   Sinungtan"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,312"
        ],
        [
            " 1,398"
        ],
        [
            "  ▾"
        ],
        [
            " −0.63%"
        ],
        [
            " 050504047   Tandarora"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,291"
        ],
        [
            " 1,399"
        ],
        [
            "  ▾"
        ],
        [
            " −0.80%"
        ],
        [
            " 050504048   Travesia"
        ],
        [
            " 4.5%"
        ],
        [
            " 3,878"
        ],
        [
            " 3,838"
        ],
        [
            "  ▴"
        ],
        [
            " 0.10%"
        ],
        [
            "Total"
        ],
        [
            "85,786"
        ],
        [
            "75,967"
        ],
        [
            " ▴"
        ],
        [
            "1.22%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Guinobatan, Albay"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "28(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "138(5.4)"
        ],
        [
            "83(3.3)"
        ],
        [
            "74(2.9)"
        ],
        [
            "50(2.0)"
        ],
        [
            "108(4.3)"
        ],
        [
            "165(6.5)"
        ],
        [
            "202(8.0)"
        ],
        [
            "165(6.5)"
        ],
        [
            "190(7.5)"
        ],
        [
            "186(7.3)"
        ],
        [
            "188(7.4)"
        ],
        [
            "183(7.2)"
        ],
        [
            "1,732(68.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.8"
        ],
        [
            "11.9"
        ],
        [
            "13.5"
        ],
        [
            "13.8"
        ],
        [
            "20.5"
        ],
        [
            "25.2"
        ],
        [
            "27.4"
        ],
        [
            "26.2"
        ],
        [
            "26.1"
        ],
        [
            "24.7"
        ],
        [
            "20.7"
        ],
        [
            "18.5"
        ],
        [
            "245.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of GuinobatanYearPop.±% p.a.1903 20,027—    1918 25,113+1.52%1939 26,419+0.24%1948 32,280+2.25%1960 48,157+3.39%1970 47,190−0.20%1975 49,724+1.05%1980 53,639+1.53%1990 59,187+0.99%1995 65,512+1.92%2000 71,071+1.76%2007 74,386+0.63%2010 75,967+0.77%2015 82,361+1.55%2020 85,786+0.80%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Guinobatan had a population of 85,786.",
            "The population density was 350 inhabitants per square kilometre (910/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Guinobatan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  39.10"
        ],
        [
            "2009  37.19"
        ],
        [
            "2012  26.85"
        ],
        [
            "2015  23.36"
        ],
        [
            "2018  25.61"
        ],
        [
            "2021  21.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "Guinobatan Museum"
        ],
        [
            "Guinobatan hosts an annual festival in the celebration of Our Lady of Assumption, its patron saint.",
            "Until 2013, the town festival was called \"Arandurugan Festival.\"",
            "In August 2013, Guinobatan celebrated Longganisa Festival, named after the local product which is listed under the Department of Trade and Industry's \"One Town, One Product\" program."
        ],
        [
            "Notable Personalities"
        ],
        [
            "Francis Tolentino, former MMDA Chairmanship"
        ],
        [
            "Elizabeth Oropesa, an Actress"
        ],
        [
            "Mura, an actor and Comedian"
        ],
        [
            "Simeon Ola, considered as the Last General to Surrender"
        ],
        [
            "Marcial O. Rañola, former representative of the 3rd District of Albay"
        ],
        [
            "Pio S. Duran, former representative of the 3rd District of Albay"
        ],
        [
            "Dr. Felipe Cevallos, founder of the Guinobatan Rural High School"
        ],
        [
            "Ramon Paje, 19th DENR Secretary"
        ],
        [
            "Arpie Patriarca, singer, comedian and founder of Feed Hungry Minds."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Guinobatan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b c Dy and Tuson, 2012.",
            "Guinobatan Through the Times: Essays on Our Heritage.",
            "Marcial O. Rañola Memorial School"
        ],
        [
            "^ Municipality of Guinobatan.",
            "1996.",
            "Arandurugan Festival Souvenir Program: Guinobatan, Albay"
        ],
        [
            "^ Mallari, Francisco, S.J.",
            "1999.",
            "Vignettes of Bicol History.",
            "Quezon City: New DayPublishers"
        ],
        [
            "^ Dy and Tuson.",
            "2012.",
            "Guinobatan Through the Times.",
            "Marcial O. Rañola Memorial School"
        ],
        [
            "^ Tariman, Pablo (June 3, 2013).",
            "\"Bicolandia's Sarung Banggi: From music to film\".",
            "The Philippine Star.",
            "Philstar Global Corp. Retrieved February 5, 2019."
        ],
        [
            "^"
        ],
        [
            "\"Province: Albay\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^ \"Municipal: Guinobatan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Guinobatan, Albay : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved December 29, 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Albay\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Guinobatan"
        ],
        [
            "Ligao"
        ],
        [
            "Mayon Volcano"
        ],
        [
            "Ligao"
        ],
        [
            "Guinobatan"
        ],
        [
            "Camalig"
        ],
        [
            "Pio Duran"
        ],
        [
            "Jovellar"
        ],
        [
            "vte Province of AlbayLegazpi (capital and largest city)Municipalities"
        ],
        [
            "Bacacay"
        ],
        [
            "Camalig"
        ],
        [
            "Daraga"
        ],
        [
            "Guinobatan"
        ],
        [
            "Jovellar"
        ],
        [
            "Libon"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Manito"
        ],
        [
            "Oas"
        ],
        [
            "Pio Duran"
        ],
        [
            "Polangui"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Tiwi"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Tabaco"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Guinobatan&oldid=1229735054\""
        ],
        [
            "Category: Municipalities of AlbayHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Central Bikol-language textArticles containing Tagalog-language textWikipedia articles with style issues from October 2016All articles with style issuesArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}