{
    "name": "Guindulman",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Guindulman"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°45′43″N 124°29′17″E﻿ / ﻿9.762°N 124.488°E﻿ / 9.762; 124.488"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bohol, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Guindulman\" – news · newspapers · books · scholar · JSTOR (September 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Visayas, PhilippinesGuindulmanMunicipalityMunicipality of GuindulmanGuindulman Town Hall"
        ],
        [
            "FlagSealMap of Bohol with Guindulman highlightedOpenStreetMapGuindulmanLocation within the PhilippinesCoordinates: 9°45′43″N 124°29′17″E﻿ / ﻿9.762°N 124.488°E﻿ / 9.762; 124.488CountryPhilippinesRegionCentral VisayasProvinceBoholDistrict"
        ],
        [
            "3rd districtFoundedaround 1622Barangays19"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorBen Balo • Vice MayorSinfor Lavastida • RepresentativeKristine Alexie B. Tutor • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Abigail Marie L. GutangMaureen Jade G. YuJulieto G. CastuloDarwin Noel L. TanBello M. GamutanAntonio C. CodillaPaterno C. BernidoWilbert R. BersalunaOriculo G. Granada IIApolonio G. Castulo Jr."
        ],
        [
            " • Electorate31,877 voters (2022)Area • Revenue₱ 167.6 million (2020) • Assets₱ 452.2 million (2020) • Expenditure₱ 165 million (2020) • Liabilities₱ 70.81 million (2020)Service provider • ElectricityBohol 2 Electric Cooperative (BOHECO 2)Time zoneUTC+8 (PST)ZIP code6310PSGC0701223000IDD : area code +63 (0)38Native languagesBoholano dialect Cebuano Tagalog"
        ],
        [
            "Guindulman, officially the Municipality of Guindulman (Cebuano: Munisipyo sa Guindulman; Tagalog: Bayan ng Guindulman),  is a 4th class municipality in the province of Bohol, Philippines.",
            "According to the 2020 census, it has a population of 34,104 people."
        ],
        [
            "Guindulman celebrates its feast on the first Saturday of September, to honor the town patron Our Lady of Consolation."
        ],
        [
            "Etymology"
        ],
        [
            "In the olden days, names of certain places were sometimes ascribed to some usual or common incidents or occurrences as is the case with the town of Guindulman.",
            "The place was originally called Guinduluman or Guindapu-nan or Guindapu-an, from a vernacular expression which means \"something or somebody who is overtaken by darkness\"."
        ],
        [
            "There is no official record to show how the town really got its name.",
            "However, folklore has it that during the early part of the Spanish era in the Philippines, there were only two formally organized towns along the southeastern and eastern coastal borders of Bohol, namely, Jagna and Batuanan (now known as Alicia).",
            "Because of the distances, travelers starting from either of these towns in the early morning were sure to be overtaken by nightfall before reaching the next place; hence the name \"guinduluman\"."
        ],
        [
            "Folklore further says that the early condition of the area itself had something to contribute to the appropriateness of the term because the center of the town was once surrounded and almost entirely shaded by a dense forest which also made the town dark even during daytime.",
            "Travelers from other places passing through this thick forest could observe its surrounding darkness because the sunlight could hardly penetrate through the thick foliage, thus causing darkness in the area at any time of the day.",
            "Such actual condition of the particular place, therefore, gave added significance to the created name."
        ],
        [
            "History"
        ],
        [
            "It is hard to fix a definite date when this town was established as official records were destroyed during the war.",
            "However, Francisca Libres Piezas cited in her compilation that the town of Guindulman was already established before the Tamblot Rebellion of 1622.",
            "So Guindulman may now be almost 400 years old."
        ],
        [
            "During the Philippine revolution against the Spanish government, there was no fighting in town reported.",
            "The people were submissive to the Spanish authorities."
        ],
        [
            "Guindulman was burned down during the Philippine–American War in 1899.",
            "Guerrilla warfare was already resorted to by the local insurgents known as \"insurectos\".",
            "A resistance movement was organized under the leadership of Colonel Pedro Samson whose headquarters was in Monte Verde in the upper part of the town.",
            "There was no battle fought in the poblacion of Guindulman, but a memorable encounter took place in the barrio of Cabantian wherein both sides suffer heavy casualties."
        ],
        [
            "The historical incident happened when American troops passed by the barrio of Cabantian, the \"insurectos\" ambushed the troops by jumping from the hilltops and killing many American soldiers with their bolos.",
            "However, because of the superiority of American weapons, the insurgents likewise suffered several casualties.",
            "On account of such incident, the furious American patrols then burned the houses of the particular village including the rice stocks in the fields.",
            "Still dissatisfied, they shot cows and carabaos on sight."
        ],
        [
            "During the Japanese occupation in 1944, another similar encounter occurred between the Japanese troops and members of the guerrilla unit which was organized by the Major Esteban Bernido, native of Guindulman who also became a representative of the 3rd Congressional district of Bohol, governor of the province, and finally occupied one of the important cabinet positions of the country.",
            "The memorable incident started with an ambush made by the guerrillas under Major Bernido right on the boundary of Guindulman and Duero in Cabantian.",
            "The Japanese suffered heavy casualties while the guerrilla unit escaped unharmed.",
            "As a reprisal, the Japanese burned the entire poblacion, leaving only the convent and the church which were occupied by their garrison."
        ],
        [
            "After the burning of the entire Poblacion (town center), the displaced families residing in the area evacuated to the upper parts of the town from barangay Bulawan and Catungawan to Mayuga and boundaries of neighboring towns.",
            "Hearing the plight of the people and feeling responsible for the conflagration brought by the Japanese garrison to the locals, the guerrillas staged a mission with a goal to uplift the spirits of their own troops and the locals that support their cause.",
            "A squad of Guerillas went to retrieve a bust of the Town's patron Our Lady of Consolation in the Town's church under the shade of darkness and the shadows of huge trees that once occupied the area.",
            "They were spotted carrying the heavy sculpture going west from the church by Japanese garrison troops stationed at the nearby bell tower and fired upon.",
            "The Guerillas suffered injuries but were able to flee and successfully brought their objective back to their camp in the highlands.",
            "The Japanese troops gave no chase as they were not familiar with the terrain and the anticipation of a diversionary attack by the guerillas meant that leaving post would jeopardize the garrison defenses.",
            "Deeply religious, the mission meant a huge success to the locals and brought hope to the families that fled the Japanese occupation.",
            "A hope to which they would hold on to until the whole island of Bohol would then be liberated by American and Filipino forces in the summer of 1945."
        ],
        [
            "Geography"
        ],
        [
            "Guindulman is bounded by Duero to the southwest, Pilar to the northwest, Candijay to the north, Anda in the east, and the Bohol Sea to the south.",
            "It is 89 kilometres (55 mi) from Tagbilaran."
        ],
        [
            "Barangays"
        ],
        [
            "Guindulman is politically subdivided into 19 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 071223001   Basdio"
        ],
        [
            " 5.5%"
        ],
        [
            " 1,887"
        ],
        [
            " 1,883"
        ],
        [
            "  ▴"
        ],
        [
            " 0.02%"
        ],
        [
            " 071223002   Bato"
        ],
        [
            " 3.7%"
        ],
        [
            " 1,262"
        ],
        [
            " 1,263"
        ],
        [
            "  ▾"
        ],
        [
            " −0.01%"
        ],
        [
            " 071223003   Bayong"
        ],
        [
            " 3.8%"
        ],
        [
            " 1,300"
        ],
        [
            " 1,352"
        ],
        [
            "  ▾"
        ],
        [
            " −0.39%"
        ],
        [
            " 071223004   Biabas"
        ],
        [
            " 3.9%"
        ],
        [
            " 1,314"
        ],
        [
            " 1,491"
        ],
        [
            "  ▾"
        ],
        [
            " −1.26%"
        ],
        [
            " 071223005   Bulawan"
        ],
        [
            " 3.0%"
        ],
        [
            " 1,008"
        ],
        [
            " 918"
        ],
        [
            "  ▴"
        ],
        [
            " 0.94%"
        ],
        [
            " 071223006   Cabantian"
        ],
        [
            " 4.5%"
        ],
        [
            " 1,549"
        ],
        [
            " 1,388"
        ],
        [
            "  ▴"
        ],
        [
            " 1.10%"
        ],
        [
            " 071223007   Canhaway"
        ],
        [
            " 9.0%"
        ],
        [
            " 3,071"
        ],
        [
            " 3,150"
        ],
        [
            "  ▾"
        ],
        [
            " −0.25%"
        ],
        [
            " 071223008   Cansiwang"
        ],
        [
            " 2.5%"
        ],
        [
            " 851"
        ],
        [
            " 786"
        ],
        [
            "  ▴"
        ],
        [
            " 0.80%"
        ],
        [
            " 071223009   Casbu"
        ],
        [
            " 2.8%"
        ],
        [
            " 960"
        ],
        [
            " 929"
        ],
        [
            "  ▴"
        ],
        [
            " 0.33%"
        ],
        [
            " 071223011   Catungawan Norte"
        ],
        [
            " 2.9%"
        ],
        [
            " 977"
        ],
        [
            " 1,069"
        ],
        [
            "  ▾"
        ],
        [
            " −0.90%"
        ],
        [
            " 071223010   Catungawan Sur"
        ],
        [
            " 6.1%"
        ],
        [
            " 2,095"
        ],
        [
            " 1,764"
        ],
        [
            "  ▴"
        ],
        [
            " 1.73%"
        ],
        [
            " 071223013   Guinacot"
        ],
        [
            " 5.4%"
        ],
        [
            " 1,828"
        ],
        [
            " 1,767"
        ],
        [
            "  ▴"
        ],
        [
            " 0.34%"
        ],
        [
            " 071223014   Guio‑ang"
        ],
        [
            " 8.4%"
        ],
        [
            " 2,858"
        ],
        [
            " 2,627"
        ],
        [
            "  ▴"
        ],
        [
            " 0.85%"
        ],
        [
            " 071223016   Lombog"
        ],
        [
            " 5.7%"
        ],
        [
            " 1,956"
        ],
        [
            " 2,050"
        ],
        [
            "  ▾"
        ],
        [
            " −0.47%"
        ],
        [
            " 071223017   Mayuga"
        ],
        [
            " 7.2%"
        ],
        [
            " 2,448"
        ],
        [
            " 2,535"
        ],
        [
            "  ▾"
        ],
        [
            " −0.35%"
        ],
        [
            " 071223018   Sawang (Poblacion)"
        ],
        [
            " 5.4%"
        ],
        [
            " 1,837"
        ],
        [
            " 1,869"
        ],
        [
            "  ▾"
        ],
        [
            " −0.17%"
        ],
        [
            " 071223019   Tabajan (Poblacion)"
        ],
        [
            " 7.4%"
        ],
        [
            " 2,530"
        ],
        [
            " 2,437"
        ],
        [
            "  ▴"
        ],
        [
            " 0.38%"
        ],
        [
            " 071223021   Tabunok"
        ],
        [
            " 2.1%"
        ],
        [
            " 711"
        ],
        [
            " 747"
        ],
        [
            "  ▾"
        ],
        [
            " −0.49%"
        ],
        [
            " 071223022   Trinidad"
        ],
        [
            " 5.8%"
        ],
        [
            " 1,966"
        ],
        [
            " 1,764"
        ],
        [
            "  ▴"
        ],
        [
            " 1.09%"
        ],
        [
            "Total"
        ],
        [
            "34,104"
        ],
        [
            "31,789"
        ],
        [
            " ▴"
        ],
        [
            "0.71%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Guindulman, Bohol"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "102(4.0)"
        ],
        [
            "85(3.3)"
        ],
        [
            "91(3.6)"
        ],
        [
            "75(3.0)"
        ],
        [
            "110(4.3)"
        ],
        [
            "141(5.6)"
        ],
        [
            "121(4.8)"
        ],
        [
            "107(4.2)"
        ],
        [
            "111(4.4)"
        ],
        [
            "144(5.7)"
        ],
        [
            "169(6.7)"
        ],
        [
            "139(5.5)"
        ],
        [
            "1,395(55.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.6"
        ],
        [
            "14.8"
        ],
        [
            "16.5"
        ],
        [
            "16.7"
        ],
        [
            "23.9"
        ],
        [
            "26.4"
        ],
        [
            "25.6"
        ],
        [
            "24.1"
        ],
        [
            "24.4"
        ],
        [
            "26.3"
        ],
        [
            "23.7"
        ],
        [
            "20.5"
        ],
        [
            "261.5"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of GuindulmanYearPop.±% p.a.1903 12,002—    1918 22,017+4.13%1939 23,855+0.38%1948 27,220+1.48%1960 28,352+0.34%1970 29,972+0.56%1975 31,820+1.21%1980 32,918+0.68%1990 37,400+1.28%1995 40,015+1.27%2000 40,714+0.37%2007 43,331+0.86%2010 31,789−10.66%2015 32,408+0.37%2020 34,104+1.01%Source: Philippine Statistics Authority"
        ],
        [
            "Notable personalities"
        ],
        [
            "Dr. Maria Fe A. Piezas, Vice Mayor"
        ],
        [
            "Gina S. Kano, Fitness & Bodybuilding Professional"
        ],
        [
            "Fr.",
            "Narciso Hernandez, Augustinian Recollect Priest (1827)"
        ],
        [
            "Teogenes Pelegrino, Boxer representing the Philippines at the 1968 Summer Olympics"
        ],
        [
            "See also"
        ],
        [
            "Eskaya people"
        ],
        [
            "Gallery"
        ],
        [
            "Guindulman Town Hall"
        ],
        [
            "Biabas barangay"
        ],
        [
            "Guindulman Public Market"
        ],
        [
            "St. Mary Academy, Guindulman, Bohol"
        ],
        [
            "Rice Terraces in Barangay Guinacot"
        ],
        [
            "Notes"
        ],
        [
            "^ At the latitude of Guindulman, daylight is only 12h07 ± 35 minutes throughout the year."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Guindulman |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Bohol Festivals Timetable\".",
            "www.bohol-philippines.com.",
            "Retrieved 2019-03-20."
        ],
        [
            "^ a b \"Municipality of Guindulman\".",
            "Province of Bohol.",
            "Retrieved 2012-09-18."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Guindulman: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "Wikimedia Commons has media related to Guindulman."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Guindulman"
        ],
        [
            "Places adjacent to Guindulman"
        ],
        [
            "Pilar"
        ],
        [
            "Candijay"
        ],
        [
            "Guindulman"
        ],
        [
            "Anda"
        ],
        [
            "Duero"
        ],
        [
            "Bohol Sea"
        ],
        [
            "vte Province of BoholTagbilaran (capital and largest city)Municipalities"
        ],
        [
            "Alburquerque"
        ],
        [
            "Alicia"
        ],
        [
            "Anda"
        ],
        [
            "Antequera"
        ],
        [
            "Baclayon"
        ],
        [
            "Balilihan"
        ],
        [
            "Batuan"
        ],
        [
            "Bien Unido"
        ],
        [
            "Bilar"
        ],
        [
            "Buenavista"
        ],
        [
            "Calape"
        ],
        [
            "Candijay"
        ],
        [
            "Carmen"
        ],
        [
            "Catigbian"
        ],
        [
            "Clarin"
        ],
        [
            "Corella"
        ],
        [
            "Cortes"
        ],
        [
            "Dagohoy"
        ],
        [
            "Danao"
        ],
        [
            "Dauis"
        ],
        [
            "Dimiao"
        ],
        [
            "Duero"
        ],
        [
            "Garcia Hernandez"
        ],
        [
            "Getafe"
        ],
        [
            "Guindulman"
        ],
        [
            "Inabanga"
        ],
        [
            "Jagna"
        ],
        [
            "Lila"
        ],
        [
            "Loay"
        ],
        [
            "Loboc"
        ],
        [
            "Loon"
        ],
        [
            "Mabini"
        ],
        [
            "Maribojoc"
        ],
        [
            "Panglao"
        ],
        [
            "Pilar"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Sagbayan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Sevilla"
        ],
        [
            "Sierra Bullones"
        ],
        [
            "Sikatuna"
        ],
        [
            "Talibon"
        ],
        [
            "Trinidad"
        ],
        [
            "Tubigon"
        ],
        [
            "Ubay"
        ],
        [
            "Valencia"
        ],
        [
            "Component city"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Islands"
        ],
        [
            "Balicasag"
        ],
        [
            "Banacon"
        ],
        [
            "Bansaan"
        ],
        [
            "Bilangbilangan"
        ],
        [
            "Bohol"
        ],
        [
            "Cabilao"
        ],
        [
            "Cabulan"
        ],
        [
            "Hingotanan"
        ],
        [
            "Jandayan"
        ],
        [
            "Jao"
        ],
        [
            "Juagdan"
        ],
        [
            "Lapinig"
        ],
        [
            "Mahanay"
        ],
        [
            "Malingin"
        ],
        [
            "Mantatao"
        ],
        [
            "Maomawan"
        ],
        [
            "Pamilacan"
        ],
        [
            "Pangangan"
        ],
        [
            "Panglao"
        ],
        [
            "Sagasa"
        ],
        [
            "Sandingan"
        ],
        [
            "Tintinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Guindulman&oldid=1220500942\""
        ],
        [
            "Category: Municipalities of BoholHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2012All articles needing additional referencesCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}