{
    "name": "Guiuan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Guiuan"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançais한국어IlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSimple EnglishSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°02′N 125°44′E﻿ / ﻿11.03°N 125.73°E﻿ / 11.03; 125.73"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Eastern Samar, Philippines"
        ],
        [
            "Not to be confused with Guyuan."
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesGuiuanMunicipalityMunicipality of GuiuanNear-sunset view of Leyte Gulf and Manicani Island from the Guiuan Integrated Transport Terminal"
        ],
        [
            "FlagNickname: Gateway to Modern Philippine History"
        ],
        [
            "Surfing Capital of the VisayasMotto(s): Sulong pa, Guiuan!",
            "(Waray-waray for \"Advance, Guiuan!",
            "\");Guiuan, Bungto ta, Higugma-a ta.",
            "(Waray-waray for \"Let us Love our Town, Guiuan.",
            "\")Map of Eastern Samar with Guiuan highlightedGuiuanLocation within the PhilippinesCoordinates: 11°02′N 125°44′E﻿ / ﻿11.03°N 125.73°E﻿ / 11.03; 125.73CountryPhilippinesRegionEastern VisayasProvinceEastern SamarDistrict"
        ],
        [
            "Lone districtBarangays60"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAnnaliza G. Kwan • Vice MayorVeronica C. Ramirez • RepresentativeMaria Fe R. Abunda • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Floriano G. Bagro• Rogelio O. Cablao• Antonia R. Cablao• Francis Aldous B. Sison• Carlito S. Abrugar• Jose Eric C. Cordero• Manuel L. Velasco• Pedro M. MacabocsitDILG Masterlist of Officials"
        ],
        [
            " • Electorate36,279 voters (2022)Area • Revenue₱ 198.3 million (2020) • Assets₱ 793.4 million (2020) • Expenditure₱ 169.4 million (2020) • Liabilities₱ 85.98 million (2020)Service provider • ElectricityEastern Samar Electric Cooperative (ESAMELCO)Time zoneUTC+8 (PST)ZIP code6809PSGC082609000IDD : area code +63 (0)55Native languagesWaray TagalogWebsitewww.guiuan.gov.ph"
        ],
        [
            "Guiuan ("
        ],
        [
            "Guiuan played a significant part in Philippine history.",
            "Historical accounts attested that Ferdinand Magellan's 16th century expedition first landed on the island of Homonhon, which lies within the municipality, after their Pacific crossing.",
            "The Immaculate Conception Parish Church in the Guiuan poblacion was established in the 18th century by Jesuits and is one of the oldest in the country."
        ],
        [
            "During the Second World War, the islands of Suluan and Homonhon, both in Guiuan, became the American forces' first landing points, along with Dinagat Island, for the start of the Battle of Leyte Gulf."
        ],
        [
            "In November 2013, Guiuan was nearly levelled after Typhoon Haiyan, one of the deadliest and strongest tropical cyclones in the Philippines, made its first landfall in the town.",
            "Due to the COVID-19 pandemic, the town saw border restrictions and multiple lockdowns that affected the local economy and way of life."
        ],
        [
            "As well as a rich historical background, Guiuan has many scenic spots.",
            "Being a coastal town on the Pacific side, the town has many white-sand beaches that are suitable for swimming and surfing.",
            "The Immaculate Conception Parish Church of Guiuan is currently in the tentative list for UNESCO World Heritage Sites under the Baroque Churches of the Philippines (Extension)."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Guiuan\" – news · newspapers · books · scholar · JSTOR (July 2022) (Learn how and when to remove this message)"
        ],
        [
            "Guiuan is widely known for two significant events in history 423 years apart.",
            "In 1521, Ferdinand Magellan, first European to set foot on Philippine soil, landed in Homonhon, now part of Guiuan."
        ],
        [
            "A historical marker in Homonhon Island marking the site where Ferdinand Magellan's expedition landed in 1521"
        ],
        [
            "The Guiuan Church, built in the 18th century at the behest of Jesuit priests"
        ],
        [
            "The Spanish priest and historian Juan José Delgado was stationed in Guiuan in the 18th century.",
            "In his book Biblioteca Histórica Filipina: Historia general sacro-profana, política y natural de las islas del poniente llamadas Filipinas (1751), he recorded the old name of the region as \"Guiguan.\"",
            "He describes it as a thin stretch of land on the southern tip of Samar.",
            "He also describes the nearby islands of \"Omonhon\" (Homonhon), \"Soloan\" (Suluan), Tubabao, \"Manicaui\" (Manicani), and other small islets and settlements."
        ],
        [
            "The occurrence of World War II shook the town and people moved to the mountains to find comfort.",
            "On June 28, 1943, several Japanese soldiers set foot on Guiuan soil.",
            "Not as fearful and brutal as they were thought of by the local populace, a cordial relation soon existed between the conquered and the conquerors.",
            "Evacuees came down from the mountains and resumed a normal urban life.",
            "Except for a few killings of suspected traitors by both Japanese, Filipino soldiers and local guerillas, not a drop of blood was shed needlessly.",
            "This made Guiuan one of the few places in the islands where World War II did not leave so many tragic memories."
        ],
        [
            "The airfield of the US naval base in Guiuan during World War II.",
            "It now serves as the town's airport."
        ],
        [
            "The USS ABSD-5 in Guiuan waters during World War II"
        ],
        [
            "The first sign of liberation of the town came on November 27, 1944, when a US Navy submarine chaser steamed the harbor for reconnaissance duty.",
            "On December 1, 1944, a fleet of LCTs, Liberty ships and barges poured into the Guiuan Bay to unload machines that was to transform Guiuan into one of the biggest Naval Bases, Leyte-Samar Naval Base, in the Far East that time, set up by the American Navy, part of the Allies.",
            "Some aircraft landed on the airstrip to rendezvous with the Necessary Evil squadrons."
        ],
        [
            "Now all that is left of the American occupation are concrete slabs which once served as the foundations of a vast supply depot, and an air strip, which now serves as the town's own airport."
        ],
        [
            "In 1949, the International Refugee Organisation made an appeal to tackle the displacement crisis caused by the war and a precursor to the UNHCR.",
            "It wanted new homes for thousands of White Russians in the aftermath of the Bolshevik Revolution (Russian Revolutions) and subsequent civil war.",
            "More than 5,000 of them, under the care of John Maximovitch (Saint John of Shanghai and San Francisco), the Orthodox Archbishop of Shanghai who would later be canonised, were taken to the island of Tubabao, located a couple of hundred metres from the coast of Guiuan."
        ],
        [
            "In 1952, the sitios of Talisay, Bagambang, Calamrisan, Lo-ok and Barawalti, belonging to Barrio Tubabao, were separated and created into the barrio of Trinidad."
        ],
        [
            "On November 10, 1978, Proclamation No.",
            "1801 was issued declaring Guiuan as a Tourist Zone and Marine Reserve under the administration and control of the Philippine Tourism Authority (PTA)."
        ],
        [
            "Aerial view of Guiuan in November 2013 on the aftermath of Typhoon Haiyan (Yolanda)"
        ],
        [
            "On November 8, 2013, the city suffered heavy damage, along with 107 fatalities, 16 missing and over 3,626 injuries, as it was hit by the eye of Typhoon Haiyan (Super Typhoon Yolanda) with maximum ten-minute sustained wind speeds of 230 km/h (145 mph).",
            "Haiyan made its first landfall over Guiuan at 04:40 PhST."
        ],
        [
            "Almost every building was heavily damaged or deroofed, including the designated typhoon shelters, the Catholic Church, hospital and gymnasium.",
            "However, one house in Lactason remained intact because of the owner's effort to hold it in place with her bare hands.",
            "The woman was later identified as Mana Maring, a moron (a Filipino delicacy) maker and vendor."
        ],
        [
            "Geography"
        ],
        [
            "Houses in Guiuan's shoreline facing Leyte Gulf, 2016"
        ],
        [
            "The municipality of Guiuan is located at the southeasternmost tip of Samar Island.",
            "It is bounded on the north by the municipality of Mercedes, on the east by the Philippine Sea and the Pacific Ocean, on the south by the Surigao Strait, and on the west by Leyte Gulf."
        ],
        [
            "Clustered around the municipality are numerous islands and islets such as Manicani, Calicoan, Sulangan, Candulo, Homonhon, Suluan and Tubabao.",
            "They are protected as part of the marine reserve known as the Guiuan Protected Landscape and Seascape."
        ],
        [
            "Guiuan is 109 kilometres (68 mi) south of Borongan and 154 kilometres (96 mi) from Tacloban.",
            "It has a total land area of 175.49 square kilometres.",
            "It is composed of sixty (60) barangays and the only town in the province with biggest number of island barangays."
        ],
        [
            "Barangays"
        ],
        [
            "Guiuan is politically subdivided into 60 barangays, 37 of which is located in the mainland of Guiuan, i.e.",
            "the portion of Guiuan that is contiguous with Samar Island, and the remaining 23 in the islands surrounding the mainland."
        ],
        [
            "The Guiuan Town Plaza in 2019, part of Poblacion Ward 7"
        ],
        [
            "The Guiuan Municipal Hall in 2019, part of Poblacion Ward 9-A"
        ],
        [
            "View of Calicoan Island and the Philippine Sea from Barangay Sapao"
        ],
        [
            "The St. Anthony of Padua Church in Barangay Sulangan"
        ],
        [
            "Mainland barangays"
        ],
        [
            "Guiuan is politically subdivided into barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Poblacion barangays: The poblacion, or town center, is located on the southwestern coastal area of the Guiuan mainland, facing Leyte Gulf.",
            "A ward is named before the Allies headquarters and served as a Medical center for the Allies Western Pacific Command."
        ],
        [
            "Poblacion Ward 1"
        ],
        [
            "Poblacion Ward 2"
        ],
        [
            "Poblacion Ward 3"
        ],
        [
            "Poblacion Ward 4"
        ],
        [
            "Poblacion Ward 4-A"
        ],
        [
            "Poblacion Ward 5"
        ],
        [
            "Poblacion Ward 6"
        ],
        [
            "Poblacion Ward 7"
        ],
        [
            "Poblacion Ward 8"
        ],
        [
            "Poblacion Ward 9"
        ],
        [
            "Poblacion Ward 9-A"
        ],
        [
            "Poblacion Ward 10"
        ],
        [
            "Poblacion Ward 11"
        ],
        [
            "Poblacion Ward 12"
        ],
        [
            "Alingarog"
        ],
        [
            "Bagua"
        ],
        [
            "Banahao"
        ],
        [
            "Barbo"
        ],
        [
            "Bucao"
        ],
        [
            "Bungtod"
        ],
        [
            "Cagdara-o"
        ],
        [
            "Campoyong"
        ],
        [
            "Cantahay"
        ],
        [
            "Cogon"
        ],
        [
            "Dalaragan"
        ],
        [
            "Gahoy"
        ],
        [
            "Hagna"
        ],
        [
            "Hollywood"
        ],
        [
            "Lupok"
        ],
        [
            "Mayana"
        ],
        [
            "Salug"
        ],
        [
            "Santo Niño (or Sto.",
            "Niño)"
        ],
        [
            "Sapao"
        ],
        [
            "Surok"
        ],
        [
            "Tagporo"
        ],
        [
            "Taytay"
        ],
        [
            "Timala"
        ],
        [
            "Island barangays"
        ],
        [
            "Barangays in Homonhon Island:"
        ],
        [
            "Bitaugan"
        ],
        [
            "Cagusu-an"
        ],
        [
            "Canawayon"
        ],
        [
            "Casuguran"
        ],
        [
            "Culasi"
        ],
        [
            "Habag"
        ],
        [
            "Inapulangan"
        ],
        [
            "Pagbabangnan"
        ],
        [
            "Barangays in Tubabao Island and neighboring islets:"
        ],
        [
            "Camparang"
        ],
        [
            "San Antonio"
        ],
        [
            "San Juan"
        ],
        [
            "San Pedro"
        ],
        [
            "Trinidad"
        ],
        [
            "Barangays in Calicoan Island and neighboring islets:"
        ],
        [
            "Baras"
        ],
        [
            "Ngolos"
        ],
        [
            "Pagnamitan"
        ],
        [
            "Sulangan"
        ],
        [
            "Barangays in Manicani Island:"
        ],
        [
            "Banaag"
        ],
        [
            "Buenavista"
        ],
        [
            "Hamorawon"
        ],
        [
            "San Jose"
        ],
        [
            "Other island barangays:"
        ],
        [
            "Victory – Victory Group of Islands"
        ],
        [
            "Suluan – Suluan Island"
        ],
        [
            " View of Leyte Gulf facing southwest from the Guiuan Integrated Transport Terminal in 2019, showing the islands of Homonhon (left, nearly invisible due to haze), Manicani (near center), and Inatunglan (to the immediate right of Manicani)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Guiuan, Eastern Samar (1981–2010, extremes 1973–2012)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "32.9(91.2)"
        ],
        [
            "33.8(92.8)"
        ],
        [
            "34.3(93.7)"
        ],
        [
            "36.1(97.0)"
        ],
        [
            "37.6(99.7)"
        ],
        [
            "37.0(98.6)"
        ],
        [
            "35.4(95.7)"
        ],
        [
            "35.0(95.0)"
        ],
        [
            "35.8(96.4)"
        ],
        [
            "34.5(94.1)"
        ],
        [
            "36.0(96.8)"
        ],
        [
            "33.0(91.4)"
        ],
        [
            "37.6(99.7)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28.4(83.1)"
        ],
        [
            "28.8(83.8)"
        ],
        [
            "29.6(85.3)"
        ],
        [
            "31.0(87.8)"
        ],
        [
            "32.0(89.6)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "31.0(87.8)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "30.7(87.3)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "30.4(86.7)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.2(79.2)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "28.8(83.8)"
        ],
        [
            "28.6(83.5)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "27.8(82.0)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "25.2(77.4)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "25.4(77.7)"
        ],
        [
            "25.1(77.2)"
        ],
        [
            "25.3(77.5)"
        ],
        [
            "25.2(77.4)"
        ],
        [
            "25.0(77.0)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "19.0(66.2)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "18.0(64.4)"
        ],
        [
            "19.7(67.5)"
        ],
        [
            "20.7(69.3)"
        ],
        [
            "20.3(68.5)"
        ],
        [
            "18.5(65.3)"
        ],
        [
            "20.6(69.1)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "18.0(64.4)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "371.3(14.62)"
        ],
        [
            "276.7(10.89)"
        ],
        [
            "218.8(8.61)"
        ],
        [
            "125.7(4.95)"
        ],
        [
            "141.2(5.56)"
        ],
        [
            "185.6(7.31)"
        ],
        [
            "211.5(8.33)"
        ],
        [
            "160.6(6.32)"
        ],
        [
            "177.4(6.98)"
        ],
        [
            "290.0(11.42)"
        ],
        [
            "406.7(16.01)"
        ],
        [
            "440.1(17.33)"
        ],
        [
            "3,005.6(118.33)"
        ],
        [
            "Average rainy days (≥ 0.1 mm)"
        ],
        [
            "23"
        ],
        [
            "19"
        ],
        [
            "18"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "16"
        ],
        [
            "16"
        ],
        [
            "13"
        ],
        [
            "15"
        ],
        [
            "19"
        ],
        [
            "22"
        ],
        [
            "25"
        ],
        [
            "217"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "88"
        ],
        [
            "86"
        ],
        [
            "85"
        ],
        [
            "84"
        ],
        [
            "84"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "84"
        ],
        [
            "86"
        ],
        [
            "88"
        ],
        [
            "89"
        ],
        [
            "86"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Demography"
        ],
        [
            "Population census of GuiuanYearPop.±% p.a.1903 11,594—    1918 15,870+2.12%1939 23,110+1.81%1948 27,202+1.83%1960 22,881−1.43%1970 26,529+1.49%1975 28,709+1.60%YearPop.±% p.a.1980 30,689+1.34%1990 33,825+0.98%1995 35,447+0.88%2000 38,694+1.90%2007 43,469+1.62%2010 47,037+2.91%2015 52,991+2.30%Source: Philippine Statistics Authority"
        ],
        [
            "Guiuan recorded a total population of 38,694 in 2000, which rose to 47,037 in 2010 and 52,991 in 2015.",
            "It has the second largest population in Eastern Samar (after Borongan) with a population density of 270 persons per km2."
        ],
        [
            "Majority or 97.7% of the Guiuananons speak the Waray-Waray language.",
            "Less than 3.0% speak Cebuano (including the Boholano dialect) and Tagalog.",
            "A few percentage can converse in English, with varying degrees of proficiency."
        ],
        [
            "Economy"
        ],
        [
            "Lugay Street, one of the main thoroughfares in downtown Guiuan"
        ],
        [
            "Fisherfolks at the Guiuan Integrated Transport Terminal in April 2022"
        ],
        [
            "The Guiuan Public Market's wet section (fish and meat)"
        ],
        [
            "Guiuan is classified as a second income class municipality as of CY 2008.",
            "Its Total Financial Resources amounted to 67.71 million pesos.",
            "Its Internal Revenue Allotment (IRA) represents 78.0% of its total financial resources."
        ],
        [
            "Being a fishing community and the only municipality with the most number of island barangays, the town is rich in fishery and aquatic resources.",
            "It is considered by the fisheries authorities as the best fishing belt in the region."
        ],
        [
            "The coastal waters offer almost all species of marine life: euchuema, abalone, ornamental fish, lobster and the golden cowry (known for its extraordinary golden sheen).",
            "They also offer delicacies, shellcraft products as well as fresh and processed marine products."
        ],
        [
            "Existing land use indicates a predominance of agriculture which covers 38.2% of the total land area.",
            "Most of the agricultural lands are dominantly planted with coconut trees.",
            "Other major crops include vegetables, root crops, palay, corn, banana and other fruit trees, coffee and pineapple."
        ],
        [
            "The municipality is likewise rich in mineral resources.",
            "It has an estimated mineral reserve of bauxite, nickel and titaferous magnitie of more than 26.7 million metric tons.",
            "The most companies that Mined in the Municipality were Japanese during the 70s, 80s and the 90s, they brought about raw Mineral Ore to Japan then by empty ship back they brought with them some Japanese Surplus Motors and chopped spare parts including Electrical Appliances.Poverty incidence of Guiuan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  35.10"
        ],
        [
            "2009  41.95"
        ],
        [
            "2012  36.51"
        ],
        [
            "2015  34.59"
        ],
        [
            "2018  43.35"
        ],
        [
            "2021  35.22"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Transportation"
        ],
        [
            "Motorized outrigger boats moored at the Guiuan Integrated Transport Terminal"
        ],
        [
            "Motorized rickshaws, buses and other vehicles on stand-by in the Guiuan Integrated Transport Terminal"
        ],
        [
            "A busy street in downtown Guiuan, with both human-driven and motorized rickshaws"
        ],
        [
            "US military planes in Guiuan Airport on the aftermath of Typhoon Haiyan (Yolanda)"
        ],
        [
            "By air"
        ],
        [
            "Guiuan Airport has a 2,800-metre (9,200-ft) runway which can service light private planes, chartered cargo and military planes.",
            "The Guiuan Airport was upgraded in 2010.",
            "Cebu-based airline Mid-Sea Express had scheduled flights from Cebu City to Guiuan twice weekly on Saturdays and Mondays, using a 19-seater Jetstream 32 aircraft.",
            "Service started in 2012 but has now been discontinued."
        ],
        [
            "By land"
        ],
        [
            "The town is accessible by land with highway connection from Tacloban City, about three-four hours travel.",
            "Several buses and vans regularly shuttle passengers to Guiuan.",
            "It is also accessible from Borongan.",
            "Alternatively, several bus companies have daily trips to Guiuan from Manila.",
            "Travel time is approximately twenty-one hours."
        ],
        [
            "Since the town is a coastal municipality, it has a small seaport operational throughout the year."
        ],
        [
            "Point of Interest"
        ],
        [
            "Sulangan Church"
        ],
        [
            "The church is also known as The Shrine of St. Anthony of Padua.",
            "It is known to both the locals and pilgrims around Eastern Visayas because of being miraculous.",
            "Saint Anthony of Padua is considered the patron saint for lost items, articles, people, or even spiritual goods.",
            "Many people visit the church to ask Saint Anthony even the most impossible wishes and the saint is believed to grant them."
        ],
        [
            "Linao Cave"
        ],
        [
            "Linao Cave is one of the most famous attractions in Guiuan because of its crystal clear water.",
            "The cave is named linao which means \"clear\" in Waray."
        ],
        [
            "Utilities"
        ],
        [
            "The DOST-PAGASA Guiuan Weather Station in Barangay Sapao"
        ],
        [
            "The Guiuan Gymnasium in Poblacion Ward 8"
        ],
        [
            "Telephone companies operating in the municipality includes TELECOM, Globelines and Bayantel.",
            "Smart and Globe cellular phone companies are also operational.",
            "The town also has a local radio station, Radyo Natin Guiuan (103.7 MHz), serving Guiuan and neighboring areas in Eastern Visayas."
        ],
        [
            "In 2004, Eastern Samar Electric Cooperative (ESAMELCO) was able to energize Guiuan, Calicoan Island up to Sulangan covering 37 out of 60 barangays.",
            "Island barangays are served with electricity through generator sets either privately owned or operated by the barangay council.",
            "However, electricity shortages are frequent and subscribers experience weekly power failures, lasting for 10 to 12 hours or for 24 hours in severe cases."
        ],
        [
            "Guiuan is also the site of one of the weather stations of the Philippine Atmospheric, Geophysical and Astronomical Services Administration, located in Barangay Sapao.",
            "Positioned at 60 metres (200 ft) above sea level, the facility consists of a Surface Synoptic Station for usual weather observation and a Doppler weather radar station for detecting intensity (reflectivity) and velocity (by Doppler effect) of distant weather elements.",
            "The radar station was built and renovated with the aid of the Japan International Cooperation Agency (JICA)."
        ],
        [
            "References"
        ],
        [
            "^ \"DIY Budget Travel Guide to Guiuan, Eastern Samar\"."
        ],
        [
            "^  Municipality of Guiuan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ MacArthur, Douglas (1966).",
            "\"Chapter VIII: The Leyte Operation\".",
            "Reports of General MacArthur: The Campaigns of MacArthur in the Pacific.",
            "Vol. I.",
            "United States Army.",
            "Archived from the original on April 27, 2022.",
            "Retrieved April 27, 2022."
        ],
        [
            "^ a b Amazona, Roel (October 19, 2021).",
            "\"Eastern Samar town re-emphasizes role in World War II\".",
            "Philippine News Agency.",
            "Archived from the original on April 27, 2022.",
            "Retrieved April 27, 2022."
        ],
        [
            "^ \"Chapter XXIX: Bases in the Philippines\".",
            "Archived from the original on May 22, 2014.",
            "Retrieved April 27, 2022."
        ],
        [
            "^ Amazona, Roel (December 17, 2019).",
            "\"Further study on 'White Russian' refugees in E. Samar pushed\".",
            "Philippine News Agency.",
            "Archived from the original on April 27, 2022.",
            "Retrieved April 27, 2022."
        ],
        [
            "^ Coren, Anna; Botelho, Greg (November 12, 2013).",
            "\"'Everything is gone' in Guiuan, tropical paradise forever transformed by typhoon\".",
            "CNN.",
            "Archived from the original on 12 November 2013.",
            "Retrieved April 27, 2022."
        ],
        [
            "^ \"Severe Weather Bulletin #6 for Typhoon 'Yolanda' (Haiyan), issued at 5:00AM, 08 November 2013\".",
            "Facebook.",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "November 8, 2013.",
            "Retrieved April 27, 2022."
        ],
        [
            "^ Lim, Lance (November 8, 2021).",
            "\"Eight years after Yolanda: Guiuan town shows improved economic muscle\".",
            "Rappler.",
            "Archived from the original on April 27, 2022.",
            "Retrieved April 27, 2022."
        ],
        [
            "^ a b c Labro, Vicente S. (2011-06-11).",
            "\"Guiuan's treasure chest of history, natural wonders\".",
            "INQUIRER.net.",
            "Retrieved 2023-02-17."
        ],
        [
            "^ Delgado, Juan Jose (1751).",
            "Biblioteca Histórica Filipina: Historia general sacro-profana, política y natural de las islas del poniente llamadas Filipinas."
        ],
        [
            "^ \"A forgotten episode in Russian history leaves links with the Philippines\".",
            "INDEPENDENT.co.uk.",
            "4 December 2013.",
            "Retrieved January 13, 2019."
        ],
        [
            "^ \"An Act Creating the Barrio of Trinidad, Guiuan, Province of Samar\".",
            "LawPH.com.",
            "Retrieved 2011-04-09."
        ],
        [
            "^ \"Proclamation No.",
            "1801, s. 1978\".",
            "Official Gazette of the Republic of the Philippines.",
            "10 November 1978.",
            "Retrieved 24 May 2021."
        ],
        [
            "^ Final Report RE: Effects of Typhoon \"Yolanda\" (Haiyan) (PDF) (Report).",
            "The Philippine National Disaster Risk Reduction and Management Council.",
            "December 11, 2015.",
            "Archived (PDF) from the original on June 30, 2016.",
            "Retrieved May 6, 2016."
        ],
        [
            "^ \"Province: Eastern Samar\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on 5 June 2013.",
            "Retrieved 24 April 2013."
        ],
        [
            "^"
        ],
        [
            "\"Guiuan, Eastern Samar Climatological Normal Values\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on 14 October 2018.",
            "Retrieved 14 October 2018."
        ],
        [
            "^"
        ],
        [
            "\"Guiuan, Eastern Samar Climatological Extremes\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on 14 October 2018.",
            "Retrieved 14 October 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Eastern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Total Population by Province, City, Municipality and Barangay: as of May 1, 2010\" (PDF).",
            "2010 Census of Population and Housing.",
            "National Statistics Office.",
            "Archived from the original (PDF) on 20 March 2013.",
            "Retrieved 24 April 2013."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Guiuan."
        ],
        [
            "Wikivoyage has a travel guide for Guiuan."
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2016-03-04 at the Wayback Machine"
        ],
        [
            "Places adjacent to Guiuan"
        ],
        [
            "Mercedes"
        ],
        [
            "Leyte Gulf"
        ],
        [
            "Guiuan"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Leyte GulfLoreto, Dinagat Islands"
        ],
        [
            "vte Province of Eastern SamarBorongan (capital and largest city)Municipalities"
        ],
        [
            "Arteche"
        ],
        [
            "Balangiga"
        ],
        [
            "Balangkayan"
        ],
        [
            "Can-avid"
        ],
        [
            "Dolores"
        ],
        [
            "General MacArthur"
        ],
        [
            "Giporlos"
        ],
        [
            "Guiuan"
        ],
        [
            "Hernani"
        ],
        [
            "Jipapad"
        ],
        [
            "Lawaan"
        ],
        [
            "Llorente"
        ],
        [
            "Maslog"
        ],
        [
            "Maydolong"
        ],
        [
            "Mercedes"
        ],
        [
            "Oras"
        ],
        [
            "Quinapondan"
        ],
        [
            "Salcedo"
        ],
        [
            "San Julian"
        ],
        [
            "San Policarpo"
        ],
        [
            "Sulat"
        ],
        [
            "Taft"
        ],
        [
            "Component city"
        ],
        [
            "Borongan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Guiuan&oldid=1223901569\""
        ],
        [
            "Categories: GuiuanSurfing locations in the PhilippinesMining communities in the PhilippinesMunicipalities of Eastern SamarHidden categories: Pages using gadget WikiMiniAtlasPages using the Phonos extensionCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataPages using infobox settlement with possible motto listCoordinates on WikidataPages including recorded pronunciationsArticles containing Waray (Philippines)-language textArticles containing Filipino-language textArticles needing additional references from July 2022All articles needing additional referencesCommons category link from WikidataWebarchive template wayback links"
        ]
    ]
}