{
    "name": "Hagonoy",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Hagonoy, Bulacan"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°50′N 120°44′E﻿ / ﻿14.83°N 120.73°E﻿ / 14.83; 120.73"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bulacan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Hagonoy, Bulacan\" – news · newspapers · books · scholar · JSTOR (August 2010) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesHagonoyMunicipalityMunicipality of HagonoyMunicipal Hall"
        ],
        [
            "FlagSealNicknames: Aquaculture Capital of Bulacan"
        ],
        [
            "Leviticus Town"
        ],
        [
            "Motto(s): Ahon, Hagonoy!",
            "(Ascend, Hagonoy!)",
            "Map of Bulacan with Hagonoy highlightedOpenStreetMapHagonoyLocation within the PhilippinesCoordinates: 14°50′N 120°44′E﻿ / ﻿14.83°N 120.73°E﻿ / 14.83; 120.73CountryPhilippinesRegionCentral LuzonProvinceBulacanDistrict"
        ],
        [
            "1st districtFoundedJuly 26, 1581Barangays26"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFlordeliza C. Manlapaz • Vice MayorMa.",
            "Rosario Sy-Alvarado.",
            "Mendoza • RepresentativeDanilo A. Domingo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Maria Cristina G. PerezRaulito C. Manlapaz Jr.Millord S. CruzElmer S. SantosDalisay V. OpleChristopher R. BaluyotMichael Darwin M. CruzLamberto T. Villanueva"
        ],
        [
            " • Electorate82,230 voters (2022)Area • Revenue₱ 355.3 million (2020) • Assets₱ 991.7 million (2020) • Expenditure₱ 332.2 million (2020) • Liabilities₱ 354.3 million (2020)Utilties • ElectricityMeralcoTime zoneUTC+8 (PST)ZIP code3002PSGC0301409000IDD : area code +63 (0)44Native languagesTagalog Kapampangan"
        ],
        [
            "Hagonoy, officially the Municipality of Hagonoy (Tagalog: Bayan ng Hagonoy), is a 1st class municipality in the province of Bulacan, Philippines.",
            "According to the 2020 census, it has a population of 133,448 people."
        ],
        [
            "History"
        ],
        [
            "HAGONOY was first mentioned in the history of the Philippines in 1571.",
            "Even before the \"blood compact\" between the Spain's conqueror Miguel Lopez de Legazpi and the Philippines' Datu Sikatuna was made, the place was already known as Hagonoy.",
            "The land consists of archipelagic marsh and river tributaries going to the sea, where the first ancestors of this town probably took this way to reach Hagonoy."
        ],
        [
            "Hagonoy first appeared in Philippine history when they formed part of the fleet of Tarik Sulayman of Macabebe, Pampanga that met Martin de Goiti at the Battle of Bangkusay in the initial defense of the Lusong against the Spaniards in 1571."
        ],
        [
            "In the beginning, Hagonoy was part of Alcaldia de Calumpit as its visita together with Apalit.",
            "It has huge convent having founded on April 22, 1581, with Fray Diego Ordonez de Vivar as its first minister according to Gaspar's \"Conquistas delas Islas\" Book 2 (Fray Diego having credited for the christiniazation of Calumpit, Malolos and Bulakan).",
            "At first, it was also included in the territorial part of Encomienda de Calumpit that was given by Governor General Gonzalo Ronquillo to Sargento Juan de Moron for his good service and loyalty to Spanish Crown.",
            "Sargento Juan Moron once trusted his land to the Augustinian friars, and that's how it was handed to Fray Diego Vivar.",
            "It is also noted that on the primary sources documents such as Miguel de Loarca's \"Relacion delas Islas\" written in 1582 and Luis Perez de Dasmarinas report on King of Spain in June 1591 didn't mention Hagonoy as an independent encomienda or town, instead it is simultaneously with the much older town of Calumpit and it was officially established as a civil town in May 1671.",
            "According to records and old folks, there were already inhabitants in some places of this settlement.These places were Tibaguin and Pugad, coastal barrios sharing the coastline with the City of Malolos and towns of Bulakan, Obando and the City of Manila."
        ],
        [
            "Magat Salamat, a revolutionary hero, and the last Prince of the Kingdom of Tondo, once headed this town.",
            "He was the ancestor of the Salamat families now living in different barrios of this town."
        ],
        [
            "Origin of the name"
        ],
        [
            "The town was named after the \"hagunoy\" (Chromolaena odorata), a medicinal plant that used to be abundant in its river banks and along the seashores.",
            "The original populace used its leaves as their herbal remedy of choice for common illnesses and as food ingredients.",
            "Because of the medicinal value of the plant, the news of its effectiveness spread leading the people to call the place \"Hagonoy\"."
        ],
        [
            "Hagonoy's town legend"
        ],
        [
            "In the 16th century, some friars took a boat from Manila to the province of Bulacan and reached what was then called \"Quinabaloan\" (from Kapampangan word kinabaluan meaning \"had been known\" or \"pinag-alaman\" in Tagalog—which was then still part of the town of Calumpit and is now the barangays of Santa Monica and San Jose).",
            "At that time, a very charming lass was so popular among the young men of the locality.",
            "She had many suitors and admirers.",
            "One day, she felt ill and she needed someone to get leaves of the hagonoy plant by the river (which is now called Sapang Pari because the friars and priests used this river to commute)."
        ],
        [
            "A man offered to promptly get some leaves of the plant and in deep gratitude, she promised to marry him.",
            "As he was gathering the leaves of the hagunoy plant for his dearly beloved, the group of friars in a passing boat stopped to ask him, \"Quien vive?\"",
            "(Where are we?).",
            "The man did not understand Spanish and was extremely intimidated by the guardia civil (Spanish civil guard) that escorted the friars.",
            "Thinking that they were asking what he was grasping in his hands, he quickly retorted \"Hagunoy po!\"",
            "(Hagunoy, sir!)",
            "and scampered away."
        ],
        [
            "These were the first Augustinian friars that got into town and they noted the place's name as \"Hagonoy\".",
            "Hence, the origin of the illustrious town's name."
        ],
        [
            "Geography"
        ],
        [
            "With a total land area of 103.10 square kilometers, Hagonoy is situated at the south-west corner of the province of Bulacan.",
            "It is bounded by the municipality of Calumpit on the north, municipality of Paombong on the east, municipality of Masantol, Pampanga on the west and Manila Bay on the south.",
            "The municipality is approximately 54 kilometers from Metro Manila or about an hour and a half drive.",
            "It can be accessed via North Luzon Expressway and MacArthur Highway."
        ],
        [
            "Hagonoy is a long ridge with a lake on its edge by Manila Bay called \"Wawa\", which is now part of Barangays San Sebastian and San Nicolas.",
            "It is basically a fishing town with Manila Bay as its proximate fishing ground, which extends up to the provinces of Pampanga, Bataan, and Cavite.",
            "Its more adventurous fisherfolk brave the waves of the South China Sea northward and cross into the Philippine Sea in the Pacific Ocean on the eastern seaboard where they cast their nets and haul their catch to the fishing ports of Quezon province."
        ],
        [
            "Barangays"
        ],
        [
            "Barangay clusters of Hagonoy"
        ],
        [
            "Hagonoy is politically subdivided into 26 barangays grouped into 5 clusters or kumpol for statistical purposes.",
            "All barangays are classified as urban by the Philippine Statistics Authority.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 031409001   Abulalas"
        ],
        [
            " 4.0%"
        ],
        [
            " 5,283"
        ],
        [
            " 4,878"
        ],
        [
            "  ▴"
        ],
        [
            " 0.80%"
        ],
        [
            " 031409002   Carillo"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,708"
        ],
        [
            " 1,681"
        ],
        [
            "  ▴"
        ],
        [
            " 0.16%"
        ],
        [
            " 031409003   Iba"
        ],
        [
            " 4.0%"
        ],
        [
            " 5,321"
        ],
        [
            " 4,891"
        ],
        [
            "  ▴"
        ],
        [
            " 0.85%"
        ],
        [
            " 031409004   Mercado"
        ],
        [
            " 5.3%"
        ],
        [
            " 7,114"
        ],
        [
            " 6,851"
        ],
        [
            "  ▴"
        ],
        [
            " 0.38%"
        ],
        [
            " 031409005   Palapat"
        ],
        [
            " 1.8%"
        ],
        [
            " 2,364"
        ],
        [
            " 2,393"
        ],
        [
            "  ▾"
        ],
        [
            " −0.12%"
        ],
        [
            " 031409006   Pugad"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,907"
        ],
        [
            " 1,723"
        ],
        [
            "  ▴"
        ],
        [
            " 1.02%"
        ],
        [
            " 031409007   Sagrada Familia"
        ],
        [
            " 4.9%"
        ],
        [
            " 6,569"
        ],
        [
            " 6,794"
        ],
        [
            "  ▾"
        ],
        [
            " −0.34%"
        ],
        [
            " 031409008   San Agustin"
        ],
        [
            " 7.7%"
        ],
        [
            " 10,336"
        ],
        [
            " 10,291"
        ],
        [
            "  ▴"
        ],
        [
            " 0.04%"
        ],
        [
            " 031409009   San Isidro"
        ],
        [
            " 6.1%"
        ],
        [
            " 8,102"
        ],
        [
            " 7,314"
        ],
        [
            "  ▴"
        ],
        [
            " 1.03%"
        ],
        [
            " 031409011   San Jose"
        ],
        [
            " 3.5%"
        ],
        [
            " 4,646"
        ],
        [
            " 5,123"
        ],
        [
            "  ▾"
        ],
        [
            " −0.97%"
        ],
        [
            " 031409012   San Juan"
        ],
        [
            " 2.7%"
        ],
        [
            " 3,542"
        ],
        [
            " 3,175"
        ],
        [
            "  ▴"
        ],
        [
            " 1.10%"
        ],
        [
            " 031409013   San Miguel"
        ],
        [
            " 4.4%"
        ],
        [
            " 5,888"
        ],
        [
            " 5,767"
        ],
        [
            "  ▴"
        ],
        [
            " 0.21%"
        ],
        [
            " 031409014   San Nicolas"
        ],
        [
            " 3.8%"
        ],
        [
            " 5,113"
        ],
        [
            " 5,012"
        ],
        [
            "  ▴"
        ],
        [
            " 0.20%"
        ],
        [
            " 031409015   San Pablo"
        ],
        [
            " 2.5%"
        ],
        [
            " 3,346"
        ],
        [
            " 2,894"
        ],
        [
            "  ▴"
        ],
        [
            " 1.46%"
        ],
        [
            " 031409016   San Pascual"
        ],
        [
            " 4.5%"
        ],
        [
            " 5,957"
        ],
        [
            " 6,253"
        ],
        [
            "  ▾"
        ],
        [
            " −0.48%"
        ],
        [
            " 031409017   San Pedro"
        ],
        [
            " 3.8%"
        ],
        [
            " 5,042"
        ],
        [
            " 4,090"
        ],
        [
            "  ▴"
        ],
        [
            " 2.11%"
        ],
        [
            " 031409018   San Roque"
        ],
        [
            " 3.7%"
        ],
        [
            " 4,908"
        ],
        [
            " 4,676"
        ],
        [
            "  ▴"
        ],
        [
            " 0.49%"
        ],
        [
            " 031409019   San Sebastian"
        ],
        [
            " 6.1%"
        ],
        [
            " 8,193"
        ],
        [
            " 8,069"
        ],
        [
            "  ▴"
        ],
        [
            " 0.15%"
        ],
        [
            " 031409020   Santa Cruz"
        ],
        [
            " 2.6%"
        ],
        [
            " 3,484"
        ],
        [
            " 3,698"
        ],
        [
            "  ▾"
        ],
        [
            " −0.59%"
        ],
        [
            " 031409021   Santa Elena"
        ],
        [
            " 3.7%"
        ],
        [
            " 4,918"
        ],
        [
            " 4,650"
        ],
        [
            "  ▴"
        ],
        [
            " 0.56%"
        ],
        [
            " 031409022   Santa Monica"
        ],
        [
            " 6.2%"
        ],
        [
            " 8,317"
        ],
        [
            " 8,683"
        ],
        [
            "  ▾"
        ],
        [
            " −0.43%"
        ],
        [
            " 031409023   Santo Niño (Poblacion)"
        ],
        [
            " 3.3%"
        ],
        [
            " 4,415"
        ],
        [
            " 3,859"
        ],
        [
            "  ▴"
        ],
        [
            " 1.35%"
        ],
        [
            " 031409024   Santo Rosario"
        ],
        [
            " 3.9%"
        ],
        [
            " 5,251"
        ],
        [
            " 5,438"
        ],
        [
            "  ▾"
        ],
        [
            " −0.35%"
        ],
        [
            " 031409025   Tampok"
        ],
        [
            " 2.0%"
        ],
        [
            " 2,635"
        ],
        [
            " 2,788"
        ],
        [
            "  ▾"
        ],
        [
            " −0.56%"
        ],
        [
            " 031409026   Tibaguin"
        ],
        [
            " 2.2%"
        ],
        [
            " 2,884"
        ],
        [
            " 2,363"
        ],
        [
            "  ▴"
        ],
        [
            " 2.01%"
        ],
        [
            " 031409027   Iba‑Ibayo"
        ],
        [
            " 1.9%"
        ],
        [
            " 2,564"
        ],
        [
            " 2,335"
        ],
        [
            "  ▴"
        ],
        [
            " 0.94%"
        ],
        [
            "Total"
        ],
        [
            "133,448"
        ],
        [
            "125,689"
        ],
        [
            " ▴"
        ],
        [
            "0.60%"
        ],
        [
            "Change of barangay names"
        ],
        [
            "Some barangays had a different name than it does now.",
            "Their names derived from events, legends, things or the condition of the place (indicated in the parentheses) as follows:"
        ],
        [
            "Sagrada Familia (Malayak)"
        ],
        [
            "San Agustin (Bantayan)"
        ],
        [
            "San Juan (Burayag)"
        ],
        [
            "San Nicolas (Bangos)"
        ],
        [
            "San Pascual (Dita)"
        ],
        [
            "San Roque (Bagong Baryo)"
        ],
        [
            "San Sebastian (Wawa)"
        ],
        [
            "Santa Elena (Marulaw)"
        ],
        [
            "Santo Rosario (Tangos)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Hagonoy, Bulacan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "6(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "6(0.2)"
        ],
        [
            "17(0.7)"
        ],
        [
            "82(3.2)"
        ],
        [
            "122(4.8)"
        ],
        [
            "151(5.9)"
        ],
        [
            "123(4.8)"
        ],
        [
            "124(4.9)"
        ],
        [
            "99(3.9)"
        ],
        [
            "37(1.5)"
        ],
        [
            "21(0.8)"
        ],
        [
            "792(31.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "2.5"
        ],
        [
            "11.7"
        ],
        [
            "6.6"
        ],
        [
            "17.7"
        ],
        [
            "22.2"
        ],
        [
            "25.2"
        ],
        [
            "23.7"
        ],
        [
            "23.2"
        ],
        [
            "17.9"
        ],
        [
            "9.2"
        ],
        [
            "5.2"
        ],
        [
            "168.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of HagonoyYearPop.±% p.a.1903 21,304—    1918 22,490+0.36%1939 29,734+1.34%1948 37,532+2.62%1960 46,861+1.87%1970 59,889+2.48%1975 65,592+1.84%1980 73,176+2.21%1990 90,212+2.12%1995 99,423+1.84%2000 111,425+2.47%2007 124,748+1.57%2010 125,689+0.27%2015 129,807+0.62%2020 133,448+0.55%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Hagonoy, Bulacan was 133,448 people, with a density of 1,300 inhabitants per square kilometre or 3,400 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Hagonoy"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  6.70"
        ],
        [
            "2009  8.64"
        ],
        [
            "2012  8.58"
        ],
        [
            "2015  6.14"
        ],
        [
            "2018  4.88"
        ],
        [
            "2021  15.08"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Hagonoy is mainly a fishing municipality with 7,837.65 hectares devoted to fish farming or about three-fourths of its total land area.",
            "It is home to about 1,423 fishpond operators and 55 registered consignacions – a venue for trading aquaculture products.",
            "The town offers a variety of harvests which includes prawns, shrimps, milkfish, tilapia, crabs, mussels and oysters."
        ],
        [
            "With its abundant water resources and the coastal nature of the town, the majority of the population is dependent on the fishing industry.",
            "Even the municipal government has its own fishpond locally known as \"Propyus\", situated in Pugad and Tibaguin, two coastal barangays of Hagonoy along the coast of Manila Bay.",
            "It is subdivided to 7 lots with a combined lot area of 412 hectares of municipal waters."
        ],
        [
            "Two local fish ports called \"pundohan\" – one in barrio San Nicolas and the other at the Poblacion, are the busiest commercial areas in the town.",
            "Fish traders from Lucena and Dagupan among other merchants of other provinces are regular bulk buyers the local ports or at the private \"consignacions\" (brokerage) of the large milkfish growers."
        ],
        [
            "The coastal barrios are virtually 24/7 as fishermen go out to the sea at night for hours or even days while their loving families and relatives await them.",
            "Upon their return, their catch is immediately sorted out and sold at the local public markets and \"talipapa\" of the barangays.",
            "Their catch are also transported to the public markets in nearby towns and up to the public/private markets and supermarkets in Metro Manila."
        ],
        [
            "Barangay Santo Niño adjacent to the Poblacion is host to the numerous brokers of prawns for the domestic and export markets.",
            "The boats that sell their prawn catch at these brokers at times come from as far as the province of Capiz.",
            "A processing plant very near the brokers prepares and packages the prawns to export quality and global standards."
        ],
        [
            "There are 2 “talipapa” (flea markets) in Hagonoy that also played minor central business districts – Santo Rosario and San Agustin.",
            "Business activities include wet and dry markets, grocery stores, carinderia, and computer shops."
        ],
        [
            "According to the Commission on Audit (COA) 2010 Annual Financial Report, Hagonoy ranked as the 8th richest municipality in Bulacan, surpassing the annual income of other 1st class municipalities like Bocaue, Calumpit, Plaridel, San Ildefonso and Balagtas."
        ],
        [
            "Trade and commerce"
        ],
        [
            "Trade and commerce in Hagonoy is concentrated at the town center where the public market, municipal hall, church, schools, hospital, clinics, and commercial spaces are situated.",
            "Major business activities include drugstores, banks, financial institutions, private consignacions, restaurants/food shops, groceries, and construction supplies."
        ],
        [
            "Puregold Hagonoy - a hypermarket operated by Puregold Price Club, Inc., opened on October 24, 2012.",
            "It is located at Barangay Santo Niño (Poblacion)."
        ],
        [
            "Façade of Super 8 Grocery Warehouse Hagonoy"
        ],
        [
            "Super 8 Grocery Warehouse Hagonoy"
        ],
        [
            "Major Industries"
        ],
        [
            "Aquaculture"
        ],
        [
            "Agriculture"
        ],
        [
            "Flowers/Ornamental Plants"
        ],
        [
            "Food Processing"
        ],
        [
            "Furniture"
        ],
        [
            "Garments"
        ],
        [
            "Gifts/Houseware/Decors"
        ],
        [
            "Metalcraft"
        ],
        [
            "Major Products"
        ],
        [
            "Prawns, Milkfish, other Fishes and Crustaceans"
        ],
        [
            "Processed Food (bagoong alamang)"
        ],
        [
            "Processed Meat"
        ],
        [
            "Garments and Apparel"
        ],
        [
            "Toys and Giftware"
        ],
        [
            "Indigenous and raw materials"
        ],
        [
            "Bamboo and Sasa (Nipa) leaves"
        ],
        [
            "Communication"
        ],
        [
            "Philippine Long Distance Telephone Company (PLDT) and Digital Telecommunications Philippines, Inc. (DIGITEL) are the main landline telephone service provider in Hagonoy with 2,134 and 1,700 subscribers respectively."
        ],
        [
            "Many residents have subscribed to wireless phone services such as Globe, Smart, Talk 'N Text, TM (Touch Mobile), Sun Cellular and DITO.",
            "As per the Municipal Engineers Office record, there are 10 cell sites installed in strategic locations in Hagonoy to improve the signal coverage and reception."
        ],
        [
            "On the other hand, telegraph and express mail services are being provided by the local post office and private companies such as LBC and RCPI-Western Union."
        ],
        [
            "Government"
        ],
        [
            "Sangguniang Bayan of Hagonoy Building"
        ],
        [
            "Elected officials"
        ],
        [
            "The following officials were elected in the Philippine Elections on May 9, 2022, to serve a three-year term."
        ],
        [
            "Mayor: Flordeliza \"Baby\" C. Manlapaz (PDP-Laban)"
        ],
        [
            "Vice Mayor: Ma.",
            "Rosario \"Ate Charo\" Sy-Alvarado.",
            "Mendoza (PDP-Laban)"
        ],
        [
            "Councilors"
        ],
        [
            "Ma.",
            "Cristina \"Tina\" G. Perez (PDP-Laban)"
        ],
        [
            "Raulito \"Jey-R\" C. Manlapaz Jr. (PDP-Laban)"
        ],
        [
            "Millord S. Cruz (PDP-Laban)"
        ],
        [
            "Elmer S. Santos (PDP-Laban)"
        ],
        [
            "Dalisay \"Baby\" V. Ople (NUP)"
        ],
        [
            "Christopher \"Chris\" R. Baluyot (NUP)"
        ],
        [
            "Michael Darwin M. Cruz (PDP-Laban)"
        ],
        [
            "Lamberto \"Amber\" T. Villanueva (PDP-Laban)"
        ],
        [
            "List of mayors"
        ],
        [
            "Don Francisco L. Sebastian (first mayor)"
        ],
        [
            "Ramona S. Trillana"
        ],
        [
            "Emilio G. Perez (1963–1972)"
        ],
        [
            "Hermogenes B. Perez (1972–1986)"
        ],
        [
            "Wilhelmino M. Sy-Alvarado (1987–1998)"
        ],
        [
            "Felix V. Ople (1998–2007)"
        ],
        [
            "Angel L. Cruz Jr. (2007–2013)"
        ],
        [
            "Raulito T. Manlapaz Sr. (2013–2022)"
        ],
        [
            "List of vice mayors"
        ],
        [
            "Nestor S. Santos (1963–1967)"
        ],
        [
            "Maria Garcia (1967–1972)"
        ],
        [
            "Eleazer F. Laderas (1988–1995)"
        ],
        [
            "Maria G. Santos (1995–1998)"
        ],
        [
            "Josefina Contreras (2001–2004)"
        ],
        [
            "Marivic R. Sy-Alvarado (2004–2007)"
        ],
        [
            "Elmer Santos (2007–2010)"
        ],
        [
            "Reynaldo O. Santos (2010–2013)"
        ],
        [
            "Pedro S. Santos Jr. (2013–2019)"
        ],
        [
            "Angel L. Cruz Jr. (2019–2022)"
        ],
        [
            "Religion"
        ],
        [
            "National Shrine and Parish of St. Anne in the Philippines"
        ],
        [
            "Façade of the National Shrine of St. Anne"
        ],
        [
            "Interior of the National Shrine of St. Anne"
        ],
        [
            "Main article: National Shrine of Saint Anne"
        ],
        [
            "Hagonoy is deeply religious, in the town centre is the native's principal Church."
        ],
        [
            "It is composed of the sub-parish churches of San Agustin, San Jose, Santa Monica, San Nicolas, Santo Niño, San Sebastian, and Sitio Parong-Parong of Barangay San Agustin."
        ],
        [
            "St. John the Baptist Parish Church"
        ],
        [
            "Façade of St. John the Baptist Parish Church"
        ],
        [
            "Interior of St. John the Baptist Parish Church"
        ],
        [
            "Situated in Barangay San Juan, and is composed by the barangays of San Juan, Tampok, San Isidro, and San Miguel.",
            "Inaugurated on March 23, 1948, through Bishop Miguel O'Doherty of Archdiocese of Manila.",
            "Fr.",
            "Elias Reyes served as its first curate.",
            "The church was step by step reconstructed in the curation of Fr.",
            "Jose Ingco, Fr.",
            "Serafin Riedo de Dios, Fr.",
            "Antonio Borlongan, and Fr.",
            "Generoso Jimenez with the cooperation of Bishop Rufino J. Santos and the good people of the community."
        ],
        [
            "St. Helena Parish Church"
        ],
        [
            "Façade of the Parish Church of St. Helena"
        ],
        [
            "Interior of St. Helena Parish Church"
        ],
        [
            "The church became a parish on January 11, 1941, under the curation of its first curator Rev.",
            "Fr.",
            "Melchor A. Barcelona.",
            "It is composed of the sub-parish churches of Sagrada Familia, Sitio Buga, Sitio Tangos, Pugad and Tibaguin."
        ],
        [
            "Saint Anthony of Padua Parish Church"
        ],
        [
            "Façade of St. Anthony of Padua Parish Church"
        ],
        [
            "Interior of St. Anthony of Padua Parish Church"
        ],
        [
            "The church is situated at Barangay Iba, Hagonoy, Bulacan.",
            "It is composed of the sub-parish churches of Carillo, Iba-Ibayo, and Palapat in Hagonoy, and Iba O'Este and Iba Este in the town of Calumpit up North."
        ],
        [
            "Our Lady of Perpetual Help Parish Church"
        ],
        [
            "Façade of Our Lady of Perpetual Help Parish Church"
        ],
        [
            "Interior of Our Lady of Perpetual Help Parish Church"
        ],
        [
            "The church is situated at Barangay San Pedro, Hagonoy, Bulacan.",
            "It is composed of the sub-parish churches of Abulalas and San Pablo in Hagonoy, and San Isidro II in the town of Paombong."
        ],
        [
            "Our Lady of the Most Holy Rosary Parish Church"
        ],
        [
            "Façade of Our Lady of the Most Holy Rosary Parish Church"
        ],
        [
            "Interior of Our Lady of the Most Holy Rosary Parish Church"
        ],
        [
            "The church is situated at Barangay Santo Rosario, Hagonoy, Bulacan.",
            "It is composed of the sub-parish churches of Mercado, Santa Cruz, San Pascual, and San Roque."
        ],
        [
            "Culture"
        ],
        [
            "Annual fiestas are held to honor the town's and each barangay's patron saints.",
            "The town's patron saint is St. Anne (the mother of the Blessed Virgin Mary) or fondly called \"Apo Ana\" in the vernacular by the natives.",
            "She is enshrined at the church named after her in the poblacion.",
            "This church is a National Shrine.",
            "There are also small fiestas among the different puroks of the barangays, there are feasts for the: Sacred Heart of Jesus, Our Lady of the Rosary, and other commemorative feasts of the Catholic Church.",
            "The Holy Week observance includes self flagellants on the road, zarzuelas, the \"pabasa\" (the passion sang as a psalm), the Good Friday and Easter dawn processions, in all parish churches.",
            "The Good Friday processions of the Parishes like the Poblacion and the Santo Rosario parishes are attended by at least 15 to 30 Lenten icons.",
            "The fiestas and Holy Week rituals are deemed as a sacred tradition.",
            "Some barangays hold their feasts with extraordinary roadside decorations and buntings so elaborate that the road is almost covered with overhead decor sufficient to screen-off the sunlight at noontime."
        ],
        [
            "Major Fiestas in Hagonoy such as the Santo Niño Fiesta, Santa Elena Fiesta, & the Town’s Fiesta & Foundation Day are some of the major festivities in town."
        ],
        [
            "Date"
        ],
        [
            "Event"
        ],
        [
            "1 January or Last Sunday of April"
        ],
        [
            "Feast of the Holy Family (Barangay Sagrada Familia)"
        ],
        [
            "9 January"
        ],
        [
            "Feast of the Black Nazarene (Barangay San Agustin – Parong-Parong)"
        ],
        [
            "20 January"
        ],
        [
            "Feast of St. Sebastian (Barangay San Sebastian)"
        ],
        [
            "25 January"
        ],
        [
            "Feast of the Conversion of St. Paul the Apostle (Barangay San Pablo)"
        ],
        [
            "3 February"
        ],
        [
            "Ka Blas F. Ople Day (Commemorating the Birth of Hagonoy's Proud of Son)"
        ],
        [
            "11 February"
        ],
        [
            "Feast of Our Lady of Lourdes (Barangay Abulalas)"
        ],
        [
            "3rd Sunday of January (liturgical) & 2nd or 3rd Sunday of February (civil)"
        ],
        [
            "Feast of the Infant Jesus (Barangay Santo Niño)"
        ],
        [
            "2 April"
        ],
        [
            "Balagtas Day (Commemorating the birth of Francisco Baltazar)"
        ],
        [
            "10 April"
        ],
        [
            "Feast of Our Lady of Barangay (Barangay San Sebastian - Peralta)"
        ],
        [
            "Last Sunday of April"
        ],
        [
            "Pista ng Sama-samang Pasasalamat ng Bayang Hagonoy (Barangay Santo Niño – Poblacion)"
        ],
        [
            "1 May"
        ],
        [
            "Feast of St. Joseph the Worker (Barangay San Jose)"
        ],
        [
            "1 May & 14 September"
        ],
        [
            "Feast of the Holy Cross (Barangay Santa Cruz)"
        ],
        [
            "4 May"
        ],
        [
            "Feast of St. Helena, the Empress (Barangay Santa Elena)"
        ],
        [
            "1st Saturday of May"
        ],
        [
            "Feast of St. Monica (Barangay Santa Monica)"
        ],
        [
            "2nd week of May & 13 June"
        ],
        [
            "Feast of St. Anthony of Padua (Barangay Iba-Ibayo)"
        ],
        [
            "2nd week of May & 1st Sunday of October"
        ],
        [
            "Feast of the Most Holy Rosary (Barangay Santo Rosario)"
        ],
        [
            "8 May"
        ],
        [
            "Feast of St. Michael, the Archangel (Barangay San Miguel)"
        ],
        [
            "15 May"
        ],
        [
            "Feast of St. Isidore the Laborer, the Farmer (Barangay Tampok & Barangay San Isidro)"
        ],
        [
            "17 May"
        ],
        [
            "Feast of St. Paschal Baylon (Barangay San Pascual)"
        ],
        [
            "3 June"
        ],
        [
            "Feast of the Holy Trinity (Barangay San Agustin - Mestiza)"
        ],
        [
            "13 June"
        ],
        [
            "Feast of St. Anthony of Padua (Barangay Iba & Barangay Palapat)"
        ],
        [
            "24 June"
        ],
        [
            "Feast of St. John the Baptist (Barangay San Juan)"
        ],
        [
            "27 June"
        ],
        [
            "Feast of the Our Lady of Perpetual Help (Barangay San Pedro)"
        ],
        [
            "29 June"
        ],
        [
            "Feast of St. Peter, the Apostle (Barangay San Pedro)"
        ],
        [
            "26 July"
        ],
        [
            "Feast of St. Anne, Mother of Our Lady, Patroness of Hagonoy / Foundation Day of the town of Hagonoy / Palaisdaan Festival (Barangay Santo Niño – Poblacion)"
        ],
        [
            "31 July"
        ],
        [
            "Feast of St. Ignatius of Loyola (Barangay Pugad)"
        ],
        [
            "15 August"
        ],
        [
            "Bulacan Day (Foundation Day of the Province of Bulacan)"
        ],
        [
            "16 August"
        ],
        [
            "Feast of St. Roch (Barangay San Roque)"
        ],
        [
            "28 August"
        ],
        [
            "Feast of St. Augustine (Barangay San Agustin)"
        ],
        [
            "30 August"
        ],
        [
            "Marcelo H. Del Pilar Day (Commemorating the Birth of the Great Propagandist)"
        ],
        [
            "10 September"
        ],
        [
            "Feast of St. Nicholas of Tolentine (Barangay San Nicolas)"
        ],
        [
            "11 September"
        ],
        [
            "Thanksgiving Feast of Our Lady of Perpetual Help (Barangay Tampok – Sapang Bundok)"
        ],
        [
            "1st Sunday of October or 7 October"
        ],
        [
            "Feast of Our Lady of the Holy Rosary (Barangay Carillo)"
        ],
        [
            "24 October"
        ],
        [
            "Feast of St. Raphael, the Archangel (Barangay Tibaguin)"
        ],
        [
            "29 October"
        ],
        [
            "Anniversary of the National Shrine of St. Anne (Barangay Santo Niño – Poblacion)"
        ],
        [
            "26 November"
        ],
        [
            "Thanksgiving Feast of Virgen de los Remedios (Barangay Mercado)"
        ],
        [
            "8 December"
        ],
        [
            "Feast of the Immaculate Conception (Barangay Santo Niño – Sapang Pari)"
        ],
        [
            "Palaisdaan Festival/Desposorio Festival"
        ],
        [
            "On July 24, 2015 the municipality formally introduce the Palaisdaan Festival (or Pangisdaan Festival) nationwide through the morning show Umagang Kay Ganda of ABS-CBN Channel 2.",
            "Aside from showcasing the main livelihood of the town, the festival also offers a variety of cultural and religious events which the town of Hagonoy is known for.",
            "It is a month-long celebration in honor of the town's patroness, Saint Anne, and the founding anniversary of Hagonoy as a pueblo way back 1581.",
            "The celebration usually starts when the image of St. Anne visits places around Hagonoy or even outside the town.",
            "The processional image is then brought back to the shrine to formally open the festivity for the 9-days novena, followed by the fluvial parade or pagoda in the river systems of Hagonoy.",
            "Indak-kalye or street dancing is also one of the highlights of the festival, where the traditional Desposorio is danced to the tune of Lerion hymn.",
            "Other activities before the fiesta include entertainment and cultural programs, games or laro ng lahi, religious activities like baptism and confirmation.",
            "The Visperas Mayores or the day before the fiesta is also a highlight, this is when the battle of marching bands happens."
        ],
        [
            "On September 15, 2019, Iba National High School Dance Troupe, one of the pioneering school folk dancing group in Hagonoy, together with Liping Hagonoeño and with the help of Hiyas ng Hagonoy, featured the Palaisdaan Festival in the province-wide Singkaban Festival.",
            "They won 2nd place and Best in Costume award."
        ],
        [
            "Social services"
        ],
        [
            "Protective services"
        ],
        [
            "Hagonoy is generally a peaceful community.",
            "Peace and order is being maintained by the Philippine National Police – Hagonoy Station manned by 29 PNP personnel.",
            "The Hagonoy PNP is equipped by 24 long firearms and 17 short firearms, with 2 patrol cars and 4 motorcycles as service vehicles."
        ],
        [
            "In 2009, there were 113 reported crime incidence in the municipality.",
            "The crime solution efficiency rate is registered at 97.26%."
        ],
        [
            "Health and nutrition"
        ],
        [
            "There are 3 hospitals operating in Hagonoy – 2 private hospitals and a government-controlled district hospital.",
            "The Emilio Perez Memorial District Hospital, situated at Barangay Santo Nino, is a 50-bed capacity hospital that offers secondary healthcare services.",
            "It is one of the district hospitals owned and controlled by the Provincial Government of Bulacan.",
            "Immediately beside it is the Mateo-Mabborang General Hospital, a private hospital which was opened on October 9, 2010.",
            "The Divine Word Hospital is a private hospital situated at Barangay San Pedro also offers secondary healthcare services."
        ],
        [
            "These hospitals are being complemented by the Amado Aldaba Memorial Health Center, the main rural health unit (RHU) being operated by the municipal government.",
            "It offers primary healthcare services which also includes laboratory and dental services.",
            "Aside of this, 3 other rural health units in barangays San Juan, San Nicolas and Santo Rosario are also under the local government, headed by the municipal officer in RHU-Aldaba, and 3 other physicians are servicing the other RHUs."
        ],
        [
            "The municipality also operates two (2) physical therapy and rehabilitation centers.",
            "The first is located at the municipal compound while the other is situated at Barangay Santa Monica."
        ],
        [
            "The medical personnel of the municipal government is composed of 4 Rural Health Physicians, 4 public nurses, 26 midwives, 2 sanitary inspectors, 1 medical technologist and 2 dentists.",
            "These are aided by the 172 Barangay Health Workers at the barangay level."
        ],
        [
            "On the other hand, nutrition program is being implemented by the Municipal Nutrition Office.",
            "At the barangay, they are assisted by the 29 Lingkod Lingap sa Nayon (LLNs) supported by 189 Mother Leaders.",
            "As of 2008, there were 35 identified very low and 565 low nutritional status in Hagonoy."
        ],
        [
            "Transportation"
        ],
        [
            "The hanging bridge"
        ],
        [
            "In Hagonoy, the primary and most dominant mode of transportation is tricycle because of its narrow roads.",
            "In 2011, there are 4,671 registered members of Tricycle Operators and Drivers Association (TODA) in Hagonoy servicing all barangays except Pugad and Tibaguin.",
            "Both of those barangays are being served by passenger boats."
        ],
        [
            "Other modes of transportation are jeepneys and buses.",
            "There are about 565 registered jeepneys in Hagonoy plying 2 routes – Hagonoy-Malolos Bayan, and Hagonoy-BSU-Malolos Crossing-Robinsons.",
            "Passenger buses transport passengers in Hagonoy to and from Divisoria, Monumento, Cubao and Pasay in Metro Manila via the 2 bus companies that are presently operating in Hagonoy.",
            "The Baliwag Transit having 32 buses leaving Hagonoy every 30 minutes and the First North Luzon Transit with 11 buses leaving every 45 minutes."
        ],
        [
            "Baliwag Transit"
        ],
        [
            "First North Luzon Transit"
        ],
        [
            "Jeepneys (going to Paombong, Malolos Bayan, BSU, Malolos Crossing, and Robinsons Malolos)"
        ],
        [
            "Tricycles (most common mean of tranpostation locally)"
        ],
        [
            "Hanging and wooden bridges"
        ],
        [
            "The four hanging bridges which are now in state of disrepair are located in barangays Iba, Abulalas, Carillo and San Agustin.",
            "Barangay Abulalas' hanging bridge links it to Barangay San Isidro II in Paombong town.",
            "The bridge is about 200 meters long as it crossed the downstream of the Labangan Channel.",
            "In Barangay Carillo, residents said the hanging bridge in their village linking Barangay Abulalas was totally damaged just before the 2007 elections.",
            "Its steel cable snapped while supporters of a mayoralty candidate were crossing in April 2007.",
            "In Barangay San Agustin, residents are trying to protect what remains of their hanging bridge that links with Barangay San Pablo."
        ],
        [
            " Panorama from the bridge over the Angat River"
        ],
        [
            "Power and water supply"
        ],
        [
            "The power requirement of the entire municipality is supplied by the Manila Electric Company (Meralco) including the coastal barangays of Pugad and Tibaguin.",
            "While the Hagonoy Water District provides the water requirement of Hagonoy.",
            "It supplies the daily water use of all 26 barangays using their 24 barangay pump stations."
        ],
        [
            "Cemeteries"
        ],
        [
            "Hagonoy Public Cemetery"
        ],
        [
            "Hagonoy Catholic Cemetery"
        ],
        [
            "Hagonoy Memorial Park"
        ],
        [
            "Peralta Cemetery (San Sebastian)"
        ],
        [
            "Santo Rosario Catholic Cemetery"
        ],
        [
            "Santa Elena Catholic Cemetery"
        ],
        [
            "San Juan Cemetery"
        ],
        [
            "Iba Cemetery"
        ],
        [
            "Cherubim of Heaven Memorial Park (San Pedro)"
        ],
        [
            "Education"
        ],
        [
            "The educational institutions in Hagonoy is composed of: 29 public elementary schools, 10 private elementary schools, 4 public secondary schools, 4 private schools, 26 Day Care Centers, 1 Technical/Vocational School and 1 satellite campus of a state university."
        ],
        [
            "In School Year 2008–2009, the combined elementary school enrollment is 17,934, where 9 out of the 10 students are enrolled in public elementary school.",
            "On the other hand, secondary school enrolment is registered at 10,477 students, of which 78.45% are enrolled in public high school."
        ],
        [
            "Every barangay has a Day Care Center with an assigned Day Care Worker.",
            "The total number of children enrolled is 1,315 in School Year 2008–2009, composed of 629 boys and 686 girls."
        ],
        [
            "Tertiary/Technical schools"
        ],
        [
            "The Bulacan State University - Hagonoy Campus is a satellite university of Bulacan State University situated at Barangay Iba-Ibayo officially opened on June 7, 2011.",
            "The fourth satellite campus of BulSU offers courses on Criminology, Education, Engineering, Information Technology, Industrial Technology, Hospitality Management and Tourism Management."
        ],
        [
            "Public schools"
        ],
        [
            "College"
        ],
        [
            "Bulacan State University-Hagonoy Campus (Iba and Carillo)"
        ],
        [
            "High schools"
        ],
        [
            "Iba National High School"
        ],
        [
            "Mayor Ramona S. Trillana National High School"
        ],
        [
            "Santa Monica National High School"
        ],
        [
            "San Pedro National High School"
        ],
        [
            "Don Miguel High School"
        ],
        [
            "Elementary schools"
        ],
        [
            "Hagonoy East Central School (Santo Niño)"
        ],
        [
            "Hagonoy West Central School (Santo Rosario)"
        ],
        [
            "Abulalas Elementary School"
        ],
        [
            "Carillo Elementary School"
        ],
        [
            "Federico C. Suntay Elementary School (Palapat)"
        ],
        [
            "Hangga Elementary School (San Pedro)"
        ],
        [
            "Iba Elementary School"
        ],
        [
            "Iba-Ibayo Elementary School"
        ],
        [
            "Iba Poblacion Elementary School (Iba)"
        ],
        [
            "Mercado Elementary School"
        ],
        [
            "Pugad Elementary School"
        ],
        [
            "Sagrada Familia Elementary School"
        ],
        [
            "San Agustin Elementary School"
        ],
        [
            "Eugenio G. Sy Tamco Elementary School (San Isidro)"
        ],
        [
            "San Jose Elementary School"
        ],
        [
            "San Juan Elementary School"
        ],
        [
            "San Nicolas Elementary School"
        ],
        [
            "San Pablo Elementary School"
        ],
        [
            "San Pascual Elementary School"
        ],
        [
            "San Roque Elementary School"
        ],
        [
            "San Sebastian Elementary School"
        ],
        [
            "Santa Elena Elementary School"
        ],
        [
            "Santa Monica Elementary School"
        ],
        [
            "Tampok Elementary School"
        ],
        [
            "Tibaguin Elementary School"
        ],
        [
            "Don Miguel Elementary School (San Nicolas)"
        ],
        [
            "Sitio Buga Elementary School (Santa Elena)"
        ],
        [
            "Teodora Cruz Elementary School (San Miguel)"
        ],
        [
            "VCRaymundo Elementary School (Santa Cruz)"
        ],
        [
            "Private schools"
        ],
        [
            "Saint Mary's Academy of Hagonoy"
        ],
        [
            "Saint Anne's Catholic School"
        ],
        [
            "High schools"
        ],
        [
            "Godwin's Montessori School"
        ],
        [
            "Saint Anne's Catholic School (formerly known as Saint Anne's Catholic High School)"
        ],
        [
            "Saint Mary's Academy of Hagonoy (or SMA, formerly known as Saint Anne's Academy)"
        ],
        [
            "Mother of Perpetual Help School (offering Junior High School only)"
        ],
        [
            "Elementary schools"
        ],
        [
            "Hagonoy Ecumenical School"
        ],
        [
            "Godwin's Montessori School"
        ],
        [
            "Hagonoy Ecumenical School"
        ],
        [
            "Holy Child School of Hagonoy"
        ],
        [
            "Jesus is Lord Christian School"
        ],
        [
            "Saint Mary's Academy of Hagonoy"
        ],
        [
            "Santiago Trillana Academy"
        ],
        [
            "School of Wisdom for Ideal Children"
        ],
        [
            "St. Anne's Catholic School"
        ],
        [
            "Mother of Perpetual Help School"
        ],
        [
            "Victoria-Vazquez Christian School"
        ],
        [
            "Pre-School"
        ],
        [
            "Kid's Lane Learning Center"
        ],
        [
            "Mother of Perpetual Help School"
        ],
        [
            "Notable personalities"
        ],
        [
            "Pedro Bantigue y Natividad - a Priest and Bishop who served as Auxiliary Bishop of the Archdiocese of Manila and first Bishop of the Diocese of San Pablo, Laguna."
        ],
        [
            "Blas F. Ople - a journalist and politician having served several high-ranking positions in the executive and legislative branch of the Philippine government including Senate President, Secretary of Foreign Affairs and Minister of Labor."
        ],
        [
            "Pablo S. Trillana III - a historian and Knight Grand Cross of Rizal, who served as chairman of the National Historical Institute from 1999 to April 2002."
        ],
        [
            "Gallery"
        ],
        [
            "Hagonoy Public Market"
        ],
        [
            "Hagonoy Public Market Commercial Complex"
        ],
        [
            "Punduhang Bayan ng Hagonoy"
        ],
        [
            "Abulalas Wooden Bridge (now destroyed and replaced by a concrete bridge; since 2020)"
        ],
        [
            "Abulalas Hanging Bridge"
        ],
        [
            "Sub-Parish Church of Nuestra Señora Del Santisimo Rosario (Barangay Carillo)"
        ],
        [
            "Col. Santiago Trillana Monument"
        ],
        [
            "Holy Cross Marker for the foundation of Hagonoy"
        ],
        [
            "Save the Unborn Monument"
        ],
        [
            "Iba Barangay Hall"
        ],
        [
            "A monument in Ibanians Park Place"
        ],
        [
            "Manuel \"Kapitan Tuwi\" Garcia Monument"
        ],
        [
            "Sub-Parish Church of Virgen de los Remedios (Barangay Mercado)"
        ],
        [
            "Sub-Parish Church of St. Anthony of Padua (Barangay Palapat)"
        ],
        [
            "Rev.",
            "Fr.",
            "Celestino Rodriguez monument (Founder of St. Anne's Catholic School)"
        ],
        [
            "St. Anne's Catholic School"
        ],
        [
            "Sub-Parish Church of Jesus Nazareno (Barangay San Agustin)"
        ],
        [
            "Sub-Parish Church of San Isidro"
        ],
        [
            "Sub-Parish Church of San Jose"
        ],
        [
            "Sub-Parish Church of San Miguel"
        ],
        [
            "Sub-Parish Church of St. Nicholas of Tolentino"
        ],
        [
            "Sub-Parish Church of San Pascual"
        ],
        [
            "Minia's Kainan at Meriendahan (Barangay San Pedro)"
        ],
        [
            "Engr.",
            "Manuel R. Contreras Memorial Production Center - Hagonoy Water District"
        ],
        [
            "Sub-Parish Church of San Roque"
        ],
        [
            "Sub-Parish Church of San Sebastian"
        ],
        [
            "Sub-Parish Church of Santa Cruz"
        ],
        [
            "Santa Monica Barangay Hall"
        ],
        [
            "Sub-Parish Church of Santa Monica"
        ],
        [
            "Santa Monica Multi-purpose Center"
        ],
        [
            "St. Mary's Academy of Hagonoy Centennial Marker"
        ],
        [
            "Sub-Parish Church of Santo Niño"
        ],
        [
            "References"
        ],
        [
            "^ https://m.facebook.com/story.php?story_fbid=912357885569644&id=379195818885856"
        ],
        [
            "^  Municipality of Hagonoy |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Gaspar de San Agustin, Conquistas de las Islas Filipinas 1565-1615, Translated by Luis Antonio Mañeru, 1st bilingual ed , published by Pedro Galende, OSA: Intramuros, Manila, 1998."
        ],
        [
            "^ \"lakandula\".",
            "Archived from the original on 2008-02-24.",
            "Retrieved 2008-10-18."
        ],
        [
            "^ Jose A. Salazar, 1981"
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Manahan, Mons.",
            "Macario R.; Cruz, Rdo.",
            "P. Rodolfo C. (2000).",
            "Hagunoy sa Taon ng Hubileo 2000 (in Filipino).",
            "Hagonoy, Bulacan.",
            "p. 70.",
            "{{cite book}}:  CS1 maint: location missing publisher (link)"
        ],
        [
            "^"
        ],
        [
            "\"Hagonoy: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 12 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Archived copy\" (PDF).",
            "Archived from the original (PDF) on 28 July 2013.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ \"Top 50 Businesses\".",
            "Municipality of Hagonoy, Bulacan, Philippines Official website.",
            "Archived from the original on July 17, 2011.",
            "Retrieved June 15, 2011."
        ],
        [
            "^ a b Urera, Vivencio, ed.",
            "(1966).",
            "\"Municipal Officials\".",
            "Philippine Government Elective Officials: Semi-pictorial Directory.",
            "Manila, Philippines: Urema Publishing Co., Ltd. p. 126.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ a b Commission on Elections (1969).",
            "\"List of municipal and municipal district officials elected...\".",
            "Report of the Commission on Elections to the President of the Philippines and the Congress.",
            "Manila, Philippines: Bureau of Printing.",
            "p. 297.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ Balbin, Manny (May 14, 2013).",
            "\"Neophytes unseat incumbent mayors in Bulacan towns\".",
            "Rappler.",
            "Malolos City, Bulacan: Rappler Inc. Retrieved November 12, 2023."
        ],
        [
            "^ a b \"Local Results: Hagonoy - Bulacan\".",
            "GMA News Online.",
            "GMA Network.",
            "2019.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ \"Hon.",
            "Eleazer \"Eling\" F. Laderas\".",
            "Philippine Daily Inquirer.",
            "The Philippine Daily Inquirer, Inc. October 11, 2000. p. B11.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ \"Erap in Hagonoy\".",
            "Manila Standard.",
            "Kamahalan Publishing Corp. September 12, 1997. p. 3.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ \"Bulacan town execs denounce solon for abuses\".",
            "Philippine Daily Inquirer.",
            "The Philippine Daily Inquirer, Inc. June 8, 2002. p. A17.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ \"Priest pushes 'kariton' in filing bid\".",
            "Philippine Daily Inquirer.",
            "City of San Fernando: The Philippine Daily Inquirer, Inc. March 30, 2007. p. A19.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ Remollino, Alexander Martin (September 23, 2009).",
            "\"Surveillance on Jun Cruz Reyes: 'Attacks on Writers Are Attacks on the People'\".",
            "Bulatlat.",
            "Manila.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ Genovia, Cath (October 4, 2011).",
            "\"ASP joins Cerebral Palsied Awareness Week Celebrations\".",
            "Autism Society Philippines.",
            "Retrieved November 13, 2023.",
            "The Honorable Mayor was attending an equally important event on that same day and was not able to meet us, but we are honored to have Vice Mayor Rey Santos, who gave the welcome message."
        ],
        [
            "^ \"Municipal Mayors and Vice Mayors\" (PDF).",
            "Department of Budget and Management.",
            "2014.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ \"Eleksyon Results: Hagonoy - Bulacan\".",
            "GMA News Online.",
            "GMA Network.",
            "2016.",
            "Retrieved November 12, 2023."
        ],
        [
            "^ \"Bulacan, Philippines: Tourism: National Shrine of Saint Anne, Hagonoy, Bulacan\".",
            "Bulacan.gov.ph.",
            "Retrieved 2016-12-07."
        ],
        [
            "^ \"St. Anne National Shrine, Hagonoy, Bulacan, Philippines\".",
            "Gcatholic.org.",
            "Retrieved December 7, 2016."
        ],
        [
            "^ a b c d e f \"VICARIATE OF HAGONOY\".",
            "ANG SANDIGAN.",
            "Retrieved 2022-12-27."
        ],
        [
            "^ \"UKG in Hagonoy, Bulacan's Palaisdaan Festival\".",
            "Umagang Kay Ganda Official IG Account."
        ],
        [
            "^ \"Welcome to Hagonoy, Bulacan, Philippines Official Website : Business in Hagonoy, Bulacan\".",
            "Archived from the original on 19 July 2011."
        ],
        [
            "^ \"Tricycle drivers urged to register in 1st provincial TODA congress\".",
            "ugnayan."
        ],
        [
            "^ \"Hanging bridge sa Hagonoy, Bulacan, maaaring bumigay at masira\".",
            "GMA News (in Filipino).",
            "7 January 2016.",
            "Retrieved 5 February 2016."
        ],
        [
            "^ \"Mabuhay Online: DPWH urged to rush repair of Hagonoy hanging bridges\".",
            "Mabuhayonline.blogspot.com.",
            "2012-01-13.",
            "Retrieved 2016-12-07."
        ],
        [
            "^ \"Punto!",
            "Central Luzon\".",
            "Punto.com.ph.",
            "2012-01-12.",
            "Retrieved 2016-12-07."
        ],
        [
            "^ \"Welcome to Hagonoy, Bulacan, Philippines Official Website : About Hagonoy - Socio-Economic Profile\".",
            "Archived from the original on 2012-03-03.",
            "Retrieved 2016-12-07."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Hagonoy, Bulacan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Hagonoy Bulacan"
        ],
        [
            "Hagonoy Bulacan Website Archived 2009-03-10 at the Wayback Machine"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "2010 Philippine Census Information"
        ],
        [
            "Population of capital cities and cities of 100,000 and more inhabitants United Nations Statistics Division, accessed August 24, 2006"
        ],
        [
            "Places adjacent to Hagonoy, Bulacan"
        ],
        [
            "Calumpit"
        ],
        [
            "Masantol, PampangaMacabebe, Pampanga"
        ],
        [
            "Hagonoy"
        ],
        [
            "Paombong"
        ],
        [
            "Manila Bay"
        ],
        [
            "Articles Related to Hagonoy, Bulacan"
        ],
        [
            "vte Province of BulacanMalolos (capital)  San Jose del Monte (largest city)Municipalities"
        ],
        [
            "Angat"
        ],
        [
            "Balagtas"
        ],
        [
            "Bocaue"
        ],
        [
            "Bulakan"
        ],
        [
            "Bustos"
        ],
        [
            "Calumpit"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Guiguinto"
        ],
        [
            "Hagonoy"
        ],
        [
            "Marilao"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Pandi"
        ],
        [
            "Paombong"
        ],
        [
            "Plaridel"
        ],
        [
            "Pulilan"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Maria"
        ],
        [
            "Component cities"
        ],
        [
            "Baliwag"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Hagonoy,_Bulacan&oldid=1234126201\""
        ],
        [
            "Categories: Municipalities of BulacanPopulated places on Manila BayPopulated places on the Pampanga RiverHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsAccuracy disputes from March 2022CS1 maint: location missing publisherCS1 foreign language sources (ISO 639-2)CS1 maint: numeric names: authors listCS1 maint: archived copy as titleArticles with short descriptionShort description is different from WikidataArticles needing additional references from August 2010All articles needing additional referencesPages using infobox settlement with possible motto listCoordinates on WikidataArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from February 2016Commons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}