{
    "name": "Ibajay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Ibajay"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°49′16″N 122°09′42″E﻿ / ﻿11.8211°N 122.1617°E﻿ / 11.8211; 122.1617"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Aklan, Philippines"
        ],
        [
            "This article has multiple issues.",
            "Please help improve it or discuss these issues on the talk page.",
            "(Learn how and when to remove these template messages)"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Ibajay\" – news · newspapers · books · scholar · JSTOR (February 2013) (Learn how and when to remove this message)"
        ],
        [
            "This article may require copy editing for tone.",
            "You can assist by editing it.",
            "(April 2023) (Learn how and when to remove this message)"
        ],
        [
            " (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Western Visayas, PhilippinesIbajayMunicipalityMunicipality of IbajayIbajay Campo Verde Road"
        ],
        [
            "FlagSealMap of Aklan with Ibajay highlightedOpenStreetMapIbajayLocation within the PhilippinesCoordinates: 11°49′16″N 122°09′42″E﻿ / ﻿11.8211°N 122.1617°E﻿ / 11.8211; 122.1617CountryPhilippinesRegionWestern VisayasProvinceAklanDistrict"
        ],
        [
            "2nd districtBarangays35"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJose Miguel M. Miraflores • Vice MayorJulio M. Estolloso • RepresentativeTeodorico T. Haresco Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Cyril M. AlagHazzi S. IlinonMihrel S. SenatinAudinnei A. AguirreNestor Francisco M. InocencioJoy Clarisse R. BrionesRita S. MagbirayLowell S. Fernandez"
        ],
        [
            " • Electorate32,920 voters (2022)Area • Revenue₱ 181.1 million (2020) • Assets₱ 507.8 million (2020) • Expenditure₱ 166.3 million (2020) • Liabilities₱ 132.9 million (2020)Service provider • ElectricityAklan Electric Cooperative (AKELCO)Time zoneUTC+8 (PST)ZIP code5613PSGC060406000IDD : area code +63 (0)36Native languagesAklanon Hiligaynon Tagalog"
        ],
        [
            "Ibajay, officially the Municipality of Ibajay (Aklanon: Banwa it Ibajay; Hiligaynon: Banwa sang Ibajay; Tagalog: Bayan ng Ibajay), is a 3rd class municipality in the province of Aklan, Philippines.",
            "During the creation of Aklan Province in 1956, Ibajay was its biggest municipality in terms of population.",
            "According to the 2020 census, it has a population of 52,365 people, making it the third most populated town in Aklan."
        ],
        [
            "Ibajay is the birthplace of Col. Alejandro S. Melchor, whose design of the pontoon bridge contributed to the Allied Forces winning World War II."
        ],
        [
            "History"
        ],
        [
            "This section's tone or style may not reflect the encyclopedic tone used on Wikipedia.",
            "See Wikipedia's guide to writing better articles for suggestions.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            "Under the Spanish \"Panay Y Bayjay\""
        ],
        [
            "The autonomous barangays that the Spaniards encountered in Cebu could barely provide enough food for their needs.",
            "Miguel López de Legazpi had to move his camp, sailing from Cebu to Panay Island in 1569."
        ],
        [
            "Desiring to explore the island for food and spice, Legazpi ordered some of his men to move further on the island until they ran out of bread to eat.",
            "Tired and hungry, the Spaniards solicited something to eat from the natives.",
            "To their surprise, they were given a container full of brown rice.",
            "When the Spaniards asked the natives what kind of rice they passed, they politely replied, \"ba-hay,\" meaning third-class rice.",
            "In recognition of the generosity of the natives, they named the place \"Panay y bahay\"—the p place in Panay where there was, and the Spaniards were given \"ba-hay\" rice."
        ],
        [
            "The word Ibajay was initially written with the capital letter Y.",
            "It was only in 1902 that an American supervising teacher made the change from Ybajay to Ibajay because of the preference for the English alphabet and the difficulty of the Americans in spelling the word."
        ],
        [
            "Spanish authorities' first seat of government was in Boboc-on, Barangay Naile, in the 17th century.",
            "The system of government the Spaniards established was the encomienda.",
            "They ruled the natives by control of a royal grant from the King of Spain.",
            "The King of Spain appointed an encomiendero as the overseer, with the Governadorcillo, Cabeza Mayores and Cabezas de Barangay as subordinates."
        ],
        [
            "In the early part of the Spanish dominion, the barangay was the primary government structure in Ibajay.",
            "The Chieftain collected tributes from his sinakupan (people) and turned over the collections to the encomienderos.",
            "Later on, however, the barangay government was reorganized again into makeups.",
            "Each has to elect a governadorcillo.",
            "The governadorcillo was elected by the votes of selected married male natives called principales.",
            "The candidate must be recommended and nominated by the community or the encomiendero."
        ],
        [
            "But to the eyes of the natives, the village chief was just an administrative leader.",
            "He was not an absolute ruler like the Spaniards imposed.",
            "A traditional body of customs and procedures limited the scope of his authority.",
            "Although his position had become hereditary, it was initially attained by exhibiting more excellent prowess and valour, traits useful for the community's survival."
        ],
        [
            "Dismayed by the exploitative nature of the government system and their unwillingness to accept the Spanish sovereignty, Chieftains Hangoe, Sandok, and Kabatak fled to the vast mountains of Panay.",
            "Still, the Spanish continued their colonization.",
            "The natives could not do anything but accept the dictum of the Spaniards to survive and go on with their lives."
        ],
        [
            "The first native to hold public office in Sitio Boboc-on as governadorcillo was Don Francisco Dalisay, elected by the principales in 1673.",
            "However, Muslim pirates and bandits from Mindanao often pestered the town.",
            "Hence, in 1786, Governor Juan Sabino moved the seat of government to Sitio Maganhup, a vast land between now Barangay Naile and Barangay San Jose.",
            "However, the new site proved unsafe from the continued beleaguering of the lawless elements.",
            "Furthermore, it was not ideal for the natives because it was far from the farms they cultivated."
        ],
        [
            "Consequently, for the second time in 1792, Governor Jose Garcia transferred the seat of government to Sitio Adiango, now part of Barangay Laguinbanua.",
            "However, it only stayed there for 11 years.",
            "Captain Josef Flores moved the seat of government again to its present location.",
            "By the decree issued by the Governador of the Philippine Islands, watchtowers were fortified along the shorelines to warn and protect against bandits and crooks.",
            "A church was also erected."
        ],
        [
            "Revolution and American influence"
        ],
        [
            "The Philippine Revolution broke out in the later part of the 19th century.",
            "Under the leadership of Gen. Ananias Diokno, the Tagalog Insurrectos defeated and drove away the Spaniards hiding behind the buttress of the Catholic Convent in Poblacion."
        ],
        [
            "The Philippine flag was hoisted at the town square for the first time.",
            "In 1879, Don Ciriaco Tirol y Seneres was appointed acting Capitan Municipal until 1898.",
            "The following year, under the revolutionary government of Gen. Emilio Aguinaldo, Don Antonio Manikan was elected Capitan Municipal—the position he held until 1901."
        ],
        [
            "In 1902, The Americans reorganized the local government of Ibajay.",
            "They changed the designation of the head of the town from Captain Municipal to Municipal President.",
            "This year, the city's official name was changed from Ybajay to Ibajay."
        ],
        [
            "The first municipal President elected was Don Valintin Conanan.",
            "During his term, a cholera epidemic broke out in the Municipality of Ibajay.",
            "It snapped out so many lives.",
            "As a contingency, a new cemetery was opened near the Catholic Cemetery.",
            "It is now known as the Ibajay Municipal Cemetery."
        ],
        [
            "In the year 1921, Catalino Solidum was appointed Municipal President.",
            "He held the position for only a year.",
            "Moises T. Solidum replaced him the following year until 1925.",
            "Tomas Bautista became the mayor of Ibajay from 1926 to 1928, while Jose S. Conanan from 1937 to 1940."
        ],
        [
            "In 1941, Dr. Jose C. Miraflores became mayor until the outbreak of World War II.",
            "Ibajay, at that time, was razed to the ground by the Japanese troops.",
            "Many Ibayhanons suffered the painful consequences of the war.",
            "Also, the Guerilla Liberation Movement helped the Philippine forces become popular among the locals.",
            "Ibayhanon women formed the Ibajay Ladies Auxiliary War Relief Association (LAWRA) to raise funds and morale for the Revolutionary Army.",
            "From 1944 to 1945, many Filipino troops of the 6th, 61st and 62nd Infantry Division of the Philippine Commonwealth Army and the 6th Infantry Regiment of the Philippine Constabulary liberated the town of Ibajay, Aklan and helped Ibayhanon guerrilla groups and defeated Japanese troops at the end of World War II.",
            "Moreover, the local city government was established with Guillermo de los Reyes as acting municipal mayor.",
            "Moises T. Solidum later on, replaced him until 1946."
        ],
        [
            "Geography"
        ],
        [
            "Variant flag of Ibajay"
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 158.90 square kilometres (61.35 sq mi)  , constituting  8.72% of the 1,821.42-square-kilometre- (703.25 sq mi) total area of Aklan."
        ],
        [
            "Ibajay lies in the northwest section of Aklan province on Panay Island.",
            "It is bounded on the north by the Sibuyan Sea, east by Tangalan, west by Nabas, and south by Antique."
        ],
        [
            "The distance from Kalibo, the capital of AklanAklan, is 34 kilometres (21 mi) and takes 45 minutes to one hour by road transport.",
            "Its road networks are composed of 16 kilometres (9.9 mi) of National Road, 32.918 kilometres (20.454 mi) of Provincial Roads, and 75.430 kilometres (46.870 mi) of Barangay Road."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Ibajay, Aklan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "47(1.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "39(1.5)"
        ],
        [
            "48(1.9)"
        ],
        [
            "98(3.9)"
        ],
        [
            "150(5.9)"
        ],
        [
            "169(6.7)"
        ],
        [
            "147(5.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "172(6.8)"
        ],
        [
            "118(4.6)"
        ],
        [
            "80(3.1)"
        ],
        [
            "1,264(49.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "8.2"
        ],
        [
            "9.3"
        ],
        [
            "9.7"
        ],
        [
            "19.1"
        ],
        [
            "25.6"
        ],
        [
            "27.4"
        ],
        [
            "25.5"
        ],
        [
            "25.5"
        ],
        [
            "25.2"
        ],
        [
            "18.5"
        ],
        [
            "14.5"
        ],
        [
            "219.9"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Barangays"
        ],
        [
            "Ibajay is politically subdivided into 35 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 060406001   Agbago"
        ],
        [
            " 3.5%"
        ],
        [
            " 1,826"
        ],
        [
            " 1,857"
        ],
        [
            "  ▾"
        ],
        [
            " −0.17%"
        ],
        [
            " 060406002   Agdugayan"
        ],
        [
            " 2.3%"
        ],
        [
            " 1,221"
        ],
        [
            " 1,071"
        ],
        [
            "  ▴"
        ],
        [
            " 1.32%"
        ],
        [
            " 060406003   Antipolo"
        ],
        [
            " 1.6%"
        ],
        [
            " 817"
        ],
        [
            " 727"
        ],
        [
            "  ▴"
        ],
        [
            " 1.17%"
        ],
        [
            " 060406004   Aparicio"
        ],
        [
            " 1.7%"
        ],
        [
            " 887"
        ],
        [
            " 733"
        ],
        [
            "  ▴"
        ],
        [
            " 1.92%"
        ],
        [
            " 060406005   Aquino"
        ],
        [
            " 5.9%"
        ],
        [
            " 3,095"
        ],
        [
            " 2,791"
        ],
        [
            "  ▴"
        ],
        [
            " 1.04%"
        ],
        [
            " 060406006   Aslum"
        ],
        [
            " 2.7%"
        ],
        [
            " 1,434"
        ],
        [
            " 1,220"
        ],
        [
            "  ▴"
        ],
        [
            " 1.63%"
        ],
        [
            " 060406007   Bagacay"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,077"
        ],
        [
            " 949"
        ],
        [
            "  ▴"
        ],
        [
            " 1.27%"
        ],
        [
            " 060406008   Batuan"
        ],
        [
            " 2.3%"
        ],
        [
            " 1,186"
        ],
        [
            " 1,059"
        ],
        [
            "  ▴"
        ],
        [
            " 1.14%"
        ],
        [
            " 060406009   Buenavista"
        ],
        [
            " 0.9%"
        ],
        [
            " 485"
        ],
        [
            " 461"
        ],
        [
            "  ▴"
        ],
        [
            " 0.51%"
        ],
        [
            " 060406010   Bugtongbato"
        ],
        [
            " 3.0%"
        ],
        [
            " 1,577"
        ],
        [
            " 1,281"
        ],
        [
            "  ▴"
        ],
        [
            " 2.10%"
        ],
        [
            " 060406011   Cabugao"
        ],
        [
            " 0.4%"
        ],
        [
            " 225"
        ],
        [
            " 210"
        ],
        [
            "  ▴"
        ],
        [
            " 0.69%"
        ],
        [
            " 060406012   Capilijan"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,060"
        ],
        [
            " 974"
        ],
        [
            "  ▴"
        ],
        [
            " 0.85%"
        ],
        [
            " 060406013   Colongcolong"
        ],
        [
            " 2.2%"
        ],
        [
            " 1,137"
        ],
        [
            " 1,030"
        ],
        [
            "  ▴"
        ],
        [
            " 0.99%"
        ],
        [
            " 060406014   Laguinbanua"
        ],
        [
            " 6.2%"
        ],
        [
            " 3,226"
        ],
        [
            " 2,894"
        ],
        [
            "  ▴"
        ],
        [
            " 1.09%"
        ],
        [
            " 060406015   Mabusao"
        ],
        [
            " 1.3%"
        ],
        [
            " 661"
        ],
        [
            " 631"
        ],
        [
            "  ▴"
        ],
        [
            " 0.47%"
        ],
        [
            " 060406016   Malindog"
        ],
        [
            " 0.4%"
        ],
        [
            " 198"
        ],
        [
            " 187"
        ],
        [
            "  ▴"
        ],
        [
            " 0.57%"
        ],
        [
            " 060406017   Maloco"
        ],
        [
            " 5.0%"
        ],
        [
            " 2,635"
        ],
        [
            " 2,581"
        ],
        [
            "  ▴"
        ],
        [
            " 0.21%"
        ],
        [
            " 060406018   Mina-a"
        ],
        [
            " 1.3%"
        ],
        [
            " 683"
        ],
        [
            " 614"
        ],
        [
            "  ▴"
        ],
        [
            " 1.07%"
        ],
        [
            " 060406019   Monlaque"
        ],
        [
            " 1.7%"
        ],
        [
            " 899"
        ],
        [
            " 808"
        ],
        [
            "  ▴"
        ],
        [
            " 1.07%"
        ],
        [
            " 060406020   Naile"
        ],
        [
            " 4.8%"
        ],
        [
            " 2,517"
        ],
        [
            " 2,325"
        ],
        [
            "  ▴"
        ],
        [
            " 0.80%"
        ],
        [
            " 060406021   Naisud"
        ],
        [
            " 5.8%"
        ],
        [
            " 3,055"
        ],
        [
            " 2,838"
        ],
        [
            "  ▴"
        ],
        [
            " 0.74%"
        ],
        [
            " 060406022   Naligusan"
        ],
        [
            " 1.6%"
        ],
        [
            " 833"
        ],
        [
            " 758"
        ],
        [
            "  ▴"
        ],
        [
            " 0.95%"
        ],
        [
            " 060406023   Ondoy"
        ],
        [
            " 4.7%"
        ],
        [
            " 2,484"
        ],
        [
            " 2,294"
        ],
        [
            "  ▴"
        ],
        [
            " 0.80%"
        ],
        [
            " 060406024  Poblacion"
        ],
        [
            " 5.6%"
        ],
        [
            " 2,944"
        ],
        [
            " 2,804"
        ],
        [
            "  ▴"
        ],
        [
            " 0.49%"
        ],
        [
            " 060406025   Polo"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,095"
        ],
        [
            " 1,019"
        ],
        [
            "  ▴"
        ],
        [
            " 0.72%"
        ],
        [
            " 060406026   Regador"
        ],
        [
            " 3.8%"
        ],
        [
            " 1,998"
        ],
        [
            " 1,904"
        ],
        [
            "  ▴"
        ],
        [
            " 0.48%"
        ],
        [
            " 060406027   Rivera"
        ],
        [
            " 0.5%"
        ],
        [
            " 240"
        ],
        [
            " 199"
        ],
        [
            "  ▴"
        ],
        [
            " 1.89%"
        ],
        [
            " 060406028   Rizal"
        ],
        [
            " 2.5%"
        ],
        [
            " 1,307"
        ],
        [
            " 1,272"
        ],
        [
            "  ▴"
        ],
        [
            " 0.27%"
        ],
        [
            " 060406029   San Isidro"
        ],
        [
            " 3.3%"
        ],
        [
            " 1,704"
        ],
        [
            " 1,609"
        ],
        [
            "  ▴"
        ],
        [
            " 0.58%"
        ],
        [
            " 060406030   San Jose"
        ],
        [
            " 3.9%"
        ],
        [
            " 2,048"
        ],
        [
            " 1,684"
        ],
        [
            "  ▴"
        ],
        [
            " 1.98%"
        ],
        [
            " 060406031   Santa Cruz"
        ],
        [
            " 2.4%"
        ],
        [
            " 1,278"
        ],
        [
            " 1,142"
        ],
        [
            "  ▴"
        ],
        [
            " 1.13%"
        ],
        [
            " 060406032   Tagbaya"
        ],
        [
            " 3.4%"
        ],
        [
            " 1,761"
        ],
        [
            " 1,721"
        ],
        [
            "  ▴"
        ],
        [
            " 0.23%"
        ],
        [
            " 060406033   Tul-ang"
        ],
        [
            " 1.6%"
        ],
        [
            " 829"
        ],
        [
            " 628"
        ],
        [
            "  ▴"
        ],
        [
            " 2.82%"
        ],
        [
            " 060406034   Unat"
        ],
        [
            " 1.6%"
        ],
        [
            " 820"
        ],
        [
            " 741"
        ],
        [
            "  ▴"
        ],
        [
            " 1.02%"
        ],
        [
            " 060406035   Yawan"
        ],
        [
            " 0.6%"
        ],
        [
            " 322"
        ],
        [
            " 263"
        ],
        [
            "  ▴"
        ],
        [
            " 2.04%"
        ],
        [
            "Total"
        ],
        [
            "52,364"
        ],
        [
            "45,279"
        ],
        [
            " ▴"
        ],
        [
            "1.46%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of IbajayYearPop.±% p.a.1903 14,774—    1918 17,542+1.15%1939 22,740+1.24%1948 24,086+0.64%1960 25,305+0.41%1970 27,129+0.70%1975 30,343+2.27%1980 31,214+0.57%1990 35,640+1.34%1995 36,184+0.28%2000 39,643+1.98%2007 42,742+1.04%2010 45,279+2.12%2015 49,564+1.74%2020 52,364+1.09%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Ibajay had a population of 52,364.",
            "The population density was 330 inhabitants per square kilometre (850/sq mi)."
        ],
        [
            "Ibajay had a total population of 39,643 in the May 2000 census, with a calculated growth rate of 0.03%.",
            "The total number of households is 7,918, with an average household size of 5.",
            "At the 2010 census, the population had increased to 45,279 persons, a 14.2% increase since 2000."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Ibajay"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  36.30"
        ],
        [
            "2009  39.59"
        ],
        [
            "2012  20.00"
        ],
        [
            "2015  21.76"
        ],
        [
            "2018  13.92"
        ],
        [
            "2021  18.99"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Ibajay is classified as a third municipality (based on income).",
            "Rice farming is the primary source of income.",
            "Coconut produce plays a significant article in export and processing.",
            "There are 12 stationary rice mills and 21 roving rice mills for the post-harvest needs of the farmers.",
            "There are 25 registered cooperatives, most of which are the Farmer's Multipurpose Cooperatives.",
            "Vegetable and livestock production are on a backyard scale.",
            "Fishing and fishpond production is done along the nearby coastal barangays.",
            "The Ibajay Public Market at the Poblacion is the centre of business and trade.",
            "Three barangay markets are located at Barangay Naile, Maloco and San Jose."
        ],
        [
            "Government"
        ],
        [
            "Mayors and their dates of office:"
        ],
        [
            "Gavino C. Solidum (1946–1950)"
        ],
        [
            "Napoleon Mijares (1952–1956)"
        ],
        [
            "Maximo S. Masangcay (1957–1959)"
        ],
        [
            "Francisco Salido (1960–1963)"
        ],
        [
            "Roberto Q. Garcia (1964–1967)"
        ],
        [
            "Fidel G. Candari (1968–1971)"
        ],
        [
            "Florante M. Ascano (1971–1987)"
        ],
        [
            "Florencio T. Miraflores (1988–1995)"
        ],
        [
            "Pedro M. Garcia (1995–2001)"
        ],
        [
            "Roberto M. Garcia Jr. (2001–2007)"
        ],
        [
            "Ma.",
            "Lourdes M. Miraflores (2007–2016)"
        ],
        [
            "Jose Enrique M. Miraflores (2016–2022)"
        ],
        [
            "Jose Miguel M. Miraflores (2022–Present)"
        ],
        [
            "Tourism"
        ],
        [
            "Name"
        ],
        [
            "Description"
        ],
        [
            "Barangay"
        ],
        [
            " Ibajay Ati-Ati Festival"
        ],
        [
            "A devotional celebration every fourth Sunday of January in the Heart of Western Aklan.",
            "This yearly religious event is observed as a mark of respect for the town’s patron saint Santo Niño.",
            "The festival is being symbolized by transferring the image of the Holy Child from where it was originally discovered to the church to be witnessed by the devoted Catholics.",
            "Other barangays in Ibajay have their celebration of Ati-ati Fiesta; On the second Sunday of January for Naile and Sta.",
            "Cruz and fourth Saturday of January for Maloco."
        ],
        [
            " Poblacion"
        ],
        [
            " Katunggan it Ibajay Eco-Tourism Park"
        ],
        [
            "The Bugtongbato-Naisud basin (inland) mangrove boasts 28 mangrove species.",
            "It is the only mangrove community in the country that comprises 80% of the total 35 Philippine species.",
            "It has been identified and acknowledged by SEAFDEC-AQD as an ideal site for its various scientific researches on mangrove and aquaculture.",
            "With its high level of biodiversity, giant and century-old endemic mangrove species of natural growth will entice eco-tourists to explore what they think is impossible to discover.",
            "Three species studied and documented are in the red list vulnerable, nearly threatened and endangered."
        ],
        [
            "Naisud and Bugtong-bato"
        ],
        [
            "Yawa-Yawa Festival"
        ],
        [
            "(Niños Inocentes) Every 28th of December"
        ],
        [
            "Maloco and other remote barangays"
        ],
        [
            "Sniba-a Falls"
        ],
        [
            " One of Ibajay’s waterfalls is Snibaa Falls, a fine veil of white reachable after a brief mountain hike.",
            "Its cold waters can recharge you after a day’s worth of exploring."
        ],
        [
            "Aparicio"
        ],
        [
            "Nawidwid Falls and Su-ag Falls"
        ],
        [
            " Two of Ibajay’s best waterfalls."
        ],
        [
            "Mina-a"
        ],
        [
            "Campo Verde"
        ],
        [
            "Situated along the border of the municipalities of Tangalan and Ibajay, Campo Verde is 28 km west traveling distance from the capital town of Kalibo.",
            "Its altitude of 3,700 feet makes it ideal for retreats especially during summer.",
            "It is also known as the hikers’ paradise which abounds with thick tree plantations of green pines, mahogany, acacia, ipil-ipil, and butterfly trees that draws visitors to trek deeper into the woods."
        ],
        [
            "Regador"
        ],
        [
            " Alejandro Melchor's Birthplace"
        ],
        [
            "Ibajay is where a renowned Filipino in history who was distinguished for his work on bridges.",
            "Alejandro Melchor (1900-1947) was a civil engineer, mathematician, and educator who served as Secretary of National Defense under President Manuel Quezon.",
            "But Melchor’s major claim to fame was designing the pontoon bridges recognized to have contributed much to winning the Second World War for the Allied Forces."
        ],
        [
            "Aslum-Poblacion"
        ],
        [
            "Two Gabaldon Heritage School Buildings (DLRC Building and Ibajay Central School)"
        ],
        [
            " The Gabaldons are protected under Philippine law under Republic Act No.",
            "11194 or the Gabaldon School Buildings Conservation Act.",
            "Under the law the \"modification, alteration, destruction, demolition or relocation\" of Gabaldon buildings are illegal.",
            "The particular legislation also designates the Gabaldons as cultural properties citing another legislation known as the Republic Act 10066 or the National Cultural Heritage Act of 2009.",
            "The law mandates local government units to adopt measures for the protection and conversation of Gabaldon buildings under their jurisdiction"
        ],
        [
            "Poblacion"
        ],
        [
            "Town Proper"
        ],
        [
            "Ruins of Old Ibajay Church, 19th Century Church and Convent, Town Hall & Plaza, World War II Memorial and 1930's Rizal Monument"
        ],
        [
            "Poblacion"
        ],
        [
            "Ibajay Beach"
        ],
        [
            "Covering the 10 shoreline barangays, Ibajay Beach stretches from Barangay Bugtongbato to Barangay Aquino.",
            "Its pristine blue crystal waters along the shorelines are suitable for picnics and swimming."
        ],
        [
            "Bugtongbato to Aquino"
        ],
        [
            "Ibajay River"
        ],
        [
            "The massive Ibajay River, transversing the Municipality from the farthest barangay of Yawan to the mouth of the River at Poblacion, is pompous of its clear and surging waters which had created gigantic and mystic boulders along the way challenging bamboo rafters in shooting its rapids and dubious currents-offering great adventures for water sports enthusiasts and eco-tourists."
        ],
        [
            "Yawan to Poblacion"
        ],
        [
            "Balinsayaw Rocky Mountain"
        ],
        [
            "The peak is a version of Mt.",
            "Maculot's famous Rockies except from the Taal Lake view"
        ],
        [
            "Mabusao"
        ],
        [
            "Paeantawan Mountain"
        ],
        [
            "The Paeantawan (a high place from where to look around) is a circular mountain with three peaks, a deep depression in the middle, and a narrow opening looking to the west.",
            "From the inside, it is like a bowl with uneven rim and a break on one side.",
            "From the highest peak, one can see the Sibuyan Sea, the Poblacion (municipal capital), Barangays Tagbaya and Agbago on the north; on the northeast and east, Barangays Laguinbanua, Bagacay, Batuan and Capilijan; on the south and west are groups of mountains one of which is Banderahan, the highest mountain peak in Barangay Santa Cruz.",
            "Anyone from as far as one and a half kilometers from Paeantawan can be observed with the unaided eyes.",
            "It was from the highest Paeantawan peak, garrisoned by the Japanese occupation forces and served as both observation and battery posts, that a Japanese sniper shot and killed a Catholic priest, Father Nicomedes Solidum Masangkay, a native of Santa Cruz, who was running along a creek below.",
            "Garison (from garrison) some 500 meters south of Paeantawan and slightly higher is reportedly the most destructive of all Japanese garrisons in Santa Cruz.",
            "From this peak, most of the effective sniper and machine gun fires poured into Santa Cruz and other places that can be seen from Paeantawan came from.",
            "Filipino guerrillas attempted to wrest control of Garison from the Japanese, but they failed.",
            "The Japanese did not leave, unobserved, until the Liberation.",
            "Today, one can see only shallow and barely discernible depressions on the summit of Paeantawan of what was once a labyrinth of running foxholes able to hide a standing man.",
            "There are no reminders of World War II in Garison except its name."
        ],
        [
            "Santa Cruz"
        ],
        [
            "Products and Produce"
        ],
        [
            "Ibajay is famous for its nito handicraft made particularly in Barangay Mabusao, Regador and San Jose and has already become an export potential.",
            "Pottery has been a traditional industry of Barangay Coloncolong and their intricately-designed jars, vases, flower pots, and bricks have attracted traders, tourists and commuters along the National Highway where their products are displayed.",
            "A sumptuous ”linumak” commonly prepared in households is now commercially available.",
            "Pulvoron and other native delicacies are becoming popular as gifts and “pasalubong” abroad."
        ],
        [
            " Mambusao, San Jose, Regador, and Colong-Colong"
        ],
        [
            "Utilities"
        ],
        [
            "Communication and Postal services are available through the Philippine Postal Corporation, Inc. and the Bureau of Telecommunications.",
            "A PLDT, CRUZTELCO, and PANTELCO Public Calling Office provide long-distance and domestic telecommunication needs of the Ibayhanons.",
            "The Aklan Cable TV and Kalibo Cable TV provide the cable television services of the town."
        ],
        [
            "The electricity is provided by the Aklan Electric Cooperative, which serves about 3,862 households.",
            "Barangay Malindog purchased its generator to provide alternative power to its residents.",
            "Barangay Aparicio and Mina-a completed the Micro-Hydro Power Plant projects and are now operational to provide electricity to the residents."
        ],
        [
            "Healthcare"
        ],
        [
            "Health services are provided by the Ibajay District Hospital and 11 Barangay Health Stations."
        ],
        [
            "Education"
        ],
        [
            "There are 17 Elementary Schools, 14 Primary Schools, 5 National High Schools and Aklan State University (ASU) – Ibajay Campus for tertiary education."
        ],
        [
            "There are also two (2) private secondary schools.",
            "One is Ibajay Academy, founded by Procopio Solidum, who was hailed as the \"First Filipino poet to publish poems in English\" or \"First Filipino-English Poet.\"",
            "The other is Melchor Memorial School, founded by Dr Rafael S. Tumbokon in honour of the late Col. Alejandro S. Melchor, Sr."
        ],
        [
            "Notable personalities"
        ],
        [
            "Col. Alejandro Melchor Sr. (1900-1947) — designed the pontoon bridge contributed to the Allied Forces winning World War II / Secretary of National Defense in President Manuel L. Quezon's Cabinet / Sergio Osmeña's Military Adviser of the war cabinet"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Ibajay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Aklan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Ibajay: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 1 May 2020."
        ],
        [
            "^ a b \"Municipal: Ibajay\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Aklan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "Philippine History, American History, Spanish history.",
            "The outlook for the Philippines, by Charles Edward Russell.",
            "Published 11922 New York Century Co."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Ibajay."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "ABS-CBN Choose Philippines travelogue on Ibajay"
        ],
        [
            "Places adjacent to Ibajay"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "Nabas"
        ],
        [
            "Ibajay"
        ],
        [
            "Tangalan"
        ],
        [
            "Pandan, Antique"
        ],
        [
            "vte Province of AklanKalibo (capital and largest municipality)Municipalities"
        ],
        [
            "Altavas"
        ],
        [
            "Balete"
        ],
        [
            "Banga"
        ],
        [
            "Batan"
        ],
        [
            "Buruanga"
        ],
        [
            "Ibajay"
        ],
        [
            "Kalibo"
        ],
        [
            "Lezo"
        ],
        [
            "Libacao"
        ],
        [
            "Madalag"
        ],
        [
            "Makato"
        ],
        [
            "Malay"
        ],
        [
            "Malinao"
        ],
        [
            "Nabas"
        ],
        [
            "New Washington"
        ],
        [
            "Numancia"
        ],
        [
            "Tangalan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Ibajay&oldid=1216381369\""
        ],
        [
            "Category: Municipalities of AklanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from February 2013All articles needing additional referencesWikipedia articles needing copy edit from April 2023All articles needing copy editArticles with multiple maintenance issuesCoordinates on WikidataArticles containing Tagalog-language textWikipedia articles with style issues from October 2016All articles with style issuesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}