{
    "name": "Initao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Initao"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიമലയാളംBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°30′00″N 124°19′00″E﻿ / ﻿8.5°N 124.3167°E﻿ / 8.5; 124.3167"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Misamis Oriental, Philippines"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesInitaoMunicipalityMunicipality of InitaoThe New Initao Municipal Hall"
        ],
        [
            "FlagMap of Misamis Oriental with Initao highlightedOpenStreetMapInitaoLocation within the PhilippinesCoordinates: 8°30′00″N 124°19′00″E﻿ / ﻿8.5°N 124.3167°E﻿ / 8.5; 124.3167CountryPhilippinesRegionNorthern MindanaoProvinceMisamis OrientalDistrict"
        ],
        [
            "2nd districtBarangays16"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMercy Grace J. Acain • Vice MayorEnerito J. Acain V • RepresentativeYevgeny Vincente B. Emano • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Louie Jay Ban JaralesRichard MagnoCora SayreRichard GoAriel GalarozaAgustin CaberteHernan CarbonillaVictoria Galarroza"
        ],
        [
            " • Electorate22,655 voters (2022 general election)Area • Revenue₱ 176.4 million (2020) • Assets₱ 567.9 million (2020) • Expenditure₱ 134.9 million (2020) • Liabilities₱ 132.6 million (2020)Service provider • ElectricityMisamis Oriental 1 Rural Electric Cooperative (MORESCO 1)Time zoneUTC+8 (PST)ZIP code9022PSGC104310000IDD : area code +63 (0)88Native languagesCebuano Binukid Subanon TagalogWebsitenone"
        ],
        [
            "Initao, officially the Municipality of Initao (Cebuano: Lungsod sa Initao; Tagalog: Bayan ng Initao), is a 3rd class municipality in the province of Misamis Oriental, Philippines.",
            "According to the 2020 census, it has a population of 33,902 people."
        ],
        [
            "It is seated about 39 kilometres (24 mi) west of the provincial capital of Cagayan de Oro, 29 kilometres (18 mi) east of Iligan City, and about 767 kilometres (477 mi) south-south-east of Philippine capital, Manila.",
            "The nearest primary road network is the Butuan–Cagayan de Oro–Iligan Road.",
            "The nearest airport is Laguindingan International Airport located 39 minutes away towards Cagayan de Oro."
        ],
        [
            "HazardHunterPh app assessment on seismic hazard marks the town safe from ground rupture, prone to ground shaking and generally susceptible to liquefaction.",
            "Volcanic Hazard assessment mainly identifies it as having no immediate volcanic hazard threat base on its location to the nearest active volcano.",
            "However, it has high susceptibility to flooding at 1 to 2 meters flood height and lasting for more than 3 days."
        ],
        [
            "Economic activity in the area is mainly dependent on fishing, agriculture, retail, tourism and government services such as The Misamis Oriental Provincial Hospital-Initao, Regional Trial Court Branch 44, Initao-Libertad 8th Municipal Circuit Trial Court, Initao College, the BJMP, DENR, DepEd etc.",
            "According to the Bureau of Local Government Finance, the annual regular revenue of Initao for the fiscal year of 2016 was ₱98,017,030.37."
        ],
        [
            "Tourism sites include the Initao-Libertad Protected Landscape and Seascape which locals simply call \"lasang\" or forest in the local dialect, various beaches dotting its shorelines and recent additions of agritourism sites developed by locals."
        ],
        [
            "Significant town celebrations include the town fiesta celebrated by Roman Catholics in honor of the Patron Saint Francis Xavier which is held every December 2 and 3 although the celebration stretches for a week.",
            "Various festivals promoting tourism are also being spearheaded by the LGU and the Provincial Government of Misamis Oriental."
        ],
        [
            "History"
        ],
        [
            "White sand beach at Initao"
        ],
        [
            "Based on the research report submitted by L.M.",
            "Neri, A.M.M.",
            "Ragrario, E.C.R.",
            "Robles, and A.J.",
            "Carlos, the original settlers of Initao were the Bukidnons.",
            "They were described as warlike and aggressive and ready to sacrifice their lives in defending their territory.",
            "It is said that the early community in Initao was ruled by three (3) brothers named Datu Hukom, Datu Tamparong, and Datu Pulagoyan, who had to protect early settlers in Initao against Moro invasions in the sixteenth century."
        ],
        [
            "Because of the frequent threat by the Moro pirates, the people of Initao became war-like.",
            "They were considered to be hot-blooded or hot-tempered, fearless fighters.",
            "Hence, the word Initao comes from the word init which means “hot” and tao which means “people.” They were people perpetually prepared to fight their enemy to defend their territory and community.",
            "Legend also has it that the Moro raiders were defeated, the people planted bamboo along the Initao River as a symbol of peace and truce among them."
        ],
        [
            "The word Initao, originally spelled by the Spaniards as Ynitao, was mentioned on August 6, 1838, in the inventory of livestock, fruits, exotic and cereal plants in the Provincia de Misamis (Ereccion de Pueblos, Misamis 1808–1839).",
            "In May 1858, Ynitao was headed by Gobernadorcillo Francisco Antonio and succeeded by Gobernadorcillo Abariano Caburratan in 1894."
        ],
        [
            "In 1838, Initao was a Spanish pueblo composed of 3 cabecerias (Ereccion de Pueblos, Misamis 1808–1839).",
            "On October 27, 1877, Ynitao had 7 cabecerias which became 8 on June 30, 1882.",
            "It was decreased to 1 cabeceria, known as Apas, on June 30, 1883, until 1884 with a total population of 1,514.",
            "On June 30, 1887, Ynitao again increased its number of cabeceria to 19 and decreased to 12 on October 3, 1892."
        ],
        [
            "In 1896–1902, Ynitao was in the province of Lanao.",
            "In 1903, Initao once again became a pueblo.",
            "The municipality is one of the oldest in the western part of Misamis Oriental."
        ],
        [
            "Initao, which became part of the then-undivided Misamis, reduced its territory following the establishment of Moro Province in 1903 through Act No.",
            "787."
        ],
        [
            "In 1957, the barrio of Naawan, then part of Initao, was constituted into the town of Naawan."
        ],
        [
            "Moreover, the municipalities of Manticao and Lugait were once part of Initao until 1948."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Rural area"
        ],
        [
            "Initao is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Aluna"
        ],
        [
            "Andales"
        ],
        [
            "Apas"
        ],
        [
            "Calacapan"
        ],
        [
            "Gimangpang"
        ],
        [
            "Jampason"
        ],
        [
            "Kamelon"
        ],
        [
            "Kanitoan"
        ],
        [
            "Oguis"
        ],
        [
            "Pagahan"
        ],
        [
            "Poblacion"
        ],
        [
            "Pontacon"
        ],
        [
            "San Pedro"
        ],
        [
            "Sinalac"
        ],
        [
            "Tawantawan"
        ],
        [
            "Tubigan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Initao, Misamis Oriental"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "271(10.7)"
        ],
        [
            "217(8.5)"
        ],
        [
            "193(7.6)"
        ],
        [
            "178(7.0)"
        ],
        [
            "344(13.5)"
        ],
        [
            "423(16.7)"
        ],
        [
            "362(14.3)"
        ],
        [
            "358(14.1)"
        ],
        [
            "329(13.0)"
        ],
        [
            "320(12.6)"
        ],
        [
            "322(12.7)"
        ],
        [
            "260(10.2)"
        ],
        [
            "3,577(140.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "23.2"
        ],
        [
            "19.5"
        ],
        [
            "22.0"
        ],
        [
            "22.8"
        ],
        [
            "29.6"
        ],
        [
            "28.9"
        ],
        [
            "30.3"
        ],
        [
            "29.8"
        ],
        [
            "28.1"
        ],
        [
            "28.8"
        ],
        [
            "26.1"
        ],
        [
            "24.1"
        ],
        [
            "313.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of InitaoYearPop.±% p.a.1903 4,374—    1918 7,371+3.54%1939 19,576+4.76%1948 39,462+8.10%1960 17,272−6.65%1970 16,904−0.21%1975 18,906+2.27%1980 21,842+2.93%YearPop.±% p.a.1990 23,113+0.57%1995 23,340+0.18%2000 27,035+3.20%2007 29,624+1.27%2010 29,331−0.36%2015 32,370+1.90%2020 33,902+0.91%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Initao, Misamis Oriental, was 33,902 people, with a density of 300 inhabitants per square kilometre or 780 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Initao"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  44.30"
        ],
        [
            "2009  48.85"
        ],
        [
            "2012  30.46"
        ],
        [
            "2015  31.86"
        ],
        [
            "2018  17.00"
        ],
        [
            "2021  25.50"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Lasang"
        ],
        [
            "Initao Beach"
        ],
        [
            "Lasang Secret Adventure is a 57-hectare natural forest with diverse flora and fauna located within the Initao–Libertad Protected Landscape and Seascape, accessible via the Butuan-Cagayan de Oro-Iligan Road that convenient snakes through the heart of the forest.",
            "Attractions and activities include split-nosed bats, caves, spelunking, fishing, swimming, snorkeling, scuba diving, cliff diving, and day camping.",
            "Facilities for overnight stays are present.",
            "Be aware though, that the place may be closed to visitors during major holidays.",
            "Philippine native trees are also found in the area."
        ],
        [
            "Mount Kitanglay considered to be the highest elevation in the municipality is located in Brgy Tawantawan.",
            "It is a beginner-friendly climb which affords a panoramic view of the Iligan Bay."
        ],
        [
            "Many private beach resorts also dot the shorelines of this town.",
            "From the white sandy beaches of Brgy.",
            "Tubigan, to the black sand beaches of Brgy.",
            "Gimangpang, to the rocky cliffs of Brgy.",
            "Pagahan and Brgy.",
            "Jampason."
        ],
        [
            "Inland resorts and venues include JEstrella Resort in Brgy.",
            "Jampason, Duthai Swimming Pool in the Poblacion, SJ & Telights in Brgy.",
            "Pagahan, Precious Overview with Bali feels in Brgy.",
            "Oguis, Julemons Nature Farm in Brgy.",
            "Tawantawan."
        ],
        [
            "The Initao Municipal Hall also draw interest from visitors because of its unusual design."
        ],
        [
            "Insfrastructure"
        ],
        [
            "Health Care"
        ],
        [
            "Misamis Oriental Provincial Hospital-Initao is conveniently located within the municipality.",
            "Small clinics offering services such as dental, OB-GYN, and pediatric and private medical laboratories also operate here."
        ],
        [
            "Transportation"
        ],
        [
            "Initao can be reached by ferry through major seaports of Cagayan de Oro, and Iligan, and by plane via Laguindingan Airport.",
            "Public transportations such as buses, taxis, and other motor vehicles also ply through the town via the Iligan-Butuan-Cagayan de Oro-Iligan Road."
        ],
        [
            "Visitors and locals go around the town by just hailing public transportations such a as the sikad-sikad (rickshaw), habal-habal(motorcycle taxis), tricabs, etc.",
            "Ride hailing apps do not cater this area."
        ],
        [
            "Communication"
        ],
        [
            "PLDT Home Fibr, Globe, TM, Smart and Sun are serviceable in this town.",
            "DITO Telecommunity lines have also been constructed to cater customers in the event of its activation."
        ],
        [
            "Electricity"
        ],
        [
            "Misamis Oriental Electric Cooperative (Moresco 1) is the only electric provider of the municipality."
        ],
        [
            "Roads"
        ],
        [
            "Butuan-Cagayan de Oro-Iligan Road passes through the town."
        ],
        [
            "Provincial, Municipal, and Barangay roads makes the interior barangay accessible.",
            "The state of these roads ranges from concreted to nerve-wracking dirt roads."
        ],
        [
            "Government Agencies"
        ],
        [
            "Hall of Justice"
        ],
        [
            "Land Transportation Office (LTO)"
        ],
        [
            "Department of Environment and Natural Resources (DENR)"
        ],
        [
            "Philippine National Police (PNP)"
        ],
        [
            "Bureau of Jail Management and Penology (BJMP)"
        ],
        [
            "Education"
        ],
        [
            "Initao Central School(ICS) is the largest and oldest public elementary school under the Department of Education (DepEd) located in the Poblacion.",
            "There are also public elementary schools located in almost every barangay in this town."
        ],
        [
            "Initao National Comprehensive High School (INCHS) is a public secondary school which also offers the Senior High School program.",
            "Its prominent features include the playing field which hosts different activities such soccer matches and concerts, and a covered court/activity center."
        ],
        [
            "Kalacapan National High School also under DepEd, offers both Junior and Senior High School programs and is located in Brgy.",
            "Kalacapan."
        ],
        [
            "Integrated schools, or public schools offering elementary and junior high school programs are also located in Brgy.",
            "Andales, Tawantawan, and Gimangpang."
        ],
        [
            "Xavier Academy High School is a Catholic private school which offers basic education programs."
        ],
        [
            "Eliz Learning Center is a private school offering preschool, kindergarten and elementary programs."
        ],
        [
            "Initao College (I.C.",
            "), formerly known as Initao Community College, was established in 2003 as an LGU of Initao-run higher education institution to provide residents of the municipality access to higher education, preparing students with the competencies necessary in both the local and global industries.",
            "Currently, Initao College offers CHED-recognized undergraduate programs in Business Administration, Hospitality Management, Elementary Education, and more recently, BS.",
            "Criminology.",
            "Since 2018, I.C.",
            "is one of the country's implementing schools under the Universal Access to Quality Tertiary Education Act."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Initao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Act No.",
            "951\".",
            "Lawyerly.",
            "October 22, 1903.",
            "Retrieved March 13, 2024."
        ],
        [
            "^ \"An Act Creating the Municipality of Naawan, Province of Misamis Oriental\".",
            "LawPH.com.",
            "Retrieved 2011-04-12."
        ],
        [
            "^"
        ],
        [
            "\"Initao: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Misamis Oriental\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Initao."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-12-21 at archive.today"
        ],
        [
            "Places adjacent to Initao"
        ],
        [
            "Bohol Sea"
        ],
        [
            "Libertad"
        ],
        [
            "Iligan Bay"
        ],
        [
            "Initao"
        ],
        [
            "Alubijid"
        ],
        [
            "Naawan"
        ],
        [
            "vte Province of Misamis OrientalCagayan de Oro (capital and largest city)Municipalities"
        ],
        [
            "Alubijid"
        ],
        [
            "Balingasag"
        ],
        [
            "Balingoan"
        ],
        [
            "Binuangan"
        ],
        [
            "Claveria"
        ],
        [
            "Gitagum"
        ],
        [
            "Initao"
        ],
        [
            "Jasaan"
        ],
        [
            "Kinoguitan"
        ],
        [
            "Lagonglong"
        ],
        [
            "Laguindingan"
        ],
        [
            "Libertad"
        ],
        [
            "Lugait"
        ],
        [
            "Magsaysay"
        ],
        [
            "Manticao"
        ],
        [
            "Medina"
        ],
        [
            "Naawan"
        ],
        [
            "Opol"
        ],
        [
            "Salay"
        ],
        [
            "Sugbongcogon"
        ],
        [
            "Tagoloan"
        ],
        [
            "Talisayan"
        ],
        [
            "Villanueva"
        ],
        [
            "Component cities"
        ],
        [
            "El Salvador"
        ],
        [
            "Gingoog"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Cagayan de Oro (Administratively independent from the province but grouped under Misamis Oriental by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Initao&oldid=1220601830\""
        ],
        [
            "Category: Municipalities of Misamis OrientalHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataWebarchive template archiveis linksPages using the Kartographer extension"
        ]
    ]
}