{
    "name": "Irosin",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Irosin"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°42′18″N 124°01′55″E﻿ / ﻿12.705°N 124.0319°E﻿ / 12.705; 124.0319"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Sorsogon, Philippines"
        ],
        [
            "Municipality in Bicol Region, PhilippinesIrosinMunicipalityMunicipality of IrosinIrosin Beacon with Mount Bulusan in the background"
        ],
        [
            "FlagMap of Sorsogon with Irosin highlightedOpenStreetMapIrosinLocation within the PhilippinesCoordinates: 12°42′18″N 124°01′55″E﻿ / ﻿12.705°N 124.0319°E﻿ / 12.705; 124.0319CountryPhilippinesRegionBicol RegionProvinceSorsogonDistrict"
        ],
        [
            "2nd districtBarangays28"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAlfredo J. Cielo Jr. • Vice MayorChristian D. Lim • RepresentativeManuel L. Fortes Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Agustin E. Delmonte IIIVirgilio M. GabitoIrvin Karl S. FortesReynaldo P. Lascano Jr.Mercy Donna D. BalmesAnsam J. BringuelaAntonio G. GajoJhumer B. Ong"
        ],
        [
            " • Electorate39,689 voters (2022)Area • Revenue₱ 191.4 million (2020) • Assets₱ 454.2 million (2020) • Expenditure₱ 276.7 million (2020) • Liabilities₱ 231.3 million (2020)Service provider • ElectricitySorsogon 1 Electric Cooperative (SORECO 1)Time zoneUTC+8 (PST)ZIP code4707PSGC056209000IDD : area code +63 (0)56Native languagesSorsogon language TagalogWebsitewww.irosin.gov.ph"
        ],
        [
            "Irosin, officially the Municipality of Irosin (Waray Sorsogon: Bungto san Irosin; Waray: Bungto han Irosin, Tagalog: Bayan ng Irosin), is a 2nd class municipality in the province of Sorsogon, Philippines.",
            "According to the 2020 census, it has a population of 59,267 people."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(November 2022) (Learn how and when to remove this message)"
        ],
        [
            "Earlier than 1847, Irosin was a far inland valley unspoiled by human settlers and covered by vast forest expanse teeming with wild animals.",
            "Irosin was among the last places in the Philippines to be populated.",
            "Most of the natives during the early 1800s lived along the coastal areas where it was more accessible to commercial, travel and communication activities at the time."
        ],
        [
            "The place had been an undisturbed sanctuary for wildlife until settlers from Bulusan came in search of wild quarry and rattan.",
            "These pioneers, using the slash-and-burn method, cleared a settlement beside a river which gave birth to a clearing called Hin-ay, an Albayanon word which denotes the arrangement of the abaca yarn or tupos into a zigzagging pattern (hinan-ay) in preparation for its actual weaving.",
            "Accordingly, the hin-ay or the pattern was the image drawn to connote the waving rivers crisscrossing from the mountains down the valley.",
            "In yet another account, the word hin-ay was purported to have been derived from the term an-hay which means gradually ascending.",
            "The original settlement which is now called San Agustin is located east of the town proper at a higher elevation, thus the gradual ascent from the lower villages to the then barrio center of San Agustin."
        ],
        [
            "It was in 1847 when Hin-ay was declared a barrio of Bulusan.",
            "The Gobernadorcillo of Bulusan visited Hin-ay and appointed Apolonio Capido as the first barrio lieutenant.",
            "Deeply influenced by Catholicism brought by the Spanish friars, the natives of Hin-ay constructed a makeshift chapel and dedicated it to their patron Saint Michael Archangel.",
            "As years passed, the original clearing had grown into a bustling community and eventually, the settlers requested the church authorities to bestow upon San Miguel a status independent and separate from that of Bulusan.",
            "The petition was granted and Holy Masses on Sundays and holidays of obligation were held regularly.",
            "In 1876, the Parish of San Miguel was officially recognized with Father Mariano Miranda as its parish priest and consequently, Hin-ay became known as San Miguel.",
            "On December 12, 1879, through a Royal Decree executed by the Governor General Domingo Moriones y Murillo, San Miguel was made a duly constituted pueblo or town."
        ],
        [
            "During those years Pedro Fruto (1881-1882), Domingo Gamba (1883-1884) and Juan Gallarda (1885-1886) were the public officials who were addressed as Capitanes del Pueblo.",
            "From the year 1880, the town of San Miguel flourished as an independent political unit under the Province of Albay when Sorsogon, until October 10, 1894, was not yet separated from its mother province.",
            "The first Guardia Civil came to Irosin in 1883.",
            "Its members were Filipinos headed by a Spanish Captain.",
            "With the spread of the underground movement called by the Spaniards hombres rebeldes in 1894, more Spanish forces called casadores were dispatched to Irosin.",
            "They imposed curfew hours in a bid to curtail the local uprisings."
        ],
        [
            "It was during the incumbency of Father Esteban Rivera in 1887 when the name San Miguel was again changed to Irosin.",
            "The word was derived from the local term iros which means to cut-off a part.",
            "The word was traced to have come from an old tailor's term synonymous with tabas as in ”irosi an hiniro” or cut a part of the cloth.",
            "Iros was the image most probably drawn to connote the gush or flow of floodwaters eroding riverbanks and cutting through lands to eventually form another river or river route."
        ],
        [
            "Irosin was indeed frequently eroded due to inundations of the rivers.",
            "On the 24th of December 1933, massive flooding occurred sending many inhabitants to death.",
            "A concrete river control dike in 1937 under Mayor Felipe Santiago and Congressman Norberto Roque was constructed to keep the violent surge of the river from eroding the town's mainland."
        ],
        [
            "Contemporary period"
        ],
        [
            "On April 10, 1989, Irosin was successfully defended by military and police forces, the latter led by Lieutenant Antonio Dy who headed the town's police station, against approximately 200 communist rebels of the New People's Army, which had 20 casualties; three female civilians were killed in the crossfire."
        ],
        [
            "Geography"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(November 2022) (Learn how and when to remove this message)"
        ],
        [
            "Irosin is the only landlocked municipality in the province.",
            "It is 42 kilometres (26 mi) from Sorsogon City and 623 kilometres (387 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Irosin is politically subdivided into 28 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bagsangan"
        ],
        [
            "Bacolod (Poblacion)"
        ],
        [
            "Batang"
        ],
        [
            "Bolos"
        ],
        [
            "Buenavista"
        ],
        [
            "Bulawan"
        ],
        [
            "Carriedo"
        ],
        [
            "Casini"
        ],
        [
            "Cawayan"
        ],
        [
            "Cogon"
        ],
        [
            "Gabao"
        ],
        [
            "Gulang-Gulang"
        ],
        [
            "Gumapia"
        ],
        [
            "Santo Domingo (Lamboon)"
        ],
        [
            "Liang"
        ],
        [
            "Macawayan"
        ],
        [
            "Mapaso"
        ],
        [
            "Monbon"
        ],
        [
            "Patag"
        ],
        [
            "Salvacion"
        ],
        [
            "San Agustin (Poblacion)"
        ],
        [
            "San Isidro (Palogtok)"
        ],
        [
            "San Juan (Poblacion)"
        ],
        [
            "San Julian (Poblacion)"
        ],
        [
            "San Pedro (Poblacion)"
        ],
        [
            "Tabon-Tabon"
        ],
        [
            "Tinampo"
        ],
        [
            "Tongdol"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Irosin, Sorsogon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "65(2.6)"
        ],
        [
            "44(1.7)"
        ],
        [
            "42(1.7)"
        ],
        [
            "39(1.5)"
        ],
        [
            "87(3.4)"
        ],
        [
            "150(5.9)"
        ],
        [
            "184(7.2)"
        ],
        [
            "153(6.0)"
        ],
        [
            "163(6.4)"
        ],
        [
            "154(6.1)"
        ],
        [
            "127(5.0)"
        ],
        [
            "100(3.9)"
        ],
        [
            "1,308(51.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.9"
        ],
        [
            "9.2"
        ],
        [
            "11.0"
        ],
        [
            "12.5"
        ],
        [
            "19.6"
        ],
        [
            "24.3"
        ],
        [
            "26.5"
        ],
        [
            "25.0"
        ],
        [
            "25.5"
        ],
        [
            "24.4"
        ],
        [
            "19.4"
        ],
        [
            "15.1"
        ],
        [
            "226.4"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of IrosinYearPop.±% p.a.1903 8,644—    1918 14,775+3.64%1939 17,017+0.68%1948 19,317+1.42%1960 23,134+1.51%1970 27,953+1.91%1975 30,989+2.09%1980 34,978+2.45%1990 37,887+0.80%1995 41,005+1.49%2000 45,507+2.26%2007 49,968+1.30%2010 51,777+1.30%2015 56,662+1.73%2020 59,267+0.89%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Irosin"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  33.40"
        ],
        [
            "2009  34.18"
        ],
        [
            "2012  28.45"
        ],
        [
            "2015  37.34"
        ],
        [
            "2018  32.64"
        ],
        [
            "2021  26.41"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "This section is written like a travel guide.",
            "Please help improve the section by introducing an encyclopedic style or move the content to Wikivoyage.",
            "(November 2022)"
        ],
        [
            "Saint Michael Archangel Church"
        ],
        [
            "Irosin has many potential tourist spots varying from natural parks, hot and cold springs, viewing areas and historical landmark.",
            "The famous tourism attractions in the municipality are the Mateo Hot and Cold Spring Resort, St. Michael Archangel Roman Catholic Hilltop Church and protected areas.",
            "The Bolos Crystal Spring and the Valley View Park where eateries, kiosks and parking spaces were set up had become a rest area for truckers and travelers plying the Maharlika Highway.",
            "Another potential tourist attraction is the Mapaso mineral hot spring famous for its purported healing qualities.",
            "Irosin is an ideal jump-off site for mountaineering and ecological trek that is becoming popular among tourists both foreign and local.",
            "The municipality is an entry and exit area to BVNP one of the remaining tropical forests and is a protected area in the Bicol Region.",
            "Mount Jormajam and Mount Mara-ot Banwa are the other alternative places for mountaineering and ecological trekking."
        ],
        [
            "There are also a number of tourist accommodations and facilities in Irosin.",
            "The Mateo Hot and Cold Springs Resort have conference halls, dormitories, cottages, eatery and swimming pools ideal for rest and recreation, conference and seminars.",
            "There is also the Guest World Resort and Nature Spring Resort with pools and accommodations.",
            "There are other lodging houses such as Villa Lim Condominium and Saint Michael Lodging House.",
            "Restaurants, snack bars and eateries are found along the CBD and inside the Irosin Public Market."
        ],
        [
            "The most common cultural activities in the municipality are the annual santacruzan, barangay fiestas and town fiesta where Paray Festival is showcased.",
            "The Paray Festival in September culminates with the street play Viva San Miguel, celebrated in honor of Saint Michael Archangel, the patron saint of Irosin."
        ],
        [
            "The local tourism industry has a great potential since ecological tourism is the trend worldwide and the national government intends to develop Bicol as a major hub for tourists.",
            "Given the variety of natural tourist spots in the municipality and its strategic location, Irosin can be a convergence area of foreign and domestic tourists and visitors."
        ],
        [
            "Education"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(November 2022) (Learn how and when to remove this message)"
        ],
        [
            "Primary education"
        ],
        [
            "Among the known primary schools in the town are Irosin Central School and Holy Spirit Academy of Irosin.",
            "Besides the two schools, every barangay has an Elementary school run by the government."
        ],
        [
            "Secondary education"
        ],
        [
            "Irosin has many secondary educational institutions.",
            "The largest public high school is Gallanosa National High School.",
            "There is also a Secondary School in some bigger barangays of Irosin: Gabao National High School and the Irosin North National High School.",
            "The Holy Spirit Academy of Irosin is also the only private secondary school."
        ],
        [
            "Tertiary education"
        ],
        [
            "Veritas College of Irosin"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Irosin |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Note: Brief historical account and poetic translation were drawn from the Irosin Town Fiesta '93 (September 20–29, 1993) Souvenir Magazine, \"A toast to an alternative celebration!\"",
            "- LG Ubalde"
        ],
        [
            "^ Solminaro, F. (April 11, 1989).",
            "\"31 slain in NPA encounters\".",
            "Manila Standard.",
            "Kagitingan Publications, Inc. p. 7.",
            "Retrieved November 22, 2022."
        ],
        [
            "^ De Jesus, Sandra (August 3, 1989).",
            "\"Satur captor heads PC day awardees\".",
            "Manila Standard.",
            "Kagitingan Publications, Inc. p. 5.",
            "Retrieved November 22, 2022."
        ],
        [
            "^"
        ],
        [
            "\"Irosin, Sorsogon : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 December 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Sorsogon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Irosin Tourism"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Irosin."
        ],
        [
            "Official website"
        ],
        [
            "Irosin Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2016-03-04 at the Wayback Machine"
        ],
        [
            "Veritas College of Irosin"
        ],
        [
            "Places adjacent to Irosin"
        ],
        [
            "Juban"
        ],
        [
            "Bulan"
        ],
        [
            "Irosin"
        ],
        [
            "Bulusan"
        ],
        [
            "Matnog"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "vte Province of SorsogonSorsogon City (capital and largest city)Municipalities"
        ],
        [
            "Barcelona"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castilla"
        ],
        [
            "Donsol"
        ],
        [
            "Gubat"
        ],
        [
            "Irosin"
        ],
        [
            "Juban"
        ],
        [
            "Magallanes"
        ],
        [
            "Matnog"
        ],
        [
            "Pilar"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Component city"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Irosin&oldid=1221326426\""
        ],
        [
            "Categories: Municipalities of SorsogonSpa towns in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textArticles needing additional references from November 2022All articles needing additional referencesWikipedia articles needing clarification from November 2022All articles lacking reliable referencesArticles lacking reliable references from November 2022Wikipedia articles with style issues from November 2022All articles with style issuesCommons category link from WikidataOfficial website different in Wikidata and WikipediaWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}