{
    "name": "Isulan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Isulan"
        ],
        [
            "23 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogไทยاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 6°38′N 124°36′E﻿ / ﻿6.63°N 124.6°E﻿ / 6.63; 124.6"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Capital of Sultan Kudarat, Philippines"
        ],
        [
            "This article possibly contains original research.",
            "Please improve it by verifying the claims made and adding inline citations.",
            "Statements consisting only of original research should be removed.",
            "(May 2020) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Soccsksargen, PhilippinesIsulanMunicipalityMunicipality of IsulanIsulan Roundabout"
        ],
        [
            "FlagSealNickname: Oil Palm Capital of the PhilippinesMotto: Buylog Isulan!Map of Sultan Kudarat with Isulan highlightedOpenStreetMapIsulanLocation within the PhilippinesCoordinates: 6°38′N 124°36′E﻿ / ﻿6.63°N 124.6°E﻿ / 6.63; 124.6CountryPhilippinesRegionSoccsksargenProvinceSultan KudaratDistrict"
        ],
        [
            "1st districtFoundedAugust 30, 1957Barangays17"
        ],
        [
            "  (see Barangays)Government  • Vice MayorCarlo Apiado • RepresentativeBai Rihan M. Sakaluran • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Carlo F. ApiadoRene F. AristozaMariblithe C. GaringoArnold H. ArmadaGina B. Belmes-DaelRyan M. DumaranMa.",
            "Jennalyn N. MejiaDarlene H. Lama"
        ],
        [
            " • Electorate58,908 voters (2022)Area • Revenue₱ 418.2 million (2020) • Assets₱ 716.7 million (2020) • Expenditure₱ 328.1 million (2020) • Liabilities₱ 271.9 million (2020)Service provider • ElectricitySultan Kudarat Electric Cooperative (SUKELCO)Time zoneUTC+8 (PST)ZIP code9805PSGC126504000IDD : area code +63 (0)64Native languagesMaguindanao Hiligaynon TagalogWebsitewww.isulan.gov.ph"
        ],
        [
            "Isulan, officially the Municipality of Isulan (Hiligaynon: Banwa sang Isulan; Maguindanaon: Inged nu Isulan, Jawi: ايڠد نو اسولن; Tagalog: Bayan ng Isulan), is a 1st class municipality and capital of the province of Sultan Kudarat, Philippines.",
            "According to the 2020 census, it has a population of 97,490 people."
        ],
        [
            "Etymology"
        ],
        [
            "The Christian settlers would have preferred to decide the name of their new town by referendum.",
            "However, Datu Kudanding Camsa, both revered and feared, had decided it by himself."
        ],
        [
            "Datu Kudanding Camsa had reacted to the history of local battles way back in the early.",
            "Until 19th century when a sultanate in the adjacent town of Maganoy under Sultan Utto with a vast army decided to attack a small municipality located in the area now encompassed by the new entity under the leadership of Sultan Kudarat Mopak.",
            "Outnumbered with the ratio of 20:1, Sultan Kudarat Mopak on a white horse decided to do battle with his men notwithstanding the odds."
        ],
        [
            "The battle cry of Sultan Kudarat was the uttering of the word, \"Isu-silan\" which means \"They are there, advance\".",
            "This intrepid, although suicidal show of force and determination, so impressed by Utto, that in order to save lives on both sides, he decided to resolve the issue by negotiation, thus placing Kudarat and his principality under his protectorate of Utto, Isulan municipality derived its name from \"Isu-silan\" which means \"Progress\"."
        ],
        [
            "History"
        ],
        [
            "The present territories of Isulan formerly belonged to the municipalities of Koronadal and Dulawan.",
            "The municipality of Koronadal was created under E.O.",
            "No.",
            "82 dated August 8, 1947 by Pres.",
            "Manuel L. Roxas."
        ],
        [
            "On March 10, 1953, the municipality of Norala was created by virtue of E.O.NO.572, whose territorial jurisdiction was taken from the municipality of Koronadal."
        ],
        [
            "Datu Kudanding Camsa in the latter part of 1956 initiated the creation of another municipality to be taken from the Municipality of Norala."
        ],
        [
            "On March 20, 1957, Engr.",
            "Jose M. Ancheta of the Bureau of Public Highways of Cotabato made its first endorsement to the provincial board and laid down the proposed boundaries of the new municipality."
        ],
        [
            "Acting on this report, the provincial board of Cotabato thru Resolution No.",
            "316 series of 1957, petitioned the President of the Philippines to create the proposed municipality."
        ],
        [
            "Executive Order No.",
            "266, pursuant to section 68 of the Administrative Code, issued and signed by the then President Carlos P. Garcia on August 30, 1957, creating the municipality of Isulan, whose territorial jurisdiction was taken from the municipality of Norala, South Cotabato, and Dulawan, Cotabato."
        ],
        [
            "With the creation of the municipality of Isulan, Kalawag became the seat of its government.",
            "The municipal government officially functioned on September 12, 1957, with the appointment of its municipal mayor Datu Suma Ampatuan who served until 1967."
        ],
        [
            "The Kalawag Settlement"
        ],
        [
            "In 1951, the Board of Directors of the Land Settlement and Development Cooperation (LASEDECO) started the opening of a settlement in an area formerly under the jurisdiction of the National Land Settlement Association (NLSA) as a reservation."
        ],
        [
            "The LASEDECO had surveyed and parceled out home and farm lots and constructed municipal and barrio roads and installed electrical light generators.",
            "It had brought-in hundreds of farm tractors which uprooted big trees, cleared obstruction, planned, cleaned and harrowed the wide stretches of the area.",
            "What was once a marshy and wild expanse inhabited by snakes, crocodiles, wild cattle, swine, and deer had welcomed the first sprout of seedlings of corn and rice, thus blanketed the horizon in endless green."
        ],
        [
            "When a group of 72 World War II  Veterans, led by Venancio Magbanua, Post Commander of Norala had come and settled in the area, on September 7, 1950, a Kalawag root crop used as food coloring  was found out abundantly growing."
        ],
        [
            "Then, the early settlers decided to call and register the settlement as \"Kalawag Settlement District of LASEDECO\".",
            "The area comprising the town site covers approximately 400 hectares."
        ],
        [
            "Immigrants from Visayas and Luzon had now come in shiploads.",
            "The most numerous batch was the \"PACSA\" group headed by Pedro Gabriel and Bienvenido Pamintuan otherwise known as the \"Presidential Assistance Commission on Social Amelioration of the President Ramon Magsaysay.",
            "His group consisted of the erstwhile and rebellious surrenderees belonging to HUKBALAHAPs from Pampanga."
        ],
        [
            "On June 21, 1969, President Marcos, signed R.A. No.",
            "5960, creating the municipality of Bagumbayan which cost Isulan more than 85% of its original land area.",
            "But of the original land area of 336,000 hectares, only 49,551 hectares were left and the 48 barrios were reduced to 17."
        ],
        [
            "Upon the passage of H.B.",
            "No.",
            "5020 dividing the province of Cotabato, the Municipal Council of Isulan passed Resolution No.",
            "17 dated May 31, 1972, requesting Congressman Salipada K. Pendatun and Gov.",
            "Carlos B. Cajelo that Isulan be made a capital town."
        ],
        [
            "On November 22, 1973, P.D.",
            "No.",
            "341 was issued dividing Cotabato provinces, namely; Sultan Kudarat, Maguindanao, and North Cotabato.",
            "At the same time, Isulan, which is in the center of the new province, was made its capital."
        ],
        [
            "Bombings"
        ],
        [
            "On August 28, 2018, at 8:34 pm, three people were killed and 36 injured during the Hamungaya Festival when an improvised explosive device went off in front of a store in Barangay Kalawag 3 along the National Highway."
        ],
        [
            "On April 3, 2019, 18 people, including children, were injured when an improvised explosive device exploded at a restaurant, possibly motivated by extortion."
        ],
        [
            "On April 17, 2023, seven people were injured when an improvised explosive device exploded inside a bus, which was on a brief stop at Isulan Integrated Public Terminal to drop and pick up passengers."
        ],
        [
            "Geography"
        ],
        [
            "Isulan is centrally located and is accessible to all neighboring towns not only within the province of Sultan Kudarat but also in some municipalities of the province of Maguindanao del Sur, South Cotabato and Davao del Sur.",
            "It is bounded on the north by the municipality of Esperanza, north-east by the municipality of Lambayong; on the east by Tacurong; on the south by the municipalities of Bagumbayan and Senator Ninoy Aquino; and on the southeast by the municipality of Norala, South Cotabato, and Santo Niño, South Cotabato; and on the west by the Municipalities of Lebak and Kalamansig.",
            "It has a total land area of 54,125 hectares (133,750 acres)."
        ],
        [
            "Barangays"
        ],
        [
            "Isulan is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Bambad"
        ],
        [
            "Bual"
        ],
        [
            "D'Lotilla"
        ],
        [
            "Dansuli (Poblacion)"
        ],
        [
            "Impao"
        ],
        [
            "Kalawag I (Poblacion)"
        ],
        [
            "Kalawag II (Poblacion)"
        ],
        [
            "Kalawag III (Poblacion)"
        ],
        [
            "Kenram (Poblacion)"
        ],
        [
            "Kolambog"
        ],
        [
            "Kudanding"
        ],
        [
            "Lagandang"
        ],
        [
            "Laguilayan"
        ],
        [
            "Mapantig"
        ],
        [
            "New Pangasinan"
        ],
        [
            "Sampao"
        ],
        [
            "Tayugo"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Isulan, Sultan Kudarat"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "64(2.5)"
        ],
        [
            "45(1.8)"
        ],
        [
            "59(2.3)"
        ],
        [
            "71(2.8)"
        ],
        [
            "140(5.5)"
        ],
        [
            "179(7.0)"
        ],
        [
            "192(7.6)"
        ],
        [
            "198(7.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "147(5.8)"
        ],
        [
            "113(4.4)"
        ],
        [
            "66(2.6)"
        ],
        [
            "1,437(56.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.2"
        ],
        [
            "10.3"
        ],
        [
            "12.7"
        ],
        [
            "15.7"
        ],
        [
            "26.0"
        ],
        [
            "27.4"
        ],
        [
            "28.1"
        ],
        [
            "28.2"
        ],
        [
            "26.0"
        ],
        [
            "26.7"
        ],
        [
            "22.9"
        ],
        [
            "16.6"
        ],
        [
            "252.8"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of IsulanYearPop.±% p.a.1960 21,431—    1970 29,850+3.36%1975 30,905+0.70%1980 39,283+4.91%1990 56,488+3.70%1995 65,202+2.72%2000 73,129+2.49%2007 79,277+1.12%2010 86,602+3.27%2015 90,682+0.88%2020 97,490+1.43%Source: Philippine Statistics Authority"
        ],
        [
            "Languages"
        ],
        [
            "Hiligaynon is the predominantly spoken language in the municipality, with the bulk of Isulan's population predominantly consisting of descendants of settlers who came from the Hiligaynon-speaking parts of the Visayas, namely the islands of Negros and Panay.",
            "Maguindanaon is a native language spoken in Isulan, while other languages spoken in the city are Tagalog, Cebuano, Ilocano, Karay-a, Kapampangan, Chavacano, and others."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Isulan"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  25.50"
        ],
        [
            "2009  26.76"
        ],
        [
            "2012  29.94"
        ],
        [
            "2015  25.75"
        ],
        [
            "2018  20.60"
        ],
        [
            "2021  20.57"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "CityMall Isulan facade"
        ],
        [
            "Isulan has various department stores and a mall, the list below contains the current malls and the future shopping centers in Isulan."
        ],
        [
            "CityMall Isulan - owned by Double Dragon Properties and SM investment, opened on December 18, 2018."
        ],
        [
            "MGM Shopping Plaza - one of the biggest shopping centers operating in Isulan."
        ],
        [
            "Isulan Central Plaza - first department store and one of the oldest in Isulan.",
            "Opened in the late 1990s."
        ],
        [
            "Novo Shirts and Jeans - acquired the old Licon Cinema Building"
        ],
        [
            "New Valencia Dry Good Store and Gen. Mdse.",
            "- offers ready-to-wear and grocery."
        ],
        [
            "Transportation"
        ],
        [
            "The municipality has an integrated terminal with buses, vans and jeepneys going to various areas of Soccsksargen, Maguindanao and Davao Region."
        ],
        [
            "Bus companies include:"
        ],
        [
            "Yellow Bus Line, Inc. General Santos and Koronadal City"
        ],
        [
            "Husky Tours Cotabato City, Koronadal City"
        ],
        [
            "Mindanao Star Cotabato City and Davao City"
        ],
        [
            "Culture"
        ],
        [
            "Festival"
        ],
        [
            "Every month of August 30, the municipality of Isulan conducts the Hamungaya Festival to celebrate its foundation.",
            "Isulanons believe that the wealth of arts and culture is expressed in many forms and in so many kinds.",
            "The festival showcases skills and talents in literary, musical and cultural aspects of the constituents both young and old."
        ],
        [
            "The Hamungaya also depicts the thanksgiving festival of its residents who are mostly engaged in agriculture.",
            "This includes rice and corn farming, vegetables and crops production including the famous African palm which has contributed a lot to the utilization of its by-products as construction materials – the uniquely woven \"kalakat\" known all over Mindanao."
        ],
        [
            "The festival is divided into two parts: the first part shows the different activities being done in the farm.",
            "After which a thanksgiving is performed for their good harvest.",
            "The second part shows the merrymaking in the form of dance using different properties and materials that make it very festive."
        ],
        [
            "As a whole, the Hamungaya Festival actually expresses life itself or deep-seated emotion communicated by the emotions of the human body blending with the music.",
            "The flow of body movements, the sound of the music and the grace with which the dance is executed all build up the story or emotions being communicated."
        ],
        [
            "No doubt, this is a unique form of art, and along with other activities or talent being displayed during festivities, it is a contribution to the dreams of establishing solidarity among the peoples in the province of Sultan Kudarat."
        ],
        [
            "Tourism"
        ],
        [
            "Sultan Kudarat Provincial Capitol"
        ],
        [
            "Lagandang Hot Spring/Sulphur Spring"
        ],
        [
            "Kamanga Cave and Falls"
        ],
        [
            "Daguma Mountain range"
        ],
        [
            "Landmark of the Royalty"
        ],
        [
            "Narra Eco Park"
        ],
        [
            "Stallion Farm"
        ],
        [
            "Sultan Kudarat Provincial Capitol"
        ],
        [
            "Narra Eco Park"
        ],
        [
            "Healthcare"
        ],
        [
            "Sultan Kudarat Provincial Hospital"
        ],
        [
            "Isulan Doctor's Specialist Center"
        ],
        [
            "Holy Nazarene Clinic and Hospital"
        ],
        [
            "Galinto Family Hospital"
        ],
        [
            "Matias Hospital"
        ],
        [
            "Retirado Clinic and Hospital"
        ],
        [
            "St. Dominic Savio General Hospital Inc."
        ],
        [
            "Sultan Kudarat Provincial Hospital"
        ],
        [
            "Education"
        ],
        [
            "Privately run academic schools"
        ],
        [
            "Green Valley College Foundation, Inc. (Isulan Campus)"
        ],
        [
            "Montessori Learning Center (Isulan Campus)"
        ],
        [
            "The Notre Dame of Isulan, Inc."
        ],
        [
            "Isulan Community School."
        ],
        [
            "Precious Ones Learning Center"
        ],
        [
            "King's College of Isulan"
        ],
        [
            "Government-run schools"
        ],
        [
            "East Isulan District elementary school"
        ],
        [
            "Kalawag Central Elementary School"
        ],
        [
            "Kalawag III Elementary School"
        ],
        [
            "Central Isulan District elementary schools"
        ],
        [
            "Isulan Central Elementary School"
        ],
        [
            "Don Juan P. Garcia Memorial Elementary School"
        ],
        [
            "Dansuli Elementary School"
        ],
        [
            "Impao Elementary School"
        ],
        [
            "Datu Talipasan Memorial Elementary School"
        ],
        [
            "Mapantig Elementary School"
        ],
        [
            "South Isulan District elementary schools"
        ],
        [
            "Bambad Central School"
        ],
        [
            "Kolambog Elementary School"
        ],
        [
            "Kudanding Elementary School"
        ],
        [
            "West Isulan District elementary schools"
        ],
        [
            "Laguilayan Central School"
        ],
        [
            "Kamanga Elementary School"
        ],
        [
            "New Egana Elementary School"
        ],
        [
            "D. Lotilla Elementary School"
        ],
        [
            "Tayugo Elementary School"
        ],
        [
            "New Pangasinan Elementary School"
        ],
        [
            "Datu Anok O. Galmak Elementary School"
        ],
        [
            "Lagandang Elementary School"
        ],
        [
            "Mantisao Elementary School"
        ],
        [
            "Public secondary schools"
        ],
        [
            "Isulan National High School"
        ],
        [
            "Bambad National High School"
        ],
        [
            "Laguilayan National High School"
        ],
        [
            "New Pangasinan High School"
        ],
        [
            "Government-owned tertiary institution"
        ],
        [
            "Sultan Kudarat State University (Isulan Campus)"
        ],
        [
            "References"
        ],
        [
            "^ \"Sultan Kudarat governor suspends town mayor for more than a year\".",
            "Rappler.",
            "April 23, 2024.",
            "Retrieved April 23, 2024."
        ],
        [
            "^ \"2019 Election Results:Isulan, Sultan Kudarat\".",
            "GMA News.",
            "Retrieved 7 October 2021."
        ],
        [
            "^  Municipality of Isulan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Ferdinandh Cabrera; Amiel Cagayan (August 29, 2018).",
            "\"Amid Hamungaya Festival: 1 dead, 36 hurt as bomb explodes in Sultan Kudarat\".",
            "GMA News.",
            "GMA Network Inc. Retrieved 16 September 2019."
        ],
        [
            "^ Jon Viktor D. Cabuenas (September 2, 2018).",
            "\"Second explosion hits Isulan, Sultan Kudarat; at least 1 killed\".",
            "GMA News.",
            "GMA Network Inc. Retrieved 16 September 2019."
        ],
        [
            "^ a b Gaea Katreena Cabico (April 4, 2019).",
            "\"Intensified security sought following Isulan blast\".",
            "The Philippine Star.",
            "Pilipino STAR.",
            "Retrieved 16 September 2019."
        ],
        [
            "^ \"Seven hurt after blast rocks public market in Isulan, Sultan Kudarat\".",
            "GMA News.",
            "GMA Network Inc. September 7, 2019.",
            "Retrieved 16 September 2019."
        ],
        [
            "^ \"Sultan Kudarat police on alert after bus bombing in capital town\".",
            "Philippine Daily Inquirer.",
            "18 April 2023.",
            "Retrieved 13 July 2023."
        ],
        [
            "^"
        ],
        [
            "\"Isulan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 15 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XII (Soccsksargen)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XII (Soccsksargen)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Sultan Kudarat\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Schools in Isulan\".",
            "Retrieved 2011-07-06."
        ],
        [
            "^ \"Sultan Kudarat State University Isulan Campus\".",
            "Archived from the original on 2011-06-25.",
            "Retrieved 2011-07-06."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Isulan."
        ],
        [
            "Isulan Profile at PhilAtlas.com"
        ],
        [
            "Isulan Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2016-03-04 at the Wayback Machine"
        ],
        [
            "Places adjacent to Isulan"
        ],
        [
            "Lebak"
        ],
        [
            "Esperanza"
        ],
        [
            "Lambayong"
        ],
        [
            "Isulan"
        ],
        [
            "TacurongTantangan, South Cotabato"
        ],
        [
            "Kalamansig"
        ],
        [
            "Sen. Ninoy Aquino / Bagumbayan"
        ],
        [
            "Norala, South Cotabato"
        ],
        [
            "vte Province of Sultan KudaratIsulan (capital)Municipalities"
        ],
        [
            "Bagumbayan"
        ],
        [
            "Columbio"
        ],
        [
            "Esperanza"
        ],
        [
            "Isulan"
        ],
        [
            "Kalamansig"
        ],
        [
            "Lambayong"
        ],
        [
            "Lebak"
        ],
        [
            "Lutayan"
        ],
        [
            "Palimbang"
        ],
        [
            "President Quirino"
        ],
        [
            "Senator Ninoy Aquino"
        ],
        [
            "Component city"
        ],
        [
            "Tacurong"
        ],
        [
            "vte Provincial capital cities and municipalities of the PhilippinesLuzon"
        ],
        [
            "Abra: Bangued"
        ],
        [
            "Albay: Legazpi"
        ],
        [
            "Apayao: Kabugao / Luna1"
        ],
        [
            "Aurora: Baler"
        ],
        [
            "Bataan: Balanga"
        ],
        [
            "Batanes: Basco"
        ],
        [
            "Batangas: Batangas City"
        ],
        [
            "Benguet: La Trinidad"
        ],
        [
            "Bulacan: Malolos"
        ],
        [
            "Cagayan: Tuguegarao"
        ],
        [
            "Camarines Norte: Daet"
        ],
        [
            "Camarines Sur: Pili"
        ],
        [
            "Catanduanes: Virac"
        ],
        [
            "Cavite: Imus / Trece Martires1"
        ],
        [
            "Ifugao: Lagawe"
        ],
        [
            "Ilocos Norte: Laoag"
        ],
        [
            "Ilocos Sur: Vigan"
        ],
        [
            "Isabela: Ilagan"
        ],
        [
            "Kalinga: Tabuk"
        ],
        [
            "La Union: San Fernando"
        ],
        [
            "Laguna: Santa Cruz"
        ],
        [
            "Marinduque: Boac"
        ],
        [
            "Masbate: Masbate City"
        ],
        [
            "Mountain Province: Bontoc"
        ],
        [
            "Nueva Ecija: Palayan"
        ],
        [
            "Nueva Vizcaya: Bayombong"
        ],
        [
            "Occidental Mindoro: Mamburao"
        ],
        [
            "Oriental Mindoro: Calapan"
        ],
        [
            "Palawan: Puerto Princesa"
        ],
        [
            "Pampanga: San Fernando"
        ],
        [
            "Pangasinan: Lingayen"
        ],
        [
            "Quezon: Lucena"
        ],
        [
            "Quirino: Cabarroguis"
        ],
        [
            "Rizal: Antipolo"
        ],
        [
            "Romblon: Romblon"
        ],
        [
            "Sorsogon: Sorsogon City"
        ],
        [
            "Tarlac: Tarlac City"
        ],
        [
            "Zambales: Iba"
        ],
        [
            "Visayas"
        ],
        [
            "Aklan: Kalibo"
        ],
        [
            "Antique: San Jose de Buenavista"
        ],
        [
            "Biliran: Naval"
        ],
        [
            "Bohol: Tagbilaran"
        ],
        [
            "Capiz: Roxas"
        ],
        [
            "Cebu: Cebu City"
        ],
        [
            "Eastern Samar: Borongan"
        ],
        [
            "Guimaras: Jordan"
        ],
        [
            "Iloilo: Iloilo City"
        ],
        [
            "Leyte: Tacloban"
        ],
        [
            "Negros Occidental: Bacolod"
        ],
        [
            "Negros Oriental: Dumaguete"
        ],
        [
            "Northern Samar: Catarman"
        ],
        [
            "Samar: Catbalogan"
        ],
        [
            "Siquijor: Siquijor"
        ],
        [
            "Southern Leyte: Maasin"
        ],
        [
            "Mindanao"
        ],
        [
            "Agusan del Norte: Cabadbaran / Butuan1"
        ],
        [
            "Agusan del Sur: Prosperidad"
        ],
        [
            "Basilan: Lamitan / Isabela1"
        ],
        [
            "Bukidnon: Malaybalay"
        ],
        [
            "Camiguin: Mambajao"
        ],
        [
            "Cotabato: Kidapawan"
        ],
        [
            "Davao de Oro: Nabunturan"
        ],
        [
            "Davao del Norte: Tagum"
        ],
        [
            "Davao del Sur: Digos"
        ],
        [
            "Davao Occidental: Malita"
        ],
        [
            "Davao Oriental: Mati"
        ],
        [
            "Dinagat Islands: San Jose"
        ],
        [
            "Lanao del Norte: Tubod"
        ],
        [
            "Lanao del Sur: Marawi"
        ],
        [
            "Maguindanao del Norte: Datu Odin Sinsuat"
        ],
        [
            "Maguindanao del Sur: Buluan"
        ],
        [
            "Misamis Occidental: Oroquieta"
        ],
        [
            "Misamis Oriental: Cagayan de Oro"
        ],
        [
            "Sarangani: Alabel"
        ],
        [
            "South Cotabato: Koronadal"
        ],
        [
            "Sultan Kudarat: Isulan"
        ],
        [
            "Sulu: Jolo"
        ],
        [
            "Surigao del Norte: Surigao City"
        ],
        [
            "Surigao del Sur: Tandag"
        ],
        [
            "Tawi-Tawi: Bongao"
        ],
        [
            "Zamboanga del Norte: Dipolog"
        ],
        [
            "Zamboanga del Sur: Pagadian"
        ],
        [
            "Zamboanga Sibugay: Ipil"
        ],
        [
            "1 de facto seat of provincial government"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Isulan&oldid=1234204350\""
        ],
        [
            "Categories: Municipalities of Sultan KudaratProvincial capitals of the PhilippinesPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles that may contain original research from May 2020All articles that may contain original researchInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using infobox settlement with possible demonym listArticles containing Hiligaynon-language textArticles containing Maguindanaon-language textArticles containing Tagalog-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}