{
    "name": "Jaen",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Jaen, Nueva Ecija"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°20′21″N 120°54′25″E﻿ / ﻿15.3392°N 120.9069°E﻿ / 15.3392; 120.9069"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Nueva Ecija, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Jaen, Nueva Ecija\" – news · newspapers · books · scholar · JSTOR (October 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesJaenMunicipalityMunicipality of JaenJaen Municipal Hall"
        ],
        [
            "FlagSealMap of Nueva Ecija with Jaen highlightedOpenStreetMapJaenLocation within the PhilippinesCoordinates: 15°20′21″N 120°54′25″E﻿ / ﻿15.3392°N 120.9069°E﻿ / 15.3392; 120.9069CountryPhilippinesRegionCentral LuzonProvinceNueva EcijaDistrict"
        ],
        [
            "4th districtFoundedJune 18, 1865Named forJaén, SpainBarangays27"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorSylvia C. Austria • Vice MayorLuisito R. Austria • RepresentativeEmerson D. Pascual • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Sylvester C. AustriaCrisanto E. MatiasJosephine C. AngelesDonald B. CarlosArsenia E. JavateAntonio N. OcampoClifford S. MirandaJoseph Norman M. Velarde"
        ],
        [
            " • Electorate56,416 voters (2022)Area • Revenue₱ 231.8 million (2020) • Assets₱ 382.1 million (2020) • Expenditure₱ 197.2 million (2020) • Liabilities₱ 72.68 million (2020)Service provider • ElectricityNueva Ecija 1 Electric Cooperative (NEECO 1)Time zoneUTC+8 (PST)ZIP code3109PSGC034912000IDD : area code +63 (0)44Native languagesTagalog Ilocano"
        ],
        [
            "Jaen, officially the Municipality of Jaen (Filipino: Bayan ng Jaen, Ilocano: Ili ti Jaen) is a 2nd class municipality in the province of Nueva Ecija, Philippines.",
            "According to the 2020 census, it has a population of 79,189 people."
        ],
        [
            "History"
        ],
        [
            "During the Spanish Era, the municipality was only a component barrio of Gapan.",
            "When San Isidro became a town and was separated from Gapan, the town and San Antonio became one of its component barrios.",
            "When San Antonio itself became a town, the area was still its component barrio called San Agustin.",
            "By 1865, Jaen was known by its old name \"Ibayong Ilog\", and because there were many people in the river port in what is now Barangay Langla, the town became a centre for trade."
        ],
        [
            "When the place improved and its population grew to no less than 5,000 people, it became a town through a petition filed by the inhabitants through the initiative of two early leaders, Kabesang Prudencio Esquivel and Kapitan Antonio Embuscado.",
            "On June 18, 1865, Jaen itself partitioned from San Antonio, and retained Saint Augustine of Hippo as its patron saint.",
            "The Spanish officials signed the papers granting the petition that \"Ibayong Ilog\" be a town in Factoria (now San Isidro) which was then the capital of Nueva Ecija.",
            "The declaration was brought to Governor-General Juan de Lara e Irigoyen in Manila, and afterwards was submitted to the Vice-General of the Philippines in the person of Rev Gregorio Martínez.",
            "Father Martínez marked the document as approved but later wrote in his own wish that the name \"Ibayong Ilog\" be changed to the name of his birthplace of Jaén, Spain."
        ],
        [
            "In coordination with Rev Estanislao B. Moso, Kabesang Prudencio and Kapitan Antonio led the establishment of the first Catholic church (the present-day parish church).",
            "Jaen is in Central Luzon, in the southern part of Nueva Ecija.",
            "About 100 km from Manila via the old Cagayan Valley Road, the town has other road networks connecting it to Nueva Vizcaya, Isabela, Pampanga, Olongapo and Bataan.",
            "In the olden days, Pampanga River was once the only and the fastest way of transportation in going to Manila and other places."
        ],
        [
            "On August 24, 1896, its people revolted against the Spaniards and in September of the same year, armed with bolos and spears, ambushed and killed forty Spanish soldiers in Lumanas (now a Sitio of Barangay Santo Tomas South).",
            "This successful attack made Lumanas a historical site called \"Pinagtambangan\", where a marker was erected in memory of the event."
        ],
        [
            "Geography"
        ],
        [
            "The municipality is situated in the southern part of Nueva Ecija, some 100 kilometres (62 mi) north of Manila.",
            "Jaén is bounded by the municipalities of Santa Rosa on the north-east; Zaragoza on the north-west; by San Isidro on the south; San Leonardo on the east and by San Antonio on the west."
        ],
        [
            "The municipality has a land area of 10,254 hectares (25,340 acres) and is divided into 27 barangays, two of which are in the Población proper."
        ],
        [
            "Barangays"
        ],
        [
            "Jaén is politically subdivided into 27 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Calabasa"
        ],
        [
            "Dampulan (Poblacion)"
        ],
        [
            "Don Mariano Marcos (Poblacion)"
        ],
        [
            "Hilera"
        ],
        [
            "Imbunia"
        ],
        [
            "Imelda de Poblacion (Doña Aurora)"
        ],
        [
            "Lambakin"
        ],
        [
            "Langla"
        ],
        [
            "Magsalisi"
        ],
        [
            "Malabon-Kaingin"
        ],
        [
            "Marawa"
        ],
        [
            "Niyugan"
        ],
        [
            "Ocampo-Rivera (Poblacion)"
        ],
        [
            "Pakol"
        ],
        [
            "Pamacpacan"
        ],
        [
            "Pinanggaan"
        ],
        [
            "Putlod"
        ],
        [
            "San Jose"
        ],
        [
            "San Josef (Nabao)"
        ],
        [
            "San Pablo"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Tomas North"
        ],
        [
            "Santo Tomas South"
        ],
        [
            "Sapang"
        ],
        [
            "Ulanin-Pitak"
        ],
        [
            "Sitios"
        ],
        [
            "Sanggalang (Brgy Lambakin)"
        ],
        [
            "Pampangbana (Brgy Lambakin)"
        ],
        [
            "Malaiba (Barangay San Jose)"
        ],
        [
            "Iran (Brgy San Jose)"
        ],
        [
            "BLISS (Barangay Niyugan)"
        ],
        [
            "Putol (Barangay Niyugan)"
        ],
        [
            "Tumana (Brgy Niyugan)"
        ],
        [
            "Lumanas (Barangay Sto Tomas South)"
        ],
        [
            "Daang Hapon (Brgy Sto Tomas South)"
        ],
        [
            "Campugo (Brgy Sto Tomas South)"
        ],
        [
            "Kaingin (Barangay Sto Tomas North)"
        ],
        [
            "Muyod (Barangay Sto Tomas North)"
        ],
        [
            "Macapulo (Barangay San Pablo)"
        ],
        [
            "Poultry (Barangay Magsalisi)"
        ],
        [
            "Pinagsugalan (Barangay Pinanggaan)"
        ],
        [
            "Inalin (Brgy Pinanggaan)"
        ],
        [
            "Triangulo (Brgy Sapang)"
        ],
        [
            "Gubat na Munti (Brgy Putlod)"
        ],
        [
            "Luwasan (Brgy Putlod)"
        ],
        [
            "Looban (Brgy Putlod)"
        ],
        [
            "Mitla (Brgy Hilera)"
        ],
        [
            "Bungo (Brgy San Roque)"
        ],
        [
            "Dampe (Brgy Dampulan)"
        ],
        [
            "Bantog (Brgy Marawa)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Jaen, Nueva Ecija"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "4(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "5(0.2)"
        ],
        [
            "11(0.4)"
        ],
        [
            "66(2.6)"
        ],
        [
            "99(3.9)"
        ],
        [
            "127(5.0)"
        ],
        [
            "113(4.4)"
        ],
        [
            "99(3.9)"
        ],
        [
            "84(3.3)"
        ],
        [
            "35(1.4)"
        ],
        [
            "14(0.6)"
        ],
        [
            "661(26.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "2.2"
        ],
        [
            "1.9"
        ],
        [
            "3.2"
        ],
        [
            "5.3"
        ],
        [
            "16.1"
        ],
        [
            "20.8"
        ],
        [
            "23.5"
        ],
        [
            "22.8"
        ],
        [
            "22.2"
        ],
        [
            "16.5"
        ],
        [
            "8.9"
        ],
        [
            "3.5"
        ],
        [
            "146.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of JaenYearPop.±% p.a.1903 4,465—    1918 8,015+3.98%1939 14,408+2.83%1948 14,516+0.08%1960 20,438+2.89%1970 28,712+3.45%1975 33,626+3.22%1980 39,064+3.04%YearPop.±% p.a.1990 47,346+1.94%1995 53,541+2.33%2000 58,274+1.83%2007 63,474+1.19%2010 67,057+2.02%2015 73,184+1.68%2020 79,189+1.56%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Jaen"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  22.50"
        ],
        [
            "2009  18.97"
        ],
        [
            "2012  17.70"
        ],
        [
            "2015  17.01"
        ],
        [
            "2018  4.14"
        ],
        [
            "2021  10.66"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Most of the north-western section of the municipality is devoted to rice farming, as rice production is the main livelihood of the populace.",
            "Twenty barangays of Jaén are fully irrigated, with about 80% of the land (approximately 9,500 hectares) being suited for rice production."
        ],
        [
            "Mango plantations are found in the southern portion of the municipality.",
            "Based on the latest survey, 584 hectares are utilized for mango production, including backyard mango farms.",
            "Ten percent of the total agricultural area is for planting vegetables."
        ],
        [
            "In the Población and nearby barangays, several establishments have sprouted.",
            "These include agricultural supply traders, dry goods stores, hardware stores, groceries, travel agency, fashion style, pawnshop, banks, supermarkets, gasoline stations, printing presses, and eateries.",
            "The public market is in the area."
        ],
        [
            "Among the service businesses in the area are pawn shops, restaurants, auto and motorcycle parts and service, car wash, commercial center, lechon manok and liempo stand, pharmacies, computer repair shops, convenience store, bakery, petrol station, grocery, internet café, tailoring and dress shops and rural banks."
        ],
        [
            "Distilled and purified water processors, mobile phone card dealers, cable and landline telephone businesses are also present in the municipality."
        ],
        [
            "Professional services of doctors, accountants, dentists, lawyers, surveyors and engineers are also prevalent in the town.",
            "Most of the unemployed and out-of-school youths are given manual labor by private contractors and the local government unit, such as construction workers and street sweepers."
        ],
        [
            "Education"
        ],
        [
            "High schools"
        ],
        [
            "San Agustin Diocesan Academy Inc. (formerly Luzon Central Institute, San Agustin Academy and San Agustin Parochial Academy Foundation Inc.)"
        ],
        [
            "Blessed Hope Christian School in Barangay Antonino (former Barangay Marcos)"
        ],
        [
            "Jaen National High School (near in Jaen West Elementary School former name Putlod San Jose National High School Annex) in Barangay Dampulan"
        ],
        [
            "Lambakin National High School (former name Putlod San Jose National High School Annex) in Brgy Lambakin"
        ],
        [
            "Montesorri School of Jaen Inc. (Pallarca St. Campugo, Santo Tomas South)"
        ],
        [
            "Putlod San Jose National High School (formerly called Putlod San Jose Barangay High School)"
        ],
        [
            "Marawa High School (former name Jaen National High School Annex) in Barangay Marawa"
        ],
        [
            "San Pablo High School (former name Jaen National High School Annex in Barangay San Pablo)"
        ],
        [
            "Special Schools"
        ],
        [
            "Olarte's School of Science & Technology Inc. in Barangay Antonino (former Barangay Marcos)"
        ],
        [
            "MGP School of Science in Barangay Putlod"
        ],
        [
            "Angel of Wisdom Interactive School (Nursery,Kinder and Prep) in Barangay Dampulan"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Kapitan dela Cruz was later on succeeded by an elected Municipal President, an office superseded by the title \"Mayor of Jaén\":"
        ],
        [
            "Apolinario Esquivel (1902 – 1907)"
        ],
        [
            "Patricio Yambao, Sr. (1916 – 1922)"
        ],
        [
            "Prudencio Eduardo (1922 – 1925)"
        ],
        [
            "Delfín Esquivel (1925 – 1928)"
        ],
        [
            "Patricio Yambao, Sr. (1928 – 1931)"
        ],
        [
            "Ambrocio Javaluyas (1931 – 1934)"
        ],
        [
            "Patricio Yambao, Sr. (1934 – 1937)"
        ],
        [
            "José C. Carlos (1934 – 1945)"
        ],
        [
            "Bartolome García (1945 – 1954)"
        ],
        [
            "Bonifacio Hipólito (1954 – 1956)"
        ],
        [
            "Felix E. Velarde (1956 – 1967)"
        ],
        [
            "Patricio Yambao, Jr. (1968 – 1971)"
        ],
        [
            "Felix E. Velarde (1972 – 1979)"
        ],
        [
            "Franklin Eduardo (1979 – 1986)"
        ],
        [
            "Patricio Yambao, Jr. (1986 – 1988)"
        ],
        [
            "Franklin Eduardo (1988 – 1992)"
        ],
        [
            "Antonio Esquivel (1992 – 1998)"
        ],
        [
            "Cezar Eduardo (1998 – 2004)"
        ],
        [
            "Antonio Esquivel (2004 – 2007)"
        ],
        [
            "Santiago R. Austria (2007 – 2016)"
        ],
        [
            "Sylvia C. Austria (2016 – 2020)"
        ],
        [
            "Antonio Esquivel (2020 – 2021)"
        ],
        [
            "Sylvia C. Austria (2021 – present)"
        ],
        [
            "Tourism"
        ],
        [
            "Lolita Ilao Memorial Library: The library was donated by Mr. Tommy Ilao for the people of Jaén and is located at Barangay Dampulan, beside West Elementary School...already closed...."
        ],
        [
            "Pinaglabanan Marker (Lumanas, Sto Tomas South, Jaen, Nueva Ecija): The marker stands where the historical battle between the Spaniards and the people of Jaen took place on September 4, 1896.",
            "The group was led by Lt. Col. Delfin Esquivel and they used bolos, spears and several guns.",
            "It can be seen now along Sto Tomas South main road (Jaen - Santa Rosa Road) corner Sitio Lumanas (first corner to your right going to Sitio Lumanas if you going to Sto Tomas North)"
        ],
        [
            "Resorts:"
        ],
        [
            "Villa Aurora Resort (Barangay San Josef)"
        ],
        [
            "Golden Shower Resort (Barangay Niyugan)"
        ],
        [
            "Tata Guring Mini Resort (Barangay Sto Tomas South)"
        ],
        [
            "DelFreds Resort ( BarangaySan Pablo)"
        ],
        [
            "Rocky's Resort ( Sitio.",
            "Riverside, Barangay Magsalisi)"
        ],
        [
            "Community"
        ],
        [
            "Augustinian Alumni Association Jaen, N.E."
        ],
        [
            "Gallery"
        ],
        [
            "Welcome arch"
        ],
        [
            "Municipal Park"
        ],
        [
            "Façade and belltower of the new San Agustin parish church"
        ],
        [
            "Jaén Coliseum"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Jaen |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"About Us\".",
            "Zeibiz.",
            "Retrieved September 1, 2020."
        ],
        [
            "^ \"Contact Us\".",
            "Zeibiz.",
            "Retrieved September 1, 2020."
        ],
        [
            "^ \"Jaen: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 4, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Nueva Ecija\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Jaen, Nueva Ecija."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived October 21, 2013, at the Wayback Machine"
        ],
        [
            "Places adjacent to Jaen, Nueva Ecija"
        ],
        [
            "Zaragoza"
        ],
        [
            "Santa Rosa"
        ],
        [
            "San Antonio"
        ],
        [
            "Jaen"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Isidro"
        ],
        [
            "vte Province of Nueva EcijaPalayan (capital)  Cabanatuan (largest city)Municipalities"
        ],
        [
            "Aliaga"
        ],
        [
            "Bongabon"
        ],
        [
            "Cabiao"
        ],
        [
            "Carranglan"
        ],
        [
            "Cuyapo"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Guimba"
        ],
        [
            "Jaen"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Llanera"
        ],
        [
            "Lupao"
        ],
        [
            "Nampicuan"
        ],
        [
            "Pantabangan"
        ],
        [
            "Peñaranda"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Leonardo"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Zaragoza"
        ],
        [
            "Component cities"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Jose"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Jaen,_Nueva_Ecija&oldid=1227411255\""
        ],
        [
            "Categories: Municipalities of Nueva EcijaPopulated places on the Pampanga RiverHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from October 2012All articles needing additional referencesUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Filipino-language textArticles containing Ilocano-language textCommons category link from WikidataWebarchive template wayback linksArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}