{
    "name": "Janiuay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Janiuay"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°57′N 122°30′E﻿ / ﻿10.95°N 122.5°E﻿ / 10.95; 122.5"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Janiuay\" – news · newspapers · books · scholar · JSTOR (February 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Western Visayas, PhilippinesJaniuayMunicipalityMunicipality of JaniuayJaniuay Cemetery"
        ],
        [
            "FlagSealMap of Iloilo with Janiuay highlightedOpenStreetMapJaniuayLocation within the PhilippinesCoordinates: 10°57′N 122°30′E﻿ / ﻿10.95°N 122.5°E﻿ / 10.95; 122.5CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "3rd districtBarangays60"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPaulino (Paul) M. Parian • Vice MayorMa.",
            "Corazon F. Locsin-Yap • RepresentativeLorenz R. Defensor • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Atty.",
            "Mayen Gulmatico Felizardo Jr. AmigableDr.",
            "Gracia Dureza-LoffeNonoy Leo TalladorJaime Jr. BermejoJames Ian A. AdelantarAni ManejeroJemar Alerta"
        ],
        [
            " • Electorate41,545 voters (2022)Area • Revenue₱ 220.5 million (2020) • Assets₱ 539 million (2020) • Expenditure₱ 157.5 million (2020) • Liabilities₱ 78.22 million (2020)Service provider • ElectricityIloilo 2 Electric Cooperative (ILECO 2)Time zoneUTC+8 (PST)ZIP code5034PSGC063023000IDD : area code +63 (0)33Native languagesKaray-a Hiligaynon Ati TagalogWebsitewww.janiuay.gov.ph"
        ],
        [
            "Janiuay, officially the Municipality of Janiuay (Kinaray-a: Banwa kang Janiuay, Hiligaynon: Banwa sang Janiuay, Tagalog: Bayan ng Janiuay),  is a 1st class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 66,786 people."
        ],
        [
            "It was created in 1769."
        ],
        [
            "History"
        ],
        [
            "In the summer of 1578, the natives of Tala-ugis trudged up from the coast to establish a settlement northward in the interior along Suage River.",
            "The first settlers were led by families of Gamuk, Hutikon, Uganet and Pagdakton, who settled themselves in what is currently known as barangays Matag-ub, Danao, Yabon and Quipot."
        ],
        [
            "More than a century later, Spaniards came along these parts of Panay."
        ],
        [
            "Early in 1738, Datu Buhawi of Yabon recognized the Spanish government, thus subjugating himself and his barangay to Spanish rule.",
            "But, Datu Dumagtol of nearby Ubian refused to follow suit.",
            "He led his subjects to the mountains to resist against the Spanish colonizers."
        ],
        [
            "The Spanish governor Francisco Bayot de Ocampo recommended to the Principalía to transfer the seat of government, and in the following year (1770), the settlements were strengthened in their administration in what they called \"Janiuay\"."
        ],
        [
            "While there is no certainty, there are several legends of how the place got its name.",
            "One is that it came from the ruling Datu's sons named \"Han\" and \"Oway\".",
            "Another is that the words \"hani\" (whisper) and \"oway\" (rattan) were combined."
        ],
        [
            "A strong typhoon followed by heavy rain in June 2008 caused the Suage river to overflow, damaging river bank communities and infrastructures.",
            "The flooding caused the river to be re-drawn and encroached the river banks by about 200 meters from its original location.",
            "Suage bridge remains structurally sound despite the flooding and encroachment."
        ],
        [
            "Geography"
        ],
        [
            "Two rivers coming from the north-west cuts in parallel through Janiuay.",
            "One is the Suage River and the other is the Magapa River which provide natural irrigation supporting the mainly agricultural town of Janiuay.",
            "The Suage river bridge was once witness to fierce fighting between Japanese Imperial forces and the combined Filipino and American troops including the recognized Ilonggo guerrilla fighters.",
            "The Magapa river bridge was built after World War II."
        ],
        [
            "Janiuay is 33 kilometres (21 mi) from Iloilo City."
        ],
        [
            "Barangays"
        ],
        [
            "Janiuay is politically subdivided into 60 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Abangay"
        ],
        [
            "Agcarope"
        ],
        [
            "Aglobong"
        ],
        [
            "Aguingay"
        ],
        [
            "Anhawan"
        ],
        [
            "Atimonan"
        ],
        [
            "Balanac"
        ],
        [
            "Barasalon"
        ],
        [
            "Bongol"
        ],
        [
            "Cabantog"
        ],
        [
            "Calmay"
        ],
        [
            "Canawili"
        ],
        [
            "Canawillian"
        ],
        [
            "Caranas"
        ],
        [
            "Caraudan"
        ],
        [
            "Carigangan"
        ],
        [
            "Cunsad"
        ],
        [
            "Dabong"
        ],
        [
            "Damires"
        ],
        [
            "Damo-ong"
        ],
        [
            "Danao"
        ],
        [
            "Gines"
        ],
        [
            "Guadalupe"
        ],
        [
            "Jibolo"
        ],
        [
            "Kuyot"
        ],
        [
            "Madong"
        ],
        [
            "Manacabac"
        ],
        [
            "Mangil"
        ],
        [
            "Matag-ub"
        ],
        [
            "Monte-Magapa"
        ],
        [
            "Pangilihan"
        ],
        [
            "Panuran"
        ],
        [
            "Pararinga"
        ],
        [
            "Patong-patong"
        ],
        [
            "Quipot"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sarawag"
        ],
        [
            "Tambal"
        ],
        [
            "Tamu-an"
        ],
        [
            "Tiringanan"
        ],
        [
            "Tolarucan"
        ],
        [
            "Tuburan"
        ],
        [
            "Ubian"
        ],
        [
            "Yabon"
        ],
        [
            "Aquino Nobleza East (Poblacion)"
        ],
        [
            "Aquino Nobleza West (Poblacion)"
        ],
        [
            "R. Armada (Poblacion)"
        ],
        [
            "Concepcion Pob.",
            "(D.G.",
            "Abordo)"
        ],
        [
            "Golgota (Poblacion)"
        ],
        [
            "Locsin (Poblacion)"
        ],
        [
            "Don T. Lutero Center (Poblacion)"
        ],
        [
            "Don T. Lutero East (Poblacion)"
        ],
        [
            "Don T. Lutero West Pob"
        ],
        [
            "Crispin Salazar North (Poblacion)"
        ],
        [
            "Crispin Salazar South (Poblacion)"
        ],
        [
            "San Julian (Poblacion)"
        ],
        [
            "San Pedro (Poblacion)"
        ],
        [
            "Santa Rita (Poblacion)"
        ],
        [
            "Capt.",
            "A. Tirador (Poblacion)"
        ],
        [
            "S. M. Villa (Poblacion)"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santo Tomas approximate population is 500–800.",
            "Santo Tomas (Pakol to locals) is bounded by Madong in the east, Mangil in the north-east and Danao in the south west.",
            "It is accessible by three class C feeder roads in the east, south-west and south-east.",
            "Agriculture centers around rice, corn, coffee, beans, sugar cane, and copra.",
            "Traces of sweet mango farms are starting to gain roots especially close by the public elementary school.",
            "General topography is flat rice fields on the east and hill-valley-hill dotted by bamboos, coffee, mango, banana, coconuts and other fruit tree crops in the remaining areas.",
            "Water source are via deepwells and rice produce is primarily dependent on rainfall."
        ],
        [
            "Motorbike and tricycle are the easiest mode of transportation and also four-wheels during festive events.",
            "Ride is some 30 minutes from the town proper.",
            "Electricity is subscribed by 15-25% of the population.",
            "Wireless cellphone carrier SMART covers the area and is generally available in 20-25% of the population.",
            "English language is generally understood and spoken fairly by locals in certain situation with foreigners."
        ],
        [
            "Danao-Santo Tomas Elementary School established during the 1950s is located on the highest hill of the surrounding barangays and view of rice fields in the east is impressive especially in the morning.",
            "An old artesian well stands within the school grounds - part of an effort to secure deep water for the school in the 1960s (WVA)."
        ],
        [
            "Danao"
        ],
        [
            "Pueblo Danao has a history.",
            "It was established by Fr.",
            "Eugenio Moya in 1766.",
            "It lasted for eight years until Fr.",
            "Moya was forced to move to adjacent Pueblo Yabon for fear on his life on errant moros and the locales.",
            "The moros and the locales set camp in the forest of Danao away from forced labor edict from Spanish Principalia and administered by priests of Poblacion Janiuay.",
            "The moros and the locales raised in arms against Catholic conversion and had attempted to poison and kill Fr.",
            "Moya.",
            "Pueblo Danao became a prized possession disputed by Pueblo Quipot and Principalia Masin (now Maasin) because of its rich farmland in the west bounded by the Suage river and the rumor about rich mineral deposits in the hills of Kantong (now Danao Gantong).",
            "When Pueblo Quipot was moved to Poblacion Janiuay in 1769, Pueblo Danao was downgraded to a barrio and became part of Janiuay."
        ],
        [
            "Danao is divided into three mini locales (mini-barrangay), Danao I, Danao 2 and Danao Gantong.",
            "Each mini barangay has about a population of 300- 400.",
            "Danao is bounded by Santo Tomas (North-West), Mangil (North), Madong (East), Tambal (South-West),Calmay (West), Caraudan (West) and Aguingay (South-West)."
        ],
        [
            "It is accessible by two class C feeder roads from Poblacion Janiuay in the east, south-west and south-east.",
            "Agriculture centers around rice, corn, coffee, beans, sugar cane, and copra.",
            "Traces of sweet mango farms are starting to gain roots especially close by the public elementary school.",
            "General topography is flat rice fields on the east and hill-valley-hill dotted by bamboos, coffee, mango, banana, coconuts and other fruit tree crops in the remaining areas.",
            "Water source are Suage river in the south-west and via deepwells and seasonal rainfall in the east."
        ],
        [
            "Four wheels are a means of transportation including motorbike and tricycle.",
            "Ride is some 30 minutes from the town proper.",
            "Electricity is subscribed by 15-25% of the population.",
            "Wireless cellphone carrier SMART covers the area and is generally available in 20-25% of the population.",
            "English language is generally understood and spoken fairly by locals in certain situation with foreigners."
        ],
        [
            "Danao-Santo Tomas Elementary School established during the 1950s straddles Sto- Tomas and Danao Gantong.",
            "An old artesian well stands north of the school grounds - part of an effort to secure deep water for the school in the 1960s (WVA).",
            "It is believed that the well was an exploratory bore hole to determine and analyze the mineral content of the sub-surface of the surrounding area.",
            "Bore hole samples including sediment samples from surrounding open wells (Rapo, Brasileno, Casiple) were collected and sent for analysis.",
            "No new samples are requested by the Bureau of Mines.",
            "lorenzo arillo is the longest brgy.",
            "captain of brgy.",
            "danao (1960-2003)."
        ],
        [
            "Matag-ub"
        ],
        [
            "Matag-ub was formerly Pueblo Binogsukan in 1766.",
            "Aetas set camp in these areas helping the Moros raid and fight wars with the Augustinian priests Marin, Carvajal, Gorrosari and Llorente of Poblacion Janiuay for forced labor erecting the churches and cemetery of Poblacion Janiuay."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Janiuay, Iloilo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "48(1.9)"
        ],
        [
            "41(1.6)"
        ],
        [
            "58(2.3)"
        ],
        [
            "82(3.2)"
        ],
        [
            "223(8.8)"
        ],
        [
            "300(11.8)"
        ],
        [
            "346(13.6)"
        ],
        [
            "307(12.1)"
        ],
        [
            "311(12.2)"
        ],
        [
            "292(11.5)"
        ],
        [
            "167(6.6)"
        ],
        [
            "81(3.2)"
        ],
        [
            "2,256(88.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "7.7"
        ],
        [
            "11.3"
        ],
        [
            "15.4"
        ],
        [
            "25.7"
        ],
        [
            "28.5"
        ],
        [
            "29.5"
        ],
        [
            "28.7"
        ],
        [
            "28.3"
        ],
        [
            "28.7"
        ],
        [
            "21.8"
        ],
        [
            "15.2"
        ],
        [
            "252.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of JaniuayYearPop.±% p.a.1903 20,738—    1918 24,641+1.16%1939 38,778+2.18%1948 44,348+1.50%1960 46,946+0.48%1970 34,409−3.06%1975 39,172+2.63%1980 40,120+0.48%1990 47,253+1.65%1995 50,066+1.09%2000 54,166+1.70%2007 57,878+0.92%2010 63,031+3.15%2015 63,905+0.26%2020 66,786+0.87%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Janiuay was 66,786 people, with a density of 370 inhabitants per square kilometre or 960 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Janiuay"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  27.10"
        ],
        [
            "2009  25.84"
        ],
        [
            "2012  25.26"
        ],
        [
            "2015  25.71"
        ],
        [
            "2018  21.62"
        ],
        [
            "2021  22.67"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Cultivation of rice, corn, sugar, copra, coffee, banana, abaca fiber, fowls (and gamefowls), goat and cattle raising are the main sources of livelihood.",
            "Commerce for these products are generally brought into the town proper for market.",
            "The rainfall generally dictate the commerce of these products as the river go dry in summer months."
        ],
        [
            "Most of these are coming from the west, north-west and south-west of the town."
        ],
        [
            "Transportation and telecommunications"
        ],
        [
            "Janiuay can be accessed from all directions with good paved concrete and asphalt road infrastructures from the east, north and south.",
            "Mode of transport can either be jeeps, motorcycles fitted with cabs for 2-5 persons locally known as tricycles for inter barangay transport.",
            "Intertowns are plied by buses, jeeps and private vans.",
            "Within the town, \"trysikad\" - a bicycle fitted with a cab for 2 people are commonly available."
        ],
        [
            "Communication is generally available with nationwide carriers such as PLDT, Globelines and Smart competing with local and aging analog Pantelco."
        ],
        [
            "Electricity is sourced from electric cooperative Ileco II supplying 75% of the town proper and about 25% of the neighboring barangays."
        ],
        [
            "Tourism"
        ],
        [
            "Heritage buildings"
        ],
        [
            "Janiuay prides itself on two heritage infrastructure dating back from 1760."
        ],
        [
            "The Janiuay Catholic Church was built of sandstone, limestone and layered bricks and was completed in February 1770.",
            "Its belfry used to carry three magnificent bells, the largest weighing close to a ton.",
            "World War II damaged the belfry, and the bells were lowered to ground after the war.",
            "The largest bell crashed down during the relocation and suffered a crack 18 inches (460 mm) in length from its lip upwards.",
            "When sounded it gives a distinct baritone rattling sound that can be heard for miles.",
            "It is now mounted in the new church's belfry built in the late 60s."
        ],
        [
            "Another heritage infrastructure is the Janiuay Cemetery.",
            "It was built much later, in 1870, and is also walled with ancient sandstone and bricks brought from distant locale some 30 km away in what is now known as the town of Dingle.",
            "Spanish Fr.",
            "Llorente directed the construction of this cemetery in the Gothic design of his time.",
            "The Janiuay town cemetery is located a kilometer east of Janiuay Catholic Church."
        ],
        [
            "Janiuay is also home to several heritage mini sugar mills owned by landed Spanish mestizos and Swiss descent.",
            "These mini sugar mills have seen their own time and once produces brown sugar.",
            "Wrought steel rotary crushers driven by water buffaloes or carabaos extract sugar from canes and cooked in large vat until brown and solid."
        ],
        [
            "Other landmarks"
        ],
        [
            "Janiuay Old Prison and Town Hall - Post Hispanic infrastructure with 24-inch-thick (610 mm) walls and wrought iron bars."
        ],
        [
            "Janiuay Pilot Elementary School - established before World War II"
        ],
        [
            "Janiuay National Vocational School - (Now West Visayas State University - Janiuay Campus) - established before World War II."
        ],
        [
            "Janiuay Protestant Church - First outside of Iloilo City"
        ],
        [
            "Iglesia ni Cristo Church in Barangay Jibolo"
        ],
        [
            "Janiuay Public Market"
        ],
        [
            "Janiuay Cattle Market - the only in Iloilo Province."
        ],
        [
            "Janiuay Town Hall and Plaza"
        ],
        [
            "Janiuay Public Library"
        ],
        [
            "St. Elizabeth Academy (Now St. Julian Academy) established in the 1960s"
        ],
        [
            "Janiuay Emergency Hospital.",
            "Back in operation after Suage river overflow caused by heavy rain and typhoon in June 2008."
        ],
        [
            "Don Juan Wuthrich Estate in Barangay Jibolo"
        ],
        [
            "Don Jose Marin Estate and house in Santa Rita"
        ],
        [
            "Lutero Estate in Barangay Tambal and Barangay Kinambud"
        ],
        [
            "Locsin Estate in Barangay Guadalupe"
        ],
        [
            "Camarista House in San Julian St."
        ],
        [
            "Suage River Breakwater - A kilometer long concrete breakwater from Esperanza St. to Aquino Nobleza St."
        ],
        [
            "Calmay Elementary and High School - biggest public school outside and west of Poblacion Janiuay."
        ],
        [
            "Barangay Ubian, Yabon and Quipot - seat of pre-Spanish Janiuay in 1578 to 1760.",
            "Moved to its current location on or before 1760 by the Spanish Principalia.",
            "About 22 km.",
            "west of Janiuay."
        ],
        [
            "Quipot Wier - A natural wier located at sito Punong.",
            "These are two big massive land mass blocking entry of downstream Suage river to the Janiuay Poblacion and beyond.",
            "About 22 km west of Poblacion Janiuay.",
            "WVA Post Note: The two massive land mass is now covered with sand, soil and debris after the June 2008 heavy rain and typhoon.",
            "Two opposing stone boulders seen today are a trace of once the beautiful Quipot Weir playing with the graceful flow of Suage River which can cast its angry might at any moments notice."
        ],
        [
            "Barasalon Falls - located in sitio Igbiating.",
            "Up inland and about 15 km from Barangay Yabon.",
            "WVA Post Note: Baby falls at both sides started to appear."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Janiuay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^  https://elevationmap.net/cunsad-janiuay-iloilo-ph-1001570229.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Iloilo History Part 1 – Research Center for Iloilo Archived 2016-03-04 at the Wayback Machine"
        ],
        [
            "^ \"History\".",
            "About Janiuay.",
            "Municipality of Janiuay.",
            "2011.",
            "Retrieved 26 February 2013."
        ],
        [
            "^"
        ],
        [
            "\"Janiuay: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 3 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-05-09 at the Wayback Machine"
        ],
        [
            "Places adjacent to Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Badiangan"
        ],
        [
            "Valderrama, Antique"
        ],
        [
            "Janiuay"
        ],
        [
            "Mina"
        ],
        [
            "Maasin / Cabatuan"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Janiuay&oldid=1230370774\""
        ],
        [
            "Category: Municipalities of IloiloHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: missing titleCS1 errors: bare URLWebarchive template wayback linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from February 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Kinaray-a-language textArticles containing Hiligaynon-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}