{
    "name": "Javier",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Javier, Leyte"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisGalegoIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°48′N 124°56′E﻿ / ﻿10.8°N 124.93°E﻿ / 10.8; 124.93"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Leyte, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Javier, Leyte\" – news · newspapers · books · scholar · JSTOR (June 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesJavier"
        ],
        [
            "BughoMunicipalityMunicipality of JavierDowntown area"
        ],
        [
            "FlagMap of Leyte with Javier highlightedOpenStreetMapJavierLocation within the PhilippinesCoordinates: 10°48′N 124°56′E﻿ / ﻿10.8°N 124.93°E﻿ / 10.8; 124.93CountryPhilippinesRegionEastern VisayasProvinceLeyteDistrict"
        ],
        [
            "5th districtFoundedJune 1961 (as Bugho)Renamed as JavierDecember 1965Named forDaniel Falcon JavierBarangays28"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMichael Dragon T. Javier • Vice MayorEmma M. Abueva • RepresentativeCarl Nicolas C. Cari • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Guilbert M. Lanoy• Roldan G. Meras• Jose Whirly C. Cumla• Amado S. Moreno• Schubert A. Riños• Marino C. Merilo• Stephen Mark I. Papalid• Eriberta R. PonceDILG Masterlist of Officials"
        ],
        [
            " • Electorate17,873 voters (2022)Area • Revenue₱ 178.5 million (2020) • Assets₱ 676.8 million (2020) • Expenditure₱ 153.2 million (2020) • Liabilities₱ 300.4 million (2020)Service provider • ElectricityDon Orestes Romualdez Electric Coperative (DORELCO)Time zoneUTC+8 (PST)ZIP code6511PSGC0803724000IDD : area code +63 (0)53Native languagesWaray TagalogWebsitewww.javier-leyte.gov.ph"
        ],
        [
            "Javier (IPA:"
        ],
        [
            "History"
        ],
        [
            "The municipality of Javier, Leyte was formerly barrio of the municipality of Abuyog, Leyte.",
            "Bugho was the former name of the town and is a contraction of the dialect term \"Binogho\" (from the root word buho), meaning a small clearing within a forest area.",
            "Settlers at about the turn of the century cultivated this small patch of land.",
            "Among the earliest known settlers was Macario Cultura, a native of Burauen, Leyte who was believed to have led his friends and relatives to cultivate the fertile soil of the area.",
            "Later on, as the settlement of the people thrived, it then became a sitio of barrio Pinocawan, and was established as a barrio since the Spanish colonial occupation."
        ],
        [
            "Sometime in 1914, Daniel Falcon Javier of Consolacion, Sogod, Southern Leyte and a former teacher and principal of Cebu Normal School of Cebu City in the early 1900s came to explore the surroundings of the new settlement.",
            "At that time, he recently came from Cabadbaran, Agusan del Norte where he started extensive farming activities since 1908 after his resignation as a principal at the Cebu Normal School."
        ],
        [
            "A malaria plague in Cabadbaran, however, inflicted a heavy death toll among his people so he was urged to explore other suitable areas until he found Bugho.",
            "Impressed by the quality of the soil, he started staking out his claims in Bugho and moved from Cabadbaran.",
            "Subsequently, Daniel married Dolores Mercado Veloso of Consolacion, Sogod, Southern Leyte, and settled in Bugho naming his settlement as Camalig.",
            "He initiated projects in the community where he was readily accepted as a teacher.",
            "Daniel Javier's advocacy was to educate the people.",
            "He opened a school in 1918 on an area donated by Pedro Abordo with Leona Valles as the first teacher.",
            "Daniel Javier is a dedicated man without any vices.",
            "He led the people to community activities and eventually improve their working habits, eradicate superstitions that hampered progress and introduced the use of vaccines and medicines.",
            "He also urged the community to accept the modern and progressive way of agriculture."
        ],
        [
            "The community rapidly progressed as people from Cebu particularly in Argao and Bohol came at the invitation and assistance of Mr. D.F.",
            "Javier who helped them legally acquire land-holdings.",
            "The people from Argao led by Pedro Gacera of Barrio Talaytay settled at the western part of the town of what is now called Barrio Binulho."
        ],
        [
            "A much larger school that can accommodate and assist the growing population of students was needed to be built, so Mano Daniel (as the people fondly called Daniel F. Javier) invited Mr.",
            "Waters, an American Superintendent to help them build one.",
            "Mr.",
            "Waters agreed and together with Evaresto Retucsan donated a new site for the school with the people contributing a counterpart of 1,000.00 Pesos after the release of 7,000.00 pesos from the government.",
            "The people through the bayanihan system furnished most lumber requirements."
        ],
        [
            "Corn, abacá & coconut were the main products of the community.",
            "Mano Daniel introduced irrigation utilizing the abundant water resources.",
            "It became a progressive community and was the center of trade among the neighboring barrios.",
            "In 1939, it was among the contenders for township with barrios Palale and MacArthur.",
            "Since Mano Daniel's leadership was recognized by the provincial and district politicians, he used these influences to bring community developments."
        ],
        [
            "Bugho was not only the center of resistance activities but also an evacuation center during the World War II.",
            "Food and other resources were provided continually and the local residents supported the guerrilla movement.",
            "After the war, guerrilla remnants turned into an organized banditry as Bugho still at the center of these activities.",
            "Meanwhile, the locals continued to work at their respective farms and productivion boosted together with the evacuees helping them."
        ],
        [
            "Coconut, rice, abaca and ginger became the main products.",
            "Although the organized banditry still existed, peace and order was not fully restored yet, the people were not deterred in their desire to become an independent municipality.",
            "During the mid-1950s, with the help of Attorney Higino A. Acala, Sr. the \"Bugho for Municipal Movement\" was organized with Felomino Mercado, Pedro Gecera, Angel Caminong, Ambrocio Novio, Bernardino Tisado and Julia Brosas among its leaders.",
            "On December 18, 1959, at the initiative of Mayor Catalino Landia, the municipal council of Abuyog was convened to a session at Bugho endorsing by way of Resolution No.",
            "7 to convert Bugho into an independent municipality of Abuyog to include the barrios of Caraya (Caraye), Ulhay, Tambis, Comatin, Caranhug, Talisayan and Manarug among many others."
        ],
        [
            "House Bill No.",
            "2895 sponsored by Congressman Veloso of the 3rd District Leyte and co-sponsored by Speaker Daniel Z. Romualdez of the 1st district passed through the Senate and became Republic Act 3422 creating the municipality of Bugho in June 1961.",
            "The first municipal election was on November 12, 1963 and on January 3, 1964, the following officials were elected: Ambrocio Novio - Mayor, Felimon Tano - Vice Mayor, Vicente Rellin, Ruperto de Luna, Ruperto Villamor, Hidulfo Malasaga, Pastor Dingal, Eutiquiano Badique as councilors.",
            "It began its operations as a 7th class municipality."
        ],
        [
            "In December 1965, the municipal Council unanimously approved a resolution to change the name of the municipality of Bugho to Javier, in honor of the late Daniel Falcon Javier, who died in Consolacion, Sogod in 1957."
        ],
        [
            "In 1970, the seat of government was finally transferred to the present site on a building constructed through the efforts of Congressman Artemio Mate."
        ],
        [
            "In 1972, the son of the late Daniel F. Javier, Domingo V. Javier, was elected Mayor.",
            "Within a few months after his assumption of office and before martial law, road networks were vastly improved."
        ],
        [
            "After 38 years, the decades-old political leadership of the Cua's was challenged when businessman Leonardo \"Sandy\" Javier, Jr. ran as Mayor in 2010.",
            "His desire to “give back” blessings had pushed him to serve his hometown, concentrating his efforts on converting the poor municipality into a model town that would be emulated not only in the region but in the whole country.",
            "However, he was overwhelmingly victorious against his rival during the local election held that same year."
        ],
        [
            "Geography"
        ],
        [
            "Tandang Sora Street in Poblacion Zone-1"
        ],
        [
            "One of the rice granaries of Poblacion"
        ],
        [
            "Local high value commercial crops"
        ],
        [
            "A rural town approximately 73 kilometres (45 mi) south of Tacloban City, Javier is located between the boundaries of Baybay on the west side and MacArthur and Abuyog towns, along Leyte Gulf.",
            "It has a very narrow coastlines and coastal plains facing the Pacific."
        ],
        [
            "Barangays"
        ],
        [
            "Javier is subdivided  politically into 28 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "As per RA 3422 - An Act Creating the Municipality of Bugho as an independent municipality in the Province of Leyte, enacted  on June 18, 1961."
        ],
        [
            "Abuyogay"
        ],
        [
            "Batug"
        ],
        [
            "Binulho"
        ],
        [
            "Bonifacio (Pundok)"
        ],
        [
            "Calzada"
        ],
        [
            "Cancayang"
        ],
        [
            "Caranhug"
        ],
        [
            "Caraye"
        ],
        [
            "Casulungan"
        ],
        [
            "Comatin"
        ],
        [
            "Guindapunan"
        ],
        [
            "Inayupan"
        ],
        [
            "Laray"
        ],
        [
            "Magsaysay"
        ],
        [
            "Malitbogay"
        ],
        [
            "Manarug"
        ],
        [
            "Manlilisid"
        ],
        [
            "Naliwatan"
        ],
        [
            "Odiong"
        ],
        [
            "Picas Norte (Curba)"
        ],
        [
            "Pinocawan"
        ],
        [
            "Poblacion Zone 1"
        ],
        [
            "Poblacion Zone 2"
        ],
        [
            "Rizal"
        ],
        [
            "Santa Cruz (Katun-an)"
        ],
        [
            "Talisayan"
        ],
        [
            "San Sotero (Tambis)"
        ],
        [
            "Ulhay"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Javier, Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "78(3.1)"
        ],
        [
            "57(2.2)"
        ],
        [
            "84(3.3)"
        ],
        [
            "79(3.1)"
        ],
        [
            "118(4.6)"
        ],
        [
            "181(7.1)"
        ],
        [
            "178(7.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "172(6.8)"
        ],
        [
            "180(7.1)"
        ],
        [
            "174(6.9)"
        ],
        [
            "128(5.0)"
        ],
        [
            "1,598(62.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.7"
        ],
        [
            "13.8"
        ],
        [
            "17.3"
        ],
        [
            "18.5"
        ],
        [
            "23.2"
        ],
        [
            "26.5"
        ],
        [
            "27.1"
        ],
        [
            "26.0"
        ],
        [
            "26.4"
        ],
        [
            "27.5"
        ],
        [
            "24.6"
        ],
        [
            "21.0"
        ],
        [
            "268.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of JavierYearPop.±% p.a.1970 15,163—    1975 15,787+0.81%1980 17,307+1.85%1990 18,658+0.75%1995 21,539+2.73%2000 22,857+1.28%2007 23,453+0.36%2010 23,878+0.66%2015 25,379+1.17%2020 26,658+0.97%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Javier, Leyte, was 26,658 people, with a density of 170 inhabitants per square kilometre or 440 inhabitants per square mile."
        ],
        [
            "Language"
        ],
        [
            "Javier is a melting pot for both Waraynon and Cebuano speaking natives.",
            "But Lineyte-Samarnon Waray-waray language is the official language spoken in the town."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Javier"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  38.00"
        ],
        [
            "2009  36.67"
        ],
        [
            "2012  41.32"
        ],
        [
            "2015  36.86"
        ],
        [
            "2018  30.70"
        ],
        [
            "2021  29.16"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "Festival"
        ],
        [
            "The Karayhakan is held every third week of January."
        ],
        [
            "Tourism"
        ],
        [
            "Bito Falls in Caraye"
        ],
        [
            "Tourist Destinations:"
        ],
        [
            "Shoretime Hotel in Brgy.",
            "Picas and Pob.",
            "Zone II, Javier, Leyte"
        ],
        [
            "Gab Water Park Resort in Brgy.",
            "Malitbogay, Javier, Leyte"
        ],
        [
            "Bito Falls in Brgy.",
            "Caraye"
        ],
        [
            "Kaawasan Falls in Brgy.",
            "Binulho, Javier, Leyte"
        ],
        [
            "Talisayan Falls in Brgy.",
            "Manarug"
        ],
        [
            "Kadarahunan Falls in Brgy.",
            "Guindapunan"
        ],
        [
            "Buga River in Caraye"
        ],
        [
            "Circumferential Road"
        ],
        [
            "Lake Bito"
        ],
        [
            "Hemat-e Falls in Brgy.",
            "Malitbogay and Brgy.",
            "Odiong"
        ],
        [
            "Sangat River in Odiong"
        ],
        [
            "Overview in Guindapunan"
        ],
        [
            "Sea Sight Beach Resort in Brgy.",
            "Casulongan"
        ],
        [
            "Moonlight Beach Resort in Brgy.",
            "Casulongan"
        ],
        [
            "Paradeeso Beach Resort in Brgy.",
            "Casulongan"
        ],
        [
            "Buffalo Dairy Farm"
        ],
        [
            "Tufting Machine Facility"
        ],
        [
            "Manarug Cold Spring"
        ],
        [
            "St. Michael Church main facade"
        ],
        [
            "Landmarks:"
        ],
        [
            "East Visayan Adventist Academy Complex (EVAA)"
        ],
        [
            "New St. Michael Parish Church"
        ],
        [
            "Santo Niño Shrine"
        ],
        [
            "Javier Market Square"
        ],
        [
            "Education"
        ],
        [
            "East Visayan Adventist Academy San Sotero (Tambis) Campus at bird's eye view"
        ],
        [
            "Rear view at Real Street of Historic Javier Central School Campus"
        ],
        [
            "Prep schools:"
        ],
        [
            "Angelicum Catechetical School"
        ],
        [
            "Day Care Centers"
        ],
        [
            "Faith Baptist Learning Center"
        ],
        [
            "Primary schools:"
        ],
        [
            "Javier Central School"
        ],
        [
            "Manlilisid Central School"
        ],
        [
            "Secondary schools:"
        ],
        [
            "Javier National High School (Main Campus)"
        ],
        [
            "Manlilisid National High School"
        ],
        [
            "Batug National High School - Javier Annex"
        ],
        [
            "East Visayan Adventist Academy - San Sotero (Tambis)"
        ],
        [
            "Notable People"
        ],
        [
            "Lolita Javier, Incumbent Congresswoman for Leyte's 2nd Congressional district."
        ],
        [
            "See also"
        ],
        [
            "List of renamed cities and municipalities in the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Javier |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Javier, Leyte\".",
            "latitude.to.",
            "Retrieved January 16, 2019."
        ],
        [
            "^"
        ],
        [
            "\"Province:\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Javier: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 February 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Javier, Leyte."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Javier Leyte' Official Website"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-05-30 at the Wayback Machine"
        ],
        [
            "Places adjacent to Javier, Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Baybay"
        ],
        [
            "Javier"
        ],
        [
            "Leyte Gulf"
        ],
        [
            "Abuyog"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Javier,_Leyte&oldid=1225924355\""
        ],
        [
            "Category: Municipalities of Leyte (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2013All articles needing additional referencesCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from December 2021Commons category link from WikidataWebarchive template wayback linksArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}