{
    "name": "Jones",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Jones, Isabela"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°33′30″N 121°42′00″E﻿ / ﻿16.5583°N 121.7°E﻿ / 16.5583; 121.7"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesJonesMunicipalityMunicipality of JonesAerial view of Jones, Isabela along the Cagayan River"
        ],
        [
            "FlagSealMap of Isabela with Jones highlightedOpenStreetMapJonesLocation within the PhilippinesCoordinates: 16°33′30″N 121°42′00″E﻿ / ﻿16.5583°N 121.7°E﻿ / 16.5583; 121.7CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "4th districtFoundedJanuary 1, 1921Named forWilliam Atkinson JonesBarangays42"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 310.6 million (2020) • Assets₱ 752.6 million (2020) • Expenditure₱ 282.9 million (2020) • Liabilities₱ 318.1 million (2020)Service provider • ElectricityIsabela 1 Electric Cooperative (ISELCO 1)Time zoneUTC+8 (PST)ZIP code3313PSGC023115000IDD : area code +63 (0)78Native languagesIlocano Bugkalot Dicamay Agta TagalogWebsitewww.jones-isabela.gov.ph"
        ],
        [
            "Jones, officially the Municipality of Jones (Ilocano: Ili ti Jones; Tagalog: Bayan ng Jones), is a 1st class municipality in the province of Isabela, Philippines.",
            "According to the 2020 census, it has a population of 45,628 people."
        ],
        [
            "Etymology"
        ],
        [
            "The town derived its named in honor of William Jones, an American legislator who wrote the Philippine Autonomy Act of 1916.",
            "The town was inaugurated on January 1, 1921.",
            "It was initially divided into 21 barrios with virgin forests and wide fertile plains, with Cabanuangan serving as the Municipal Government's seat."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(January 2014) (Learn how and when to remove this message)"
        ],
        [
            "The southern portion of Echague separated by the Cagayan River was created into a municipality named Jones in honor of an American Legislator, William Atkinson Jones, who authored the Philippine Autonomy Act of 1916, and was inaugurated on January 1, 1921.",
            "It was originally composed of 21 barrios of virgin forests and wide fertile plains with Cabanuangan as the seat of the municipal government."
        ],
        [
            "The house of one Tirso Mateo served as the first town hall, with the following as the first municipal officials: President - Don Antonio Vallejo; Vice President - Benito Tiburcio; Secretary - Francisco Gumpal; Treasurer - Pio Tomines; Justice of Peace - Daniel Apostol; Chief of Police - Zoilo Gadingan; and Modesto Payuyo, Antonio Pintang, Gregorio Santos, Dionicio Cristobal, Valentin Torio, and Damaso Leano as councilors."
        ],
        [
            "The first proposed townsite of Jones was in barrio Daligan, but due to the insistence of the municipal president Don Antonio Vallejo who voluntarily donated two hectares of land for the municipal hall and public market site, he also later donated the vast fertile land area of Jones Rural School and Jones North Central School."
        ],
        [
            "Transportation was then a big problem as there were no good roads, the barrios being connected only by narrow roads and trails suited for hiking, for horses and carabaos, and for sleds and carts.",
            "During rainy days, these roads and trails easily turned into knee-deep mud fit only for wallowing carabaos.",
            "The principal means of transportation was the Cagayan River passing through almost all the barrios, using raft and boats.",
            "It was only after decades that motor vehicles began to ply between Jones and nearby Echague."
        ],
        [
            "The vast virgin forests and fertile soil of the place were populated and harnessed and cultivated by the indigenous Pugots (Aetas) and Ilongots (Bugkalots), and the Yogads who are natives of southern Isabela, particularly the towns of Echague, Angadanan and San Guillermo, and the enterprising Ilocanos who migrated overland for a couple of centuries all the way from the Ilocos region in northwestern Luzon.",
            "Other ethnic groups followed like the Gaddangs, Ifugaos and Ibanags, and later, the Tagalogs from Central Luzon."
        ],
        [
            "The Aglipayan Church (Philippine Independent Catholic Church) was the first established church in the area, followed later by the Roman Catholic Church and various Protestant denominations.",
            "There were very few primary schools, all hinged to an intermediate school called Jones Farm School at the poblacion.",
            "The early inhabitants concentrated on agriculture with tobacco, corn and peanuts as primary crops.",
            "Revenue principally came from the real property tax, cedula tax and sled tax.",
            "The town was then greatly dependent on national aid."
        ],
        [
            "When the Japanese Imperial Army invaded the Philippines in 1941, Jones became a shelter for the national and provincial officials and for evacuees from other places until 1942.",
            "The town likewise became the seat of the provincial government from 1941 to 1943.",
            "It was subsequently occupied by the Japanese forces, but its forested areas continued to be a stronghold of Filipino guerillas and American soldiers who for a while were under the command of Brigadier General Guillermo Nakar."
        ],
        [
            "In 1945, Filipino troops of the 11th Infantry Regiment, Philippine Commonwealth Army, USAFIP-NL are liberated and recaptured Jones from the Japanese forces.",
            "The liberating forces united the scattered guerrilla units who helped in attacking and defeating Japanese forces toward the end of the war."
        ],
        [
            "Jones was the home of Silvino M. Gumpal who led Isabela as governor from 1946 to 1951; earlier, Gumpal represented Isabela in Congress from 1934 to 1935."
        ],
        [
            "In 1959, the name of barrio Mangaratungot was changed to San Vicente."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Jones is politically subdivided into 42 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "The barangays are:"
        ],
        [
            "Abulan"
        ],
        [
            "Addalam"
        ],
        [
            "Arubub"
        ],
        [
            "Bannawag"
        ],
        [
            "Bantay"
        ],
        [
            "Barangay I (Poblacion - Centro)"
        ],
        [
            "Barangay II (Poblacion - Centro)"
        ],
        [
            "Barangcuag"
        ],
        [
            "Dalibubon"
        ],
        [
            "Daligan"
        ],
        [
            "Diarao"
        ],
        [
            "Dibuluan"
        ],
        [
            "Dicamay I"
        ],
        [
            "Dicamay II"
        ],
        [
            "Dipangit"
        ],
        [
            "Disimpit"
        ],
        [
            "Divinan"
        ],
        [
            "Dumawing"
        ],
        [
            "Fugu"
        ],
        [
            "Lacab"
        ],
        [
            "Linamanan"
        ],
        [
            "Linomot"
        ],
        [
            "Malannit"
        ],
        [
            "Minuri"
        ],
        [
            "Namnama"
        ],
        [
            "Napaliong"
        ],
        [
            "Palagao"
        ],
        [
            "Papan Este"
        ],
        [
            "Papan Weste"
        ],
        [
            "Payac"
        ],
        [
            "Pungpongan"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Roque"
        ],
        [
            "San Sebastian"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Isabel"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Tupax"
        ],
        [
            "Usol"
        ],
        [
            "Villa Bello"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Jones, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31.2(1.23)"
        ],
        [
            "23(0.9)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "28.1(1.11)"
        ],
        [
            "113.5(4.47)"
        ],
        [
            "141.4(5.57)"
        ],
        [
            "176.4(6.94)"
        ],
        [
            "236.6(9.31)"
        ],
        [
            "224.9(8.85)"
        ],
        [
            "247.7(9.75)"
        ],
        [
            "222.9(8.78)"
        ],
        [
            "178(7.0)"
        ],
        [
            "1,651.4(65)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "144"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of JonesYearPop.±% p.a.1939 14,703—    1948 17,776+2.13%1960 17,334−0.21%1970 25,657+3.99%1975 26,380+0.56%1980 28,828+1.79%1990 34,373+1.78%YearPop.±% p.a.1995 34,669+0.16%2000 39,001+2.56%2007 41,237+0.77%2010 44,218+2.57%2015 45,666+0.62%2020 45,628−0.02%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Jones, Isabela, was 45,628 people, with a density of 68 inhabitants per square kilometre or 180 inhabitants per square mile."
        ],
        [
            "There was originally a population of Agta"
        ],
        [
            "Languages"
        ],
        [
            "Jones is dominantly using these languages: Iloko, Yogad, Bugkalot/Ilongot, Dicamay Agta.",
            "English, being one of the official languages is used primarily in communication for government publications, local newsprints, road signs, commercial signs and in doing official business transactions.",
            "Tagalog, another official language and is also considered the national language is used as verbal communication channel among residents."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Jones"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  20.50"
        ],
        [
            "2009  15.54"
        ],
        [
            "2012  12.57"
        ],
        [
            "2015  14.71"
        ],
        [
            "2018  13.34"
        ],
        [
            "2021  12.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Jones is primarily an agricultural municipality best suited for the intensive production of rice and corn as evidence by its topographic map which shows that 73% of the agricultural area of 16,848 hectares is under 0-3 slope category."
        ],
        [
            "Culture"
        ],
        [
            "Pinilisa Festival"
        ],
        [
            "The Pinilisa Festival is an acknowledgment of the culture of Jonesians and celebrated every March 17 to rejoice over the bountiful harvests of Pinilisa, a unique organic plum-colored rice known not only in the region but also in other countries, due to its unique fragrance and flavor compared to ordinary rice.",
            "Unlike other varieties that rely on synthetic commercial fertilizer to grow healthy, this rare rice variety can thrive on rainwater and the rich alluvial soil in the area.",
            "Its gustatory features make it a favorite staple food and primary ingredient for native rice cakes and other products."
        ],
        [
            "The success of the first Pinilisa Festival was conceptualized by the initiative of the administration of Florante A. Raspado, its first festival director-general.",
            "The festival was easily produced and marked the history of the town of Jones and one among the line-up of the Department of Tourism Wow!",
            "Philippines Program, making Pinilisa Festival is recognized not only in the Philippines but as well as on the world.",
            "The famous product “Pinilsa Rice” of Jones has given birth to the now famous Pinilisa Festival of Jones and is now identified and included in the list and calendar of the famous festival in the country maintained and documented by the Department of Tourism.",
            "Tourism Regional Director Blessida G. Diwa is among the patrons of the Pinilisa Festival, showing consistent support for the promotion of the Festival."
        ],
        [
            "Saba Festival"
        ],
        [
            "Dicamay people also celebrates the Banana “Saba” festival in the month of May.",
            "In this month people choose a day where they gather to the Barangay center for celebration, “Thanksgiving mass” is held in the morning and other activities in the evening where each purok/zone members shall have presentations for people enjoyment."
        ],
        [
            "Tourism"
        ],
        [
            "Sibsib falls is the known tourist spot in Dicamay 2 which is 4 km from the barangay proper.",
            "It is a great place for bonding.",
            "Many visitors from other towns and barangays enjoy the beauty and freshness of air and water in the falls."
        ],
        [
            "Infrastructure"
        ],
        [
            "The municipality is 370 kilometres north from Metro Manila and about 90 kilometres from Ilagan City, the province's capital, 44 kilometres from Santiago, Isabela and 31 kilometers from a junction at Barangay Ipil in the municipality of Echague."
        ],
        [
            "GV Florida Transport is one of the biggest bus transportation in Northern Philippines, particularly Cagayan Valley is currently serving the town & that serves Executive Deluxe Buses (with restroom) - (Jones, Isabela - Sampaloc, Manila via TPLEX."
        ],
        [
            "Jones is accessed by UV Express Vans from Santiago to San Agustin."
        ],
        [
            "Jones has two steel bridges, the Dalibubon bridge, now known as Jones I Bridge, which serves as the northern boundary between Jones and Echague, and the Embarcadero bridge, now known as Jones II Bridge, which leads to San Agustin, the southeastern-most town of Isabela."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipality of Jones is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Jones Municipal Council(2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative"
        ],
        [
            "Joseph S. Tan"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Nhel C. Montano"
        ],
        [
            "Municipal Vice-Mayor"
        ],
        [
            "Evelyn  R. Raspado"
        ],
        [
            "Municipal Councilors"
        ],
        [
            "Cynthia C. Bangloy"
        ],
        [
            "Arland F. Ramos"
        ],
        [
            "Virginia B. Sy"
        ],
        [
            "Julius A. Raspado"
        ],
        [
            "John M. Sabiniano"
        ],
        [
            "Irene Aggabao"
        ],
        [
            "Jervin Reyes"
        ],
        [
            "Sir Arthur Jhan Z. Anunciacion"
        ],
        [
            "Congress representation"
        ],
        [
            "Jones, belonging to the fourth legislative district of the province of Isabela, currently represented by Hon.",
            "Joseph S. Tan."
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "References"
        ],
        [
            "^ a b \"Brief History of Jones\".",
            "Municipality of Jones - jones-isabela.gov.ph.",
            "Retrieved June 25, 2024."
        ],
        [
            "^  Municipality of Jones |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"R.A. No.",
            "2099, An Act Changing the Name of Barrio Mangaratungot in the Municipality of Jones, Province of Isabela, to San Vicente\".",
            "LawPH.com.",
            "Retrieved 2011-04-13."
        ],
        [
            "^"
        ],
        [
            "\"Province: Isabela\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Jones, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 31 October 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ Lobel, Jason William (2013).",
            "PHILIPPINE AND NORTH BORNEAN LANGUAGES: ISSUES IN DESCRIPTION, SUBGROUPING, AND RECONSTRUCTION (PDF).",
            "University of Hawai'i at Manoa.",
            "pp. 96–99.",
            "Retrieved 12 January 2015."
        ],
        [
            "^ Headland, Thomas.",
            "\"Controversies: Agta human rights violations\".",
            "Retrieved 12 January 2015."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"The First Famous Pinilisa Festival – Jones, Isabela\".",
            "3 August 2013."
        ],
        [
            "^ \"Jones, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved May 15, 2022."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines Archived 2017-07-02 at the Wayback Machine"
        ],
        [
            "Jones at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Municipality of Jones"
        ],
        [
            "Places adjacent to Jones, Isabela"
        ],
        [
            "Santiago"
        ],
        [
            "Echague"
        ],
        [
            "Saguday, Quirino"
        ],
        [
            "Jones"
        ],
        [
            "Echague"
        ],
        [
            "Aglipay, Quirino"
        ],
        [
            "San Agustin"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Jones,_Isabela&oldid=1230775048\""
        ],
        [
            "Categories: Municipalities of Isabela (province)Populated places on the Rio Grande de CagayanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textArticles needing additional references from January 2014All articles needing additional referencesWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}