{
    "name": "Jose Panganiban",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Jose Panganiban, Camarines Norte"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°17′32″N 122°41′34″E﻿ / ﻿14.2922°N 122.6928°E﻿ / 14.2922; 122.6928"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Camarines Norte, Philippines"
        ],
        [
            "Municipality in Bicol Region, PhilippinesJose Panganiban"
        ],
        [
            "MambulaoMunicipalityMunicipality of Jose PanganibanView from the mountain"
        ],
        [
            "FlagSealMotto: Alay sa Diyos at sa BayanAnthem: Mahal Kong Jose Panganiban (Mambulao Hymn)Map of Camarines Norte with Jose Panganiban highlightedOpenStreetMapJose PanganibanLocation within the PhilippinesCoordinates: 14°17′32″N 122°41′34″E﻿ / ﻿14.2922°N 122.6928°E﻿ / 14.2922; 122.6928CountryPhilippinesRegionBicol RegionProvinceCamarines NorteDistrict"
        ],
        [
            "1st districtFounded1571RenamedDecember 1, 1934Named forJose Maria PanganibanBarangays27"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAriel M. Non • Vice MayorCasimero B. Padilla, Jr. • RepresentativeJosefina B. Tallado • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Artemio C. Andaya, Jr.Maria Corazon G. ArenalCatherine A. DilaoJan Michael O. GuzmanFrancesca Angela S. NapaGracia R. VillablancaAllaissa Mae C. MapaJeroy Agustin Padilla"
        ],
        [
            " • Electorate36,627 voters (2022)Area • Revenue₱ 205.2 million (2020) • Assets₱ 456 million (2020) • Expenditure₱ 130.9 million (2020) • Liabilities₱ 149.7 million (2020)Service provider • ElectricityCamarines Norte Electric Cooperative (CANORECO)Time zoneUTC+8 (PST)ZIP code4606PSGC051605000IDD : area code +63 (0)54Native languagesTagalogWebsitemambulao.gov.ph"
        ],
        [
            "Jose Panganiban, officially the Municipality of Jose Panganiban (Tagalog: Bayan ng Jose Panganiban), is a 2nd class municipality in the province of Camarines Norte, Philippines.",
            "According to the 2020 census, it has a population of 63,662 people."
        ],
        [
            "The municipality was formerly known as Mambulao, a word taken from “mambulawan,” meaning bountiful in gold.",
            "It was renamed to honor José María Panganiban on November 30, 1934 by the virtue of Act 4155"
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Jose Panganiban is politically subdivided into 27 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bagong Bayan"
        ],
        [
            "Calero"
        ],
        [
            "Dahican"
        ],
        [
            "Dayhagan"
        ],
        [
            "Larap"
        ],
        [
            "Luklukan Norte"
        ],
        [
            "Luklukan Sur"
        ],
        [
            "Motherlode"
        ],
        [
            "Nakalaya"
        ],
        [
            "Osmeña"
        ],
        [
            "Pag-Asa"
        ],
        [
            "Parang"
        ],
        [
            "Plaridel"
        ],
        [
            "North Poblacion"
        ],
        [
            "South Poblacion"
        ],
        [
            "Salvacion"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Martin"
        ],
        [
            "San Pedro"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santa Milagrosa"
        ],
        [
            "Santa Rosa Norte"
        ],
        [
            "Santa Rosa Sur"
        ],
        [
            "Tamisan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Jose Panganiban, Camarines Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "85(3.3)"
        ],
        [
            "55(2.2)"
        ],
        [
            "53(2.1)"
        ],
        [
            "47(1.9)"
        ],
        [
            "112(4.4)"
        ],
        [
            "156(6.1)"
        ],
        [
            "213(8.4)"
        ],
        [
            "159(6.3)"
        ],
        [
            "201(7.9)"
        ],
        [
            "216(8.5)"
        ],
        [
            "197(7.8)"
        ],
        [
            "141(5.6)"
        ],
        [
            "1,635(64.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "15.4"
        ],
        [
            "11.6"
        ],
        [
            "13.6"
        ],
        [
            "12.3"
        ],
        [
            "19.9"
        ],
        [
            "23.7"
        ],
        [
            "27.3"
        ],
        [
            "26.0"
        ],
        [
            "26.0"
        ],
        [
            "24.6"
        ],
        [
            "21.8"
        ],
        [
            "19.1"
        ],
        [
            "241.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Climate in the Philippines is classified into four types.",
            "Camarines Norte's climate is classified under Type II, which is characterized by the absence of a dry season, with maximum rain period occurring between December and February, and minimum monthly rainfall occurring between March and May."
        ],
        [
            "The northeast monsoon moves mainly north and northeast trending to easterly towards the end of the season.",
            "Average temperature ranges from 20 degrees Celsius to 28.3 degrees Celsius.",
            "Wind averages 15 to 20 miles per hour and is steadiest during January.",
            "The southeast monsoon is prevalent from June to September and is steadiest during the months of July and August, with wind speeds averaging from 10 to 15 miles per hour.",
            "The hottest months are from March to June, while the coolest months are from November to January."
        ],
        [
            "Occurrences of rainfall in Jose Panganiban are more frequent during the predominance of the northeast monsoon between the months of October and May with maximum occurrence in November and December."
        ],
        [
            "The highest rise in temperature occurs during the months of May and June, averaging between 28.9 degrees Celsius and 29 degrees Celsius.",
            "The coolest months are between December and February, with average ranging between 26.0 degrees Celsius and 26.4 degrees Celsius."
        ],
        [
            "Relative humidity is the amount of water vapour present in the air.",
            "The municipality's normal relative humidity is at its highest and the steadiest between the months of September and December, while it is at its lowest between the months of April and June, the hottest months per year."
        ],
        [
            "Demographics"
        ],
        [
            "The earliest available demographic data was the Census of the Philippine Islands conducted by the United States Bureau of Census in 1903.",
            "The then municipality of Mambulao, comprising nine barrios, has a total population of 1,370.",
            "The nine barrios are Poblacion (458), Del Rosario (60), San Antonio (33), San Isidro (99), San Jose (287), San Rafael (163), Santa Cruz (75), Santa Elena (81) and Santa Rosa (114)."
        ],
        [
            "Population census of Jose PanganibanYearPop.±% p.a.1903 1,370—    1918 2,035+2.67%1939 20,889+11.73%1948 8,485−9.53%1960 27,144+10.17%1970 34,164+2.32%1975 32,746−0.85%1980 30,260−1.57%1990 44,408+3.91%1995 45,396+0.41%2000 46,064+0.31%2007 49,028+0.86%2010 55,557+4.65%2015 59,639+1.36%2020 63,662+1.29%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Jose Panganiban was 63,662 people, with a density of 300 inhabitants per square kilometre or 780 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            " Mambulao Bay"
        ],
        [
            "Poverty incidence of Jose Panganiban"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  32.90"
        ],
        [
            "2009  37.32"
        ],
        [
            "2012  23.48"
        ],
        [
            "2015  34.40"
        ],
        [
            "2018  34.45"
        ],
        [
            "2021  26.38"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Mining"
        ],
        [
            "It is known that even before the colonizers came, Mambulao was already a flourishing mining town.",
            "It was the Spaniards, drawn by the rumor of immense gold deposits in the Mambulao-Paracale district, who mastered in exploring the gold mining potentials of these towns."
        ],
        [
            "From the 1750s to 1800s, Paracale held the major Spanish mines, but due to its closure in the 1790s, its people were living in desultory gold washing, fishing and selling betel nut to Mambulao which has now become the mining center.",
            "During that time, there were plenty of small shops but there's no rice fields and vegetable gardening.",
            "All necessities came from Ambos Camarines and Tayabas (Quezon).",
            "Fifteen years later, the mines of Mambulao were no longer open.",
            "There was still some haphazard gold washing by women of Indio Class whose husbands, it was alleged, gambled away their meager earning in card games run by the town mayor.",
            "But by 1818,  the population was back to the levels of the 1790s and by the mid-1820s annual gold production levels ran as 3,200 ounces (90.7 kg.)",
            "worth Php.",
            "44,000 at prevailing prices.",
            "By 1829, Camarines Norte was considered to be wealthy and populous enough to warrant separation as province of its own for the first time.",
            "But after the 1840s the mining and population declined.",
            "Dr. Fedor Jagor (in his book Travels in the Philippines and The former Philippines thru Foreign Eyes), a well known German traveler who visited Mambulao in 1859, reported that it was thinly populated and that the mining mania was already ruined.",
            "From 1837 to 1876 the population of Mambulao and Paracale decreased by 30%."
        ],
        [
            "From 1900 until the early twenties, Mambulao was a sleepy town, isolated from the other towns of Camarines Norte.",
            "During the gold bloom, it was dubbed as “Little Manila”, due to flourishing business operated by Filipinos, Chinese, Japanese, Syrians and many others.",
            "Dutch-born Filipino citizen Jan Hendrik Marsman operated two rich mines during the American occupation, a substantial dredging operation and the Philippines only smelter located in the Mambulao- Paracale district.",
            "The population quadrupled between 1918 and 1938.",
            "One of the most notable mining company to operate in this municipality is the Philippine Iron Mines, then the largest iron mine in Asia."
        ],
        [
            "Mining companies operating in Jose Panganiban include:"
        ],
        [
            "Philippine Iron Mines (defunct) 1925 to 1975, then biggest iron mine in Asia"
        ],
        [
            "San Mauricio Mining Company (defunct) 1933"
        ],
        [
            "Benguet Gold Mining Corporation (defunct)"
        ],
        [
            "Motherlode Mining Company (defunct)"
        ],
        [
            "J. G. Realty and Mining Company (defunct) 1987-1997"
        ],
        [
            "Johson Gold Mining Corporation"
        ],
        [
            "Investwell Mining (mining arm of Isabelo Fonacier Mining)"
        ],
        [
            "Ferro Management and Consultancy Group Inc. (FMCGI) 2008"
        ],
        [
            "Jose Panganiban Special Economic Zones"
        ],
        [
            "JP-SEZ (1): Jose Panganiban SEZ, located in Barangay Osmeña, is a special economic zone created through Proclamation No.",
            "1106 by former President Gloria Macapagal Arroyo on July 20, 2006."
        ],
        [
            "JP-SEZ (2): The second economic zone, located in Barangay Larap, was created under Proclamation No.",
            "508 by former President Gloria Macapagal Arroyo on December 2, 2003."
        ],
        [
            "Tourism"
        ],
        [
            "Historical landmarks"
        ],
        [
            "Jose Maria Panganiban y Enverga's Monument in front of the Municipal Hall.",
            "Known to have \"Memoria Fotografia\", JOMAPA (his pen name) contributed to La Solidaridad."
        ],
        [
            "Jose Maria Panganiban Monument - installed on February 1, 1985, by the National Historical Institute which contains the remains of the home-grown hero"
        ],
        [
            "Roy Padilla Sr. Monument - located inside Doña Ponay park, is a monument installed as a remembrance to Governor Casimero Ruiz Padilla, father of famous and political personalities in the Philippines today.",
            "Known for his excellent leadership skill, he was undefeated in all of his political campaigns.",
            "He was assassinated in Labo, Camarines Norte at the age of 61."
        ],
        [
            "Islands and beach destinations"
        ],
        [
            "Parola Island - a popular island destination in Jose Panganiban famous for its pink sand shoreline, powdery beach, and clear blue water.",
            "The island got its name from a small light tower found in the island which guides fishermen at night.",
            "Tourists are advised to contact the Municipal Tourism Office when planning to visit the island."
        ],
        [
            "Calalanay Island - This small island is a 30-minute boat ride from Larap Port.",
            "It is locally known for its white sand beach and clear blue water coming from the Philippine Sea.",
            "Tourists are advised to contact the Municipal Tourism Office when planning to visit the island."
        ],
        [
            "Isla ni Cion - Aside from its long stretch of white sand beach, Isla ni Cion boasts of its mangrove eco-park which the locals proudly take care of.",
            "A bamboo walkway will lead tourists through this dense mangrove forest.",
            "Visitors can take a boat ride from Larap port to reach this area."
        ],
        [
            "Pag-asa Beach - located in Barangay Pag-asa, this popular beach destination for locals is heavily visited during the months of March, April, and May.",
            "Small cottages and a public restroom are maintained by locals."
        ],
        [
            "Bulalacao Beach - a 30-minute travel, via motorcycle, tricycle, jeepney or your own vehicle, from the town proper, will get you to Bulalacao Beach in Barangay Luklukan Sur.",
            "The beach is named after meteor sightings by locals.",
            "Scenic views along the road will welcome tourists on their way to the beach.",
            "Bringing your own tent (tolda) or picnic table is advisable for groups visiting the area."
        ],
        [
            "Other local spots"
        ],
        [
            "Fil-Nippon Fountain of Friendship Park - located in Barangay North Poblacion, Fil-Nippon Fountain of Friendship Park (or simply known as Fountain) is a park built as a symbol of friendship between Filipinos and Japanese and as a remembrance of the town's rich history with the Japanese during the time of Philippine Iron Mines."
        ],
        [
            "Doña Ponay Park - located in Barangay South Poblacion, Doña Ponay park is built as a remembrance to Doña Apolinaria de los Reyes, popularly known as Doña Ponay, a former resident of Monte Calogcog (now known as Barangay Luklukan Norte).",
            "Her most popular story was her gift to Queen Isabella of Spain; a life-size hen with 12 chicks standing on a platter made of solid gold."
        ],
        [
            "Mambulao Boardwalk - located in Barangay North Poblacion, adjacent to Fil-Nippon Fountain of Friendship Park, Mambulao Boardwalk is a popular spot for locals to see the sun setting over Mambulao Bay."
        ],
        [
            "Turayog Resort - located in Barangay Luklukan Norte, Turayog Resort is increasingly becoming popular among tourists and locals with its viewing deck which gives a 360-degree view of the town of Jose Panganiban."
        ],
        [
            "Infrastructure"
        ],
        [
            " Inside Roy Padilla Sr. Memorial Stadium"
        ],
        [
            "Airport and Seaports"
        ],
        [
            "The Larap (Jose Panganiban) Airport (ICAO Code: RPUP), formerly operated by the Philippine Iron Mines, covers an area of approximately 35 hectares and with existing 1,400 meter stretched runway.",
            "It is located at Latitude 14°17′28″N Longitude 122°38′46″E."
        ],
        [
            "In January 2018, mobilization for the construction of Larap Regional Airport immediately began after the ceremonial groundbreaking of Larap Integrated Development Project.",
            "Penson and Company, Inc., who will build and operate the airport, expects to rehabilitate the existing 1400 meter runway by 2018 then upgrade its length to 1900–2000 meters by 2019."
        ],
        [
            "The nearest commercial airports that operate regularly are Naga Airport (126 km away) in Pili, Camarines Sur and Bicol International Airport (216 km away) in Albay."
        ],
        [
            "The International Port of Jose Panganiban (Latitude 14° 17’N Longitude 122° 42’E) is nearly 2 miles wide at the entrance between Calambayungan Island and Pinandungan Point and with sea distance to Manila of 468.10 nautical miles.The port is situated at Barangay Osmeña which is approximately five (5) kilometers away from the town proper of Jose Panganiban.",
            "The port serves as the passage of all water borne traffic to and from the Paracale mining area, Larap., Lucena, other Quezon town and the rest of Bicol and Visayas provinces.",
            "Copra, coconut oil and copra pellets used to be its principal exports."
        ],
        [
            "The Port of Larap Bay is a natural coastal harbor situated at Barangay Larap (Latitude 14° 18' 36\" N Latutude 122° 39' 0\" E), currently serving the needs of a local mining company.",
            "The harbor entrance is restricted due to swell."
        ],
        [
            "The Private Port of Jose Panganiban SEZ is located inside Magnakron Oleo Philippines, Inc.",
            "It is registered at the Philippines Ports Authority with registration type P/NC and is being operated by Magnakron Realty Philippines, Inc."
        ],
        [
            "Public Land Transportation"
        ],
        [
            "The municipal's public transportation needs are provided by Tricycles, Jeepneys (Route: Downtown to Mountainous Villages), Vans (Route: Jose Panganiban to Daet), and Buses (Routes: Jose Panganiban to Daet via Labo, Jose Panganiban to Tabaco, Albay via Naga City, and Jose Panganiban to Metro Manila).",
            "Philtranco, Superlines, and Elavil serve the Jose Panganiban/Paracale-Metro Manila route."
        ],
        [
            "Electricity and Water Supply"
        ],
        [
            "Jose Panganiban is being served by the National Power Corporation through CANORECO (Camarines Norte Electric Cooperative).",
            "A Coal Power Plant is set to be built by H and WB Asia Pacific Pte.",
            "Ltd. by 4th quarter of 2017 which is expected to generate a total of 700 Megawatts of power supply by 2025."
        ],
        [
            "Water supply and treatment is provided by Jose Panganiban Water District, a local cooperative.",
            "The water system of Jose Panganiban Water District (JPWD) includes surface water and groundwater (through wells) as water source.",
            "It also consists of treatment facilities, pumping facilities, reservoir, pipelines and service connections.",
            "It was constructed in 1953 with the concrete intake structure (Paltic Dam) along Paltic Creek, a reservoir, pipelines and service connections as its original facilities.",
            "A series of rehabilitation projects had been implemented in Jose Panganiban consisting of source development (well drilling and construction of surface water source), provision of electromechanical facilities, pipeline extension to adjacent barangays and installation of additional service connections."
        ],
        [
            "Communication"
        ],
        [
            "Mambulao Cable Television and JP Cable TV System provide digital cable services and fixed-line internet connection throughout the municipality.",
            "Smart Communications, Globe Telecom, and Sun Cellular are the mobile, fixed-line, broadband, 3G and 4G internet Service provider.",
            "International Calls are provided by the Local Government for free.",
            "Town FM 89.3 also broadcasts from the municipality."
        ],
        [
            "Medical Institutions"
        ],
        [
            "Jose Panganiban Rural Health Unit 1 - Barangay South Poblacion (East District)"
        ],
        [
            "Jose Panganiban Rural Health Unit 2 - Barangay Larap (West District)"
        ],
        [
            "Jose Panganiban Primary Hospital Services Coop.",
            "- Barangay North Poblacion"
        ],
        [
            "Barrios-Busiños Medical Clinic and Hospital - Barangay Santa Rosa Norte"
        ],
        [
            "Education"
        ],
        [
            " Jose Panganiban National High School's Administration Building (2011)"
        ],
        [
            "Post-secondary"
        ],
        [
            "Camarines Norte State College - Jose Panganiban Campus (College of Engineering and Industrial Technology) formerly Camarines Norte School of Arts and Trades"
        ],
        [
            "Roy Padilla Sr. (JP) Memorial Technical and Vocational Training Center (TESDA-accredited)"
        ],
        [
            "Public Secondary"
        ],
        [
            "Jose Panganiban National High School"
        ],
        [
            "Larap National High School"
        ],
        [
            "Santa Cruz National High School"
        ],
        [
            "Gawad Kalinga High School"
        ],
        [
            "Public Primary"
        ],
        [
            "West District:"
        ],
        [
            "Larap Elementary School"
        ],
        [
            "C.B.",
            "Enverga (Santa Cruz) Elementary School"
        ],
        [
            "Tawig (Salvacion) Elementary School"
        ],
        [
            "D. Albonia (Tamisan) Elementary School"
        ],
        [
            "Pagasa Elementary School"
        ],
        [
            "L.D.",
            "Bamba (Dayhagan) Elementary School"
        ],
        [
            "Sta Elena Elementary School"
        ],
        [
            "San Isidro Elementary School"
        ],
        [
            "San Jose Elementary School"
        ],
        [
            "San Pedro Elementary School"
        ],
        [
            "San Martin Elementary School"
        ],
        [
            "Sta Milagrosa Elementary School"
        ],
        [
            "Dahican Elementary School"
        ],
        [
            "Nakalaya Elementary School"
        ],
        [
            "V. Gabo Elementary School"
        ],
        [
            "Ulipanan Elementary School"
        ],
        [
            "East District:"
        ],
        [
            "Jose Panganiban Elementary School"
        ],
        [
            "San Mauricio (Bagong Bayan) Elementary School"
        ],
        [
            "San Rafael Elementary School"
        ],
        [
            "Santa Rosa Norte Elementary School"
        ],
        [
            "Parang Elementary School"
        ],
        [
            "Regino A.",
            "Yet (Luklukan Sur) Elementary School"
        ],
        [
            "Osmena Elementary School"
        ],
        [
            "Calero Elementary School"
        ],
        [
            "Calogcog Elementary School"
        ],
        [
            "San Rafael Elementary School"
        ],
        [
            "Segundo Aguirre (Santa Rosa Norte) Elementary School"
        ],
        [
            "Roman V. Heraldo Elementary School(Santa Rosa Sur )"
        ],
        [
            "Private Schools"
        ],
        [
            "Listed below are private schools currently included in the Department of Education's Masterlist."
        ],
        [
            "Nonsectarian Schools"
        ],
        [
            "Montessori de Mambulao Learning Centre (Pre-elementary) - Plaridel"
        ],
        [
            "Wonderkids Science Montessori School (Pre-elementary) - South Poblacion"
        ],
        [
            "Sectarian Schools"
        ],
        [
            "Ananda Marga Special Academic Institution (Pre-elementary and Elementary) - San Rafael"
        ],
        [
            "Ave Maria Children's Center (Pre-elementary) - North Poblacion"
        ],
        [
            "Good Shepherd Christian Learning (Pre-elementary)-Plaridel"
        ],
        [
            "St. Roch Children's Center (Pre-elementary) - Larap"
        ],
        [
            "Media"
        ],
        [
            "Radio stations"
        ],
        [
            "Hot FM 94.3 - Jose Panganiban (No Longer in Broadcast)"
        ],
        [
            "Town FM 89.3 - Jose Panganiban (No Longer in Broadcast)"
        ],
        [
            "Sister cities"
        ],
        [
            " Makati"
        ],
        [
            " Valenzuela City"
        ],
        [
            "Gallery"
        ],
        [
            "Market Site"
        ],
        [
            "Jose Rizal Street"
        ],
        [
            "Santa Rosa Norte"
        ],
        [
            "Fil-Nippon Fountain of Friendship Park"
        ],
        [
            "Sunset viewed from a defunct seaport"
        ],
        [
            "Notable"
        ],
        [
            "Jiggy Manicad"
        ],
        [
            "See also"
        ],
        [
            "List of renamed cities and municipalities in the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Jose Panganiban |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Municipal Profile\".",
            "Official Website of Jose Panganiban.",
            "Archived from the original on January 19, 2013.",
            "Retrieved December 31, 2012."
        ],
        [
            "^ \"Acts No.",
            "4155, (1934-12-01)\".",
            "lawyerly.ph.",
            "Retrieved July 1, 2023."
        ],
        [
            "^"
        ],
        [
            "\"Jose Panganiban, Camarines Norte: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved December 27, 2018."
        ],
        [
            "^ a b EIS Larap Integrated Development gov.ph"
        ],
        [
            "^ Census, United States Bureau of the (1905).",
            "Census of the Philippine Islands, 1903."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Camarines Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Travels in the Philippines\" (English) Reisen in den Philippinen.",
            "Chapman and Hall, London 1875"
        ],
        [
            "^ \"JGMC\".",
            "Archived from the original on May 20, 2017.",
            "Retrieved December 2, 2012."
        ],
        [
            "^ \"DENR execs want to regulate small-scale mining | Inquirer News\".",
            "August 8, 2011."
        ],
        [
            "^ \"Proclamation No.",
            "1106, s. 2006 | GOVPH\".",
            "July 20, 2006."
        ],
        [
            "^ a b \"List of Private Ports | Philippine Ports Authority Official Website\".",
            "www.ppa.com.ph."
        ],
        [
            "^ Zones December 2018"
        ],
        [
            "^ \"Philippines Contacts for Economic Zones\".",
            "www.business-in-asia.com."
        ],
        [
            "^ \"Proclamation No.",
            "508, s. 2003 | GOVPH\".",
            "Official Gazette of the Republic of the Philippines.",
            "December 2, 2003."
        ],
        [
            "^ Manufacturing"
        ],
        [
            "^ \"News\".",
            "Philippine Information Agency."
        ],
        [
            "^ \"Penson & Company, Inc - Larap Integrated Development Project (LIDP)\".",
            "www.penson.ph."
        ],
        [
            "^ \"National Registry of Historic Sites and Structures in the Philippines: Jose Ma.",
            "Panganiban y Enverga (1863–1890)\"."
        ],
        [
            "^ \"Parola Island: The Pink Beach of Camarines Norte\".",
            "January 30, 2019."
        ],
        [
            "^ \"Mambulaoans WorldWide Buzz: Photo essay – Beaches to walk on this summer, by AP Hernandez\".",
            "March 25, 2012."
        ],
        [
            "^ \"A Date with Daet (Camarines Norte)\"."
        ],
        [
            "^ \"Pag-asa Beach\"."
        ],
        [
            "^ \"Mambulaoans WorldWide Buzz: Donya Ponay relived in new book\".",
            "July 28, 2013."
        ],
        [
            "^ \"Infrastracure\".",
            "Archived from the original on December 28, 2012."
        ],
        [
            "^ http://penson.ph/larap-integrated-development-project-lidp/"
        ],
        [
            "^ \"Bicol local chief executives integrate P976.04 million RPAB-approved PRDP subprojects in master plans\".",
            "Archived from the original on January 20, 2018.",
            "Retrieved January 20, 2018."
        ],
        [
            "^ Terminal port of Jose Panganiban"
        ],
        [
            "^ Jose Panganiban"
        ],
        [
            "^ \"PORT OF LARAP BAY, Philippines Information\".",
            "March 5, 2016.",
            "Archived from the original on March 5, 2016."
        ],
        [
            "^ http://www.anchorageworld.com/content/larap-bay"
        ],
        [
            "^ \"Power Plant\".",
            "December 14, 2020."
        ],
        [
            "^ \"2 x 350 MW Coal-fired Power Plant in Jose Panganiban, Camarines Norte Province – H&WB Asia Pacific (Pte LTD) Corporation\".",
            "Archived from the original on January 4, 2018.",
            "Retrieved January 3, 2018."
        ],
        [
            "^ \"History | Jose Panganiban Water District\".",
            "Archived from the original on February 1, 2019.",
            "Retrieved February 1, 2019."
        ],
        [
            "^ \"CNSC Website\".",
            "cnsc.edu.ph.",
            "Retrieved July 1, 2023."
        ],
        [
            "^ \"List of Schools acknowledged by the Department of Education\"."
        ],
        [
            "^ \"Makati Portal\".",
            "Archived from the original on July 1, 2013.",
            "Retrieved November 27, 2012."
        ],
        [
            "^ \"Camarines Norte News – VINZONS LGU SIGNED SISTERHOOD WITH VALENZUELA CITY!\".",
            "Archived from the original on March 3, 2016.",
            "Retrieved September 18, 2014."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Jose Panganiban, Camarines Norte."
        ],
        [
            "Jose Panganiban Official Website"
        ],
        [
            "Jose Panganiban Website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Mambulaoans Worldwide Buzz"
        ],
        [
            "Places adjacent to Jose Panganiban, Camarines Norte"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Capalonga"
        ],
        [
            "Jose Panganiban"
        ],
        [
            "Paracale"
        ],
        [
            "Labo"
        ],
        [
            "vte Province of Camarines NorteDaet (capital and largest municipality)Municipalities"
        ],
        [
            "Basud"
        ],
        [
            "Capalonga"
        ],
        [
            "Daet"
        ],
        [
            "Jose Panganiban"
        ],
        [
            "Labo"
        ],
        [
            "Mercedes"
        ],
        [
            "Paracale"
        ],
        [
            "San Lorenzo Ruiz"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Elena"
        ],
        [
            "Talisay"
        ],
        [
            "Vinzons"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Jose_Panganiban,_Camarines_Norte&oldid=1227359380\""
        ],
        [
            "Categories: Municipalities of Camarines NorteMining communities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasAll articles with dead external linksArticles with dead external links from April 2017Articles with permanently dead external linksCS1 maint: numeric names: authors listArticles with dead external links from February 2020Articles with dead external links from September 2023Articles with short descriptionShort description is different from WikidataUse mdy dates from June 2022Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}