{
    "name": "Kadingilan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Kadingilan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°36′01″N 124°54′35″E﻿ / ﻿7.6003°N 124.9097°E﻿ / 7.6003; 124.9097"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Kadingilan\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesKadingilanMunicipalityMunicipality of KadingilanMunicipal hall"
        ],
        [
            "FlagSealNickname: Green Haven of the SouthMap of Bukidnon with Kadingilan highlightedOpenStreetMapKadingilanLocation within the PhilippinesCoordinates: 7°36′01″N 124°54′35″E﻿ / ﻿7.6003°N 124.9097°E﻿ / 7.6003; 124.9097CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "3rd districtFoundedAugust 16, 1971Barangays17"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJerry A. Canoy Jr. • Vice MayorHelbert A. Jovellar • RepresentativeManuel F. Zubiri • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Samuel H. RamirezJerry A. Canoy Jr.Julio D. Bag-aoMagno O. Canoy Jr.Emelita O. TadeoMarjurie E. BullecerRolando R. AlambatinJean H. Lu"
        ],
        [
            " • Electorate25,688 voters (2022)Area • Revenue₱ 186.2 million (2020) • Assets₱ 407.1 million (2020) • Expenditure₱ 145.5 million (2020) • Liabilities₱ 174.6 million (2020)Service provider • ElectricityFirst Bukidnon Electric Cooperative (FIBECO)Time zoneUTC+8 (PST)ZIP code8713PSGC101306000IDD : area code +63 (0)88Native languagesBinukid Cebuano Ata Manobo Matigsalug Ilianen TagalogWebsitewww.kadingilanbuk.gov.ph"
        ],
        [
            "Kadingilan, officially the Municipality of Kadingilan (Cebuano: Lungsod sa Kadingilan; Tagalog: Bayan ng Kadingilan), is a 3rd class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 33,735 people."
        ],
        [
            "History"
        ],
        [
            "Cultural history"
        ],
        [
            "During the earlier times, there was a certain ethnic group headed by its chieftain named Datu Mandaganasa.",
            "He was then looking for a place located between two rivers as the possible home for his tribe, Kampong.",
            "They found vast tracts of land located between the Iniawan and Pinalpalan Rivers and decided to make the place as their territorial domain.",
            "As time passed by, the place got its name, Kadingilan from the corrupted native words Kadiay (which means \"ours\") and Matingilan (which means \"temporary\")."
        ],
        [
            "The growth and development of Kadingilan began after World War II.",
            "Migrants from all over the country flocked into its fertile lands.",
            "The original occupants were slowly replaced by Cebuanos, Boholanos, Warays and Igorots/Ifugaos.",
            "The original inhabitants were eventually eased-out by the influx of incoming Dumagats (a general term used for Christians)."
        ],
        [
            "Political history"
        ],
        [
            "When Bukidnon was created as a separate province from Agusan del Norte, Kadingilan became a barrio of Maramag since 1945.",
            "It existed as such until Kibawe was created as a regular municipality on July 1, 1956.",
            "Kadingilan was then taken from Maramag and became one of the regular barrios of Kibawe."
        ],
        [
            "On August 16, 1971, Kadingilan was created as a municipality of Bukidnon pursuant to Republic Act 6368.",
            ")."
        ],
        [
            "The first set of Municipal Officials who pioneered the development of Kadingilan were:"
        ],
        [
            "Bernardino L. Mejorada  - Mayor"
        ],
        [
            "Epifanio Q. Ramirez     - Vice Mayor"
        ],
        [
            "Clemente H. Edullantes  - Councilor"
        ],
        [
            "Pedro T. Guiritan       - Councilor"
        ],
        [
            "Agapito Cornell         - Councilor"
        ],
        [
            "Rodulfo Quilaton        - Councilor"
        ],
        [
            "Melecio Grafil          - Councilor"
        ],
        [
            "Emelio Ibonia           - Councilor"
        ],
        [
            "Ireneo Corona           - Councilor"
        ],
        [
            "Ariston Ado             - Councilor"
        ],
        [
            "Geography"
        ],
        [
            "Kadingilan lies within grid coordinates from 7O 20’ 31” north longitude and from 124O 49’ to 125O 2’ east latitude.",
            "Kadingilan is located along the south-western border of the province of Bukidnon.",
            "It is bounded on the north by the municipality of Don Carlos; north-east by the municipality of Dancagan; east by the municipality of Kibawe; southeast by the municipality of Damulog and on the south and south-west by the province of North Cotabato and on the west by the province of Lanao del Sur and north-west by the municipality of Pangantucan."
        ],
        [
            "Barangays"
        ],
        [
            "Political map of Kadingilan showing its 17 barangays"
        ],
        [
            "Kadingilan is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101306001   Bagongbayan"
        ],
        [
            " 4.6%"
        ],
        [
            " 1,552"
        ],
        [
            " 1,314"
        ],
        [
            "  ▴"
        ],
        [
            " 1.68%"
        ],
        [
            " 101306002   Bagor"
        ],
        [
            " 5.6%"
        ],
        [
            " 1,877"
        ],
        [
            " 1,811"
        ],
        [
            "  ▴"
        ],
        [
            " 0.36%"
        ],
        [
            " 101306003   Balaoro"
        ],
        [
            " 6.7%"
        ],
        [
            " 2,247"
        ],
        [
            " 2,185"
        ],
        [
            "  ▴"
        ],
        [
            " 0.28%"
        ],
        [
            " 101306004   Baroy"
        ],
        [
            " 4.7%"
        ],
        [
            " 1,583"
        ],
        [
            " 1,510"
        ],
        [
            "  ▴"
        ],
        [
            " 0.47%"
        ],
        [
            " 101306005   Cabadiangan"
        ],
        [
            " 13.7%"
        ],
        [
            " 4,638"
        ],
        [
            " 4,521"
        ],
        [
            "  ▴"
        ],
        [
            " 0.26%"
        ],
        [
            " 101306006   Husayan"
        ],
        [
            " 1.8%"
        ],
        [
            " 616"
        ],
        [
            " 507"
        ],
        [
            "  ▴"
        ],
        [
            " 1.97%"
        ],
        [
            " 101306007   Kibalagon"
        ],
        [
            " 3.2%"
        ],
        [
            " 1,096"
        ],
        [
            " 1,037"
        ],
        [
            "  ▴"
        ],
        [
            " 0.55%"
        ],
        [
            " 101306008   Mabuhay"
        ],
        [
            " 2.4%"
        ],
        [
            " 817"
        ],
        [
            " 764"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 101306009   Malinao"
        ],
        [
            " 3.5%"
        ],
        [
            " 1,181"
        ],
        [
            " 1,008"
        ],
        [
            "  ▴"
        ],
        [
            " 1.60%"
        ],
        [
            " 101306010   Matampay"
        ],
        [
            " 3.6%"
        ],
        [
            " 1,210"
        ],
        [
            " 1,199"
        ],
        [
            "  ▴"
        ],
        [
            " 0.09%"
        ],
        [
            " 101306011   Sibonga"
        ],
        [
            " 3.9%"
        ],
        [
            " 1,332"
        ],
        [
            " 1,286"
        ],
        [
            "  ▴"
        ],
        [
            " 0.35%"
        ],
        [
            " 101306012   Pay‑as"
        ],
        [
            " 5.6%"
        ],
        [
            " 1,892"
        ],
        [
            " 1,863"
        ],
        [
            "  ▴"
        ],
        [
            " 0.15%"
        ],
        [
            " 101306013   Pinamanguhan"
        ],
        [
            " 6.3%"
        ],
        [
            " 2,115"
        ],
        [
            " 1,663"
        ],
        [
            "  ▴"
        ],
        [
            " 2.43%"
        ],
        [
            " 101306014  Poblacion"
        ],
        [
            " 18.9%"
        ],
        [
            " 6,367"
        ],
        [
            " 5,993"
        ],
        [
            "  ▴"
        ],
        [
            " 0.61%"
        ],
        [
            " 101306015   Salvacion"
        ],
        [
            " 4.5%"
        ],
        [
            " 1,526"
        ],
        [
            " 1,465"
        ],
        [
            "  ▴"
        ],
        [
            " 0.41%"
        ],
        [
            " 101306016   San Andres"
        ],
        [
            " 7.1%"
        ],
        [
            " 2,408"
        ],
        [
            " 2,270"
        ],
        [
            "  ▴"
        ],
        [
            " 0.59%"
        ],
        [
            " 101306017   Kibogtok"
        ],
        [
            " 3.9%"
        ],
        [
            " 1,321"
        ],
        [
            " 1,360"
        ],
        [
            "  ▾"
        ],
        [
            " −0.29%"
        ],
        [
            "Total"
        ],
        [
            "33,735"
        ],
        [
            "31,756"
        ],
        [
            " ▴"
        ],
        [
            "0.61%"
        ],
        [
            "Topography"
        ],
        [
            "The topography of the municipality is characterized as rugged terrain with rolling, hilly and mountainous portions.",
            "These hills and mountains are dissected by rivers and creeks, such as the Muleta River on the eastern part which serves as the common natural boundary with the municipalities of Damulog, Dancagan and Kibawe.",
            "The Maridugao and Kidanggin Rivers at the southern portion separates Kadingilan from the municipality of Pangantucan and the province of Lanao del Sur."
        ],
        [
            "Climate"
        ],
        [
            "The climate of the municipality belongs to type C agro-climatic zone.",
            "This zone is the most extensive and covers most of the present and potential agricultural area in the province.",
            "Relatively low rainfall is due to rain shadow effect of the mountainous belt on the eastern side of Bukidnon.",
            "Rainfall distribution is likely to vary in the southern part of the province because of the presence of adjoining hills and mountain ranges.",
            "The heaviest rainfall occurs during the months of May to September."
        ],
        [
            "Climate data for Kadingilan, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "174(6.9)"
        ],
        [
            "145(5.7)"
        ],
        [
            "159(6.3)"
        ],
        [
            "192(7.6)"
        ],
        [
            "302(11.9)"
        ],
        [
            "343(13.5)"
        ],
        [
            "297(11.7)"
        ],
        [
            "265(10.4)"
        ],
        [
            "244(9.6)"
        ],
        [
            "293(11.5)"
        ],
        [
            "306(12.0)"
        ],
        [
            "188(7.4)"
        ],
        [
            "2,908(114.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.4"
        ],
        [
            "14.4"
        ],
        [
            "17.4"
        ],
        [
            "21.3"
        ],
        [
            "27.6"
        ],
        [
            "28.0"
        ],
        [
            "27.9"
        ],
        [
            "26.9"
        ],
        [
            "25.0"
        ],
        [
            "26.9"
        ],
        [
            "26.0"
        ],
        [
            "21.1"
        ],
        [
            "279.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Elevation"
        ],
        [
            "About fifty two percent of the total land area has an elevation of 300–400 meters above sea level while forty percent is between 0–30 m. asl.",
            "Only hundred fifty hectares are within the elevation of 500 meters and above and these are mostly found within the Payao and Matampay hills."
        ],
        [
            "Slope"
        ],
        [
            "Twenty six percent of the total land area of the municipality has slope of 18-30% which is described as rolling to hilly.",
            "These are areas classified as timberland within the barangays of Cabadiangan and Mabuhay.",
            "Twenty-four percent has a slope category of 3-8%, characterized as sloping to undulating.",
            "Only about fifteen percent or a total of 2,628 hectares fall under the slope range of 0-3% (level to gently sloping covering more than thirty six percent of the total alienable and disposable lands."
        ],
        [
            "Soil"
        ],
        [
            "The soil type of Kadingilan is predominantly Kidapawan clay.",
            "It is characterized as light brown to dark brown in color, hard when dry; plastic and sticky when moist and wet and has fair organic matter content."
        ],
        [
            "Drainage/Hydrology"
        ],
        [
            "There are two type of drainage identified: internal and external.",
            "The former is mainly influenced by soil texture which is the removal of excess water within the soil profile.",
            "The latter is influenced by slope and physiographic position, refers to the removal of surface water.",
            "Usually when a soil is poorly drained externally, it is also poorly drained internally.",
            "Generally, all upland soils like the Kadingilan soils, on the account of their physiographic position are well drained internally and externally.",
            "The proposed Maridugao River Irrigation Project, is projected to irrigate 6,000 hectares of ricefields covering the barangays of Baroy, Poblacion, Sibonga, Kibogtok, Salvacion, Malinao, Husayan and portion of Pay-as."
        ],
        [
            "Mineral Resources"
        ],
        [
            "The municipality has volcanic sedimentary and metamorphic rock origin.",
            "One identified rock type is limestone (cord/line limestone, N,Ls) characterized as light cream to cream in color, partly fragmental, calcareous formation including reef limestone, bio-clastic limestone and calcasenite.",
            "The other type is sandstone and shale (N1) which is light brown and gray in color, thick transgressive marine deposits, and largely massive sandstone layers imbedded with siltstone and shale strata."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of KadingilanYearPop.±% p.a.1975 16,977—    1980 20,634+3.98%1990 23,911+1.49%1995 26,093+1.65%2000 25,858−0.19%2007 30,135+2.13%2010 31,756+1.93%2015 33,778+1.18%2020 33,735−0.03%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Kadingilan was 33,735 people, with a density of 200 inhabitants per square kilometre or 520 inhabitants per square mile."
        ],
        [
            "Population growth"
        ],
        [
            "The period from 1975 to 1980 had a population growth of 3.98%.",
            "However, the next 10 years registered a population growth on only 1.48% due to disturbances of peace and order which caused out-migration.",
            "The 1995 census showed a growth rate of 1.76 percent, slightly higher than the 1990 count.",
            "The 1995 data also showed that four barangays - Baroy, Matampay, Pinamangguan and San Andres - experienced a decrease in population.",
            "This was due to migration of people to urban areas in search of better opportunities."
        ],
        [
            "Population density"
        ],
        [
            "The population density of Kadingilan stood at 147 person per square kilometer in the 1995 census of population.",
            "This manifested a slight increase of 8.16 percent over that of the 1990 count which was pegged at 135 persons per square kilometer.",
            "Like most other parts of the province, the Poblacion is the most densely populated barangay.",
            "The 1995 count revealed the population density of the Poblacion at 598 persons per square kilometer or roughly 6 persons for every hectare of land.",
            "Barangays Malinao and Kibalagon followed with a population density of nearly 3 persons per hectare.",
            "The most sparsely populated barangay on the other hand is Matampay with only about 86 persons per square kilometer or only about 1 person per one hectare of land."
        ],
        [
            "Languages"
        ],
        [
            "The people living in the municipality of Kadingilan are of diverse ethnic origins.",
            "Despite the situation, the Cebuano language is still generally the main language spoken by nearly 83 percent of the population.",
            "Boholano - a language native to the island of Bohol is also spoken by about 8 percent of the total population.",
            "It can also be observed that Manobo - a language spoken by the lumads - is used by nearly 5 percent of Kadingilan's population as of the 1995 census."
        ],
        [
            "Labor population"
        ],
        [
            "Projected labor Force was derived using the Labor Force Profile.",
            "Using the percentage share allocation it was derived that the household population 15 years old and over will be at about 19,395 constituting 57.24 percent of the total population.",
            "About 14,954 of these is estimated to be gainfully employed providing support to the unemployed population in the labor force which is estimated at 2,525.",
            "Further, the same population is also expected to provide the same support to the depended population and those which belong to the same age group (15 years and over) but are not in the labor force."
        ],
        [
            "Local government"
        ],
        [
            "The Kadingilan town hallway"
        ],
        [
            "The local organization of the municipality is composed of 12 offices.",
            "Three of these offices were under the national government but are now devolved to the local government in adherence to the implementation of RA 7160.",
            "This law, otherwise known as the local government code of 1991 devolved to the local government the office of the Department of Health, Agriculture and the Social Welfare and Development."
        ],
        [
            "In addition to the 12 offices, the municipal government also created the Economic Enterprise Division.",
            "This is especially for the purpose of generating funds for the local coffers through local efforts.",
            "This division had 3 important sections manned by a total of 25 employees.",
            "The sections which have helped to augment generation of local financial resources are the Municipal Market and Slaughterhouse, Municipal Waterworks and Heavy Equipment Pool."
        ],
        [
            "The organizational structure being followed by the municipality of Kadingilan is in adherence to the mandates as dictated by the Local Government Code of 1991"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Kadingilan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Kadingilan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "The Kadingilan Updated News"
        ],
        [
            "The Kadingilan Map"
        ],
        [
            "The Official Website for the Municipality of Kadingilan"
        ],
        [
            "Places adjacent to Kadingilan"
        ],
        [
            "Pangantucan"
        ],
        [
            "Don Carlos"
        ],
        [
            "KitaotaoDangcagan"
        ],
        [
            "Banisilan, Cotabato"
        ],
        [
            "Kadingilan"
        ],
        [
            "KibaweDamulog"
        ],
        [
            "Carmen, Cotabato"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Kadingilan&oldid=1164193806\""
        ],
        [
            "Category: Municipalities of BukidnonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}