{
    "name": "Kalilangan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Kalilangan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°44′47″N 124°44′51″E﻿ / ﻿7.7464°N 124.7475°E﻿ / 7.7464; 124.7475"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Kalilangan\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesKalilanganMunicipalityMunicipality of Kalilangan"
        ],
        [
            "FlagSealNickname(s): Gateway to Lanao, Gateway to BangsamoroMap of Bukidnon with Kalilangan highlightedOpenStreetMapKalilanganLocation within the PhilippinesCoordinates: 7°44′47″N 124°44′51″E﻿ / ﻿7.7464°N 124.7475°E﻿ / 7.7464; 124.7475CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "4th districtFoundedJanuary 1, 1968Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAtty.",
            "Raymon Charl O. Gamboa • Vice MayorJoel L. Padsing • RepresentativeLaarni Lavin Roque • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Loido L. PadsingOliver B. GuibaoWildred P. RamasJohnny P. PadsingFredimel P. BajaoMelbourne Vaughn A. PendonCharlie James Paul M. Lacdo-oRosa C. Dator"
        ],
        [
            " • Electorate26,857 voters (2022)Area • Revenue₱ 182.1 million (2020) • Assets₱ 530.8 million (2020) • Expenditure₱ 157.8 million (2020) • Liabilities₱ 119.6 million (2020)Service provider • ElectricityFirst Bukidnon Electric Cooperative (FIBECO)Time zoneUTC+8 (PST)ZIP code8718PSGC101307000IDD : area code +63 (0)88Native languagesBinukid Cebuano Ata Manobo Iranun TagalogWebsitewww.kalilangan.gov.ph"
        ],
        [
            "Kalilangan, officially the Municipality of Kalilangan (Bukid and Higaonon: Banuwa ta Kalilangan; Iranun: Inged a Kalilangan; Cebuano: Lungsod sa Kalilangan; Tagalog: Bayan ng Kalilangan), is a 2nd class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 43,711 people."
        ],
        [
            "Etymology"
        ],
        [
            "The term kalilangan came from a Maranao native tongue which means \"extreme happiness\".",
            "It used to be a barrio of Pangantucan, Bukidnon.",
            "Due to tremendous influx of settlers coming from the different parts of the country, it becomes an independent municipality."
        ],
        [
            "History"
        ],
        [
            "In 1951 Kalilangan become one of the settlement areas under the LASEDECO (Land Settlement and Development Corporation).",
            "Christian settlers came and settled in this place.",
            "When LASEDECO was dissolved, it was replaced immediately by National Resettlement Rehabilitation Administration (NARRA) during the time of then President Ramon Magsaysay.",
            "Another batch of settlers came composed of different tribes and other ethnic groups in the country.",
            "They were Cebuanos, Waray, Boholanos, Bicolanos, Tagalogs, Ivatans, Ilonggos, Ilocanos, Capangpangan and other tribes in the island of Mindanao.",
            "Settlers were given aid by the government particularly working animals, subsistence, farm tools and others.",
            "As years rolled on land cultivation progressed and the settlers started planting different kinds of crops.",
            "Roads were opened and commerce flowed freely to the new barrio of Kalilangan.",
            "Other settlers also started engaging in business"
        ],
        [
            "As Kalilangan was considered as one of the most progressive barrios in the municipality of Pangantucan and by virtue of Republic Act No.",
            "4788 approved on June 18, 1966, a bill was sponsored by ex-Congressman Benjamin N. Tabios, creating Kalilangan into a 6th class municipality and was organized and implemented on January 1, 1968, just after the 1967 elections."
        ],
        [
            "Geography"
        ],
        [
            "The Municipality of Kalilangan is bounded on the north by the Municipality of Talakag, on the east and south by the Municipality of Pangantucan and on the west by the Province of Lanao del Sur.",
            "It has a land area of 28,414.10 hectares.",
            "The municipalities of Talakag and Pangantucan are claiming some parts of the municipality.",
            "Talakag claims 2,427.50 hectares of land in the northern portion of the municipality while Pangantucan is also contesting for 691.0 hectares of Kalilangan's land area."
        ],
        [
            "Barangays"
        ],
        [
            "Kalilangan is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101307001   Bangbang"
        ],
        [
            " 3.1%"
        ],
        [
            " 1,365"
        ],
        [
            " 1,227"
        ],
        [
            "  ▴"
        ],
        [
            " 1.07%"
        ],
        [
            " 101307002   Baborawon"
        ],
        [
            " 2.6%"
        ],
        [
            " 1,128"
        ],
        [
            " 1,033"
        ],
        [
            "  ▴"
        ],
        [
            " 0.88%"
        ],
        [
            " 101307003   Canituan"
        ],
        [
            " 2.9%"
        ],
        [
            " 1,289"
        ],
        [
            " 1,354"
        ],
        [
            "  ▾"
        ],
        [
            " −0.49%"
        ],
        [
            " 101307004   Kibaning"
        ],
        [
            " 2.2%"
        ],
        [
            " 941"
        ],
        [
            " 849"
        ],
        [
            "  ▴"
        ],
        [
            " 1.03%"
        ],
        [
            " 101307005   Kinura"
        ],
        [
            " 5.5%"
        ],
        [
            " 2,398"
        ],
        [
            " 2,060"
        ],
        [
            "  ▴"
        ],
        [
            " 1.53%"
        ],
        [
            " 101307006   Lampanusan"
        ],
        [
            " 7.3%"
        ],
        [
            " 3,181"
        ],
        [
            " 3,120"
        ],
        [
            "  ▴"
        ],
        [
            " 0.19%"
        ],
        [
            " 101307007   Maca‑opao"
        ],
        [
            " 6.9%"
        ],
        [
            " 2,996"
        ],
        [
            " 2,897"
        ],
        [
            "  ▴"
        ],
        [
            " 0.34%"
        ],
        [
            " 101307008   Malinao"
        ],
        [
            " 13.1%"
        ],
        [
            " 5,728"
        ],
        [
            " 6,038"
        ],
        [
            "  ▾"
        ],
        [
            " −0.53%"
        ],
        [
            " 101307009   Pamotolon (Pamotdon)"
        ],
        [
            " 3.6%"
        ],
        [
            " 1,579"
        ],
        [
            " 1,256"
        ],
        [
            "  ▴"
        ],
        [
            " 2.31%"
        ],
        [
            " 101307010  Poblacion"
        ],
        [
            " 16.7%"
        ],
        [
            " 7,284"
        ],
        [
            " 6,874"
        ],
        [
            "  ▴"
        ],
        [
            " 0.58%"
        ],
        [
            " 101307012   Public"
        ],
        [
            " 5.3%"
        ],
        [
            " 2,338"
        ],
        [
            " 2,058"
        ],
        [
            "  ▴"
        ],
        [
            " 1.28%"
        ],
        [
            " 101307013   Ninoy Aquino"
        ],
        [
            " 8.9%"
        ],
        [
            " 3,908"
        ],
        [
            " 3,279"
        ],
        [
            "  ▴"
        ],
        [
            " 1.77%"
        ],
        [
            " 101307014   San Vicente Ferrer"
        ],
        [
            " 6.9%"
        ],
        [
            " 3,007"
        ],
        [
            " 3,535"
        ],
        [
            "  ▾"
        ],
        [
            " −1.60%"
        ],
        [
            " 101307015   West Poblacion"
        ],
        [
            " 10.2%"
        ],
        [
            " 4,459"
        ],
        [
            " 4,267"
        ],
        [
            "  ▴"
        ],
        [
            " 0.44%"
        ],
        [
            "Total"
        ],
        [
            "43,711"
        ],
        [
            "39,847"
        ],
        [
            " ▴"
        ],
        [
            "0.93%"
        ],
        [
            "Topography"
        ],
        [
            "Kalilangan is characterized by rugged terrain with a limited plain or level area situated on the Poblacion and portion of the municipality.",
            "From its total land area, a dominant 76.57 percent are within 8-15 percent slope characterized by moderately undulating and gently rolling land.",
            "The barangays of San Vicente Ferrer and Ninoy Aquino are dominantly within this slope type."
        ],
        [
            "Areas with 18 percent slope and above cover 15.61 percent.",
            "These are very steepy sloping and rolling land in many directions.",
            "The barangays of Macaopao, Lampanusan, portions of Kibaning, Public and Pamotolon are dominantly within the slope type."
        ],
        [
            "The remaining 7.82 percent of the municipality level to nearly level land and gently sloping areas in one general direction within 0-3 percent, 3-5 percent and 5-15 percent slopes.",
            "These are common in the Poblacion portion of the municipality."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Kalilangan, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(78)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "19(67)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "174(6.9)"
        ],
        [
            "145(5.7)"
        ],
        [
            "159(6.3)"
        ],
        [
            "192(7.6)"
        ],
        [
            "302(11.9)"
        ],
        [
            "343(13.5)"
        ],
        [
            "297(11.7)"
        ],
        [
            "265(10.4)"
        ],
        [
            "244(9.6)"
        ],
        [
            "293(11.5)"
        ],
        [
            "306(12.0)"
        ],
        [
            "188(7.4)"
        ],
        [
            "2,908(114.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.4"
        ],
        [
            "14.4"
        ],
        [
            "17.4"
        ],
        [
            "21.3"
        ],
        [
            "27.6"
        ],
        [
            "28.0"
        ],
        [
            "27.9"
        ],
        [
            "26.9"
        ],
        [
            "25.0"
        ],
        [
            "26.9"
        ],
        [
            "26.0"
        ],
        [
            "21.1"
        ],
        [
            "279.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of KalilanganYearPop.±% p.a.1970 12,325—    1975 16,893+6.53%1980 18,316+1.63%1990 23,923+2.71%1995 26,973+2.27%2000 30,592+2.74%2007 36,557+2.49%2010 39,847+3.19%2015 41,601+0.82%2020 43,711+0.98%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Kalilangan was 43,711 people, with a density of 170 inhabitants per square kilometre or 440 inhabitants per square mile."
        ],
        [
            "Historical growth"
        ],
        [
            "It was on 1970 that the Municipality of Kalilangan first attempted to conduct a census in its area of jurisdiction.",
            "On that year a total of 12,326 inhabitants have been registered by the Philippine Statistics Authority (NSO).",
            "Five years later NSO conducted another Census of Population registering 15,389 inhabitants revealing that for 5 years time 1970-1975 the municipality has reached a population increase of 24.85%.",
            "On the next 5 years from 1975 to 1980 NSO recorded 19.01% of inhabitants as has been added to the population of the municipality, revealing therefore that a population growth rate drop of 5.84% compared to that of 1970-1975 had happened."
        ],
        [
            "After 10 years the next population census had been conducted by NSO registering a population of 23,923 inhabitants on 1990.",
            "In comparison with the municipality's census two decades ago,   from 1970 to 1980 and from 1980 to 1990 a population increase of 48.58% and 30.62% respectively was observed.",
            "In terms of population growth rate (1970-1980 has 4.04% and 1980-1990 2.70%)"
        ],
        [
            "Important population data also came up for population trend analysis was the 1990-1995 population census revealing a population increase of 12.75% with a population growth rate of 2.43%"
        ],
        [
            "Another population increase was recorded when official result of May 1, 2000 census of population was published.",
            "It recorded a total of 30, 592 persons for the municipality with 5,873 households, an average household size of 5 persons and recorded an average of 2.74 birth rate and death rate of 0.24."
        ],
        [
            "The 2007 Census shows an increase in the population to 36,557."
        ],
        [
            "Language"
        ],
        [
            "Presently Kalilangan was inhabited by about 47 different tribes with different languages on which 36% were Binukid, 24% Cebuano, 20% Maranao, 6% Hiligaynon/Ilonggo, 6% Ivatan/Itbayat and 5% Boholano.",
            "Binukid the dominant language in the municipality."
        ],
        [
            "Religion"
        ],
        [
            "In terms of denomination, Kalilangan has about 21 known numbers of religious affiliation on which prevailing dominant group is the Roman Catholic of about 46.9%, followed by Islam which is equivalent to 37.22%.",
            "Other group of Baptist of 2.88%, Assembly of God 2.23%, Iglesia ni Cristo of 2.02%, and the remaining 9.25% belongs to the remaining sixteen (16) other denominations."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Kalilangan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  33.80"
        ],
        [
            "2009  51.29"
        ],
        [
            "2012  53.03"
        ],
        [
            "2015  52.14"
        ],
        [
            "2018  31.87"
        ],
        [
            "2021  30.01"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Kalilangan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Kalilangan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Kalilangan"
        ],
        [
            "Talakag"
        ],
        [
            "Maguing, Lanao del SurBumbaran, Lanao del Sur"
        ],
        [
            "Kadingilan"
        ],
        [
            "Pangantucan"
        ],
        [
            "Wao, Lanao del Sur"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Kalilangan&oldid=1214133605\""
        ],
        [
            "Category: Municipalities of BukidnonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesPages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}