{
    "name": "Kauswagan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Kauswagan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°11′30″N 124°05′05″E﻿ / ﻿8.19167°N 124.08472°E﻿ / 8.19167; 124.08472"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Lanao del Norte, Philippines"
        ],
        [
            "This article is about municipality located in Lanao Del Norte.",
            "For the barangay in Sibagat, see Kauswagan, Sibagat."
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesKauswaganMunicipalityMunicipality of Kauswagan"
        ],
        [
            "FlagSealAnthem: \"Salomang Kauswaganon\" Map of Lanao del Norte with Kauswagan highlightedOpenStreetMapKauswaganLocation within the PhilippinesCoordinates: 8°11′30″N 124°05′05″E﻿ / ﻿8.19167°N 124.08472°E﻿ / 8.19167; 124.08472CountryPhilippinesRegionNorthern MindanaoProvinceLanao del NorteDistrict"
        ],
        [
            "1st districtFoundedAugust 1, 1948Barangays13"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRommel C. Arnado • Vice MayorDr.",
            "Maximo C. Arnado • RepresentativeMohamad Khalid Q. Dimaporo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Aga S. DimakutaSultan Camlon T. MonerMalic O. MacabatoAbdul Wahid MananggoloLeah O. BandejonAlde O. TanNazar V.  RobleDesiderio N. Ayuno"
        ],
        [
            " • Electorate15,908 voters (2022)Area • Revenue₱ 187.6 million (2020) • Assets₱ 452.7 million (2020) • Expenditure₱ 150.3 million (2020) • Liabilities₱ 188.6 million (2020)Service provider • ElectricityLanao del Norte Electric Cooperative (LANECO)Time zoneUTC+8 (PST)ZIP code9202PSGC103507000IDD : area code +63 (0)63Native languagesMaranao Cebuano Binukid TagalogWebsitekauswagan.net"
        ],
        [
            "Kauswagan, officially the Municipality of Kauswagan (Maranao: Inged a Kauswagan, Cebuano: Lungsod sa Kauswagan, Tagalog: Bayan ng Kauswagan), is a 5th class municipality in the province of Lanao del Norte, Philippines.",
            "According to the 2020 census, it has a population of 24,193 people."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(January 2023) (Learn how and when to remove this message)"
        ],
        [
            "Kauswagan was organized into a municipality through President Manuel Roxas's  Executive Order No.",
            "126, s. 1948 which separated the barrio of Kauswagan and the sitios of Linamon, Magoong, Purakan, Rebukon, Samburun, Lapayan, Takub and Kawit from the then municipality of Iligan."
        ],
        [
            "Kauswagan was one of the municipalities that suffered in Lanao del Norte during the martial law and Ilaga war against the Moro."
        ],
        [
            "In March 2000, then-President Joseph Estrada declared all-out-war against MILF when it was led by Abdullah Macapaar \"Commander Bravo\"  bin Sabbar fought the Philippine Army."
        ],
        [
            "Settlement"
        ],
        [
            "Initially and before Spain Invasion and later American invasion, most people living in Kauswagan are Maranao Tribe.",
            "A folk story from the elders said that during Spain's occupation, some of the leaders from the interior areas of Lanao del Norte usually crossed the beaches of now the Municipality of Kolambogan to the beaches of now Ozamis City.",
            "By boat, they captured some of the people living on the other side of the sea and enslaved most of these captured people; these people were called Bisaya in Maranaw."
        ],
        [
            "There was also a story about the Mutia family in Zamboanga del Norte and Misamis Occidental, which initially came from the interior area of Lanao and is even now still retold by elders.",
            "Since the ancestors of the Mutia family in Zamboanga del Norte and Misamis Occidental lifted a small book hanging in the center of the house and said to the children the forbidden and do not even touch of even open the book.",
            "According to the claim, after many years, when somebody opened the book, they saw writing but an unfamiliar Language.",
            "Some say they look like Arabic letters, which could be the Jawi script."
        ],
        [
            "In extended living and social process and sometimes in 1935 – 1944, under the National Land Settlement Administration (NLSA), During the Commonwealth Government, there was a House Representatives proposal to take land from the Island of Mindanao to use for settlement to help the Commonwealth Government, but in opposition of Congressman Datu Salipada Khalid Pendatun; The proposal was approved and signed by President Manuel L. Quezon.",
            "The settlers were composed of people who knew about Agriculture, Engineering, and Farming."
        ],
        [
            "The settlers are composed of different people from the Islands of the Visayas and Island Luzon that have knowledge and experience of agriculture, technical, farming, lumber, carpenter, and other skills necessary for settlement.",
            "The first settlers settled in Areas:"
        ],
        [
            "Some parts of Zamboanga"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Lanao Del Norte"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Some part of Surigao"
        ],
        [
            "Some part of Davao"
        ],
        [
            "Some Part of Cotabato"
        ],
        [
            "In Lanao del Norte, the transport of settlers was peacefully successful due to the smooth negotiations with the Maranao Tribal Leaders and Land Lords.",
            "As a Welcome sign, the Landlords had donated a piece of their land (The piece of land being more than 5 hectares) to start the settlers' life as the beginning of living in the area.",
            "In the long run and process, the family of settler works to the landowners, and as a gift, since they are excellent workers, the landlord gave the small piece of their land.",
            "Some say that settlers traded and made the business to the landlord just a few item exchange of lands.",
            "Some landlords marry their workers' daughters, which results in the majority living in Lanao del Norte and Misamis Occidental having the blood of Maranao Tribe (Muslim Blood)."
        ],
        [
            "On the other hand, the settlement has been a problem, and conflict between non-Muslims and Muslims continues even until the implementation of martial law."
        ],
        [
            "MILF Occupation of Kauswagan"
        ],
        [
            "During martial law and Ilaga group against Moro \"Maranao Tribe\" in Lanao del Norte.",
            "The Ilaga Group had ambushed the Passenger Jeep (Francisco Motors), where the most prominent older families in Barangay Delabayan, including the mother (Bae Iba) of Commander Tagoranao, were massacred."
        ],
        [
            "In the aftermath of being ambushed, the \"Bae Iba\" was still breathing and could still talk, and she said to some of the Ilaga group when they approached the Jeep, she would report to them what they did to his Son Commander Tagoranao.",
            "However, instead, the group leaves the four trigger men return to her and fire (1 magazine) in one direction to her, which results in the body of \"Bae Iba\" lying in blood."
        ],
        [
            "There was a negotiation between the Mayor of Kauswagan and Commander Tagoranao not to put himself to Justice but instead to submit and surrender the four trigger men to MILF Lanao Del Norte.",
            "Shariah Law has confirmed death for the four suspects and commanded by Commander Tagoranao was executed.",
            "However, one of them did not execute instead of cutting the two legs and freed because he used his two legs to step forward to Jeep and as a message to the Ilaga group."
        ],
        [
            "After the dropped of Sharia Law for the four trigger men, Commander Tagoranao had received the order from Late Aleem Aziz Mimbantas (MILF Lanao del Norte and Lanao del Sur Central Commander) to lead the (200) MILF selected soldiers."
        ],
        [
            "And then, he was ordered to invade and massacre all the Ilaga group members living in Kauswagan, Lanao del Norte.",
            "During the Invasion, most civilians died in the sea because they did not know how to swim, and some died because of the sunk boat overloaded."
        ],
        [
            "During the MILF invasion, the MILF controlled the key locations of Kauswagan and held the Municipal Hall in four hours in order to demand the Mayor for Justice of all Moro victims who had been killed.",
            "Places Held:"
        ],
        [
            "Bagumbayan (Poblacion)"
        ],
        [
            "Kawit Occidental"
        ],
        [
            "Kawit Oriental"
        ],
        [
            "Libertad"
        ],
        [
            "Poblacion"
        ],
        [
            "Tacub"
        ],
        [
            "Tugar"
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Kauswagan is politically subdivided into 13 barangays and 1 sitio.",
            "Each barangay and sitio consists of puroks."
        ],
        [
            "Poblacion (including Guiwanon)"
        ],
        [
            "Bagumbayan (including sitio Dalicanan)"
        ],
        [
            "Tacub"
        ],
        [
            "(from the word \"Taklub\" pronounced by Maranaos as \"Takob\" meaning cover/cap from which is based on \"Takob sa Kawa\"; A Cauldron's Cover)"
        ],
        [
            "Kawit Occidental (West Kawit)"
        ],
        [
            "Kawit Oriental (East Kawit)"
        ],
        [
            "(from the word \"Kawit\" which means a bamboo tuba container with a hook on top, ultimately from \"Kaw-it\"; Hook)"
        ],
        [
            "**Upper Tugar"
        ],
        [
            "**Lower Tugar (endonym; Bandol)"
        ],
        [
            "Baraason"
        ],
        [
            "Cayontor"
        ],
        [
            "Delabayan"
        ],
        [
            "Inudaran"
        ],
        [
            "Libertad (endonym; Lapayan)"
        ],
        [
            "Paiton"
        ],
        [
            "Tingin-Tingin"
        ],
        [
            "*Six of the 13 Barangays of Kauswagan are populated by the Maranao Ethnicity in Baraason, Cayontor, Delabayan, Inudaran, Paiton and Tingin-Tingin."
        ],
        [
            "** Tugar is considered as one Barangay"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Kauswagan, Lanao del Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "159(6.3)"
        ],
        [
            "143(5.6)"
        ],
        [
            "166(6.5)"
        ],
        [
            "183(7.2)"
        ],
        [
            "357(14.1)"
        ],
        [
            "414(16.3)"
        ],
        [
            "333(13.1)"
        ],
        [
            "309(12.2)"
        ],
        [
            "289(11.4)"
        ],
        [
            "285(11.2)"
        ],
        [
            "253(10.0)"
        ],
        [
            "166(6.5)"
        ],
        [
            "3,057(120.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.4"
        ],
        [
            "17.2"
        ],
        [
            "20.6"
        ],
        [
            "23.4"
        ],
        [
            "29.3"
        ],
        [
            "29.2"
        ],
        [
            "29.9"
        ],
        [
            "29.4"
        ],
        [
            "27.7"
        ],
        [
            "28.7"
        ],
        [
            "25.5"
        ],
        [
            "19.9"
        ],
        [
            "299.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of KauswaganYearPop.±% p.a.1948 11,095—    1960 12,636+1.09%1970 12,316−0.26%1975 9,556−4.96%1980 13,875+7.74%1990 16,961+2.03%1995 18,349+1.48%2000 15,364−3.73%2007 23,087+5.78%2010 24,006+1.43%2015 26,278+1.74%2020 24,193−1.61%Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "The lingua franca/common language of this town is Bisaya, specifically the Cebuano language, while Tagalog is used in rare occasions.",
            "Cebuano and Maranao commonly used in households."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Kauswagan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  46.40"
        ],
        [
            "2009  49.50"
        ],
        [
            "2012  41.14"
        ],
        [
            "2015  37.46"
        ],
        [
            "2018  23.23"
        ],
        [
            "2021  26.45"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Kauswagan is known as the coconut industry center of the interior Lanao del Norte.",
            "It also produce fishing, rice, corn and other vegetables."
        ],
        [
            "In 2019, the Kauswagan Power Plant, a 552-megawatt coal-fired power plant, opened.",
            "It was built in 5 years.",
            "The power plant is owned by GNPower Kauswagan, a joint venture between Ayala Corporation and Power Partners Ltd.",
            "The plant provides power to Lanao del Norte."
        ],
        [
            "Transportation"
        ],
        [
            "Transport Terminals"
        ],
        [
            "Kauswagan Integrated Public Terminal (Both Bus and Jeepney)"
        ],
        [
            "Seaport"
        ],
        [
            "The former port of Kauswagan is located along the northern central coastal area facing Iligan Bay, is now turned into a tourist spot."
        ],
        [
            "Public transportation"
        ],
        [
            "The public modes of transportation within the town are motorcycles, tricycles, and recently introduced modern tricycles or colloquially called in town as \"baja\" and \"racal\"."
        ],
        [
            "Government"
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Kauswagan Municipal council (2019-2022):"
        ],
        [
            "Municipal Mayor: Rommel C. Arnado"
        ],
        [
            "Vice Mayor: Evangeline H. Jubas"
        ],
        [
            "SB Member: Matildo B Jubas, Jr"
        ],
        [
            "SB Member: Alice Pala"
        ],
        [
            "SB Member: Desiderio Ayuno"
        ],
        [
            "SB Member: Rodulfo Dura"
        ],
        [
            "SB Member: Aga Dimakuta"
        ],
        [
            "SB Member: Mastura Manangolo"
        ],
        [
            "SB Member: Alde Tan"
        ],
        [
            "SB Member: Glorioso Flores"
        ],
        [
            "ABC President: Cosain \"Coco\" Mananggolo"
        ],
        [
            "SK Federated President: Marjune C. Carballo"
        ],
        [
            "SB Secretary: Mr. Fortunato Densing"
        ],
        [
            "List of mayors"
        ],
        [
            "Mr. Jose Q. Balazo: April 25, 1948, to March 1950 (appointed first mayor of Kauswagan)"
        ],
        [
            "Mr. Santiago Ramirez: March 1950 to April 20, 1950"
        ],
        [
            "Capt.",
            "Joseph T. Sanguila Sr.: May 1950 to August 1951"
        ],
        [
            "Mr. Vicctoriano Rafols: September 1951 to December 31, 1951"
        ],
        [
            "Capt.",
            "Joseph T. Sanguila Sr.: January 1952 to 1955"
        ],
        [
            "Mr. Teodulfo D. Maslog Sr.: January 1956 to 1959"
        ],
        [
            "Capt.",
            "Joseph T. Sanguila Sr.: January 1960 to 1963"
        ],
        [
            "Dr. Maximo P. Arnado Sr.: February 15, 1979, to April 15, 1986"
        ],
        [
            "Maj. Valentine E. Tarroza Sr.: May 1974 to February 12, 1979"
        ],
        [
            "Dr. Maximo P. Arnado Sr.: February 15, 1979 to April 15, 1986"
        ],
        [
            "Atty.",
            "Myron B. Rico: April 15, 1986, to December 1, 1987"
        ],
        [
            "Mr. Joseph M. Sanguila Jr.: December 2, 1987, to Jan 3, 1988"
        ],
        [
            "Mr. Pantaleon T. Hontiveros Sr. | January 4, 1988, to February 10, 1988"
        ],
        [
            "Atty.",
            "Myron B. Rico: February 11, 1988, to June 1998"
        ],
        [
            "Hon.",
            "Mohammad Moamar Jack S. Maruhom: July 1, 1998, to May 11, 2007"
        ],
        [
            "Hon.",
            "Yasser Hadji Hasan Samporna: June 30, 2007, to June 30, 2010"
        ],
        [
            "Hon.",
            "Rommel C. Arnado: (incumbent, since July 1, 2010)"
        ],
        [
            "*From government website"
        ],
        [
            "*Subject to change by June 30, 2022, after taking the oath of office."
        ],
        [
            "Education"
        ],
        [
            "Elementary schools"
        ],
        [
            "Kauswagan Central Elementary School (public)"
        ],
        [
            "Tacub Elementary School (public)"
        ],
        [
            "Jose Balazo Memorial Elementary School (public)"
        ],
        [
            "Libertad Elementary School (public)"
        ],
        [
            "Kawit Occidental Elementary School (public)"
        ],
        [
            "Tingin-Tingin Elementary School (public)"
        ],
        [
            "Paiton Primary School (public)"
        ],
        [
            "Baraason Integrated School (public)"
        ],
        [
            "Cayontor Primary School (public)"
        ],
        [
            "Upper Tugar Elementary School (public)"
        ],
        [
            "Smartkidz Learning Playhouse Inc. (private, non-sect)"
        ],
        [
            "High schools"
        ],
        [
            "St. Vincent's Academy (private, sect.)"
        ],
        [
            "Marcela T. Mabanta National High School (public)"
        ],
        [
            "Integrated schools (high school + elementary school)"
        ],
        [
            "Sultan Dimasangcay Mananggolo Integrated School (Delabayan Elementary School) (public)"
        ],
        [
            "Kawit Oriental Integrated School of Fisheries (public)"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Kauswagan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Executive Order No.",
            "126, s. 1948\".",
            "Official Gazette of the Republic of the Philippines.",
            "March 29, 1948.",
            "Archived from the original on January 31, 2023.",
            "Retrieved January 31, 2023."
        ],
        [
            "^"
        ],
        [
            "\"Kauswagan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved January 30, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Lanao del Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Power plant profile: Kauswagan Power Plant, Philippines\".",
            "Power Technology.",
            "April 24, 2023.",
            "Retrieved May 5, 2024."
        ],
        [
            "External links"
        ],
        [
            "Kauswagan Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived May 27, 2012, at the Wayback Machine"
        ],
        [
            "Places adjacent to Kauswagan"
        ],
        [
            "Iligan Bay"
        ],
        [
            "Bacolod"
        ],
        [
            "Kauswagan"
        ],
        [
            "Linamon"
        ],
        [
            "Poona Piagapo"
        ],
        [
            "Matungao"
        ],
        [
            "vte Province of Lanao del NorteTubod (capital)  Iligan (largest city)Municipalities"
        ],
        [
            "Bacolod"
        ],
        [
            "Baloi"
        ],
        [
            "Baroy"
        ],
        [
            "Kapatagan"
        ],
        [
            "Kauswagan"
        ],
        [
            "Kolambugan"
        ],
        [
            "Lala"
        ],
        [
            "Linamon"
        ],
        [
            "Magsaysay"
        ],
        [
            "Maigo"
        ],
        [
            "Matungao"
        ],
        [
            "Munai"
        ],
        [
            "Nunungan"
        ],
        [
            "Pantao Ragat"
        ],
        [
            "Pantar"
        ],
        [
            "Poona Piagapo"
        ],
        [
            "Salvador"
        ],
        [
            "Sapad"
        ],
        [
            "Sultan Naga Dimaporo"
        ],
        [
            "Tagoloan"
        ],
        [
            "Tangcal"
        ],
        [
            "Tubod"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iligan (Administratively independent from the province but grouped under Lanao del Norte by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Kauswagan&oldid=1230856710\""
        ],
        [
            "Categories: Municipalities of Lanao del NortePolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse mdy dates from June 2022Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textArticles needing additional references from January 2023All articles needing additional referencesWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}