{
    "name": "Kawit",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Kawit"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoעבריתKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°26′N 120°54′E﻿ / ﻿14.43°N 120.9°E﻿ / 14.43; 120.9"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cavite, Philippines"
        ],
        [
            "For the ancient Egyptian queen consort, see Kawit (queen)."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Kawit\" – news · newspapers · books · scholar · JSTOR (October 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesKawit"
        ],
        [
            "Cavite el ViejoMunicipalityMunicipality of KawitAguinaldo Shrine"
        ],
        [
            "FlagSealNickname(s): Site of the Declaration of Independence, Flag Town of the RepublicMotto(s): Alab ng Puso(Flaming Heart)Map of Cavite with Kawit highlightedOpenStreetMapKawitLocation within the PhilippinesCoordinates: 14°26′N 120°54′E﻿ / ﻿14.43°N 120.9°E﻿ / 14.43; 120.9CountryPhilippinesRegionCalabarzonProvinceCaviteDistrict"
        ],
        [
            "1st districtFounded1587 or August 1, 1600RenamedSeptember 20, 1907 (as Kawit)Barangays23"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAngelo Emilio G. Aguinaldo • Vice MayorEdward R. Samala Jr. • RepresentativeRamon Revilla III • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Eman R. TuazonAlvin S. BunagDivinia R. PulidoJuan Ysmael R. GandiaGerardo B. JarinBienvenido D. Cajigas IIICynthia G. AguinaldoMedel E. Caimol"
        ],
        [
            " • Electorate62,698 voters (2022)Area • Revenue₱ 364.5 million (2020) • Assets₱ 582.3 million (2020) • Expenditure₱ 383.4 million (2020) • Liabilities₱ 178.9 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code4104PSGC042111000IDD : area code +63 (0)46Native languagesTagalog"
        ],
        [
            "Kawit, officially the Municipality of Kawit (Tagalog: Bayan ng Kawit),  is a 1st class urban municipality in the province of Cavite, Philippines.",
            "According to the 2020 census, it has a population of 107,535.",
            "It is one of the notable places that had a major role in the country's history during the 1800s and 1900s."
        ],
        [
            "Formerly known as  Cavite el Viejo, it is the location of his home, and the name Kawit is from the word kalawit, the Aguinaldo Shrine, where independence from Spain was declared on June 12, 1898.",
            "It is also the birthplace of Emilio Aguinaldo, the first president of the Philippines, who from 1895 to 1897, served as the municipality's chief executive."
        ],
        [
            "Kawit is 13 kilometres (8.1 mi) from Imus and  23 kilometres (14 mi) from Manila."
        ],
        [
            "Etymology"
        ],
        [
            "The name Kawit is derived from the Tagalog word kawit  kalawit  (hook), which is suggestive of its location at the base of a hook-shaped shoreline along Manila Bay extending to the tip of Cavite City."
        ],
        [
            "Legend, however, gives another version on how the town got its name.",
            "One day, a Spanish visitor asked a native blacksmith about the name of the village.",
            "The latter was busy at the time pounding on the anvil a piece of hot metal that looked like a hook.",
            "He hesitated to speak, not understanding what the stranger was asking, but when pressed for an answer, and thinking that he wanted to know what he was doing, he merely said kawit.",
            "The Spanish left muttering the word kawit.",
            "In the course of the time, the word evolved into cauite, and finally cavite."
        ],
        [
            "History"
        ],
        [
            "Old Kawit Town Hall"
        ],
        [
            "Kawit was the most thriving settlement prior to the coming of the Spanish.",
            "In fact, the town provided the first anchorage of the Spanish in the province, whence colonization and proselytization of the Christian religion began, spreading to all corners of the province.",
            "It was established as a town in 1587 or, as recognized by laws, August 1, 1600."
        ],
        [
            "For a long time, the place was called by the Spanish \"Cavite el Viejo\" or Old Cavite to distinguish it from \"Cavite la Punta\" or \"Cavite el Puerto\", the commercial port and naval base (now Cavite City) whence came many Spanish marines on shore leave who made frequent visits to Cavite el Viejo, eventually turning it into a red-light district.",
            "This seedy reputation of the town was erased when Saint Mary Magdalene was made patroness, under the spiritual supervision of the Jesuits as ordered by Miguel García Serrano, O.S.A.",
            "(1618–1629), the fifth Archbishop of Manila."
        ],
        [
            "With the establishment in the wake of the Philippine Revolution, the Philippine Independent Church built a shrine to Saint Michael, the Archangel in the barrio of Binakayan in 1902."
        ],
        [
            "Cavite el Viejo was then a big town, comprising the municipality of Kawit today, Cavite la Punta (now Cavite City), Noveleta (called Tierra Alta by the Spanish), and Imus.",
            "Eventually, these three barrios' populations grew and they eventually seceded to become independent municipalities."
        ],
        [
            "Aside from its role as the birthplace of independence, Kawit was also the site of the Battle of Binakayan-Dalahican, one of several Filipino victories during the Revolution."
        ],
        [
            "In 1907, the town was renamed to Kawit, its present name, by virtue of Act No.",
            "1718 by the Philippine Commission."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Kawit is politically subdivided into 23 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Balsahan-Bisita"
        ],
        [
            "Batong Dalig"
        ],
        [
            "Binakayan-Aplaya"
        ],
        [
            "Binakayan-Kanluran"
        ],
        [
            "Congbalay-Legaspi"
        ],
        [
            "Gahak"
        ],
        [
            "Kaingen"
        ],
        [
            "Magdalo (Putol)"
        ],
        [
            "Manggahan-Lawin"
        ],
        [
            "Marulas"
        ],
        [
            "Panamitan"
        ],
        [
            "Poblacion"
        ],
        [
            "Pulvorista/Polvorista"
        ],
        [
            "Samala-Marquez"
        ],
        [
            "San Sebastian"
        ],
        [
            "Santa Isabel"
        ],
        [
            "Tabon I"
        ],
        [
            "Tabon II"
        ],
        [
            "Tabon III"
        ],
        [
            "Toclong (Different from Toclong in neighboring Imus)"
        ],
        [
            "Tramo-Bantayan"
        ],
        [
            "Wakas I"
        ],
        [
            "Wakas II"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Kawit, Cavite"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "10(0.4)"
        ],
        [
            "10(0.4)"
        ],
        [
            "12(0.5)"
        ],
        [
            "27(1.1)"
        ],
        [
            "94(3.7)"
        ],
        [
            "153(6.0)"
        ],
        [
            "206(8.1)"
        ],
        [
            "190(7.5)"
        ],
        [
            "179(7.0)"
        ],
        [
            "120(4.7)"
        ],
        [
            "54(2.1)"
        ],
        [
            "39(1.5)"
        ],
        [
            "1,094(43)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5.2"
        ],
        [
            "4.5"
        ],
        [
            "6.4"
        ],
        [
            "9.2"
        ],
        [
            "19.7"
        ],
        [
            "24.3"
        ],
        [
            "26.9"
        ],
        [
            "25.7"
        ],
        [
            "24.4"
        ],
        [
            "21.0"
        ],
        [
            "12.9"
        ],
        [
            "9.1"
        ],
        [
            "189.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(December 2023)"
        ],
        [
            "Saint Mary Magdalene, Patroness of Kawit, Cavite."
        ],
        [
            "Population census of KawitYearPop.±% p.a.1903 6,114—    1918 6,855+0.77%1939 10,783+2.18%1948 13,970+2.92%1960 19,352+2.75%1970 28,447+3.92%1975 33,813+3.53%1980 39,368+3.09%1990 47,755+1.95%1995 56,993+3.37%2000 62,751+2.08%2007 76,405+2.75%2010 78,209+0.85%2015 83,466+1.25%2020 107,535+5.11%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Kawit was 107,535 people, with a density of 4,700 inhabitants per square kilometer or 12,000 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(December 2023)"
        ],
        [
            "Lokal Mall Kawit along Antero Soriano Highway (Centennial Road)"
        ],
        [
            "Poverty incidence of Kawit"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  5.80"
        ],
        [
            "2009  4.79"
        ],
        [
            "2012  5.88"
        ],
        [
            "2015  9.51"
        ],
        [
            "2018  5.66"
        ],
        [
            "2021  10.13"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "Maytinis Festival"
        ],
        [
            "An original Kawit tradition that takes place every Christmas Eve, a dramatic retelling of the Virgin Mary and Joseph's search in Bethlehem for a place to stay called \"Panunuluyan\".",
            "This reenactment happens on the streets of Kawit with different floats depicting different biblical scenes from Adam and Eve up to Mary and Joseph.",
            "The \"Panunuluyan\" takes place in several houses and is done in singing until it reaches the 400-year-old St. Mary Magdalene Church, where the Virgin Mary and Joseph are welcomed by angels in a giant belen (Nativity Scene), which covers the whole main Retablo or altarpiece of the church.",
            "The songs performed by the angels acted by little girls are mostly in Spanish and Tagalog."
        ],
        [
            "Government"
        ],
        [
            "The current Kawit Municipal Hall along Antero Soriano Highway"
        ],
        [
            "Local government"
        ],
        [
            "Like any other Philippine municipality, Kawit is headed by a municipal mayor, vice mayor, and 10 councilors, eight of them elected at large by the voting populace and two of them being sectoral representatives (one for the barangays and one for the youth, elected respectively through their federations)."
        ],
        [
            "The mayor is assisted by the vice mayor, who presides over a legislative council.",
            "The current mayor of the historical town is Angelo Emilio G. Aguinaldo, a descendant of the first officially recognized President of the Philippines, General Emilio Aguinaldo.",
            "The current vice mayor is Edward R. Samala Jr."
        ],
        [
            "Sister city"
        ],
        [
            " Sakegawa, Yamagata, Japan"
        ],
        [
            "Images"
        ],
        [
            "Procession (Karakol, dancing)"
        ],
        [
            "Emilio Aguinaldo tomb"
        ],
        [
            "Old Town Hall facade"
        ],
        [
            "Junction"
        ],
        [
            "Beach"
        ],
        [
            "Kawit Toll Plaza of Manila–Cavite Expressway (CAVITEX)"
        ],
        [
            "See also"
        ],
        [
            "Aguinaldo Shrine"
        ],
        [
            "St. Michael the Archangel Parish of Binakayan (Aglipayan Church)"
        ],
        [
            "St. Mary Magdalene Church (Kawit)"
        ],
        [
            "Baldomero Aguinaldo Shrine"
        ],
        [
            "Battle of Binakayan-Dalahican"
        ],
        [
            "Kawit revolt, 1896"
        ],
        [
            "Kawit shooting, 2013"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Kawit |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"House Bill No.",
            "2869\" (PDF).",
            "House of Representatives of the Philippines.",
            "2022.",
            "Retrieved December 31, 2023."
        ],
        [
            "^ Presidential Proclamation No.",
            "287, s. 2023 (July 7, 2023), Declaring Tuesday, 01 August 2023, a Special (Non-working) Day in the Municipality of Kawit, Province of Cavite, Official Gazette of the Republic of the Philippines, retrieved December 31, 2023"
        ],
        [
            "^ Act No.",
            "1718 (September 20, 1907), An Act Increasing the Number of Municipalities in the Province of Cavite From Twelve to Thirteen, by Separating from the Present Municipality of Noveleta the Former Municipality of Cavite Viejo and Giving to the Latter the Territory which it Comprised Prior to the Passage of Act Numbered Nine Hundred and Forty-Seven, and Changing the Name of the Municipality of Cavite Viejo to Kawit, Jurist AI, retrieved December 31, 2023"
        ],
        [
            "^"
        ],
        [
            "\"Province: Cavite\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Kawit: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 12, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cavite\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"List of Sister City Affiliations with Japan (by country)\".",
            "Clair Singapore.",
            "Archived from the original on October 23, 2016.",
            "Retrieved October 12, 2018."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Kawit."
        ],
        [
            "Official Website of the Provincial Government of Cavite"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Preceded bySan Miguel, Bulacan"
        ],
        [
            " Capital of the Philippines June–July 1898"
        ],
        [
            "Succeeded byBacoor"
        ],
        [
            "Places adjacent to Kawit"
        ],
        [
            "Cavite CityBacoor Bay"
        ],
        [
            "Manila Bay"
        ],
        [
            "Noveleta"
        ],
        [
            "Kawit"
        ],
        [
            "Bacoor"
        ],
        [
            "Imus"
        ],
        [
            "vte Province of CaviteTrece Martires  (de facto capital), Imus  (de jure capital)  Dasmariñas (largest city)Municipalities"
        ],
        [
            "Alfonso"
        ],
        [
            "Amadeo"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "Indang"
        ],
        [
            "Kawit"
        ],
        [
            "Magallanes"
        ],
        [
            "Maragondon"
        ],
        [
            "Mendez"
        ],
        [
            "Naic"
        ],
        [
            "Noveleta"
        ],
        [
            "Rosario"
        ],
        [
            "Silang"
        ],
        [
            "Tanza"
        ],
        [
            "Ternate"
        ],
        [
            "Component cities"
        ],
        [
            "Bacoor"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Tagaytay"
        ],
        [
            "Trece Martires"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Kawit&oldid=1234275542\""
        ],
        [
            "Categories: Kawit, CaviteMunicipalities of CavitePopulated places on Manila BayHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from October 2013All articles needing additional referencesUse mdy dates from December 2022Use Philippine English from December 2022All Wikipedia articles written in Philippine EnglishPages using infobox settlement with possible nickname listPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles to be expanded from December 2023All articles to be expandedArticles using small message boxesCommons category link is on WikidataArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}