{
    "name": "La Carlota",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "La Carlota, Negros Occidental"
        ],
        [
            "20 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°25′N 122°55′E﻿ / ﻿10.42°N 122.92°E﻿ / 10.42; 122.92"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Component city in Negros Occidental, Philippines"
        ],
        [
            "Component city in Negros Island Region, PhilippinesLa CarlotaComponent cityCity of La CarlotaOur Lady of Peace and Good Voyage Roman Catholic Church"
        ],
        [
            "FlagSealNickname(s): Drumbeating City of Beauty and DanceMotto: Let's Go La Carlota!Anthem: Let's Go La Carlota!Map of Negros Occidental with La Carlota highlightedOpenStreetMapLa CarlotaLocation within the PhilippinesCoordinates: 10°25′N 122°55′E﻿ / ﻿10.42°N 122.92°E﻿ / 10.42; 122.92CountryPhilippinesRegionNegros Island RegionProvinceNegros OccidentalDistrict"
        ],
        [
            "4th districtFoundedOctober 15, 1869CityhoodJune 19, 1965Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorRex R. Jalandoon • Vice MayorDavid T. Baga, Jr. • RepresentativeJuliet Marie D. Ferrer • City Council"
        ],
        [
            "Members"
        ],
        [
            "Richard Sebastian S. BenedictoJaime Manuel H. MariñoJosefina A. JalandoniElmar O. AriesJulius Martin D. AsistioJohn R. BadilloJoseph Martin Anthony J. JalandoniCiriaco D. Sia Jr.Stephen G. SimbitJanuary A. Abad"
        ],
        [
            " • Electorate45,065 voters (2022)Area • Revenue₱ 689.4 million (2020) • Assets₱ 1,777 million (2020) • Expenditure₱ 576.8 million (2020) • Liabilities₱ 656.8 million (2020)Service provider • ElectricityNegros Occidental Electric Cooperative (NOCECO)Time zoneUTC+8 (PST)ZIP code6130PSGC064516000IDD : area code +63 (0)34Native languagesHiligaynon TagalogWebsitelacarlotacity.gov.ph"
        ],
        [
            "La Carlota, officially the City of La Carlota, (Hiligaynon: Dakbanwa sang La Carlota; Cebuano: Dakbayan sa La Carlota; Filipino: Lungsod ng La Carlota), is a 4th class component city in the province of Negros Occidental, Philippines.",
            "According to the 2020 census, it has a population of 66,664 people.",
            "making it the least populous city in the province."
        ],
        [
            "Until two years after its foundation in 1871, it was known as Simancas, a barrio under the jurisdiction of the neighboring town of San Enrique, which was led by a Spaniard who was married to a woman named Carlota.",
            "Legend has it that she was well-loved by the natives for her social works so that they named their settlement after her when it was created as a municipality near the end of the Spanish colonial era in the Philippines.",
            "In line with the Spanish practice of adding an article before a proper noun, “La Carlota” became its official name.",
            "On June 19, 1965, by virtue of Republic Act No.",
            "4585, La Carlota was granted a city charter, becoming one of the two landlocked cities in Negros Island, the other being neighbouring Canlaon in Negros Oriental."
        ],
        [
            "In 2011, the Department of the Interior and Local Government (DILG) awarded the city with a \"seal of good housekeeping\" for its efforts in advancing accountability and transparency in local governance."
        ],
        [
            "History"
        ],
        [
            "Aerial view of La Carlota and landing field, 1938"
        ],
        [
            "Central Azucarera de La Carlota"
        ],
        [
            "Throughout much of its early history, agriculture was the main source of livelihood for the native settlers of Simancas.",
            "The original inhabitants grew rice for their own consumption and latter ones cultivated tobacco for export during the Spanish colonial era.",
            "Early settlers were drawn to Candaguit River from where Simancas expanded.",
            "In 1856 historians began mentioning the village of Mampunay in their accounts of the settlement's history.",
            "The local parish priest of San Enrique at the time designated Simancas as a barrio."
        ],
        [
            "Prior to the establishment of the permanent Spanish settlement in the Philippines in 1565, Simancas was led by Mangkas, a negrito warrior.",
            "He lived around the area of what is today known as Canman-ug Creek.",
            "People looked up to him for his bravery in warding off hostile forces and for keeping the peace.",
            "Legend says that because the people revered him, they named their children after him.",
            "With many inhabitants named Mangkas, the settlement eventually became known as Simancas."
        ],
        [
            "The Spanish began establishing their administration over the Philippine archipelago since the late 16th century."
        ],
        [
            "The division of Negros island into two distinct provinces (Negros Occidental and Negros Oriental) took place in 1890 at the start of this historic decade.",
            "La Carlota as well saw a flowering of culture during this decade, which ushered in what many consider as its golden literary age.",
            "Near the end of that decade was born in La Carlota one of its most famous children in the literary field: Adelina Gurrea.",
            "She later gained world prominence as a journalist, poet and novelist in Spain where she espoused women's causes in her writings."
        ],
        [
            "From 1901 to 1906, La Carlota figured prominently in the anti-American resistance movement on Negros.",
            "It produced some of the best-known Babaylan leaders, chief among whom was Papa Isio.",
            "He led the struggle against the American occupation that replaced the Spanish regime as a result of the Treaty of Paris that ended the Spanish–American War and ceded control of the Philippines to the United States.",
            "Babaylans  or entrencirados  conducted guerrilla warfare against the American forces in the towns of La Carlota, Isabela, Kabankalan and La Castellana.",
            "From its humble beginnings as a small settlement, La Carlota has evolved into one of the major sugar-producing cities in the Philippines."
        ],
        [
            "Geography"
        ],
        [
            "City hall and public plaza"
        ],
        [
            "La Carlota Public Plaza"
        ],
        [
            "La Carlota City is geographically located at the north-central portion of Negros Occidental.",
            "It is bordered in the north by Bago, in the east by Kanlaon Volcano and Canlaon of Negros Oriental, in the southeast by the town of La Castellana, in the southwest by Pontevedra and in the west by San Enrique.",
            "It has a total land area of 13,729 ha (137.29 km2), most of it devoted to agriculture."
        ],
        [
            "La Carlota City is 43 kilometres (27 mi) from Bacolod."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for La Carlota, Negros Occidental"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "100(3.9)"
        ],
        [
            "75(3.0)"
        ],
        [
            "90(3.5)"
        ],
        [
            "101(4.0)"
        ],
        [
            "183(7.2)"
        ],
        [
            "242(9.5)"
        ],
        [
            "215(8.5)"
        ],
        [
            "198(7.8)"
        ],
        [
            "205(8.1)"
        ],
        [
            "238(9.4)"
        ],
        [
            "194(7.6)"
        ],
        [
            "138(5.4)"
        ],
        [
            "1,979(77.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "14.9"
        ],
        [
            "11.3"
        ],
        [
            "14.5"
        ],
        [
            "17.4"
        ],
        [
            "26.4"
        ],
        [
            "28.4"
        ],
        [
            "28.5"
        ],
        [
            "27.5"
        ],
        [
            "26.9"
        ],
        [
            "28.4"
        ],
        [
            "24.2"
        ],
        [
            "17.2"
        ],
        [
            "265.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "The city enjoys two distinct seasons like the rest of the Philippines: The dry season from January through May and the wet season from June through December."
        ],
        [
            "Barangays"
        ],
        [
            "A village in one of the barangays in the city"
        ],
        [
            "La Carlota is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Currently, there are 3 barangays which considered urban (highlighed in bold).",
            "The farthest from the city is Barangay Yubo, which is 17.9 kilometers from the urban core.",
            "The city's barangays are as follows:"
        ],
        [
            "Ara-al"
        ],
        [
            "Ayungon"
        ],
        [
            "Balabag"
        ],
        [
            "Batuan"
        ],
        [
            "Cubay"
        ],
        [
            "Haguimit"
        ],
        [
            "La Granja"
        ],
        [
            "Nagasi"
        ],
        [
            "Barangay I (Poblacion)"
        ],
        [
            "Barangay II (Poblacion)"
        ],
        [
            "Barangay III (Poblacion)"
        ],
        [
            "Barangay RSB (Consuelo)"
        ],
        [
            "San Miguel"
        ],
        [
            "Yubo"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of La CarlotaYearPop.±% p.a.1903 13,097—    1918 20,410+3.00%1939 26,084+1.17%1948 45,789+6.45%1960 56,772+1.81%1970 38,321−3.85%1975 40,984+1.36%1980 45,812+2.25%1990 56,443+2.11%1995 56,414−0.01%2000 56,408−0.00%2007 63,584+1.67%2010 63,852+0.15%2015 64,469+0.18%2020 66,664+0.66%Source: Philippine Statistics Authority"
        ],
        [
            "Parish of Our Lady of Peace and Good Voyage of the Iglesia Filipina Independiente (Philippine Independent Church)"
        ],
        [
            "The first recorded census, conducted in 1903, pegged the population at 3,097.",
            "The 1995 Philippine Statistics Authority survey recorded a population of 56,414.",
            "Two years later, the population grew to 57,982, increasing to 62,094 in 2002.",
            "By then population density was 4.5 persons per hectare.",
            "Of the 14 barangays or villages, Barangay II has the biggest population with 9,221 and Barangay Yubo has the smallest with 1,962."
        ],
        [
            "About 96% of the people use a local Negrense variant of Hiligaynon as their main language of communication, while the remaining 04% of the population use Cebuano.",
            "English, and sometimes Filipino, are generally understood and spoken by a large segment of the city's population, especially amongst the well-educated peoples."
        ],
        [
            "Economy"
        ],
        [
            "URC sugar mill"
        ],
        [
            "Poverty incidence of La Carlota"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  17.90"
        ],
        [
            "2009  19.28"
        ],
        [
            "2012  10.33"
        ],
        [
            "2015  12.27"
        ],
        [
            "2018  12.36"
        ],
        [
            "2021  13.49"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "A portion of Guintubdan Falls"
        ],
        [
            "Our Lady of Peace and Good Voyage Roman Catholic Church"
        ],
        [
            "Standing in the heart of La Carlota City on La Paz Street, Barangay I, Poblacion is this old church, built in 1876 during the Spanish era.",
            "It has the distinction as one of the very few churches of Romanesque architectural design in the region."
        ],
        [
            "A distinct quality of this church was its use of Silay red bricks and coral stones bonded together by lime mixed in duck eggs as a binder.",
            "The materials were taken from Guimaras Island.",
            "The church was built by Filipinos forced to work under the polo system during the Spanish regime.",
            "The unpopular practice required Filipino males from age 16 to 60 to render free labor constructing churches, roads, bridges and other infrastructure for a total of forty days during the year."
        ],
        [
            "Muscovado Sugar Mill Brick Chimney"
        ],
        [
            "Muscovado Sugar Mill Brick Chimney Ruins"
        ],
        [
            "This muscovado sugar mill brick chimney at Hacienda Canman-ug, Barangay Batuan was constructed before the establishment of Central Azucarera de La Carlota.",
            "It was powered by an A & W Smith Company steam engine manufactured in 1883 in Glasgow.",
            "This tourist destination offers a glimpse into the lives of Mangkasanons over a century ago and serves as a vehicle of knowledge on how the sugar industry in this part of the world has evolved."
        ],
        [
            "Iron Dinosaurs of Central Azucarera de La Carlota"
        ],
        [
            "Visitors entering through the western part of the city are greeted by a black vintage steam locomotive, which the locals have dubbed as the “Iron Dinosaur” of La Carlota."
        ],
        [
            "Infante Heritage House"
        ],
        [
            "On December 12, 2001, the house was designated by the National Historical Institute as a heritage house, and a historical marker was placed on the property."
        ],
        [
            "Presidencia Building"
        ],
        [
            "The seat of the local government, constructed in 1934, is a landmark in the city center."
        ],
        [
            "La Granja Agricolas"
        ],
        [
            "This agricultural model farm was established in 1881 through a Spanish royal decree issued on November 15, 1881, and was formally opened on July 8, 1884.",
            "The Philippines government maintains a stock farm in Barangay La Granja as well as a research center established by the Philippine Sugar Commission."
        ],
        [
            "Agora Public Market"
        ],
        [
            "It was constructed in 1981 to replace the old public market of La Carlota that was destroyed by fire in 1978.",
            "It is named after the Greek term \"Agora\", which stands for a public open space used for assemblies and markets.",
            "It is located just a few meters away from the public plaza."
        ],
        [
            "Festivals"
        ],
        [
            "Pasalamat Festival:"
        ],
        [
            "The Christmas Festival of Lights and Music:"
        ],
        [
            "Notable personalities"
        ],
        [
            "Adelina Gurrea - Spanish Philippine poet and journalist."
        ],
        [
            "Gilbert Luis R. Centina III - Filipino-American novelist and prize-winning poet."
        ],
        [
            "Pancho Villa - World flyweight champion from 1923 to 1925."
        ],
        [
            "Small Montana - World flyweight crown holder from 1935 to 1938."
        ],
        [
            "Little Dado (Eleuterio Zapanta) - Boxer from 1938 to 1944."
        ],
        [
            "Sister Cities"
        ],
        [
            "Carson, California, United States"
        ],
        [
            "References"
        ],
        [
            "^  City of La Carlota |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"La Carlota City: 2011 DILG Awardee Seal of Good Housekeeping for Local Governance\".",
            "Retrieved August 29, 2013."
        ],
        [
            "^ \"Mayor reports city's accomplishments\".",
            "SunStar.",
            "Archived from the original on March 15, 2017.",
            "Retrieved August 29, 2013."
        ],
        [
            "^ \"Inside Negros: La Carlota City\".",
            "Archived from the original on August 18, 2008.",
            "Retrieved August 29, 2013."
        ],
        [
            "^ \"HISTORY OF LA CARLOTA CITY\".",
            "Retrieved August 29, 2013."
        ],
        [
            "^ \"Company Overview of Central Azucarera De La Carlota Inc\".",
            "Archived from the original on August 29, 2013.",
            "Retrieved August 29, 2013."
        ],
        [
            "^ \"Province of Negros Occidental: La Carlota city\".",
            "Retrieved August 29, 2013."
        ],
        [
            "^"
        ],
        [
            "\"La Carlota: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 7, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Carson Sister Cities Association\".",
            "Retrieved August 29, 2013."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for La Carlota, Negros Occidental."
        ],
        [
            "Wikimedia Commons has media related to La Carlota, Negros Occidental."
        ],
        [
            "La Carlota City Official Website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived March 4, 2016, at the Wayback Machine"
        ],
        [
            "Places adjacent to La Carlota, Negros Occidental"
        ],
        [
            "Valladolid"
        ],
        [
            "Bago"
        ],
        [
            "San Enrique"
        ],
        [
            "La Carlota"
        ],
        [
            "Canlaon, Negros Oriental"
        ],
        [
            "Pontevedra / La Castellana"
        ],
        [
            "Articles Related to La Carlota, Negros Occidental"
        ],
        [
            "vte Province of Negros OccidentalBacolod (capital and largest city)Municipalities"
        ],
        [
            "Binalbagan"
        ],
        [
            "Calatrava"
        ],
        [
            "Candoni"
        ],
        [
            "Cauayan"
        ],
        [
            "Don Salvador Benedicto"
        ],
        [
            "Enrique B. Magalona"
        ],
        [
            "Hinigaran"
        ],
        [
            "Hinoba-an"
        ],
        [
            "Ilog"
        ],
        [
            "Isabela"
        ],
        [
            "La Castellana"
        ],
        [
            "Manapla"
        ],
        [
            "Moises Padilla"
        ],
        [
            "Murcia"
        ],
        [
            "Pontevedra"
        ],
        [
            "Pulupandan"
        ],
        [
            "San Enrique"
        ],
        [
            "Toboso"
        ],
        [
            "Valladolid"
        ],
        [
            "Component cities"
        ],
        [
            "Bago"
        ],
        [
            "Cadiz"
        ],
        [
            "Escalante"
        ],
        [
            "Himamaylan"
        ],
        [
            "Kabankalan"
        ],
        [
            "La Carlota"
        ],
        [
            "Sagay"
        ],
        [
            "San Carlos"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Talisay"
        ],
        [
            "Victorias"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Bacolod (Administratively independent from the province but grouped under Negros Occidental by the Philippine Statistics Authority.)"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=La_Carlota,_Negros_Occidental&oldid=1232969354\""
        ],
        [
            "Categories: Cities in Negros OccidentalPopulated places established in 18691869 establishments in the PhilippinesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse mdy dates from July 2022Pages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using PH wikidata incorrectlyPages using infobox settlement with possible demonym listArticles containing Hiligaynon-language textArticles containing Cebuano-language textArticles containing Filipino-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}