{
    "name": "Laguindingan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Laguindingan"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSimple EnglishSvenskaTagalogTürkçeTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°35′N 124°27′E﻿ / ﻿8.58°N 124.45°E﻿ / 8.58; 124.45"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Misamis Oriental, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Laguindingan\" – news · newspapers · books · scholar · JSTOR (July 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesLaguindinganMunicipalityMunicipality of LaguindinganAccess Road to Laguindingan Airport"
        ],
        [
            "FlagSealNickname: Gateway to Northern MindanaoMap of Misamis Oriental with Laguindingan highlightedOpenStreetMapLaguindinganLocation within the PhilippinesCoordinates: 8°35′N 124°27′E﻿ / ﻿8.58°N 124.45°E﻿ / 8.58; 124.45CountryPhilippinesRegionNorthern MindanaoProvinceMisamis OrientalDistrict"
        ],
        [
            "2nd districtFoundedJune 8, 1963Barangays11"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorDiosdado T. Obsioma • Vice MayorRoy I. Macua • RepresentativeYevgeny Vincente B. Emano • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ozellyna O. San JoseJoseph B. PaderoArtemio G. DalondonanGenerito W. Cuares Jr.Lyn J. DenhamJulie C. FajanilboMyrna M. TevesFrancisco N. Saburao Jr."
        ],
        [
            " • Electorate20,778 voters (2022)Area • Revenue₱ 134.4 million (2020) • Assets₱ 291.5 million (2020) • Expenditure₱ 104.7 million (2020) • Liabilities₱ 77.02 million (2020)Service provider • ElectricityMisamis Oriental 1 Rural Electric Cooperative (MORESCO 1)Time zoneUTC+8 (PST)ZIP code9019PSGC104314000IDD : area code +63 (0)88Native languagesCebuano Binukid Subanon TagalogWebsitewww.laguindingan.gov.ph"
        ],
        [
            "Laguindingan, officially the Municipality of Laguindingan (Cebuano: Lungsod sa Laguindingan; Tagalog: Bayan ng Laguindingan), is a 4th class municipality in the province of Misamis Oriental, Philippines.",
            "According to the 2020 census, it has a population of 26,363 people."
        ],
        [
            "Its most notable landmark is the Laguindingan Airport, located between Cagayan de Oro and Iligan."
        ],
        [
            "History"
        ],
        [
            "Laguindingan used to be called \"Daligdigan\" coined from the words \"daligdig\", meaning trickling water from Soloan Creek, and \"digan\", a buri plant, which was used by the early settlers as roofing and walling materials.",
            "The name later evolved into \"Laguindingan\" because it is easier to pronounce and has a melodious sound."
        ],
        [
            "The presence of an old Spanish port \"Moog\" at Punta Sulawan manifest the claim that before the settlers came to Laguindingan, the place was the hideout of robbers, pirates and bandoleros because of the once thick forest cover of the municipality.",
            "A brave man named Calixto Caseres together with his family moved in from Alubijid and settled for good.",
            "Other settlers (including migrants from Luzon and Visayas) followed and soon the place became a thriving community.",
            "A number of Cagayan de Oro civilians and government officials hide in Laguindingan during the second world war.",
            "Blocking force was established in Laguindingan that let Japanese soldiers to use boat instead going to Iligan.",
            "The Philippine Independent Church was the first religious order established in the early community.",
            "The religious presence was evidenced by the Chapel erected on the highest promontory now known as Salcedo's Hill.",
            "The cross still stand today.",
            "The silent witness of the establishment of the now growing town."
        ],
        [
            "Laguindingan, was a sitio of Alubijid under the municipality of Cagayan de Oro.",
            "The first Barrio Teniente was Mariano Salcedo (from Kauswagan, Cagayan de Oro) which was appointed by the Alcalde de Cagayan.",
            "When Alubijid became a municipality, Proceso Pacana became the first Barrio Lieutenant until the end of World War II.",
            "Later a move to make Laguindingan a municipality was spearheaded by Glicerio Salcedo (Teniente del Barrio) who became the first Municipal Mayor of the town.",
            "The barangays that joined the move for township was known as the Sulawan Block namely: Kibaghot, Sinai, Mauswagon, Moog, Gasi, Aromahon, Tubajon, Sambulawan, Lapad and Liberty.",
            "On June 23, 1963, through House Bill No.",
            "5612, President Diosdado Macapagal signed RA 3824, creating the municipality of Laguindingan."
        ],
        [
            "Sambulawan derived from the word \"Sulawan\" because the place is situated on a hill or in Bisaya \"ilaya\" going up where the sun rises its bright lights is glaring to the eye, thus \"Sulaw\" in bisaya.",
            "The place is also known as a place of \"sabungan\" or where cock fights are held."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Laguindingan is politically subdivided into 11 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Aromahon"
        ],
        [
            "Gasi"
        ],
        [
            "Kibaghot (San Isidro)"
        ],
        [
            "Lapad"
        ],
        [
            "Liberty"
        ],
        [
            "Mauswagon"
        ],
        [
            "Moog"
        ],
        [
            "Poblacion"
        ],
        [
            "Sambulawan"
        ],
        [
            "Sinai"
        ],
        [
            "Tubajon"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lagindingan, Misamis Oriental"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(76)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "271(10.7)"
        ],
        [
            "217(8.5)"
        ],
        [
            "193(7.6)"
        ],
        [
            "178(7.0)"
        ],
        [
            "344(13.5)"
        ],
        [
            "423(16.7)"
        ],
        [
            "362(14.3)"
        ],
        [
            "358(14.1)"
        ],
        [
            "329(13.0)"
        ],
        [
            "320(12.6)"
        ],
        [
            "322(12.7)"
        ],
        [
            "260(10.2)"
        ],
        [
            "3,577(140.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "23.2"
        ],
        [
            "19.5"
        ],
        [
            "22.0"
        ],
        [
            "22.8"
        ],
        [
            "29.6"
        ],
        [
            "28.9"
        ],
        [
            "30.3"
        ],
        [
            "29.8"
        ],
        [
            "28.1"
        ],
        [
            "28.8"
        ],
        [
            "26.1"
        ],
        [
            "24.1"
        ],
        [
            "313.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LaguindinganYearPop.±% p.a.1970 10,292—    1975 11,849+2.87%1980 12,059+0.35%1990 15,503+2.54%1995 16,521+1.20%YearPop.±% p.a.2000 18,451+2.40%2007 19,952+1.08%2010 21,822+3.31%2015 24,405+2.15%2020 26,363+1.53%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Laguindingan was 26,363 people, with a density of 600 inhabitants per square kilometre or 1,600 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Laguindingan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  32.60"
        ],
        [
            "2009  52.22"
        ],
        [
            "2012  35.41"
        ],
        [
            "2015  36.44"
        ],
        [
            "2018  15.16"
        ],
        [
            "2021  23.61"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Laguindingan, Misamis Oriental is now the new gateway to Northern Mindanao, where the new Laguindingan Airport is located replacing the old Lumbia Airport of Cagayan de Oro.",
            "The Cooperative that has a mission or Rural Electrification sits here which is MORESCO-1 Head Office.",
            "It has a power distribution franchise for the west part of Misamis Oriental from the towns of Opol to Lugait .",
            "It operates in 15 barrios of Cagayan de Oro and the whole town and barangays of Talakag, Bukidnon and portions of barangays in Iligan City.",
            "Another growing industry is the hand crafted silk.",
            "The Mindanao silk which is woven by members of Ayala Beneficiaries Association Inc., based in Laguindingan affected by the construction of the airport.",
            "Today commercial enterprises is a thriving industry for heavy equipment, machinery and transport vehicles merchandise.",
            "Lohas Hotel and Moresco lodge are the new tourist inns available.",
            "Also beach and swimming pool is another attraction for the local which are located on Mauswagon to Tubajon road side resorts.",
            "Another tourist attraction is the Balsa of Laguindingan, the floating cottages that fuel the local economy.",
            "It had made the Town the Balsa Capital of Mindanao."
        ],
        [
            "Laguindingan is also well known for its famous sea food every Saturday Market also known as  \"tabu\" in Cebuano.",
            "Here visitors and locals can buy and eat sea urchins in bottles, sea weeds, sea clams and snails, and the famous cure for arthritis the sea cucumber with the barbecue fish on sticks also known in Visayan as \"tinap-an\" and the delicious fish rich in Omega 3 oil also known as \"pinyahin\".",
            "Fishes from neighboring towns are also brought here for trading."
        ],
        [
            "The common agricultural produce aside from corn, cassava and copra is the \"finest tobacco\".",
            "This has driven the town to progress and its neighboring towns for decades.",
            "The tobacco industry prior to the advent of Laguindingan Airport is also an attraction for entrepreneurs."
        ],
        [
            "The Saturday market had also made the town famous for the lives stock industry were poultry and livestock were traded.",
            "Neighboring towns Alubijid and Libertad had benefited from this trading as well as Cagayan de Oro, where here the lechon entrepreneurs get those young pork here."
        ],
        [
            "Today another flourishing industry for beach tourism being developed is also the scuba diving where the rich exotic sea creatures are found in the coastal barangay Tubajon."
        ],
        [
            "Tourism"
        ],
        [
            " Balsa sa Laguindingan"
        ],
        [
            "Located at Birhen sa Moog Bay near the punta sulawan point.",
            "It is floating cottages where groups or families can enjoy swimming and take shelter in these floating huts which can accommodate up to 30 persons.",
            "You have to ride a bangca to get there.",
            "Its docking point is now located at Moog Bay where an environment fee is collected for the municipality to sustain environment clean up."
        ],
        [
            "Binitinan Islet located at Mauswagon it is a rock formation which form like the head of a snake(bitin) with soil and trees where it is surrounded by sea."
        ],
        [
            "Tagbabanga Spring a place in Sinai where you walk distance from the National Highway.",
            "This spring is the source of potable water that is the source of drinking water not only in Barangay Sinai but to some neighboring barangays as well."
        ],
        [
            "Balete Hill also known as'Hill Top' (Buntod) a place where the old Iglesia Pilipina Independente Church site before it transferred.",
            "It is visible to everybody during Holy Week season where the people will walk towards the Holy Cruz."
        ],
        [
            "My Relaxing Terrace site in Tubajon a beach where many mangrove trees cited, the sand like Boracay sand."
        ],
        [
            "Berhen Milagrosa a place in Moog where it miracles it is site beside the sea, many people will Church there during Sunday it also become a tourist spot."
        ],
        [
            "La Cueva Con Agua Locally known as \"Liyang\", site in Mauswagon nearby the Barangay Hall, it is known as a place of enchanto, a cave that has water and being protected by Municipality of Laguindingan due to some superstitious belief."
        ],
        [
            "Tubajon Mang Groves"
        ],
        [
            "Laguindingan Watchtower, an 18th-century watchtower built by the Spanish during the colonial era."
        ],
        [
            "Sambulawan Sinai Tagbabanga Spring and Water fall located in a river from Gitagum Misamis Oriental towards Aromahon Laguindingan Misamis Oriental."
        ],
        [
            "Our Lady of Fatima- Located in baranggay Sambulawan Laguindingan Misamis Oriental a 50 foot tall statue facing the east side to the Divine Mercy in El Salvador."
        ],
        [
            "Town events"
        ],
        [
            "There are several notable events in the town.",
            "Each barangays or barrios has its own feast locally known as Fiesta literally as festivals honoring their patron saints after achieving recognition in their own rights."
        ],
        [
            "Tobacco Festival  is a one-day festival celebration of Laguindinagan, held every month of July 12.",
            "Tobacco is Laguindinganon's center of commodity where immigrant from other province's and cities made their purchased of Tobacco every Sunday."
        ],
        [
            "Charter Day is the town's celebration of its townhood established on July 12, 1963.",
            "It is a non-working holiday and a roster of special activities is lined up annually to mark this special occasion."
        ],
        [
            "A Holy-Week Trek March or April (Movable) on the eve of Good Friday (Thursday evening), where hundreds of Laguindinganon trek towards the old Municipal Hall in \"Balete Hill\" for the annual Via crucis or way of the cross.",
            "This event is the town's catholic devotees in observation of the holy week."
        ],
        [
            "Miss Laguindingan (July 8) is a beauty pageant presenting the native beauty of Laguindingan ladies.",
            "It is one of the most prestigious beauty pageants in the Town."
        ],
        [
            "Town Fiesta April 20 the original town fiesta of Laguindingan.",
            "Majority of the people of Poblacion celebrating the fiesta."
        ],
        [
            "Transportation"
        ],
        [
            "Laguindingan does not have sea transportation facilities.",
            "Nearby Cagayan de Oro is the main entry point to Misamis Oriental.",
            "From there, one would then take a bus or jeepneys from the Westbound-Bulua Integrated Bus and Jeepney Terminal."
        ],
        [
            "By land"
        ],
        [
            "Habal-habal is the transportation in town for inner most barangays when you are in a hurry."
        ],
        [
            "Tricab is now the king of the urban road where the neighboring towns benefitted from it.",
            "It has become a local transport industry and increase commerce and had contributed to cheaper cost of transport for both neighboring and hinterland barangays."
        ],
        [
            "Laguindingan Integrated Bus Terminal is now operational since June 15, 2016, known as Laguindingan Transport Terminal since it was recently inaugurated.",
            "It caters buses to and from Iligan/Cagayan de Oro as well as the new route Balingasag town to Laguindigan direct."
        ],
        [
            "By air"
        ],
        [
            "Laguindingan Airport is the air transportation in town.",
            "The new airport is in barangay Moog, Laguindingan, and is expected to become a major hub for export of agricultural and trade products, and for the import of tourists to the areas around Cagayan de Oro and Iligan City.",
            "There are plans by the Philippine National Railways to connect Laguindingan to Cagayan de Oro city."
        ],
        [
            "Education"
        ],
        [
            "Public schools:"
        ],
        [
            "Elementary"
        ],
        [
            "Laguindingan Central School"
        ],
        [
            "Aromahon Elementary School"
        ],
        [
            "Gasi Elementary School"
        ],
        [
            "Kibaghot Elementary School"
        ],
        [
            "Lapad Elementary School"
        ],
        [
            "Liberty Elementary School"
        ],
        [
            "Mauswagon Elementary School"
        ],
        [
            "Moog Elementary School"
        ],
        [
            "Sambulawan Elementary School"
        ],
        [
            "Sinai Elementary School"
        ],
        [
            "Tubajon Elementary School"
        ],
        [
            "Secondary"
        ],
        [
            "Laguindingan National High School"
        ],
        [
            "Kibaghot National High School"
        ],
        [
            "See also"
        ],
        [
            "Metro Cagayan de Oro, fourth largest metropolitan area in the Philippines."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Laguindingan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Lagindingan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved April 29, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Misamis Oriental\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Town In Misamis Oriental Is Best Site For New Airport In Northern Mindanao"
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived March 3, 2016, at the Wayback Machine"
        ],
        [
            "Places adjacent to Laguindingan"
        ],
        [
            "Bohol Sea"
        ],
        [
            "Gitagum"
        ],
        [
            "Laguindingan"
        ],
        [
            "Macajalar BayAlubijid"
        ],
        [
            "Gitagum / Alubijid"
        ],
        [
            "vte Province of Misamis OrientalCagayan de Oro (capital and largest city)Municipalities"
        ],
        [
            "Alubijid"
        ],
        [
            "Balingasag"
        ],
        [
            "Balingoan"
        ],
        [
            "Binuangan"
        ],
        [
            "Claveria"
        ],
        [
            "Gitagum"
        ],
        [
            "Initao"
        ],
        [
            "Jasaan"
        ],
        [
            "Kinoguitan"
        ],
        [
            "Lagonglong"
        ],
        [
            "Laguindingan"
        ],
        [
            "Libertad"
        ],
        [
            "Lugait"
        ],
        [
            "Magsaysay"
        ],
        [
            "Manticao"
        ],
        [
            "Medina"
        ],
        [
            "Naawan"
        ],
        [
            "Opol"
        ],
        [
            "Salay"
        ],
        [
            "Sugbongcogon"
        ],
        [
            "Tagoloan"
        ],
        [
            "Talisayan"
        ],
        [
            "Villanueva"
        ],
        [
            "Component cities"
        ],
        [
            "El Salvador"
        ],
        [
            "Gingoog"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Cagayan de Oro (Administratively independent from the province but grouped under Misamis Oriental by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Laguindingan&oldid=1226053735\""
        ],
        [
            "Category: Municipalities of Misamis OrientalHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Articles needing additional references from July 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}