{
    "name": "Lal-lo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Lal-lo"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 18°12′00″N 121°39′44″E﻿ / ﻿18.2°N 121.6622°E﻿ / 18.2; 121.6622"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cagayan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Lal-lo\" – news · newspapers · books · scholar · JSTOR (January 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesLal-lo"
        ],
        [
            "Nueva SegoviaMunicipalityMunicipality of Lal-LoNueva Segovia Church"
        ],
        [
            "FlagSealMap of Cagayan with Lal-lo highlightedOpenStreetMapLal-loLocation within the PhilippinesCoordinates: 18°12′00″N 121°39′44″E﻿ / ﻿18.2°N 121.6622°E﻿ / 18.2; 121.6622CountryPhilippinesRegionCagayan ValleyProvinceCagayanDistrict"
        ],
        [
            "1st districtBarangays35"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 275.2 million (2020) • Assets₱ 678.5 million (2020) • Expenditure₱ 241.4 million (2020) • Liabilities₱ 325.8 million (2020)Service provider • ElectricityCagayan 2 Electric Cooperative (CAGELCO 2)Time zoneUTC+8 (PST)ZIP code3509PSGC021516000IDD : area code +63 (0)78Native languagesIlocano Ibanag Cagayan Agta Tagalog"
        ],
        [
            "Lal-lo, officially the Municipality of Lal-Lo (Ibanag: Ili nat Lal-lo; Ilocano: Ili ti Lal-lo; Tagalog: Bayan ng Lal-lo), is a first class municipality in the province of Cagayan, Philippines.",
            "According to the 2020 census, it had a population of 48,733 people."
        ],
        [
            "During the Spanish colonial period, Lal-lo was known as Ciudad de Nueva Segovia and was the seat of the Diocese of Nueva Segovia before it was moved to Vigan in Ilocos Sur.",
            "It is currently under efforts to regain its Spanish-era city status."
        ],
        [
            "Recently,"
        ],
        [
            "The Northern Cagayan International Airport in southern Lal-lo was constructed to support both the Cagayan Special Economic Zone in northern Cagayan and to serve seaborne traffic through Port Irene.",
            "The airport project involved the construction of a 2,200 metres (7,200 ft) runway with a width of 45 miles (72 km), following the standards of the International Civil Aviation Organization.",
            "The international airport accommodates large aircraft such as the Airbus A319-100 and Boeing regional jets of comparable size.",
            "Royal Air Philippines offers service twice weekly using BAe146 aircraft."
        ],
        [
            "Lal-lo is 81 kilometres (50 mi) from Tuguegarao and 562 kilometres (349 mi) from Manila."
        ],
        [
            "Etymology"
        ],
        [
            "Lal-lo means \"twisting two strands to make a rope\", or may also refer to the strong river current as it is located along Cagayan River, the longest and largest river in the Philippines."
        ],
        [
            "In Fr.",
            "Jose Bugarin's Ibanag dictionary \"Lallo-c, a town in this province which existed as the ancient capital until 1839  Lallo-c, to twist two strands, making a string or rope.\""
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "In the classical era, Lal-lo was the home of hunter-gatherers who were specialized in hunting mollusks.",
            "These hunter-gatherers stockpiled their leftover mollusk shells in numerous sites in Lal-lo and neighboring Gattaran; eventually, the shells formed the largest stock of shell-midden sites in the entire Philippines."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "The first European to set foot on what is now the town of Lal-lo was Juan de Salcedo, a Spanish conquistador and grandson of Miguel Lopez de Legazpi, in 1572.",
            "Don Juan Pablo Carrión established it as a pueblo (municipality) in 1581 and named it Nueva Segovia.",
            "The reason is currently unknown, as the hometown of Carrión was Carrión de los Condes (Palencia, Spain), as suggested by his last name.",
            "This is mentioned by Juan Miguel Aguilera and Ángel Miranda in their book Espadas del Fin del Mundo (2016).",
            "A founding population of 200 Spanish citizens from Europe accompanied by 100 Spanish soldiers set up settlements across Cagayan Valley, headed by the city of Nueva Segovia (Old Lal-lo)."
        ],
        [
            "Diocese of Nueva Segovia"
        ],
        [
            "The evangelization cross of Lal-lo from Spanish colonial period, in front of the Nueva Segovia Church.",
            "The Cagayan River can be seen in the background."
        ],
        [
            "In 1595, Pope Clement VIII created the Diocese of Nueva Segovia.",
            "In 1596, the Dominicans accepted it as an ecclesiastical mission.",
            "Nueva Segovia had three churches: the cathedral that was under the secular clergy, and the parishes of Centro and Tocolona under the supervision of the Dominicans.",
            "Because of its distance from Manila and the constant threat of the Cagayan River's rampaging waters, however, the Diocese of Nueva Segovia was transferred to Vigan in Ilocos Sur province in 1758.",
            "The diocese's name went along with the transfer to Vigan and to avoid confusion, Bishop Miguel Garcia requested that Nueva Segovia and its suburbs renamed back to Lal-lo.",
            "The seat of the Diocese of Nueva Segovia remains in Vigan till today where is now elevated as the Archdiocese of Nueva Segovia."
        ],
        [
            "The transfer affected the closure of the cathedral and the merging of the three churches into the single parish of Centro.",
            "The two other churches were abandoned and eventually destroyed because of neglect while the church of Centro, dedicated to Santo Domingo de Guzman (Saint Dominic), became what is now Lal-lo Church.",
            "The remains of three bishops are interred in the church: Bishop Miguel de Benavides who was Nueva Segovia's first bishop and later of Manila where he founded the University of Santo Tomas, Bishop Diego de Soria who was the second bishop of the diocese, and Bishop Diego Aduarte who was the sixth."
        ],
        [
            "Provincial capital"
        ],
        [
            "Lal-lo remained the capital of Cagayan province until 1839 when the provincial seat of power was relocated to Tuguegarao; its transformation into the most important town in Cagayan led to the decline of Lal-lo.",
            "It was accepted as an ecclesiastical mission by the Dominicans in 1604, 23 years after the foundation of Lal-lo."
        ],
        [
            "Restoration of cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "The first attempt of the restoration of Lal-lo's city status was made during the first term of Mayor Florante Pascual.",
            "The historical document originally signed by King Philip was not found, even after sending a research delegation to Madrid.",
            "Pascual determined that the restoration of Lal-lo's cityhood be made through an earlier bill."
        ],
        [
            "There was a move in the Philippine Congress to regain its cityhood as a component city, and also rename the municipality back to its original name, Nueva Segovia."
        ],
        [
            "Renewed attempt of city status restoration was carried out in January 2012.",
            "Board member Maria Olivia Pascual said that researchers had found a Spanish document that declared the municipality as a city.",
            "According to Pascual, a bill seeking the restoration of the city status of Lal-lo (the former Ciudad Nueva Segovia) could be filed again through the efforts of First District Representative Juan Ponce Enrile, Jr."
        ],
        [
            "As recently as 2018, vice mayor Oliver Pascual has said that the establishment of Northern Cagayan International Airport in the municipality would be \"a great boost\" in its bid for the restoration of its city status."
        ],
        [
            "Contemporary"
        ],
        [
            "In 2006, the shell-midden sites of Lal-lo and Gattaran were included in the UNESCO Tentative List for World Heritage Site inclusion, a step closer to becoming a world heritage site.",
            "The shell-midden sites are currently being conserved by the local government from looting to preserve its outstanding universal value.",
            "In 2023, the government identified Lal-lo airport as a venue for American military forces as part of the Enhanced Defense Cooperation Agreement (EDCA)."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Lal-lo is politically subdivided into 35 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Abagao"
        ],
        [
            "Alaguia"
        ],
        [
            "Bagumbayan"
        ],
        [
            "Bangag"
        ],
        [
            "Bical"
        ],
        [
            "Bicud"
        ],
        [
            "Binag"
        ],
        [
            "Cabayabasan (Capacuan)"
        ],
        [
            "Cagoran"
        ],
        [
            "Cambong"
        ],
        [
            "Catayauan"
        ],
        [
            "Catugan"
        ],
        [
            "Centro (Poblacion)"
        ],
        [
            "Cullit"
        ],
        [
            "Dagupan"
        ],
        [
            "Dalaya"
        ],
        [
            "Fabrica"
        ],
        [
            "Fusina"
        ],
        [
            "Jurisdiction"
        ],
        [
            "Lalafugan"
        ],
        [
            "Logac"
        ],
        [
            "Magallungon (Santa Teresa)"
        ],
        [
            "Magapit"
        ],
        [
            "Malanao"
        ],
        [
            "Maxingal"
        ],
        [
            "Naguilian"
        ],
        [
            "Paranum"
        ],
        [
            "Rosario"
        ],
        [
            "San Antonio (Lafu)"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Lorenzo"
        ],
        [
            "San Mariano"
        ],
        [
            "Santa Maria"
        ],
        [
            "Tucalana"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lal-lo, Cagayan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "25(77)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "120(4.7)"
        ],
        [
            "77(3.0)"
        ],
        [
            "62(2.4)"
        ],
        [
            "40(1.6)"
        ],
        [
            "118(4.6)"
        ],
        [
            "138(5.4)"
        ],
        [
            "162(6.4)"
        ],
        [
            "173(6.8)"
        ],
        [
            "143(5.6)"
        ],
        [
            "198(7.8)"
        ],
        [
            "185(7.3)"
        ],
        [
            "248(9.8)"
        ],
        [
            "1,664(65.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.9"
        ],
        [
            "12.2"
        ],
        [
            "11.5"
        ],
        [
            "10.6"
        ],
        [
            "18.7"
        ],
        [
            "20.1"
        ],
        [
            "21.2"
        ],
        [
            "23.3"
        ],
        [
            "20.8"
        ],
        [
            "16.9"
        ],
        [
            "16.5"
        ],
        [
            "20.0"
        ],
        [
            "208.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Lal-loYearPop.±% p.a.1903 7,309—    1918 9,385+1.68%1939 12,921+1.53%1948 10,730−2.04%1960 16,834+3.82%1970 21,400+2.43%1975 24,866+3.06%1980 26,947+1.62%YearPop.±% p.a.1990 31,373+1.53%1995 32,156+0.46%2000 36,529+2.77%2007 39,607+1.12%2010 41,388+1.61%2015 44,506+1.39%2020 48,733+1.80%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Lal-lo, Cagayan, was 48,733 people, with a density of 69 inhabitants per square kilometre or 180 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Lal-lo"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  15.30"
        ],
        [
            "2009  16.67"
        ],
        [
            "2012  15.54"
        ],
        [
            "2015  11.09"
        ],
        [
            "2018  13.51"
        ],
        [
            "2021  10.51"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Lal-lo, belonging to the first legislative district of the province of Cagayan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Ramon C. Nolasco Jr."
        ],
        [
            "Mayor"
        ],
        [
            "Florante C. Pascual"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Maria Olivia B. Pascual"
        ],
        [
            "Councilors"
        ],
        [
            "Crystalyn Mae D. Invierno"
        ],
        [
            "Simeon O. Israel Jr."
        ],
        [
            "Rowyn Rowel M. Samonte"
        ],
        [
            "Monette V. Caliva"
        ],
        [
            "Gayleen S. Durupa"
        ],
        [
            "Jimmy P. Balatico"
        ],
        [
            "Jimmy C. Bacuyag"
        ],
        [
            "Winston L. Rosales"
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Cagayan governs the town's public education system.",
            "The office governs the public and private elementary and high schools throughout the municipality."
        ],
        [
            "Lal-lo National High School"
        ],
        [
            "Cagayan State University - Lal-lo Campus"
        ],
        [
            "Lyceum of Lal-lo"
        ],
        [
            "Cabayabasan National High School"
        ],
        [
            "Logac National High School"
        ],
        [
            "Magapit National High School"
        ],
        [
            "Media"
        ],
        [
            "Lal-lo has one FM station, DWRL 95.1, and two cable providers."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Lal-Lo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ \"Lal-lo - Province of Cagayan\"."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Mapa, Susan (7 March 2018).",
            "\"Cityhood ng Lal-lo, May Alas Na!\".",
            "RMN Networks - Reaching Millions Nationwide.",
            "Retrieved 19 June 2019."
        ],
        [
            "^ \"A History of the Philippines by David P. Barrows\".",
            "The City of Nueva Segovia, at the mouth of the Cagayan, was founded in the governorship of Ronquillo, when the valley of the Cagayan was first occupied and the Japanese colonists, who had settled there, were expelled.",
            "It had at the beginning of the seventeenth century two hundred Spaniards, living in houses of wood.",
            "There was a fort of stone, where some artillery was mounted.",
            "Besides the two hundred Spanish inhabitants there were one hundred regular Spanish soldiers, with their officers and the alcalde mayor of the province.",
            "Nueva Segovia was also the seat of a bishopric which included all northern Luzon.",
            "The importance of the then promising city has long ago disappeared, and the pueblo of Lallo, which marks its site, is an insignificant native town."
        ],
        [
            "^ Convicts or Conquistadores?",
            "Spanish Soldiers in the Seventeenth-Century Pacific By Stephanie J. Mawson AGI, México, leg.",
            "25, núm.",
            "62; AGI, Filipinas, leg.",
            "8, ramo 3, núm.",
            "50; leg.",
            "10, ramo 1, núm.",
            "6; leg.",
            "22, ramo 1, núm.",
            "1, fos.",
            "408 r –428 v ; núm.",
            "21; leg.",
            "32, núm.",
            "30; leg.",
            "285, núm.",
            "1, fos.",
            "30 r –41 v ."
        ],
        [
            "^ a b De Yro, Benjie S. (January 30, 2012).",
            "\"Document to back Lal-lo cityhood restoration found\".",
            "Tawid News Magazine.",
            "Retrieved July 23, 2020."
        ],
        [
            "^ \"Spanish-era Cagayan city bids to regain cityhood\".",
            "Philstar.com.",
            "May 16, 2011.",
            "Retrieved July 23, 2020."
        ],
        [
            "^ \"Palace names four more Edca sites\".",
            "Inquirer.",
            "Retrieved 16 April 2023."
        ],
        [
            "^"
        ],
        [
            "\"Lal-lo, Cagayan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 15 December 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cagayan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2022 National and Local Elections\".",
            "ABS-CBN News.",
            "Retrieved November 14, 2023."
        ],
        [
            "^ \"History of DepED SDO Cagayan\".",
            "DepED SDO Cagayan | Official Website of DepED SDO Cagayan.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Lal-lo."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Lal-lo"
        ],
        [
            "Camalaniugan / Buguey / Santa Teresita"
        ],
        [
            "Gonzaga"
        ],
        [
            "Allacapan"
        ],
        [
            "Lal-Lo"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Lasam"
        ],
        [
            "Gattaran"
        ],
        [
            "vte Province of CagayanTuguegarao (capital and largest city)Municipalities"
        ],
        [
            "Abulug"
        ],
        [
            "Alcala"
        ],
        [
            "Allacapan"
        ],
        [
            "Amulung"
        ],
        [
            "Aparri"
        ],
        [
            "Baggao"
        ],
        [
            "Ballesteros"
        ],
        [
            "Buguey"
        ],
        [
            "Calayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "Claveria"
        ],
        [
            "Enrile"
        ],
        [
            "Gattaran"
        ],
        [
            "Gonzaga"
        ],
        [
            "Iguig"
        ],
        [
            "Lal-lo"
        ],
        [
            "Lasam"
        ],
        [
            "Pamplona"
        ],
        [
            "Peñablanca"
        ],
        [
            "Piat"
        ],
        [
            "Rizal"
        ],
        [
            "Sanchez Mira"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Solana"
        ],
        [
            "Tuao"
        ],
        [
            "Component city"
        ],
        [
            "Tuguegarao"
        ],
        [
            "BarangaysSee: List of barangays in Cagayan"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Lal-lo&oldid=1208919499\""
        ],
        [
            "Categories: Municipalities of CagayanPopulated places on the Rio Grande de CagayanFormer provincial capitals of the PhilippinesFormer cities in the Philippines1581 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ibanag-language textArticles containing Ilocano-language textArticles containing Tagalog-language textAll articles with vague or ambiguous timeVague or ambiguous time from April 2023All articles with unsourced statementsArticles with unsourced statements from April 2023Wikipedia articles in need of updating from April 2023All Wikipedia articles in need of updatingArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}