{
    "name": "Lantapan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Lantapan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°00′00″N 125°01′24″E﻿ / ﻿8°N 125.0233°E﻿ / 8; 125.0233"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Lantapan\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesLantapanMunicipalityMunicipality of LantapanMunicipal hall"
        ],
        [
            "FlagSealNickname: Heart of BukidnonMap of Bukidnon with Lantapan highlightedOpenStreetMapLantapanLocation within the PhilippinesCoordinates: 8°00′00″N 125°01′24″E﻿ / ﻿8°N 125.0233°E﻿ / 8; 125.0233CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "2nd districtFoundedJune 18, 1968Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorErnie R. Devibar • Vice MayorSulpicio D. Gallano Jr. • RepresentativeJonathan Keith T. Flores • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ricky James D. BalansagAbraham C. RubioPastor M. AdlaoRoby Kitz A. BucagDarven Glenn K. BelicanKirk Clyde L. AlsulaShela Mae I. CamarintaIluminada D. Altomera"
        ],
        [
            " • Electorate39,698 voters (2022)Area • Revenue₱ 241.5 million (2020) • Assets₱ 814.6 million (2020) • Expenditure₱ 206.3 million (2020) • Liabilities₱ 255.4 million (2020)Service provider • ElectricityBukidnon 2 Electric Cooperative (BUSECO)Time zoneUTC+8 (PST)ZIP code8722PSGC101310000IDD : area code +63 (0)88Native languagesBinukid Cebuano Ata Manobo TagalogWebsitewww.lantapanbuk.gov.ph"
        ],
        [
            "Lantapan, officially the Municipality of Lantapan (Bukid and Higaonon: Banuwa ta Lantapan; Cebuano: Lungsod sa Lantapan; Tagalog: Bayan ng Lantapan), is a 1st class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 65,974 people."
        ],
        [
            "Lantapan is known as the “vegetable basket” of Mindanao."
        ],
        [
            "It used to be a barrio of Malaybalay until its creation, by virtue of Republic Act No.",
            "4787 enacted on June 18, 1968, as a separate municipality."
        ],
        [
            "Geography"
        ],
        [
            "The town is on a plateau in the heart of Bukidnon, situated between the Kalatungan and Kitanglad Mountain Ranges, after which its native name of \"lantapan\" was derived which means \"level-on-top\"."
        ],
        [
            "Lantapan is bounded on the north by the municipalities of Sumilao and Impasugong; east by Malaybalay City; south by Valencia City; and west by Talakag.",
            "It lies above sea level at an average of 600 metres (2,000 ft) and a maximum of 2,938 metres (9,639 ft) of the Kitanglad range."
        ],
        [
            "It has an aggregate area of 318.2 km2, mostly agriculture and forest lands.",
            "It has six river channels and 40 creeks and springs traversing across different points in the landscape.",
            "Lantapan is strategically located between two cities of Bukidnon, Malaybalay and Valencia.",
            "It can be reached via Aglayan crossing, which is a potential convergent zone of four cities: Iligan, Butuan, Davao and Cagayan de Oro."
        ],
        [
            "Barangays"
        ],
        [
            "Lantapan is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Political map of Lantapan showing its barangays"
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101310001   Alanib"
        ],
        [
            " 9.8%"
        ],
        [
            " 6,436"
        ],
        [
            " 5,811"
        ],
        [
            "  ▴"
        ],
        [
            " 1.03%"
        ],
        [
            " 101310002   Baclayon"
        ],
        [
            " 2.9%"
        ],
        [
            " 1,881"
        ],
        [
            " 1,734"
        ],
        [
            "  ▴"
        ],
        [
            " 0.82%"
        ],
        [
            " 101310003   Balila"
        ],
        [
            " 5.7%"
        ],
        [
            " 3,747"
        ],
        [
            " 3,633"
        ],
        [
            "  ▴"
        ],
        [
            " 0.31%"
        ],
        [
            " 101310004   Bantuanon"
        ],
        [
            " 9.3%"
        ],
        [
            " 6,130"
        ],
        [
            " 5,671"
        ],
        [
            "  ▴"
        ],
        [
            " 0.78%"
        ],
        [
            " 101310005   Basak"
        ],
        [
            " 5.1%"
        ],
        [
            " 3,373"
        ],
        [
            " 3,052"
        ],
        [
            "  ▴"
        ],
        [
            " 1.00%"
        ],
        [
            " 101310006   Bugcaon"
        ],
        [
            " 8.2%"
        ],
        [
            " 5,412"
        ],
        [
            " 5,182"
        ],
        [
            "  ▴"
        ],
        [
            " 0.44%"
        ],
        [
            " 101310007   Ka‑atoan (Kaatuan)"
        ],
        [
            " 2.7%"
        ],
        [
            " 1,775"
        ],
        [
            " 1,624"
        ],
        [
            "  ▴"
        ],
        [
            " 0.89%"
        ],
        [
            " 101310008   Capitan Juan"
        ],
        [
            " 3.3%"
        ],
        [
            " 2,156"
        ],
        [
            " 1,805"
        ],
        [
            "  ▴"
        ],
        [
            " 1.79%"
        ],
        [
            " 101310009   Cawayan"
        ],
        [
            " 4.1%"
        ],
        [
            " 2,710"
        ],
        [
            " 2,631"
        ],
        [
            "  ▴"
        ],
        [
            " 0.30%"
        ],
        [
            " 101310010   Kulasihan"
        ],
        [
            " 9.8%"
        ],
        [
            " 6,433"
        ],
        [
            " 5,565"
        ],
        [
            "  ▴"
        ],
        [
            " 1.46%"
        ],
        [
            " 101310011   Kibangay"
        ],
        [
            " 11.9%"
        ],
        [
            " 7,867"
        ],
        [
            " 7,107"
        ],
        [
            "  ▴"
        ],
        [
            " 1.02%"
        ],
        [
            " 101310012  Poblacion"
        ],
        [
            " 12.2%"
        ],
        [
            " 8,025"
        ],
        [
            " 7,142"
        ],
        [
            "  ▴"
        ],
        [
            " 1.17%"
        ],
        [
            " 101310013   Songco"
        ],
        [
            " 5.7%"
        ],
        [
            " 3,737"
        ],
        [
            " 3,236"
        ],
        [
            "  ▴"
        ],
        [
            " 1.45%"
        ],
        [
            " 101310014   Victory"
        ],
        [
            " 3.2%"
        ],
        [
            " 2,094"
        ],
        [
            " 1,741"
        ],
        [
            "  ▴"
        ],
        [
            " 1.86%"
        ],
        [
            "Total"
        ],
        [
            "65,974"
        ],
        [
            "55,934"
        ],
        [
            " ▴"
        ],
        [
            "1.66%"
        ],
        [
            "Flora and fauna"
        ],
        [
            "Lantapan's virgin forests are home to a diverse variety of flora and fauna.",
            "There are orchids, berries, pitcher plants, lichens, and a host of other wild flowers.",
            "A number of mammal species also thrive in the dense forests, including squirrels, monkeys, bats, flying lemurs, deer, tarsiers and wild pigs among others.",
            "The Philippine eagle (Pithecophaga jefferyi) along with other bird species such as the serpent eagle and sparrow hawk takes its home within the Mt.",
            "Kitanglad Range."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lantapan, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(78)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "118(4.6)"
        ],
        [
            "73(2.9)"
        ],
        [
            "66(2.6)"
        ],
        [
            "74(2.9)"
        ],
        [
            "175(6.9)"
        ],
        [
            "261(10.3)"
        ],
        [
            "271(10.7)"
        ],
        [
            "281(11.1)"
        ],
        [
            "267(10.5)"
        ],
        [
            "258(10.2)"
        ],
        [
            "164(6.5)"
        ],
        [
            "93(3.7)"
        ],
        [
            "2,101(82.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.0"
        ],
        [
            "13.8"
        ],
        [
            "12.4"
        ],
        [
            "13.1"
        ],
        [
            "24.2"
        ],
        [
            "27.6"
        ],
        [
            "28.9"
        ],
        [
            "28.5"
        ],
        [
            "27.1"
        ],
        [
            "27.4"
        ],
        [
            "21.0"
        ],
        [
            "16.1"
        ],
        [
            "256.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "The climatic condition of Lantapan is relatively cool and humid for Philippine standards with winds blowing at a northward direction.",
            "The temperature around noon tends to be 5-7 °C cooler than nearby coastal areas to the north.",
            "November to April is relatively dry and May brings the start of the rains which continue 'til October.",
            "Mountains of neighboring towns in the north protect it from cyclone storms."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LantapanYearPop.±% p.a.1970 14,523—    1975 20,006+6.63%1980 22,678+2.54%1990 33,581+4.00%1995 36,943+1.80%2000 42,383+2.99%2007 51,406+2.70%2010 55,934+3.12%2015 61,776+1.91%2020 65,974+1.30%Source: Philippine Statistics Authority"
        ],
        [
            "The main religion of the Visayas and Luzon migrants is Roman Catholicism as evident in this chapel located in Poblacion, Lantapan."
        ],
        [
            "In the 2020 census, the population of Lantapan was 65,974 people, with a density of 200 inhabitants per square kilometre or 520 inhabitants per square mile."
        ],
        [
            "Originally, the Talaandig were the main inhabitants of Lantapan.",
            "Then, migrants from the Visayas and northern Luzon started to settle in the area, even during the Spanish colonial period.",
            "More inflow took place after the Second World War.",
            "This stream of settlers eventually led to the varied mix of ethnic groups in Lantapan.",
            "Visayan is the predominant language, followed by Binukid.",
            "2010 Census showed Lantapan's population have reached 55,934 with the Poblacion as the most populated barangay.",
            "Its population growth rate between 1980 and 1990 of 4.18% was well above the national rate of 2.3 percent."
        ],
        [
            "The Talaandig (one of the 7 Indigenous peoples of Bukidnon) ancestral territory includes Barangay Songco, where there are attempts to preserve Indigenous ways and customary law.",
            "A school for living tradition was built to teach the young the traditional Talaandig way of life, including its history, rituals, music, arts, embroidery, dance, and literature.",
            "Other activities involved earth paintings (painting utilizing soil as a medium), singing and dancing to traditional music, and making musical instruments and Indigenous accessories among others."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Lantapan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  43.70"
        ],
        [
            "2009  40.81"
        ],
        [
            "2012  48.96"
        ],
        [
            "2015  48.27"
        ],
        [
            "2018  33.90"
        ],
        [
            "2021  38.13"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Cassava chips and corn being dried in the community solar dryer.",
            "Lantapan's economy is basically agri-based."
        ],
        [
            "Agriculture"
        ],
        [
            "Further information: Agriculture in the Philippines"
        ],
        [
            "Lantapan has agriculture-based economy.",
            "Farming has remained a dominant economic activity among the Lantapanons.",
            "The major crops grown are corn, coffee, cabbage and potatoes, sugarcane and other high valued crops and bananas also becoming an important commercial crop."
        ],
        [
            "Lantapan is also home to two banana plantations: the Mount Kitanglad Agri-Ventures Inc. (MKAVI) and the Dole Banana Plantation with thousands of hectares of lands in the highland-barangays of the town planted with export quality bananas.",
            "The plantations started their operation in 1998 with thousand of residents of the municipality employed."
        ],
        [
            "Commerce"
        ],
        [
            "There are 428 commercial establishments registered at the Licensing Division of the municipality, 15 of which are classified under agro-industrial, manufacturing and servicing.",
            "Trading activities include wholesale buying of corn, coffee and vegetables by traders from within Lantapan, neighboring towns in Bukidnon and Cagayan de Oro."
        ],
        [
            "Finance"
        ],
        [
            "For finance, the informal credit or \"suki\" system prevails.",
            "In this arrangement, the trader is usually the \"suki\" who provides credit too and buys the products of the farmer.",
            "A few cooperatives in some barangays also extend small loans to their members.",
            "An Asian Hills Bank located at the Poblacion and established in 1978, is owned by a private corporation.",
            "Its portfolio includes agricultural, commercial and real estate loans."
        ],
        [
            "Tourism"
        ],
        [
            "Kitanglad Mountain Range as viewed from Songco"
        ],
        [
            "Kitanglad Mountain Range"
        ],
        [
            "The Kitanglad Mountain Range is a very significant landmark in the cultural history of the Indigenous peoples of Bukidnon with Mount Dulang-dulang considered as a sacred place.",
            "Being an ancestral domain, permission to enter must be secured from the tribal leaders of the Talaandig people of Lantapan in deference to the Free, Prior and Informed Consent (FPIC) mandated by the Indigenous Peoples' Rights Act."
        ],
        [
            "The long trek to Mount Dulang-dulang’s summit goes through virgin dense forests, home to old trees covered with moss and lichens.",
            "At the highest peak, there is a panoramic view of the entire Kitanglad range, and on clear days, the distant Mount Apo.",
            "Sitio Bol-ogan in Barangay Songco of Lantapan is the shortest route towards the major start point to the peaks of Mount Kitanglad (with an elevation of 2,938 metres (9,639 ft) above sea level) and Mount Dulang-dulang (with an elevation of 2,987 metres (9,800 ft) above sea level) which is the country’s second-highest mountain, next to Mount Apo at 3,144 metres (10,315 ft) above sea level"
        ],
        [
            "Cinchona Forest Reserve"
        ],
        [
            "The Cinchona Forest Reserve was established through a presidential proclamation in 1936, and now forms part of the protected area of the Mount Kitanglad Range Natural Park.",
            "It is home to the Cinchona Plantation, established at Barangay Kaatuan in 1929, and said to be the only of its kind left in Asia and the Pacific where the medicinal plant Cinchona (Cinchona ledgeriana) is grown.",
            "Cinchona, is a medium-sized tropical tree that can grow up 24 metres (79 ft) with a 60 centimetres (24 in) diameter, is a source of quinine that is used for malaria treatment.",
            "The farm covers an area of 1,725 hectares (4,260 acres) where 7 Cinchona tree species are found and is planted mostly with Albizza falcataria (= Falcataria moluccana) and other medicinal trees.",
            "Located 1,140 metres (3,740 ft) above sea level, the area is considered as the coldest place in Bukidnon with temperatures ranging from 13 to 18 °C (55 to 64 °F)."
        ],
        [
            "Binahon Agro-forestry Farm"
        ],
        [
            "The Binahon Agro-forestry Farm, located at Sitio Bol-ogan, Barangay Songco, on the slopes of Mt.",
            "Kitanglad, is a learning institution for farmers, agriculturists, and rural development workers.",
            "Situated some 1,300 metres (4,300 ft) above sea level, it cultivates various forest species such as Caribbean pine trees, lawaan, falcata, abaca, and eucalyptus.",
            "Fruit trees are also planted in the area with vegetables sown in between.",
            "Farm animals such as carabaos, horse, goats, sheep, hogs and other livestock animals are grown in the farm together with honeybees and tilapia.",
            "The farm also offers facilities for lodging to visiting tourists, researchers, scientists and mountaineers."
        ],
        [
            "Barangay Kaatuan is also home to 8 conjoint water falls: 7 water falls pouring its contents onto another water falls.",
            "This conjoint waterfall is supplied by the Kulasihan River, and situated five kilometers from the barangay proper of Kaatuan called Block 2."
        ],
        [
            "Infrastructure"
        ],
        [
            "The municipality of Lantapan has a fairly well-paved road system especially the National Road the runs lengthwise through the municipality."
        ],
        [
            "Health services"
        ],
        [
            "The rural health unit (RHU) maintains one central health unit and 14 barangay health stations.",
            "The RHU provides medical, dental, family planning and laboratory services.",
            "It provides special care and rehabilitation to malnourished children.",
            "One privately owned clinic for urgent care on minor cases and two registered mini-pharmaceutical stores are found in the Poblacion."
        ],
        [
            "Water"
        ],
        [
            "Potable water is distributed through individual installations of 3,958 households.",
            "A feasibility study is being developed for the establishments of an improved and modern water system for Lantapan which entails tapping the Kulasihan and Songco water sources for an estimated flow of 45,018.168 cubic meters per hour."
        ],
        [
            "Security"
        ],
        [
            "Lantapan is generally peaceful.",
            "Security in the area is ably maintained by the local police force.",
            "Trained civilian forces, the \"Bantay-Bayan\" and the Civilian Volunteer Organization (CVO) in the barangays also provide support to crime prevention."
        ],
        [
            "Education"
        ],
        [
            "Presently, there is a total of 24 primary, elementary and secondary schools in Lantapan.",
            "These schools serve approximately 7,000 children.",
            "Day care centers under the Department of Social Welfare and Development provide preparatory education to pre-schoolers in the barangays."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Lantapan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Lantapan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved April 29, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Lantapan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Lantapan"
        ],
        [
            "Mount Kitanglad"
        ],
        [
            "Malaybalay"
        ],
        [
            "Talakag"
        ],
        [
            "Lantapan"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Lantapan&oldid=1214131704\""
        ],
        [
            "Category: Municipalities of BukidnonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesUse Philippine English from April 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}