{
    "name": "Lapuyan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Lapuyan"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°37′57″N 123°11′29″E﻿ / ﻿7.6325°N 123.1914°E﻿ / 7.6325; 123.1914"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Zamboanga del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Lapuyan\" – news · newspapers · books · scholar · JSTOR (August 2010) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Zamboanga Peninsula, PhilippinesLapuyanMunicipalityMunicipality of Lapuyan"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "Subanen Land"
        ],
        [
            "Culture-Friendly Municipality"
        ],
        [
            "Little America"
        ],
        [
            "Motto: Dlepuyan sampay nawanMap of Zamboanga del Sur with Lapuyan highlightedOpenStreetMapLapuyanLocation within the PhilippinesCoordinates: 7°37′57″N 123°11′29″E﻿ / ﻿7.6325°N 123.1914°E﻿ / 7.6325; 123.1914CountryPhilippinesRegionZamboanga PeninsulaProvinceZamboanga del SurDistrict"
        ],
        [
            "2nd districtFoundedOctober 16, 1957Barangays26"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJoel B. Sulong • Vice MayorDaylinda P. Sulong • RepresentativeLeonardo L. Babasa Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Morvin G. FernandezRicardo M. Duhaylungsod Sr.Alejo D. Sigba Jr.Abdulmajid M. SheikReniel B. HuminisAbner D. Lusay Jr.Apolonio T. CambedRowe B. Tan"
        ],
        [
            " • Electorate17,033 voters (2022)Area"
        ],
        [
            " • Revenue₱ 154.4 million (2020) • Assets₱ 564.2 million (2020) • Expenditure₱ 123.2 million (2020) • Liabilities₱ 192.1 million (2020)Service provider • ElectricityZamboanga del Sur 1 Electric Cooperative (ZAMSURECO 1)Time zoneUTC+8 (PST)ZIP code7037PSGC097313000IDD : area code +63 (0)62Native languagesSubanon Cebuano Chavacano Tagalog  MaguindanaonWebsitewww.lapuyan.gov.ph"
        ],
        [
            "Lapuyan (Cebuano: Lungsod sa Lapuyan; Subanen: Benwa Dlepuyan; Maguindanaon: Inged nu Lapuyan, Jawi: ايڠد نو لڤوين; Chavacano: Municipalidad de Lapuyan; Tagalog: Bayan ng Lapuyan), is a 3rd class municipality in the province of Zamboanga del Sur, Philippines."
        ],
        [
            "According to the 2020 census, it has a population of 27,737 people.",
            "The municipality of Lapuyan is located in the southern section of the Zamboanga del Sur province.",
            "It is also often referred to as \"Little America\"."
        ],
        [
            "History"
        ],
        [
            "Lapuyan was created by separating the barrios of Lapuyan, Maruing, Kumalarang, Karpok, and Timbang, all of the municipality of Margosatubig and formed into a regular municipality by virtue of Executive Order No.",
            "273 on October 16, 1957, by President Carlos P. Garcia upon the recommendation of Sen. Roseller T. Lim, Gov.",
            "Bienvenido Ebarle and the Provincial Board of Zamboanga del Sur.",
            "The municipality was formally inaugurated on April 21, 1958, with the induction into office of the following municipal officials: Mayor Coco I. Sia, Vice Mayor Bayang Guiaya, Councilors Dr. Vicente Imbing, Datu Manupak Dakula, Benigno Bualan, Javier Suico, Catalino Fernandez and Canuto Lingating."
        ],
        [
            "Upon creation into a regular municipality, the existing barrios within its jurisdiction were Poblacion, Kumalarang, Maruing, Carpok, Bulawan, Lakewood and Sayog."
        ],
        [
            "Geography"
        ],
        [
            "Lapuyan covers an area of 32,900 hectares (81,298 acres) of land, located on the northern shore of Dumanquilas Bay, bounded on the east by the municipality of San Miguel, on the west by Dumanquilas Bay and the municipalities of Malangas, Buug and Kumalarang, to the north by the municipalities of Lakewood and Tigbao, and on the south by Dumanquilas Bay and the municipality of Margosatubig, all in Zamboanga del Sur."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lapuyan, Zamboanga del Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "22(0.9)"
        ],
        [
            "18(0.7)"
        ],
        [
            "23(0.9)"
        ],
        [
            "24(0.9)"
        ],
        [
            "67(2.6)"
        ],
        [
            "120(4.7)"
        ],
        [
            "132(5.2)"
        ],
        [
            "156(6.1)"
        ],
        [
            "119(4.7)"
        ],
        [
            "124(4.9)"
        ],
        [
            "54(2.1)"
        ],
        [
            "24(0.9)"
        ],
        [
            "883(34.6)"
        ],
        [
            "Average rainy days"
        ],
        [
            "9.4"
        ],
        [
            "9.1"
        ],
        [
            "11.5"
        ],
        [
            "11.9"
        ],
        [
            "20.1"
        ],
        [
            "22.5"
        ],
        [
            "22.4"
        ],
        [
            "23.2"
        ],
        [
            "21.5"
        ],
        [
            "22.2"
        ],
        [
            "15.7"
        ],
        [
            "11.5"
        ],
        [
            "201"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Lapuyan is politically subdivided into 26 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Bulawan"
        ],
        [
            "Danganan"
        ],
        [
            "Dansal"
        ],
        [
            "Dumara"
        ],
        [
            "Karpok"
        ],
        [
            "Lenok Madalum"
        ],
        [
            "Luanan"
        ],
        [
            "Lubusan"
        ],
        [
            "Mahalingeb"
        ],
        [
            "Mandeg"
        ],
        [
            "Maralag"
        ],
        [
            "Maruing"
        ],
        [
            "Molum"
        ],
        [
            "Pampang"
        ],
        [
            "Pantad"
        ],
        [
            "Pingalay"
        ],
        [
            "Poblacion"
        ],
        [
            "Salambuyan"
        ],
        [
            "San Jose"
        ],
        [
            "Sayog"
        ],
        [
            "Tabon"
        ],
        [
            "Talabob"
        ],
        [
            "Tiguha"
        ],
        [
            "Tininghalang"
        ],
        [
            "Tipasan"
        ],
        [
            "Tugaya"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LapuyanYearPop.±% p.a.1960 13,594—    1970 15,642+1.41%1975 16,845+1.50%1980 18,267+1.63%1990 20,861+1.34%1995 23,512+2.27%2000 24,366+0.77%2007 26,118+0.96%2010 26,175+0.08%2015 27,264+0.78%2020 27,737+0.34%Source: Philippine Statistics Authority"
        ],
        [
            "Languages"
        ],
        [
            "Subanen, Cebuano,  Maguindanaon, Chavacano, Tagalog/Filipino, English"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Lapuyan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  37.60"
        ],
        [
            "2009  53.04"
        ],
        [
            "2012  58.66"
        ],
        [
            "2015  53.09"
        ],
        [
            "2018  40.99"
        ],
        [
            "2021  43.46"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Upon the municipality's inauguration on April 21, 1958, the first appointed mayor was Mayor Coco Imbing Sia (nephew of Datu Lumok Imbing) and the first appointed Vice Mayor was Bayang Guiaya.",
            "The first appointed municipal councilors were Dr. Vicente Imbing, Datu Maneped Dakula, Benigno Bualan, Javier Suico, Canuto Lingating, and Catalino Fernandez.",
            "The first appointed municipal officials served for two years from 1957 to 1959."
        ],
        [
            "In the local elections of 1959, the first elected municipal officials were Mayor Coco I. Sia, Vice Mayor Fausto H. Imbing, Councilors Felicidad M. Minor, Dr. Vicente L. Imbing, and four others; they served from 1960 to 1963."
        ],
        [
            "Below is a list of municipal officials who served as mayors and vice mayors of the municipality of Lapuyan."
        ],
        [
            "1957–1959: Mayor Coco Imbing Sia with Vice Mayor Bayang Guiaya"
        ],
        [
            "1960–1963: Mayor Coco I. Sia with Vice Mayor Fausto H. Imbing"
        ],
        [
            "1964–1967: Mayor Mahalambas D. Huminis with Vice Mayor Consing Bugao"
        ],
        [
            "1968–1971: Mayor Coco Sia with Vice Mayor Jesusa Fernandez"
        ],
        [
            "1972–1975: Mayor Coco Sia with Vice Mayor Quensilan Sulong"
        ],
        [
            "1975–1979: Mayor Quensilan Sulong and Vice Mayor Catalino Bugao, martial law, KBL"
        ],
        [
            "1980–1986: Mayor Dr. Manasi Banghulot and Vice Mayor Lorenzo Sia (assassinated 1985, succeeded by Vice Mayor Miguel D. Villena)"
        ],
        [
            "1987–1988: Mayor Quensilan Sulong with Vice Mayor John Tan Manghay interim"
        ],
        [
            "1988–1991: Mayor Cesar Sulong with Vice Mayor Dr. Vicente Imbing"
        ],
        [
            "1992–1995: Mayor Cesar Sulong with Vice Mayor Romeo Tan (died 1993, succeeded by Vice Mayor Roland H. Lusay)"
        ],
        [
            "1995–1998: Mayor Cesar Sulong with Vice Mayor Roland Lusay"
        ],
        [
            "1998–2001: Mayor Daylinda Sulong with Vice Mayor Berdal Amban"
        ],
        [
            "2001–2004: Mayor Cesar Sulong with Vice Mayor Joel Sulong"
        ],
        [
            "2004–2007: Mayor Cesar Sulong with Vice Mayor Joel Sulong"
        ],
        [
            "2007–2010: Mayor Daylinda P. Sulong with Vice Mayor Joel Sulong"
        ],
        [
            "2010–2013: Mayor Daylinda P. Sulong with Vice Mayor Vicente Mong Fernandez Jr."
        ],
        [
            "2013-2016: Mayor Daylinda P. Sulong with Vice Mayor Joel B. Sulong"
        ],
        [
            "2016-2019: Mayor Joel B. Sulong with Vice Mayor Daylinda P. Sulong"
        ],
        [
            "Subanen heritage"
        ],
        [
            "Main article: Subanon people"
        ],
        [
            "During the Spanish regime, the Subanens were a thriving tribe in the hinterlands of Western Mindanao that had not been conquered by the Spanish colonists, who had their hands full waging wars with the Moros in the South.",
            "The ancestral Subanen domains were in the Pingolis and Dumangkilas areas.",
            "In the olden times, Pingolis consisted of the areas of Misamis Occidental, Zamboanga del Sur and Zamboanga del Norte.",
            "Dumangkilas consisted of Margosatubig up to the Dinas and Dimataling areas.",
            "The Spaniards came upon these places almost at the close of the 18th century but were never able to build a permanent settlement, only bayside watchtowers for any upcoming pirate attacks, in Margosatubig and Tukuran, Zamboanga del Sur, and in the shores of Misamis, now Ozamiz City."
        ],
        [
            "Gumabongabon, a native of Cotabato, sought refuge in Mount Malindang in Misamis province to flee from the Muslim faith of Salipabunsuan (Shariff Kabunsuan).",
            "He had two sons named Dageneg and Daginding.",
            "The younger brother Daginding took over the Subanen leadership from his aging father Gumabongabon.",
            "Throughout his lifetime Gumabongabon was never conquered or subjugated either by the Muslim or Christian faith by remaining in the jungles with his family and those that continued his leadership."
        ],
        [
            "Daginding, the surviving son of Gumabongabon, is said to be the origin of the Imbings in Lapuyan.",
            "Daginding bore a son named Baless who took over the leadership from Daginding.",
            "Baless bore a son named Baan, then Baan begat Paluli, who also begat a son named Habali who begat Bongulan, who bore a son named Pamaisen.",
            "The latter also bore a son named Samaya, who bore a son named Lihaiwan, who bore a son named Sanira.",
            "It was at the time of the leadership of Sanira that he transferred his place to Salug Valley, now Molave town.",
            "There he met and married a wife from Dumangkilas, now Margosatubig, Zamboanga Del Sur.",
            "Sanira bore four children, triplets – two boys and one girl.",
            "The triplets were called Palaganding, Dainding, and Gumaed.",
            "The only girl was named Balao.",
            "Among the triplets, Palaganding became the leader after his father Sanira.",
            "He was the most feared Subanon leader.",
            "He ate his enemies' hearts raw after every battle."
        ],
        [
            "Palaganding married a girl from Pingoles and bore four sons, named Lumang, Mandaulay, Sandok and Talatap, and one daughter named Sinumpay.",
            "Son Talatap and daughter Sinumpay were kidnapped by pirates when they were fishing in Dumangkilas bay.",
            "Sinumpay was sold by the pirates to a Hadji Usah in Jolo, who married her and became a Muslim.",
            "Talatap's fate is not known."
        ],
        [
            "Palaganding's eldest son Lumang took over the leadership of the Subanens when he died.",
            "Lumang bore three sons and two daughters.",
            "He named his sons Mandal, Bahong, and Imbing.",
            "He named his daughters Ames and Amog."
        ],
        [
            "Lumang's youngest son, Imbing, took over the leadership of the Subanens during the American regime.",
            "It was during this time that his victorious battle of Mount Guillian took place against the Iranons.",
            "Mount Imbing was named by American Governor-General Leonard Wood, who happened to stay with Timuay Beng Imbing on his way to Lakewood, where he saw a lake while flying during World War I.",
            "The lake was so beautiful surrounded by trees that General Wood named it Lakewood.",
            "Today, Lakewood is already a municipality which was a former barangay of Lapuyan, Zamboanga del Sur."
        ],
        [
            "Timuay Labi (highest) Beng Imbing bore six children — three boys and three girls.",
            "He named his boys Calay, Lumok and Purok, all with a title of Datu.",
            "He named his girls Calat, Calangian and the last Sindium.",
            "The last Subanen Datu among the Subanens was Datu Purok Imbing.",
            "After him, there was no more anointment.",
            "The American missionaries were already in Lapuyan and the saga of the Datus and Timuays ended its cruel and happy days."
        ],
        [
            "Subanens and Christianity"
        ],
        [
            "In the olden days, the Subanens did not have schools; parents were in charge of schooling them.",
            "In a family of singers, the mother or the father sang Subanen epics and poems, and read legends and stories.",
            "Mothers trained their daughters to weave abaca cloth; the father usually trained their son to do wood carvings or weave rattan baskets and to make musical instruments out of bamboo and wood."
        ],
        [
            "When they came into contact with the Muslims, they learned about the teachings of Islam.",
            "Subanens of Lapuyan had early contact with the Spaniards who built a garrison in Margosatubig during the mid-19th century; a school for the natives was opened by Spanish priests but the Subanens misunderstood the message of Christianity.",
            "They were scared to see a stick (the cross) with a dead man (Jesus) on it.",
            "The cross, which they called \"karehus\", was interpreted differently; the early Catholic missionaries were thought of as cannibals.",
            "With the coming of the Americans, Protestant missionaries brought big picture rolls showing among others, the baby Jesus and the Mother Mary.",
            "The old folks associated these stories with their own tribal beliefs of a “Diwata” or God-child, a savior of mankind.",
            "With this understanding, Subanen elders now encouraged their children to go to the mission school run by these American missionaries.",
            "In 1912, Mr. & Mrs. David O. Lund opened a mission school in Sunglupa in the village of Thimuay Imbing, now a part of the Municipality of Lapuyan.",
            "Thimuay Imbing accepted the new religion, a Protestant denomination of the Christian and Missionary Alliance whose headquarters were located in Nyac, New York, in 1914; they constructed a semi-permanent-building called the Pampang Tabernacle where the Subanen worshipped.",
            "Next to the Tetuan Church in Zamboanga City, the Lapuyan Tabernacle became the first Alliance Church in Mindanao, if not the entire Philippines.",
            "There were further changes in the way of life of the Subanen in Lapuyan with the opening of government schools in 1919."
        ],
        [
            "Education"
        ],
        [
            "Colleges"
        ],
        [
            "Lomasson Alliance Bible College"
        ],
        [
            "Josephina H. Cerilles State College-Lapuyan External Studies Unit"
        ],
        [
            "High schools"
        ],
        [
            "Lapuyan National High School"
        ],
        [
            "Maruing National High School"
        ],
        [
            "Bulawan National High School"
        ],
        [
            "Tiguha National High School"
        ],
        [
            "Maralag National High School"
        ],
        [
            "Karpok National High School"
        ],
        [
            "Pampang National High School"
        ],
        [
            "Elementary schools"
        ],
        [
            "Antonio V. Apostol Memorial Central Elementary School"
        ],
        [
            "Karpok Elementary School"
        ],
        [
            "Bulawan Elementary School"
        ],
        [
            "Maruing Elementary School"
        ],
        [
            "Danganan Elementary School"
        ],
        [
            "Mala-Tiguha Elementary School"
        ],
        [
            "Dansal Elementary School"
        ],
        [
            "Lenok Madalum Elementary School"
        ],
        [
            "Luanan Elementary School"
        ],
        [
            "Lubosan Elementary School"
        ],
        [
            "Mandeg Elementary School"
        ],
        [
            "Maralag Elementary School"
        ],
        [
            "Molum Elementary School"
        ],
        [
            "Pampang Elementary School"
        ],
        [
            "Pantad Elementary School"
        ],
        [
            "Pingalay Elementary School"
        ],
        [
            "Salambuyan Elementary School"
        ],
        [
            "San Jose Elementary School"
        ],
        [
            "Sayog Elementary School"
        ],
        [
            "Tininghalang Elementary School"
        ],
        [
            "Tipasan Elementary School"
        ],
        [
            "Talabob Elementary School"
        ],
        [
            "Cubo Elementary School"
        ],
        [
            "Dumara Elementary School"
        ],
        [
            "Mahalingeb Primary School"
        ],
        [
            "Tabon Primary School"
        ],
        [
            "Tugaya Primary School"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Lapuyan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "273: Creating the Municipality of Lapuyan in the Province of Zamboanga del Sur\".",
            "Official Gazette of the Republic of the Philippines.",
            "Manila, Philippines: Presidential Communications Development and Strategic Planning Office.",
            "October 16, 1957.",
            "Retrieved 22 July 2014."
        ],
        [
            "^"
        ],
        [
            "\"Lapuyan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 1 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IX (Zamboanga Peninsula)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Zamboanga del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"About Lapuyan: Facts and Profile\".",
            "lapuyan.gov.ph.",
            "Local Government Unit of Lapuyan.",
            "Archived from the original on 2017-02-24.",
            "Retrieved 2017-07-14."
        ],
        [
            "External links"
        ],
        [
            "Lapuyan Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Lapuyan"
        ],
        [
            "Kumalarang"
        ],
        [
            "Lakewood"
        ],
        [
            "Dumanquilas Bay"
        ],
        [
            "Lapuyan"
        ],
        [
            "San Miguel"
        ],
        [
            "Margosatubig"
        ],
        [
            "vte Province of Zamboanga del SurPagadian (capital)  Zamboanga City (largest city)Municipalities"
        ],
        [
            "Aurora"
        ],
        [
            "Bayog"
        ],
        [
            "Dimataling"
        ],
        [
            "Dinas"
        ],
        [
            "Dumalinao"
        ],
        [
            "Dumingag"
        ],
        [
            "Guipos"
        ],
        [
            "Josefina"
        ],
        [
            "Kumalarang"
        ],
        [
            "Labangan"
        ],
        [
            "Lakewood"
        ],
        [
            "Lapuyan"
        ],
        [
            "Mahayag"
        ],
        [
            "Margosatubig"
        ],
        [
            "Midsalip"
        ],
        [
            "Molave"
        ],
        [
            "Pitogo"
        ],
        [
            "Ramon Magsaysay"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pablo"
        ],
        [
            "Sominot"
        ],
        [
            "Tabina"
        ],
        [
            "Tambulig"
        ],
        [
            "Tigbao"
        ],
        [
            "Tukuran"
        ],
        [
            "Vincenzo A. Sagun"
        ],
        [
            "Component city"
        ],
        [
            "Pagadian"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Zamboanga City (Administratively independent and geographically separate from the province but grouped under Zamboanga del Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Lapuyan&oldid=1220830617\""
        ],
        [
            "Categories: Municipalities of Zamboanga del SurPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from August 2010All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Maguindanaon-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}