{
    "name": "Las Navas",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Las Navas"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°20′24″N 125°01′55″E﻿ / ﻿12.34°N 125.032°E﻿ / 12.34; 125.032"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Northern Samar, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Las Navas\" – news · newspapers · books · scholar · JSTOR (April 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesLas Navas"
        ],
        [
            "BinuntuanMunicipalityMunicipality of Las Navas"
        ],
        [
            "FlagMap of Northern Samar with Las Navas highlightedOpenStreetMapLas NavasLocation within the PhilippinesCoordinates: 12°20′24″N 125°01′55″E﻿ / ﻿12.34°N 125.032°E﻿ / 12.34; 125.032CountryPhilippinesRegionEastern VisayasProvinceNorthern SamarDistrict"
        ],
        [
            "2nd districtBarangays53"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorArlito A. Tan • Vice MayorMinda M. Tan • RepresentativeJose L. Ong Jr. • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Florepes A. Lluz• Gil R. Ong• Alvin A. Pajuelas• Vanessa Lym U. Mercader• Melchor B. Oronos• Rufel Y. Golondrina• Antonio J. Casio• Neilmar T. OroncilloDILG Masterlist of Officials"
        ],
        [
            " • Electorate27,730 voters (2022)Area • Revenue₱ 171.7 million (2020) • Assets₱ 429 million (2020) • Expenditure₱ 138.1 million (2020) • Liabilities₱ 131.3 million (2020)Service provider • ElectricityNorthern Samar Electric Cooperative (NORSAMELCO)Time zoneUTC+8 (PST)ZIP code6423PSGC084810000IDD : area code +63 (0)55Native languagesWaray Tagalog"
        ],
        [
            "Las Navas, officially the Municipality of Las Navas (Waray: Bungto han Las Navas; Tagalog: Bayan ng Las Navas), is a 4th class municipality in the province of Northern Samar, Philippines.",
            "According to the 2020 census, it has a population of 36,621 people."
        ],
        [
            "Etymology"
        ],
        [
            "Before the reversion of the municipality to a mere barrio, a certain Spanish Colonel of the Spanish Armed Forces by the name of De Las Navas explored the northern part of Samar.",
            "He sailed with his men upstream Catubig River and reached a place called \"Binongtu-an\".",
            "The people warmly met him as a high-ranking Official of the Spanish Armed Forces with full respect and high regard to the Government."
        ],
        [
            "In his visit to the place, he changed the name \"Binongtu-an\" to Las Navas in his honor and serve as a reminder that a prominent Spanish Army arrived and reached the place.",
            "The people accepted Las Navas as its official name."
        ],
        [
            "History"
        ],
        [
            "During the Spanish regime, one of the municipalities that was recognized as a town is Las Navas, formerly known as \"Bungto\" (meaning town).",
            "Upon recognition, a Parochial Church was constructed with a Parochial Priest as head of the town."
        ],
        [
            "Towards the end of the 18th century, a band of Moro pirates sailed to the river and reached the town.",
            "There, the inhabitants were robbed and the town was burned.",
            "Afraid that the pirates would return again, the people abandoned the town for a period of time."
        ],
        [
            "After several months, the people returned to the place and retrieved all that were left by the fire.",
            "They constructed their homes and reestablished the town and the seat of the government.",
            "As soon as the municipality was reestablished and the community was stabilized, the populace and leaders unanimously agreed to change the town's name from \"Bungto\" (Town) to \"Binongtu–an\" to emphasize and commemorate that the place was once a thriving town, was abandoned because of Moro pirates' assault, and was resettled after sometime."
        ],
        [
            "A research on the history of Las Navas revealed documents from the National Archives, \"Errecion de los Pueblos Samar 1786-1898, Pueblos de Catubig y Binungtuan Tomo\", Exp.",
            "9, pol.",
            "149–197.",
            "Exepediente promovido en 1832 sobre la erreccion de la visita de Binungtuan en pueblo civil independiente de su matriz Catubig en la prov de Samar, Manila, 20 de Dissiembre de 1848."
        ],
        [
            "Geography"
        ],
        [
            "Las Navas is situated in the heart of Samar Island, lying along the Las Navas River (formerly Catubig River).",
            "It comprises a wide lowlands between hills now known as the Catubig Valley.",
            "The Las Navas river is wide and big enough that small tonnage or motored vessels can easily sail to the source of the river.",
            "It is bounded on the north by Catubig, on the east by Jipapad, Eastern Samar, on the west by Silvino Lubos, and on the south by the municipality of Matuguinao and San Jose de Buan, Western Samar (Samar)."
        ],
        [
            "The municipality has a total land area of 28,261 hectares (69,830 acres).",
            "Most of this land is devoted to agricultural production and the rest are forest reserves.",
            "Its soil is predominantly silt and clay loam with fine texture and high water retention.",
            "This soil type is fertile and suitable for lowland rice but needs water drainage for upland crops."
        ],
        [
            "Bodies of water"
        ],
        [
            "Rivers, brooks, creeks can be found practically when hiking from one place to another and traversed by the Las Navas River (formerly Catubig river).",
            "The Las Navas River (formerly Catubig River) is considered the main river, compared to Hinaga River and Hagbay River."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Las Navas, Northern Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "105(4.1)"
        ],
        [
            "67(2.6)"
        ],
        [
            "65(2.6)"
        ],
        [
            "53(2.1)"
        ],
        [
            "86(3.4)"
        ],
        [
            "129(5.1)"
        ],
        [
            "135(5.3)"
        ],
        [
            "113(4.4)"
        ],
        [
            "131(5.2)"
        ],
        [
            "163(6.4)"
        ],
        [
            "167(6.6)"
        ],
        [
            "162(6.4)"
        ],
        [
            "1,376(54.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.6"
        ],
        [
            "13.2"
        ],
        [
            "15.5"
        ],
        [
            "14.9"
        ],
        [
            "19.6"
        ],
        [
            "24.3"
        ],
        [
            "26.6"
        ],
        [
            "25.4"
        ],
        [
            "24.9"
        ],
        [
            "25.4"
        ],
        [
            "22.9"
        ],
        [
            "20.9"
        ],
        [
            "251.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Las Navas is politically subdivided into 53 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Balugo"
        ],
        [
            "Bugay"
        ],
        [
            "Bugtosan"
        ],
        [
            "Bukid"
        ],
        [
            "Bulao"
        ],
        [
            "Caputoan"
        ],
        [
            "Catoto-ogan"
        ],
        [
            "Cuenco"
        ],
        [
            "Dapdap"
        ],
        [
            "Del Pilar"
        ],
        [
            "Dolores"
        ],
        [
            "Epaw"
        ],
        [
            "Geguinta"
        ],
        [
            "Geracdo (also known as F. Robis)"
        ],
        [
            "Guyo"
        ],
        [
            "H. Jolejole District (Poblacion)"
        ],
        [
            "Hangi"
        ],
        [
            "Imelda"
        ],
        [
            "L. Empon"
        ],
        [
            "Lakandula"
        ],
        [
            "Lumala-og"
        ],
        [
            "Lourdes"
        ],
        [
            "Mabini"
        ],
        [
            "Macarthur"
        ],
        [
            "Magsaysay"
        ],
        [
            "Matelarag"
        ],
        [
            "Osmeña"
        ],
        [
            "Paco"
        ],
        [
            "Palanas"
        ],
        [
            "Perez"
        ],
        [
            "Poponton"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Quirino District (Poblacion)"
        ],
        [
            "Rebong"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "Rufino"
        ],
        [
            "Sag-od"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Fernando"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jorge"
        ],
        [
            "San Jose"
        ],
        [
            "San Miguel"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tagab-Iran"
        ],
        [
            "Tagan-ayan"
        ],
        [
            "Taylor"
        ],
        [
            "Victory"
        ],
        [
            "H. Jolejole"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Las NavasYearPop.±% p.a.1960 14,043—    1970 19,925+3.56%1975 23,715+3.55%1980 21,216−2.20%1990 22,017+0.37%1995 25,031+2.43%2000 29,346+3.47%2007 32,197+1.29%2010 36,539+4.71%2015 37,947+0.72%2020 36,621−0.70%Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "Generally, the people speak Waray-Waray language as a common dialect, while English and Pilipino is used only as medium of instructions in schools and other types of communications."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Las Navas"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "2006  58.80"
        ],
        [
            "2009  57.06"
        ],
        [
            "2012  57.49"
        ],
        [
            "2015  62.31"
        ],
        [
            "2018  50.09"
        ],
        [
            "2021  29.48"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The municipality is basically an agricultural area with rice production as a major activity.",
            "However, of the total land area, only 47.33 km2 are planted with rice, while 32.75 km2 are devoted to coconuts.",
            "The remaining areas are planted with abaca with a total of 13.32 km2, and root crops with a total of 5.4 km2.",
            "Livestocks and poultry are considered a major source of livelihood for small farmers and their families.",
            "Other major resources include timber products, tikog and rattan are also abundant, offering such bright prospect for agricultural development and for subsequent industrialization through small and medium scale industries."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "The municipality is readily accessible through navigation along the Catubig river with the use of pump boats and bancas.",
            "The pump boats ply from Las Navas to Catubig daily at PhP 40.00 (US$0.80) per person.",
            "These small boats dock at small docking facilities called \"Look\" in both Catubig and Las Navas.",
            "It only takes 30 minutes to get to Las Navas from Catubig, and boats traverse the river daily, leaving Las Navas at 5:00 a.m. and arrives at around 5:30 a.m. in Catubig (and vice versa)."
        ],
        [
            "Motorboats and bancas are used in going to the different barangays, although hiking is still practiced by many barangay folks in going to and from the Poblacion."
        ],
        [
            "Las Navas today is now connected to the national road system The road and Las Navas bridge was formally inaugurated by President Gloria Mcapagal Arrroyo last June 16, 2009."
        ],
        [
            "Communication facilities"
        ],
        [
            "A Telecom Office and a municipal Post Office are the only major communication facilities of the town.",
            "Both facilities are located in the municipal compound in La Purisima St., Jolejole District."
        ],
        [
            "For long-distance calls or calls outside the province, the residence avail of the communication facilities at Catarman – the capital town.",
            "But nowadays the town also used cellphones."
        ],
        [
            "The town has two cell sites, smart and globe communication.",
            "The internet connection is now available through globe tattoo.",
            "Signal reaches to different barangay in this municipality."
        ],
        [
            "Water supply"
        ],
        [
            "Water works system (Level II) serves the poblacion of Las Navas.",
            "In the barangays, individual households usually obtain water from wells, springs, rain catchment and from the river."
        ],
        [
            "Education"
        ],
        [
            "Education is given emphasis and is the top priority among the programs of the municipality.",
            "Educational facilities include an elementary school district offering all levels (Grades 1 through 6), while 39 barangay primary schools offer limited levels."
        ],
        [
            "It has a complete secondary school which offers agro – industrial technology and basic academic requirements.",
            "Also, Las Navas has a technical-vocational school that is known to be the sole Technical Education and Skills Development Authority's  (TESDA) Administered School in the 2nd District of the Province of Northern Samar, the TESDA-Las Navas Agro-Industrial School (TESDA-LNAIS) that offers eighteen (18) technical-vocational courses registered under the Unified TVET Program Registration and Accreditation System (UTPRAS) being managed by Vivian Abueva Poblete, the Vocational School Administrator II.",
            "Las Navas has also a tertiary school which is the Colegio de Las Navas-the only community college in Northern Samar which is owned and operated by the Local Government Unit of this municipality.",
            "This community college offers free tuition fees to those underprivileged students.",
            "(Leonard Ocino Lluz, Assistant Municipal Assessor/LGU-Las Navas)"
        ],
        [
            "Healthcare"
        ],
        [
            "The municipality is served by a district hospital of the adjacent town of Catubig, but it has its own Rural Health Center in the Poblacion and other barangay Health Stations for health services.",
            "Girlie Drugstore is the only operational pharmacy in the area, located at La Purisima Street, Poblacion."
        ],
        [
            "For health manpower, one rural health Physician serves the area assisted by a rural health nurse, a sanitary inspector, four rural Health Midwives, as well as volunteers for health services known as Barangay Health Workers (SHWS).",
            "It is through this government organization where health care and family planning including immunization are implemented."
        ],
        [
            "Tourism"
        ],
        [
            "Fifteen kilometers from the poblacion area upstream Las Navas River (Catubig River), a famous falls known as the \"Pinipisakan Falls\" towers as the main tourist attraction of the municipality.",
            "The place is easily accessible by motor boats and vehicles if the weather is good (mahuraw)."
        ],
        [
            "Pinipisakan Falls a tourist destination was formally inaugurated as a new tourist destination last August 18, 2009, with the SINP-DENR came for the groundbreaking and inauguration making the place as an ecotourism destination.",
            "Aside from the Pinipisakan Falls, it also has the beautiful lasnavasnon cave located near the 3 km hanging bridge and also the Ginagatusan Lake.",
            "Added to the place is the Las Navas Dam for the irrigation of the Las Navas Valley.",
            "What is new to the poblacion, the ongoing construction of Our Ladys Nativity Church and its rectory.",
            "The Painting of the whole church was the concerned of Mr. Omeng Gudiaga, Right now right the ceiling works and painting is on going and scheduled to be completed before Christmas."
        ],
        [
            "The church development was started by Katarmananon Engr.",
            "Romualdo D. Saises, Municipal Engineer, married to Ma.",
            "Zenaida Robis donated a beautiful altar and the family of Mr. Ricky Lo the statue of the Virgen.",
            "Mr. Jose A. Tan also completed the walling with narra woods makes the altar more beautiful.",
            "Right now lasnavasnon without giving their names donated a large amount of money for the ceiling and the parish priest Fr.",
            "Cleofas Anonuevo that there is also a donor for the completion of the floor tiles."
        ],
        [
            "For you to see the whole town, proceed to the Las Navas View Deck, be there at 5 a.m. and witness the place while the fog is still covers the poblacion."
        ],
        [
            "Las Navas with Samar Island Natural Park-DENR provided an amount for the construction of Las Navas Pinipisakan Falls View Deck."
        ],
        [
            "Living Asia Channel visited Pinipisakan Falls last March 30, 2010.",
            "The group was headed by Sunly, writer, Josette Doctor, provincial tourism officer, Municipal Development and Tourism Officer of Las Navas."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Las Navas |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Las Navas, Northern Samar : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 6 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Northern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Las Navas"
        ],
        [
            "Pambujan"
        ],
        [
            "Catubig"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Las Navas"
        ],
        [
            "Jipapad, Eastern Samar"
        ],
        [
            "Matuguinao, Samar"
        ],
        [
            "vte Province of Northern SamarCatarman (capital and largest municipality)Municipalities"
        ],
        [
            "Allen"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Capul"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Gamay"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lope de Vega"
        ],
        [
            "Mapanas"
        ],
        [
            "Mondragon"
        ],
        [
            "Palapag"
        ],
        [
            "Pambujan"
        ],
        [
            "Rosario"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Victoria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Las_Navas&oldid=1172326010\""
        ],
        [
            "Category: Municipalities of Northern SamarHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}