{
    "name": "Lawaan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Lawaan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°08′27″N 125°18′04″E﻿ / ﻿11.1408°N 125.3011°E﻿ / 11.1408; 125.3011"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Eastern Samar, Philippines"
        ],
        [
            "For the trees also called lawaan or lauan, see Shorea."
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesLawaanMunicipalityMunicipality of Lawaan"
        ],
        [
            "FlagNickname: Gateway to Eastern SamarMap of Eastern Samar with Lawaan highlightedOpenStreetMapLawaanLocation within the PhilippinesCoordinates: 11°08′27″N 125°18′04″E﻿ / ﻿11.1408°N 125.3011°E﻿ / 11.1408; 125.3011CountryPhilippinesRegionEastern VisayasProvinceEastern SamarDistrict"
        ],
        [
            "Lone districtBarangays16"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAthene L. Mendros • Vice MayorRavi Parker G. Inciso • RepresentativeMaria Fe R. Abunda • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Beryl Sharon G. Tolentino• Erico O. Dacuno• Raul C. Gade• Rolando G. Gaylon• Quirilo C. Ecaldre• Nelia G. Miralles• Marilyn G. Abayan• Fritzie E. GachoDILG Masterlist of Officials"
        ],
        [
            " • Electorate10,372 voters (2022)Area • Revenue₱ 111.8 million (2020) • Assets₱ 199.6 million (2020) • Expenditure₱ 89.95 million (2020) • Liabilities₱ 115.4 million (2020)Service provider • ElectricityEastern Samar Electric Cooperative (ESAMELCO)Time zoneUTC+8 (PST)ZIP code6813PSGC082612000IDD : area code +63 (0)55Native languagesWaray TagalogWebsitewww.lawaan-esamar.gov.ph"
        ],
        [
            "Lawaan, officially the Municipality of Lawaan (Waray: Bungto han Lawaan; Tagalog: Bayan ng Lawaan), is a 5th class municipality in the province of Eastern Samar, Philippines.",
            "According to the 2020 census, it has a population of 13,003 people.",
            "It is home to Bolusao Watershed Forest Reserve, primarily located in Barangay Bolusao."
        ],
        [
            "Lawaan is the historical hometown of the legendary sundang-wielding fighters in women's clothing during the 1901 Battle of Balangiga.",
            "Being a town adjacent to the Samar Island Natural Park - the country's largest terrestrial protected area - the land has vast natural landscapes and wildlife sanctuaries.",
            "Numerous waterfalls such as Amandaraga, Amanjuray, Pangi and Ban-awan dot the vast Bolusao Watershed Forest Reserve.",
            "Off the coast, white-sand islets also abound the town's horizon."
        ],
        [
            "History"
        ],
        [
            "An enterprising young couple by the names of Juan (Guingot) Gabrillo and his wife Etifania Halbay, together with their children, set sail one day in a small sailboat from Guiuan, in search of a greener pasture of an ideal place to settle.",
            "On their westward journey along the wooded coastline of Southern Samar, they reached a small island known as “Monbon” which was bordering the mouth of what is now the Lawa-an river.",
            "It was just in time to see that a severe storm was brewing from the western horizon.",
            "They decided to move inland, hastening towards the coastal jungle in their immediate front, to seek shelter behind the trunk of a towering tree which was clearly visible from the sea.",
            "It was behind that great tree that the frantic family was divinely protected from the roaring fury of the storm and a dire calamity was happily averted.",
            "When the typhoon subsided the next day the couple noticed that another tree of the same height and stature was also growing on the opposite bank of the river, twin sister to that of the other side - both so majestic and impressive in appearance, such that the branches up above completely overshadowed the river in-between."
        ],
        [
            "After a hasty and meager breakfast of hot porridge, the small family looked askance of their surroundings and was deeply impressed by their new environment.",
            "The jungle growth even along the seashore bespoke fertility of the soil; the abundance of rattan and “hagnaya” vines was easy source of income and the shallow sea beside them was teeming with marine life of all kinds.",
            "All these offered suggestions that the place was ideal haven for habitation.",
            "So they abandoned their journey westward, instead, started building a makeshift hut at the foot of the same Lawa-an tree where they took refuge, at the same time, collecting whatever few belongings they could salvage from the wreckage of their boat.",
            "The days and weeks that followed were a series of trips inland by Juan Guingot - to cut rattan and hagnaya vines hereabouts or, perchance, he might find some edible fruits or root-crops nearby.",
            "Still further, he found unmistakable signs that the area was infested with wild life.",
            "The presence of these predators posed quite a problem to his intended plan of growing a vegetable farm; nevertheless, Guingot presently started his clearing (caingin) and the making of traps to capture some wild hogs or monkeys for food."
        ],
        [
            "As was predictable in situations like this, Guingot reconstructed his sailboat, loaded it with rattan and hagnaya vines and sailed back to Guiuan where he sold his cargoes, telling the people and his friends along the way how he, with his family, was overtaken by a dreadful storm and escaped disaster behind the trunk of a giant Lawa-an tree.",
            "He emphasized to them the bright prospect of settling in the area partly as a token of gratitude and reverence to that haven of refuge - the enormous trunks of the twin Lawa-an trees; but most importantly, that the surrounding area was abundant and ideal for habitation.",
            "“Mamatay lak О-toy”, Juan Guingot would excitedly employ the slang and flavor of the Guiuan vernacular, “mamatay lak, dadi okoy ha Lawa-an (naming the place Lawa-an for the first time), ayaw pag-alang.",
            "Di ka mawawara hit doro-ongan kay kita gud iton hita-as nga kahoy ha dagat.” (Boy, when I die, stay here in Lawa-an, don't hesitate.",
            "You will never get lost of the loading dock because the tall trees can be seen from the sea.)",
            "Indeed, there was no other point of reference more appealing to the settlers this outstanding landmark conspicuous from the sea."
        ],
        [
            "That was how the present town of Lawa-an at first received its name.",
            "Ironically, five wide centuries have come and gone; people have lived and died along with generations in accordance with the short span of human life, but the name “LAWA-AN”, a former barrio of Balangiga, province of Eastern Samar, has remained, to this day, unchanged."
        ],
        [
            "Geography"
        ],
        [
            "The town is strategically located in the central part of southern Samar Island.",
            "It is sandwiched between the town of Balangiga in the east and Marabut, Samar in the west.",
            "Barangay Bolusao, the town's largest settlement located right at the east–west Samar boundary, serves as the premier barangay of Eastern Samar for those people coming from Tacloban City or Province of Samar traversing Samar Circumferencial Road.",
            "Hence, being dubbed as 'The Gateway to Eastern Samar'."
        ],
        [
            "Barangays"
        ],
        [
            "Lawaan is politically subdivided into 16 barangays."
        ],
        [
            "Betaog"
        ],
        [
            "Bolusao (largest by population and area)"
        ],
        [
            "Guinob-an"
        ],
        [
            "Maslog"
        ],
        [
            "Barangay Poblacion 1"
        ],
        [
            "Barangay Poblacion 2"
        ],
        [
            "Barangay Poblacion 3"
        ],
        [
            "Barangay Poblacion 4"
        ],
        [
            "Barangay Poblacion 5"
        ],
        [
            "Barangay Poblacion 6"
        ],
        [
            "Barangay Poblacion 7"
        ],
        [
            "Barangay Poblacion 8"
        ],
        [
            "Barangay Poblacion 9"
        ],
        [
            "Barangay Poblacion 10"
        ],
        [
            "San Isidro"
        ],
        [
            "Taguite"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lawaan, Eastern Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "78(3.1)"
        ],
        [
            "57(2.2)"
        ],
        [
            "84(3.3)"
        ],
        [
            "79(3.1)"
        ],
        [
            "118(4.6)"
        ],
        [
            "181(7.1)"
        ],
        [
            "178(7.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "172(6.8)"
        ],
        [
            "180(7.1)"
        ],
        [
            "174(6.9)"
        ],
        [
            "128(5.0)"
        ],
        [
            "1,598(62.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.7"
        ],
        [
            "13.8"
        ],
        [
            "17.3"
        ],
        [
            "18.5"
        ],
        [
            "23.2"
        ],
        [
            "26.5"
        ],
        [
            "27.1"
        ],
        [
            "26.0"
        ],
        [
            "26.4"
        ],
        [
            "27.5"
        ],
        [
            "24.6"
        ],
        [
            "21.0"
        ],
        [
            "268.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LawaanYearPop.±% p.a.1960 5,983—    1970 7,479+2.25%1975 8,517+2.64%1980 7,275−3.10%1990 7,792+0.69%1995 9,725+4.24%2000 9,855+0.29%2007 10,645+1.07%2010 11,612+3.21%2015 12,742+1.78%2020 13,003+0.40%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Lawaan in the 2020 census was 13,003 people, with a density of 80 inhabitants per square kilometre or 210 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Lawaan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  34.00"
        ],
        [
            "2009  45.68"
        ],
        [
            "2012  33.10"
        ],
        [
            "2015  38.70"
        ],
        [
            "2018  46.64"
        ],
        [
            "2021  35.24"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Lawaan's main product is copra.",
            "Many families rely on coastal and deep-sea fishing as well as lowland and upland farming as means of livelihood.",
            "Others have spouses, children, parents or other relatives working in Tacloban City, Metro Manila or in other places within the Philippines or abroad either as professionals, contract workers or domestic helpers who regularly remit part of their earnings to their families back home.",
            "The single biggest employer of its local populace is the government."
        ],
        [
            "Tourism"
        ],
        [
            "Lawaan is known for its waterfalls and wildlife.",
            "Being a coastal town, it overlooks Leyte Gulf in its southern shores."
        ],
        [
            "There are four waterfalls in the Bolusao watershed which lies within the SINP Buffer Zone.",
            "These falls are Amandaraga, Pange, Amanjuray, and Ban-Awan Falls.",
            "Amandaraga and Ban-awan Falls are the main source of the municipality's water system.",
            "Meanwhile, Amanjuray Falls is the alternate hydro-electric power source of Lawaan wherein a mini-hydro power plant is existent nearby."
        ],
        [
            "Notable personalities"
        ],
        [
            "Freddie Abuda - retired professional basketball player, currently serving as an assistant coach to the San Beda Red Lions (NCAA)."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Lawaan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Crispin G. Gavan.",
            "\"History of Lawaan Eastern Samar and The Legends About Agtak\".",
            "Retrieved October 30, 2018."
        ],
        [
            "^"
        ],
        [
            "\"Province: Eastern Samar\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Lawaan, Eastern Samar : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 31 December 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Eastern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Lawaan"
        ],
        [
            "Balangiga"
        ],
        [
            "Marabut, Samar"
        ],
        [
            "Lawaan"
        ],
        [
            "Balangiga"
        ],
        [
            "Leyte Gulf"
        ],
        [
            "vte Province of Eastern SamarBorongan (capital and largest city)Municipalities"
        ],
        [
            "Arteche"
        ],
        [
            "Balangiga"
        ],
        [
            "Balangkayan"
        ],
        [
            "Can-avid"
        ],
        [
            "Dolores"
        ],
        [
            "General MacArthur"
        ],
        [
            "Giporlos"
        ],
        [
            "Guiuan"
        ],
        [
            "Hernani"
        ],
        [
            "Jipapad"
        ],
        [
            "Lawaan"
        ],
        [
            "Llorente"
        ],
        [
            "Maslog"
        ],
        [
            "Maydolong"
        ],
        [
            "Mercedes"
        ],
        [
            "Oras"
        ],
        [
            "Quinapondan"
        ],
        [
            "Salcedo"
        ],
        [
            "San Julian"
        ],
        [
            "San Policarpo"
        ],
        [
            "Sulat"
        ],
        [
            "Taft"
        ],
        [
            "Component city"
        ],
        [
            "Borongan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Lawaan&oldid=1191210364\""
        ],
        [
            "Category: Municipalities of Eastern SamarHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}