{
    "name": "Lebak",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Lebak"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 6°38′N 124°04′E﻿ / ﻿6.63°N 124.07°E﻿ / 6.63; 124.07"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Sultan Kudarat, Philippines"
        ],
        [
            "For the regency in Indonesia, see Lebak Regency."
        ],
        [
            "This article needs to be updated.",
            "Please help update this article to reflect recent events or newly available information.",
            "(June 2020)"
        ],
        [
            "Municipality in Soccsksargen, PhilippinesLebakMunicipalityMunicipality of LebakOther transcription(s) • JawiلبکAerial view of Lebak"
        ],
        [
            "FlagSealMotto: Mapeon Lebak (Manobo) or Beautiful LebakMap of Sultan Kudarat with Lebak highlightedOpenStreetMapLebakLocation within the PhilippinesCoordinates: 6°38′N 124°04′E﻿ / ﻿6.63°N 124.07°E﻿ / 6.63; 124.07CountryPhilippinesRegionSoccsksargenProvinceSultan KudaratDistrict"
        ],
        [
            "2nd districtFoundedAugust 18, 1947Barangays27"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFrederick F. Celestial • Vice MayorNathaniel A. Castillon • RepresentativeHoracio P. Suansing Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Melchor B. AlarconJuno Marteen S. VegasRosalito G. delos ReyesRandy R. OrgoJimmy B. Dumaguin Sr.Eleuterio T. Otayde Jr.Roberto A. TacadaoBlesilda D. Torreña"
        ],
        [
            " • Electorate58,460 voters (2022)Area • Revenue₱ 310.6 million (2020) • Assets₱ 497.5 million (2020) • Expenditure₱ 310.3 million (2020) • Liabilities₱ 179.2 million (2020)Service provider • ElectricitySultan Kudarat Electric Cooperative (SUKELCO)Time zoneUTC+8 (PST)ZIP code9807PSGC126506000IDD : area code +63 (0)64Native languagesHiligaynon Maguindanao Tiruray TagalogWebsitewww.lebak.gov.ph"
        ],
        [
            "Lebak, officially the Municipality of Lebak  (Hiligaynon: Banwa sang Lebak; Maguindanaon: Inged nu Lebak, Jawi: ايڠد نو لبک; Tagalog: Bayan ng Lebak), is a 1st class municipality in the province of Sultan Kudarat, Philippines.",
            "According to the 2020 census, it has a population of 88,868."
        ],
        [
            "It is a coastal municipality that lies in the northernmost part of the province."
        ],
        [
            "Etymology"
        ],
        [
            "Lebak is a Maguindanaon word meaning hollow.",
            "This is because of the eastern part of Lebak is a mountain and on the western part is the Celebes Sea thus the hollow portion is between a mountain and the sea."
        ],
        [
            "History"
        ],
        [
            "Early settlers are the Manobo at Salangsang."
        ],
        [
            "Sultanate era"
        ],
        [
            "Lebak was once part of Sultanate of Maguindanao.The arrival of Maguindanao which establish the Islamic faith and settled in near the rivers and shores in the 15th century."
        ],
        [
            "Spanish era"
        ],
        [
            "This territory was part of the Spanish Empire in Asia and Oceania (1520–1898).",
            "By 1696, Captain Rodríguez de Figueroa obtained from the Spanish government the exclusive right to colonize Mindanao.",
            "On February 1 of this year, Iloilo reached the mouth of the Rio Grande of Mindanao, in what is now known as the city of Cotabato."
        ],
        [
            "The first written history of this town was in 1871, The colonial government of Spain, Lebac was made into a military district of Cotabato."
        ],
        [
            "American period"
        ],
        [
            "By the end of the Spanish regime in 1898, includes politico-military comendancia of Lebak in \"Fifth District of Mindanao\"."
        ],
        [
            "World War II and Japanese occupation"
        ],
        [
            "In 1945, World War II when the combined American and Filipino forces took over the supervision of the Philippine Government against Japanese occupation, Marcelino A. Concha was still the Military Governor of the Empire Province of Cotabato.",
            "In the same year, Aurelio Freires, Sr. was appointed Municipal District Mayor of Salaman."
        ],
        [
            "Post colonial (third republic) and creation of Lebak"
        ],
        [
            "On August 18, 1947, President Manuel Roxas sign an executive order 82 organizing municipalities and municipal district of Cotabato Province."
        ],
        [
            "An executive order number 195, the Municipality of Lebak as separated from the municipality of district of Kiamba and Dinaig and upholding the seat of government at Sito Kalamansig was signed by President Elpidio Quirino on December 31, 1948."
        ],
        [
            "On April 12, 1951, the municipality of Kalamansig is formally created consisting of 20 barrios and sitios from Lebak."
        ],
        [
            "Moro conflict"
        ],
        [
            "Main article: Moro conflict"
        ],
        [
            "The Land Reform Code of Diosdado Macapagal brought more Christian migrants from Luzon and Visayas."
        ],
        [
            "Under the command of Rajah Buayan, Commander Ali “Cassius Clay” Sansaluna of Cotabato Moro National Liberation Front Command landed at barangay Tran in December 1972 with an estimated 5,000 – 6,000 armed with European made weapon ship from neighboring Muslims countries.",
            "Tran was the main logistical base of the MNLF's Cotabato Command.",
            "Early February 26, 1973, the hostilities began when a group of fishermen at Tran River was shot and killed.",
            "The following day, February 27, 1973, the 54 Philippine Constabulary verify the event and the skirmishes begin.",
            "Signalled the MNLF offensive all over Cotabato raided including Civilian Home Defense Forces (CHDFs), 27th Infantry Battalion, PC Provincial Commands and villages as far as barangay Basak."
        ],
        [
            "22nd Infantry Battalion (Separate) was deployed at Lebak in April 1973."
        ],
        [
            "Datu Guiwan Mastura withdraws from Lebak and Kalamansig and seeks sanctuary at Palimbang on March 21, 1973.",
            "Tran was guarded with 600 rebels under the command of Datu Sangki Karon."
        ],
        [
            "Offensive military operation started June 6, 1973, under the command of Unified Central Mindanao Command (CEMCOM) Task Force COSMOS under General Fortunato U. Abat who was the commanding general of 3rd Inf Bde (Sep) PA."
        ],
        [
            "July 21, 1973, government troops controlled the Barangay Tran and kept pushing towards Sitio Turugan.",
            "A thousand rebels together with their families surrendered to government troops on August 3, 1973.",
            "On August 4, 1972, the 22nd Infantry Battalion finally cleared the Sitio Turugan, the Moro National Liberation Front stronghold.",
            "The Tran Offensive officially ended on August 6, 1973, ending the two-month conflict."
        ],
        [
            "Leader of Tran insurgents Datu Guiwan Mastura together with 12 men surrendered to Ferdinand Marcos in June 1973."
        ],
        [
            "Post war and 1976 tsunami disaster"
        ],
        [
            "Homes destroyed in Barangay Tibpuan, Lebak, by the 1976 tsunami."
        ],
        [
            "The 8.0 (Mw) earthquake on August 16, 1976 at 16:11 UTC (12:11 AM local time) occurred near the Moro Gulf at a depth of 33 kilometres (21 mi), about 40.7 kilometres (25.3 mi) south of the populated barangay of Tibpuan.",
            "It was followed by 15 aftershocks."
        ],
        [
            "A few years later, the municipality of Lebak was transferred from Cotabato Province to Province of Sultan Kudarat on November 22, 1979, by presidential decree 341 by President Ferdinand E. Marcos."
        ],
        [
            "Fifth republic"
        ],
        [
            "The municipality was formerly composed of 23 barangays and created 4 new barangays, Bolebak, Barurao II, Poblacion II and Poblacion III making it to 27 barangays."
        ],
        [
            "The renaming of Poblacion 2 to barangay Aurelio F. Frieres Sr was approved by the Sanguniang Bayan in its resolution number 007 series of 2002.",
            "A plebiscite was enacted last March 31, 2005."
        ],
        [
            "Geography"
        ],
        [
            "Slope aspect and elevation"
        ],
        [
            "Lebak is a coastal town with a total coastline of 19 km (12 mi) long, separated from the mainland of Sultan Kudarat by mountain ranges.",
            "It is located on the western portion of the Province of Sultan kudarat, and bordered in the north by South Upi, Maguindanao; in the south by Kalamansig; in the west by Celebes Sea; in the east by Esperanza."
        ],
        [
            "Lebak is marked with hilly, mountainous ranges.",
            "It is about eight feet above sea level.",
            "The plains range from level to nearly level while uplands range from nearly level to hilly.",
            "Mountainous and gently rolling slopes are suitable for intensive rice and corn farming."
        ],
        [
            "The Tran River is the longest river in Lebak with a total length of 120 km (75 mi) followed by Salaman River 36.4 km (22.6 mi) and Nuling River (Barurao) 19 km (12 mi)."
        ],
        [
            "The approximate land area of the municipality of Lebak as of December 31, 1999, is 514.034445 square kilometers.",
            "But for planning purposes, the area used is 47,000 hectares, pursuant to the DBM supported by the Land Management Bureau/ Bureau of Lands.",
            "Of the 27 barangays, Salangsang has the largest area with 77.2850 square kilometres (29.8399 sq mi), followed by Keytodac with 63.8987 square kilometres (24.6714 sq mi), Villamonte with 46.4137 square kilometres (17.9204 sq mi) and Poloy-Poloy with 338.8183 square kilometres (130.8185 sq mi); while Poblacion III has the smallest area with 5.79411 square kilometres (2.23712 sq mi)."
        ],
        [
            "Vegetative map for Lebak"
        ],
        [
            "Topography"
        ],
        [
            "Land Formation"
        ],
        [
            "The Mangrove forest in wetlands of Lebak, Sultan Kudarat"
        ],
        [
            "Lebak is marked with hilly, mountainous ranges.",
            "The plains range from level to nearly level while uplands range from nearly level to hilly mountainous and gently rolling slopes which are suitable for intensive rice and corn farming.",
            "Silty Loam which is best suited for agricultural crops such as rice, corn and vegetables.",
            "This covers 37.36% or 17,500 has of the total land area."
        ],
        [
            "Soils Un-differentiated which is favorable suited to grazing, pasture, forest and agro-forestry.",
            "This covers a total of 29,440 has or 62.64%."
        ],
        [
            "Hydrology/ natural resources"
        ],
        [
            "The Municipality is rich in natural resources.",
            "Its fishing ground abounds with fish of various species for domestic consumption and export.",
            "Marine products bring substantial income to a marginal fisherman.",
            "Fishing grounds are practically untapped.",
            "Identified watershed areas are Barurao Watershed (6,817.62), Salaman Watershed (8,176 ha.",
            "), Tran-Sucong Watershed (8,518.65) and Tran River Watershed (10,230 Ha.",
            ")."
        ],
        [
            "Groundwater information"
        ],
        [
            "Results"
        ],
        [
            "Remarks"
        ],
        [
            "pH Level"
        ],
        [
            "9-May"
        ],
        [
            "Nitrate concentration"
        ],
        [
            "Below standard"
        ],
        [
            "Bolebak has traced, Ragandang has 1 mg\\L, Poblacion 1 has 2 mg\\L"
        ],
        [
            "The rest not yet contaminated with nitrates"
        ],
        [
            "Dissolved Oxygen"
        ],
        [
            "Bolebak, Pasandalan, Poblacion 1 and Tibpuan- conformed to the minimum 5 mg"
        ],
        [
            "Iron"
        ],
        [
            "Poblacion 3, Poloy-Poloy, Purikay, Salaman and Tibpuan – trace, Nuling"
        ],
        [
            "Pansud and Tran- greater than 1.2 mg\\L"
        ],
        [
            "Rest no Iron detected"
        ],
        [
            "Total Dissolved Solids"
        ],
        [
            "Only Pasandalan and Salaman – above maximum limit (500 mg\\l)"
        ],
        [
            "Conductivity"
        ],
        [
            "only Salaman has conductivity above 1000 us/cm"
        ],
        [
            "Hardness"
        ],
        [
            "Only Barurao I and Poloy-Poloy did not conform.",
            "Slightly above maximum limit."
        ],
        [
            "Turbidity"
        ],
        [
            "Clear"
        ],
        [
            "Below 5 NTU"
        ],
        [
            "Salinity"
        ],
        [
            "Not saline"
        ],
        [
            "Below 1000 mg/l"
        ],
        [
            "The water resources of Lebak consist of Tran River 120 km (75 mi), Salaman River 36.4 km (22.6 mi), and Barurao River 19 km (12 mi) the Makin and Ebi Waterfalls, Nuling, Salangsang and Ebi Springs.",
            "Some are tapped for irrigation and other purposes."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lebak, Sultan Kudarat"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "119(4.7)"
        ],
        [
            "99(3.9)"
        ],
        [
            "132(5.2)"
        ],
        [
            "147(5.8)"
        ],
        [
            "256(10.1)"
        ],
        [
            "291(11.5)"
        ],
        [
            "287(11.3)"
        ],
        [
            "286(11.3)"
        ],
        [
            "228(9.0)"
        ],
        [
            "227(8.9)"
        ],
        [
            "208(8.2)"
        ],
        [
            "135(5.3)"
        ],
        [
            "2,415(95.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "19.2"
        ],
        [
            "17.9"
        ],
        [
            "20.9"
        ],
        [
            "24.6"
        ],
        [
            "29.4"
        ],
        [
            "29.1"
        ],
        [
            "29.7"
        ],
        [
            "28.9"
        ],
        [
            "27.2"
        ],
        [
            "28.5"
        ],
        [
            "27.2"
        ],
        [
            "22.5"
        ],
        [
            "305.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Under the Köppen climate classification system, the municipality of Lebak features a tropical rainforest climate.",
            "Together with the rest of the Philippines, Lebak has a mild climate with evenly distributed rainfall throughout the year.",
            "Being located outside of the typhoon path, it does not experience tropical depressions, typhoons and devastating winds."
        ],
        [
            "Mean relative humidity for the Municipality of Lebak is 87%.",
            "The highest humidity is 89.5% and the lowest is 83.6%."
        ],
        [
            "The municipality of Lebak falls under TYPE IV classification.",
            "Rainfall is more or less evenly distributed throughout the year.",
            "Prevailing winds- light to moderate."
        ],
        [
            "The municipality of Lebak, PAG-ASA recorded mean maximum and minimum temperatures of 34.3 and 32.5 °C (93.7 and 90.5 °F), respectively."
        ],
        [
            "Mean, Maximum and Minimum Temperature ( °C ):"
        ],
        [
            "Barangays"
        ],
        [
            "Administrative map for Lebak"
        ],
        [
            "Lebak is politically subdivided into 27 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Aurelio F. Freires (Poblacion II)"
        ],
        [
            "Barurao"
        ],
        [
            "Barurao II"
        ],
        [
            "Basak"
        ],
        [
            "Bolebak"
        ],
        [
            "Bululawan"
        ],
        [
            "Capilan"
        ],
        [
            "Christiannuevo"
        ],
        [
            "Datu Karon"
        ],
        [
            "Kalamongog"
        ],
        [
            "Keytodac"
        ],
        [
            "Kinodalan"
        ],
        [
            "New Calinog"
        ],
        [
            "Nuling"
        ],
        [
            "Pansud"
        ],
        [
            "Pasandalan"
        ],
        [
            "Poblacion I"
        ],
        [
            "Poblacion III"
        ],
        [
            "Poloy-poloy"
        ],
        [
            "Purikay"
        ],
        [
            "Ragandang"
        ],
        [
            "Salaman"
        ],
        [
            "Salangsang"
        ],
        [
            "Taguisa"
        ],
        [
            "Tibpuan"
        ],
        [
            "Tran"
        ],
        [
            "Villamonte"
        ],
        [
            "Datu Guiabar is a newly created barangay carved out from barangay Poloy-poloy.",
            "It is not officially recognized until plebiscite is held."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LebakYearPop.±% p.a.1918 889—    1939 5,403+8.97%1948 67−38.60%1960 22,173+62.16%1970 27,538+2.19%1975 31,478+2.72%1980 37,851+3.75%1990 52,428+3.31%1995 61,884+3.16%2000 70,899+2.96%2007 77,139+1.17%2010 83,280+2.83%2015 88,868+1.24%2020 91,344+0.54%Source: Philippine Statistics Authority"
        ],
        [
            "Household Population by Ethnicity"
        ],
        [
            "The population of Lebak by age group reveals a dominance of the young population.",
            "Based on the 2007 population, children under five years old made up 14% or 11,163 of the total population of the municipality, lower than the percentage for the age group 5 – 9 which is 14.67% or 11,234 of the same year."
        ],
        [
            "Child dependency ratio registered at 78.73% meaning 78 children dependents for every 100 working population.",
            "Total dependency ratio is 84.15%, the higher the total dependency ratio, the heavier the burden of the working age population."
        ],
        [
            "Economically dependent persons less than 15 years old are about 32,979 or 42.75%, Working age population registered 41,888 or 54.23% are between the ages 15–64."
        ],
        [
            "The percentage of female population in the reproductive age (15–49) registered 36,534 or 47.28%.",
            "About 47,436 or 61.51% of both men and women belonged to the age group 24 years and below.",
            "The population by age group declines with increase in age."
        ],
        [
            "The population of those belonging to ages 65 years and over or the elderly population constitutes a very small proportion of the population.",
            "Population age 65 and above constitutes 2,272 or 5.4% of the total population.",
            "Old age dependency ratio is 5.4%, meaning for every 100 working population there are 5 old age dependent persons."
        ],
        [
            "The working age group of 15 to 64 years old makes up 54% or 41,888 of the population while 43% or 32,979 are 14 years or younger and 5% or 2,272 are 65 years old or above."
        ],
        [
            "Male population in the municipality is slightly higher than that of the female.",
            "The same is true in all barangays.",
            "Male population registered a total of 39,958 or 51.80% and 37,181 or 48.20%.",
            "The municipality is predominated by males showing males per 100 females."
        ],
        [
            "Religion"
        ],
        [
            "There are 4 major religious groups in the municipality of Lebak.",
            "These are the Roman Catholic which accounts for 62% of the total population, Islam, 15%, Protestants, 8% and UCCP, 7%.",
            "The remaining percentage is distributed to Evangelical, United Pentecostal Church and other religions which make up 8%."
        ],
        [
            "Languages"
        ],
        [
            "The most widely spoken language is Hiligaynon (41.06%), followed by Karay-a (12.98%), Maguindanaon (12.91%), Cebuano (9.42%), Teduray (8.08%), Ilocano (7%), Manobo (5.74%), and 4.57% for other languages."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Lebak"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  37.10"
        ],
        [
            "2009  46.02"
        ],
        [
            "2012  50.92"
        ],
        [
            "2015  51.65"
        ],
        [
            "2018  34.70"
        ],
        [
            "2021  35.14"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Fishing, Fish Catch, Fisherman of Lebak"
        ],
        [
            "This municipality managed to boost its local economy to its full potential.",
            "Saturday market was started as early as the 1960s and the market days still observe today.",
            "The opening of new routes and improvement in transport system are expect to deliver the town into an economic promise.",
            "Strengthen inter-regional trade linkage, gain access to potential agricultural production and will support various economic activities in the adjacent areas."
        ],
        [
            "The 2016, National Competitiveness Council shows that the size of the local economy has total registered business gross sales of Php.",
            "789,977,450.84."
        ],
        [
            "Agriculture Sector"
        ],
        [
            "Agriculture is the primary source of income.",
            "Corn, rice and coconut are the most extensive crops grown.",
            "Cacao most commonly intercropped with coconut while the coffee is still a major crop."
        ],
        [
            "Crops"
        ],
        [
            "Area Harvested"
        ],
        [
            "Production (metric tons)"
        ],
        [
            "Rice"
        ],
        [
            "Irrigated"
        ],
        [
            "6,241.2"
        ],
        [
            "29,957.8"
        ],
        [
            "Rainfed"
        ],
        [
            "835.41"
        ],
        [
            "3,337.0"
        ],
        [
            "Corn"
        ],
        [
            "Yellow Corn"
        ],
        [
            "10,236.20"
        ],
        [
            "52,204.70"
        ],
        [
            "White Corn"
        ],
        [
            "4,061.30"
        ],
        [
            "20,306.55"
        ],
        [
            "Livestock like swine/hog, ducks, cattle, carabao, goat and poultry products, fruits and vegetables."
        ],
        [
            "Fishing"
        ],
        [
            "Coastal barangay like Salaman, Tibpuan, Kinudalan, Datu Karon and Taguisa rely on fishing as their livelihood."
        ],
        [
            "Metric Tons"
        ],
        [
            "Area"
        ],
        [
            "Commercial"
        ],
        [
            "64 M.T."
        ],
        [
            "207 hectares"
        ],
        [
            "Brackish aquaculture"
        ],
        [
            "Freshwater/backyard ponds"
        ],
        [
            "24 M.T."
        ],
        [
            "50 hectares"
        ],
        [
            "Lebak is known for its produce like crabs (alimango), prawns (sugpo), milkfish (bangus) on its total of 247 Has.",
            "of shallow ponds.",
            "Shell fish are also abundant in shallow areas."
        ],
        [
            "Communication"
        ],
        [
            "Smart Communications provide services like wireless 3G connection and broadband connection on its Smart Bro product.",
            "While Globe Telecom offers 3G and HSDPA signal that boost mobile internet connectivity.",
            "Some complain of unstable and frequent disconnection on Globe Tattoo and WiMax services.",
            "Fixed telephone line are provided by the Sultan Kudarat Telephone System Incorporated (SKTSI) subsidiary of PLDT."
        ],
        [
            "FM station is also present in Lebak.",
            "The 105.1 MHz DXLR Radyo Natin of the Manila Broadcasting Company broadcast local news and advertisements with power of 500 Watts"
        ],
        [
            "Kalamansig-Lebak Cable System, Inc. (KALECA) carries cable television signal to barangay Poblacion, Salaman, Pasandalan, Tibpuan, Barurao 1 & 2, Purikay and far as barangay Pansud.",
            "Direct-To-Home satellite TV such as G Sat, Cignal and Dream are common in the rural areas."
        ],
        [
            "Banking, Financial and Utility Services"
        ],
        [
            "Banking"
        ],
        [
            "With total of 27 financial institutions includes 1 commercial banks and 2 rural banks, 5 finance cooperatives, 9 pawnshops, 2 foreign exchange dealers, 6 remittance centers and 2 microfinance institutions."
        ],
        [
            "3 automated teller machines (ATMs) operated by Land Bank of the Philippines and One Network Bank."
        ],
        [
            "Water Utilities"
        ],
        [
            "Local water utilities are supplied by Lebak Water District (LEWADI) with a rate of Php.",
            "55.2/Per Cubic Meter."
        ],
        [
            "Energy"
        ],
        [
            "As of March 31, 2017 Sultan Kudarat Electric Cooperative (SUKELCO) provides electricity for 70% of the residents."
        ],
        [
            "Culture"
        ],
        [
            "Lebak is a melting pot of culture and tradition.",
            "Mainstream culture of Lebak is the Ilonggo, the greatest number of the populace.",
            "Maguindanaon and tribal traditions can still be observed on its local settlements.",
            "Manobos and Tiduray minorities still widely practice and observe.",
            "Part of the culture of the people of Lebak is the celebration of Fiesta.",
            "Patronal Fiesta Celebration every 4th Sunday of May.",
            "Some barangays has its own festival like in Basak, Taguisa, Villamonte, Salangsang, Keytodac and Tibpuan."
        ],
        [
            "The Araw ng Lebak is celebrated during August 18 yearly and the Kapeonan Festival."
        ],
        [
            "Tourism"
        ],
        [
            "Lebak Shoreline"
        ],
        [
            "Lebak is now an emerging tourism destination."
        ],
        [
            "Photo of the entrance of Makin Falls at Villamonte, Lebak, Sultan Kudarat"
        ],
        [
            "Enchanting Makin falls in Villamonte, Tres Andanas falls in New Calinog and Ragandang falls are part of series of seven waterfalls can be found in Lebak."
        ],
        [
            "The network of caves can also be found in Salangsang, Keytodac, Bululawan and Capilan.",
            "The most popular are Camilmil pit,  Lom cave, Kiangus pit and, Sataluday cave, Capilan Bat cave and Tinubak cave and falls in Keytodac consist of class II cave, underground river and jump into a falls"
        ],
        [
            "Hot Spring located in Nuling are another big things in Lebak's tourism industry ."
        ],
        [
            "Lebak Katunggan Eco Park at barangay Taguisa is the newly opened tourist attraction in the municipality."
        ],
        [
            "Government"
        ],
        [
            "Lebak view seen from Km 12, Salangsang"
        ],
        [
            "List of former chief executives"
        ],
        [
            "Aurelio F. Freires, Sr. 1948–1955"
        ],
        [
            "Timoteo P. Belarmino 1956–1959"
        ],
        [
            "Aurelio F. Freires, Sr. 1960–1963"
        ],
        [
            "Aurelio C. Freires, Jr. 1964–1967"
        ],
        [
            "Jorge T. Labog 1968–1971"
        ],
        [
            "Romeo F. Almirante 1972–1975"
        ],
        [
            "Reynaldo P. Palileo, Sr. 1976–1979"
        ],
        [
            "Romeo F. Almirante 1980–1986 (died in office)"
        ],
        [
            "Salvador G. Ang, MD 1986–1987 (appointed)"
        ],
        [
            "David Gestosani 1987–1988 (appointed)"
        ],
        [
            "Sergio P. Sabio 1988–1998"
        ],
        [
            "Kahirup C. Ang, M.D.",
            "1998–2003"
        ],
        [
            "Gerardo S. Delasan 2003–2010"
        ],
        [
            "Dionesio Besana 2010–2019"
        ],
        [
            "Frederick Celestial 2019–Present"
        ],
        [
            "Transportation"
        ],
        [
            "Lebak has a road network of 219.35 kilometers and 37.85 km are concrete, 111.5 km graveled road and 70 km of unpaved roads.",
            "The distance to the nearest airport (Awang Domestic Airport) is 53.99 km."
        ],
        [
            "Transportation from and to the muicipalites was already in place since 1925.",
            "Early steamers like Fernadez Hermanos, Neil McLeod and Mindanao from Manila had regular call at Lebak port, Tablas had irregular interval while Research had irregular trips also survey the ."
        ],
        [
            "The lack of access to road Lebak was isolated for many years."
        ],
        [
            "Junction Awang – Upi – Lebak – Kalamansig Road ProjectIf you are from Manila, you can reach Lebak by plain via Manila-Gensan or Manila- Cotabato.",
            "The completion of the concrete national road from the junction of Awang — Upi — Lebak road will be a great impact on the economy of Lebak."
        ],
        [
            "It can be reached by Public Utility Jeep, vans and private vehicles for about 8 to 12 hours to and from Isulan and for about 5 hours via Cotabato City, the nearest city.",
            "Several Utility Van (UV Express) in Davao City, General Santos, Tacurong City, Cotabato City and Isulan have routes for Lebak."
        ],
        [
            "Local transportation includes UV express, motor vehicles, trucks, modified motorcycle (habal-habal or skylab) and even horseback riding are common in some area.",
            "Motorboats are also available in coastal areas."
        ],
        [
            "This municipality has two airstrips: Lebak Municipal Airport (IATA: LWA 6°40′25″N 124°3′29″E﻿ / ﻿6.67361°N 124.05806°E﻿ / 6.67361; 124.05806), just 4 kilometers located at Kumalawit, Barangay Purikay is already concreted and will be fully operational accommodating from Cessna, turboprop to Airbus A320."
        ],
        [
            "Another way of reaching this municipality is by the sea.",
            "The existing Port of Lebak which is 9 km in nearby municipality of Kalamansig."
        ],
        [
            "Education"
        ],
        [
            "The town has total of 10 secondary schools, 2 in private and 8 public schools.",
            "Literacy rate is at 93% and mostly having a secondary education."
        ],
        [
            "Elementary education is divided into three districts: East, Central and West.",
            "These districts in total comprise the 11 primary schools, 26 elementary schools and three central schools of Lebak."
        ],
        [
            "Notre Dame of Salaman College"
        ],
        [
            "Public High School"
        ],
        [
            "E. Arcaño Mem.",
            "National High School (Basak National High School)"
        ],
        [
            "Lebak Legislated National High School"
        ],
        [
            "Purikay National High School"
        ],
        [
            "Tran National High School"
        ],
        [
            "Keytodac National High School"
        ],
        [
            "Mangudadatu National High School"
        ],
        [
            "Lebak National Highschool-Villamonte"
        ],
        [
            "Private High School"
        ],
        [
            "Salaman Institute (SI)"
        ],
        [
            "Notre Dame of Salaman College (NDSC) (High School)"
        ],
        [
            "Vocational and Tertiary Education"
        ],
        [
            "Notre Dame of Salaman College"
        ],
        [
            "Salaman Institute"
        ],
        [
            "West Celebes College of Technology, Inc."
        ],
        [
            "Lebak Family Doctors Hospital and School of Midwifery"
        ],
        [
            "List of Elementary School (Elementary School) and Primary School (Primary School)"
        ],
        [
            "Lebak East District – 11 Schools"
        ],
        [
            "Babato Primary School"
        ],
        [
            "Bolibak Elementary School"
        ],
        [
            "Christianuevo Primary School"
        ],
        [
            "Datu Karon Elementary School"
        ],
        [
            "Don M. Concha MElementary School (Taguisa Elementary School)"
        ],
        [
            "Nuling Elementary School"
        ],
        [
            "Pansud Elementary School"
        ],
        [
            "Purikay Central School"
        ],
        [
            "Tapudi Elementary School"
        ],
        [
            "Tinonggos Elementary School"
        ],
        [
            "Tran Elementary School"
        ],
        [
            "Lebak Central District – 13 Schools"
        ],
        [
            "Adalla Primary School"
        ],
        [
            "Bululawan Primary School"
        ],
        [
            "Capilan Elementary School"
        ],
        [
            "Dimapitan Elementary School"
        ],
        [
            "Elem Primary School"
        ],
        [
            "F. Parohinog MElementary School (Basak Elementary School)"
        ],
        [
            "Keytodac Central Elementary School"
        ],
        [
            "Kimakang Primary School"
        ],
        [
            "New Calinog Elementary School"
        ],
        [
            "S.A. Balabagan Primary School"
        ],
        [
            "Salangsang Elementary School"
        ],
        [
            "Tibong-tibong Primary School"
        ],
        [
            "Villamonte Elementary School"
        ],
        [
            "Lebak West District – 11 Schools"
        ],
        [
            "Ampad-Guibar MElementary School"
        ],
        [
            "B. Difunturom MElementary School (Poloy-Poloy Elementary School)"
        ],
        [
            "Barurao Elementary School"
        ],
        [
            "Gestosani Mem.",
            "Elementary School"
        ],
        [
            "Guintales Primary School"
        ],
        [
            "Kinudalan Elementary School"
        ],
        [
            "Lagandang Elementary School"
        ],
        [
            "Nabagbag Primary School"
        ],
        [
            "Pasandalan Elementary School"
        ],
        [
            "Posadas Primary School"
        ],
        [
            "Salaman Central Elementary School"
        ],
        [
            "Healthcare"
        ],
        [
            "The health services are categorized into two.",
            "Public health services and private health services.",
            "The capacity of public health services are 3 doctors, 16 nurses, 30 midwives with 28 health centers and the private services have 7, nurses 16 and 11 midwives with 6 clinics and 2 hospitals."
        ],
        [
            "Lebak Doctors Hospital"
        ],
        [
            "Lebak Santo Niño Hospital"
        ],
        [
            "Lebak Medical Group of Hospital"
        ],
        [
            "Medicare Community Hospital of Lebak"
        ],
        [
            "Lebak Family Doctors Hospital"
        ],
        [
            "Sabio Medical Clinic"
        ],
        [
            "Municipal Health Center (Birthing Section)"
        ],
        [
            "Labian Medical Clinic"
        ],
        [
            "Sister cities"
        ],
        [
            " City of Makati (since 2011)"
        ],
        [
            " Cotabato City"
        ],
        [
            "See also"
        ],
        [
            "Philippines portal"
        ],
        [
            "History of the Philippines"
        ],
        [
            "References"
        ],
        [
            "^ \"Mutya Pilipinas 2018 Miss Asia Pacific International, Sharifa Akeel shows the beauty of her Hometown Lebak, Sultan Kudarat\".",
            "Mutya ng Pilipinas.",
            "Mutya ng Pilipinas.",
            "July 9, 2019.",
            "Retrieved August 2, 2019."
        ],
        [
            "^  Municipality of Lebak |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ Census of Population (2020).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Community-Based Monitoring System\" (2018–2019).",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ Patajo-Legasto, Priscelina; Canon, Violeta C. (2008).",
            "Philippine Studies: Have We Gone Beyond St. Louis?.",
            "Diliman, Quezon City: University of the Philippines Press.",
            "p. 6.",
            "ISBN 9789715425919.",
            "Retrieved August 28, 2017."
        ],
        [
            "^ Pido, Antonio J.",
            "A.; Canon, Violeta C. (1967).",
            "The Urn Burial Caves: Salangsang, Salaman-Lebak, Cotabato.",
            "Manila: National science development board.",
            "Retrieved August 28, 2017."
        ],
        [
            "^ Guillermo, Artemio R. (2012).",
            "Historical Dictionary of the Philippines.",
            "Scarecrow Press.",
            "ISBN 9780810872462."
        ],
        [
            "^ \"\"Manobo\" or \"Manuvu\"\" (PDF).",
            "National Library of the Philippines.",
            "Retrieved November 13, 2017."
        ],
        [
            "^ \"Overview of Sultan Kudarat\".",
            "Archived from the original on July 26, 2014."
        ],
        [
            "^ \"Our Province\".",
            "Province of Cotabato."
        ],
        [
            "^ \"Chapter 4: An Overview of Mindanao History – Student Blogs\".",
            "students.ajperez.ph.",
            "Retrieved September 9, 2017."
        ],
        [
            "^ Parrado, J. G. (1893).",
            "Memoria acerca de Mindanao (in Spanish).",
            "Рипол Классик.",
            "p. 16.",
            "ISBN 9785882182242."
        ],
        [
            "^ Census of the Philippine Islands, 1903.",
            "Washington: United States Bureau of the Census.",
            "1905. p. 579.",
            "Retrieved August 28, 2017."
        ],
        [
            "^ Vance, Lee W.; Canon, Violeta C. (1980).",
            "Tracing Your Philippine Ancestors.",
            "Provo, Utah: Stevenson's Genealogical Center.",
            "p. 393.",
            "ISBN 9780960852802.",
            "Retrieved August 28, 2017."
        ],
        [
            "^ \"Act No.",
            "2711 GOVPH\".",
            "Official Gazette of the Republic of the Philippines.",
            "ARTICLE III Section 40.",
            "Retrieved September 2, 2017."
        ],
        [
            "^ Abaya‐Ulindang, Faina (May 2015).",
            "\"Land grabbing, conflict and agrarian‐environmental transformations: perspectives from East and Southeast Asia\".",
            "Land Resettlement Policies in Colonial and PostColonial Philippines: Key to Current Insurgencies and Climate Disasters in Its Southern Mindanao Island (Conference Paper No.",
            "54): 2."
        ],
        [
            "^ \"Overview of Cotabato\".",
            "Archived from the original on July 26, 2014.",
            "Retrieved September 6, 2017."
        ],
        [
            "^ \"Executive Order No.",
            "82, s. 1847\".",
            "Official Gazette of the Republic of the Philippines.",
            "Retrieved August 22, 2017."
        ],
        [
            "^ Lopez, Rogelio M. (1968).",
            "Agricultural Practices of the Manobo in the Interior of Southwestern Cotabato (Mindanao).",
            "University of San Carlos.",
            "p. 9."
        ],
        [
            "^ \"Executive Order No.",
            "195, s. 1948\".",
            "Official Gazette of the Republic of the Philippines.",
            "Retrieved August 22, 2017."
        ],
        [
            "^ \"Executive Order No.",
            "432, s. 1951\".",
            "Official Gazette of the Republic of the Philippines.",
            "Retrieved August 22, 2017."
        ],
        [
            "^ \"Executive Order No.",
            "459, s. 1961\".",
            "Official Gazette of the Republic of the Philippines.",
            "Retrieved August 22, 2017."
        ],
        [
            "^ a b Domingo, Ruben (June 1995).",
            "\"The Muslim Secessionist Movement in the Philippines: issues and prospects\" (PDF).",
            "Monterey, California.",
            "Naval Postgraduate School.",
            "Retrieved September 9, 2017."
        ],
        [
            "^ Pike, John.",
            "\"22nd Infantry Battalion\".",
            "www.globalsecurity.org."
        ],
        [
            "^ \"3ID\".",
            "January 18, 2012."
        ],
        [
            "^ \"Philippine Air Force: Official Website\".",
            "www.paf.mil.ph."
        ],
        [
            "^ Abat, Fortunato U.",
            "(1999).",
            "The Day We Nearly Lost Mindanao.",
            "FCA, Incorporated.",
            "p. 114.",
            "Retrieved September 6, 2017."
        ],
        [
            "^ McKenna, Thomas M. (1998).",
            "Muslim Rulers and Rebels: Everyday Politics and Armed Separatism in the Southern Philippines.",
            "University of California Press.",
            "p. 163.",
            "ISBN 9780520210165."
        ],
        [
            "^ Malinis, Rolando.",
            "BROTHERS: The Untold Story of the Philippine Military Academy \"Matatag\" Class of 1971 (PDF).",
            "Retrieved September 9, 2017."
        ],
        [
            "^ Lucman, Norodin Alonto (2000).",
            "\"Moro Archives: A History of Armed Conflicts in Mindanao and East Asia\".",
            "FLC Press.",
            "Retrieved September 6, 2017.",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ Macaraig, Ayee.",
            "\"The Leader I Want: Gringo Honasan's to-fix list for 2016\".",
            "Rappler.",
            "Retrieved September 6, 2017."
        ],
        [
            "^ \"PHILIPPINES – EARTHQUAKE AND TSUNAMI OF AUGUST 16,1976 IN THE PHILIPPINE ISLANDS – The Moro Gulf Tsunami – Dr. George Pararas-Carayannis\".",
            "www.drgeorgepc.com.",
            "November 22, 2012."
        ],
        [
            "^ Department, Commerce; Dunbar, Paula K. (2015).",
            "Pacific Tsunami Warning System: A Half Century of Protecting the Pacific, 1965–2015.",
            "Government Printing Office.",
            "pp. 46–47.",
            "ISBN 9780996257909.",
            "Retrieved August 22, 2017."
        ],
        [
            "^ \"7.9 MW moro Gulf earthquake\".",
            "Archived from the original on March 28, 2012.",
            "Retrieved July 29, 2011."
        ],
        [
            "^ \"Presidential Decree No.",
            "341, s. 1973\".",
            "Official Gazette of the Republic of the Philippines.",
            "Retrieved September 9, 2017."
        ],
        [
            "^ \"Provincial Profile\".",
            "Provincial Planning and Development Office of Sultan Kudarat."
        ],
        [
            "^ \"Forest Management Service\".",
            "r12.denr.gov.ph.",
            "Retrieved September 6, 2017."
        ],
        [
            "^"
        ],
        [
            "\"Lebak: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 15, 2020."
        ],
        [
            "^ \"Airport and Surface Synoptic Station\".",
            "Pagasa Information Center."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XII (Soccsksargen)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XII (Soccsksargen)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Sultan Kudarat\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b Department, Commerce; Dunbar, Paula K. (April 24, 2015).",
            "Pacific Tsunami Warning System: A Half Century of Protecting the Pacific, 1965–2015.",
            "Government Printing Office.",
            "pp. 46–47.",
            "ISBN 9780820349589.",
            "Retrieved August 22, 2017."
        ],
        [
            "^ a b c Council, National Competitiveness.",
            "\"Lebak\".",
            "www.cmcindex.org.ph."
        ],
        [
            "^ \"BFAR leads assessment of sanctuarie\".",
            "Manila Bulletin.",
            "March 23, 2011.",
            "Retrieved July 5, 2011."
        ],
        [
            "^ \"National Energy Administration Report of March 31, 2017\".",
            "National Energy Administration.",
            "Retrieved September 1, 2017."
        ],
        [
            "^ \"MEMBERSHIP LISTING – LEBAK & KALAMANSIG SUB OFFICE\".",
            "SULTAN KUDARAT ELECTRIC COOPERATIVE, INC. Retrieved September 1, 2017."
        ],
        [
            "^ \"ERC CASE NO.",
            "2015-179 RC\"."
        ],
        [
            "^ \"DTI opens SOCCSKSARGEN Region's 45th Negosyo Center in Lebak\".",
            "Philippine Information Agency.",
            "August 14, 2017.",
            "Archived from the original on August 22, 2017.",
            "Retrieved August 22, 2017."
        ],
        [
            "^ a b \"State of Local Governance Performance, Electronic Report\".",
            "Retrieved July 9, 2011."
        ],
        [
            "^ \"History\".",
            "Society of Mary.",
            "November 22, 2012."
        ],
        [
            "^ \"6 caves in Region 12 eyed for ecotourism\".",
            "MindaNews.",
            "Mindanao News and Information Center Service Cooperative (MNICSC.",
            "May 14, 2014.",
            "Retrieved August 22, 2017."
        ],
        [
            "^ estabillo, allen (February 8, 2013).",
            "\"2 caves primed to become part of Region 12's ecotourism circuit\".",
            "MindaNews.",
            "Mindanao News and Information Center Service Cooperative (MNICSC.",
            "Retrieved August 22, 2017."
        ],
        [
            "^ Karu, Yadu.",
            "\"Lebak celebrates its 70th Foundation Anniversary and 2nd Kapeonan Festival\".",
            "Yado Karu Blog.",
            "Retrieved September 1, 2017."
        ],
        [
            "^ Unson, John.",
            "\"Gov't, groups act to protect mangrove forests in Sultan Kudarat\".",
            "The Philippine Star.",
            "Retrieved August 26, 2017."
        ],
        [
            "^ \"FEATURE: SOX's Newest Destination: Katunggan Coastal Eco Park\".",
            "Philippine Information Agency.",
            "Archived from the original on September 1, 2017."
        ],
        [
            "^ Agriculture, Philippines Bureau of (1922).",
            "Bulletin."
        ],
        [
            "^ \"Report of the governor general of the Philippine Islands.",
            "\".",
            "quod.lib.umich.edu.",
            "Retrieved September 11, 2017."
        ],
        [
            "^ \"Construction and Improvement of Awang-Upi-Lebak- Kalamansig Road\" (PDF).",
            "Archived from the original (PDF) on October 3, 2011.",
            "Retrieved July 27, 2011."
        ],
        [
            "^ \"Infrastructure Projects Region XII\".",
            "Archived from the original on July 30, 2012.",
            "Retrieved July 27, 2011."
        ],
        [
            "^ \"President aquino meets region xii multistakeholders\".",
            "Archived from the original on October 3, 2011.",
            "Retrieved July 27, 2011."
        ],
        [
            "^ \"History\".",
            "Society of Mary.",
            "November 22, 2012."
        ],
        [
            "^ \"Jct.",
            "Awang — Upi — Lebak Road\".",
            "Department of Public Works and Highways.",
            "DPWH.",
            "Archived from the original on September 28, 2011.",
            "Retrieved July 3, 2011."
        ],
        [
            "^ \"Sultan Kudarat Travel Blog: Exploring Isulan – Trek to Tenubak Falls in Lebak\".",
            "Akrosdayunibers – Travel Blog."
        ],
        [
            "^ \"Port of Lebak\".",
            "Retrieved July 3, 2011."
        ],
        [
            "^ \"Elementary School in Region 12\".",
            "Retrieved July 3, 2011."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Lebak."
        ],
        [
            "Lebak Profile at PhilAtlas.com"
        ],
        [
            "Lebak Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Lebak"
        ],
        [
            "Datu Blah T. Sinsuat, Maguindanao / South Upi, Maguindanao"
        ],
        [
            "Ampatuan, Maguindanao"
        ],
        [
            "Celebes Sea"
        ],
        [
            "Lebak"
        ],
        [
            "EsperanzaIsulan"
        ],
        [
            "Kalamansig"
        ],
        [
            "vte Province of Sultan KudaratIsulan (capital)Municipalities"
        ],
        [
            "Bagumbayan"
        ],
        [
            "Columbio"
        ],
        [
            "Esperanza"
        ],
        [
            "Isulan"
        ],
        [
            "Kalamansig"
        ],
        [
            "Lambayong"
        ],
        [
            "Lebak"
        ],
        [
            "Lutayan"
        ],
        [
            "Palimbang"
        ],
        [
            "President Quirino"
        ],
        [
            "Senator Ninoy Aquino"
        ],
        [
            "Component city"
        ],
        [
            "Tacurong"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Lebak&oldid=1214307586\""
        ],
        [
            "Categories: Municipalities of Sultan KudaratPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 errors: missing periodicalCS1 Spanish-language sources (es)CS1: long volume valueCS1 maint: numeric names: authors listAll articles with dead external linksArticles with dead external links from February 2020Articles with permanently dead external linksArticles with short descriptionShort description is different from WikidataWikipedia articles in need of updating from June 2020All Wikipedia articles in need of updatingUse Philippine English from March 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from March 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Maguindanaon-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from October 2018Commons category link is on WikidataPages using the Kartographer extension"
        ]
    ]
}