{
    "name": "Lianga",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Lianga"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°37′59″N 126°05′36″E﻿ / ﻿8.632958°N 126.093217°E﻿ / 8.632958; 126.093217"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Surigao del Sur, Philippines"
        ],
        [
            "For the racehorse, see Lianga (horse)."
        ],
        [
            "Municipality in Caraga, PhilippinesLiangaMunicipalityMunicipality of LiangaKansilad Beach Resort in Lianga"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "Magkono Capital of Surigao"
        ],
        [
            "Seafood Capital of Surigao del Sur"
        ],
        [
            "Map of Surigao del Sur with Lianga highlightedOpenStreetMapLiangaLocation within the PhilippinesCoordinates: 8°37′59″N 126°05′36″E﻿ / ﻿8.632958°N 126.093217°E﻿ / 8.632958; 126.093217CountryPhilippinesRegionCaragaProvinceSurigao del SurDistrict"
        ],
        [
            "1st districtFoundedOctober 17, 1919Barangays13"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 129.3 million (2020) • Assets₱ 151.3 million (2020) • Expenditure₱ 171.3 million (2020) • Liabilities₱ 52.29 million (2020)Service provider • ElectricitySurigao del Sur 2 Electric Cooperative (SURSECO 2)Time zoneUTC+8 (PST)ZIP code8307PSGC166811000IDD : area code +63 (0)86Native languagesSurigaonon Agusan Cebuano TagalogWebsitewww.lianga.gov.ph"
        ],
        [
            "Lianga, officially the Municipality of Lianga (Surigaonon: Lungsod nan Lianga; Tagalog: Bayan ng Lianga), is a 4th class municipality in the province of Surigao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 33,869 people."
        ],
        [
            "Etymology and legends"
        ],
        [
            "A couple of centuries ago, along the bountiful bay facing the bluish sea of the Pacific Ocean, was a place like those in fairy tales.",
            "The white beaches were traversed by two rivers, one in the south and the other in the north.",
            "A little distance from the shoreline, the landscape started to rise until it reached its peak in the west, which is one of the ranges of the enchanted Mount Diwata.",
            "The place was thickly forested, blanketed with big trees, varieties of wild flowers, aerial plants, and vines.",
            "On the ground, wild animals of different species roam around the area.",
            "White, colorful birds and other winged creatures flit from tree to tree.",
            "Nature's music, like the chirping of birds, the humming of bees, and other wood-land insects intermingling with the sound of roaring waves, could be heard from a distance.",
            "This truly translates to the feeling of being born free in nature.",
            "The place was breathtaking to behold.",
            "Indeed, it was paradise where nature remained undisturbed."
        ],
        [
            "Then men settled along the cove near the river in the south.",
            "It was said that these early inhabitants were the Manobos, who were ruled by a chieftain (datu).",
            "Their clothes were made of woven abaca fiber and adorned with multi-colored beads.",
            "Land and water resources were abundant; hence, they loved to hunt in the forest, gather shells along the shores, and fish in the rivers.",
            "There was peace and harmony among the early inhabitants.",
            "They were happy and content.",
            "Later, however, as their tribes increased, their descendants thought of moving to surrounding areas, so there was rivalry as to who would own which pieces of land.",
            "Whenever disputes over land ownership and quarrels among themselves occurred, they were settled in a duel alongside the river in the north.",
            "Whoever won was proclaimed a \"Daugan\" or \"Mananaog\" by the chieftain (datu).",
            "The place became popular; hence, the river was named Pananag-an."
        ],
        [
            "People going to the other side of the river have to wade across it slowly as the current was swift; it always took them such time to reach the other side of the river, and they often say to themselves, \"Langan pagtabok\" or \"Malangan kita\" (It delays to cross or we will be delayed).",
            "One day, as the old folks claimed, a foreigner passed by the place.",
            "After having crossed the river, he asked the people the name of the place.",
            "Thinking that the stranger was asking what they were doing, they answered, \"Langan pagtabok\".",
            "The foreigner heard \"Langan\" and thought it was the name of the place, then people started calling the whole settlement \"Langan\".",
            "Later, with the influence of the Spanish \"Li\" alphabet, Langan was pronounced \"Liangan\".",
            "As generations passed, the final \"N\" in Llangan was dropped, and the \"Ll\" sound was changed to \"Li\", hence saying that is how Lianga got its name."
        ],
        [
            "History"
        ],
        [
            "Lianga is one of the oldest towns of the province of Surigao del Sur by virtue of Executive Order No.",
            "27 on October 17, 1919.",
            "The municipality of Lianga is centrally located in the province of Surigao del Sur.",
            "It is situated along the Lianga Bay facing the Pacific Ocean and cradled by its shorelines and the Diwata Mountains.",
            "Its latitude is 30 and longitude is within 12635 and is bounded on the north by the Municipality of San Agustin, on the south by the Municipality of Barobo, on the west by the province of Agusan del Sur and the east lies the Pacific Ocean.",
            "It is 90.0 kilometers to the south of Tandag City, the capital of the province, 237 kilometers from Davao City, 121 kilometers from Butuan and 16 kilometers from Prosperidad, the capital town of Agusan del Sur (via Lianga–Los Arcos Road)."
        ],
        [
            "In the history of Caraga Region, Lianga was part of the encomienda way back in 1655 under the command of Sergeant Martin Sanchez dela Cuesta.",
            "This encomienda covered Palaso (Cantilan).",
            "Tandag as its capital, Tago, Marihatag and Lianga.",
            "From 1904 to 1936, the head of the town was called President, per record obtained, the first elected president of Lianga was Cornelio Layno, whose two-year term covered the period from 1904 to 1906.",
            "The first elected mayor was Otilio Navarro, who served from 1937 to 1940.",
            "From then on, there were seven elected mayors of Lianga from 1941 up to the present.",
            "Within these periods, two became mayors by succession, another two by appointment."
        ],
        [
            "Almost half a century ago, the territorial land area of Lianga was vast, considering the fact that the present municipalities of San Agustin, Marihatag and Barobo were once a part of Lianga.",
            "The births of these three municipalities were the results of political subdivisions authored by the political leaders of the undivided Surigao.",
            "San Agustin, formerly called Oteiza, was the first daughter municipality of Lianga created under Executive Order No.",
            "445 in 1951, during the presidency of Elpidio Quirino.",
            "The governor of Surigao that time was Vicente L. Pimentel.",
            "Four years later, the Municipality of Marihatag was created under Republic Act No.",
            "1261 on June 10, 1955.",
            "As the population of Lianga increased, it was not spared from further political subdivision.",
            "The electorate in the southern barrios of Lianga moved for the creation of another municipality, called the Municipality of Barobo, as the seat of the municipal government.",
            "The creation of the Municipality of Barobo was made through Executive Order no.",
            "407 and 2786 on October 24, 1960.",
            "Of the three municipalities created from the municipality of Lianga, Marihatag has the largest land area.",
            "It is sad to note that among these four municipalities formerly referred to as the \"BLOM\" Area (for Barobo, Lianga, Oteiza, and Marihatag) Lianga, the mother municipality has the smallest land area with only 15,000 hectares."
        ],
        [
            "Significant development in Lianga has been noted since 1960 with the creation of Surigao del Sur as a province (Republic Act 2786).",
            "It was more evident in the 1970s to 1980s when the coastal barangay of Diatagon  which was a rich source of income.",
            "The town of Lianga, too that time started to gain a breakthrough not only in the infrastructure projects such as roads and government buildings but also in income derived from taxes especially from forest products used by the wood processing plant of LBLCI.",
            "Barangay Saint Christine has become the minor urban center and Lianga was classified as the influence center of the satellite municipalities of San Agustin, Marihatag, and Barobo."
        ],
        [
            "Lianga is a relatively urbanized area where 13,830 or 55.30% of the total population live in the three urban centers of Barangays Poblacion, Saint Christine, and Diatagon"
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Pugad Beach Resort"
        ],
        [
            "Lianga is politically subdivided into 13 barangays.",
            "Each barangay consists of puroks, while some have sitios."
        ],
        [
            "Anibongan"
        ],
        [
            "Ban-as"
        ],
        [
            "Banahao"
        ],
        [
            "Baucawe"
        ],
        [
            "Diatagon  (also has a large public market)"
        ],
        [
            "Ganayon"
        ],
        [
            "Liatimco"
        ],
        [
            "Manyayay"
        ],
        [
            "Payasan"
        ],
        [
            "Poblacion"
        ],
        [
            "Saint Christine"
        ],
        [
            "San Isidro"
        ],
        [
            "San Pedro"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lianga"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28.8(83.8)"
        ],
        [
            "29.0(84.2)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "30.9(87.6)"
        ],
        [
            "31.5(88.7)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "31.5(88.7)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "31.2(88.2)"
        ],
        [
            "30.4(86.7)"
        ],
        [
            "29.4(84.9)"
        ],
        [
            "30.6(87.1)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "25.2(77.4)"
        ],
        [
            "25.3(77.5)"
        ],
        [
            "25.8(78.4)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "26.3(79.3)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "26.4(79.6)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21.6(70.9)"
        ],
        [
            "21.6(70.9)"
        ],
        [
            "21.9(71.4)"
        ],
        [
            "22.4(72.3)"
        ],
        [
            "23.0(73.4)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "22.5(72.5)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.2(72.0)"
        ],
        [
            "22.0(71.6)"
        ],
        [
            "22.3(72.2)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "639(25.2)"
        ],
        [
            "486(19.1)"
        ],
        [
            "401(15.8)"
        ],
        [
            "288(11.3)"
        ],
        [
            "259(10.2)"
        ],
        [
            "217(8.5)"
        ],
        [
            "205(8.1)"
        ],
        [
            "194(7.6)"
        ],
        [
            "205(8.1)"
        ],
        [
            "220(8.7)"
        ],
        [
            "334(13.1)"
        ],
        [
            "532(20.9)"
        ],
        [
            "3,980(156.6)"
        ],
        [
            "Source: Climate-Data.org"
        ],
        [
            "Lianga has a tropical rainforest climate (Af) with heavy to very heavy rainfall year-round."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LiangaYearPop.±% p.a.1903 5,471—    1918 8,789+3.21%1939 15,770+2.82%1948 15,872+0.07%1960 17,182+0.66%1970 18,742+0.87%1975 19,897+1.21%1980 22,981+2.92%1990 24,908+0.81%1995 25,005+0.07%2000 25,014+0.01%2007 27,006+1.06%2010 28,905+2.50%2015 29,493+0.38%2020 33,869+2.76%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Lianga"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  29.20"
        ],
        [
            "2009  37.03"
        ],
        [
            "2012  29.24"
        ],
        [
            "2015  38.69"
        ],
        [
            "2018  30.04"
        ],
        [
            "2021  33.52"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "Festival"
        ],
        [
            "Inatu Festival – \"Inatu\" is from the kamayo language means \"our very own\".",
            "Celebrated every January."
        ],
        [
            "Education"
        ],
        [
            "North Eastern Mindanao State University – Lianga Campus"
        ],
        [
            "Lianga National Comprehensive High School"
        ],
        [
            "R. Moreno Integrated School"
        ],
        [
            "St. Christine National High School (Fishery)"
        ],
        [
            "Anibongan National High School"
        ],
        [
            "Davisol National High School"
        ],
        [
            "Diatagon Catholic High School (Private) and 19 Elementary Schools including Our Lady of Pompei School (Private)"
        ],
        [
            "Lumad schools"
        ],
        [
            "There are several Lumad community schools built by Lumads tribes themselves."
        ],
        [
            "Alternative Learning Center for Agricultural and Livelihood Development (ALCADEV) Inc."
        ],
        [
            "Tribal Filipino Program of Surigao del Sur (TRIFPSS) Inc."
        ],
        [
            "These Lumad schools have been in the vanguard in fighting for the ancestral lands and the rights of the Lumad."
        ],
        [
            "The Department of Education (Deped) recognized the Lumad community schools and the ALCADEV system through the Indigenous framework of education now observed by alternative tribal schools nationwide."
        ],
        [
            "2015 Lianga Massacre"
        ],
        [
            "On September 1, 2015, executive director of ALCADEV was killed right inside the school premises while two other Lumad leaders, Dionel Campos, and Datu Bello Sinzo were killed in front of the community by the paramilitary group Magahat-Bagani."
        ],
        [
            "National Literacy Awards"
        ],
        [
            "These Lumad schools in Lianga have been awarded the Most Outstanding Literacy Program of Caraga region and in the Philippines for several years.",
            "This award is given by the Department of Education – Literacy Coordinating Council."
        ],
        [
            "Controversy"
        ],
        [
            "There are allegations that both schools are not recognized by the Department of Education thus their curriculum are not accredited.",
            "In effect, students who would like to transfer to other DepEd recognized school is a big challenge continuing the year level of the student.",
            "If student would like to move to high school or college is not possible."
        ],
        [
            "Tourism"
        ],
        [
            "Bao-bao Falls – Barangay Diatagon"
        ],
        [
            "Puro or Lianga Lighthouse – Barangay Poblacion"
        ],
        [
            "Tagago Beach – Barangay Poblacion"
        ],
        [
            "Kansilad Beach – Barangay Ganayon"
        ],
        [
            "Lawis Beach – Barangay Banahao"
        ],
        [
            "Causeway Beach – Barangay St. Christine"
        ],
        [
            "Mahogany Road – Barangay Diatagon"
        ],
        [
            "Little Nest or Tagaytay – Barangay San Pedro"
        ],
        [
            "Pocto Cave – Barangay Manyayay"
        ],
        [
            "Pamutuanan Cave – Barangay Liatimco"
        ],
        [
            "Gran Ola Eco Surf Camp – Barangay Banahao (Lawis)"
        ],
        [
            "Baugo Seaside Resort – Barangay Baucawe"
        ],
        [
            "Busay Falls – Barangay Payasan"
        ],
        [
            "Ancestral Houses – Barangay Poblacion"
        ],
        [
            "Baywalk – Barangay Poblacion"
        ],
        [
            "Big Times Beach Resort – Barangay Poblacion"
        ],
        [
            "Davisol Mountain Trekking – Barangay Manyayay"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Lianga |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b Souvenir Program Great Jubilee Year Celebration 2000"
        ],
        [
            "^ \"Climate: Lianga\".",
            "Climate-Data.org.",
            "Retrieved October 25, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Caraga\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Caraga\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Surigao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Lumad alternative schools recognized by DepEd –rights advocate\".",
            "GMA News Online.",
            "September 8, 2015.",
            "Retrieved March 15, 2022."
        ],
        [
            "^ Lacorte, Germelina (June 19, 2016).",
            "\"School a distant dream for 'lumad'\".",
            "Philippine Daily Inquirer.",
            "Retrieved March 15, 2022."
        ],
        [
            "^ Sy, Jose Monfred (July 19, 2020). \"",
            "Teaching without schools?",
            "Lumad education under lockdown\".",
            "Rappler.",
            "Retrieved March 15, 2022."
        ],
        [
            "^ Padilla, Stephen Norries A.",
            "(November 5, 2012).",
            "\"An inclusive education that respects indigenous cultures\".",
            "Philippine Daily Inquirer.",
            "Retrieved March 15, 2022."
        ],
        [
            "^ \"A year after the Lianga massacre: No arrests of paramilitary perpetrators, military troops still in the villages | Karapatan\".",
            "Karapatan.",
            "September 1, 2016.",
            "Retrieved June 1, 2021."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Lianga."
        ],
        [
            "Lianga Profile at PhilAtlas.com"
        ],
        [
            "Lianga Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Lianga"
        ],
        [
            "San Agustin"
        ],
        [
            "Prosperidad, Agusan del Sur"
        ],
        [
            "Lianga"
        ],
        [
            "Lianga Bay (Philippine Sea)"
        ],
        [
            "Barobo"
        ],
        [
            "vte Province of Surigao del SurTandag (capital)Municipalities"
        ],
        [
            "Barobo"
        ],
        [
            "Bayabas"
        ],
        [
            "Cagwait"
        ],
        [
            "Cantilan"
        ],
        [
            "Carmen"
        ],
        [
            "Carrascal"
        ],
        [
            "Cortes"
        ],
        [
            "Hinatuan"
        ],
        [
            "Lanuza"
        ],
        [
            "Lianga"
        ],
        [
            "Lingig"
        ],
        [
            "Madrid"
        ],
        [
            "Marihatag"
        ],
        [
            "San Agustin"
        ],
        [
            "San Miguel"
        ],
        [
            "Tagbina"
        ],
        [
            "Tago"
        ],
        [
            "Component cities"
        ],
        [
            "Bislig"
        ],
        [
            "Tandag"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Lianga&oldid=1224613150\""
        ],
        [
            "Category: Municipalities of Surigao del SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link is on WikidataPages using the Kartographer extension"
        ]
    ]
}