{
    "name": "Libagon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Libagon"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°18′N 125°03′E﻿ / ﻿10.3°N 125.05°E﻿ / 10.3; 125.05"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Southern Leyte, Philippines"
        ],
        [
            "This article has multiple issues.",
            "Please help improve it or discuss these issues on the talk page.",
            "(Learn how and when to remove these template messages)"
        ],
        [
            "This article may require cleanup to meet Wikipedia's quality standards.",
            "The specific problem is: The article contains a lot of uncited text and is not very neutral in tone.",
            "Please help improve this article if you can.",
            "(May 2022) (Learn how and when to remove this message)"
        ],
        [
            "This article contains wording that promotes the subject in a subjective manner without imparting real information.",
            "Please remove or replace such wording and instead of making proclamations about a subject's importance, use facts and attribution to demonstrate that importance.",
            "(May 2022) (Learn how and when to remove this message)"
        ],
        [
            "The neutrality of this article is disputed.",
            "Relevant discussion may be found on the talk page.",
            "Please do not remove this message until conditions to do so are met.",
            "(May 2022) (Learn how and when to remove this message)"
        ],
        [
            " (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesLibagonMunicipalityMunicipality of LibagonRizal Park of Libagon"
        ],
        [
            "FlagSealMap of Southern Leyte with Libagon highlightedOpenStreetMapLibagonLocation within the PhilippinesCoordinates: 10°18′N 125°03′E﻿ / ﻿10.3°N 125.05°E﻿ / 10.3; 125.05CountryPhilippinesRegionEastern VisayasProvinceSouthern LeyteDistrict"
        ],
        [
            "2nd districtFounded1913Barangays14"
        ],
        [
            " (see Barangays)Government  • TypeSangguniang Bayan • MayorSabina B. Ranque (PDPLBN) • Vice MayorElizabeth L. Saldivar (PDPLBN) • RepresentativeChristopherson M. Yap • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Concesa S. ArriolaTomas T. Endico Jr.Marvin A. MagaipoProtacio C. EdilloMario Oliver B. RanqueEdgar A. PeñaredondoDionesio B. Amparo Sr.Sulficia C. Endriga"
        ],
        [
            " • Electorate10,711 voters (2022)Area • Revenue₱ 89.65 million (2020) • Assets₱ 316 million (2020) • Expenditure₱ 122.8 million (2020) • Liabilities₱ 69.33 million (2020)Service provider • ElectricitySouthern Leyte Electric Cooperative (SOLECO)Time zoneUTC+8 (PST)ZIP code6615PSGC086405000IDD : area code +63 (0)53Native languagesBoholano dialect Cebuano TagalogWebsitewww.libagon-sleyte.gov.ph"
        ],
        [
            "Libagon, officially the Municipality of Libagon (Cebuano: Lungsod sa Libagon; Tagalog: Bayan ng Libagon), is a 5th class municipality in the province of Southern Leyte, Philippines.",
            "According to the 2020 census, it has a population of 15,244 people."
        ],
        [
            "It is home to the province's frontier mountain, Mount Patag Daku."
        ],
        [
            "Every 16 July and 8 December, Libagon celebrates two separate town fiestas, the Feast of Our Lady of Mount Carmel respectively."
        ],
        [
            "The main sources of income for the residents of Libagon are copra, abacá, agriculture, and fishing."
        ],
        [
            "Etymology"
        ],
        [
            "Libagon's name was derived from the Cebuano dialect, libaong, which means 'small depression of the ground'.",
            "Spanish authorities mistook the reference to the ground fault as the name of the place.",
            "As such, the area has been known as Libagon."
        ],
        [
            "History"
        ],
        [
            "The Dagohoy revolt prompted more Boholanos to settle the southern towns of Leyte, especially in Hilongos, Bato, Matalom, Maasin, Macrohon, Malitbog, and Hinunangan.",
            "In 1771, seventeen families from the different towns of Bohol migrated to the southeastern coast of Sogod.",
            "These families founded the visita (satellite barrio with chapel) of Libagon.",
            "Andres Espina, a resident of Tamolayag (now the town of Padre Burgos), Malitbog, was invited to instruct the children how to read and write.",
            "Despite its growing population, Libagon was only recognized as a visita of Sogod sometime in 1850."
        ],
        [
            "The \"Balwarte\" where the Japanese soldiers camp during World War II"
        ],
        [
            "The earliest known settlers of Libagon were of Bol-anon ancestry (Boholano people).",
            "The settlers' first chosen leader was Domingo Mateo Espina.",
            "Espina's wife, Potenciana Escaño, was called Capitana Potenciana by the townsfolk in recognition of her role as First Lady of Libagon.",
            "The town of Libagon was founded in 1845."
        ],
        [
            "By March 1870, Don Gabriel Ydjao became the chief executive of Sogod and transferred the poblacion (town center) to Libagon.",
            "Since Ydjao was a native of Libagon, and probably because Sogod was far from his residence, he changed Libagon's name to Sogod Nuevo (other historical accounts stated that Libagon was renamed Sogod Sur) and Sogod as Sogod Viejo (which other historical accounts named as Sogod Norte).",
            "Ydjao also appealed to the parish curate, Padre Logronio, to transfer the parish church to Libagon, a year after Sogod was made a parish.",
            "The church in Libagon would remain there until 1924, when a group of concerned Sogodnons pleaded with Bishop Sofronio Hacbang y Gaborni of Calbayog to return the seat of the parish to Sogod."
        ],
        [
            "During the incumbency of Don Luis Espina as gobernadorcillo (1891 to 1893), the visita of Maak was reduced to a sitio of barrio Consolacion.",
            "With Maak's status being demoted, Sogod Viejo was also placed under the jurisdiction of the visita of Hipgasan."
        ],
        [
            "At some point in time, possibly during the years following 1845 until 1885, Libagon was deemed a barrio of Sogod, together with Bontoc and Consolacion.",
            "In 1885, Nicolas Idjao was elected as gobernadorcillo and transferred the poblacion of Sogod to Libagon, 22 kilometres (14 mi) from Sogod.",
            "He then renamed Libagon as Sogod Nuevo or Sogod Del Norte and Sogod as Sogod Viejo or Sogod Del Sur.",
            "After twelve years of power, the poblacion was restored to Sogod for a while when Benito Faelnar was appointed as capitan municipal of Sogod.",
            "But in 1904, Ladislao or \"Estanislao\" Decenteceo was elected and transferred the poblacion to Barangay Consolacion, a barrio 12 kilometres (7.5 mi) from Libagon.",
            "However, in 1912, the poblacion was again transferred to Sogod when Vicente Cariño took office."
        ],
        [
            "On 16 October 1913, Libagon and Sogod were finally separated into two independent towns – Libagon (14 barrios) and Sogod (45 barrios).",
            "The challenges of an increasing population necessitated the division.",
            "The new Libagon was under the administration of the new Presidente Municipal, Mariano L. Espina."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Libagon is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Biasong"
        ],
        [
            "Bogasong"
        ],
        [
            "Cawayan"
        ],
        [
            "Gakat"
        ],
        [
            "Jubas (Poblacion)"
        ],
        [
            "Magkasag"
        ],
        [
            "Mayuga"
        ],
        [
            "Nahaong"
        ],
        [
            "Nahulid"
        ],
        [
            "Otikon"
        ],
        [
            "Pangi"
        ],
        [
            "Punta"
        ],
        [
            "Talisay (Poblacion)"
        ],
        [
            "Tigbao"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Libagon, Southern Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "78(3.1)"
        ],
        [
            "57(2.2)"
        ],
        [
            "84(3.3)"
        ],
        [
            "79(3.1)"
        ],
        [
            "118(4.6)"
        ],
        [
            "181(7.1)"
        ],
        [
            "178(7.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "172(6.8)"
        ],
        [
            "180(7.1)"
        ],
        [
            "174(6.9)"
        ],
        [
            "128(5.0)"
        ],
        [
            "1,598(62.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.7"
        ],
        [
            "13.8"
        ],
        [
            "17.3"
        ],
        [
            "18.5"
        ],
        [
            "23.2"
        ],
        [
            "26.5"
        ],
        [
            "27.1"
        ],
        [
            "26.0"
        ],
        [
            "26.4"
        ],
        [
            "27.5"
        ],
        [
            "24.6"
        ],
        [
            "21.0"
        ],
        [
            "268.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LibagonYearPop.±% p.a.1903 4,642—    1918 5,719+1.40%1939 6,318+0.48%1948 7,173+1.42%1960 7,891+0.80%1970 9,231+1.58%1975 9,519+0.62%1980 10,516+2.01%1990 11,239+0.67%1995 10,754−0.82%2000 12,907+3.99%2007 14,283+1.41%2010 14,352+0.18%2015 15,169+1.06%2020 15,244+0.10%Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "The Cebuano language and Boholano dialect (Binol-anon) are commonly spoken in Libagon, with slight linguistic variations in form, meaning or context.",
            "The Filipino language (or Tagalog) and English are taught in elementary and high school."
        ],
        [
            "Religion"
        ],
        [
            "Libagonons (or Libagonians) are predominantly Roman Catholic."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Libagon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  30.30"
        ],
        [
            "2009  42.09"
        ],
        [
            "2012  40.90"
        ],
        [
            "2015  42.24"
        ],
        [
            "2018  28.12"
        ],
        [
            "2021  26.31"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "Feasts"
        ],
        [
            "The town celebrates its annual fiesta in honor of their patron saint, the Blessed Virgin Mary of The Immaculate Conception, on 8 December.",
            "She is also the principal patroness of the Philippines.",
            "Other main Catholic holy days, including the local feasts of barangays, are observed throughout the year."
        ],
        [
            "Caro floral decoration with the Our Lady of Mt.",
            "Carmel"
        ],
        [
            "Besides the main fiesta on 8 December, every 16 July, Libagonians also celebrate the feast of Our Lady of Mount Carmel.",
            "They are devoted to Mother Mary and have a firm belief in Mary's general aid and prayerful assistance.",
            "The day after the feast, the traditional Pangilis is held.",
            "(Pangilis, from the root word \"ilis\", means \"change\".)",
            "On 17 July, at the break of dawn, bugle is sounded to awake people.",
            "This is called dayana in the local dialect; it is a yearly custom to start the Pangilis solemnization and festivity in this way.",
            "(\"Dayana\" comes from the Spanish word diana, which means reveille.).",
            "The former ermano-ermana hands over the holy image of the Our Lady of Mount Carmel to the home of the succeeding (h)ermano or (h)ermana mayor for the following year's fiesta in a procession joined by townsfolk of Libagon, mostly from the poblacion.",
            "Before the Pangilis, devotees (Carmelitas or Carmelites) who pledge support for the coming year's celebration are also enlisted.",
            "Then, after the street parade, street dancing begins, ending on or before midnight.",
            "This affair is usually led by that year's chosen or designated \"King and Queen\" of Pangilis.",
            "In recent celebrations, a Pangilis Idol is determined in a contest of talents, usually dancing dressed in imaginative costumes."
        ],
        [
            "Similarly, these two feasts feature the colorful karo (carriage) that carries the holy image of the Blessed Virgin Mary on a ceremonial procession after the novena and mass held on the evening before the feast day.",
            "Both the karo and the church's altar are usually adorned with creative floral arrangements."
        ],
        [
            "The Parish of the Immaculate Conception"
        ],
        [
            "See also: Wooden Churches of Maramures"
        ],
        [
            "The first church and convent built by Libagonons were constructed using only wood.",
            "The tradition of building wooden churches dates back from the Middle Ages until the turn of the 18th century.",
            "The skills, knowledge and experience required to build a log structure were considered out of the ordinary for that time period.",
            "As commonly practiced in the past, the construction of the church, chapel, convent and town hall were made possible through bayanihan, a spirit of communal unity or effort to achieve a particular goal.",
            "A resident of the proper age would volunteer at least one day a week to help with the construction.",
            "Volunteers ascended the mountains to look for timber for the church's pillars and some wood used in other means, like wood joints, posts, floors, etc.",
            "; this was usually done on Saturdays.",
            "The wood used was Narra trees (pterocarpus), Molave trees (vitex parviflora), White Lauan (shorea contorta) and other rainforest trees in the forested mountains of Libagon.",
            "The largest pillars were huge trees bigger than the circumference of a man's (or two men's) outstretched arms.",
            "The task of dragging down the trees (with very strong ropes on both ends) from the mountainous jungle on narrow access was indeed a hazardous challenge to the men.",
            "In like manner, another group of volunteers brought gongs and drums to tap a repeated rhythmic beat and synchronized the pushing and pulling down of the timber while together they howled, \"HIIIIBOOOYYYY....\" While on an abrupt slope, restraining the heavy log was crucial to prevent it from running over someone and avoid breakage of the tree.",
            "Each of them brought their own food and an ample amount of coconut wine (tuba) stored in a baler shell or bamboo container to quench their thirst.",
            "Despite all these, the bayanihan spirit of the Libagonons rose above the arduousness of the endeavor and wiped out any exhaustion they felt."
        ],
        [
            "Aside from timber, the church's foundations were made of crushed rocks, stones and sand that were hauled, made into tablets of stone, and framed as walls.",
            "The stone walls stood nearly at 5 to 6 feet tall, laid on top with lumber that continued up to the ceiling.",
            "The groundwork for every column was deep and durable.",
            "As cement, they used stones and sand daubed with whipped egg whites mixed with lime to reinforce the pillars."
        ],
        [
            "The first parish priest of Libagon was Padre Don Tomas Logroño from Inabanga, Bohol.",
            "He graduated from Colegio-Seminario de San Carlos of Cebu (presently known as San Carlos Major Seminary of Cebu).",
            "He arrived in Libagon in June 1870.",
            "He was instrumental in the materialization of Libagon's earliest parish and convent.",
            "He bought articles and other religious items needed in the church.",
            "He served as Libagon's parish priest for 12 years.",
            "In April 1882, he transferred to the town of Macrohon, Southern Leyte until his demise on 21 October 1901."
        ],
        [
            "Government"
        ],
        [
            "Century-old Spanish-designed Libagon Town Hall"
        ],
        [
            "List of former chief executives"
        ],
        [
            "During the early years of the Spanish regime, the town's leader was addressed as the \"Capitan\", similar to Alcalde Municipal or Presidente Municipal, and is currently addressed as \"Municipal Mayor\".",
            "The recorded succession of leaders in Libagon from Spanish to American regimes to the Postwar period (Philippine Independence) from 1946–1965 are is follows:"
        ],
        [
            "Capitan Domingo Espina"
        ],
        [
            "Capitan Pedro Espina"
        ],
        [
            "Capitan Felix Espina"
        ],
        [
            "Capitan Estanislao Decenteceo"
        ],
        [
            "1870-Gobernadorcillo-Don Gabriel Ydjao"
        ],
        [
            "1885-Gobernadorcillo-Don Nicolas Idjao"
        ],
        [
            "1889-1891-Gobernadorcillo-Don Cepriano Lebiste (Tomas Jabonillo)"
        ],
        [
            "1913-1916 ...Presidente Municipal Mariano L. Espina"
        ],
        [
            "1917-1920 ...Presidente Municipal Macario Logroňo"
        ],
        [
            "1921-1928 ...Presidente Municipal Mariano L. Espina"
        ],
        [
            "1929-1931 ...Presidente Municipal Fabio Bayon"
        ],
        [
            "1931-1932 ...Presidente Municipal Isidro Pajuyo"
        ],
        [
            "1933-1940 ...Municipal Mayor Rito Monte de Ramos"
        ],
        [
            "1941-1944 ...Municipal Mayor Gregorio E. Edillo"
        ],
        [
            "1944-1945 ...Municipal Mayor Francisco E. Espina"
        ],
        [
            "1945-1946 ...Municipal Mayor Gregorio E. Edillo"
        ],
        [
            "1946-1947 ...Municipal Mayor Joaquin Siega"
        ],
        [
            "1948-1951 ...Municipal Mayor Francisco E. Espina"
        ],
        [
            "1952-1955 ...Municipal Mayor Agustin E. Espina"
        ],
        [
            "1956-1959 ...Municipal Mayor Mario E. Espina"
        ],
        [
            "1960-1963 ...Municipal Mayor Rito Monte de Ramos"
        ],
        [
            "1964-1967 ...Municipal Mayor Mario E. Espina"
        ],
        [
            "During the Japanese occupation of the Philippines (1942–1945), Petronilo \"Liloy\" Ebarle was appointed as the Municipal Mayor from 1942 to 1944.",
            "However, the guerrillas alluded to him as a \"puppet mayor\".",
            "Though Mayor Ebarle held the Japanese-appointed position, Mayor Gregorio E. Edillo continued to be the official leader under the authority of the Philippine Commonwealth with the United States.",
            "On the other hand, the people also recognized the command of the guerrilla forces of Leyte or the Leyte Area Command under Colonel Ruperto Kangleon, and supported the supervision of the Volunteer Guards in the town level.",
            "There were only two leaders of the Volunteer Guards in Libagon; the first was Lieutenant Francisco Barros, followed by Francisco \"Dodo\" Espina."
        ],
        [
            "The only Libagonian officials of the Leyte Area Command (LAC) were Lieutenant Catalino \"Nongnong\" E. Soledad, Lieutenant Feliciano \"Lily\" A. Espina and Lieutenant Marcelo \"Celing\" E. Espina, who were also officers of USAFFE (U.S. Army Forces in the Far East).",
            "These three Libagonians fought in the Battle of Bataan, which represented the most intense phase of Imperial Japan's invasion of the Philippines during World War II.",
            "Marcelino Espina did not return to his hometown; his body was left on the battlefield of Bataan.",
            "He was the younger brother of Francisco \"Dodo\" Espina, who became the town's mayor for two terms.",
            "Like Celing, many guerrillas from Libagon died during the war.",
            "A memorial stone (Ang Bato sa Paghandum) was built in memory of these men of Libagon.",
            "Their names were engraved on granite to honor their lives and monumentalize their memory and courageous deed.",
            "The Memorial Stone now stood in the midst of Libagon Rizal Park."
        ],
        [
            "The Contemporary period includes the final years of the Third Republic (1965–72) and the entirety of the Fourth Republic (1972–86) to the succeeding years following the 1986 People Power Revolution."
        ],
        [
            "1968 - 1979 ...Municipal Mayor Salvador M. Resma"
        ],
        [
            "1979 - 1986 ...Municipal Mayor Domingo P. Espina"
        ],
        [
            "1986 - 1992 ...Municipal Mayor Rogato J. Paitan"
        ],
        [
            "1992 - 2001 ...Municipal Mayor Domingo P. Espina"
        ],
        [
            "2001 - 2010 ...Municipal Mayor Rizalina Espina née Bañez (formerly a.k.a.",
            "Inday S. Bañez)"
        ],
        [
            "2010 – 2019.",
            "Municipal Mayor Oliver E. Ranque"
        ],
        [
            "Tourism"
        ],
        [
            "Libagon is the home of natural areas that are excellent for ecotourism and adventure travel."
        ],
        [
            "Patag Daku Rain Forest"
        ],
        [
            "View from Patag Daku facing the Pacific Ocean"
        ],
        [
            "Patag Daku is located in Libagon, Southern Leyte, in the upper or mountainside of the poblacion in Talisay."
        ],
        [
            "Patag Daku means \"big plain\".",
            "It is actually a valley so dense in vegetation that novice campers and mountaineers cannot come in or out without an experienced guide leading the way.",
            "But the trek to the valley is a major climb.",
            "Not the leisurely stroll that one might expect, the climb is an arduous six-hour journey through a maze of trees, ferns, moss, grass and big trees."
        ],
        [
            "Patag Daku is a mossy forest of more than 500 hectares of unexplored, uncharted wilderness, fraught with dangerous tales of huge snakes and wild animals."
        ],
        [
            "Uwan-Uwanan Falls"
        ],
        [
            "Rock climbing at Uwan-uwanan Falls"
        ],
        [
            "Uwan-uwanan falls is located in barangay Kawayan, Libagon.",
            "The gorge is a world-class adventure wonder.",
            "Climbing, swimming and trekking rolled into one."
        ],
        [
            "Uwan-uwanan, literally means \"resembling a rainfall\" because the two-hour track entails an enchanting encounter of an \"uwan-uwanan\".",
            "And at the top, photo enthusiasts are in for a marvelous treat.",
            "At exactly 12:00 noon when the sun is directly above the middle of the narrow opening at the gorge, the natural light is awe-inspiring as it dramatically illuminates the whole area resembling a magnificent altar in a cathedral or a place of worship."
        ],
        [
            "Hindag-an Falls"
        ],
        [
            "Hindag-an Falls is a natural wonder found in St. Bernard, Southern Leyte.",
            "Just about 1 kilometer away from the roadside.",
            "The place displays natural waterfalls with man-made pools.",
            "In every waterfall is a pool of particular depth.",
            "The deepest was about 10–15 feet wherein you need to jump from above the rocks to get to the pool.",
            "There is also a pool for children about 2 ft. and also a water slide."
        ],
        [
            "Pangi Black Sand Beach"
        ],
        [
            "The beach in barangay Pangi is of fine black sands usually great for swimming, hiking and ecotourism.",
            "Other black sand beaches can also be found in more places than anyone thinks, like the famous black sand beaches of Polynesia, Indonesia, Iceland, the Caribbean islands and the Punaluʻu Black Sand Beach in Hawaii, were created virtually instantaneously by the violent interaction between hot lava and sea water."
        ],
        [
            "The suspicion of a volcano close to Libagon may explain the black sand beach formation in barangay Pangi.",
            "But there is no exact evidence on this suspicion as verified by the concerned agency."
        ],
        [
            "Biasong Springs"
        ],
        [
            "Biasong Spring one of Southern Leyte's best springs.",
            "Many Libagonians get their drinking water here."
        ],
        [
            "Biasong Springs is one of the oldest spring in Southern Leyte.",
            "It is located in the barangay of Biasong.",
            "The clear spring water is collected into a man-made basin or pool."
        ],
        [
            "The place is a favorite of the locals providing cool mountain spring water.",
            "A pool that has been the site of many happy occasions: birthday picnics, homecoming celebrations, etc.",
            "It has perhaps the sweetest mineral spring water in the province and most uncontaminated source."
        ],
        [
            "Peter's Mound"
        ],
        [
            "Peter's Mound is a sea mound located 200 meters (650 ft.) offshore from barrio Otikon."
        ],
        [
            "The mound is a cleaning station for large pelagics.",
            "Animals to see are: wrasse, grouper, sweetlips, surgeons, fusiliers, tuna, and jacks together with other species of reef fish."
        ],
        [
            "Municipal Town Hall"
        ],
        [
            "Libagon has a century-old and well-preserved Spanish style municipal hall.",
            "The structure gives a glimpse of the town's rich heritage.",
            "It is amongst Southern Leyte's premier historical sites and landmarks - the pride of Southern Leyte."
        ],
        [
            "Bulwark (Ang Balwarte)"
        ],
        [
            "This is the only memorial left of the Lungsod-Daan or the original location of the town center of Libagon.",
            "It is made of boulders or tablets of rock, limestone and gravel.",
            "This structure is made strong and formidable as a defensive fortification against the Moros (Muslim) from the big island of Mindanao.",
            "See also Moro people (section: Spanish period)."
        ],
        [
            "Strategically located, the edifice is overlooking Sogod Bay and the two deltas of the islands of Limasawa and Panaon.",
            "The Bulwark or Balwarte at the old town center is near the big river named Tubig-Daku, below and adjacent to the existing cemetery.",
            "This is also where the Japanese soldiers camped during World War II."
        ],
        [
            "Old Pantalan (Seaport)"
        ],
        [
            "Jubas Boulevard and Sogod Bay"
        ],
        [
            "The ruins of the old pantalan or seaport still stand along the shores of the Poblacion in Jubas.",
            "Recently, the entire seacoast along Sogod Bay is transformed into a \"park by the bay\" also commonly referred to as the Boulevard in Jubas ideal for walks and for viewing the sunset while fishermen on their lighted bancas or boats scatter all over the bay.",
            "This is seen most specially during peak fish season."
        ],
        [
            "Besides, the beautiful sunset along Sogod Bay, the whale-sharks in Southern Leyte are simply at home in Sogod Bay.",
            "Whale-sharks or Rhyncodon typus are popularly known locally as iho-tiki.",
            "Recent sightings confirm that whale-sharks actually are all over Sogod Bay.",
            "They were spotted in San Francisco, Southern Leyte, as well as in Limasawa, Malitbog, Libagon, Sogod, Pintuyan and even as far as San Ricardo.",
            "In fact, they had long been ordinary fare for small fishermen.",
            "People have gotten used to them that young boys ride on their backs as they scour for plankton along the village shores.",
            "Though, there is no 100 percent guarantee to spot a whale-shark in Sogod Bay.",
            "It takes proper timing, good weather, and a huge amount of luck to see one.",
            "Patience is the name of the game.",
            "The best time to see whale-sharks in Southern Leyte is April and May."
        ],
        [
            "Libagon Rizal Park"
        ],
        [
            "Like most local governments from Luzon to Visayas and Mindanao, a Rizal monument is erected to commemorate the Philippines' national hero, Dr. Jose Rizal, regarded as the foremost Filipino patriot.",
            "The Rizal monument stands at the Libagon Rizal Park, a significant landmark of Libagon located strategically in the midst of the poblacion."
        ],
        [
            "Education"
        ],
        [
            "The Parish Convent cum Libagon High School"
        ],
        [
            "Like the old church, several large pillars made the convent strong.",
            "The large convent was built beside the church.",
            "Unlike the old sanctuary, the old friary was providentially spared from being burned down during the war.",
            "The structure defied many strong typhoons, hurricanes, and vigorous quakes—a token of the superior groundwork."
        ],
        [
            "Earlier, the friary being the home of the parish priest and church servants was also used as the house of the first Catholic educational institution of Libagon and the first and only High school.",
            "The limited funds to set up a Secondary school moved the founders to appeal to Bishop Manuel Mascariñas (in Palo, Leyte) for his approval to use some of the rooms of the convent.",
            "Because Libagon High School was dedicated to be a Catholic institution the Bishop acceded to the request and even allowed the High School to use the church's plaza as well."
        ],
        [
            "Libagon Academy Foundation, Inc. old building"
        ],
        [
            "Initially known as the \"Libagon High School, Inc.\", the establishment basically taught Catechism – training for the young Catholic faithful with questions and answers about the essentials of Catholic faith and doctrine so that they could understand easily their faith.",
            "Besides the 3 R's (Reading, Writing and Arithmetic), the Spanish language was normally taught at that time.",
            "Music, however, was especially instructed.",
            "Musicians, songwriters, singers and choirmaster were trained for the church's choir.",
            "The same musicians completed the town's band that was well known among other bands in the province."
        ],
        [
            "The Bureau of Private Schools suggested that the establishment be given another name that would signify it as a non-public school.",
            "Thus, the Board of Trustees signed a resolution renaming the High School as, \"Libagon Academy.\"",
            "Consequently, they renamed the corporation as, \"Libagon Academy Foundation, Inc.\""
        ],
        [
            "In another resolution the Board decided to make the Academy a non-profit organization.",
            "All proceeds (if there was any at all) were used to improve the schoolhouse.",
            "The modest tuition enabled all primary school graduates to continue their education in High school in their own town instead of spending more to attend school in nearby provinces, or stop and work in the farm or simply marry.",
            "However, the low tuition prevented the academy to some earnings, thus the resolution.",
            "After all, the many professionals – the teachers, doctors, lawyers, engineers, auditors, seamen, nurses, and many other professionals as products of Libagon Academy—became undoubtedly the biggest dividend of a simple and unassuming town, such as, Libagon."
        ],
        [
            "The Libagon Academy was yet another product of the bayanihan spirit among Libagonians.",
            "The forerunners and shareholders, who were also parents and widowed mothers after the war, were driven with the same purpose to give reasonable education to their children.",
            "And as donation, they pulled together some of their own personal belongings (like pocket books, magazines, notebooks, etc.)",
            "to the academy.",
            "These admirable men and women were motivated by the selfless efforts of the founders of the first Libagon High School (renamed Libagon Academy) despite stiff disapproval from some factions."
        ],
        [
            "In June 1949, Libagon Academy opened its doors for its first day of classes.",
            "The institution remained to be the only premier Catholic educational organization of the municipality of Libagon."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "See also: Pan-Philippine Highway"
        ],
        [
            "Ordinarily, the habal-habal(s) or single motorcycles are used as modes of transportation in crossing Sogod and to other distant and mountainous areas.",
            "Sogod is the major terminus in the south central portion in Leyte Island.",
            "It is the vital link in connecting Visayas to Mindanao.",
            "The buses, jeepneys, and for-hire vans terminate from Sogod to Maasin City, Ormoc City, Tacloban City, Bato-Hilongos, Liloan (by way of Libagon), Hinunangan and Silago."
        ],
        [
            "The Libagon Highway is part of the Pan-Philippine Highway, also known as the Maharlika Highway (AH26).",
            "It is a 3517 km network of roads, bridges, and ferry services that connect the islands of Luzon, Samar, Leyte, and Mindanao in the Philippines, serving as the country's principal transport backbone.",
            "The northern terminus of the highway is at Laoag City, and the southern terminus is at Zamboanga City."
        ],
        [
            "In addition, traveling to Manila from Libagon approximately takes 24 hours by bus along with ferry from Northern Samar to Matnog.",
            "The trip is a scenic interprovincial ride.",
            "Philtranco buses are long known to serve this route."
        ],
        [
            "Telecommunication"
        ],
        [
            "Mobile: service is provided through Smart Communications, Globe Telecom, and Sun Cellular."
        ],
        [
            "Internet: Wireless Internet through SMART Network (Smart Bro) and Globe Network (Globe Tattoo)."
        ],
        [
            "Cable Television: Dream Satellite TV"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Libagon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on 25 May 2021.",
            "Retrieved 16 July 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Fermin, Margret (16 July 2020).",
            "\"Feast of Our Lady of Mount Carmel masses celebration | Philippines Lifestyle News\".",
            "philippineslifestyle.com.",
            "Retrieved 23 December 2021."
        ],
        [
            "^ \"Feast of the Immaculate Conception spotlights Philippine devotion to Mary\".",
            "Catholics & Cultures.",
            "22 May 2015.",
            "Retrieved 23 December 2021."
        ],
        [
            "^ \"Libagon\".",
            "southernleyte.gov.ph.",
            "Retrieved 23 December 2021."
        ],
        [
            "^ Espina, Francisco Sr., Ang Lungsod sa Libagon, 1985."
        ],
        [
            "^ Espina 1985, Gibalhin Ang Lungsod, p. 3."
        ],
        [
            "^ Espina 1985, Nabahin sa Duha ang Lungsod sa Libagon, p. 13."
        ],
        [
            "^ \"Libagon, Southern Leyte Profile – PhilAtlas\".",
            "www.philatlas.com.",
            "Retrieved 23 December 2021."
        ],
        [
            "^"
        ],
        [
            "\"Libagon, Southern Leyte : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 6 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Southern Leyte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved 28 December 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Espina, Francisco Sr., Gitukod Ang Simbahan, Kombento Ug Balay-Lungsod, p.5."
        ],
        [
            "^ Espina, Francisco Sr., Gitukod Ang Simbahan, Kombento Ug Balay-Lungsod, p.6."
        ],
        [
            "^ a b Espina, Francisco Sr., Ang Unang Pari sa Libagon, p.7."
        ],
        [
            "^ Espina 1985, Mga Punoan sa Libagon, p. 21."
        ],
        [
            "^ Espina 1985, Mga Punoan sa Libagon, p. 22."
        ],
        [
            "^ Espina 1985, Mga Opisyales sa Leyte Area Command, p. 39."
        ],
        [
            "^ \"Patag Daku in Libagon\".",
            "Archived from the original on 6 March 2012."
        ],
        [
            "^ \"Conquering Patag Daku\".",
            "Archived from the original on 28 July 2011."
        ],
        [
            "^ \"Southern Leyte\"."
        ],
        [
            "^ \"The Amazing UWAN-UWANAN FALLS, Libagon, So.",
            "Leyte\".",
            "Archived from the original on 12 March 2012."
        ],
        [
            "^ Chong, Joaquin.",
            "Suspicion of a Volcano Close to Libagon.",
            "Maasin City, Southern Leyte.",
            "p. 26."
        ],
        [
            "^ \"Sogod Bay Tales & Images\".",
            "Geocities."
        ],
        [
            "^ \"Towns and Cities -SOUTHERN LEYTE (Region VIII:Eastern Visayas)-LIBAGON\"."
        ],
        [
            "^ \"Dive sites in Leyte\"."
        ],
        [
            "^ \"Southern Leyte Philippines Dive Sites Destination\"."
        ],
        [
            "^ \"The Provincial Tourism Department Invites You to Visit Southern Leyte\"."
        ],
        [
            "^ \"The Whalesharks of Southern Leyte\".",
            "Tour Leyte.",
            "Archived from the original on 11 January 2010."
        ],
        [
            "^ Espina 1985, Natukod Ug Gibuksan Ang Libagon Academy, p. 44."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Libagon."
        ],
        [
            "Libagon Profile at PhilAtlas.com"
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Sogodbay Area Tales & Images"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Libagon"
        ],
        [
            "Sogod"
        ],
        [
            "Sogod Bay"
        ],
        [
            "Libagon"
        ],
        [
            "HinunanganSaint Bernard"
        ],
        [
            "Liloan"
        ],
        [
            "vte Province of Southern LeyteMaasin (capital and largest city)Municipalities"
        ],
        [
            "Anahawan"
        ],
        [
            "Bontoc"
        ],
        [
            "Hinunangan"
        ],
        [
            "Hinundayan"
        ],
        [
            "Libagon"
        ],
        [
            "Liloan"
        ],
        [
            "Limasawa"
        ],
        [
            "Macrohon"
        ],
        [
            "Malitbog"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pintuyan"
        ],
        [
            "Saint Bernard"
        ],
        [
            "San Francisco"
        ],
        [
            "San Juan"
        ],
        [
            "San Ricardo"
        ],
        [
            "Silago"
        ],
        [
            "Sogod"
        ],
        [
            "Tomas Oppus"
        ],
        [
            "Component City"
        ],
        [
            "Maasin"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Libagon&oldid=1164047837\""
        ],
        [
            "Category: Municipalities of Southern LeyteHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing cleanup from May 2022All pages needing cleanupCleanup tagged articles with a reason field from May 2022Wikipedia pages needing cleanup from May 2022Articles with peacock terms from May 2022All articles with peacock termsWikipedia neutral point of view disputes from May 2022All Wikipedia neutral point of view disputesArticles with multiple maintenance issuesUse dmy dates from September 2022Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from February 2022Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}