{
    "name": "Libon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Libon, Albay"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°18′N 123°26′E﻿ / ﻿13.300°N 123.433°E﻿ / 13.300; 123.433"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Albay, Philippines"
        ],
        [
            "This article has multiple issues.",
            "Please help improve it or discuss these issues on the talk page.",
            "(Learn how and when to remove these template messages)"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Libon, Albay\" – news · newspapers · books · scholar · JSTOR (February 2021) (Learn how and when to remove this message)"
        ],
        [
            "This article contains content that is written like an advertisement.",
            "Please help improve it by removing promotional content and inappropriate external links, and by adding encyclopedic content written from a neutral point of view.",
            "(February 2021) (Learn how and when to remove this message)"
        ],
        [
            " (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bicol Region, PhilippinesLibonMunicipalityMunicipality of LibonLibon church"
        ],
        [
            "FlagSealNickname(s): Rice Granary of the Province of Albay, Birthplace of Christianity in the Bicol RegionAnthem: Libon HymnMap of Albay with Libon highlightedOpenStreetMapLibonLocation within the PhilippinesCoordinates: 13°18′N 123°26′E﻿ / ﻿13.300°N 123.433°E﻿ / 13.300; 123.433CountryPhilippinesRegionBicol RegionProvinceAlbayDistrict"
        ],
        [
            "3rd districtFounded1573Barangays47"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorWilfredo V. Maronilla • Vice MayorMarkgregor Edward C. Sayson • RepresentativeFernando T. Cabredo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Daniel S. DycocoRamon Martin L. VelascoEdna S. SazonRamon Ferdinand E. VelascoApolonio S. SeDomingo B. SamsonJohn Andrew S. RaneraFlorian F. Briones"
        ],
        [
            " • Electorate46,379 voters (2022)Area • Revenue₱ 315.8 million (2020) • Assets₱ 890 million (2020) • Expenditure₱ 182 million (2020) • Liabilities₱ 142.2 million (2020)Service provider • ElectricityAlbay Power and Energy Corporation  (APEC)Time zoneUTC+8 (PST)ZIP code4507PSGC050507000IDD : area code +63 (0)52Native languagesTagalogWebsitewww.libon.gov.ph"
        ],
        [
            "Libon, officially the Municipality of Libon (Central Bikol: Banwaan kan Libon; Tagalog: Bayan ng Libon), is a 1st class municipality in the province of Albay, Philippines.",
            "According to the 2020 census, it has a population of 75,073 people."
        ],
        [
            "Libon occupies an area of 222.76 square kilometres (86.01 sq mi).",
            "It is about 37 kilometres (23 mi) west-north-west of the provincial capital of Albay Legazpi City, and about 300 kilometres (190 mi) east-south-east of Manila.",
            "It is classified as a partly urban municipality with 47 barangays subdivided into seven leagues: St. James (Poblacion), Lakeside (barangays within the vicinity of Bato Lake), Coastal (barangays located along the Albay West Coast), Big Five (barangays abundant in rice, corn, and vegetables), Interior Nine (hinterland barangays principally engaged in vegetable production and livestock raising), Palayan (barangays largely devoted to rice production), and Six Hills (barangays concentrating on coconut production)."
        ],
        [
            "Libon's major economic activities are agriculture and fishing.",
            "Its 4,000 hectares (9,900 acres) of rice fields produce 30.4 million kilos or 608,000 bags of palay per year, earning the district the sobriquet \"Rice Granary of Albay\".",
            "Libon is also the seat of the Pantao Port, a regional port facility linking the Masbate island province, the Visayas and Mindanao to mainland Bicol towards Southern Luzon and the National Capital Region."
        ],
        [
            "Etymology"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            "The town of Libon, as it is presently known was originally called Libong.",
            "It is not known when and how the letter \"g\" got dropped.",
            "Some writers believe that the Spaniards must have found it difficult to pronounce the word \"Libong\" with the letter g, so that in due time Libong became Libon.",
            "There are conflicting and various versions regarding the origin of the name Libong.",
            "Some say that the word must have been derived from the Bicol term \"libong\" or \"ribong\", meaning puzzled, dizziness, losing one's sense of direction, or becoming oriented.",
            "Others believe that the word Libon must have originated from a Spanish term \"libon\", which means \"assault\"."
        ],
        [
            "Another version is that the word is a corruption of the Bicol word \"libtong\", meaning difficulty, obstacle or pool of stagnant water, which when applied to a place could mean a difficult or stagnant place.",
            "The more popular and perhaps more plausible version is the claim that Libon originated from the Bicol term \"libong\" or \"ribong\", and there is a story which seems to support this view.",
            "The story goes that Captain Juan de Salcedo and his men arrived in this place, by sailing across Lake Bato and entering the river called, Quimba.",
            "Sailing upstream, they finally landed in a place called Linao; (Linao is one of the barrios of Libon today and is situated on the banks of Quimba River).",
            "Here Salcedo and his men proceeded to find a town.",
            "However, after exploring the surrounding area and noting that Linao was at the foot of a mountain range, making it vulnerable to enemy attacks from the surrounding mountains, Salcedo and his men, with some natives as their guide, decided to move on to a more suitable place.",
            "Traveling across marshy land, they arrived at a slightly elevated area.",
            "Upon looking around and trying to determine where they were, one native guide remarked \"libong aco\".",
            "(I am confused).",
            "The Spaniards on hearing the word \"libong\" understood it to mean the name of the place.",
            "Hence, Salcedo named it \"Santiago de Libon.\""
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            "The city of Libon traces its origins to the “Second Expedition of Juan de Salcedo to the Bicol Region in 1573.”  He spent an undisclosed amount of time searching for the rumored mines, but returned to Manila upon the orders of his uncle vowing to return to the Bicol Region as soon as he could."
        ],
        [
            "He accomplished this in early 1573.",
            "“Salcedo undertook his second trip to the Bicol Region retracing his first route and with the wealth of information that he gathered during his first arrival in the region, he led his men beyond Paracale.”"
        ],
        [
            "It appears from the accounts about the finding of Libon that this town, indeed, occupies a prominent place in the history of the Bicol Region for two main reasons.",
            "First, it is the first settlement for Spaniards established in the Bicol Region, and by no less than Captain de Salcedo, recognized as the Spanish “Conquistador” of this part of Luzon.",
            "Second, Libon, during the early days of the Spanish conquest of Bicolandia, also served as the starting point for the organized propagation of the Christian faith in this region.",
            "Also, Libon possessed a prosperous and complex precolonial society, that is why it was chosen as a royal villa."
        ],
        [
            "Saint James the Greater Parish"
        ],
        [
            "Santiago el Mayor, Patron Saint of Libon"
        ],
        [
            "In 1573, Juan de Salcedo set up the garrison named Santiago de Libong, and a church was constructed under the patronage of Saint James the Apostle.",
            "In 1578, when the Franciscans arrive, it was ceded to the province under San Gregorio Magno.",
            "A church made of red bricks was constructed in Linao in 1591.",
            "This church was destroyed in mid 17th century and a new church was constructed."
        ],
        [
            "In 1847, the town was ceded to Albay from Camarines.",
            "Huerta reported that the new church was reconstructed by Vicente de Dosbarrios in 1865 and it was made of solid bricks, while the casa parroquial was made of stone.",
            "The church was destroyed by a strong earthquake in 1907 and it had to reconstructed with new materials."
        ],
        [
            "Geography"
        ],
        [
            "Libon is located at 13°18′N 123°26′E﻿ / ﻿13.3°N 123.43°E﻿ / 13.3; 123.43."
        ],
        [
            "According to Mr. pogi - JErico housing growth rate is 1.08% per annum, the municipality has a land area of 222.76 square kilometres (86.01 sq mi)  constituting 8.65% of the 2,575.77-square-kilometre- (994.51 sq mi) total area of Albay."
        ],
        [
            "The municipality lies at the Northwestern Quadrant of the province of Albay.",
            "The distance is about 46-54 kilometers away from Legazpi City and approximately 546 kilometers south of Manila.",
            "It is located geographically between 1308’2’’ and 20’354.5’’ north and between 1243014’25.2’’ and 29’19.4’’ east longitude.",
            "Libon is bounded on the North by the Municipality of Bato in the province of Camarines Sur; on the South by the municipality of Oas; on the East by the municipality of Polangui; and on the West by the Burias Pass and Ragay Gulf."
        ],
        [
            "The topography of Libon is generally characterized as plain to undulating; extensive alluvial floodplain on its eastern flank, gently rolling to sloping uplands and steep mountains on its central western parts."
        ],
        [
            "The elevation ranges from 0 – 400 meters above sea level.",
            "More than five percent of the area has elevation ranging from 100 to 150 meters above sea level.",
            "The surface terrain is generally plain.",
            "Barangays in the Big Six, Centro Poblacion, and Palayan League mostly constitute the plain areas.",
            "The barangays within the Coastal League occupies the coastal zones of 664 hectares although 40 percent of its area is mountainous surface terrain."
        ],
        [
            "The municipality has six types of soil.",
            "The predominant soil type is the Agustin Soil or clay-loam which is mostly found in the leagues of Interior Eight, Big Six, and Six Hills.",
            "The Magsaysay Soil or the sandy-loam is identified in the coastal areas and is suitable for rice production.",
            "The Sevilla Soil or clay and sandy-clay type are principally in hilly landscape."
        ],
        [
            "Barangays"
        ],
        [
            "Libon is politically subdivided into 47 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 050507001   Alongong"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,529"
        ],
        [
            " 1,403"
        ],
        [
            "  ▴"
        ],
        [
            " 0.86%"
        ],
        [
            " 050507002   Apud"
        ],
        [
            " 2.6%"
        ],
        [
            " 1,938"
        ],
        [
            " 2,004"
        ],
        [
            "  ▾"
        ],
        [
            " −0.33%"
        ],
        [
            " 050507003   Bacolod"
        ],
        [
            " 1.9%"
        ],
        [
            " 1,450"
        ],
        [
            " 1,211"
        ],
        [
            "  ▴"
        ],
        [
            " 1.82%"
        ],
        [
            " 050507011   Bariw"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,297"
        ],
        [
            " 1,206"
        ],
        [
            "  ▴"
        ],
        [
            " 0.73%"
        ],
        [
            " 050507012   Bonbon"
        ],
        [
            " 5.1%"
        ],
        [
            " 3,820"
        ],
        [
            " 3,310"
        ],
        [
            "  ▴"
        ],
        [
            " 1.44%"
        ],
        [
            " 050507013   Buga"
        ],
        [
            " 5.0%"
        ],
        [
            " 3,748"
        ],
        [
            " 3,503"
        ],
        [
            "  ▴"
        ],
        [
            " 0.68%"
        ],
        [
            " 050507014   Bulusan"
        ],
        [
            " 2.9%"
        ],
        [
            " 2,169"
        ],
        [
            " 2,064"
        ],
        [
            "  ▴"
        ],
        [
            " 0.50%"
        ],
        [
            " 050507015   Burabod"
        ],
        [
            " 2.7%"
        ],
        [
            " 2,057"
        ],
        [
            " 2,002"
        ],
        [
            "  ▴"
        ],
        [
            " 0.27%"
        ],
        [
            " 050507016   Caguscos"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,051"
        ],
        [
            " 980"
        ],
        [
            "  ▴"
        ],
        [
            " 0.70%"
        ],
        [
            " 050507017   East Carisac"
        ],
        [
            " 1.3%"
        ],
        [
            " 947"
        ],
        [
            " 839"
        ],
        [
            "  ▴"
        ],
        [
            " 1.22%"
        ],
        [
            " 050507019   Harigue"
        ],
        [
            " 1.2%"
        ],
        [
            " 876"
        ],
        [
            " 819"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 050507020   Libtong"
        ],
        [
            " 1.2%"
        ],
        [
            " 886"
        ],
        [
            " 819"
        ],
        [
            "  ▴"
        ],
        [
            " 0.79%"
        ],
        [
            " 050507021   Linao"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,544"
        ],
        [
            " 1,445"
        ],
        [
            "  ▴"
        ],
        [
            " 0.66%"
        ],
        [
            " 050507022   Mabayawas"
        ],
        [
            " 0.5%"
        ],
        [
            " 404"
        ],
        [
            " 473"
        ],
        [
            "  ▾"
        ],
        [
            " −1.56%"
        ],
        [
            " 050507023   Macabugos"
        ],
        [
            " 3.8%"
        ],
        [
            " 2,840"
        ],
        [
            " 2,614"
        ],
        [
            "  ▴"
        ],
        [
            " 0.83%"
        ],
        [
            " 050507024   Magallang"
        ],
        [
            " 0.7%"
        ],
        [
            " 512"
        ],
        [
            " 436"
        ],
        [
            "  ▴"
        ],
        [
            " 1.62%"
        ],
        [
            " 050507025   Malabiga"
        ],
        [
            " 1.1%"
        ],
        [
            " 857"
        ],
        [
            " 966"
        ],
        [
            "  ▾"
        ],
        [
            " −1.19%"
        ],
        [
            " 050507026   Marayag"
        ],
        [
            " 1.3%"
        ],
        [
            " 966"
        ],
        [
            " 1,099"
        ],
        [
            "  ▾"
        ],
        [
            " −1.28%"
        ],
        [
            " 050507027   Matara"
        ],
        [
            " 1.2%"
        ],
        [
            " 894"
        ],
        [
            " 856"
        ],
        [
            "  ▴"
        ],
        [
            " 0.44%"
        ],
        [
            " 050507028   Molosbolos"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,084"
        ],
        [
            " 1,094"
        ],
        [
            "  ▾"
        ],
        [
            " −0.09%"
        ],
        [
            " 050507029   Natasan"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,033"
        ],
        [
            " 1,021"
        ],
        [
            "  ▴"
        ],
        [
            " 0.12%"
        ],
        [
            " 050507045   Niño Jesus (Santo Niño Jesus)"
        ],
        [
            " 0.5%"
        ],
        [
            " 342"
        ],
        [
            " 390"
        ],
        [
            "  ▾"
        ],
        [
            " −1.30%"
        ],
        [
            " 050507030   Nogpo"
        ],
        [
            " 3.0%"
        ],
        [
            " 2,281"
        ],
        [
            " 2,118"
        ],
        [
            "  ▴"
        ],
        [
            " 0.74%"
        ],
        [
            " 050507031  Pantao"
        ],
        [
            " 9.2%"
        ],
        [
            " 6,930"
        ],
        [
            " 6,767"
        ],
        [
            "  ▴"
        ],
        [
            " 0.24%"
        ],
        [
            " 050507033   Rawis"
        ],
        [
            " 3.0%"
        ],
        [
            " 2,250"
        ],
        [
            " 2,234"
        ],
        [
            "  ▴"
        ],
        [
            " 0.07%"
        ],
        [
            " 050507034   Sagrada Familia"
        ],
        [
            " 2.2%"
        ],
        [
            " 1,666"
        ],
        [
            " 1,591"
        ],
        [
            "  ▴"
        ],
        [
            " 0.46%"
        ],
        [
            " 050507035   Salvacion"
        ],
        [
            " 0.7%"
        ],
        [
            " 518"
        ],
        [
            " 475"
        ],
        [
            "  ▴"
        ],
        [
            " 0.87%"
        ],
        [
            " 050507036   Sampongan"
        ],
        [
            " 0.6%"
        ],
        [
            " 458"
        ],
        [
            " 403"
        ],
        [
            "  ▴"
        ],
        [
            " 1.29%"
        ],
        [
            " 050507037   San Agustin"
        ],
        [
            " 3.4%"
        ],
        [
            " 2,570"
        ],
        [
            " 2,460"
        ],
        [
            "  ▴"
        ],
        [
            " 0.44%"
        ],
        [
            " 050507038   San Antonio"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,519"
        ],
        [
            " 1,423"
        ],
        [
            "  ▴"
        ],
        [
            " 0.65%"
        ],
        [
            " 050507039   San Isidro"
        ],
        [
            " 2.5%"
        ],
        [
            " 1,883"
        ],
        [
            " 1,670"
        ],
        [
            "  ▴"
        ],
        [
            " 1.21%"
        ],
        [
            " 050507040   San Jose"
        ],
        [
            " 4.0%"
        ],
        [
            " 2,982"
        ],
        [
            " 2,973"
        ],
        [
            "  ▴"
        ],
        [
            " 0.03%"
        ],
        [
            " 050507041   San Pascual"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,229"
        ],
        [
            " 1,143"
        ],
        [
            "  ▴"
        ],
        [
            " 0.73%"
        ],
        [
            " 050507042   San Ramon"
        ],
        [
            " 1.0%"
        ],
        [
            " 764"
        ],
        [
            " 795"
        ],
        [
            "  ▾"
        ],
        [
            " −0.40%"
        ],
        [
            " 050507043   San Vicente"
        ],
        [
            " 4.0%"
        ],
        [
            " 2,989"
        ],
        [
            " 2,733"
        ],
        [
            "  ▴"
        ],
        [
            " 0.90%"
        ],
        [
            " 050507044   Santa Cruz"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,514"
        ],
        [
            " 1,443"
        ],
        [
            "  ▴"
        ],
        [
            " 0.48%"
        ],
        [
            " 050507046   Talin-Talin"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,555"
        ],
        [
            " 1,496"
        ],
        [
            "  ▴"
        ],
        [
            " 0.39%"
        ],
        [
            " 050507047   Tambo Walis"
        ],
        [
            " 1.1%"
        ],
        [
            " 862"
        ],
        [
            " 838"
        ],
        [
            "  ▴"
        ],
        [
            " 0.28%"
        ],
        [
            " 050507049   Villa Petrona"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,497"
        ],
        [
            " 1,372"
        ],
        [
            "  ▴"
        ],
        [
            " 0.88%"
        ],
        [
            " 050507018   West Carisac"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,053"
        ],
        [
            " 1,014"
        ],
        [
            "  ▴"
        ],
        [
            " 0.38%"
        ],
        [
            " 050507004   Zone I (Poblacion)"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,486"
        ],
        [
            " 1,379"
        ],
        [
            "  ▴"
        ],
        [
            " 0.75%"
        ],
        [
            " 050507005   Zone II (Poblacion)"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,249"
        ],
        [
            " 1,287"
        ],
        [
            "  ▾"
        ],
        [
            " −0.30%"
        ],
        [
            " 050507006   Zone III (Poblacion)"
        ],
        [
            " 0.9%"
        ],
        [
            " 670"
        ],
        [
            " 651"
        ],
        [
            "  ▴"
        ],
        [
            " 0.29%"
        ],
        [
            " 050507007   Zone IV (Poblacion)"
        ],
        [
            " 2.4%"
        ],
        [
            " 1,769"
        ],
        [
            " 1,598"
        ],
        [
            "  ▴"
        ],
        [
            " 1.02%"
        ],
        [
            " 050507008   Zone V (Poblacion)"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,068"
        ],
        [
            " 994"
        ],
        [
            "  ▴"
        ],
        [
            " 0.72%"
        ],
        [
            " 050507009   Zone VI (Poblacion)"
        ],
        [
            " 0.7%"
        ],
        [
            " 531"
        ],
        [
            " 571"
        ],
        [
            "  ▾"
        ],
        [
            " −0.72%"
        ],
        [
            " 050507010   Zone VII (Poblacion)"
        ],
        [
            " 2.2%"
        ],
        [
            " 1,635"
        ],
        [
            " 1,545"
        ],
        [
            "  ▴"
        ],
        [
            " 0.57%"
        ],
        [
            "Total"
        ],
        [
            "75,073"
        ],
        [
            "71,527"
        ],
        [
            " ▴"
        ],
        [
            "0.48%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Libon, Albay"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "55(2.2)"
        ],
        [
            "36(1.4)"
        ],
        [
            "45(1.8)"
        ],
        [
            "42(1.7)"
        ],
        [
            "114(4.5)"
        ],
        [
            "184(7.2)"
        ],
        [
            "245(9.6)"
        ],
        [
            "224(8.8)"
        ],
        [
            "238(9.4)"
        ],
        [
            "171(6.7)"
        ],
        [
            "130(5.1)"
        ],
        [
            "94(3.7)"
        ],
        [
            "1,578(62.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.0"
        ],
        [
            "9.5"
        ],
        [
            "11.8"
        ],
        [
            "12.7"
        ],
        [
            "21.3"
        ],
        [
            "25.3"
        ],
        [
            "28.3"
        ],
        [
            "26.5"
        ],
        [
            "26.4"
        ],
        [
            "24.2"
        ],
        [
            "19.9"
        ],
        [
            "16.1"
        ],
        [
            "235"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LibonYearPop.±% p.a.1903 4,616—    1918 8,638+4.27%1939 15,789+2.91%1948 23,931+4.73%1960 31,599+2.34%1970 43,652+3.28%1975 47,890+1.88%1980 52,159+1.72%1990 60,281+1.46%1995 63,190+0.89%2000 66,213+1.01%2007 68,846+0.54%2010 71,527+1.40%2015 75,172+0.95%2020 75,073−0.03%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Libon had a population of 75,073.",
            "The population density was 340 inhabitants per square kilometre (880/sq mi)."
        ],
        [
            "According to NSO in 2010, a barangay is classified as urban if it has a population greater than or equal to 5,000; or at least one establishment with a minimum of 100 employees; or five or more establishments with 10-99 employees, and five or more facilities within the two-kilometer radius from the barangay hall."
        ],
        [
            "In this municipality, fourteen (14) barangays were classified by the National Statistics Office (NSO) as urban and 33 as rural barangays.",
            "Those barangays classified as urban are Barangays Bonbon, Buga, Pantao, San pogi, San Isidro, San Jose, San Vicente and Zone 1-7 of Centro Poblacion."
        ],
        [
            "Using the 2015 PSA data on population, it was figured that 33,081 of the total population reside at urban areas while slight majority of the population (39,467) reside in rural barangays."
        ],
        [
            "Population data by urban-rural classification of areas which date back to 1995 up to 2015 show that most of the population resides at rural areas.",
            "However, there was an abrupt decrease of rural settlers from 69.77% in 2010 to 54.40% in 2015.",
            "This is postulated to be due to availability and accessibility of social services in urban areas."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Libon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  55.80"
        ],
        [
            "2009  48.27"
        ],
        [
            "2012  37.47"
        ],
        [
            "2015  35.98"
        ],
        [
            "2018  37.37"
        ],
        [
            "2021  33.27"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Farming and fishing are Libon's major economic activities.",
            "Based on the NSO Census 2015, most of the gainful workers (12,172) of the municipality are farmers and fisherfolks.",
            "Out of which, 5,301 (43.55%) of those who are devoted to agriculture, forestry and fishing are aged 25–44 years old."
        ],
        [
            "Out of the total land area of the Municipality of Libon which is 22,713 hectares, 5,522.45 hectares or 24.31% of total land area is devoted to rice (4,385.30 ha), corn (899.40 ha), vegetables and other crops (237.65 ha) production."
        ],
        [
            "Libon, being in Albay's lowland zone down to Lake Bato, is suitable for rice production, freshwater fishpond and crops.",
            "The area has a slope of not more than 8 percent and elevations not exceeding 100 meters above sea level and is generally of low soil permeability with no significant limitations of rock.",
            "With these, Libon plays a key role with regards to food security of the province.",
            "As the Rice Granary of Albay, Libon produces 30.4 million kilograms of rice from its 4,000 hectares of rice lands.",
            "Libon, along with Oas and Polangui are medium-sized towns considered as rice granary municipalities endowed with plenty of agri-based industries.",
            "Rice area planted in Albay for CY 2015 accounts to 52,044.46 hectares (dry and wet season) wherein the municipality of Libon has the biggest area of 7,753 hectares.",
            "Labor absorption by the rice industry is the highest among the agriculture sub-sectors involving farmers and family members.",
            "Of Albay's total rice farmers of 38,406, Libon has 3,823, the most in the 3rd District and the 2nd most number in the Province, after Malinao."
        ],
        [
            "Coconut production is the flagship commodity of the province of Albay under the Philippine Rural Development Program (PRDP).",
            "In 2015, Libon, with its thirty (30) coconut-producing barangays accounting for 10,894 hectares of land, produced 500,938,608 tons of coconuts, the second highest in Albay after Ligao City."
        ],
        [
            "Settlement expansions are developed in areas with new opportunities like employment, trade, education, accessibility and other socio-economic sectors that have direct benefits to the people.",
            "Bonbon of Libon is a convergence area of traders and producers coming from Albay's West Coast and Bato of Camarines Sur.",
            "It is the most convenient satellite transport node between Libon and the upland and western barangays of Bato, Camarines Sur.",
            "Another barangay in Libon which will emerge economically is Pantao as the opening of the Pantao Regional Port is expected to spur development and economic activities in the area."
        ],
        [
            "The second kind of business and industry in the municipality are wholesale and retail trade; and repair of motor vehicles and motorcycles.",
            "A total of 1,518 people are engaged in this kind of business.",
            "Least number of gainful workers (5) are engaged in real estate activities."
        ],
        [
            "90.60% of the employed household members (17,257) work within the municipality of Libon.",
            "Some 4.75% of them (820) are employed in different provinces, while 2.07% (394) of gainful workers are employed in different municipalities in Albay.",
            "There are 494 employees (2.59%) who are working abroad."
        ],
        [
            "Culture"
        ],
        [
            "Libon Paroy Festival"
        ],
        [
            "Libon Paroy Festival"
        ],
        [
            "Celebrated every July 22–25, Libon Paroy Festival is a celebration of the town's rich agricultural heritage as the Rice Granary of the province of Albay for its bountiful harvest of paroy or rice.",
            "It is the town's biggest celebration devoted to paying homage to Santiago el Mayor, Libon's patron saint, as well as the local farmers of Libon, considered heroes of the local economy and symbols of courage, determination, and passion.",
            "The annual festivities emblazon and commemorates the opulent past of the Municipality of Libon as one of the oldest settlements in the Philippines."
        ],
        [
            "Activities include the parade of carabaos dressed in festive costumes, pulling carts adorned with decorations, usually the town's agricultural harvests.",
            "Other highlights include Lutong Libongueño, a culinary competition and feast featuring local cuisines such as pecadillo (deep-fried, spice-stuffed tilapia), tinoktok (a variety of pinangat), native delicacies made from rice and root crops; Paroy Exhibit that showcases the varieties of rice planted in Libon as well as the products made by different organizations in Libon such as camote growers, kababaihan associations, barangay-based farmers associations, and MSMEs; Banca Racing, Street Dance Competitions featuring different festivals around the country, Cross-Country Mountain Bike Competition, Baton and DLC Competitions, Farmer's Forum, Color Fun Run and Marathon, Boxing Tournament, Paralympic Games, Miss Libon Beauty Pageant, Laro ng Lahi Nyan mga taga-Libon, LGBTQ and Mardigras Parade, as well as a number of singing and dancing competitions,  and religious merriments.",
            "The month-long celebration culminates on July 25, the day of the feast."
        ],
        [
            "Tourism"
        ],
        [
            "Tallinn-Tallinn BeachFlaming Water in PoblacionThe Municipality of Libon is blessed with natural bounties, sceneries in both terrestrial and aquatic, and rich history, culture and cuisine which, if managed efficiently and responsibly, could generate economic boom through livelihood opportunities to the Libongueños.",
            "Libon has a proud history of being one of the oldest settlements in the Philippines.",
            "It also has been crowned “Rice Granary of Albay” for its bountiful harvest of rice.",
            "The Libon Paroy Festival every July 22 to 25, is annually-held to honor Libon's patron saint, Santiago El Mayor as well as to pay homage to its farmers.",
            "The festival showcases the farmer's dedication in cultivating the soil and growing paroy or rice, Libon's most staple crop and source of identity.",
            "Highlights include the annual carabao parade, farmer's bounty, street dancing competition, baton and DLC competition, local food showcase, exhibits, sports events, and beauty pageants and talent searches exclusive for Libongueños."
        ],
        [
            "Moreover, Libon is part of both the Ticao-Burias Pass Protected Seascape (TBPPS) known for its rich marine life and biodiversity, as well as that of the Albay UNESCO Biosphere Reserve.",
            "Pantao, which was one of the biggest shipyards back during the Spanish colonization of the country, is the site of the Bicol Regional Port, said to be a major economic driver for Libon for being a gateway to the Visayas and Mindanao.",
            "Its location, the Albay West Coast is an idyllic string of beaches covering six coastal barangays.",
            "Rock formations (Bantigue), shoals (Rawis Shoal/Sand Bar), fish and marine sanctuary (Rawis-Apud) with a variety of corals and marine life are some of the wonders popular to local tourists.",
            "Macabugos, a coastal barangay, is an emerging agri-tourism site in Bicol for its grape farm/vineyard, owned by Villa Miranda Farm and Resort.",
            "The farm also has edible mushroom facility and a garden with unique fruits such as purple guava, guapple and strawberry, among others.",
            "Mount Quiasog, also in Macabugos, is an ideal camping, spelunking and trekking site.",
            "Its most prominent feature is a towering monolith rock surrounded by caves.",
            "The National Museum of the Philippines is set to conduct archeological survey in some of the caves for potential artefacts that could link the legend of Asog, the enchanter-protector of the mountain to the way of life of ancient natives.",
            "The once secluded barangay has become Libon's leading tourism destination, even serving as a venue for one of the pre-pageant activities of an international beauty pageant for tourism."
        ],
        [
            "Buga, a barangay situated at the banks of Lake Bato, is a potential eco-tourism area for activities such as boating, bird-watching and fishing.",
            "Caguscos, a land-locked barangay is developing Mount Lanagan as an eco-adventure and retreat site.",
            "The area has at least fourteen caves, some are still unexplored, two small lakes on top of it, and a panoramic view of the sea (Burias Pass, the Lake Bato, majority of the Albay province and Bicol's prominent mountains such as Mayon Volcano, Mount Masaraga, Mount Malinao and Mount Asog).",
            "Caves and falls are also abundant in Libon.",
            "Linao, the oldest barangay of the town, has two of these wonders, although both have been altered by natural causes such as degradation and flooding.",
            "Linao's neighboring barangay of San Ramon is where Balinsasayawan Cave is located.",
            "It is a limestone cave named after the swiftlet, locally known in the Philippines as balinsasayaw, which is an adept inhabitant of caves and whose nests made of their saliva, are a popular ingredient for soup across the country.",
            "Adjacent to this wonder, is a view deck in San Pascual, one of Libon's upland barangays.",
            "The site commands a view of a majority of Libon's timberland and forest areas."
        ],
        [
            "A few kilometers from San Pascual is Barangay San Jose, which has several falls: Cañeta and Mararag.",
            "Both of which are hidden in the mountains and serve as natural bathing sites for locals.",
            "Gogongon Falls, located at Barangay Harigue, north of San Jose, is also a popular falls in the municipality.",
            "The area has a natural lagoon ideal for swimming.",
            "All of these falls require at most an hour of walking and/or trekking.",
            "Adventure-loving tourists could use a good time with nature and greens along the way.",
            "Some of noteworthy addition to points of interest and potential tourism sites are the Bulusan River Promenade which has served as venue for boat racing during town festival, mangrove sites in the several coastal barangays, multi-species hatchery facility in Rawis, the Libon Business, Recreational and Institutional Center (LBIRC) at Barangay Zone 1, unexplored caves and falls in Molosbolos, the site of the proposed Pantao People's Park, the Libon Macapagal Gymnasium, Rizal Park and several spring resorts in Big Five barangays.",
            "Bonbon, a strategic barangay for commerce and trade, houses a local market where handicrafts such as those made of abaca, buri, agas or water lily, and other indigenous hemps and fibers are sold.",
            "Meat, fish, vegetables, root crops and other fresh harvests are also available in this barangay."
        ],
        [
            "For excursionists with limited time or energy for a whole-day itinerary, Poblacion will be a good trip for local history and wonders.",
            "Libon Central School houses the Flaming Water of Libon, which has been featured several times at local television shows.",
            "For faith tourism, the Saint James the Greater Parish Church at Barangay Zone 4 is Libon's main religious thoroughfare.",
            "The materials at the back portion of the church are remnants of the old church of Linao, one of the earliest in Albay.",
            "The home of Santiago el Mayor, Libon's patron saint, the St. James the Greater Parish Church reminds both the visitors and natives of Libon's of the town's opulent past as one of the oldest settlements in the Philippines, being founded in 1573 as a Spanish citadel with its former name, “Villa Santiago de Libong”, and of its significance in the propagation of Christianity during the early phase of the Spanish occupation of the country."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Libon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c d \"History of Libon\".",
            "www.geocities.ws.",
            "Retrieved 2016-11-01."
        ],
        [
            "^ POMP, PAGEANTRY AND GOLD: THE EIGHT SPANISH VILLAS IN THE PHILIPPINES (1565-1887) Luciano P.R.",
            "Santiago (Page 63)"
        ],
        [
            "^"
        ],
        [
            "\"Province: Albay\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Municipal: Libon, Albay\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Libon, Albay : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 December 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Albay\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Official Municipal Website of Libon"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Libon, Albay"
        ],
        [
            "Bato, Camarines Sur"
        ],
        [
            "Polangui"
        ],
        [
            "Ragay Gulf"
        ],
        [
            "Libon"
        ],
        [
            "Oas"
        ],
        [
            "Burias PassSan Pascual, Masbate"
        ],
        [
            "Oas"
        ],
        [
            "vte Province of AlbayLegazpi (capital and largest city)Municipalities"
        ],
        [
            "Bacacay"
        ],
        [
            "Camalig"
        ],
        [
            "Daraga"
        ],
        [
            "Guinobatan"
        ],
        [
            "Jovellar"
        ],
        [
            "Libon"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Manito"
        ],
        [
            "Oas"
        ],
        [
            "Pio Duran"
        ],
        [
            "Polangui"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Tiwi"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Tabaco"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Libon,_Albay&oldid=1193051128\""
        ],
        [
            "Category: Municipalities of AlbayHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from February 2021All articles needing additional referencesArticles with a promotional tone from February 2021All articles with a promotional toneArticles with multiple maintenance issuesPages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Central Bikol-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from October 2016Articles needing additional references from October 2016Pages using the Kartographer extension"
        ]
    ]
}