{
    "name": "Libungan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Libungan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°15′N 124°31′E﻿ / ﻿7.25°N 124.52°E﻿ / 7.25; 124.52"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cotabato, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Libungan\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Soccsksargen, PhilippinesLibunganMunicipalityMunicipality of LibunganMunicipal Hall of Libungan"
        ],
        [
            "FlagSealMap of Cotabato with Libungan highlightedOpenStreetMapLibunganLocation within the PhilippinesCoordinates: 7°15′N 124°31′E﻿ / ﻿7.25°N 124.52°E﻿ / 7.25; 124.52CountryPhilippinesRegionSoccsksargenProvinceCotabatoDistrict"
        ],
        [
            "1st districtFoundedJanuary 27, 1968Barangays20"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 286.3 million (2020) • Assets₱ 491.8 million (2020) • Expenditure₱ 169.9 million (2020) • Liabilities₱ 89.77 million (2020)Service provider • ElectricityCotabato Electric Cooperative (COTELCO)Time zoneUTC+8 (PST)ZIP code9411PSGC124705000IDD : area code +63 (0)64Native languagesHiligaynon Cebuano Maguindanao Ilianen TagalogWebsitewww.libungan.gov.ph"
        ],
        [
            "Libungan, officially the Municipality of Libungan (Maguindanaon: Inged nu Libungan, Jawi: ايڠايد نو ليبوڠن; Iranun: Inged a Libungan, ايڠايد ا ليبوڠن; Hiligaynon: Banwa sang Libungan; Cebuano: Lungsod sa Libungan; Tagalog: Bayan ng Libungan), is a 2nd class municipality in the province of Cotabato, Philippines.",
            "According to the 2020 census, it has a population of 56,269 people."
        ],
        [
            "Etymology"
        ],
        [
            "Libungan was known by various names by its early settlers.",
            "The Manobo settlers of the area initially called the area as \"Dasdas\" which means road down by the river.",
            "\"Libungan\" is used to refer to the river located in the area by the Manobo which means cheater.",
            "During the earlier period of settling the place, the Libungan River changes its course which adversely affected the crops which led the settlers to believe that the river was \"cheating\" them.",
            "The area from then on was referred to as Libungan.",
            "\"Tubak\" is one of the earlier names used to refer to the place which means \"eroding river\"."
        ],
        [
            "History"
        ],
        [
            "The Manobo are the earlier settlers of the place and was eventually settled by other ethnic groups mainly by Cebuanos from Cebu who found the place suitable for them because of its terrain.",
            "Many immigrants from Luzon and Visayas came to settle in Libungan in the early 1930s.",
            "During World War II, the area of Demapaco was used by guerrillas as hideouts and the Libungan River became a battleground.",
            "After the Liberation in 1945, more settlers came to Libungan who cleared the forest and used the area's fertile lands for agriculture."
        ],
        [
            "In 1955, when Libungan was still a part of Midsayap, many Libungan residents were elected to the Municipal Council of Midsayap.",
            "The Midsayap Municipal Council passed a resolution to the Provincial Government which in turn pass a similar resolution to the national government which seeks to create the Municipality of Libungan.",
            "Libungan was established as a separate municipality on August 7, 1961.",
            "Under Executive Order No.",
            "414 dated January 27, 1961, Libungan was established as a regular municipality with 14 barangays.",
            "The number of barangays within Libungan increased to 32 in the following years but in 1969, Alamada, a new municipality was created from some of Libungan's barangays."
        ],
        [
            "After the creation of Alamada, the municipality maintained its 19 barangays, part of which are the former barangays of Midsayap, namely Libungan (Poblacion), Barongis, Cabaruyan, Batiocan, Sinawingan, Baguer, Montay and Demapaco.",
            "Other barangays that compose the municipality are Abaga, Cabpangi, Grebona, Gumaga, Kapayawi, Kiloyao, Malengen, Sinapangan, Kitubod, Nicaan and Palakat, which later became defunct.",
            "Under Resolution No.",
            "35 dated December 14, 1978, Palao and Ulamian was established with the total number of barangays of Libungan becoming 20."
        ],
        [
            "Libungan was affected by two fires which had a socio-economic implications to the municipality which destroyed a commercial establishment and local government building.",
            "The former occurred on January 16, 1979, and the later occurred on February 17, 1989.",
            "After just a week after the fire at the municipal hall, the EDSA Revolution occurred which led to the installation of Corazon Aquino as president after the then president Ferdinand Marcos was deposed.",
            "Reorganization of political leadership was made and Libungan was affected."
        ],
        [
            "Possible isolation due to future establishment of Bangsamoro"
        ],
        [
            "During the 2001 Referendum for inclusion to the Autonomous Region in Muslim Mindanao, two (2) out of twenty-eight (28) barangays of Carmen, Cotabato chose to be part of ARMM, but were excluded because they are not connected to the main region of ARMM.",
            "During 2010–2016 Administration, the Bangsamoro ideal sprouted and a newly proposed region was in the making.",
            "According to the agreements signed by the Moro Islamic Liberation Front and the Administration of Noynoy Aquino, Carmen will be included in Bangsamoro because of the two out of twenty-eight barangays that voted in favor of joining the Muslim region back in 2001.",
            "Unfortunately, Bangsamoro was not implemented before the term of Aquino ended.",
            "Despite this, the current administration aims to establish a Federal Government, where Bangamoro will be realized into a State of the Philippines wherein Carmen will be included in Bangsamoro."
        ],
        [
            "Plans to establish a new municipality in the south of Carmen so that the indigenous and Christian central and northern part of Carmen will be retained in North Cotabato has yet to be confirmed.",
            "The idea arose because once the entire municipality of Carmen is included in Bangsamoro, the province of North Cotabato will be cut into half, leaving three towns (Banisilan, Alamada, and Libungan) at its west without connection to the center of North Cotabato, isolating these towns in the process."
        ],
        [
            "Geography"
        ],
        [
            "Libungan is located in the north-western part of the Province of Cotabato with Libungan River as the main boundary from the Municipalities of Alamada, Banisilan and Carmen."
        ],
        [
            "Barangays"
        ],
        [
            "Libungan is politically subdivided into 20 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "At its establishment, Libungan has 12 barangays.",
            "Libungan had 32 barangays at its peak before the municipality of Alamada was carved from Libungan."
        ],
        [
            "Abaga"
        ],
        [
            "Baguer"
        ],
        [
            "Barongis"
        ],
        [
            "Batiocan"
        ],
        [
            "Cabaruyan"
        ],
        [
            "Cabpangi"
        ],
        [
            "Demapaco"
        ],
        [
            "Grebona"
        ],
        [
            "Gumaga"
        ],
        [
            "Kapayawi"
        ],
        [
            "Kiloyao"
        ],
        [
            "Kitubod"
        ],
        [
            "Malengen"
        ],
        [
            "Montay"
        ],
        [
            "Nica-an"
        ],
        [
            "Palao"
        ],
        [
            "Poblacion"
        ],
        [
            "Sinapangan"
        ],
        [
            "Sinawingan"
        ],
        [
            "Ulamian"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Libungan, Cotabato"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "38(1.5)"
        ],
        [
            "24(0.9)"
        ],
        [
            "29(1.1)"
        ],
        [
            "31(1.2)"
        ],
        [
            "50(2.0)"
        ],
        [
            "56(2.2)"
        ],
        [
            "52(2.0)"
        ],
        [
            "49(1.9)"
        ],
        [
            "39(1.5)"
        ],
        [
            "47(1.9)"
        ],
        [
            "54(2.1)"
        ],
        [
            "35(1.4)"
        ],
        [
            "504(19.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.1"
        ],
        [
            "7.5"
        ],
        [
            "10.0"
        ],
        [
            "11.5"
        ],
        [
            "19.7"
        ],
        [
            "20.8"
        ],
        [
            "19.4"
        ],
        [
            "18.5"
        ],
        [
            "16.3"
        ],
        [
            "18.5"
        ],
        [
            "18.4"
        ],
        [
            "12.8"
        ],
        [
            "183.5"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Libungan's climate is under the 4th type, which is more or less even distribution of rainfall during the year."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LibunganYearPop.±% p.a.1918 5,058—    1970 19,029+2.58%1975 20,385+1.39%1980 22,974+2.42%1990 32,055+3.39%1995 37,202+2.83%2000 40,589+1.89%2007 43,923+1.09%2010 45,295+1.13%2015 48,768+1.42%2020 56,269+2.85%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Libungan, Cotabato, was 56,269 people, with a density of 330 inhabitants per square kilometre or 850 inhabitants per square mile."
        ],
        [
            "The earlier settlers of Libungan are the Manobo, Maguindanaon and Iranun.",
            "It was later settled by people from Luzon and Visayas primarily by Cebuanos from Cebu."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Libungan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  31.50"
        ],
        [
            "2009  32.10"
        ],
        [
            "2012  39.61"
        ],
        [
            "2015  37.14"
        ],
        [
            "2018  25.20"
        ],
        [
            "2021  30.93"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "This municipality in the first congressional district of Cotabato is basically an Agricultural area.",
            "It has the basic requirements for agro-industries.",
            "It has many rice and corn mills, Buy/Sell, agri-supply supply and hardware stores.",
            "In the PALMA Alliance, Libungan has the biggest source of sand and gravel supply owing to the Libungan River bed.",
            "Libungan is also the home of the biggest poultry farm in the PALMA Alliance; it has also the Rock crusher and banana chips factory.",
            "It also has 2 filling stations, three pawnshops and a Rural Bank servicing mobility and financial requirements of local business."
        ],
        [
            "Natural resources"
        ],
        [
            "The agricultural land in the municipality is planted with rice, corn and a hundred hectares to the traditional white corn variety.",
            "Coconut, mango and banana are also planted in the semi-sloping and upland areas."
        ],
        [
            "The Gross Domestic Product of the Municipality (2022) is 8,299,700,159(PHP)."
        ],
        [
            "Government"
        ],
        [
            "The first mayor of Libungan was Esmeraldo Cedeño who was appointed and served from 1961 to 1964.",
            "In 1964, Pedro Singayao, Sr. a native from Malitubog who was an agriculturist and was a pensionado, who served as the first-elected mayor from 1964 to 1967.",
            "He was succeeded by Pacifico Dela Serna who served from 1967 to 1971 as mayor.",
            "Del Serna was among the early settlers from Cebu.",
            "He was then followed by his wife, Lucila T. Dela Serna who served as the third-elected mayor."
        ],
        [
            "Following the EDSA Revolution, newly installed President Corazon Aquino, appointed lawyer Nestor Q. Quintana as mayor of Libungan replacing Dela Serna.",
            "He was later replaced by Leliosa Agravante Villanueva and then later by Luden A. Laguting when Quintana ran for mayor in the 1988 election.",
            "He lost to Manuel T. dela Serna in the elections.",
            "Joel D. Humabad succeeded dela Serna when he was elected in 1992.",
            "Humabad was then succeeded by Ronaldo B. Pader after the former served for two terms.",
            "Pader served for three terms or nine years.",
            "In 2007, Manuel T. Dela Serna was elected mayor again.",
            "He is the current mayor and is on his third and last consecutive term."
        ],
        [
            "Tourism"
        ],
        [
            "In the last five years from 2014, the development of tourism in the municipality was minimal.",
            "The municipal government has eyed developing the Sapangbato River at Barangay Grebona, the waterfall at Barangay Sinapangan and the Boy & Girl Scout Camp at Barangay Demapaco as tourism sports.",
            "The waterfall at Sinapangan is the sole existing waterfall in Libungan and the BGS Camp in Demapaco was dilapidated.",
            "Tourists visiting the municipality primarily comes from adjacent municipalities and Cotabato City."
        ],
        [
            "Culture"
        ],
        [
            "Numerous festivals are held within the municipality by the Manobo people in the barangays of Barongis, Demapaco, Grebona and Sinapangan.",
            "Fiestas honoring patrons are also held in the municipality."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Libungan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b c d e f g h i \"About Libungan\".",
            "Municipality of Libungan Official Website.",
            "Municipal Government of Libungan.",
            "Archived from the original on May 31, 2014.",
            "Retrieved August 28, 2015."
        ],
        [
            "^"
        ],
        [
            "\"Province: North Cotabato\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Libungan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved January 30, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XII (Soccsksargen)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XII (Soccsksargen)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of North Cotabato\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b \"About Libungan - Economic Sector\".",
            "Municipality of Libungan Official Website.",
            "Municipal Government of Libungan.",
            "Archived from the original on May 31, 2014.",
            "Retrieved August 28, 2015."
        ],
        [
            "^ \"Festivals\".",
            "Municipality of Libungan Official Website.",
            "Municipal Government of Libungan.",
            "Retrieved August 28, 2015."
        ],
        [
            "External links"
        ],
        [
            "http://www.libungan.gov.ph/"
        ],
        [
            "Libungan Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "http://www.libungan-cotabatoprov.gov.ph/"
        ],
        [
            "https://web.archive.org/web/20071214205616/http://www.libungan.com/"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Libungan"
        ],
        [
            "Alamada"
        ],
        [
            "Pigcawayan"
        ],
        [
            "Libungan"
        ],
        [
            "Carmen"
        ],
        [
            "Northern Kabuntalan, Maguindanao"
        ],
        [
            "Midsayap"
        ],
        [
            "Aleosan"
        ],
        [
            "vte Province of CotabatoKidapawan (capital)Municipalities"
        ],
        [
            "Alamada"
        ],
        [
            "Aleosan"
        ],
        [
            "Antipas"
        ],
        [
            "Arakan"
        ],
        [
            "Banisilan"
        ],
        [
            "Carmen"
        ],
        [
            "Kabacan"
        ],
        [
            "Libungan"
        ],
        [
            "Magpet"
        ],
        [
            "Makilala"
        ],
        [
            "Matalam"
        ],
        [
            "Midsayap"
        ],
        [
            "M'lang"
        ],
        [
            "Pigcawayan"
        ],
        [
            "Pikit"
        ],
        [
            "President Roxas"
        ],
        [
            "Tulunan"
        ],
        [
            "Component city"
        ],
        [
            "Kidapawan"
        ],
        [
            "Related"
        ],
        [
            "Symbols"
        ],
        [
            "Special Geographic Area (part of Bangsamoro)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Libungan&oldid=1194740048\""
        ],
        [
            "Categories: Municipalities of CotabatoPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Articles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Cebuano-language textArticles containing Tagalog-language textAll articles with dead external linksArticles with dead external links from December 2017Articles with permanently dead external linksPages using the Kartographer extension"
        ]
    ]
}