{
    "name": "Lipa",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Lipa, Batangas"
        ],
        [
            "25 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSimple EnglishSvenskaTagalogТатарча / tatarçaTürkçeاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadView sourceView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadView sourceView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°56′28″N 121°09′44″E﻿ / ﻿13.9411°N 121.1622°E﻿ / 13.9411; 121.1622"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Component city in Batangas, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Lipa, Batangas\" – news · newspapers · books · scholar · JSTOR (November 2017) (Learn how and when to remove this message)"
        ],
        [
            "Component city in Calabarzon, PhilippinesLipaComponent cityFrom top to bottom: City skyline, Metropolitan Cathedral of St. Sebastian, Lipa City Hall, Casa de Segunda"
        ],
        [
            "FlagSealMotto(s): Virtud y Trabajo(Virtue and Work)Anthem: LipeñoMap of Batangas with Lipa highlightedOpenStreetMapLipaLocation within the PhilippinesCoordinates: 13°56′28″N 121°09′44″E﻿ / ﻿13.9411°N 121.1622°E﻿ / 13.9411; 121.1622CountryPhilippinesRegionCalabarzonProvinceBatangasDistrict"
        ],
        [
            "6th districtFounded1605CityhoodJune 20, 1947Barangays72"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorEric B. Africa • Vice MayorCamille Angeline M. Lopez • RepresentativeVacant • City Council"
        ],
        [
            "Members"
        ],
        [
            "Michael Gerard T. MoradaGaleleo P. AngelesJennifer Spye T. ToledoOscar M. Gozos IIRiofer Nicole H. RonquilloVenice D. ManaloMiguel P. Lina IIIMerlo P. SilvaAvior R. RocafortRalph Peter S. UmaliAries D. MacalaPercival V. Lojo"
        ],
        [
            " • Electorate222,589 voters (2022)Area • Revenue₱ 2,157 million (2020) • Assets₱ 5,161 million (2020) • Expenditure₱ 1,757 million (2020) • Liabilities₱ 1,263 million (2020)Service provider • ElectricityBatangas 2 Electric Cooperative (BATELEC 2)Time zoneUTC+8 (PST)ZIP code4217, 4218PSGC041014000IDD : area code +63 (0)43Native languagesTagalogNumbered highways"
        ],
        [
            "E2 (STAR Tollway)"
        ],
        [
            " N4 (Jose P. Laurel Highway)"
        ],
        [
            " N431"
        ],
        [
            "Feast dateJanuary 20Patron saintSaint SebastianWebsitewww.lipa.gov.ph"
        ],
        [
            "Lipa ("
        ],
        [
            "It is the first city charter in the province and one of five cities in Batangas alongside Batangas City, Calaca, Santo Tomas, and Tanauan.",
            "It is located 78 kilometres (48 mi) south of Manila and is the most populous city of Batangas."
        ],
        [
            "The Southern Tagalog Arterial Road (STAR) and South Luzon Expressway (SLEX) provide access to Batangas City and Metro Manila."
        ],
        [
            "Etymology"
        ],
        [
            "Batangueños from the early years had their settlement in Bombon Lake and began dispersing to other places when the volcano erupted.",
            "While a group of people was moving to another settlement area, the image of St. Sebastian was stolen from them and later on was found on a tree called \"lipa.\"",
            "People believed that the patron saint wished to name that place \"Lipa\"."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(May 2012) (Learn how and when to remove this message)"
        ],
        [
            "The primal composition in the southeastern region of Bombon Lake were elements of the dispersed colonial families founded by two datus, namely, Dumangsil and Balkasusa in Taal, Batangas, between the 10th and 13th century.",
            "These pioneer settlers under the leadership of the fleeing Datu Puti, formerly purchased the lowlands from King Marikudo of Panay."
        ],
        [
            "It is however subject to conjecture whether the pre-historic Negritos 12,000 to 15,000 years age or the much later waves of Austronesian seafarers from 5,000 to 300 B.C.",
            "were able to settle along the coasts of Batangas into the inner lake region of Taal which was accessible to navigation through the Pansipit River, thus, the possibility of miscegenetic marriages and cross culture among the aboriginal inhabitants, the old settlers and the later Dumangsil and Balkasusa clans, or whether violent wars have been waged between the old inhabitants and new colonizers is uncertain as well."
        ],
        [
            "Out of this Bornean tribe of the Dumangsil and Balkasusa clans came the ancestry of Lipa and as later on, their descendants who spread out towards Laguna de Bay and Bicol Peninsula.",
            "The remains excavated from their ancient settlements in Butong, Taal, Calatagan and Balayan attest to the fact of their presence in the said site at least in the latter part of the 13th century down to the coming of Goiti and Legaspi in Batangas in 1570.",
            "The flourishing trade relations between these early Batangueños with a number of Chinese merchants prior to the Spanish conquest explained the presence of hundreds of Chinese wares from potteries to stonewares and vases of Song dynasty period to the latter part of the 16th century, in the burial grounds at Calatagan sites of Pulung Bakaw, Kay Tomas, Pinagpatayan I and II at Butong, all in Taal, Batangas."
        ],
        [
            "By origin the early Lipeños were Buddhist in religion and Indian in civilization.",
            "With its not infrequent contact with the Chinese traders, the Batangueños have absorbed and been influenced too by China.",
            "With the Spanish colonization of the Philippines and the Salcedo conquest of Batangas in 1572, the Lipeños were forced to embrace Western civilization."
        ],
        [
            "Spanish rule"
        ],
        [
            "At the coming of the Spaniards to Batangas in 1570, the Malay settlements along the southern shores of Taal Lake at Tagbakin was inhabited by the warlike descendants of the two datus called the Tagalogs.",
            "In 1605, after Marshall Gabriel de Rivera received the encomienda of Bombon, the Augustinian Fathers made Tagbakin the first settlement of the Lipeños and a mission center with the name of San Sebastian, perhaps after the installed Patron Saint, which continued to the present.",
            "The settlement was made a regular municipality in 1702 and a regular parish in 1716 with Fray Diego de Alday as the first curate."
        ],
        [
            "With the eruption of Taal Volcano in 1724, the people moved to what is now \"Lumang Lipa\" and, again, in 1754, they moved to Balete where they settled for two years until 1756 when they moved inland to the present site obviously for more security from volcanic eruptions.",
            "When Don Galo de los Reyes was the governadorcillo of Lipa, he introduced the cultivation of coffee.",
            "The seeds of the Arabica species were said to be of two chupas brought in from Mexico by an Augustinian missionary.",
            "The coffee industry so flourished and made Lipa the richest municipality in the country with an annual income of P4,000,000.00 that on October 21, 1887, the Queen regent Maria Christina, acting for the young King Alfonso XIII, signed a decree elevating Lipa to a city known as \"Villa de Lipa\", and later authorized to use a coat of arms by the Royal Overseas Minister Don Víctor Balaguer."
        ],
        [
            "At the celebration of the elevation of Lipa to a city in January 1888, José Rizal was invited by Dr. Jose Lozada, Catalino Dimayuga and the brothers Celestino and Simeon Luz but Rizal responded only with his Hymno Al Trabajo which he dedicated to the zeal and industry of the Lipeños."
        ],
        [
            "The raising of cacao was introduced in Lipa by an Augustinian priest, Father Ignacio de Mercado, and that was the beginning of its cultivation throughout the Philippines."
        ],
        [
            "The Lipeños also engaged themselves in livestock raising and varied home crafts for men, and small industries, like weaving, embroidery and sewing for women.",
            "After World War II, citrus production prevailed until 1970 and, after its decline, about 1965, poultry and swine raising began to take roots and to thrive in no small degree until the present."
        ],
        [
            "The first newspaper in Batangas, published in Spanish, was the Lumubog-Lumutang, printed in Lipa in 1889, and established by the well-known writers Cipriano Kalaw, Gregorio Katigbak, Benito Reyes, Hugo Latorre and Pedro Laygo.",
            "Other pioneer Spanish writers were Bernardo Solis, Catalino Dimayuga and Manuel Luz."
        ],
        [
            "During the revolution, Gregorio Aguilera Solis edited a newspaper Columnas Voluntas de la Federacion Malaya.",
            "This paper became the media for notable poems and literary works of Albino Dimayuga, Baldomero Roxas, Luis Lina Kison, Bernardo Solis, Benedicto Solis, Emiliano Manguiat and Petronio Katigbak."
        ],
        [
            "Roman Dimayuga wrote plays, while Pedro Laygo published articles on domestic and international politics and Tomas Umali on military affairs.",
            "Hispanistas during the American regime included national figures like Teodoro Kalaw, Fidel Reyes, Arsenio Luz, Max B. Solis, Enrique Laygo and Claro M. Recto.",
            "Lipeños also served in the Revolutionary Republic.",
            "These were Gregorio Aguilera who was delegate to the Malolos Congress; Ceferino Pantoja, also a member of that congress; Jose Lozada, as envoy to Washington, D.C., and Paris, and Cipriano Kalaw, the first vice-president and Treasurer of the Central Committee of Hong Kong."
        ],
        [
            "Father Valerio Malabanan established a historical school that produced future leaders like Apolinario Mabini and Miguel Malvar"
        ],
        [
            "In the field of education, Father Valerio Malabanan was foremost among Lipeños who established schools.",
            "Others were Sebastian Virrey, Jacinto Silva, Candido Lantin and Gregorio Katigbak.",
            "In 1894, Brigido Morada established his own school at his house in Mataas na Lupa.",
            "Under Father Valerio Malabanan were such well-known figures as Apolinario Mabini, General Miguel Malvar and Sotero Laurel."
        ],
        [
            "Sebastian Virrey countered with such former students as the brothers Alfonso and Claro M. Recto; Fidel and Carmelo Reyes; Teodoro and Maximo Kalaw; Pacifico, Jose and Enrique Laygo; and Manuel Luz Roxas, Jose D. Dimayuga, Bernabe Africa, Pablo Borbon, Potenciano Malvar, Leoncio Aranda and Bishop Alfredo Obviar."
        ],
        [
            "The later school, perhaps marked for permanence by the enthusiastic patronage of its high standard maintained through the years since its founding in 1922 until the present, is the Mabini Academy established by Dr. Jose Ma.",
            "Katigbak, Randall A. Rowley, Tarcila Malabanan-Katigbak and Emilia Malabanan.",
            "The fact that Lipeños, even up to the present, are very religious, may be attributed to the fact that Fr.",
            "Benito Baras, who was Parish Priest of Lipa for almost three decades (1865–1894), has considered Villa de Lipa as his very own and had shown great paternal love for the Lipeños that he constructed the Parish Church  (now Cathedral of the Archdiocese of Lipa) and a new and bigger cemetery with a chapel."
        ],
        [
            "A plaque of dedication to the opening and blessing of the new Campo Santo De Lipa (Cemetery of Lipa) can still be seen at the archway of the entrance, an attestment of Fr.",
            "Benito Baras' dedication to the people of Villa de Lipa.",
            "Moreover, without aid from the State, he constructed the bridge at Sabang and the road that served as a national highway to Manila and Laguna."
        ],
        [
            "The Parish of Lipa, established in 1716, became a diocesan center in 1910, included the provinces of Batangas, Laguna, Tayabas (Quezon), Marinduque and Mindoro, with Msgr.",
            "Jose Petrelli as the first bishop."
        ],
        [
            "On August 15, 1972, the diocese was raised to an ecclesiastical province composed of Batangas province and the dioceses of Lucena, Infanta and Calapan, with Msgr Alejandro Olalia as the first Archbishop."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "On August 31, 1947, Lipa was inaugurated as a chartered City created under Republic Act No.",
            "162 approved on June 20, 1947."
        ],
        [
            "Geography"
        ],
        [
            "View of Lipa from Barangay Mataas na Lupa"
        ],
        [
            "Lipa covers an area of 20,940 hectares (209.4 km2) at an elevation of 1,025 feet (312 m) above sea level.",
            "Lipa's fishing area is located at barangay Halang, in the west of the city; it is actually a portion of Taal Lake, which is connected to other municipalities (Cuenca, Mataasnakahoy and Balete)."
        ],
        [
            "Lipa is bounded by the city of Santo Tomas in the northeast, the city of San Pablo of Laguna, and the municipalities of Tiaong and San Antonio, Quezon in the east, the municipalities of Padre Garcia and Rosario in the southeast, the municipalities of Ibaan and San Jose in the southwest, the municipalities of Cuenca and Mataasnakahoy and Taal Lake in the west and the municipalities of Balete and Malvar in the northwest."
        ],
        [
            "The city's location, in a valley between the Malepunyo Mountain Range and Mount Macolod, makes it a low-risk area for natural disasters.",
            "These two mountains serve as a windbreak during typhoons.",
            "Mount Macolod, in the west, also served as shield during eruptions of the Taal Volcano."
        ],
        [
            "Barangays"
        ],
        [
            "Lipa is politically subdivided into 72 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "The map of Barangays of Lipa City with labels."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 041005001   Adya"
        ],
        [
            " 0.6%"
        ],
        [
            " 2,098"
        ],
        [
            " 2,006"
        ],
        [
            "  ▴"
        ],
        [
            " 0.45%"
        ],
        [
            " 041005002   Anilao"
        ],
        [
            " 1.1%"
        ],
        [
            " 4,284"
        ],
        [
            " 3,534"
        ],
        [
            "  ▴"
        ],
        [
            " 1.94%"
        ],
        [
            " 041005003   Anilao-Labac"
        ],
        [
            " 1.0%"
        ],
        [
            " 3,910"
        ],
        [
            " 3,161"
        ],
        [
            "  ▴"
        ],
        [
            " 2.15%"
        ],
        [
            " 041005004   Antipolo del Norte"
        ],
        [
            " 1.6%"
        ],
        [
            " 6,078"
        ],
        [
            " 6,250"
        ],
        [
            "  ▾"
        ],
        [
            " −0.28%"
        ],
        [
            " 041005005   Antipolo del Sur"
        ],
        [
            " 2.0%"
        ],
        [
            " 7,448"
        ],
        [
            " 6,855"
        ],
        [
            "  ▴"
        ],
        [
            " 0.83%"
        ],
        [
            " 041005006   Bagong Pook"
        ],
        [
            " 1.9%"
        ],
        [
            " 7,081"
        ],
        [
            " 6,547"
        ],
        [
            "  ▴"
        ],
        [
            " 0.79%"
        ],
        [
            " 041005007   Balintawak"
        ],
        [
            " 5.2%"
        ],
        [
            " 19,278"
        ],
        [
            " 15,176"
        ],
        [
            "  ▴"
        ],
        [
            " 2.42%"
        ],
        [
            " 041005008   Banaybanay"
        ],
        [
            " 3.5%"
        ],
        [
            " 12,971"
        ],
        [
            " 11,514"
        ],
        [
            "  ▴"
        ],
        [
            " 1.20%"
        ],
        [
            " 041005009   Bolbok"
        ],
        [
            " 2.4%"
        ],
        [
            " 8,836"
        ],
        [
            " 6,740"
        ],
        [
            "  ▴"
        ],
        [
            " 2.74%"
        ],
        [
            " 041005010   Bugtong na Pulo"
        ],
        [
            " 2.1%"
        ],
        [
            " 7,678"
        ],
        [
            " 6,616"
        ],
        [
            "  ▴"
        ],
        [
            " 1.50%"
        ],
        [
            " 041005011   Bulacnin"
        ],
        [
            " 2.0%"
        ],
        [
            " 7,369"
        ],
        [
            " 6,098"
        ],
        [
            "  ▴"
        ],
        [
            " 1.91%"
        ],
        [
            " 041005012   Bulaklakan"
        ],
        [
            " 0.4%"
        ],
        [
            " 1,604"
        ],
        [
            " 1,523"
        ],
        [
            "  ▴"
        ],
        [
            " 0.52%"
        ],
        [
            " 041005013   Calamias"
        ],
        [
            " 0.4%"
        ],
        [
            " 1,651"
        ],
        [
            " 1,385"
        ],
        [
            "  ▴"
        ],
        [
            " 1.77%"
        ],
        [
            " 041005014   Cumba"
        ],
        [
            " 1.0%"
        ],
        [
            " 3,780"
        ],
        [
            " 4,242"
        ],
        [
            "  ▾"
        ],
        [
            " −1.15%"
        ],
        [
            " 041005015   Dagatan"
        ],
        [
            " 1.8%"
        ],
        [
            " 6,840"
        ],
        [
            " 5,347"
        ],
        [
            "  ▴"
        ],
        [
            " 2.49%"
        ],
        [
            " 041005016   Duhatan"
        ],
        [
            " 0.7%"
        ],
        [
            " 2,579"
        ],
        [
            " 2,406"
        ],
        [
            "  ▴"
        ],
        [
            " 0.70%"
        ],
        [
            " 041005017   Halang"
        ],
        [
            " 0.6%"
        ],
        [
            " 2,267"
        ],
        [
            " 1,993"
        ],
        [
            "  ▴"
        ],
        [
            " 1.30%"
        ],
        [
            " 041005018   Inosloban"
        ],
        [
            " 4.0%"
        ],
        [
            " 14,904"
        ],
        [
            " 12,713"
        ],
        [
            "  ▴"
        ],
        [
            " 1.60%"
        ],
        [
            " 041005019   Kayumanggi"
        ],
        [
            " 2.1%"
        ],
        [
            " 7,750"
        ],
        [
            " 5,566"
        ],
        [
            "  ▴"
        ],
        [
            " 3.36%"
        ],
        [
            " 041005020   Latag"
        ],
        [
            " 2.5%"
        ],
        [
            " 9,364"
        ],
        [
            " 4,455"
        ],
        [
            "  ▴"
        ],
        [
            " 7.71%"
        ],
        [
            " 041005021   Lodlod"
        ],
        [
            " 2.7%"
        ],
        [
            " 10,006"
        ],
        [
            " 8,931"
        ],
        [
            "  ▴"
        ],
        [
            " 1.14%"
        ],
        [
            " 041005022   Lumbang"
        ],
        [
            " 1.3%"
        ],
        [
            " 4,688"
        ],
        [
            " 4,169"
        ],
        [
            "  ▴"
        ],
        [
            " 1.18%"
        ],
        [
            " 041005023   Mabini"
        ],
        [
            " 1.5%"
        ],
        [
            " 5,766"
        ],
        [
            " 3,964"
        ],
        [
            "  ▴"
        ],
        [
            " 3.82%"
        ],
        [
            " 041005024   Malagonlong"
        ],
        [
            " 0.7%"
        ],
        [
            " 2,667"
        ],
        [
            " 2,354"
        ],
        [
            "  ▴"
        ],
        [
            " 1.26%"
        ],
        [
            " 041005025   Malitlit"
        ],
        [
            " 0.7%"
        ],
        [
            " 2,526"
        ],
        [
            " 1,903"
        ],
        [
            "  ▴"
        ],
        [
            " 2.87%"
        ],
        [
            " 041005026   Marauoy"
        ],
        [
            " 5.0%"
        ],
        [
            " 18,794"
        ],
        [
            " 15,484"
        ],
        [
            "  ▴"
        ],
        [
            " 1.96%"
        ],
        [
            " 041005027   Mataas na Lupa"
        ],
        [
            " 1.2%"
        ],
        [
            " 4,510"
        ],
        [
            " 5,093"
        ],
        [
            "  ▾"
        ],
        [
            " −1.21%"
        ],
        [
            " 041005028   Munting Pulo"
        ],
        [
            " 1.3%"
        ],
        [
            " 4,853"
        ],
        [
            " 4,093"
        ],
        [
            "  ▴"
        ],
        [
            " 1.72%"
        ],
        [
            " 041005029   Pagolingin Bata"
        ],
        [
            " 0.3%"
        ],
        [
            " 1,236"
        ],
        [
            " 1,247"
        ],
        [
            "  ▾"
        ],
        [
            " −0.09%"
        ],
        [
            " 041005030   Pagolingin East"
        ],
        [
            " 0.6%"
        ],
        [
            " 2,178"
        ],
        [
            " 2,112"
        ],
        [
            "  ▴"
        ],
        [
            " 0.31%"
        ],
        [
            " 041005031   Pagolingin West"
        ],
        [
            " 0.6%"
        ],
        [
            " 2,082"
        ],
        [
            " 1,465"
        ],
        [
            "  ▴"
        ],
        [
            " 3.58%"
        ],
        [
            " 041005032   Pangao"
        ],
        [
            " 1.8%"
        ],
        [
            " 6,568"
        ],
        [
            " 5,078"
        ],
        [
            "  ▴"
        ],
        [
            " 2.61%"
        ],
        [
            " 041005033   Pinagkawitan"
        ],
        [
            " 2.2%"
        ],
        [
            " 8,089"
        ],
        [
            " 7,056"
        ],
        [
            "  ▴"
        ],
        [
            " 1.38%"
        ],
        [
            " 041005034   Pinagtongulan"
        ],
        [
            " 1.0%"
        ],
        [
            " 3,803"
        ],
        [
            " 3,123"
        ],
        [
            "  ▴"
        ],
        [
            " 1.99%"
        ],
        [
            " 041005035   Plaridel"
        ],
        [
            " 1.4%"
        ],
        [
            " 5,402"
        ],
        [
            " 5,089"
        ],
        [
            "  ▴"
        ],
        [
            " 0.60%"
        ],
        [
            " 041005036   Poblacion Barangay 1"
        ],
        [
            " 0.9%"
        ],
        [
            " 3,512"
        ],
        [
            " 4,628"
        ],
        [
            "  ▾"
        ],
        [
            " −2.72%"
        ],
        [
            " 041005037   Poblacion Barangay 2"
        ],
        [
            " 0.8%"
        ],
        [
            " 3,159"
        ],
        [
            " 3,968"
        ],
        [
            "  ▾"
        ],
        [
            " −2.25%"
        ],
        [
            " 041005038   Poblacion Barangay 3"
        ],
        [
            " 0.4%"
        ],
        [
            " 1,661"
        ],
        [
            " 2,474"
        ],
        [
            "  ▾"
        ],
        [
            " −3.91%"
        ],
        [
            " 041005039   Poblacion Barangay 4"
        ],
        [
            " 0.1%"
        ],
        [
            " 508"
        ],
        [
            " 703"
        ],
        [
            "  ▾"
        ],
        [
            " −3.20%"
        ],
        [
            " 041005040   Poblacion Barangay 5"
        ],
        [
            " 0.1%"
        ],
        [
            " 550"
        ],
        [
            " 646"
        ],
        [
            "  ▾"
        ],
        [
            " −1.60%"
        ],
        [
            " 041005041   Poblacion Barangay 6"
        ],
        [
            " 0.1%"
        ],
        [
            " 558"
        ],
        [
            " 1,289"
        ],
        [
            "  ▾"
        ],
        [
            " −8.03%"
        ],
        [
            " 041005042   Poblacion Barangay 7"
        ],
        [
            " 1.2%"
        ],
        [
            " 4,605"
        ],
        [
            " 5,854"
        ],
        [
            "  ▾"
        ],
        [
            " −2.37%"
        ],
        [
            " 041005043   Poblacion Barangay 8"
        ],
        [
            " 0.1%"
        ],
        [
            " 416"
        ],
        [
            " 715"
        ],
        [
            "  ▾"
        ],
        [
            " −5.27%"
        ],
        [
            " 041005044   Poblacion Barangay 9"
        ],
        [
            " 0.1%"
        ],
        [
            " 529"
        ],
        [
            " 448"
        ],
        [
            "  ▴"
        ],
        [
            " 1.68%"
        ],
        [
            " 041005045   Poblacion Barangay 9-A"
        ],
        [
            " 0.2%"
        ],
        [
            " 578"
        ],
        [
            " 786"
        ],
        [
            "  ▾"
        ],
        [
            " −3.03%"
        ],
        [
            " 041005046   Poblacion Barangay 10"
        ],
        [
            " 0.8%"
        ],
        [
            " 2,996"
        ],
        [
            " 3,236"
        ],
        [
            "  ▾"
        ],
        [
            " −0.77%"
        ],
        [
            " 041005047   Poblacion Barangay 11"
        ],
        [
            " 0.1%"
        ],
        [
            " 379"
        ],
        [
            " 407"
        ],
        [
            "  ▾"
        ],
        [
            " −0.71%"
        ],
        [
            " 041005048   Poblacion Barangay 12"
        ],
        [
            " 0.4%"
        ],
        [
            " 1,669"
        ],
        [
            " 2,312"
        ],
        [
            "  ▾"
        ],
        [
            " −3.21%"
        ],
        [
            " 041005049   Pusil"
        ],
        [
            " 0.6%"
        ],
        [
            " 2,181"
        ],
        [
            " 1,634"
        ],
        [
            "  ▴"
        ],
        [
            " 2.93%"
        ],
        [
            " 041005050   Quezon"
        ],
        [
            " 0.5%"
        ],
        [
            " 1,909"
        ],
        [
            " 2,048"
        ],
        [
            "  ▾"
        ],
        [
            " −0.70%"
        ],
        [
            " 041005051   Rizal"
        ],
        [
            " 0.9%"
        ],
        [
            " 3,441"
        ],
        [
            " 3,293"
        ],
        [
            "  ▴"
        ],
        [
            " 0.44%"
        ],
        [
            " 041005052   Sabang"
        ],
        [
            " 5.9%"
        ],
        [
            " 22,153"
        ],
        [
            " 23,535"
        ],
        [
            "  ▾"
        ],
        [
            " −0.60%"
        ],
        [
            " 041005053   Sampaguita"
        ],
        [
            " 2.5%"
        ],
        [
            " 9,327"
        ],
        [
            " 9,232"
        ],
        [
            "  ▴"
        ],
        [
            " 0.10%"
        ],
        [
            " 041005054   San Benito"
        ],
        [
            " 1.2%"
        ],
        [
            " 4,507"
        ],
        [
            " 4,013"
        ],
        [
            "  ▴"
        ],
        [
            " 1.17%"
        ],
        [
            " 041005055   San Carlos"
        ],
        [
            " 2.1%"
        ],
        [
            " 7,759"
        ],
        [
            " 6,574"
        ],
        [
            "  ▴"
        ],
        [
            " 1.67%"
        ],
        [
            " 041005056   San Celestino"
        ],
        [
            " 0.6%"
        ],
        [
            " 2,319"
        ],
        [
            " 2,578"
        ],
        [
            "  ▾"
        ],
        [
            " −1.05%"
        ],
        [
            " 041005057   San Francisco"
        ],
        [
            " 0.8%"
        ],
        [
            " 3,109"
        ],
        [
            " 2,906"
        ],
        [
            "  ▴"
        ],
        [
            " 0.68%"
        ],
        [
            " 041005058   San Guillermo"
        ],
        [
            " 0.5%"
        ],
        [
            " 1,750"
        ],
        [
            " 1,308"
        ],
        [
            "  ▴"
        ],
        [
            " 2.95%"
        ],
        [
            " 041005059   San Jose"
        ],
        [
            " 1.8%"
        ],
        [
            " 6,851"
        ],
        [
            " 6,435"
        ],
        [
            "  ▴"
        ],
        [
            " 0.63%"
        ],
        [
            " 041005060   San Lucas"
        ],
        [
            " 1.1%"
        ],
        [
            " 4,233"
        ],
        [
            " 2,746"
        ],
        [
            "  ▴"
        ],
        [
            " 4.42%"
        ],
        [
            " 041005061   San Salvador"
        ],
        [
            " 1.2%"
        ],
        [
            " 4,384"
        ],
        [
            " 2,985"
        ],
        [
            "  ▴"
        ],
        [
            " 3.92%"
        ],
        [
            " 041005062   San Sebastian"
        ],
        [
            " 1.0%"
        ],
        [
            " 3,647"
        ],
        [
            " 4,425"
        ],
        [
            "  ▾"
        ],
        [
            " −1.91%"
        ],
        [
            " 041005063   Santo Niño"
        ],
        [
            " 0.9%"
        ],
        [
            " 3,343"
        ],
        [
            " 3,084"
        ],
        [
            "  ▴"
        ],
        [
            " 0.81%"
        ],
        [
            " 041005064   Santo Toribio"
        ],
        [
            " 1.0%"
        ],
        [
            " 3,600"
        ],
        [
            " 3,201"
        ],
        [
            "  ▴"
        ],
        [
            " 1.18%"
        ],
        [
            " 041005065   Sapac"
        ],
        [
            " 1.7%"
        ],
        [
            " 6,361"
        ],
        [
            " 5,973"
        ],
        [
            "  ▴"
        ],
        [
            " 0.63%"
        ],
        [
            " 041005066   Sico"
        ],
        [
            " 1.4%"
        ],
        [
            " 5,206"
        ],
        [
            " 5,223"
        ],
        [
            "  ▾"
        ],
        [
            " −0.03%"
        ],
        [
            " 041005067   Talisay"
        ],
        [
            " 1.4%"
        ],
        [
            " 5,236"
        ],
        [
            " 4,386"
        ],
        [
            "  ▴"
        ],
        [
            " 1.79%"
        ],
        [
            " 041005068   Tambo"
        ],
        [
            " 3.4%"
        ],
        [
            " 12,572"
        ],
        [
            " 10,952"
        ],
        [
            "  ▴"
        ],
        [
            " 1.39%"
        ],
        [
            " 041005069   Tangob"
        ],
        [
            " 0.8%"
        ],
        [
            " 3,101"
        ],
        [
            " 2,386"
        ],
        [
            "  ▴"
        ],
        [
            " 2.66%"
        ],
        [
            " 041005070   Tanguay"
        ],
        [
            " 1.3%"
        ],
        [
            " 4,890"
        ],
        [
            " 3,426"
        ],
        [
            "  ▴"
        ],
        [
            " 3.62%"
        ],
        [
            " 041005071   Tibig"
        ],
        [
            " 1.4%"
        ],
        [
            " 5,314"
        ],
        [
            " 3,879"
        ],
        [
            "  ▴"
        ],
        [
            " 3.20%"
        ],
        [
            " 041005072   Tipacan"
        ],
        [
            " 1.0%"
        ],
        [
            " 3,677"
        ],
        [
            " 3,410"
        ],
        [
            "  ▴"
        ],
        [
            " 0.76%"
        ],
        [
            "Total"
        ],
        [
            "372,931"
        ],
        [
            "332,386"
        ],
        [
            " ▴"
        ],
        [
            "1.16%"
        ],
        [
            "San Jose was formerly known as Patay."
        ],
        [
            "In 1957, the sitios of Waniwani, Sayatin and Look were moved from the Balete barrio to the barrio of Look."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lipa"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30.3(86.5)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "31.5(88.7)"
        ],
        [
            "30.5(86.9)"
        ],
        [
            "29.4(84.9)"
        ],
        [
            "29.2(84.6)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "29.6(85.3)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "28(82)"
        ],
        [
            "29.6(85.3)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "27(81)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "25.2(77.4)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20.3(68.5)"
        ],
        [
            "20.4(68.7)"
        ],
        [
            "21.1(70.0)"
        ],
        [
            "22.2(72.0)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "22.5(72.5)"
        ],
        [
            "21.9(71.4)"
        ],
        [
            "22.1(71.8)"
        ],
        [
            "21.9(71.4)"
        ],
        [
            "21.8(71.2)"
        ],
        [
            "21.5(70.7)"
        ],
        [
            "21(70)"
        ],
        [
            "21.6(70.9)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "57(2.2)"
        ],
        [
            "30(1.2)"
        ],
        [
            "32(1.3)"
        ],
        [
            "52(2.0)"
        ],
        [
            "160(6.3)"
        ],
        [
            "221(8.7)"
        ],
        [
            "311(12.2)"
        ],
        [
            "298(11.7)"
        ],
        [
            "270(10.6)"
        ],
        [
            "248(9.8)"
        ],
        [
            "240(9.4)"
        ],
        [
            "169(6.7)"
        ],
        [
            "2,088(82.2)"
        ],
        [
            "Source: Climate-Data.Org"
        ],
        [
            "Lipa has a tropical monsoon climate (Köppen system: Am) under the Köppen climate classification, with a dry season between January and April, and rain for the rest of the year.",
            "The average yearly temperature is 25.6 °C (78.1 °F).",
            "The highest recorded temperature is 35.7 °C (96.3 °F), and the lowest recorded temperature is 16.4 °C (61.5 °F)."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LipaYearPop.±% p.a.1903 37,934—    1918 46,677+1.39%1939 45,175−0.16%1948 49,884+1.11%1960 69,036+2.74%1970 93,971+3.13%1975 106,094+2.46%1980 121,166+2.69%1990 160,117+2.83%1995 177,894+1.99%2000 218,447+4.50%2007 260,568+2.46%2010 283,468+3.11%2015 332,386+3.08%2020 372,931+2.29%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Lipa, Batangas, in the 2020 census was 372,931 people, with a density of 1,780 inhabitants per square kilometre or 4,600 inhabitants per square mile."
        ],
        [
            "Language"
        ],
        [
            "Tagalog is the most widely spoken language in the city.",
            "English is the medium of instruction in schools and is widely understood and spoken especially in the business community and for official documents."
        ],
        [
            "Religion"
        ],
        [
            "Catholicism"
        ],
        [
            "Lipa Cathedral, the seat of the Roman Catholic Archdiocese of Lipa"
        ],
        [
            "Majority of the city's population are Roman Catholics, and the Roman Catholic Archdiocese of Lipa today comprises the civil province of Batangas.",
            "Formed as the Diocese of Lipa on April 10, 1910, the archdiocese once covered other provinces such as Batangas, Laguna, Quezon, Marinduque and Mindoro, with Most Reverend Joseph Petrelli, D.D.",
            "as the first bishop.",
            "Currently, the archdiocese is divided into 6 vicariates, each headed by a vicar forane.",
            "There are 49 parishes in all, served by 143 priests (122 of which are diocesan), 13 religious brothers, and 197 religious sisters.",
            "There are also 23 existing Catholic schools, two high school seminaries, three college seminaries, and two pastoral centers."
        ],
        [
            "The Church and Monastery of Lipa is the location of a 1940s apparition of the Virgin Mary which was seen by sister Teresing Castillo and numerous accounts of rose petal showers from the 1940s to the 1960s.",
            "Some of the rose petals, which had the silhouette of the Virgin Mary when flashed with light, have been preserved by the Diocese of Lipa and various townfolks who have witnessed the petal showers.",
            "An investigation conducted by researchers of the University of the Philippines proved that the figures on the petals were natural and not stamped by man-made means.",
            "A few years after the apparition of the Virgin Mary, the Vatican released a document stating that the apparition in Lipa was false.",
            "Despite this, the rose petal showers continued until the last apparition of Mary appeared, saying three things, of which the most important was to 'pray for China', which at the time was among the poorest regions in the world.",
            "Due to the decline of the Vatican regarding the apparition, the Diocese of Lipa ordered the destruction of Mary's statue in the church which depicted the apparition.",
            "However, the founding nuns of the church hid it instead.",
            "Decades afterwards in the 21st century, before the death of a founding nun, she wished for the statue of the apparition to be viewed by the public once more.",
            "Thousands of devotees went back to the church and since then, the statue has been in public view.",
            "During a certain event, the priest ordered a mass outside the church to bless the municipality of Lipa, where the apparition statue was brought outside as well.",
            "During that time, sun beatings from heaven, which was viewed by thousands of people during a mass outside the church, occurred.",
            "Devotees flocked Lipa afterwards, where cures for blindness and terminal sickness were cured through the usage of prayers with the preserved petals from the petal showers of the 1940s to the 1960s.",
            "In 2014, it was later found out that most of the bishops who signed in favor of declaring the apparitions of the 1940s as a lie were forced to sign such documents.",
            "This sparked the current Lipa Church to gather as much evidence to back the existence and miracles of the apparitions."
        ],
        [
            "Protestants and other groups"
        ],
        [
            "There are other Christian groups such as various Protestant denominations including Evangelicals, Born Again, Iglesia ni Cristo, Members Church of God International (MCGI), Kingdom of Jesus Christ, Jehovah's Witnesses, Seventh-Day Adventist, and the Church of Jesus Christ of Latter-day Saints."
        ],
        [
            "Other religions include Islam and Buddhism."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Lipa"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  25.60"
        ],
        [
            "2009  3.86"
        ],
        [
            "2012  5.21"
        ],
        [
            "2015  4.20"
        ],
        [
            "2018  9.95"
        ],
        [
            "2021  12.03"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Downtown Lipa"
        ],
        [
            "Aerial view of Lipa at night"
        ],
        [
            "Lipa's proximity to the country's capital, Manila, having an approximate distance of 86 kilometers or an hour and half drive via the Southern Luzon Expressway enhances its strategic access to development trends.",
            "It is fast emerging as a key city in the province, becoming a major institutional/administrative center, medical center, commercial center, financial center, agro-industrial center and residential center."
        ],
        [
            "It is identified as an ideal hub and center of the Calabarzon Agro-Industrial Region in the Regional Physical Framework Plan of Region IV-A.",
            "In the recent past, Lipa is being transformed from an agrarian to an urbanized area.",
            "A significant portion of the agricultural land area of the city has been converted to residential subdivisions, industrial area with the establishment of Lima Technology Center utilizing lands in the city and Malvar Municipality.",
            "Recently, the influx of business process outsourcing (BPO) firms such as call centers have contributed much to the growth of the local economy.",
            "BPO sites are scattered throughout the city.",
            "It ranked 6th out of 10 in the Top 10 next wave cities of 2010 by the Commission of Information and Communication Technology (ICCT).",
            "Teletech Inc. pioneered the BPO company in Lipa City in 2006.",
            "Alorica followed after few years.",
            "The most recent BPO company is The Results."
        ],
        [
            "Likewise, due to a very strategic location, the Lipa City Market is comparatively busy than other neighboring towns.",
            "Thus it boasts a large quantity of market business.",
            "As a result, it attracts more customers from neighboring towns like Padre Garcia, Rosario, Ibaan, San Juan, Malvar, Mataas na Kahoy, Balete, Cuenca, and Lemery and from the cities of Batangas, Santo Tomas and Tanauan.",
            "An S&R Membership Shopping outlet is located besides it."
        ],
        [
            "It is also noticeable that Lipa City is being home to new settlers from different regions.",
            "Muslims from Mindanao for example have settled in Lipa City, primarily due to growing economy.",
            "There are also settlers from Mindoro, Bicol, Quezon and other places.",
            "Likewise, there are many Koreans who established their business in Lipa.",
            "Furthermore, it is evident that Indian Nationals are also an everyday sight."
        ],
        [
            "Culture"
        ],
        [
            "Food"
        ],
        [
            "Lipa is the home of lomi.",
            "According to history, this is primarily due to the influence of early Chinese settlers."
        ],
        [
            "Lomi is cooked using raw noodles, cassava mixed with water, beaten egg, salt and pepper, meat, liver and other ingredients that make it tasty.",
            "Eventually, there are countless of variations of Lomi these days.",
            "The lomi house is a very common place found in every barangay.",
            "However, there are a few recognized by the Lipenos, like Renfel, Kids Lomihouse, LBN, Beegees, Liam's to mention a few."
        ],
        [
            "Goto is also a popular recipe.",
            "It is usually composed of internal organs of cows.",
            "This is a bowl of hot soup with beef, tripe, entrails, and blood, added with fish sauce and calamansi juice with chili."
        ],
        [
            "However, due to influx of culture from nearby provinces, Lipeños also enjoy new recipes like sisig of Pampanga, and Bicol Express of Bicol."
        ],
        [
            "Due to Lipa's craze for food, several food courts have been established."
        ],
        [
            "Technology"
        ],
        [
            "Lipa has few technologically advanced infrastructure.",
            "PKI is one of the advanced factories that pioneered the productions in Lipa City.",
            "Since it was established in Barangay Inosluban, Lipa City was known to be an employment-friendly zone.",
            "This was followed by the establishment of LIMA Industrial Park, which houses multiple production lines.",
            "It houses various companies that employ hundreds of production workers.",
            "Not only from the city proper, it hires employees from its nearby cities like Tanauan, Rosario, Batangas, San Jose, Malvar etc."
        ],
        [
            "Museums"
        ],
        [
            "Museo de Lipa, inaugurated in November 2007, is a project of the Lipa City Tourism Council envisioned by its Past President, Lucila R. Resurreccion.",
            "On display are antique mementos such as: the Coffee Corner – an exhibit of the different tools used in coffee production; Las trajes de mestizas and ternos – gowns worn by women during the pre-war days and during festive occasions; the Satsuma Vase – a gift given by the Luna brothers to the unparalleled hospitality shown by the aristocratic couple Doña Germana Solis and Dr. Jose Lozada; and the office tables of Don Claro Mayo Recto and Mayor Carlos Solis, the 24-hour Mayor."
        ],
        [
            "Other artifacts exhibited are certain collections of furniture and objects of art loaned and donated by different antique collectors and by some of the landed gentry of Lipa: antique cabinets, tables, mirrors,  antique silverware chinaware, tea sets, religious images and articles, jars, and brass artifacts."
        ],
        [
            "The ground floor serves as a function area and features works of several contemporary Lipeño visual artists."
        ],
        [
            "Religious monuments"
        ],
        [
            "In 1605, Don Diego de Salcedo discovered a community of farmers living in fairly good economic conditions at Lake Bombon, now Tagbakin, Lipa City.",
            "The Augustinians among them started a religious mission called “Convent of San Sebastian in Comintang”."
        ],
        [
            "However, the residents noticed that the land area- residential and agricultural-was getting smaller due to the rising waters of Taal Lake, they transferred to Balete.",
            "But the site was submerged by the lake in 1754 after the eruption of Taal Volcano.",
            "To avoid a similar occurrence, the townsfolk decided to transfer the town to a place far from the lake and the volcano.",
            "Legend has it that they agreed to pray the rosary while walking and whenever they may be at the end of the 24th mystery, there the town would be relocated.",
            "And they walked upland, away from the lake and the volcano, and at the end of the 24th mystery, they reached what is now called Mataas na Lupa.",
            "The temporary poblacion and the church were thus resettled there."
        ],
        [
            "The location benefited everybody since it was along the main road that led to the coastal towns, the ground was high enough and the east winds were hedged in by high mountains.",
            "But after some time, the settlers had to seek another location due to the problem of water supply.",
            "The “better site” is the present site of the cathedral.",
            "The Augustinians administered the parish until the end of the 19th century."
        ],
        [
            "The first church building was made of light materials.",
            "The building of “serious architecture, proven solidity and great proportions” was begun in 1779 and finally completed in 1865, on the first year of Fr.",
            "Benito Varas who administered the town until 1894."
        ],
        [
            "The church was made of hewn stone and tiled roof, in accordance with the usual pattern of churches.",
            "It was a rectangular structure with artistically painted wooden panelings in lieu of an arch to which were attached support and strong beams which crisscrossed the walls to protect the building from earthquakes, attractive and had plain and simple altar ornaments without the extravagant carvings that were characteristic of the past century."
        ],
        [
            "During the 19th century, keen competition among Tanauan, Lipa, Batangas, Bauan and Taal for the choice of the seat of new diocese in the Southern Tagalog Region, with Batangas Province at the center, motivated the people to build extraordinary, big churches.",
            "On April 10, 1910, the historic creation of the new diocese took place and the first bishop, Joseph Petrelli, selected Lipa as the see because of its cool climate.",
            "In later years, there were moves to transfer the see to San Pablo City but Bishop Alfredo Verzosa turned it down due to poor religious environment of San Pablo during that time."
        ],
        [
            "The church suffered heavily in 1944.",
            "Alejandro Olalia repaired the façade, the dome, the transept, the roof, the main altar, and the belfry.",
            "The interior painting was retouched.",
            "Two side aisles were added.",
            "The church was awarded the title Cathedral of the archdiocese incorporating Batangas Province during the administration of Cardinal Rufino Santos."
        ],
        [
            "Pedro G. Galende wrote that \"the emphasis (of the edifice) is placed on the mass, which appeals much more to the senses due to its harmonic organization.",
            "The three buildings – church, convent and bell tower are so closely associated with each other that they well exemplify the typical mission complex.\""
        ],
        [
            "At present, the 220-year old cathedral and convent is undergoing restoration and repairs."
        ],
        [
            "Festivals"
        ],
        [
            "In the previous years, Lipa City had the Coffee Festival as its official city festival being coffee granary of the Philippines.",
            "The Coffee Festival was then celebrated from December 11 to 16."
        ],
        [
            "Then Lipa also had the Walistik Festival celebrated on the second week of January where walis (broom) was used in costumes and props.",
            "Walis symbolizes unity and this was what the Lipeños had in mind every time they celebrate Walistik Festival."
        ],
        [
            "Now, Lipa City is celebrating Lomi Festival.",
            "Lomi, being one of the most popular dishes in this side of the province, Lipa City has quite a number of lomi houses which never cease to entice people."
        ],
        [
            "Traditionally, however, Lipa City is celebrating Lipa City Town Fiesta annually every January 20.",
            "This is a date to celebrate the feast of their patron saint, Saint Sebastian.",
            "During the celebration, the main road of CM Recto is flocked with market-stalls selling affordable items.",
            "Also peoples visit the Lipa City Cathedral to attend mass.",
            "Houses prepare and serve food to visitors."
        ],
        [
            "Transportation"
        ],
        [
            "Road networks"
        ],
        [
            "Lipa has an extensive road network.",
            "The city is a transportation hub for Batangas and nearby provinces."
        ],
        [
            "National highways and expressways"
        ],
        [
            "Ayala Highway"
        ],
        [
            "Lipa is served by a network of national highways and an expressway.",
            "The Southern Tagalog Arterial Road (STAR Tollway) connects the city with Batangas City, Tanauan and Santo Tomas, with a connection to South Luzon Expressway (SLEX), thereby linking the city with Calamba and Metro Manila.",
            "Jose P. Laurel Highway, or Ayala Highway (Route 4) on one portion, connects Lipa with the municipalities and cities of Malvar, Tanauan, and Santo Tomas in the north and San Jose and Batangas City to the south.",
            "P. Torres Street or Lipa-Padre Garcia Road (Route 431), links the city with Padre Garcia and also serves as a route to the municipalities Rosario and San Juan.",
            "Another highway, the Alaminos-Lipa City Road, serves the northern barangays of the city, runs northeast to Alaminos and serves as a route to the city with San Pablo in Laguna.",
            "Governor Feliciano P. Leviste Highway or Lipa-Balete Road links Lipa with Balete."
        ],
        [
            "Arterial roads"
        ],
        [
            "B. Morada Avenue in the poblacion"
        ],
        [
            "Claro M. Recto Avenue, General Luna Avenue, and B. Morada Avenue serve the city center or poblacion.",
            "On the rural areas within the city boundary, arterial roads, like Lodlod Avenue, Santo Tomas-Lipa Road and Lipa-Ibaan Road, serve the barangays and also connect with nearby municipalities, like San Jose-Batangas, Santo Tomas and Ibaan-Batangas respectively.",
            "An arterial road running beside Fernando Air Base serves the municipality of Mataasnakahoy."
        ],
        [
            "Public transportation"
        ],
        [
            "Buses, vans, jeepneys, tricycles, and multicabs common means of transportation in the city.",
            "Large numbers of jeepneys ply their trade around the city, and are becoming the primary mode of transportation.",
            "A grand terminal built beside SM City Lipa mall now serves as the city's central transport terminal."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Panglungsod"
        ],
        [
            "Lipa City Hall"
        ],
        [
            "Like other cities in the Philippines, Lipa is governed by a mayor and vice mayor who are elected to three-year terms.",
            "The mayor is the executive head who leads the city's departments in the execution of city ordinances and in the delivery of public services.",
            "The vice mayor heads a legislative council that is composed of 13 members: twelve elected councilors and one ex officio office held by the Association of Barangay Chairmen President as the barangay sector representative.",
            "The council is in charge of creating the city's policies in the form of ordinances and resolutions."
        ],
        [
            "City Government of Lipa(2022–2025)"
        ],
        [
            "Representative"
        ],
        [
            "Vacant"
        ],
        [
            "Mayor"
        ],
        [
            "Eric B. Africa (Nacionalista)"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Camille Angeline M. Lopez (Reporma)"
        ],
        [
            "Sangguniang Panlungsod Members"
        ],
        [
            "Michael Gerard T. Morada (Nacionalista)"
        ],
        [
            "Miguel P. Lina III (Nacionalista)"
        ],
        [
            "Galeleo P. Angeles (Nacionalista)"
        ],
        [
            "Merlo P. Silva (Nacionalista)"
        ],
        [
            "Jennifer Spye T. Toledo (Nacionalista)"
        ],
        [
            "Avior R. Rocafort (Nacionalista)"
        ],
        [
            "Oscar M. Gozos II (Nacionalista)"
        ],
        [
            "Ralph Peter S. Umali (Nacionalista)"
        ],
        [
            "Riofer Nicole H. Ronquillo (Nacionalista)"
        ],
        [
            "Aries D. Macala (Nacionalista)"
        ],
        [
            "Venice D. Manalo (Nacionalista)"
        ],
        [
            "Percival V. Lojo, MD (Nacionalista)"
        ],
        [
            "LMB President"
        ],
        [
            "Windy P. Lat (San Lucas)"
        ],
        [
            "SK Federation President"
        ],
        [
            "Angela Antonette B. Bautista (Pangao)"
        ],
        [
            "Provincial Board Members"
        ],
        [
            "Lydio A. Lopez, Jr (Nacionalista)"
        ],
        [
            "Aries Emmanuel D. Mendoza (Nacionalista)"
        ],
        [
            "Pursuant to Chapter II, Title II, Book III of Republic Act No.",
            "7160 or the Local Government Code of 1991, the city government is to be composed of a mayor (alkalde), a vice mayor (bise alkalde) and members (kagawad) of the legislative branch Sangguniang Panlungsod alongside a secretary to the said legislature, all of which are elected to a three-year term and are eligible to run for three consecutive terms."
        ],
        [
            "As with every Philippine city, Lipa's chief executive is the city mayor.",
            "Elected to a term of three years and limited to three consecutive terms, the mayor appoints the directors of each city department, which include the office of administration, engineering office, information office, legal office, and treasury office.",
            "The incumbent mayor is Eric Africa of the Nacionalista Party."
        ],
        [
            "The city's vice mayor performs duties as acting governor in the absence of the mayor.",
            "The vice mayor also automatically succeeds as mayor upon the death of the incumbent.",
            "The vice mayor also convenes the Sangguniang Panlungsod, the city's legislative body.",
            "The incumbent vice mayor of Lipa is Camille Angeline Lopez of Partido para sa Demokratikong Reporma, the first female to hold the position."
        ],
        [
            "Legislative"
        ],
        [
            "Within the city, the City Board or Sangguniang Panlungsod crafts all city ordinances, performs appropriation of city funds, issues franchises and permits, impose fees on city services, and exercise other duties and powers as stipulated by the Local Government Code of 1991.",
            "Being a first-class city in terms of income, Lipa is entitled to a City Board composed of 12 members."
        ],
        [
            "The city, which is solely comprised by the province's 6th congressional district, was last represented in the Philippine House of Representatives by Ralph Recto of the Nacionalista Party."
        ],
        [
            "Education"
        ],
        [
            "Lipa hosts a number of public and private universities such as the Batangas State University Claro M. Recto Campus, Kolehiyo ng Lungsod ng Lipa, The Mabini Academy, De La Salle Lipa, Lipa City Colleges, Canossa Academy Lipa, AMA Computer College, Philippine State College of Aeronautics, University of Batangas.",
            "ICT-ED Institute of Science and Technology, STI College, New Era University, and the National University also hosts a campus in the city."
        ],
        [
            "Additional schools"
        ],
        [
            "Pinagtongulan National High School"
        ],
        [
            "Media"
        ],
        [
            "Lipa has two local radio stations, Magik 88.7 (DZUN), an adult contemporary-oriented station, and Citybeat 102.3 (DWKV), a music and talk radio station.",
            "Stations based in Batangas City and Metro Manila are mostly clearly received, except for some stations whose signals are affected by the local topography."
        ],
        [
            "ABS-CBN Southern Tagalog, ABS-CBN's regional television station, hosted its studios in Lipa.",
            "GMA Network and GTV serve Lipa through relay stations at Bicol Region."
        ],
        [
            "Lipa has no locally published newspapers, but major newspapers marketed in Metro Manila reach the city through local distributors."
        ],
        [
            "Sister cities"
        ],
        [
            "International"
        ],
        [
            " Fremont, California, United States"
        ],
        [
            " Fushun, China"
        ],
        [
            "Local"
        ],
        [
            "Manila"
        ],
        [
            "References"
        ],
        [
            "^  City of Lipa |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Lipa City's Famous Destinations Retrieved January 24, 2012."
        ],
        [
            "^ Abs-Cbn Interactive, President Arroyo inaugurates Batangas port project Archived July 9, 2007, at archive.today"
        ],
        [
            "^ For the text of the decree: Gaceta de Madrid.",
            "no.",
            "307. pg.",
            "345.",
            "November 3, 1887.",
            "BOE.es.",
            "Also published, along with the authorisation of a coat of arms, in the Gaceta de Manila: Año XXVII, tomo II, numero 174. pg.",
            "805.",
            "December 21, 1887. digitallibrary.ust.edu.ph"
        ],
        [
            "^ \"Who is Valerio Malabanan?\".",
            "thephilippinestoday.com.",
            "The Philippines Today.",
            "July 8, 2020.",
            "Retrieved March 29, 2021.",
            "Among his stellar pupils were General Miguel Malvar, one of the last Filipino leaders to surrender in the Philippine-American War; Melchor Virrey, a known educator in Manila; & Apolinario Mabini, 1st head of the Aguinaldo cabinet and Prime Minister of the 1st Philippine Republic."
        ],
        [
            "^ Renz Katigbak (October 29, 2018).",
            "\"Kasaysayan Ng Lipa\".",
            "herencialipena.com.",
            "Herencia Lipeña.",
            "Retrieved April 16, 2023.",
            "For the Greater Honor and Glory of God.",
            "An everlasting memento to this *Villa*.",
            "This cemetery was built by the Parish Priest of this town Most.",
            "Rev.",
            "Fr.",
            "Fray Benito Baras.",
            "Having been blessed on the 7th Day of April 1890."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"An Act Changing the Name of the Barrio of Patay, in the City of Lipa, to San Jose\".",
            "LawPH.com.",
            "Retrieved April 9, 2011."
        ],
        [
            "^ \"An Act to Create the Barrio of Bungahan in the City of Lipa\".",
            "LawPH.com.",
            "Archived from the original on July 10, 2012.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ \"An Act Creating the Barrio of Look in the City of Lipa\".",
            "LawPH.com.",
            "Archived from the original on July 10, 2012.",
            "Retrieved April 12, 2011."
        ],
        [
            "^"
        ],
        [
            "\"Climate:Lipa\".",
            "Climate-Data.Org.",
            "Retrieved July 26, 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Batangas\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Batangas Goto Recipe | Recipe | yummy.ph\".",
            "Archived from the original on September 15, 2016."
        ],
        [
            "^ \"An Act Providing for a Local Government Code of 1991\".",
            "The LawPhil Project.",
            "8th Congress of the Republic of the Philippines.",
            "Retrieved April 21, 2014."
        ],
        [
            "^ \"NU Lipa\"."
        ],
        [
            "^ \"\"Lipa City, Philippines & Fremont, California\"\".",
            "Sister Cities International.",
            "Archived from the original on February 4, 2015.",
            "Retrieved February 4, 2015."
        ],
        [
            "^ \"Overview of China-Philippines Bilateral Relations\".",
            "ph.china-embassy.org.",
            "Retrieved March 5, 2009."
        ],
        [
            "^ \"Manila, Lipa to enter into sister city pact | Philippine News Agency\".",
            "Philippine News Agency."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Lipa, Batangas."
        ],
        [
            "Wikivoyage has a travel guide for Lipa, Batangas."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "\"Official Website of the Government of Lipa City\".",
            "Archived from the original on December 4, 2019."
        ],
        [
            "Lipa City Tourism Council"
        ],
        [
            "\"Lipa\" .",
            "Encyclopædia Britannica (11th ed.).",
            "1911."
        ],
        [
            "Places adjacent to Lipa, Batangas"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Balete / Malvar / Santo Tomas"
        ],
        [
            "Alaminos, Laguna"
        ],
        [
            "Taal LakeCuenca"
        ],
        [
            "Lipa City"
        ],
        [
            "San Pablo, LagunaTiaong, QuezonSan Antonio, Quezon"
        ],
        [
            "San Jose"
        ],
        [
            "Ibaan / Rosario"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Articles Related to Lipa, Batangas"
        ],
        [
            "vte Province of BatangasBatangas City (capital)  Lipa City (largest city)Component cities"
        ],
        [
            "Batangas City"
        ],
        [
            "Calaca"
        ],
        [
            "Lipa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tanauan"
        ],
        [
            "Municipalities"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alitagtag"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Bauan"
        ],
        [
            "Calatagan"
        ],
        [
            "Cuenca"
        ],
        [
            "Ibaan"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Lobo"
        ],
        [
            "Mabini"
        ],
        [
            "Malvar"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Nasugbu"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Rosario"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Taal"
        ],
        [
            "Talisay"
        ],
        [
            "Taysan"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "vteCalabarzon (Region IV-A)CAvite, LAguna, BAtangas, Rizal, QueZONRegional center"
        ],
        [
            "Calamba"
        ],
        [
            "Provinces"
        ],
        [
            "Batangas"
        ],
        [
            "Cavite"
        ],
        [
            "Laguna"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Lucena"
        ],
        [
            "Component cities"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Batangas City"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "Calaca"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Lipa"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tanauan"
        ],
        [
            "Tayabas"
        ],
        [
            "Trece Martires"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Antipolo"
        ],
        [
            "Batangas City"
        ],
        [
            "Imus (de jure)"
        ],
        [
            "Lucena"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Trece Martires (de facto)"
        ],
        [
            "Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alabat"
        ],
        [
            "Alaminos"
        ],
        [
            "Alfonso"
        ],
        [
            "Alitagtag"
        ],
        [
            "Amadeo"
        ],
        [
            "Angono"
        ],
        [
            "Atimonan"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Baras"
        ],
        [
            "Bauan"
        ],
        [
            "Bay"
        ],
        [
            "Binangonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Cainta"
        ],
        [
            "Calatagan"
        ],
        [
            "Calauag"
        ],
        [
            "Calauan"
        ],
        [
            "Candelaria"
        ],
        [
            "Cardona"
        ],
        [
            "Catanauan"
        ],
        [
            "Cavinti"
        ],
        [
            "Cuenca"
        ],
        [
            "Dolores"
        ],
        [
            "Famy"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Luna"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Ibaan"
        ],
        [
            "Indang"
        ],
        [
            "Infanta"
        ],
        [
            "Jalajala"
        ],
        [
            "Jomalig"
        ],
        [
            "Kalayaan"
        ],
        [
            "Kawit"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Liliw"
        ],
        [
            "Lobo"
        ],
        [
            "Lopez"
        ],
        [
            "Los Baños"
        ],
        [
            "Lucban"
        ],
        [
            "Luisiana"
        ],
        [
            "Lumban"
        ],
        [
            "Mabini"
        ],
        [
            "Mabitac"
        ],
        [
            "Macalelon"
        ],
        [
            "Magallanes"
        ],
        [
            "Magdalena"
        ],
        [
            "Majayjay"
        ],
        [
            "Malvar"
        ],
        [
            "Maragondon"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Mauban"
        ],
        [
            "Mendez"
        ],
        [
            "Morong"
        ],
        [
            "Mulanay"
        ],
        [
            "Nagcarlan"
        ],
        [
            "Naic"
        ],
        [
            "Nasugbu"
        ],
        [
            "Noveleta"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Paete"
        ],
        [
            "Pagbilao"
        ],
        [
            "Pagsanjan"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pila"
        ],
        [
            "Pililla"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Rizal"
        ],
        [
            "Rodriguez"
        ],
        [
            "Rosario (Batangas)"
        ],
        [
            "Rosario (Cavite)"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Mateo"
        ],
        [
            "San Narciso"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Sariaya"
        ],
        [
            "Silang"
        ],
        [
            "Siniloan"
        ],
        [
            "Taal"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Talisay"
        ],
        [
            "Tanay"
        ],
        [
            "Tanza"
        ],
        [
            "Taysan"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Ternate"
        ],
        [
            "Tiaong"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "Unisan"
        ],
        [
            "Victoria"
        ],
        [
            "Barangays"
        ],
        [
            "Batangas (List)"
        ],
        [
            "Cavite (List)"
        ],
        [
            "Laguna (List)"
        ],
        [
            "Quezon (List)"
        ],
        [
            "Rizal (List)"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "vte Philippines cities with a 100,000+ population2,000,000 and more"
        ],
        [
            "Quezon City (2,960,048)"
        ],
        [
            "1,000,000–1,999,999"
        ],
        [
            "Manila (1,846,513)"
        ],
        [
            "Davao City (1,776,949)"
        ],
        [
            "Caloocan (1,661,584)"
        ],
        [
            "Taguig (1,223,597)"
        ],
        [
            "500,000–999,999"
        ],
        [
            "Zamboanga City (977,234)"
        ],
        [
            "Cebu City (964,169)"
        ],
        [
            "Antipolo (887,399)"
        ],
        [
            "Pasig (803,159)"
        ],
        [
            "Cagayan de Oro (728,402)"
        ],
        [
            "Valenzuela (714,978)"
        ],
        [
            "Dasmariñas (703,141)"
        ],
        [
            "General Santos (697,315)"
        ],
        [
            "Parañaque (689,992)"
        ],
        [
            "Bacoor (664,625)"
        ],
        [
            "San Jose del Monte (651,813)"
        ],
        [
            "Las Piñas (606,293)"
        ],
        [
            "Bacolod (600,783)"
        ],
        [
            "Muntinlupa (543,445)"
        ],
        [
            "Calamba (539,671)"
        ],
        [
            "200,000–499,999"
        ],
        [
            "Lapu-Lapu City (497,604)"
        ],
        [
            "Imus (496,794)"
        ],
        [
            "Angeles City (462,928)"
        ],
        [
            "Iloilo City (457,626)"
        ],
        [
            "Marikina (456,059)"
        ],
        [
            "General Trias (450,583)"
        ],
        [
            "Pasay (440,656)"
        ],
        [
            "Mandaluyong (425,758)"
        ],
        [
            "Santa Rosa (414,812)"
        ],
        [
            "Biñan (407,437)"
        ],
        [
            "Tarlac City (385,398)"
        ],
        [
            "Malabon (380,522)"
        ],
        [
            "Lipa (372,931)"
        ],
        [
            "Butuan (372,910)"
        ],
        [
            "Baguio (366,358)"
        ],
        [
            "Mandaue (364,116)"
        ],
        [
            "Iligan (363,115)"
        ],
        [
            "Cabuyao (355,330)"
        ],
        [
            "San Fernando (Pampanga) (354,666)"
        ],
        [
            "Batangas City (351,647)"
        ],
        [
            "Cabanatuan (327,325)"
        ],
        [
            "San Pedro (326,001)"
        ],
        [
            "Cotabato City (325,079)"
        ],
        [
            "Puerto Princesa (307,079)"
        ],
        [
            "Tagum (296,202)"
        ],
        [
            "Mabalacat (293,244)"
        ],
        [
            "Makati (292,743)"
        ],
        [
            "San Pablo (285,348)"
        ],
        [
            "Lucena (278,924)"
        ],
        [
            "Talisay (Cebu) (263,048)"
        ],
        [
            "Malolos (261,189)"
        ],
        [
            "Olongapo (260,317)"
        ],
        [
            "Tacloban (251,881)"
        ],
        [
            "Navotas (247,543)"
        ],
        [
            "Ormoc (230,998)"
        ],
        [
            "Meycauayan (225,673)"
        ],
        [
            "Santo Tomas (218,500)"
        ],
        [
            "Valencia (Bukidnon) (216,546)"
        ],
        [
            "Trece Martires (210,503)"
        ],
        [
            "Pagadian (210,542)"
        ],
        [
            "Legazpi (209,533)"
        ],
        [
            "Panabo (209,230)"
        ],
        [
            "Naga (Camarines Sur) (209,170)"
        ],
        [
            "Toledo (207,314)"
        ],
        [
            "Marawi (207,010)"
        ],
        [
            "San Carlos (Pangasinan) (205,424)"
        ],
        [
            "Kabankalan (200,198)"
        ],
        [
            "100,000–199,999"
        ],
        [
            "Koronadal (195,398)"
        ],
        [
            "Bago (191,210)"
        ],
        [
            "Malaybalay (190,712)"
        ],
        [
            "Digos (188,376)"
        ],
        [
            "Calbayog (186,960)"
        ],
        [
            "Sorsogon City (182,237)"
        ],
        [
            "Roxas City (179,292)"
        ],
        [
            "Dagupan (174,302)"
        ],
        [
            "Surigao City (171,107)"
        ],
        [
            "Baliwag (168,470)"
        ],
        [
            "Tuguegarao (166,334)"
        ],
        [
            "Kidapawan (160,791)"
        ],
        [
            "Cadiz (158,544)"
        ],
        [
            "Ilagan (158,258)"
        ],
        [
            "Danao (156,321)"
        ],
        [
            "San Jose (Nueva Ecija) (150,917)"
        ],
        [
            "Sagay (148,894)"
        ],
        [
            "Santiago (148,580)"
        ],
        [
            "Mati (147,547)"
        ],
        [
            "Urdaneta (144,577)"
        ],
        [
            "Cauayan (143,403)"
        ],
        [
            "Calapan (145,786)"
        ],
        [
            "Tabaco (140,961)"
        ],
        [
            "Ozamis (140,443)"
        ],
        [
            "Dipolog (138,141)"
        ],
        [
            "Gingoog (136,698)"
        ],
        [
            "Carcar (136,453)"
        ],
        [
            "Dumaguete (134,103)"
        ],
        [
            "Naga (Cebu) (133,184)"
        ],
        [
            "San Carlos (Negros Occidental) (132,650)"
        ],
        [
            "Silay (130,478)"
        ],
        [
            "Isabela (Basilan) (130,379)"
        ],
        [
            "San Juan (Metro Manila) (126,347)"
        ],
        [
            "San Fernando (La Union) (125,640)"
        ],
        [
            "Gapan (122,968)"
        ],
        [
            "Bayawan (122,747)"
        ],
        [
            "Tabuk (121,033)"
        ],
        [
            "Ligao (118,096)"
        ],
        [
            "Samal (Davao del Norte) (116,771)"
        ],
        [
            "Himamaylan (116,240)"
        ],
        [
            "Iriga (114,457)"
        ],
        [
            "Tayabas (112,658)"
        ],
        [
            "Baybay (111,848)"
        ],
        [
            "Laoag (111,651)"
        ],
        [
            "Tacurong (109,319)"
        ],
        [
            "Talisay (Negros Occidental) (108,909)"
        ],
        [
            "Catbalogan (106,440)"
        ],
        [
            "Carmona (106,256)"
        ],
        [
            "Tagbilaran (104,976)"
        ],
        [
            "Masbate City (104,522)"
        ],
        [
            "Balanga (104,173)"
        ],
        [
            "Guihulngan (102,656)"
        ],
        [
            "Cavite City (100,674)"
        ],
        [
            "Lamitan (100,150)"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Germany"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Lipa,_Batangas&oldid=1232139858\""
        ],
        [
            "Categories: Lipa, BatangasCities in BatangasPopulated places established in 18871887 establishments in the PhilippinesPopulated places on Taal LakeComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasWebarchive template archiveis linksCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataWikipedia indefinitely semi-protected pagesUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from July 2022Articles needing additional references from November 2017All articles needing additional referencesPages using multiple image with auto scaled imagesPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Tagalog IPAArticles containing Filipino-language textArticles needing additional references from May 2012All articles with unsourced statementsArticles with unsourced statements from February 2020Commons category link from WikidataWikipedia articles incorporating a citation from the 1911 Encyclopaedia Britannica with Wikisource referenceArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with GND identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}