{
    "name": "Loboc",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Loboc"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°38′N 124°02′E﻿ / ﻿9.63°N 124.03°E﻿ / 9.63; 124.03"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bohol, Philippines"
        ],
        [
            "Not to be confused with Lobo, Batangas."
        ],
        [
            "Municipality in Central Visayas, PhilippinesLobocMunicipalityMunicipality of LobocPoblacion, Loboc"
        ],
        [
            "FlagFlag (reverse)Map of Bohol with Loboc highlightedOpenStreetMapLobocLocation within the PhilippinesCoordinates: 9°38′N 124°02′E﻿ / ﻿9.63°N 124.03°E﻿ / 9.63; 124.03CountryPhilippinesRegionCentral VisayasProvinceBoholDistrict"
        ],
        [
            "3rd districtFounded1602Barangays28"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorLeon A. Calipusan • Vice MayorPablio D. Sumampong • RepresentativeKristine Alexie B. Tutor • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Boniefer Baguio• Raymond Jala• German Palapar• Luisito Digal• Silvestre Maghuyop• Jansyl Lovan Tumanda• Asterio Calacar• George Calipusan"
        ],
        [
            " • Electorate13,855 voters (2022)Area • Revenue₱ 113.8 million (2020) • Assets₱ 279.3 million (2020) • Expenditure₱ 126 million (2020) • Liabilities₱ 62.95 million (2020)Service provider • ElectricityBohol 1 Electric Cooperative (BOHECO 1)Time zoneUTC+8 (PST)ZIP code6316PSGC071229000IDD : area code +63 (0)38Native languagesBoholano dialect Cebuano TagalogWebsitewww.lobocbohol.gov.ph"
        ],
        [
            "Loboc, officially the Municipality of Loboc (Cebuano: Munisipalidad sa Loboc; Tagalog: Bayan ng Loboc),  is a 4th class municipality in the province of Bohol, Philippines.",
            "According to the 2020 census, it has a population of 17,418 people."
        ],
        [
            "Located 28 kilometres (17 mi) east of Tagbilaran, Loboc is widely known for its lunch cruises along the scenic and winding Loboc River.",
            "The Loboc Children's Choir, who perform in different floating stations located at the river's end, has won numerous competitions both domestic and international.",
            "Tourists also visit to see the tarsier, a small, nocturnal, monkey-like mammal with large, red eyes.",
            "It is one of the world's smallest primates."
        ],
        [
            "Until the 2013 earthquake, portions of the Loboc Church complex (specifically parts of what became the convent or priests' residence) were amongst the oldest standing religious structures in the island of Bohol.",
            "The earthquake also damaged the lunch cruise's Docking Port, and caused damage to the pedestrian river bridge and its passenger elevator."
        ],
        [
            "In late 2014, Tropical storm Seniang passed directly over the Loboc river area.",
            "Although the winds were relatively weak, Seniang brought substantial rainfall.",
            "This caused the river to burst its banks in several places: the entire poblacion main plaza was flooded, including the town hall; many of the lunch cruise boats were damaged; and the accumulated debris of the church was disturbed and some washed away.",
            "It was fortunate that the new replacement bridge across the river had been completed just a few weeks before, allowing traffic to reach Tagbilaran via Sikatuna since the Loay interior road was damaged and impassable."
        ],
        [
            "The Loboc Church is currently in the tentative list for UNESCO World Heritage Sites under the Baroque Churches of the Philippines (Extension).",
            "A proposal has been suggested by scholars to make a separate UNESCO inclusion for the Old Centre of Loboc which includes the Loboc Church.",
            "The same would be made for other churches listed in UNESCO's tentative sites, where each town plaza and surrounding heritage buildings would be added.",
            "At present, government agencies are still yet to take action on the proposal."
        ],
        [
            "History"
        ],
        [
            "Since pre-Hispanic times, Loboc has always been an inland market village where produce from the sea was bartered for the agricultural goods of the upland regions.",
            "It is said to be the domain of Sigala, another chief of Bohol, whose contemporary, Sikatuna, made the famous Blood Compact with Miguel López de Legazpi in 1565."
        ],
        [
            "In 1596, the Jesuit priest Fr.",
            "Juan de Torres, SJ came to Loboc from Baclayon to found the second Christian settlement on the island.",
            "After the traumatic Moro raid on Baclayon on 26 October 1600, the Jesuit missionaries decided to move the center of their missionary activities to the inland village of Loboc.",
            "By 1602, Loboc became a parish, making it the oldest on the island.",
            "To the Jesuits, Loboc was the \"Residencia Boholana\", where their local superior resided.",
            "It remained so until the middle of the 18th century when the exigencies of the times forced to them to move once more to Baclayon."
        ],
        [
            "Around 1604, the Jesuits established a \"Seminario-Colegio\" or boarding school for native boys.",
            "This school laid the foundation of the musical culture of the town.",
            "Today the name Loboc is synonymous with musical acumen."
        ],
        [
            "In June 1942, troops of the Imperial Japanese Army occupied Loboc.",
            "In 1945, Loboc was gradually liberated by the Philippine Commonwealth Army troops of the 8th and 83rd Infantry Division, together with Boholano guerrillas, forming part of the conclusion of World War II."
        ],
        [
            "Places of interest"
        ],
        [
            "Loboc Church"
        ],
        [
            "The Loboc Church is one of the most beautiful in the entire province.",
            "The first stone church was built in 1602.",
            "It was destroyed by fire in 1638 and its replacement built beside the site of the older one.",
            "This is the church presently standing, a fine example of the Jesuit colonial architecture of the 18th century."
        ],
        [
            "After the expulsion of the Jesuits in 1768, the Augustinian Recollects took over and renovated the unfinished structure.",
            "They were responsible for the free-standing bell tower, the arcade façade, the mortuary chapel, the heavy stone buttresses and the unique three-storey convent built into the fabric of the Jesuit-built 17th century church."
        ],
        [
            "Two saintly figures lived and were buried at the Loboc church: Fr.",
            "Alonso Humanes, SJ whose grave became the object of pilgrimages after his death in 1633, and the native boy, Miguel Ayatumo, a student of the Seminario Colegio, who died in the honor of sanctity at the age of 16 in 1609.",
            "Contemporary Jesuit records speak proudly of a second \"Aloysius Gonzaga\" who is from Bohol."
        ],
        [
            "The Loboc Church contains a lot of interesting treasures.",
            "Among these are the decorative stone carvings and friezes on the exterior walls; a relief of St. Ignatius Loyola in polychrome stucco hidden behind the main altar, seven ancient retablos from both the Jesuit and Recollect periods; ceiling murals executed in the 1920s by Cebuano artists Ray Francia and Canuto Avila, one depicting the miracle of Our Lady of Guadalupe, the town's secondary patron, during the great flood of 1876; carved wooden cornices and decorative corbels shaped as gargoyles or mythical animals."
        ],
        [
            "Much of the early history of Bohol was made around the town and church of Loboc.",
            "It would not be an understatement to say that to know Loboc is to understand the entire drama of Bohol history.",
            "At present, Loboc church is deteriorating, ignored by tourists and visitors and continually threatened by the annual flood that has already robbed it of its ancient records and other priceless relics.",
            "The church was severely damaged by the 2013 Bohol earthquake, and the tropical storm Seniang at the end of 2014 washed away most of the remains waiting for repair."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Loboc is politically subdivided into 28 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 071229001   Agape"
        ],
        [
            " 3.3%"
        ],
        [
            " 579"
        ],
        [
            " 660"
        ],
        [
            "  ▾"
        ],
        [
            " −1.30%"
        ],
        [
            " 071229002   Alegria"
        ],
        [
            " 3.4%"
        ],
        [
            " 586"
        ],
        [
            " 571"
        ],
        [
            "  ▴"
        ],
        [
            " 0.26%"
        ],
        [
            " 071229003   Bagumbayan"
        ],
        [
            " 3.5%"
        ],
        [
            " 610"
        ],
        [
            " 684"
        ],
        [
            "  ▾"
        ],
        [
            " −1.14%"
        ],
        [
            " 071229004   Bahian"
        ],
        [
            " 2.9%"
        ],
        [
            " 503"
        ],
        [
            " 519"
        ],
        [
            "  ▾"
        ],
        [
            " −0.31%"
        ],
        [
            " 071229005   Bonbon Lower"
        ],
        [
            " 1.3%"
        ],
        [
            " 235"
        ],
        [
            " 218"
        ],
        [
            "  ▴"
        ],
        [
            " 0.75%"
        ],
        [
            " 071229006   Bonbon Upper"
        ],
        [
            " 3.6%"
        ],
        [
            " 631"
        ],
        [
            " 584"
        ],
        [
            "  ▴"
        ],
        [
            " 0.78%"
        ],
        [
            " 071229007   Buenavista"
        ],
        [
            " 1.9%"
        ],
        [
            " 334"
        ],
        [
            " 280"
        ],
        [
            "  ▴"
        ],
        [
            " 1.78%"
        ],
        [
            " 071229008   Bugho"
        ],
        [
            " 3.2%"
        ],
        [
            " 565"
        ],
        [
            " 572"
        ],
        [
            "  ▾"
        ],
        [
            " −0.12%"
        ],
        [
            " 071229009   Cabadiangan"
        ],
        [
            " 1.5%"
        ],
        [
            " 260"
        ],
        [
            " 276"
        ],
        [
            "  ▾"
        ],
        [
            " −0.60%"
        ],
        [
            " 071229010   Calunasan Norte"
        ],
        [
            " 3.9%"
        ],
        [
            " 674"
        ],
        [
            " 631"
        ],
        [
            "  ▴"
        ],
        [
            " 0.66%"
        ],
        [
            " 071229011   Calunasan Sur"
        ],
        [
            " 2.3%"
        ],
        [
            " 392"
        ],
        [
            " 406"
        ],
        [
            "  ▾"
        ],
        [
            " −0.35%"
        ],
        [
            " 071229012   Camayaan"
        ],
        [
            " 5.8%"
        ],
        [
            " 1,011"
        ],
        [
            " 1,039"
        ],
        [
            "  ▾"
        ],
        [
            " −0.27%"
        ],
        [
            " 071229013   Cambance"
        ],
        [
            " 1.8%"
        ],
        [
            " 307"
        ],
        [
            " 346"
        ],
        [
            "  ▾"
        ],
        [
            " −1.19%"
        ],
        [
            " 071229014   Candabong"
        ],
        [
            " 4.2%"
        ],
        [
            " 728"
        ],
        [
            " 736"
        ],
        [
            "  ▾"
        ],
        [
            " −0.11%"
        ],
        [
            " 071229015   Candasag"
        ],
        [
            " 1.2%"
        ],
        [
            " 211"
        ],
        [
            " 254"
        ],
        [
            "  ▾"
        ],
        [
            " −1.84%"
        ],
        [
            " 071229016   Canlasid"
        ],
        [
            " 1.7%"
        ],
        [
            " 295"
        ],
        [
            " 250"
        ],
        [
            "  ▴"
        ],
        [
            " 1.67%"
        ],
        [
            " 071229017   Gon‑ob"
        ],
        [
            " 1.6%"
        ],
        [
            " 271"
        ],
        [
            " 285"
        ],
        [
            "  ▾"
        ],
        [
            " −0.50%"
        ],
        [
            " 071229018   Gotozon"
        ],
        [
            " 5.0%"
        ],
        [
            " 870"
        ],
        [
            " 771"
        ],
        [
            "  ▴"
        ],
        [
            " 1.22%"
        ],
        [
            " 071229019   Jimilian"
        ],
        [
            " 6.7%"
        ],
        [
            " 1,170"
        ],
        [
            " 1,211"
        ],
        [
            "  ▾"
        ],
        [
            " −0.34%"
        ],
        [
            " 071229020   Oy"
        ],
        [
            " 7.5%"
        ],
        [
            " 1,302"
        ],
        [
            " 1,387"
        ],
        [
            "  ▾"
        ],
        [
            " −0.63%"
        ],
        [
            " 071229022   Poblacion Ondol"
        ],
        [
            " 4.6%"
        ],
        [
            " 796"
        ],
        [
            " 802"
        ],
        [
            "  ▾"
        ],
        [
            " −0.08%"
        ],
        [
            " 071229021   Poblacion Sawang"
        ],
        [
            " 3.4%"
        ],
        [
            " 598"
        ],
        [
            " 671"
        ],
        [
            "  ▾"
        ],
        [
            " −1.14%"
        ],
        [
            " 071229023   Quinoguitan"
        ],
        [
            " 2.9%"
        ],
        [
            " 502"
        ],
        [
            " 488"
        ],
        [
            "  ▴"
        ],
        [
            " 0.28%"
        ],
        [
            " 071229024   Taytay"
        ],
        [
            " 1.4%"
        ],
        [
            " 245"
        ],
        [
            " 259"
        ],
        [
            "  ▾"
        ],
        [
            " −0.55%"
        ],
        [
            " 071229025   Tigbao"
        ],
        [
            " 4.7%"
        ],
        [
            " 826"
        ],
        [
            " 867"
        ],
        [
            "  ▾"
        ],
        [
            " −0.48%"
        ],
        [
            " 071229026   Ugpong"
        ],
        [
            " 1.9%"
        ],
        [
            " 335"
        ],
        [
            " 332"
        ],
        [
            "  ▴"
        ],
        [
            " 0.09%"
        ],
        [
            " 071229027   Villadolid"
        ],
        [
            " 2.6%"
        ],
        [
            " 445"
        ],
        [
            " 478"
        ],
        [
            "  ▾"
        ],
        [
            " −0.71%"
        ],
        [
            " 071229028   Villaflor"
        ],
        [
            " 4.1%"
        ],
        [
            " 712"
        ],
        [
            " 735"
        ],
        [
            "  ▾"
        ],
        [
            " −0.32%"
        ],
        [
            "Total"
        ],
        [
            "17,418"
        ],
        [
            "16,312"
        ],
        [
            " ▴"
        ],
        [
            "0.66%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Loboc, Bohol"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "102(4.0)"
        ],
        [
            "85(3.3)"
        ],
        [
            "91(3.6)"
        ],
        [
            "75(3.0)"
        ],
        [
            "110(4.3)"
        ],
        [
            "141(5.6)"
        ],
        [
            "121(4.8)"
        ],
        [
            "107(4.2)"
        ],
        [
            "111(4.4)"
        ],
        [
            "144(5.7)"
        ],
        [
            "169(6.7)"
        ],
        [
            "139(5.5)"
        ],
        [
            "1,395(55.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.6"
        ],
        [
            "14.8"
        ],
        [
            "16.5"
        ],
        [
            "16.7"
        ],
        [
            "23.9"
        ],
        [
            "26.4"
        ],
        [
            "25.6"
        ],
        [
            "24.1"
        ],
        [
            "24.4"
        ],
        [
            "26.3"
        ],
        [
            "23.7"
        ],
        [
            "20.5"
        ],
        [
            "261.5"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LobocYearPop.±% p.a.1903 10,756—    1918 11,335+0.35%1939 11,015−0.14%1948 11,201+0.19%1960 10,367−0.64%1970 11,767+1.27%1975 11,799+0.05%1980 11,778−0.04%1990 13,716+1.54%1995 13,335−0.53%2000 15,734+3.61%2007 16,299+0.49%2010 16,312+0.03%2015 15,993−0.38%2020 17,418+1.69%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Loboc"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  26.00"
        ],
        [
            "2009  32.77"
        ],
        [
            "2012  21.52"
        ],
        [
            "2015  16.96"
        ],
        [
            "2018  12.80"
        ],
        [
            "2021  18.31"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Gallery"
        ],
        [
            "Poblacion and municipal hall"
        ],
        [
            "A view of Loboc River"
        ],
        [
            "Loboc Church"
        ],
        [
            "Remains of Loboc church post-2013 earthquake"
        ],
        [
            "Loboc River Cruise"
        ],
        [
            "Busay Falls on Loboc river"
        ],
        [
            "Notes"
        ],
        [
            "^ Here was one of the biggest blunders in planning in Bohol: a partly completed bridge, which if it were completed would have required the church to be destroyed."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Loboc |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Campo, Liv; Berondo, Wenna A.",
            "(9 September 2005).",
            "\"Santiago inspects unfinished bridge in Loboc, Bohol\".",
            "The Philippine Star.",
            "Archived from the original on 1 July 2015.",
            "Retrieved 12 July 2016."
        ],
        [
            "^ \"'Unprecedented' floods in Bohol as Seniang kills 11\".",
            "rappler.com.",
            "30 December 2014.",
            "Retrieved 6 February 2015."
        ],
        [
            "^ \"\"Seniang\" places Bohol under state of calamity\".",
            "Bohol News Today.",
            "31 December 2014.",
            "Retrieved 6 February 2015."
        ],
        [
            "^ \"Loboc Town\".",
            "www.bohol-philippines.com.",
            "Retrieved 2019-04-04."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Loboc: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bohol\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Loboc, Bohol."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Municipality of Loboc"
        ],
        [
            "Loboc"
        ],
        [
            "Places adjacent to Loboc"
        ],
        [
            "Sevilla"
        ],
        [
            "Bilar"
        ],
        [
            "Sikatuna"
        ],
        [
            "Loboc"
        ],
        [
            "Alburquerque"
        ],
        [
            "Loay"
        ],
        [
            "Lila"
        ],
        [
            "vte Province of BoholTagbilaran (capital and largest city)Municipalities"
        ],
        [
            "Alburquerque"
        ],
        [
            "Alicia"
        ],
        [
            "Anda"
        ],
        [
            "Antequera"
        ],
        [
            "Baclayon"
        ],
        [
            "Balilihan"
        ],
        [
            "Batuan"
        ],
        [
            "Bien Unido"
        ],
        [
            "Bilar"
        ],
        [
            "Buenavista"
        ],
        [
            "Calape"
        ],
        [
            "Candijay"
        ],
        [
            "Carmen"
        ],
        [
            "Catigbian"
        ],
        [
            "Clarin"
        ],
        [
            "Corella"
        ],
        [
            "Cortes"
        ],
        [
            "Dagohoy"
        ],
        [
            "Danao"
        ],
        [
            "Dauis"
        ],
        [
            "Dimiao"
        ],
        [
            "Duero"
        ],
        [
            "Garcia Hernandez"
        ],
        [
            "Getafe"
        ],
        [
            "Guindulman"
        ],
        [
            "Inabanga"
        ],
        [
            "Jagna"
        ],
        [
            "Lila"
        ],
        [
            "Loay"
        ],
        [
            "Loboc"
        ],
        [
            "Loon"
        ],
        [
            "Mabini"
        ],
        [
            "Maribojoc"
        ],
        [
            "Panglao"
        ],
        [
            "Pilar"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Sagbayan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Sevilla"
        ],
        [
            "Sierra Bullones"
        ],
        [
            "Sikatuna"
        ],
        [
            "Talibon"
        ],
        [
            "Trinidad"
        ],
        [
            "Tubigon"
        ],
        [
            "Ubay"
        ],
        [
            "Valencia"
        ],
        [
            "Component city"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Islands"
        ],
        [
            "Balicasag"
        ],
        [
            "Banacon"
        ],
        [
            "Bansaan"
        ],
        [
            "Bilangbilangan"
        ],
        [
            "Bohol"
        ],
        [
            "Cabilao"
        ],
        [
            "Cabulan"
        ],
        [
            "Hingotanan"
        ],
        [
            "Jandayan"
        ],
        [
            "Jao"
        ],
        [
            "Juagdan"
        ],
        [
            "Lapinig"
        ],
        [
            "Mahanay"
        ],
        [
            "Malingin"
        ],
        [
            "Mantatao"
        ],
        [
            "Maomawan"
        ],
        [
            "Pamilacan"
        ],
        [
            "Pangangan"
        ],
        [
            "Panglao"
        ],
        [
            "Sagasa"
        ],
        [
            "Sandingan"
        ],
        [
            "Tintinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Loboc&oldid=1189003372\""
        ],
        [
            "Categories: Municipalities of Bohol1596 establishments in the Spanish EmpireHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}