{
    "name": "Lobo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Lobo, Batangas"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSuomiTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°39′N 121°15′E﻿ / ﻿13.65°N 121.25°E﻿ / 13.65; 121.25"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Batangas, Philippines"
        ],
        [
            "This article is about the Philippine municipality.",
            "For other uses, see Lobo."
        ],
        [
            "Municipality in Calabarzon, PhilippinesLoboMunicipalityMunicipality of LoboFrom top to bottom: Downtown, Malabrigo Point Lighthouse, Lobo River, Saint Michael the Archangel Parish, Municipal Hall"
        ],
        [
            "FlagSealEtymology: WolfNickname: Atis Capital of the PhilippinesAnthem: \"Himno ng Lobo\"Map of Batangas with Lobo highlightedOpenStreetMapLoboLocation within the PhilippinesCoordinates: 13°39′N 121°15′E﻿ / ﻿13.65°N 121.25°E﻿ / 13.65; 121.25CountryPhilippinesRegionCalabarzonProvinceBatangasDistrict"
        ],
        [
            "2nd districtFoundedSeptember 27, 1871Barangays26"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorLota L. Manalo • Vice MayorGaudioso R. Manalo • RepresentativeGerville Luistro • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Geronimo C. AlfilerAngelito H. AbieraMichael C. CuetoJan-Michael M. AnyayahanVictoriano C. DueñasMark Ernani R. TiuAmador Ambrocio Z. SulitLeslee M. Aguilar"
        ],
        [
            " • Electorate27,511 voters (2022)Area • Revenue₱ 170.5 million (2020) • Assets₱ 586.4 million (2020) • Expenditure₱ 133 million (2020) • Liabilities₱ 259.9 million (2020)Service provider • ElectricityBatangas 2 Electric Cooperative (BATELEC 2)Time zoneUTC+8 (PST)ZIP code4229PSGC041015000IDD : area code +63 (0)43Native languagesTagalogMajor religion/sRoman CatholicFeast dateSeptember 23-30Catholic dioceseArchdiocese of LipaPatron saintSaint MichaelWebsitewww.ilovelobo.ph"
        ],
        [
            "Lobo, officially the Municipality of Lobo (Tagalog: Bayan ng Lobo), is a 3rd class municipality in the province of Batangas, Philippines.",
            "According to the 2020 census, it has a population of 40,736 people."
        ],
        [
            "Etymology"
        ],
        [
            "The name \"Lobo\" may have come from: the Spanish and Tagalog term for \"wolf\", lobothe Tagalog word \"lubog\", that later became the word \"Lobu\" or \"Lobo\"the Lobo River, which flows through Lobo itself andthe balloon that landed into Mt.",
            "Banoi."
        ],
        [
            "The town was proclaimed as the \"Atis Capital of the Philippines\" through Resolution 2011-61 in September 2011."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "The coming of the ten datus in the Philippines in the 13th century had contributed a vital part in this history of this municipality.",
            "History stated that after Datu Puti and his followers purchased the island of Panay and fully establishing a colony in the island, Datu Puti with Datu Balkasusa and Datu Domangsil left Panay and sailed north in search from greener pastures."
        ],
        [
            "The group reached Batangas and caused the founding of the first Malayan colony in Luzon.",
            "They first settled the eastern and western sides of Pansipit River which are now Lemery and Taal and later on they scattered in the province settling Kumintang which is named in honor of Lakan Kumintang."
        ],
        [
            "The most adventurous follower of Lakan Kumintang was Gat Bahaghari and with his family and a handful of followers, they traveled south to Rosario and trailing along Rosario-Lobo River, they reached the “Wawa of Lobo” (now Fabrica) which his followers named it Bahaghari in honor of him.",
            "Attracted by the panoramic view and soil fertility of this place, Gat Bahaghari and his followers decided to establish a permanent settlement in this area."
        ],
        [
            "Some followers of Gat Bahaghari thinked if they want to easily detect the coming of the pirates that may harass their peaceful living, they built their houses on the top of a hill overlooking the sea which is now the Municipal Cemetery of Lobo."
        ],
        [
            "Beneath this hill on the west side is low land treasured with “sumasagitsit” or running tiny streams of water which they utilized to irrigate their farms.",
            "With the help of the streams, their farms became very productive that enabled them to transport their excess products to their bountiful harvests, they replied that they came from sumasagitsit.",
            "The term sumasagitsit was later on changed to Masagitsit until it was changed as Barangay Masaguitsit."
        ],
        [
            "Foreign rule"
        ],
        [
            "Lobo's history shared its roots from the history of Rosario.",
            "The town of Rosario was founded by Augustinian friars in 1687 that originated from the southeastern coast of Batangas which is Lobo.",
            "When the municipality (Rosario) was founded, Lobo became a barrio of Rosario with the present municipalities of Taysan, San Juan, and Padre Garcia."
        ],
        [
            "The inhabitants were forced to flee the coast of Lobo to avoid the Moros.",
            "While fleeing, the inhabitants was reciting the rosary that gave Rosario its name.",
            "When most of the people found themselves at the north-west bank of Kansahayan River in Hilerang Kawayan, now a barangay called Pinagbayanan of Taysan, the settlement was relocated and started to rebuild their lives.",
            "However, at the height of the Moro Wars in the second half of the 18th century, the vicious Moro raids reached Hilerang Kawayan."
        ],
        [
            "Most Holy Rosary Parish Church, first stone church of Rosario in Lumang Bayan"
        ],
        [
            "Rosario was moved again by the Dominican priests fearing that the Moros will attack them.",
            "They headed north holding a novena and praying the rosary while fleeing from Hilerang Kawayan.",
            "When the last day of the novena struck, the inhabitants reached the river bank of Tubig ng Bayan (lit.",
            "'Water of Town' , a river from Lipa now known as Balintawak River/Creek), now the present-day Padre Garcia.",
            "Here they finally settled and the town's people erected a stone church south of the river bank in honor of their saint, the Our Lady of the Most Holy Rosary (known as Nuestra Señora del Rosario in the municipality).",
            "The town was named Santo Rosario.",
            "Rosario remained in the location for a long time until 1902."
        ],
        [
            "In December 12, 1848, the barrio of Bolbok was separated from Rosario and was named San Juan de Bocboc, then in 1850, the barrio of Mercedes also became an independent municipality now known as Taysan.",
            "It was not until September 27, 1871 that the barrio of Lobo became an independent municipality.",
            "The Spaniards didn't know what to name the place until they saw that a balloon that came from the people celebrating their fiesta in the Municipality of Batangas fly towards Mt.",
            "Banoi.",
            "They eagerly waited for the balloon to fall down.",
            "They were so amazed that they named the place \"Lobo\" to commemorate the incident.",
            "The parish of Lobo wasn't erected until 2 years later in February 4, 1873.",
            "The parish was then named \"Parroquia de San Miguel Arcanghel\" meaning \"Saint Michael the Archangel Parish\" being the patron saint of Lobo, Batangas.",
            "Don Cayetano Macarandang was the first parish priest of the church serving from 1871 until 1873."
        ],
        [
            "Malabrigo Lighthouse in 1903 being finished"
        ],
        [
            "According to Manuel Sastron's publication of Batangas y su Provincia, he described Lobo as \"the most remarkably isolated municipality in Batangas\".",
            "Lobo's road was so narrow that horses couldn't barely pass through it.",
            "Travelling by sea is also not ideal because the waters of the town have great waves that would be dangerous for small boats.",
            "He also said that the municipalities population in the 19th century was only 6,700 people.",
            "He referenced the Lobo River as being large and being fed by four or five tributaries.",
            "Sastron said that Lobo was peaceful and crimes rarely occur."
        ],
        [
            "1918 Map of Batangas with Lobo"
        ],
        [
            "When the American invasion period started, Lobo was consolidated to the municipality of Taysan through the Act No.",
            "708 (An Act Reducing Thirteen of the Municipalities in the Province of Batangas into Five) but became independent again when Taysan was consolidated to the municipality of Rosario in the same year through the Act No.",
            "958 (An Act Reducing The Twenty-two Municipalities of the Province of Batangas to Sixteen, and Repealing Act Numbered Seven Hundred and Eight, entitled \"An Act Reducing Thirteen of the Municipalities in the Province of Batangas into Five.\").",
            "Lobo was commonly misspelled as \"Loboo\" by the Americans."
        ],
        [
            "Geography"
        ],
        [
            "Lobo is located at 13°39′N 121°15′E﻿ / ﻿13.65°N 121.25°E﻿ / 13.65; 121.25.",
            "The town is located near the southern tip of the Batangas province, about 145 kilometres (90 mi) from Manila."
        ],
        [
            "Lobo has white sand beaches and has protected mangrove forests and fish sanctuaries."
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 175.03 square kilometres (67.58 sq mi)  constituting 5.61% of the 3,119.75-square-kilometre- (1,204.54 sq mi) total area of Batangas."
        ],
        [
            "Barangays"
        ],
        [
            "Lobo is politically subdivided into 26 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "According to the 2020 census, the most populated barangay in Lobo is Balibago with 3,454 residents living"
        ],
        [
            "while the least populated barangay in Lobo is Malalim na Sanog with 306 residents living.",
            "Lobo originally had 7 barangays named as Masagitsit (now Masaguitsit), Bignay, Tayuman, Malapad na Parang, Mabilog na Bundok, Malabrigo, and Sabana (non-existent now)."
        ],
        [
            "In 1959, the sitio of Biga in Barangay Tayuman was converted into a barangay."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 041015001   Apar"
        ],
        [
            " 2.9%"
        ],
        [
            " 1,176"
        ],
        [
            " 959"
        ],
        [
            "  ▴"
        ],
        [
            " 2.06%"
        ],
        [
            " 041015002   Balatbat"
        ],
        [
            " 5.9%"
        ],
        [
            " 2,400"
        ],
        [
            " 2,137"
        ],
        [
            "  ▴"
        ],
        [
            " 1.17%"
        ],
        [
            " 041015003   Balibago"
        ],
        [
            " 8.5%"
        ],
        [
            " 3,454"
        ],
        [
            " 2,967"
        ],
        [
            "  ▴"
        ],
        [
            " 1.53%"
        ],
        [
            " 041015004   Banalo"
        ],
        [
            " 6.2%"
        ],
        [
            " 2,515"
        ],
        [
            " 2,195"
        ],
        [
            "  ▴"
        ],
        [
            " 1.37%"
        ],
        [
            " 041015005   Biga"
        ],
        [
            " 5.0%"
        ],
        [
            " 2,030"
        ],
        [
            " 1,782"
        ],
        [
            "  ▴"
        ],
        [
            " 1.31%"
        ],
        [
            " 041015006   Bignay"
        ],
        [
            " 1.2%"
        ],
        [
            " 501"
        ],
        [
            " 432"
        ],
        [
            "  ▴"
        ],
        [
            " 1.49%"
        ],
        [
            " 041015007   Calo"
        ],
        [
            " 2.3%"
        ],
        [
            " 918"
        ],
        [
            " 913"
        ],
        [
            "  ▴"
        ],
        [
            " 0.05%"
        ],
        [
            " 041015008   Calumpit"
        ],
        [
            " 2.0%"
        ],
        [
            " 819"
        ],
        [
            " 734"
        ],
        [
            "  ▴"
        ],
        [
            " 1.10%"
        ],
        [
            " 041015009   Fabrica"
        ],
        [
            " 5.0%"
        ],
        [
            " 2,056"
        ],
        [
            " 1,742"
        ],
        [
            "  ▴"
        ],
        [
            " 1.67%"
        ],
        [
            " 041015010   Jaybanga"
        ],
        [
            " 4.6%"
        ],
        [
            " 1,873"
        ],
        [
            " 1,652"
        ],
        [
            "  ▴"
        ],
        [
            " 1.26%"
        ],
        [
            " 041015011   Lagadlarin"
        ],
        [
            " 5.1%"
        ],
        [
            " 2,086"
        ],
        [
            " 1,853"
        ],
        [
            "  ▴"
        ],
        [
            " 1.19%"
        ],
        [
            " 041015012   Mabilog na Bundok"
        ],
        [
            " 4.3%"
        ],
        [
            " 1,740"
        ],
        [
            " 1,675"
        ],
        [
            "  ▴"
        ],
        [
            " 0.38%"
        ],
        [
            " 041015013   Malabrigo"
        ],
        [
            " 4.3%"
        ],
        [
            " 1,744"
        ],
        [
            " 1,546"
        ],
        [
            "  ▴"
        ],
        [
            " 1.21%"
        ],
        [
            " 041015014   Malalim na Sanog"
        ],
        [
            " 0.8%"
        ],
        [
            " 306"
        ],
        [
            " 205"
        ],
        [
            "  ▴"
        ],
        [
            " 4.09%"
        ],
        [
            " 041015015   Malapad na Parang"
        ],
        [
            " 3.6%"
        ],
        [
            " 1,461"
        ],
        [
            " 1,455"
        ],
        [
            "  ▴"
        ],
        [
            " 0.04%"
        ],
        [
            " 041015016   Masaguitsit"
        ],
        [
            " 3.4%"
        ],
        [
            " 1,377"
        ],
        [
            " 1,234"
        ],
        [
            "  ▴"
        ],
        [
            " 1.10%"
        ],
        [
            " 041015017   Nagtalongtong"
        ],
        [
            " 5.1%"
        ],
        [
            " 2,066"
        ],
        [
            " 1,994"
        ],
        [
            "  ▴"
        ],
        [
            " 0.36%"
        ],
        [
            " 041015018   Nagtoctoc"
        ],
        [
            " 1.5%"
        ],
        [
            " 617"
        ],
        [
            " 591"
        ],
        [
            "  ▴"
        ],
        [
            " 0.43%"
        ],
        [
            " 041015019   Olo‑olo"
        ],
        [
            " 3.5%"
        ],
        [
            " 1,406"
        ],
        [
            " 1,377"
        ],
        [
            "  ▴"
        ],
        [
            " 0.21%"
        ],
        [
            " 041015020   Pinaghawanan"
        ],
        [
            " 1.2%"
        ],
        [
            " 488"
        ],
        [
            " 419"
        ],
        [
            "  ▴"
        ],
        [
            " 1.54%"
        ],
        [
            " 041015021  San Miguel"
        ],
        [
            " 2.0%"
        ],
        [
            " 802"
        ],
        [
            " 732"
        ],
        [
            "  ▴"
        ],
        [
            " 0.92%"
        ],
        [
            " 041015022   San Nicolas"
        ],
        [
            " 2.3%"
        ],
        [
            " 939"
        ],
        [
            " 763"
        ],
        [
            "  ▴"
        ],
        [
            " 2.10%"
        ],
        [
            " 041015023   Sawang"
        ],
        [
            " 5.2%"
        ],
        [
            " 2,138"
        ],
        [
            " 1,831"
        ],
        [
            "  ▴"
        ],
        [
            " 1.56%"
        ],
        [
            " 041015024   Soloc"
        ],
        [
            " 5.5%"
        ],
        [
            " 2,223"
        ],
        [
            " 1,801"
        ],
        [
            "  ▴"
        ],
        [
            " 2.13%"
        ],
        [
            " 041015025   Tayuman"
        ],
        [
            " 4.1%"
        ],
        [
            " 1,652"
        ],
        [
            " 1,409"
        ],
        [
            "  ▴"
        ],
        [
            " 1.60%"
        ],
        [
            " 041015026  Poblacion"
        ],
        [
            " 6.7%"
        ],
        [
            " 2,717"
        ],
        [
            " 2,672"
        ],
        [
            "  ▴"
        ],
        [
            " 0.17%"
        ],
        [
            "Total"
        ],
        [
            "40,736"
        ],
        [
            "37,070"
        ],
        [
            " ▴"
        ],
        [
            "0.95%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lobo, Batangas"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "52(2.0)"
        ],
        [
            "35(1.4)"
        ],
        [
            "27(1.1)"
        ],
        [
            "27(1.1)"
        ],
        [
            "82(3.2)"
        ],
        [
            "124(4.9)"
        ],
        [
            "163(6.4)"
        ],
        [
            "144(5.7)"
        ],
        [
            "145(5.7)"
        ],
        [
            "141(5.6)"
        ],
        [
            "100(3.9)"
        ],
        [
            "102(4.0)"
        ],
        [
            "1,142(45)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.0"
        ],
        [
            "8.1"
        ],
        [
            "8.8"
        ],
        [
            "9.7"
        ],
        [
            "17.9"
        ],
        [
            "22.6"
        ],
        [
            "26.2"
        ],
        [
            "24.5"
        ],
        [
            "24.6"
        ],
        [
            "22.0"
        ],
        [
            "16.7"
        ],
        [
            "14.9"
        ],
        [
            "208"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LoboYearPop.±% p.a.1903 5,781—    1918 6,999+1.28%1939 8,964+1.19%1948 11,711+3.01%1960 15,197+2.19%1970 19,376+2.46%1975 22,092+2.67%1980 24,333+1.95%1990 26,881+1.00%1995 31,849+3.23%2000 33,909+1.35%2007 37,798+1.51%2010 37,070−0.71%2015 41,504+2.18%2020 40,736−0.37%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Lobo had a population of 40,736.",
            "The population density was 230 inhabitants per square kilometre (600/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Lobo"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  5.10"
        ],
        [
            "2009  19.07"
        ],
        [
            "2012  25.86"
        ],
        [
            "2015  21.46"
        ],
        [
            "2018  20.52"
        ],
        [
            "2021  8.13"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Municipal hall before 2021"
        ],
        [
            "Elected officials"
        ],
        [
            "Lota L. Manalo and Jurly R. Manalo are the current mayor and vice mayor, respectively."
        ],
        [
            "The Municipal Councilors are:"
        ],
        [
            "Geronimo Alfiler"
        ],
        [
            "Angelito Abiera"
        ],
        [
            "Michael Cueto"
        ],
        [
            "Jan-Michael Anyayahan"
        ],
        [
            "Victoriano Dueñas"
        ],
        [
            "Mark Ernani Tiu"
        ],
        [
            "Amador Ambrocio Sulit"
        ],
        [
            "Leslee Aguilar"
        ],
        [
            "Fish sanctuaries"
        ],
        [
            "Lobo seashore"
        ],
        [
            "Lobo has several fish sanctuaries:"
        ],
        [
            "Lobo Mangrove Conservation Area"
        ],
        [
            "Sawang and Olo-Olo Fish Sanctuary and Refuge Area"
        ],
        [
            "Malabrigo Fish Sanctuary and Refuge Area"
        ],
        [
            "Biga Fish Sanctuary and Refuge Area"
        ],
        [
            "Gallery"
        ],
        [
            "Malabrigo Point Lighthouse"
        ],
        [
            "Park"
        ],
        [
            "Downtown Lobo"
        ],
        [
            "Saint Michael the Archangel Parish Church"
        ],
        [
            "References"
        ],
        [
            "^ a b \"Government boosts atis production in Lobo\".",
            "The Philippine Star.",
            "29 November 2015.",
            "Retrieved 30 November 2016."
        ],
        [
            "^ a b  Municipality of Lobo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"The History of Lobo, Batangas\".",
            "wowbatangas.com.",
            "Retrieved 2024-03-23."
        ],
        [
            "^ \"Taysan, Batangas - Pinagbayanan\".",
            "www.taysan.gov.ph.",
            "Retrieved 2023-12-30."
        ],
        [
            "^ \"Rosario, Batangas History\".",
            "www.rosariobatangas.ph.",
            "Retrieved 2024-03-23."
        ],
        [
            "^ \"Most Holy Rosary Parish\".",
            "osjphil.org.",
            "Retrieved 2023-12-30."
        ],
        [
            "^ \"The Etymology of Lobo, Batangas\".",
            "wowbatangas.com.",
            "Retrieved 2024-03-23."
        ],
        [
            "^ \"Manuel Sastron's publication of Batangas y su Provincia\".",
            "batangashistory.date.",
            "Retrieved 2024-03-23."
        ],
        [
            "^ Lico, Gerard; Tomacruz, Mary Delia (2014–2015).",
            "\"Infrastructures of Colonial Modernity Public Works in Manila from the Late 19th to the Early 20th Centuries\" (PDF).",
            "Espasyó: Journal of Philippine Architecture and Allied Arts.",
            "6.",
            "National Commission for Culture and the Arts.",
            "ISSN 2094-3725.",
            "Archived from the original (PDF) on January 28, 2018.",
            "Retrieved November 8, 2018."
        ],
        [
            "^ Act No.",
            "708 (March 28, 1903), An Act Reducing Thirteen of the Municipalities in the Province of Batangas to Five, retrieved July 15, 2023"
        ],
        [
            "^ Act No.",
            "708 (March 28, 1903), An Act Reducing The Twenty-two Municipalities of the Province of Batangas to Sixteen, and Repealing Act Numbered Seven Hundred and Eight, entitled \"An Act Reducing Thirteen of the Municipalities in the Province of Batangas into Five.",
            "\", retrieved July 15, 2023"
        ],
        [
            "^ \"Mining the white gold\".",
            "BusinessMirror.",
            "2 December 2018.",
            "Retrieved 2 April 2023."
        ],
        [
            "^"
        ],
        [
            "\"Province: Batangas\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Municipal: Lobo, Batangas\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Lobo: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 5 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Batangas\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Casayuran, Mario; Terrazola, Vanne Elaine (22 April 2018).",
            "\"Locals realize what the real 'gold' is in Lobo, Batangas\".",
            "Manila Bulletin.",
            "Retrieved 2 April 2023."
        ],
        [
            "^ Gonzales, Yuji Vincent (9 June 2015).",
            "\"Environmental group opposes large-scale Batangas mining project\".",
            "INQUIRER.net.",
            "Retrieved 2 April 2023."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Lobo, Batangas."
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Lobo, Batangas"
        ],
        [
            "Taysan / Rosario"
        ],
        [
            "Batangas City"
        ],
        [
            "Lobo"
        ],
        [
            "San Juan"
        ],
        [
            "Isla Verde Passage"
        ],
        [
            "vte Province of BatangasBatangas City (capital)  Lipa City (largest city)Component cities"
        ],
        [
            "Batangas City"
        ],
        [
            "Calaca"
        ],
        [
            "Lipa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tanauan"
        ],
        [
            "Municipalities"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alitagtag"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Bauan"
        ],
        [
            "Calatagan"
        ],
        [
            "Cuenca"
        ],
        [
            "Ibaan"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Lobo"
        ],
        [
            "Mabini"
        ],
        [
            "Malvar"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Nasugbu"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Rosario"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Taal"
        ],
        [
            "Talisay"
        ],
        [
            "Taysan"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "Authority control databases International"
        ],
        [
            "ISNI"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "France"
        ],
        [
            "BnF data"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Lobo,_Batangas&oldid=1224635552\""
        ],
        [
            "Category: Municipalities of BatangasHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataPages using multiple image with auto scaled imagesCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataArticles with ISNI identifiersArticles with VIAF identifiersArticles with BNF identifiersArticles with BNFdata identifiersPages using the Kartographer extension"
        ]
    ]
}