{
    "name": "Los Baños",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Los Baños, Laguna"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogУкраїнськаTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°10′N 121°13′E﻿ / ﻿14.17°N 121.22°E﻿ / 14.17; 121.22"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "This is the latest accepted revision, reviewed on 21 June 2024."
        ],
        [
            "Municipality in Laguna, Philippines"
        ],
        [
            "Municipality in Calabarzon, PhilippinesLos BañosMunicipalityMunicipality of Los Baños"
        ],
        [
            "From top, left to right: Mount Makiling, Immaculate Conception Parish Church, Tadlac lake, Los Baños Museum, and UPLB main gate"
        ],
        [
            "FlagSealEtymology: lit: The Bath or The Bathing PlaceNickname(s): Special Science and Nature CityMap of Laguna with Los Baños highlightedOpenStreetMapLos BañosLocation within the PhilippinesCoordinates: 14°10′N 121°13′E﻿ / ﻿14.17°N 121.22°E﻿ / 14.17; 121.22CountryPhilippinesRegionCalabarzonProvinceLagunaDistrict"
        ],
        [
            "2nd districtFoundedSeptember 17, 1615Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAnthony F. Genuino (Bigkis) • Vice MayorJosephine S. Evangelista(Bigkis) • RepresentativeRuth B. Mariano-Hernandez(PDP–Laban) • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Leren Mae M. BautistaMarlo PJ A. AliponJonathan Bryan S. SiytiapMiko C. PelegrinoMark Lester B. DizonJulius A. MoliñaweBenedicto S. AlboridaMike Dexter A. Concio"
        ],
        [
            " • Electorate71,941 voters (2022)Area • Revenue₱ 372 million (2020) • Assets₱ 1,007 million (2020) • Expenditure₱ 278.1 million (2020) • Liabilities₱ 222.9 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code4030, 4031PSGC043411000IDD : area code +63 (0)49Native languagesTagalogWebsitelosbanos.gov.ph"
        ],
        [
            "Los Baños (IPA:"
        ],
        [
            "It has a total land area of 56.5 square kilometers (21.8 sq mi) and is bordered on the south and south-west by Mount Makiling and Santo Tomas in Batangas, on the north by Laguna de Bay, on the north-west by Calamba and on the east by the town of Bay.",
            "The town is located 63 kilometers (39 mi) southeast of Manila and is easily accessible via the South Luzon Expressway along with Manila South Road and Calamba–Pagsanjan Road."
        ],
        [
            "The municipality lies on the northern slopes of the long dormant volcano Mount Makiling and is known among tourists for its hot spring resorts.",
            "Los Baños also hosts two constituent universities of the University of the Philippines System: the University of the Philippines Los Baños and University of the Philippines Open University, along with other foreign and local and international research centers, such as the International Rice Research Institute, the ASEAN Center for Biodiversity, the Philippine Rice Research Institute, Philippine Carabao Center, and the Southeast Asian Ministers of Education Organization-Southeast Asian Regional Center for Graduate Study and Research in Agriculture(SEAMEO-SEARCA) at UPLB making the town a temporary home for tens of thousands of both local and foreign undergraduate and graduate students, researchers and support staff."
        ],
        [
            "Los Baños was declared as the Special Science and Nature City of the Philippines through Presidential Proclamation No.",
            "349.",
            "The proclamation, however, does not convert the municipality to a city or give it corporate powers that are accorded to other cities."
        ],
        [
            "Aside from its importance in academics, science and research, Los Baños is a well-known tourist destination.",
            "Because of the town's proximity to Metro Manila, Los Baños's hot spring resorts are frequent weekend or summer getaways for residents of the vast metropolis and tourists from other places in the Philippines and abroad.",
            "Tourists who visit Los Baños also come to the several native delicacies stores in the town to buy the town's famous buko pie (coconut meat pie) as well as a home-grown brand of chocolate cake."
        ],
        [
            "Etymology"
        ],
        [
            "Los Baños is derived from Spanish for \"the baths\", also referring to the hot springs.",
            "It was named as such in 1589 when Fr.",
            "Pedro Bautista built public baths in the present-day town."
        ],
        [
            "History"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Los Baños started as a settlement, a barrio of Bay called Mainit, the Tagalog term for \"hot\", alluding to the thermal springs at the foot of Mount Makiling.",
            "By 1589, through a Franciscan friar, it became popularly called by its present name, Los Baños."
        ],
        [
            "In 1595, a temporary building made of bamboo and cogon was built to serve as shelter for the patients who journeyed to Mainit to seek cures for their ailments.",
            "It was on September 17, 1615, when the friars administered Los Baños as a separate town from Bay."
        ],
        [
            "In 1671, more permanent structures like churches and hospitals were built only to be destroyed by a fire in 1727.",
            "The structures were re-erected at a slow rate.",
            "The church which now stands in the municipal center of Los Baños dates back to 1851.",
            "The Spanish Governor's palace was built in 1879 but was only completed in 1892."
        ],
        [
            "American invasion era"
        ],
        [
            "Further information: Raid on Los Baños"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(January 2022)"
        ],
        [
            "Aerial view of Los Baños, circa 1930s"
        ],
        [
            "In 1909, the University of the Philippines College of Agriculture (UPCA) was established."
        ],
        [
            "The UPCA became a Japanese prisoner of war camp for nationals of the Allied countries, a target of Kempetai punitive measures, and the headquarters of a secret organization of guerrillas.",
            "On February 23, 1945, US forces of the First Battalion, 511th Parachute Infantry Regiment of the Eleventh Airborne Division led a combined amphibious and airborne raid against the prison camp, rescuing over 2,000 Allied nationals.",
            "They killed the 250-man Japanese garrison.",
            "In order to force the prisoners to leave behind their belongings and speed up the evacuation before the Japanese could send reinforcements, US forces and Filipino guerrillas burned the camp.",
            "Only Baker Hall, the university gymnasium until 2010, remained intact."
        ],
        [
            "Philippine independence"
        ],
        [
            "In 1959, the 10th World Scout Jamboree was held in Los Baños, with the theme \"Building Tomorrow Today\" with an attendance of 12,203 Scouts."
        ],
        [
            "The International Rice Research Institute (IRRI) was established in 1960 during the administration of President Carlos P. Garcia,"
        ],
        [
            "Martial law era (1965-1986)"
        ],
        [
            "The social unrest which arose when Ferdinand Marcos' debt-driven campaign spending led to the 1969 Philippine balance of payments crisis"
        ],
        [
            "When martial law was declared in September 1972, Marcos cracked down on any form of criticism or activism, leading to the arrest of many of Los Baños residents.",
            "Among those who experienced arrest and torture during martial law were the UPLB Institute of Chemistry's Dr. Aloysious Baes, while among those who became desaparecidos were Tish Ladlad, Cristina Catalla, Gerardo \"Gerry\" Faustino, Rizalina Ilagan, and UPLB Professor Jessica Sales.",
            "Among those confirmed to have been martyred for their beliefs was Manuel Bautista, the student leader who had spearheaded the establishment of UPLB's Textbook Exchange and Rental Center (TERC)."
        ],
        [
            "In 1979, the evolution and development of academic excellence in Los Baños moved the people of Los Baños to request president Marcos to declare the municipality as \"A Special University Zone\", granted on June 15, 1982, by virtue of letter of instruction No.",
            "883."
        ],
        [
            "Los Baños was further declared as an \"Agriculture, Forestry, and Life Sciences Community\" on March 17, 1982, by virtue of Executive Order No.",
            "784 (Section 23)."
        ],
        [
            "Post-EDSA revolution era"
        ],
        [
            "Special Science and Nature City Marker"
        ],
        [
            "On August 7, 2000, Los Baños was declared a Special Science and Nature City of the Philippines by virtue of Presidential Proclamation No.",
            "349.",
            "It was signed by then-President Joseph Estrada."
        ],
        [
            "21st century"
        ],
        [
            "The 6th Flora Malesiana, a triennial gathering of people with botanical expertise regarding \"Malesia\", was held from September 20 to 24, 2004.",
            "It provided a forum for Flora Malesiana members and encouraged publications on Malesian plants."
        ],
        [
            "During the 2005 Southeast Asian Games, Los Baños played host to the aquatics events, with the newly built Trace Aquatic Center at Trace College serving as the venue."
        ],
        [
            "The headquarters of the Association of Southeast Asian Nations (ASEAN) Center for Biodiversity was opened on August 8, 2006, having leased office spaces until late 2010s from the DENR-Ecosystems Research and Development Bureau, located at the College of Forestry, University of the Philippines Los Baños.",
            "It coincided with the foundation day celebrations of the organization.",
            "The Philippines assumed the Chairmanship of ASEAN in 2006 and played host to the 12th ASEAN and East Asia Summits (held in Metro Cebu, January 2007)."
        ],
        [
            "In January 2007, the 5th ASEAN Inter-Club Age-Group Swimming Championships was held in the Trace Aqua Sports Center."
        ],
        [
            "Los Baños also plays host to the UAAP, as the Trace Aquatics Center has served as the venue for the league's swimming competitions since UAAP Season 70 until UAAP Season 76."
        ],
        [
            "Currently, Los Baños is probably the densest habitat of academicians in South East Asia."
        ],
        [
            "On December 3, 2020, firing from outside the perimeter walls, its incumbent mayor Caesar P. Perez was assassinated inside the municipal office premises by an armed assailant,"
        ],
        [
            "Geography"
        ],
        [
            "Mount Makiling, previously declared as the first national park of the Philippines is now administered by the University of the Philippines Los Baños"
        ],
        [
            "Los Baños is nestled between two of Southern Luzon's most dominant geographical features – Mount Makiling to the south and south-west and Laguna de Bay to the north.",
            "In fact, Laguna de Bay's southernmost tip is at Barangay Bambang, and Barangay Bagong Silang is already halfway up Mount Makiling.",
            "Both the mountain and the lake are volcanic features – Makiling being a potentially active volcano whose geothermal activities gave birth to the hot springs after which the town was named, and Laguna de Bay being the filled-in caldera of a massive prehistoric volcano."
        ],
        [
            "Another notable geological feature is Tadlac Lake, a maar lake whose almost perfectly round shape and uncharted waters have led some locals to call it \"the enchanted lake\".",
            "Others call it \"alligator lake\", a reminder that it served as the last bastion of Laguna de Bay's once-plentiful cayman population, which has since been wiped out and is now just another legendary part of Philippine history."
        ],
        [
            "Rivers"
        ],
        [
            "The town of Los Baños is crossed by five rivers or creeks:"
        ],
        [
            "The Dampalit river, which is named after an edible herb, dampalit (Sesuvium portulacastrum), which often grows near river shores, originates on the north face of Mt.",
            "Makiling east of the Philippine High School for the Arts, and feeds into Laguna lake at the boundary of Barangays Lalakay and Bambang."
        ],
        [
            "The Saran creek, whose headwaters begin somewhere near the municipal dumpsite, flows through Barangay Anos near the municipal cemetery, and feeds into the lake at Barangay Malinta."
        ],
        [
            "The Pele creek, named after the pili tree (Canarium ovatum), flows through the west side of Barangay Batong Malake and has its mouth at the boundary of Barangays Malinta and Mayondon."
        ],
        [
            "The Molawin River, most familiar to UPLB students because it flows through the UPLB campus and the Makiling Botanic Gardens, is named after the Molave tree (Vitex parviflora)."
        ],
        [
            "The Maitim river, whose name means \"black\", flows through the westernmost portions of Los Baños, marking the town's boundary with its neighboring town of Bay.",
            "The Molawin and Maitim rivers merge just a few meters before feeding into Laguna de Bay at the shore of Barangay Maahas."
        ],
        [
            "Climate"
        ],
        [
            "Los Baños has a tropical monsoon climate (Köppen climate classification Am)."
        ],
        [
            "Climate data for Los Baños, Laguna"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "29.3(84.7)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "31.2(88.2)"
        ],
        [
            "29.9(85.8)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "28.8(83.8)"
        ],
        [
            "28.8(83.8)"
        ],
        [
            "28.7(83.7)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "26.7(80.1)"
        ],
        [
            "26.0(78.8)"
        ],
        [
            "25.9(78.6)"
        ],
        [
            "25.8(78.4)"
        ],
        [
            "25.8(78.4)"
        ],
        [
            "25.5(77.9)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "25.8(78.4)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.3(72.1)"
        ],
        [
            "22.3(72.1)"
        ],
        [
            "23.1(73.6)"
        ],
        [
            "24.3(75.7)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "23.8(74.8)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "23.7(74.6)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "49(1.9)"
        ],
        [
            "34(1.3)"
        ],
        [
            "40(1.6)"
        ],
        [
            "45(1.8)"
        ],
        [
            "181(7.1)"
        ],
        [
            "259(10.2)"
        ],
        [
            "386(15.2)"
        ],
        [
            "312(12.3)"
        ],
        [
            "332(13.1)"
        ],
        [
            "193(7.6)"
        ],
        [
            "108(4.3)"
        ],
        [
            "143(5.6)"
        ],
        [
            "2,082(82)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "15"
        ],
        [
            "19"
        ],
        [
            "21"
        ],
        [
            "21"
        ],
        [
            "20"
        ],
        [
            "16"
        ],
        [
            "10"
        ],
        [
            "10"
        ],
        [
            "152"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "80"
        ],
        [
            "79"
        ],
        [
            "77"
        ],
        [
            "75"
        ],
        [
            "79"
        ],
        [
            "85"
        ],
        [
            "87"
        ],
        [
            "88"
        ],
        [
            "88"
        ],
        [
            "86"
        ],
        [
            "84"
        ],
        [
            "83"
        ],
        [
            "83"
        ],
        [
            "Source: Climate-data.org"
        ],
        [
            "Barangays"
        ],
        [
            "Political map of Los Baños"
        ],
        [
            "Los Baños Town Hall"
        ],
        [
            "Los Baños is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Anos"
        ],
        [
            "Bagong Silang"
        ],
        [
            "Bambang"
        ],
        [
            "Batong Malake"
        ],
        [
            "Baybayin"
        ],
        [
            "Bayog"
        ],
        [
            "Lalakay"
        ],
        [
            "Maahas"
        ],
        [
            "Malinta"
        ],
        [
            "Mayondon"
        ],
        [
            "Putho-Tuntungin"
        ],
        [
            "San Antonio"
        ],
        [
            "Tadlac"
        ],
        [
            "Timugan"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Los BañosYearPop.±% p.a.1903 3,352—    1918 6,337+4.34%1939 9,612+2.00%1948 10,954+1.46%1960 21,519+5.79%1970 32,167+4.10%1975 38,351+3.59%1980 49,555+5.26%1990 66,211+2.94%1995 71,683+1.50%2000 82,027+2.93%2007 98,631+2.58%2010 101,884+1.19%2015 112,008+1.82%2020 115,353+0.58%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Los Baños was 115,353 people, with a density of 2,100 inhabitants per square kilometer or 5,400 inhabitants per square mile."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Like other LGUs in Laguna, the town holds election every three years, which will cover from Mayor, Vice Mayor, and up to the councilors."
        ],
        [
            "Los Baños Municipal officials (2022–2025)"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "House of Representatives"
        ],
        [
            "Ruth Mariano-Hernandez"
        ],
        [
            "Lakas"
        ],
        [
            "Mayor"
        ],
        [
            "Anthony F. Genuino"
        ],
        [
            "Bigkis Pinoy"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Josephine S. Evangelista"
        ],
        [
            "Bigkis Pinoy"
        ],
        [
            "Councilors"
        ],
        [
            "Leren Mae M. Bautista"
        ],
        [
            "Bigkis Pinoy"
        ],
        [
            "Marlo PJ A. Alipon"
        ],
        [
            "Bigkis Pinoy"
        ],
        [
            "Jonathan Bryan S. Siytiap"
        ],
        [
            "Bigkis Pinoy"
        ],
        [
            "Miko C. Pelegrina"
        ],
        [
            "Independent"
        ],
        [
            "Mark Lester B. Dizon"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Julius A. Moliñawe"
        ],
        [
            "Reporma"
        ],
        [
            "Benedicto S. Alborida"
        ],
        [
            "Reporma"
        ],
        [
            "Mike Dexter A. Concio"
        ],
        [
            "Bigkis Pinoy"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Los Baños"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "2006  2.60"
        ],
        [
            "2009  1.63"
        ],
        [
            "2012  2.73"
        ],
        [
            "2015  2.14"
        ],
        [
            "2018  1.57"
        ],
        [
            "2021  7.46"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Gate of University of the Philippines Los Baños"
        ],
        [
            "University of the Philippines Los Baños and other places of interest within its administered area"
        ],
        [
            "Mount Makiling"
        ],
        [
            "Makiling Botanic Gardens"
        ],
        [
            "ASEAN Center for Biodiversity"
        ],
        [
            "UPLB Museum of Natural History"
        ],
        [
            "Flatrocks – creek usually frequented by hikers"
        ],
        [
            "Mudspring – Presumed volcanic crater of Mt.",
            "Makiling"
        ],
        [
            "Peak 2 – Highest peak of Mt.",
            "Makiling"
        ],
        [
            "Pook ni Maria Makiling, an eco-tourism site adjacent to the Jamboree Site, National Arts Center, and U.P.",
            "Los Baños"
        ],
        [
            "Boy Scouts of the Philippines and Jamboree Site – a campsite at the foot of Mount Makiling adjacent to U.P.",
            "Los Baños, which is being managed by the Boy Scouts of the Philippines and the site of the 10th World Scout Jamboree in 1959, the 1st and 12th Asia Pacific Jamboree in 1973 and 1991, and the 1st ASEAN Jamboree in 1993."
        ],
        [
            "National Arts Center – a patch of land at the foot of Mount Makiling adjacent to U.P.",
            "Los Baños, which is being managed by the Cultural Center of the Philippines and the site of the Philippine High School for the Arts, a special school for young artist scholars."
        ],
        [
            "International Rice Research Institute International Rice Research Institute"
        ],
        [
            "Philippine Rice Research Institute"
        ],
        [
            "Dairy Training & Research Institute"
        ],
        [
            "Philippine Carabao Center at UPLB (PCC at UPLB) – conducts R&D in water buffalo; implements other programs related to water buffalo development; one of the 13 regional centers of PCC (see the link below)"
        ],
        [
            "Agricultural and Life Sciences Complex"
        ],
        [
            "National Institute of Molecular Biology and Biotechnology (NIMBB/BIOTECH) – UPLB"
        ],
        [
            "Institute of Plant Breeding"
        ],
        [
            "APEC Center for Technology Exchange and Training for Small and Medium Enterprises (ACTETSME)"
        ],
        [
            "National Crop Protection Center (NCPC)"
        ],
        [
            "College of Agriculture AgriPark"
        ],
        [
            "Baker Hall (also known as Los Baños Internment Camp during World War II)"
        ],
        [
            "University of the Philippines Open University University of the Philippines Open University (UPOU)"
        ],
        [
            "Philippine Council for Agriculture, Aquatic, and Natural Resources Research and Development (PCAARRD)"
        ],
        [
            "Department of Science and Technology Regional Office for Region IV (DOST IV)"
        ],
        [
            "Magnetic Hill"
        ],
        [
            "Dampalit Falls"
        ],
        [
            "Immaculate Conception Parish – a centuries-old church at the town proper (Poblacion/Bayan)"
        ],
        [
            "Paciano Rizal ShrinePaciano Rizal Shrine – house of Paciano Rizal, brother of National Hero Jose Rizal"
        ],
        [
            "Paciano Rizal Park – park dedicated to Paciano Rizal, brother of National Hero Jose Rizal"
        ],
        [
            "Trace Aqua Sports Complex and Museum – aquatic sports venue for the 2005 SEA Games and Philippine Olympic Festival"
        ],
        [
            "Yamashita Shrine – execution site of Gen. Homma and Gen. Yamashita"
        ],
        [
            "Education"
        ],
        [
            "There are 16 daycare schools in Los Baños, managed by DSWD and local government."
        ],
        [
            "University of the Philippines Los Baños"
        ],
        [
            "University of the Philippines Open University"
        ],
        [
            "Laguna State Polytechnic University (Los Baños Campus)"
        ],
        [
            "Christian School International"
        ],
        [
            "Maquiling School Incorporated"
        ],
        [
            "Trace College"
        ],
        [
            "Colegio De Los Baños"
        ],
        [
            "Saint Anthony School-LB"
        ],
        [
            "Los Baños National High School"
        ],
        [
            "Los Baños National High School – Poblacion"
        ],
        [
            "Tuntungin-Putho Integrated National High School"
        ],
        [
            "Liceo de Los Baños"
        ],
        [
            "University of the Philippines Rural High School"
        ],
        [
            "Los Baños Central Elementary School"
        ],
        [
            "Lopez Elementary School"
        ],
        [
            "Bernaldo N. Calara Elementary School"
        ],
        [
            "Liceo de Los Baños"
        ],
        [
            "South Hill School Inc."
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "The Learning Place International"
        ],
        [
            "Morning Star Montessori School Inc."
        ],
        [
            "Maranatha Elementary School"
        ],
        [
            "Hasik Bagong Buhay Christian School"
        ],
        [
            "Joy in Learning School"
        ],
        [
            "Los Baños Faith Christian School"
        ],
        [
            "Lalakay Elementary School"
        ],
        [
            "Malinta Elementary School"
        ],
        [
            "Mayondon Elementary School"
        ],
        [
            "Tuntungin Elementary School"
        ],
        [
            "Bayog Elementary School"
        ],
        [
            "Tadlac Elementary School"
        ],
        [
            "Bagong Silang Elementary School"
        ],
        [
            "Notable People"
        ],
        [
            "Paciano Rizal – military general and revolutionary; older brother of José Rizal"
        ],
        [
            "Rizalina Ilagan – anti-martial law activist that was abducted by state security agents and disappeared with nine other activists in what is believed to be the single biggest case of involuntary disappearance during Ferdinand Marcos' martial law in the Philippines that later came to be known as the Southern Tagalog 10."
        ],
        [
            "Tony Mabesa – National Artist of the Philippines for Theater."
        ],
        [
            "Ricardo Lantican – National Scientist of the Philippines for Plant Breeding"
        ],
        [
            "Aloysius Baes – environmental chemist, environmental and pro-democracy activist, educator, and musician."
        ],
        [
            "Rogel Mari Sese – Filipino astrophysicist who is known for being a proponent of space science in the Philippines."
        ],
        [
            "Jonas Baes – composer"
        ],
        [
            "Bonifacio Ilagan – writer, filmmaker, journalist, and activist."
        ],
        [
            "Cielito Habito – economist, professor, and former NEDA Director-General"
        ],
        [
            "Emerlinda R. Roman – educator, university administrator, and 19th President of the University of the Philippines"
        ],
        [
            "Benjamin Madrigal Jr. – 51st Chief of Staff of the Armed Forces of the Philippines"
        ],
        [
            "Bryan Gahol – former Filipino professional basketball player in the Philippine Basketball Association."
        ],
        [
            "Sister cities"
        ],
        [
            " Davis, California, United States"
        ],
        [
            "References"
        ],
        [
            "^ \"The Special Science and Nature City | Municipality of Los Banos\".",
            "losbanos.gov.ph.",
            "April 23, 2015.",
            "Archived from the original on November 14, 2016.",
            "Retrieved November 17, 2016."
        ],
        [
            "^  Municipality of Los Baños |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b Presidential Proclamation No.",
            "349 (August 7, 2000), Designating and Declaring the Municipality of Los Baños, Laguna as a Special Science and Nature City of the Philippines (Official Gazette of the Republic of the Philippines), retrieved May 26, 2017"
        ],
        [
            "^ Cinco, Maricar.",
            "\"In Los Baños, giant 'buko' pie steals Christmas show\".",
            "Philippine Daily Inquirer.",
            "Retrieved April 21, 2020."
        ],
        [
            "^ \"Meet the couple behind Laguna's 'famous cakes'\".",
            "ABS-CBN News.",
            "ABS-CBN Broadcasting Corporation.",
            "Retrieved November 3, 2016."
        ],
        [
            "^ \"2016 Annual Financial Report – Local Government\" (PDF).",
            "Republic of the Philippines – Commission on Audit.",
            "September 25, 2017.",
            "Retrieved September 10, 2018."
        ],
        [
            "^ a b \"HISTORY\".",
            "Municipality of Los Baños.",
            "Retrieved August 1, 2023."
        ],
        [
            "^ Kirk, Kate (2001).",
            "A Guide to Los Baños for IRRI International Staff & Families.",
            "Int.",
            "Rice Res.",
            "Inst.",
            "p. 4.",
            "ISBN 9789712201608."
        ],
        [
            "^ Henderson, Bruce (2015).",
            "Rescue at Los Baños: The Most Darking Prison Camp Raid of World War II."
        ],
        [
            "^ \"Yamashita Hanged\".",
            "Malaya Tribune.",
            "February 23, 1946."
        ],
        [
            "^ a b Ganzel, Bill (2007).",
            "\"The Development of \"Miracle Rice\" Varieties\".",
            "Wessels Living History Farm.",
            "Ganzel Group.",
            "Retrieved September 19, 2017."
        ],
        [
            "^ Balbosa, Joven Zamoras (1992).",
            "\"IMF Stabilization Program and Economic Growth: The Case of the Philippines\" (PDF).",
            "Journal of Philippine Development.",
            "XIX (35).",
            "Archived from the original (PDF) on September 21, 2021.",
            "Retrieved April 11, 2022."
        ],
        [
            "^ Diola, Camille.",
            "\"Debt, deprivation and spoils of dictatorship | 31 years of amnesia\".",
            "The Philippine Star.",
            "Archived from the original on June 26, 2017.",
            "Retrieved May 2, 2018."
        ],
        [
            "^ a b c Pangilinan-Jamolin, Lei; Guzman, Rowena de; Yema, Dan Paolo (December 1, 2020).",
            "\"Experiences of selected University of the Philippines Los Banos (UPLB) community members during Martial Law in the Philippines\".",
            "U.P.",
            "Los Baños Journal."
        ],
        [
            "^ Malay, Carolina S., 1940- (2015).",
            "Ang mamatay nang dahil sa 'yo.",
            "Ermita, Manila, Philippines.",
            "ISBN 978-971-538-270-0.",
            "OCLC 927728036.",
            "{{cite book}}:  CS1 maint: location missing publisher (link) CS1 maint: multiple names: authors list (link) CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ Executive Order No.",
            "784, s. 1982 (March 17, 1982), Reorganizing the National Science Development Board and Its Agencies Into a National Science and Technology Authority and for Related Purposes, retrieved August 1, 2023"
        ],
        [
            "^ \"The Special Science and Nature City\".",
            "Municipality of Los Baños.",
            "Archived from the original on December 29, 2016.",
            "Retrieved August 17, 2016."
        ],
        [
            "^ \"FACTS & FIGURES: Municipality of Los Banos\".",
            "losbanos.gov.ph.",
            "Archived from the original on December 6, 2019.",
            "Retrieved November 20, 2019."
        ],
        [
            "^ \"Los Baños mayor shot dead inside municipal hall\".",
            "December 3, 2020.",
            "Retrieved December 4, 2020."
        ],
        [
            "^ \"Main suspect in killing of Los Baños mayor arrested in Baguio City\".",
            "Manila Bulletin.",
            "Retrieved October 18, 2022."
        ],
        [
            "^ a b c d e Plan of Road Network for Municipality of Los Baños, Province of Laguna, Island of Luzon (Map).",
            "Los Baños Municipal Planning and Development Office."
        ],
        [
            "^"
        ],
        [
            "\"Los Baños Climate\".",
            "Climate-data.org.",
            "Retrieved February 2, 2023."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Laguna\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Angelo, Mikael (January 8, 2019).",
            "\"Dr. Ricardo M. Lantican: The Filipino whose research changed four industries – FlipScience – Top Philippine science news and features for the inquisitive Filipino\".",
            "Flipscience.ph.",
            "Retrieved December 12, 2021."
        ],
        [
            "^ \"Sister Cities | City of Davis, CA\".",
            "www.cityofdavis.org.",
            "Retrieved June 11, 2021."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Los Baños, Laguna."
        ],
        [
            "Wikivoyage has a travel guide for Los Baños (Laguna)."
        ],
        [
            "Municipality of Los Baños official"
        ],
        [
            "Los Baños History"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Los Baños, Laguna"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "Calamba"
        ],
        [
            "Los Baños"
        ],
        [
            "Bay"
        ],
        [
            "Santo Tomas, Batangas"
        ],
        [
            "Bay"
        ],
        [
            "vteProvince of LagunaSanta Cruz (capital)  Calamba (largest city)Municipalities"
        ],
        [
            "Alaminos"
        ],
        [
            "Bay"
        ],
        [
            "Calauan"
        ],
        [
            "Cavinti"
        ],
        [
            "Famy"
        ],
        [
            "Kalayaan"
        ],
        [
            "Liliw"
        ],
        [
            "Los Baños"
        ],
        [
            "Luisiana"
        ],
        [
            "Lumban"
        ],
        [
            "Mabitac"
        ],
        [
            "Magdalena"
        ],
        [
            "Majayjay"
        ],
        [
            "Nagcarlan"
        ],
        [
            "Paete"
        ],
        [
            "Pagsanjan"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Pila"
        ],
        [
            "Rizal"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Siniloan"
        ],
        [
            "Victoria"
        ],
        [
            "Component Cities"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "BarangaysSee: List of barangays in Laguna (province)"
        ],
        [
            "vteSpecial Zones of Laguna"
        ],
        [
            "Canlubang Industrial Zone"
        ],
        [
            "Makiling Forest Reserve"
        ],
        [
            "Nature and Science City of Los Baños"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "Pagsanjan Falls (Cavinti)"
        ],
        [
            "Seven Lakes of San Pablo"
        ],
        [
            "Lake Caliraya"
        ],
        [
            "Mount Sembrano"
        ],
        [
            "Laguna Caldera"
        ],
        [
            "Caliraya Dam"
        ],
        [
            "University of the Philippines Los Baños"
        ],
        [
            "International Rice Research Institute"
        ],
        [
            "Nagcarlan Underground Cemetery"
        ],
        [
            "Enchanted Kingdom"
        ],
        [
            "Villa Escudero Plantations"
        ],
        [
            "Rizal Monument"
        ],
        [
            "Rizal Shrine"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "France"
        ],
        [
            "BnF data"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Los_Baños,_Laguna&oldid=1230168388\""
        ],
        [
            "Categories: Los Baños, LagunaMunicipalities of Laguna (province)Populated places on Laguna de BaySpa towns in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: location missing publisherCS1 maint: multiple names: authors listCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from April 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2023Pages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles to be expanded from January 2022All articles to be expandedArticles using small message boxesAll articles with unsourced statementsArticles with unsourced statements from July 2017Commons category link from WikidataAll articles with dead external linksArticles with dead external links from September 2017Articles with permanently dead external linksArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with BNF identifiersArticles with BNFdata identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}