{
    "name": "Lubuagan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Lubuagan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°21′N 121°11′E﻿ / ﻿17.35°N 121.18°E﻿ / 17.35; 121.18"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Kalinga, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Lubuagan\" – news · newspapers · books · scholar · JSTOR (January 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Cordillera Administrative Region, PhilippinesLubuaganMunicipalityMunicipality of LubuaganLubuagan from the Magmag-an Pass"
        ],
        [
            "FlagMap of Kalinga with Lubuagan highlightedOpenStreetMapLubuaganLocation within the PhilippinesCoordinates: 17°21′N 121°11′E﻿ / ﻿17.35°N 121.18°E﻿ / 17.35; 121.18CountryPhilippinesRegionCordillera Administrative RegionProvinceKalingaDistrict"
        ],
        [
            "Lone districtFounded1905Barangays9"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJoel B. Tagaotao • Vice MayorAlonzo C. Saclag Jr. • RepresentativeAllen Jesse C. Mangaoang • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jakerson L. ManaltagAngelito S. AntonVictor D. DicklyTommy S. PalloganRudy D. OcanJan Jericho A. OdiemWildy C. WansiSimi L. Colayot"
        ],
        [
            " • Electorate10,344 voters (2022)Area • Revenue₱ 99.43 million (2020) • Assets₱ 251.3 million (2020) • Expenditure₱ 72.68 million (2020) • Liabilities₱ 59.2 million (2020)Service provider • ElectricityKalinga - Apayao Electric Cooperative (KAELCO)Time zoneUTC+8 (PST)ZIP code3802PSGC143206000IDD : area code +63 (0)74Native languagesIlocanoTagalogWebsitewww.lubuagan.gov.ph"
        ],
        [
            "Lubuagan, officially the Municipality of Lubuagan  is a 4th class municipality in the province of Kalinga, Philippines.",
            "According to the 2020 census, it has a population of 9,323 people."
        ],
        [
            "Lubuagan is 43 kilometres (27 mi) from Tabuk City and 457 kilometres (284 mi) from Manila."
        ],
        [
            "Lubuagan Municipality, once the seat of the National Government from March 6 to May 17, 1900, during the time of Gen. Emilio Aguinaldo, was among the eight (8) municipalities of the new province of Kalinga.",
            "It is located at 800 metres (2,600 ft) above sea level in the southern part of Kalinga and in the heart of the Cordillera.",
            "It has a land area of 23,420 hectares (57,900 acres).",
            "Some of its younger generation have migrated either in the lowland plains of Tabuk or in other provinces in search for income and employment opportunities."
        ],
        [
            "History"
        ],
        [
            "Spanish Rule was never established in Lubuagan during its 300 year occupation of the Philippines.",
            "However, Emilio Aguinaldo, president of the erstwhile First Philippine Republic made Lubuagan the seat of government for 73 days, from 6 March to 18 May 1900, before his escape and eventual capture at Palanan, Isabela, on 23 March 1901."
        ],
        [
            "Upon the assumption of the United States of America as colonial power over the Philippines.",
            "The Township of Lubuagan was established in 1905 and administered via the sub provincial government of Lepanto-Bontoc sub-province.",
            "Lt.",
            "Governor E. A. Eckman, an American ex-soldier was the Chief Executive of the sub-province."
        ],
        [
            "In 1907, Kalinga was separated and organized as a distinct sub-province from Lepanto-Bontoc.",
            "Franklin Walter Hale was appointed the first Lt.",
            "Governor to establish a civil government in Kalinga."
        ],
        [
            "Bulanao, a thriving community of Tubog at the time, the site of which is the present homestead of Abe Umao was the target of Hale as the center of his administration in Kalinga.",
            "But shortly thereafter, a cholera and malaria epidemic broke out in the latter part of 1907 and continued in 1908 which almost wiped out the populace.",
            "Hale himself caught malaria so that he and his family were forced to leave Bulanao."
        ],
        [
            "Hale and his staff came up to Lubuagan in the early part of 1909 and established their quarters and camps where the present multi-purpose hall now stands.",
            "Hale whom the people baptized and fondly called Sapao, first organized his police contingent from and among the tribal pangats and headmen from the different villages of Kalinga to help them tame recalcitrant natives."
        ],
        [
            "Hale served Kalinga up to the end of July 1915.",
            "He was replaced by Samuel Kane, who served for a brief period and was replaced by Alex Gilfilan in September 1916, who was later on replaced by Deputy Governor Thomas Blanco, a Filipino.",
            "In 1924, Nicasio Balinag took over as Deputy Governor."
        ],
        [
            "The colonial government notably beginning with the administration of Hale up to the Commonwealth government was considered the golden years of Lubuagan, which was designated the capital town of the sub-province before Tabuk rose to its present status as the center of learning and government activities.. Lubuagan at that time was the center of education, culture, commerce and trade.",
            "The founding of the Kalinga Academy in 1927, a secondary school run by American Missionaries and the St. Teresita's School in 1929, a Catholic Primary and High School managed by the CICM Belgian Missionaries bolstered the luster of Lubuagan.",
            "It was also in Lubuagan where the first instruction of higher learning in the old Mountain Province was established."
        ],
        [
            "During World War II, Japanese Imperial Army Japanese forces occupied Lubuagan in May 1942."
        ],
        [
            "In 1945, Lubuagan was bombed by American planes resulting in the destruction of the Lubuagan Central School which was then occupied by the Japanese.",
            "St. Peter's church, its convent and two more buildings within its compound were all burned to the ground."
        ],
        [
            "(Source: Souvenir Book: Kalinga 7th Foundation Day)"
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Lubbuagan is politically subdivided into 9 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Antonio Canao"
        ],
        [
            "Dangoy"
        ],
        [
            "Lower Uma"
        ],
        [
            "Mabilong"
        ],
        [
            "Mabongtot"
        ],
        [
            "Poblacion"
        ],
        [
            "Tanglag"
        ],
        [
            "Uma del Norte (Western Uma)"
        ],
        [
            "Upper Uma"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Lubuagan, Kalinga"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "25(77)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "21(70)"
        ],
        [
            "25(76)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "16(61)"
        ],
        [
            "16(61)"
        ],
        [
            "17(63)"
        ],
        [
            "18(64)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "18(64)"
        ],
        [
            "17(63)"
        ],
        [
            "18(65)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "78(3.1)"
        ],
        [
            "60(2.4)"
        ],
        [
            "49(1.9)"
        ],
        [
            "51(2.0)"
        ],
        [
            "194(7.6)"
        ],
        [
            "197(7.8)"
        ],
        [
            "209(8.2)"
        ],
        [
            "226(8.9)"
        ],
        [
            "185(7.3)"
        ],
        [
            "180(7.1)"
        ],
        [
            "143(5.6)"
        ],
        [
            "183(7.2)"
        ],
        [
            "1,755(69.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "15.6"
        ],
        [
            "12.5"
        ],
        [
            "11.8"
        ],
        [
            "12.5"
        ],
        [
            "21.0"
        ],
        [
            "23.3"
        ],
        [
            "25.2"
        ],
        [
            "26.1"
        ],
        [
            "22.6"
        ],
        [
            "17.1"
        ],
        [
            "16.7"
        ],
        [
            "19.6"
        ],
        [
            "224"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Children from Lubuagan, Kalinga perform the muscle dance."
        ],
        [
            "Population census of LubuaganYearPop.±% p.a.1918 8,874—    1939 7,366−0.88%1948 7,821+0.67%1960 10,289+2.31%1970 7,236−3.45%1975 7,780+1.46%1980 8,545+1.89%1990 9,189+0.73%1995 9,897+1.40%2000 9,875−0.05%2007 10,183+0.42%2010 9,369−2.99%2015 8,733−1.33%2020 9,323+1.29%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Lubuagan, Kalinga, was 9,323 people, with a density of 40 inhabitants per square kilometre or 100 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Lubuagan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  35.60"
        ],
        [
            "2009  24.80"
        ],
        [
            "2012  26.14"
        ],
        [
            "2015  26.60"
        ],
        [
            "2018  20.23"
        ],
        [
            "2021  7.52"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Lubuagan, belonging to the lone congressional district of the province of Kalinga, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Allen Jesse C. Mangaoang"
        ],
        [
            "Mayor"
        ],
        [
            "Charisma Anne O. Dickpus"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Victor D. Dickly"
        ],
        [
            "Councilors"
        ],
        [
            "Loralei T. Balangcod"
        ],
        [
            "Jan Jericho A. Odiem"
        ],
        [
            "Rudy D. Ocan"
        ],
        [
            "Jayharley B. Duguiang"
        ],
        [
            "Stephen Custer B. Canao"
        ],
        [
            "Delia A. Alunday"
        ],
        [
            "Balmaceda K. Salicanto"
        ],
        [
            "Rustom B. Dao-in"
        ],
        [
            "Tourism"
        ],
        [
            "St. Theresita's School, a Roman Catholic school established by the CICM missionaries in 1925, was once the educational center of the Cordillera.",
            "It was also used as a military outpost by the Japanese, Filipino and American forces during World War II."
        ],
        [
            "Mabilong Weaver's Village, located along the road, is the center of the ethnic weaving industry in the province.",
            "It showcases colorful ethnic backstrap weaving.",
            "Here, one can see how the intricate ethnic designs are made and how the colors are mixed.",
            "Souvenirs can be bought from the weavers."
        ],
        [
            "The town has extensive and scenic rice terraces (Pon-e Rice Terraces and Gapis Rice Terraces) cut into the mountains, rising 2,000 feet (610 m) from the Chico River bed."
        ],
        [
            "5 kilometres (3.1 mi) north of the town is a turn-off with a once-busy road leading west to Batong Buhay Mines."
        ],
        [
            "Aguinaldo Hill, located 7 kilometres (4.3 mi) from the national road, was Gen. Aguinaldo's command post during his 72-day stay in the town.",
            "It has a panoramic view of several barangays in Pinukpuk."
        ],
        [
            "Awichon Mesa, a plateau situated at Barangay Upper Uma, 2 km from the town proper and between Pasil and Lubuagan, is an archaeological site where bones of a prehistoric elephant were found.",
            "It was also the landing site of American forces during World War II."
        ],
        [
            "Cadamayan Falls, at Barangay Western Uma, serves as the natural boundary of Pasil, Lubuagan and Tinglayan and can be viewed from the road."
        ],
        [
            "Tiwod Spring, the \"Fertility Twin Spring\", is believed to be a God-given gift for couples who haven't had children yet.",
            "Couples who take a bath on mornings and drink from it will bear children as believed by many locals."
        ],
        [
            "Unexplored Tongango Caves, located just above the poblacion, consists of several chambers connecting the mountains of Lubuagan, Sumadel and Tulgao."
        ],
        [
            "The Belalao Mabilong View is a stopover for viewing the panorama of the picturesque Lubuagan Village.",
            "Visitors who come by night are said to be surprised by a sudden appearance of a lost city in the mountain."
        ],
        [
            "Manangol Viewpoint, at the top of Manangol Hill, is where you could see a magnificent, panoramic view of the Chico River (and villages supposed to be submerged by Chico Dam IV), the \"Sleeping Beauty\" of Tinglayan and the hidden rice terraces seated at the basement of the overlapping mountain."
        ],
        [
            "The Poway View Deck, at the boundary of Pasil and Lubuagan, is where you could view the 5 barangays and the winding Pasil River."
        ],
        [
            "The Pudpud Chico Viewpoint, at the Lubuagan Central School, is where you could view the long and winding Chico River and the aborted Chico Hydroelectric Dam."
        ],
        [
            "The Lubuagan Museum, located in an old American house, showcases a selection of old Chinese pottery as well as other Kalinga products.",
            "It is a two-hour jeepney ride from Tabuk."
        ],
        [
            "Culture"
        ],
        [
            "Laga Festival- From \"laga\", a Kalinga word which means to weave.",
            "Celebrated annually, typically in March.",
            "It is a two or three-day celebration which showcases the culture, arts, and history of Lubuagan."
        ],
        [
            "Notable personalities"
        ],
        [
            "Jean Claude Saclag – Medalist, Kickboxing and Wushu"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Lubuagan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"History\".",
            "Municipality of Lubuagan.",
            "Archived from the original on 31 August 2018.",
            "Retrieved 14 March 2019."
        ],
        [
            "^ \"Municipality of Lubuagan\".",
            "Department of the Interior and Local Government-Cordillera Administrative Region.",
            "Archived from the original on 22 March 2016.",
            "Retrieved 14 March 2019."
        ],
        [
            "^"
        ],
        [
            "\"Lubuagan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 8 March 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Cordillera Administrative Region (CAR)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Kalinga\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 13, 2022."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Lubuagan"
        ],
        [
            "Pasil"
        ],
        [
            "Tabuk"
        ],
        [
            "Tubo, Abra"
        ],
        [
            "Lubbuagan"
        ],
        [
            "Tanudan"
        ],
        [
            "Sadanga, Mt.",
            "Prov.",
            "/ Tinglayan"
        ],
        [
            "vte Province of KalingaTabuk (capital and largest city)Municipalities"
        ],
        [
            "Balbalan"
        ],
        [
            "Lubuagan"
        ],
        [
            "Pasil"
        ],
        [
            "Pinukpuk"
        ],
        [
            "Rizal"
        ],
        [
            "Tanudan"
        ],
        [
            "Tinglayan"
        ],
        [
            "Component city"
        ],
        [
            "Tabuk"
        ],
        [
            "BarangaysSee: List of barangays in Kalinga"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Lubuagan&oldid=1224647769\""
        ],
        [
            "Categories: Municipalities of Kalinga (province)Populated places on the Rio Chico de CagayanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using the Kartographer extension"
        ]
    ]
}