{
    "name": "Ma-ayon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Ma-ayon"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°23′25″N 122°46′58″E﻿ / ﻿11.3903°N 122.7828°E﻿ / 11.3903; 122.7828"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Capiz, Philippines"
        ],
        [
            "\"Maayon\" redirects here.",
            "For the film, see Maayon (film)."
        ],
        [
            "Municipality in Western Visayas, PhilippinesMa-ayonMunicipalityMunicipality of Ma-ayon"
        ],
        [
            "FlagFlag (state)Motto(s): Ma-ayon, Banwa ko!",
            "Palangga ko!Map of Capiz with Ma-ayon highlightedOpenStreetMapMa-ayonLocation within the PhilippinesCoordinates: 11°23′25″N 122°46′58″E﻿ / ﻿11.3903°N 122.7828°E﻿ / 11.3903; 122.7828CountryPhilippinesRegionWestern VisayasProvinceCapizDistrict"
        ],
        [
            "1st districtBarangays32"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRaymond D. Malapajo • Vice MayorWilfredo E. Borres Sr. • RepresentativeEmmanuel A. Billones • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Chriselle Joy D. DiazJose C. DapulazaEl M. DerramasRolando D. DelfinVivian C. CombateEden D. DiazSyvil Grace A. DueñasRene D. Barrios"
        ],
        [
            " • Electorate27,069 voters (2022)Area • Revenue₱ 140.7 million (2020) • Assets₱ 329.4 million (2020) • Expenditure₱ 114.9 million (2020) • Liabilities₱ 66.06 million (2020)Service provider • ElectricityCapiz Electric Cooperative (CAPELCO)Time zoneUTC+8 (PST)ZIP code5809PSGC061907000IDD : area code +63 (0)36Native languagesCapisnon Hiligaynon TagalogWebsitewww.maayon.gov.ph"
        ],
        [
            "Ma-ayon, officially the Municipality of Ma-ayon (Capiznon/Hiligaynon: Banwa sang Ma-ayon; Tagalog: Bayan ng Ma-ayon), is a 3rd class municipality in the province of Capiz, Philippines.",
            "According to the 2020 census, it has a population of 41,226 people.",
            "It has a total land area of 142.32 km2 (54.95)."
        ],
        [
            "Sometimes spelled Ma-ayon, it is 32 kilometres (20 mi) from Roxas City,  the seat of the provincial government."
        ],
        [
            "Etymology"
        ],
        [
            "As to the origin of the name of Maayon not much has been written about it, but folks speak of several versions and one among those considered most popular was when a group of Spanish soldiers while pursuing the insurgents, discovered a settlement near the bank of the river.",
            "Finding the people to be hospitable and nice, they asked for the name of the place.",
            "Since the natives did not understand the Spanish language, they assumed that what the Spaniards were asking for what is the status of the harvest, for them it was harvest time.",
            "The natives answered \"Maayo man\".",
            "So the Spaniards named the settlement \"El Pueblo de Maayon\".",
            "Thus, the name Maayon was derived from that word and to this very day, it is known as such."
        ],
        [
            "History"
        ],
        [
            "Maayon first became a town during the early American era.",
            "However, during the Cadastral Survey, it was reverted to a barrio status under the Municipality of Pontevedra.",
            "For nearly half a century, the residents fought hard and long for its restoration to a separate and distinct entity.",
            "Their untiring efforts were empty rewarded when in 1955, Carmen Dinglasan Consing,  representative of the first District the Province of Capiz field House Bill No.",
            "2098 in the lower chamber of Congress.",
            "Senator Justinano S. Montaño sponsored and steered the bill until its approval.",
            "Finally on March 30, 1955, President Ramon Magsaysay signed the bill re-creating the Municipality of Maayon, Capiz in a ceremony held in Malacañan."
        ],
        [
            "The \"New Municipality\" included eight barrios then, namely, Maayon, Fernandez, Piña, Balighot, Batabat, Guia, Tuburan and Canapian Sur.",
            "Now it has thirty two (32) barangays."
        ],
        [
            "The ceremony was attended by a large delegation from Capiz.",
            "The President also signed the appointment of the following officials of the new town: For Mayor, Rafael M. Declaro Sr.; For Vice Mayor, Ernesto Diaz; For Councilors, Marcelo Diaz, Felomino Comoro, Damaso Deocampo, Ambrosio Dumagpi, Agustin Barruela and Marcelo Delfin.",
            "These officials, have gone back to their maker."
        ],
        [
            "Also present during the historic signing of Republic Act No.",
            "1203 were Representative Judge Godofredo  and Mr. Rafael Dinglasan Sr., Judge Antonio J. Beldia, Romeo Arceño, Gabriel Borres and his two sons Roberto and Athos, Mamerto Dadula.",
            "Most of the wives of the officials of the town also witnessed the memorable occasion."
        ],
        [
            "Among the town's first officials were: Uldarico Dieta, Secretary: Amado S. Almalbis, Treasurer: Ponciano Declaro, Judge: and Diosdado Borres, Chief of Police; While Dr. Manuel Buenvenida, who was then Rural Health Physician for Pontevedra, took temporary charge of the rural health services of the new town until his transfer to Pres.",
            "Roxas which Dr. Ricardo A. Dasal replaced him until 1956 when Dr. Alejandro Orosco was appointed and took over as the regular Rural Health Physician.",
            "Rev.",
            "Fr.",
            "Crisogono Dequiña was then parish priest."
        ],
        [
            "Rafael M. Declaro Sr. who was also the first elected mayor of the town during its first election in November 1955 won with less than 200 majority over Atty.",
            "Artagnan D. Roxas.",
            "He relinquished the mayorship to his running mate, Prudencio L. Alovera, when he assumed the position of municipal judge of the same town.",
            "The late Mayor Alovera served from 1957 to 1971, the longest term in the 25-year existence of the municipality.",
            "Alovera did not seek re-election in 1971.",
            "Bertile D. Comoro, fresh from college, ran and won against the late Jose B. Diaz III.",
            "Comoro serves as the third executive of the town until February 1986 when President Corazon C. Aquino, who won through People's Power, appointed Jose B. Diaz Jr. as officer-in-charge of the Office of the Mayor which the latter assumed the post but relinquished it a month later after receiving his appointment as Board Member of the Province of Capiz.",
            "Rolando L. Eleazar then took charge of the Office of the Mayor."
        ],
        [
            "The following are the past and present Municipal Mayors of Maayon:"
        ],
        [
            "1.",
            "Rafael M. Declaro Sr. (1955-1957), 2.",
            "Prudencio L. Alovera (1957-1971), 3.",
            "Bertile D. Comoro Sr. (1972-1986), 4.",
            "Jose B. Diaz Jr. (1986) - OIC, 5.",
            "Rolando L. Eleazar (1986-1988) - OIC, 6.",
            "Honorio B. Diaz Sr. (1988-1998), 7.",
            "Miguel Dillera (1998-2001), 8.",
            "Billy D. Dueñas (2001-2010), 9.",
            "Wilfredo E. Borres Sr. (2010-2019), and 10.",
            "Raymond D. Malapajo (2019–Present)"
        ],
        [
            "Geography"
        ],
        [
            "Some portion of the Maayon is considered flat and hilly and its eastern section is mountainous.",
            "Due to the existence of the Maayon River which flows from the boundary of Iloilo in the east towards the Panay River in the west, Maayon has an abundant quarry of gravel and sand."
        ],
        [
            "It is believed that the mountains of Maayon have rich deposits of valuable minerals like copper, gold rock, manganese, and limestone.",
            "Its plains are fertile lands, making the town basically rice producing, and farming as the main livelihood of the inhabitants.",
            "Every harvest, Maayon produces a great surplus of palay marketed to the neighboring towns and even to nearby towns of Iloilo."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Maayon, Capiz"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "27(81)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "61(2.4)"
        ],
        [
            "39(1.5)"
        ],
        [
            "46(1.8)"
        ],
        [
            "48(1.9)"
        ],
        [
            "90(3.5)"
        ],
        [
            "144(5.7)"
        ],
        [
            "152(6.0)"
        ],
        [
            "145(5.7)"
        ],
        [
            "163(6.4)"
        ],
        [
            "160(6.3)"
        ],
        [
            "120(4.7)"
        ],
        [
            "90(3.5)"
        ],
        [
            "1,258(49.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.3"
        ],
        [
            "9.0"
        ],
        [
            "9.9"
        ],
        [
            "10.0"
        ],
        [
            "18.5"
        ],
        [
            "25.0"
        ],
        [
            "27.4"
        ],
        [
            "26.0"
        ],
        [
            "25.9"
        ],
        [
            "24.9"
        ],
        [
            "17.9"
        ],
        [
            "14.2"
        ],
        [
            "221"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Maayon is politically subdivided into 32 barangays  Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aglimocon"
        ],
        [
            "Alasaging"
        ],
        [
            "Alayunan"
        ],
        [
            "Balighot"
        ],
        [
            "Batabat"
        ],
        [
            "Bongbongan"
        ],
        [
            "Cabungahan"
        ],
        [
            "Canapian"
        ],
        [
            "Carataya"
        ],
        [
            "Duluan"
        ],
        [
            "East Villaflores"
        ],
        [
            "Fernandez"
        ],
        [
            "Guinbi-alan"
        ],
        [
            "Indayagan"
        ],
        [
            "Jebaca"
        ],
        [
            "Maalan"
        ],
        [
            "Manayupit"
        ],
        [
            "New Guia"
        ],
        [
            "Quevedo (Ngalan)"
        ],
        [
            "Old Guia"
        ],
        [
            "Palaguian"
        ],
        [
            "Parallan"
        ],
        [
            "Piña"
        ],
        [
            "Poblacion Ilawod"
        ],
        [
            "Poblacion Ilaya"
        ],
        [
            "Poblacion Tabuc"
        ],
        [
            "Quinabonglan"
        ],
        [
            "Quinat-uyan"
        ],
        [
            "Salgan"
        ],
        [
            "Tapulang"
        ],
        [
            "Tuburan"
        ],
        [
            "West Villaflores"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Ma-ayonYearPop.±% p.a.1903 4,007—    1960 16,386+2.50%1970 20,229+2.13%1975 23,075+2.68%1980 25,715+2.19%1990 29,808+1.49%1995 30,333+0.33%2000 32,700+1.62%2007 35,448+1.12%2010 36,430+1.00%2015 38,416+1.02%2020 41,226+1.40%Source: Philippine Statistics Authority"
        ],
        [
            "Maayon's total population based on the census survey has an annual growth rate put at 1.11%."
        ],
        [
            "In the 2020 census, the population of Maayon was 41,226 people, with a density of 290 inhabitants per square kilometre or 750 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Ma-ayon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  49.70"
        ],
        [
            "2009  25.51"
        ],
        [
            "2012  39.94"
        ],
        [
            "2015  24.22"
        ],
        [
            "2018  10.35"
        ],
        [
            "2021  18.91"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "Hil-o Hil-o: Maayonanons Way of Life.",
            "The etymological origin of the word is up to now yet unknown, but its concept as practiced in our way of life over the years has been very visible and already firmly assimilated in the culture of Maayonanons."
        ],
        [
            "Hil-o Hil-o is reciprocity that demonstrates mutual interdependence among our people.",
            "It expressed itself in many forms and in many ways.",
            "It could simply be taking turns in helping one another to make a heavy work for one becomes lighter.",
            "It can also be rendering services or giving material donation for a relative, a friend or a neighbor who is holding a very important affair in the family."
        ],
        [
            "Tourism"
        ],
        [
            "This section is written like a manual or guide.",
            "Please help rewrite this section and remove advice or instruction.",
            "(October 2022)"
        ],
        [
            "Maayon has several landmarks that symbolizes its history and culture.",
            "The town is known for its natural ecological beauty and diversity, which is evident from its mountain ranges and caves."
        ],
        [
            "Landmarks"
        ],
        [
            "Mag-olot Falls"
        ],
        [
            "Resort in East Villaflores  Maayon Capiz  is one of the tourist attraction of Maayon.",
            "Mag-olot Falls Resort is located on the Southern Portion of the Barangay."
        ],
        [
            "Igang Cave"
        ],
        [
            "This is one of the tourist attractions in the province of Capiz, could be found in Barangay Tapulang, Maayon.",
            "It is 7 kilometers away from the town proper.",
            "It has many entrances at different levels all leading in main chamber which is well lighted and well ventilated."
        ],
        [
            "Municipal Hall"
        ],
        [
            "The new municipal building was inaugurated in 2005.",
            "The construction of building started last 2000 and completely finished in 2005."
        ],
        [
            "Handurawan Museum"
        ],
        [
            "The \"Handurawan” Library and Museum\" displays and exhibits old coins, rocks, precious memorabilia, other reading material and historical photos, before the rehabilitation of the museum from 1993 – 1998.",
            "It was the “Gabaldon Building”, erected in 1911 under Gabaldon Act 1901, that served as the primary school.",
            "The old Gabaldon building was named after Sec.",
            "Gabaldon when he was Secretary of Education during the Commonwealth Government."
        ],
        [
            "Magsaysay Shrine"
        ],
        [
            "The shrine is built in honor of the late Pres.",
            "Ramon Magsaysay Sr. for re-creating the Municipality of Maayon."
        ],
        [
            "Busay Dapuyan"
        ],
        [
            "It is the waterfall at Sitio Bailan Bato, Barangay Salgan.",
            "Perched in hills overlooking the village is the clear waterfall.",
            "There is a forest and a little talahib growth.",
            "Some are suited for pasture grassland."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Ma-ayon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Maayon: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 2 May 2020."
        ],
        [
            "^"
        ],
        [
            "\"Province: Capiz\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Capiz\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Ma-ayon"
        ],
        [
            "Panitan / Pontevedra"
        ],
        [
            "Dao"
        ],
        [
            "Maayon"
        ],
        [
            "Sara, Iloilo"
        ],
        [
            "Cuartero"
        ],
        [
            "Lemery, Iloilo"
        ],
        [
            "vte Province of CapizRoxas (capital and largest city)Municipalities"
        ],
        [
            "Cuartero"
        ],
        [
            "Dao"
        ],
        [
            "Dumalag"
        ],
        [
            "Dumarao"
        ],
        [
            "Ivisan"
        ],
        [
            "Jamindan"
        ],
        [
            "Ma-ayon"
        ],
        [
            "Mambusao"
        ],
        [
            "Panay"
        ],
        [
            "Panitan"
        ],
        [
            "Pilar"
        ],
        [
            "Pontevedra"
        ],
        [
            "President Roxas"
        ],
        [
            "Sapian"
        ],
        [
            "Sigma"
        ],
        [
            "Tapaz"
        ],
        [
            "Component city"
        ],
        [
            "Roxas"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Ma-ayon&oldid=1172315289\""
        ],
        [
            "Category: Municipalities of CapizHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataPages using infobox settlement with possible motto listCoordinates on WikidataArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from October 2022Wikipedia articles with style issues from October 2022All articles with style issuesPages using the Kartographer extension"
        ]
    ]
}