{
    "name": "Macrohon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Macrohon"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°04′47″N 124°56′35″E﻿ / ﻿10.07972°N 124.94306°E﻿ / 10.07972; 124.94306"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Southern Leyte, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Macrohon\" – news · newspapers · books · scholar · JSTOR (March 2009) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesMacrohonMunicipalityMunicipality of MacrohonParish Church of St. Michael the Archangel in Barangay San Vicente"
        ],
        [
            "FlagMap of Southern Leyte with Macrohon highlightedOpenStreetMapMacrohonLocation within the PhilippinesCoordinates: 10°04′47″N 124°56′35″E﻿ / ﻿10.07972°N 124.94306°E﻿ / 10.07972; 124.94306CountryPhilippinesRegionEastern VisayasProvinceSouthern LeyteDistrict"
        ],
        [
            "1st districtFoundedOctober 31, 1860Named forManuel MacCrohonBarangays30"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAlan Jose K. Aroy (Lakas) • Vice MayorJerome A. Curtina (PDPLBN) • RepresentativeLuz V. Mercado • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ina Marie K. LoyDebra Fe R. LigtasRofelia G. EdilloKaren M. KinazoAntonio M. CatreYuri Mea L. WrayWilfredo L. MadronaMenchie Ann S. Salinas"
        ],
        [
            " • Electorate18,201 voters (2022)Area • Revenue₱ 108.7 million (2020) • Assets₱ 356.9 million (2020) • Expenditure₱ 114.2 million (2020) • Liabilities₱ 94.21 million (2020)Service provider • ElectricitySouthern Leyte Electric Cooperative (SOLECO)Time zoneUTC+8 (PST)ZIP code6601PSGC086408000IDD : area code +63 (0)53Native languagesBoholano dialect Cebuano Tagalog"
        ],
        [
            "Macrohon, officially the Municipality of Macrohon (Cebuano: Lungsod sa Macrohon; Tagalog: Bayan ng Macrohon), is a 4th class municipality in the province of Southern Leyte, Philippines.",
            "According to the 2020 census, it has a population of 26,580 people."
        ],
        [
            "The municipality is the hometown of former guerilla warrior and Philippine Senator Ruperto Kangleon (Barangay San Roque), world renowned international singer Mike Hanopol (Barangay Ichon), former Southern Leyte Congressman Aniceto \"Odong\" Saludo (Barangay Ichon)  and beauty queen Miss Eco International 2018 Cynthia Magpatoc Thomalla (Barangay Sta.",
            "Cruz)."
        ],
        [
            "History"
        ],
        [
            "Macrohon since 1895, was named in memory of Spanish Governor-General Manuel MacCrohon, of Irish descent.",
            "It was weaned from the jurisdiction of Maasin in 1904.",
            "The town of Macrohon holds the distinction of having a son who led the resistance in Leyte and prepared the landing of the Liberation Forces which earned him high posts after the war and posthumous promotion by President Fidel V. Ramos to Brigadier General Ruperto K. Kangleon.",
            "Back to ancient times, after the United States took over the Philippines from Spain,"
        ],
        [
            "Macrohon became a municipality.",
            "However, in 1906, it was reverted as a barrio.",
            "When Salvador Demeterio was elected a delegate to the First National Assembly, he made Macrohon a separate municipality in 1907.",
            "Demeterio was also elected as governor of Leyte and the Capitol Building of Tacloban was built during his term.",
            "A historic edifice that during the naval pre- invasion bombardment, Ruperto K. Kangleon persuaded Gen. Douglas MacArthur on board the USS Nashville to desist the inclusion of Tacloban as target to preserve the capitol building.",
            "Thus, Macrohon earned a unique distinction of having great leaders deserving hallowed place in history."
        ],
        [
            "The town has a land area of 120 square kilometers.",
            "Its coastline has many mangroves, resort beaches and springs.",
            "A tiny islet in barrio Molopolo, a vacation home of its owner, continue to attract visitors and the beaches and springs inveigle bathers.",
            "The barrios of Aguinaldo (since 1870, named in memory of the 1st Filipino Revolutionary leader, Gen. Emilio Aguinaldo); Amparo (in memory of its Patron Saint and river and the oldest barrio since 1812, known as Hingatigan); Asuncion; Bag-ong Silang; Buscayan, Cambaro, Canlusay, Flordeliz (was named barrio Katung, a name of a revolutionary commander); Guadalupe; Ichon (named in memory of Emilio Ichon, secretary to the Leyte revolutionary commander); Ilihan, Laray; Mabini; Mohon; Molopolo ( barrio since 1845, a name from the abundant mangrove trees along the coast); Rizal ( a barrio since 1858; it was known then as Baliw, it was changed to Rizal to honor the National Filipino Hero and to remind the people of Macrohon the Philippines' struggle for freedom); San Joaquin ( a barrio since 1896, known then as Luuk); San Roque ( a barrio since 1873, known as Panagsaan); San Vicente (Poblacion); San Vicente (Upper); Santa Cruz; Santo Niño; Santo Rosario; Sindangan; Lower and Upper Villa Jacinta and Upper Ichon (also known as Lumbang).",
            "These baranggays constitutes the political units of the town of Macrohon."
        ],
        [
            "Distinguished luminaries from Macrohon, who earned renown, are the following: WWII Resistance Hero, Gen. Ruperto K. Kangleon, also assigned as Secretary of National Defense and was also elected as senator; Rep. Ciriaco K. Kangleon and Leyte Governor Salvador Demeterio.",
            "Archbishop Mariano G. Gaviola; former Court of Appeals Presiding Justice Ramon G. Gaviola, Jr.;and former Secretary of Education, Culture and Sports Ricardo Gloria, trace their roots from Macrohon.",
            "Their exemplary lives inspired others as to append the honor to Macrohon as the fountainhead of successful sons."
        ],
        [
            "1901 to present"
        ],
        [
            "The Municipal Government of Macrohon was organized in 1901 headed by Mr. Felomino Demeterio as the first appointed president.",
            "The town was composed only of the following barrios: \"Nipaon\" now Ichon, \"Hingatigan\" now Amparo, \"Maypague\" now Aguinaldo, \"Catong\" now Flordeliz and \"Panasawa\" now San Roque."
        ],
        [
            "In 1903 a formal grade school was opened which was the most important activity during the period.",
            "In the year 1906, Macrohon was reduced to a barrio of Maasin excluding Barrio San Roque, which was part of Malitbog.",
            "The new governor-general in accordance with the general reorganization plan instituted this in order to economize government expenditures by fusing small towns and provinces.",
            "When Mr. Bautista Kuizon became a member of the Maasin Municipal Council representing Macrohon, he noticed that the administration neglected Macrohon because of its distance from the poblacion.",
            "Salvador Demeterio brought a petition signed by only around twenty people who know how to read and write to the governor general.",
            "They changed the name of the town to Smith with the hope of getting favorable action from Governor Smith.",
            "But it was stipulated in the executive order approving the petition to retain the old name Macrohon."
        ],
        [
            "The executive order was implemented in 1907.",
            "Capitan Gerardo Kuizon was appointed municipal president."
        ],
        [
            "The next head of the municipality was the first elected municipal president, Mr. Bautista Kuizon.",
            "His knowledge on the democratic processes during the student days in Manila made him the most competent person to lay down the foundation of a real democratic government in the municipality.",
            "He implemented the separation of power between the church and state reminiscent of the Spanish Regime.",
            "He strictly practiced equally under the law and demonstrated it by not averting a fine meted on his own mother who happened to break a provision of an ordinance.",
            "He also succeeded to provide religious toleration in the town by extending protection to the propagator of new faiths such as the Protestants and the Aglipayan.",
            "By this, he got the ire of the parish priest and the church leaders, but he was able to regain their friendship and cooperation.",
            "Mr. Kuizon stayed in the office a little more than a year.",
            "He moved out to Mindanao and left the municipality to his vice, Mr. Ponciano Tallo."
        ],
        [
            "During the elections in 1912, Mr. Filomeno Demeterio was elected Municipal President of Macrohon.",
            "Under his leadership the town was reconstructed after it was hit by the most devastating typhoon in the town's history.",
            "He served two terms from 1913 to 1919.",
            "The period covering the First World War was a period of progress in Macrohon.",
            "The price of abaca was high and almost all vacant lots caused by the typhoon of 1912 were planted with abaca.",
            "A native son veteran Federico Gaviola, who served under the United States Army in France, represented the town at the war front.",
            "Mr. Trinidad Demeterio was elected to succeed his elder brother.",
            "He served for three consecutive terms from 1919 to 1927."
        ],
        [
            "The former Chief of Police, Mr. Felixberto Kuizon, was elected municipal president in 1929 and served the term from 1928 to 1930.",
            "Atty.",
            "Prisco Bitos occupied the office of the municipal president for two terms from 1931 to 1936.",
            "In his incumbency another cooperative marketing association was organized and sponsored by municipal government.",
            "It was only short-lived, but during its existence the association affected better price of abaca and copra.",
            "During the commonwealth government Mr. Tereso Kangleon became the first Municipal Mayor, starting 1936.",
            "He was serving his second term when the war broke out.",
            "When he fled in 1942, Mr. Tito Gloria Sr., his vice took over and was the one who met the Japanese occupation army to accept the Japanese sovereignty."
        ],
        [
            "In 1943, Mr. Tito Gloria, Sr. affiliated himself with the free Leyte government sponsored by the guerillas.",
            "The people chose Mr. Vicente Evarretta as caretaker of the town under the Japanese sponsored Independence."
        ],
        [
            "When the Second World War ended the elected mayor resumed his unfinished term.",
            "Mr. Tereso Kangleon was reelected for another term.",
            "He did not serve his term but rather gave the office to his vice mayor, Mr. Rafael Joven.",
            "He reconstructed the town, its public buildings, plazas and bridges.",
            "Again he was reelected in the next election from 1952 to 1955."
        ],
        [
            "Mr. Conrado Compendio was elected and served as municipal mayor for two terms from 1956 to 1963 where the municipal hall was constructed and completed.",
            "In 1957, three new barrios were created:"
        ],
        [
            "Ilihan - composed of the sitios of Ilihan Proper, Camalig, Sindangan, Gawisan, Guinabonan, Lunang, Mabanga and Danao"
        ],
        [
            "Villa Jacinta - composed of the sitios of Upper Villa Jacinta Proper, Peng-on, Mahayahay, Canodto, Laray, Luan, Santa Rosa and Camangahan"
        ],
        [
            "Lower Villa Jacinta - composed of the sitios of Lower Villa Jacinta Proper, Suba, Central, Babayon, Muldes, Boayahan and Pancil."
        ],
        [
            "Mayor Leonor O. Galdo, M.D.",
            "was installed into office by the election of 1963.",
            "He was reelected for a second term in 1967 until 1971.",
            "He was reelected again for two successive terms from 1988 to 1995.",
            "Dr. Caridad S. Evarretta was elected as mayor from 1995 to 1998.",
            "Mayor Fe Gaviola-Edillo was elected as mayor for three terms from 1998 to 2007."
        ],
        [
            "Her vice mayor, Manuel Boldo, was elected as mayor from 2007 to 2010."
        ],
        [
            "Fe Gaviola-Edillo won again as mayor in 2010."
        ],
        [
            "Until then, the mayor is Alan Jose Kuizon Aroy which term will end in 2022.",
            "After the election last May 9, 2022, he was then re-elected and is now the current mayor in Macrohon."
        ],
        [
            "Geography"
        ],
        [
            "The Municipality of Macrohon has a total land area of 12,639.47 hectares (31,232.8 acres).",
            "Of this area, 12,338.08 hectares or 97.61% is occupied by the 27 barangays, with Cambaro having the biggest area.",
            "About 301.39 hectares (2.38%) is occupied by the Poblacion, composed of three barangays namely Santo Rosario, San Vicente (Poblacion) and Santa Cruz.",
            "Rivers and creeks cross Macrohon; the most prominent ones are the Amparo River and Villa Jacinta River.",
            "Along the seacoast are coral reef and sand beaches."
        ],
        [
            "The town has varying contour elevations.",
            "The western portion along the seacoast comprises a level land.",
            "The rest of the land area has varying elevations ranging from gently sloping areas, land sloping in one general direction to steeply undulating and rolling land sloping in many directions."
        ],
        [
            "Macrohon's northern portion is bounded by the City of Maasin, the Municipality of Padre Burgos borders the southern portion and the Municipality of Malitbog borders the eastern portion and faces Mindanao Sea on the west.",
            "The town center is 13 kilometres (8.1 mi) away from Maasin City, which is the capital of Southern Leyte; and is 10 kilometres (6.2 mi) away from the town of Padre Burgos."
        ],
        [
            "Barangays"
        ],
        [
            "Macrohon is politically subdivided into 30 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aguinaldo"
        ],
        [
            "Amparo"
        ],
        [
            "Asuncion"
        ],
        [
            "Bagong Silang"
        ],
        [
            "Buscayan"
        ],
        [
            "Cambaro"
        ],
        [
            "Canlusay"
        ],
        [
            "Danao"
        ],
        [
            "Flordeliz"
        ],
        [
            "Guadalupe"
        ],
        [
            "Ichon"
        ],
        [
            "Ilihan"
        ],
        [
            "Laray"
        ],
        [
            "Lower Villa Jacinta"
        ],
        [
            "Mabini"
        ],
        [
            "Mohon"
        ],
        [
            "Molopolo"
        ],
        [
            "Rizal"
        ],
        [
            "Salvador"
        ],
        [
            "San Isidro"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente (Poblacion)"
        ],
        [
            "San Vicente (Upper San Roque)"
        ],
        [
            "Santa Cruz (Poblacion)"
        ],
        [
            "Santo Niño"
        ],
        [
            "Santo Rosario (Poblacion)"
        ],
        [
            "Sindangan"
        ],
        [
            "Upper Ichon (Lumbang)"
        ],
        [
            "Upper Villa Jacinta"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Macrohon, Southern Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "98(3.9)"
        ],
        [
            "82(3.2)"
        ],
        [
            "96(3.8)"
        ],
        [
            "71(2.8)"
        ],
        [
            "104(4.1)"
        ],
        [
            "129(5.1)"
        ],
        [
            "101(4.0)"
        ],
        [
            "94(3.7)"
        ],
        [
            "99(3.9)"
        ],
        [
            "135(5.3)"
        ],
        [
            "174(6.9)"
        ],
        [
            "143(5.6)"
        ],
        [
            "1,326(52.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.0"
        ],
        [
            "14.1"
        ],
        [
            "17.1"
        ],
        [
            "16.8"
        ],
        [
            "23.7"
        ],
        [
            "25.7"
        ],
        [
            "25.8"
        ],
        [
            "23.3"
        ],
        [
            "24.4"
        ],
        [
            "25.9"
        ],
        [
            "24.0"
        ],
        [
            "20.6"
        ],
        [
            "259.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MacrohonYearPop.±% p.a.1903 6,893—    1918 8,950+1.76%1939 12,196+1.48%1948 13,431+1.08%1960 14,786+0.80%1970 16,373+1.02%1975 17,694+1.57%1980 18,693+1.10%1990 20,416+0.89%1995 20,093−0.30%2000 23,102+3.04%2007 24,583+0.86%2010 25,386+1.18%2015 26,244+0.64%2020 26,580+0.25%Source: Philippine Statistics Authority"
        ],
        [
            "Religion"
        ],
        [
            "Majority of the population is Roman Catholic, while others belong to UCCP, The Church of Jesus Christ of Latter-Day Saints (Mormons), Seventh-Day Adventists, Iglesia ni Cristo, and Aglipayan Church, Hosanna Assembly of God, Assembly of God, among others."
        ],
        [
            "Macrohon, under the Roman Catholic Diocese of Maasin, is divided into three parishes, all under the Holy Child Vicariate of Malitbog, namely:"
        ],
        [
            "Mary Mediatrix of All Grace Parish, Barangay Ichon"
        ],
        [
            "St. Michael the Archangel Parish, Barangay San Vicente Poblacion"
        ],
        [
            "San Roque Parish, Barangay San Roque"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Macrohon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  25.90"
        ],
        [
            "2009  33.64"
        ],
        [
            "2012  35.56"
        ],
        [
            "2015  37.29"
        ],
        [
            "2018  23.17"
        ],
        [
            "2021  21.85"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Education"
        ],
        [
            "There are eight primary schools, eleven elementary schools and four secondary schools in the municipality of Macrohon.",
            "In the primary level, Cambaro Primary School with two teachers of which one is teaching Grades I & II and the other is teaching Grades III & IV.",
            "It is eight kilometers away from the highway and is not accessible by transportation.",
            "San Isidro Primary School is two and one-half (2½) kilometers away from the highway with two teachers.",
            "One teacher teaching Grade I while the other is teaching Grades II & III.",
            "One can reach the place by riding on a single motorcycle but most inhabitants want to walk because the road is not well developed.",
            "Of the Primary schools only two schools are complete namely: Molopolo Primary School and Aguinaldo Primary School.",
            "Both have four teachers.",
            "The rest of the primary schools are along the highway."
        ],
        [
            "Salvador Elementary School with seven teachers is also eight kilometers away from the highway and is not accessible by transportation.",
            "Ilihan Elementary School is four and one-half (4 ½) kilometers away from the highway with six teachers .",
            "This is accessible by land transportation.",
            "Of the eleven elementary schools only Mabini Elementary School with six teachers is under the supervision and administration of a lead teacher with a sphere/cluster where it belongs.",
            "Four elementary schools are under the supervision and administration of a principal, five, with teacher and two with teacher in-charge."
        ],
        [
            "In the Secondary level, two are private schools, one is a national vocational high school and two are public/national high schools.",
            "These are:"
        ],
        [
            "Macrohon Institute (MACI), Inc."
        ],
        [
            "MACI-Jose K. Demeterio Learning Foundation, Inc. (MACI-JKD/MACI Foundation/JKD)"
        ],
        [
            "Villa Jacinta National Vocational High School (VJNVHS)"
        ],
        [
            "San Roque National High School (SRNHS)"
        ],
        [
            "Ichon National High School (INHS)"
        ],
        [
            "Tourism"
        ],
        [
            "Statue of Our Lady of Fatima at the Fatima Hills in Barangay Ichon."
        ],
        [
            "An aerial view of the Molopolo-Santa Cruz Marine Sanctuary as seen in April 2022, Macrohon, Southern Leyte, Philippines"
        ],
        [
            "Fatima Hills, Barangay Ichon"
        ],
        [
            "Cambaro Caves, Barangay Cambaro"
        ],
        [
            "Macrohon Park and Plaza, Barangay San Vicente (Poblacion)"
        ],
        [
            "Amparaiso Beach Resort and Amparaiso Hotel, Barangay Amparo"
        ],
        [
            "Manaya Beach Resort, Barangay Asuncion"
        ],
        [
            "Seven Falls, Barangay San Roque"
        ],
        [
            "Lapyahan sa BEC, Barangay San Vicente (Poblacion)"
        ],
        [
            "Punta Beach Resort, Barangay Flordeliz"
        ],
        [
            "Southern Leyte Dive Resort, Barangay San Roque"
        ],
        [
            "Cristina White Beach Resort, Barangay Ichon"
        ],
        [
            "Tatay Ade Beach Resort, Barangay Buscayan"
        ],
        [
            "Mibulos Beach on the Rock, Barangay Canlusay"
        ],
        [
            "Banahaw Spring, Barangay San Joaquin"
        ],
        [
            "Marine Park and Fish Sanctuary, Barangay Santa Cruz-Molopolo"
        ],
        [
            "Florencia Island, Barangay Molopolo"
        ],
        [
            "Municipal Hall, Barangay San Vicente (Poblacion)"
        ],
        [
            "Kuting Reef Resort and Spa, Barangay Asuncion"
        ],
        [
            "Culture"
        ],
        [
            "Manhaon festival"
        ],
        [
            "Macrohon Park, at Barangay San Vicente (Poblacion)"
        ],
        [
            "The Manhaon Festival is the municipality's cultural and historical festival, which used to be celebrated during the Town Fiesta, September 29, but now celebrated during the Founding Anniversary of the Municipality, October 31."
        ],
        [
            "The name comes from the word \"mang-haon\" meaning \"to remove cooked food\", from the word \"haon\" meaning \"to pick up pots after cooking something\"."
        ],
        [
            "Moro raiders, usually arriving at dusk, surprise the coastal dwellers which force them to hide in tall bushes.",
            "The Moros would then get their food, thus the name \"Manhaon\".",
            "The term thus believed where the name of the town was derived."
        ],
        [
            "The 2006 Manhaon Festival Contest was celebrated on Sept. 29, 2006, at the spacious Municipal Plaza.",
            "Tribu ng Maasin garnered first place, Concepcion National High School (from the town of Malitbog) second and Macrohon Institute (MACI), Inc.  third."
        ],
        [
            "During the 150th Founding Anniversary of Macrohon, October 31, 2010, the Manhaon Festival Contest took place, again, at the Municipal Plaza.",
            "This time around, the five high schools located within the Municipality of Macrohon each sent a contingent to the competition, and the results were:"
        ],
        [
            "Second Runner-Up — Villa Jacinta National Vocational High School"
        ],
        [
            "First Runner-Up — Ichon National High School (also won Best in Street Dancing)"
        ],
        [
            "Champion — Macrohon Institute (MACI), Inc."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Macrohon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Creating Certain Barrios in the Municipality of Macrohon, Province of Leyte\".",
            "LawPH.com.",
            "Retrieved 2011-04-12."
        ],
        [
            "^"
        ],
        [
            "\"Macrohon, Southern Leyte : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 13 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Southern Leyte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Macrohon."
        ],
        [
            "Macrohon Profile at PhilAtlas.com"
        ],
        [
            "The Official Website of Macrohon"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Macrohon Info Website"
        ],
        [
            "Places adjacent to Macrohon"
        ],
        [
            "Maasin"
        ],
        [
            "Malitbog"
        ],
        [
            "Bohol Sea"
        ],
        [
            "Macrohon"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Bohol Sea"
        ],
        [
            "vte Province of Southern LeyteMaasin (capital and largest city)Municipalities"
        ],
        [
            "Anahawan"
        ],
        [
            "Bontoc"
        ],
        [
            "Hinunangan"
        ],
        [
            "Hinundayan"
        ],
        [
            "Libagon"
        ],
        [
            "Liloan"
        ],
        [
            "Limasawa"
        ],
        [
            "Macrohon"
        ],
        [
            "Malitbog"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pintuyan"
        ],
        [
            "Saint Bernard"
        ],
        [
            "San Francisco"
        ],
        [
            "San Juan"
        ],
        [
            "San Ricardo"
        ],
        [
            "Silago"
        ],
        [
            "Sogod"
        ],
        [
            "Tomas Oppus"
        ],
        [
            "Component City"
        ],
        [
            "Maasin"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Macrohon&oldid=1187100848\""
        ],
        [
            "Category: Municipalities of Southern LeyteHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from March 2009All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using infobox settlement with unknown parametersArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link is on WikidataPages using the Kartographer extension"
        ]
    ]
}