{
    "name": "Madrid",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Madrid, Surigao del Sur"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°15′43″N 125°57′53″E﻿ / ﻿9.2619°N 125.9647°E﻿ / 9.2619; 125.9647"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Surigao del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Madrid, Surigao del Sur\" – news · newspapers · books · scholar · JSTOR (April 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Caraga, PhilippinesMadridMunicipalityMunicipality of Madrid"
        ],
        [
            "FlagMap of Surigao del Sur with Madrid highlightedOpenStreetMapMadridLocation within the PhilippinesCoordinates: 9°15′43″N 125°57′53″E﻿ / ﻿9.2619°N 125.9647°E﻿ / 9.2619; 125.9647CountryPhilippinesRegionCaragaProvinceSurigao del SurDistrict"
        ],
        [
            "1st districtFoundedFebruary 2, 1953Named forMadrid, SpainBarangays14"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 106.6 million (2020) • Assets₱ 236.9 million (2020) • Expenditure₱ 104 million (2020) • Liabilities₱ 77.42 million (2020)Service provider • ElectricitySurigao del Sur 2 Electric Cooperative (SURSECO 2)Time zoneUTC+8 (PST)ZIP code8316PSGC166813000IDD : area code +63 (0)86Native languagesSurigaonon Agusan Cebuano Tagalog"
        ],
        [
            "Madrid, officially the Municipality of Madrid (Surigaonon: Lungsod nan Madrid; Tagalog: Bayan ng Madrid), is a 4th class municipality in the province of Surigao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 16,653 people."
        ],
        [
            "Etymology"
        ],
        [
            "Madrid was named after the capital city of Spain, Madrid.",
            "It has 14 barangays and two comprising the Poblacion: Linibunan and Quirino."
        ],
        [
            "History"
        ],
        [
            "The early beginning of the history of Madrid is described to be a typical one of a community development on the edge of a river, this river is presently called Carac-an and said to be once abundant of fish, shrimps, and other creatures, which served as are reliable source of food for the early inhabitants.",
            "The river runs in the Southern boundary of the municipality and it is now the main source of irrigation water supplying all irrigable lands of Madrid and the neighboring municipality of Cantilan."
        ],
        [
            "The original name of Madrid was “Linibunan” a Visayan term describing a place covered by soil deposits which has been transported by force of nature.",
            "Linibunan came to be settled with more people when the Carac-an River gradually changed its course."
        ],
        [
            "The growing community of Linibunan had been the object concern of the Municipality of Cantilan being parts of the territorial jurisdiction.",
            "Having recognized Linibunan to attain the qualification of a barrio, the Municipality Government of Cantilan, granted its creation as a barrio in the year 1911."
        ],
        [
            "Religion, particularly Roman Catholic, had been the predominated the spiritual life of the people from the beginning and to the presents.",
            "The Catholic faith had been nurtured through the years under the administration of the missionary center, which was established in the year 1951.",
            "There were no recorded obstacles in the propagation and preservation of the Catholic faith for the fact that most Visayans composing the majority of the inhabitants were Catholic."
        ],
        [
            "On June 13, 1913, the missionary authorities in Cantilan created the parish in Linibunan and assigned a parish priest named Fr.",
            "Garcia.",
            "Father Garcia contributed significantly to the historical making of the Municipality of Madrid, because he was responsible for changing the name Linibunan to Madrid, after the capital city of Spain.",
            "From then on, church documents bore the name Madrid Parish and gradually the name Linibunan became extinct.",
            "The name Madrid was officially recognized as the name of a new Municipality of Cantilan as embodied in Executive Order No.",
            "561, dated February 2, 1953."
        ],
        [
            "The Municipality of Madrid was once a part of Cantilan town.",
            "It was only declared Municipality on February 2, 1953.",
            "Madrid is blessed to have the Carac-an River.",
            "This River serves as the main source of sand and gravel to the entire CarCanMadCarLan region, as well as its watershed.",
            "Carac-an River will soon be a major source of power via the proposed construction of a mini hydropower plant.",
            "It is also a popular site for camping, and the provincial jamboree is often held here.",
            "One of the longest bridges in Mindanao is also located here."
        ],
        [
            "Christianity first came into this part of Mindanao when in 1598, a Portuguese ship under Captain Francisco de Castro accidentally drifted into the east coast of Mindanao, part of the third district known as the District of Caraga which covered the present provinces of Surigao del Sur, Surigao del Norte, Agusan Provinces and a part of Davao.",
            "On board the ship were two Jesuit missionaries, Fr.",
            "Valerio Ledesma, S.J., and Manuel Marino, a lay brother, who preached the gospel and baptized the inhabitants.",
            "But, it was only in 1596 that the first batch of Jesuit missionaries stationed themselves permanently in Butuan, at the town of Buenavista, and from there, they established mission posts in nearby areas.",
            "They were followed by the Recollects and then by the Benedictines."
        ],
        [
            "The first center of Christianity in this part of Mindanao was Tandag, which was established in 1622; Siargao in 1623; Bislig in 1624; Surigao in 1754 and in Cantilan in 1851."
        ],
        [
            "When Cantilan was established as the first center of missionary activity in 1851, Madrid was only a remote small sitio of Cantilan with few scattered houses.",
            "The small group of inhabitants in the area kept on clearing the land and planted it with various crops, predominantly rice.",
            "As a result of their hard and painstaking labor, the land became livable.",
            "The fertility of the soil and the proximity of the river began to attract people from the nearby places.",
            "Years after, they organized themselves and declared independence from the municipality of Cantilan."
        ],
        [
            "Notable pioneers in the region were Rufino Urbiztondo, Cosme Frias, Andres Roy, Jorge Arpilleda, Antonio Malayao, Antonio Taguines, Geronimo Rubi, Isidro Uriarte, Enrique Guillen, Pedro Uriarte, Tomas Frias, Andres Arnan, Mariano Cuartero, and others.",
            "The settlement continued to attract people; his constant coming of immigrants and intermarriages among inhabitants increased considerably the population until finally, the local leaders found it for to convert the sitio into a barrio.",
            "Under the leadership of Rufino Urbiztondo, Linibunan, as the place was known, became a barrio of Cantilan with him as its first Teniente del Barrio.",
            "Linibunan means \"water-covered lowland\".",
            "Digging around the place will attest to the fact that the topsoil in the area was deposited by floodwaters during the rainy season."
        ],
        [
            "The early inhabitants of the place were religious people.",
            "Most of them were Christian and the missionaries based in Cantilan who visited the barrio once in a while to attend to their religious needs.",
            "In 1901, the people thought of Christianizing the name of their barrio.",
            "Fr.",
            "Paulino Garcia who was then the parish priest of Cantilan and a Spaniard by nationality, suggested that the barrio be named Madrid reminiscing of the Spanish capital.",
            "The people readily accepted the suggestion and since then, Linibunan was changed to Madrid."
        ],
        [
            "For a decade, progress seemed slow, but then immigrants from other neighboring islands came, especially from Bohol, seeking good fortune in the reputed Land of Promise.",
            "A handful of Chinese came and engaged in business and trade with the natives.",
            "Due to its favorable geographical location, Madrid became the center of trade and commerce in the area.",
            "With the rapid growth of commerce and trade, population also increased.",
            "Business enterprises boomed and people started making permanent residences in the town.",
            "Then the local leaders became aware that Madrid can now qualify into a municipality.",
            "Headed by then Teniente del Barrio Sotero Irrizari, the Barrio Council and other Civic Leaders passed a resolution asking the President of the Philippines to elevate Madrid into a municipality.",
            "With the help of the Provincial Board, the cherished dream of the people of Madrid become a reality when President Elpidio Quirino issued Executive Order No.",
            "561 making Madrid as one of the municipalities of Surigao del Sur on February 2, 1953.",
            "The municipality was inaugurated on July 4, 1953, amidst great splendor."
        ],
        [
            "It maybe well to mention that when Madrid became a municipality on February 2, 1953, by virtue of Executive Order 561, there was some kind of controversy as to who will be the first mayor.",
            "However, a long and protracted legal battle, the courts settled the controversy and proclaimed Guillermo Arpilleda as the first mayor of Madrid."
        ],
        [
            "Geography"
        ],
        [
            "The municipality of Madrid lies in the northern part of the province, in the cluster known as CarCanMadCarLan area.",
            "It is bounded in the east by the Pacific Ocean, the Diwata Mountain in the west, the municipality of Cantilan in the north and Lanuza in the South.",
            "It is about 56 kilometres (35 mi) from the capital town of Tandag, the seat of the provincial government of Surigao del Sur, and 130 kilometres (81 mi) from the city of Surigao.",
            "Madrid is a narrow land along the coast of Surigao del Sur with an area of 14,122 hectares (34,900 acres), representing 3.17 per cent of the province total land area of 445,216 hectares."
        ],
        [
            "Soil type"
        ],
        [
            "Madrid has four kinds of soil type.",
            "Of the total land area, mountain soil undifferentiated comprises 9,413 hectares or 66.65 percent; San Manuel silt loam with 4,617 hectares or 32.69 percent; Matho loam has an area of 62 hectares and 30 hectares of Kabatohan loam."
        ],
        [
            "Slope"
        ],
        [
            "Approximately 5,210 hectares or 36.89 percent of the total land area is classified under 0–3% slope; 406 hectares or 2.87 percent under 3–5% slope; 1,009 hectares or 7.15 percent under 5–8% slope; 1,283 hectares or 9.09 percent under 8–15% slope and 6,214 hectares or 44.00 percent falls under 15%- above slope classification."
        ],
        [
            "Barangays"
        ],
        [
            "Madrid is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Bagsac (created in 1955)"
        ],
        [
            "Bayogo"
        ],
        [
            "Linibonan (Poblacion)"
        ],
        [
            "Magsaysay"
        ],
        [
            "Manga"
        ],
        [
            "Panayogon"
        ],
        [
            "Patong Patong"
        ],
        [
            "Quirino (Poblacion)"
        ],
        [
            "San Antonio"
        ],
        [
            "San Juan"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Songkit"
        ],
        [
            "Union"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Madrid"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28.7(83.7)"
        ],
        [
            "29.0(84.2)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "30.9(87.6)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.2(88.2)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "29.3(84.7)"
        ],
        [
            "30.7(87.2)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "25.5(77.9)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "26.1(79.0)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "26.0(78.8)"
        ],
        [
            "26.8(80.3)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.3(72.1)"
        ],
        [
            "22.2(72.0)"
        ],
        [
            "22.5(72.5)"
        ],
        [
            "23.0(73.4)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "23.0(73.4)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "23.1(73.5)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "881(34.7)"
        ],
        [
            "733(28.9)"
        ],
        [
            "576(22.7)"
        ],
        [
            "397(15.6)"
        ],
        [
            "243(9.6)"
        ],
        [
            "169(6.7)"
        ],
        [
            "147(5.8)"
        ],
        [
            "132(5.2)"
        ],
        [
            "147(5.8)"
        ],
        [
            "223(8.8)"
        ],
        [
            "496(19.5)"
        ],
        [
            "730(28.7)"
        ],
        [
            "4,874(192)"
        ],
        [
            "Source: Climate-Data.org"
        ],
        [
            "Madrid has a tropical rainforest climate (Af) with heavy to very heavy rainfall year-round and with extremely heavy rainfall in from December to February."
        ],
        [
            "Demography"
        ],
        [
            "Population census of MadridYearPop.±% p.a.1960 8,198—    1970 11,059+3.04%1975 10,627−0.80%1980 12,518+3.33%1990 12,977+0.36%1995 12,992+0.02%2000 14,066+1.72%2007 14,957+0.85%2010 14,888−0.17%2015 15,223+0.42%2020 16,653+1.78%Source: Philippine Statistics Authority"
        ],
        [
            "Population trend"
        ],
        [
            "The alluring Town of Madrid was once a barrio of Cantilan.",
            "It was created into a municipality on February 2, 1953, by virtue of the Executive Order No.",
            "561.",
            "As early as the 1950s settlements was so vibrant for such reason as it was separated from Cantilan.",
            "Data shows that upon the conduct of 1960 census, the town posted 8198 people.",
            "The population grew at the average growth rate of 3.038 percent, and the 1970 census recorded a total of 11,059 people.",
            "A sudden drop in population was experienced, with the 1975 census counting 10,627 people, the lowest among the recorded censuses.",
            "The decrease in population was attributed to an insurgency in the hinterland barangays of Madrid.",
            "Peace and order was slightly stabilized in the 1980s, resulting in an increase in population at 3.329 percent growth rate.",
            "The 1980s were a highly productive decade wherein agricultural activities, and therefore the population, increase.",
            "As younger generations leave in search of better academic pursuits, the average growth rate has leveled at 0.023 percent, and population growth models predict an average of 15 people added annually to the total municipal population."
        ],
        [
            "Age and sex structure"
        ],
        [
            "More than 53 percent of the total municipal population falls within age-bracket of 15 to 64 years old and more than 40 percent of the total population is between 1 and 14 years old, with only about 5 percent of the population over 65 years of age.",
            "According to the 1995 census, there were 97 males for every 100 females."
        ],
        [
            "Marital status"
        ],
        [
            "More than 72 percent of the total municipal population belongs to the age bracket of more than 10 years old or it can be expressed numerically as 9,456 people.",
            "More than 53 percent of the household population ages more than 10 years old are legally married.",
            "It can be noted that there were more female population who are legally married than the male population by 51 percent.",
            "Married population is concentrated between the age-bracket of 25 to 34 years old and this suggest for a higher fertility and an expected population growth.",
            "On the other hand, single individuals comprised 41 percent of the total population.",
            "For 3880 single individuals, males dominated this status than the females.",
            "Single population group concentrated between the age-bracket of 10 to 19 years old and slowly declining towards 20 years and more.",
            "More than 6 percent of the remaining population ages more than 10 years old belonged to widow, separated/divorced, common law/live-in and others."
        ],
        [
            "Language"
        ],
        [
            "There are four major dialects been spoken in the town.",
            "More than 97 percent of the total household population speak Surigaonon.",
            "More than 1.8 percent speak Manobo."
        ],
        [
            "Religion"
        ],
        [
            "The town is dominated by Roman Catholic by more than 87 percent.",
            "There are other religious sects present in the area as such Aglipayans, Iglesia ni Cristo, UCCP, Islam and other Protestants groups."
        ],
        [
            "Labor force"
        ],
        [
            "About 8,434 people who are considered as productive population ages more than 15 years old, more than 63 percent are in the labor force.",
            "More than 92 percent of the household populations who are in the labor force are employed and roughly 8 percent are considered as unemployed.",
            "The remaining 36 percent of the total household population considered as productive individuals are not in the labor force."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Madrid"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  25.00"
        ],
        [
            "2009  32.97"
        ],
        [
            "2012  20.81"
        ],
        [
            "2015  30.52"
        ],
        [
            "2018  21.46"
        ],
        [
            "2021  23.29"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Madrid is not identified as a major tourist destination of the Province of Surigao del Sur due to the lack of existing attractions, facilities and amenities.",
            "Tourism related activities have never been developed nor given as top priority project because of strong competition from the neighboring towns.",
            "Despite the limited contribution of tourism industry to the local economy, the town possesses different scenic spots awaiting for development, such as the following:"
        ],
        [
            "Bayogo Cave;"
        ],
        [
            "Panlangagan Cave;"
        ],
        [
            "Panlangagan Heights and NIA Dam;"
        ],
        [
            "Wild and exotic beach facing the Pacific Ocean at Barangay Daan Union;"
        ],
        [
            "Man-made attraction, the Carac-an bridge (the second longest bridge in Mindanao at 510 meters long) that serves as a landmark prior to entering the municipality;"
        ],
        [
            "The Bayogo Irrigation Dam, that serves as the life-blood for agriculture;"
        ],
        [
            "The ancestral homes and ruins of antique houses which are of historical significance at Daan Union;"
        ],
        [
            "The Carac-an River, one of the cleanest rivers in Mindanao;"
        ],
        [
            "Daan Union Fish Cage and Pen;"
        ],
        [
            "Lib-og Beach Resort at Daan Union."
        ],
        [
            "All of these mentioned attractions do not have acceptable facilities and utilities except for some native cottages available at the beaches.",
            "Most of the identified tourist spots do not have accessibility.",
            "Transportation and mobility is one of the major problems that prevents visits from local and foreign visitors."
        ],
        [
            "Education"
        ],
        [
            "There are 2 levels of education present in Madrid namely, elementary and secondary educational level only.",
            "Higher education or college school can be availed in Cantilan but most of the local students prefer to study in Cebu or neighboring provinces."
        ],
        [
            "There are 12 complete elementary schools and 1 primary school in Madrid located in every barangay of the town.",
            "Each school varies from one to another in terms of facilities and area of school site.",
            "Patong-Patong Elementary School has the largest area of more than 1.7 hectares while Magsaysay Elementary School has less than a half-hectare in area.",
            "Madrid Central Elementary School has the most number of school facilities to include shop, library, administrative office, clinic, comfort rooms, playground and science room, while the rest of the elementary schools do have 2 to 3 facilities available."
        ],
        [
            "Highest educational attainment"
        ],
        [
            "More than 95 percent of the household population of more than 10 years old are literate and the prevalence of illiteracy of the town barely reaches 5 percent.",
            "For a total of 11,023 population ages more than 5 years old, it was noted that 2.8 percent of the population do not have any grade completed.",
            "Another 1.9 percent has completed pre-school and more than 56 percent completed elementary education.",
            "There are 25 percent of the populations having high school education and only 48 percent of that completed their high school education.",
            "There are 218 individuals who have a post secondary education and only 6 percent of that is still undergrads.",
            "There are 763 individuals who are college undergrads while 494 are academic degree holders and only an estimated of 16 individuals who have past baccalaureate as the highest grade completed."
        ],
        [
            "Healthcare"
        ],
        [
            "There are 327 registered births in Madrid for the year 2000 placing the Crude Birth Rate (CBR) at 23 per 1000 population.",
            "Using the current population of 14,066 mortality or deaths reported during the year was 90.",
            "40 of which are females and 50 males and 8 of those deaths are infants.",
            "No maternal death was reported.",
            "CDR (Crude Death Rate) for the year was recorded at 6 per 1,000 population.",
            "Leading causes of deaths are Pneumonia, Hypertensive Vascular Diseases, Pulmonary Tuberculosis, Cancer and Accidents.",
            "Leading causes of morbidity for the also include Pneumonia, Bronchitis, PTB, Hypertension and Diarrhea."
        ],
        [
            "Health personnel"
        ],
        [
            "There are 9 personnel manning the Municipal Health Office, 1 Physician (Municipal Health Officer), 1 Public Health Nurse, 1 Medical Technologists, 4 Midwives and 2 Sanitary Inspectors.",
            "The Municipal Health Office is backed up by the presence of Madrid District Hospital located in the poblacion, which serves as its core referral hospital."
        ],
        [
            "Nutrition - Madrid has a very high incidence of malnutrition in the year 2000 with a prevalence rate of 6.6.",
            "Out of the 2,665 preschool children weighed, 20 were severely underweight, 156 moderately underweight and 917 mildly underweight."
        ],
        [
            "Waste management"
        ],
        [
            "The manner of garbage disposal in the area varies from one barangay to the other.",
            "The most common are burning, burying and composting.",
            "Ninety percent (90) of the 2,862 households have sanitary toilets of which 6.6 percent are of unsanitary type and 3.4 percent without toilet.",
            "Eighty one percent (81%) has access safe water supply while 18.7 percent has doubtful source."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Madrid |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"An Act to Create the Barrio of Bagsac in the Municipality of Madrid, Province of Surigao\".",
            "LawPH.com.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ \"Climate: Madrid\".",
            "Climate-Data.org.",
            "Retrieved October 26, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Caraga\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Caraga\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Surigao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Madrid Profile at PhilAtlas.com"
        ],
        [
            "Madrid Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Madrid, Surigao del Sur"
        ],
        [
            "Cantilan"
        ],
        [
            "Sibagat, Agusan del Sur"
        ],
        [
            "Madrid"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Carmen"
        ],
        [
            "vte Province of Surigao del SurTandag (capital)Municipalities"
        ],
        [
            "Barobo"
        ],
        [
            "Bayabas"
        ],
        [
            "Cagwait"
        ],
        [
            "Cantilan"
        ],
        [
            "Carmen"
        ],
        [
            "Carrascal"
        ],
        [
            "Cortes"
        ],
        [
            "Hinatuan"
        ],
        [
            "Lanuza"
        ],
        [
            "Lianga"
        ],
        [
            "Lingig"
        ],
        [
            "Madrid"
        ],
        [
            "Marihatag"
        ],
        [
            "San Agustin"
        ],
        [
            "San Miguel"
        ],
        [
            "Tagbina"
        ],
        [
            "Tago"
        ],
        [
            "Component cities"
        ],
        [
            "Bislig"
        ],
        [
            "Tandag"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Germany"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Madrid,_Surigao_del_Sur&oldid=1213468854\""
        ],
        [
            "Categories: Municipalities of Surigao del SurPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Articles needing additional references from April 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles with VIAF identifiersArticles with GND identifiersPages using the Kartographer extension"
        ]
    ]
}