{
    "name": "Magallanes",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Magallanes, Agusan del Norte"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°01′N 125°31′E﻿ / ﻿9.02°N 125.52°E﻿ / 9.02; 125.52"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Agusan del Norte, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Magallanes, Agusan del Norte\" – news · newspapers · books · scholar · JSTOR (April 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Caraga, PhilippinesMagallanesMunicipalityMunicipality of MagallanesFrom top, left to right: Aerial view; Nuestra Senora del Rosario Parish; Municipal and SB Hall"
        ],
        [
            "FlagSealMap of Agusan del Norte with Magallanes highlightedOpenStreetMapMagallanesLocation within the PhilippinesCoordinates: 9°01′N 125°31′E﻿ / ﻿9.02°N 125.52°E﻿ / 9.02; 125.52CountryPhilippinesRegionCaragaProvinceAgusan del NorteDistrict"
        ],
        [
            "2nd districtFounded21 June 1969Named forHispanized surname of Ferdinand MagellanBarangays8"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorCesar C. Cumba • Vice MayorDemosthenes H. Arabaca • RepresentativeMa.",
            "Angelica Amante-Matba • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Martina A. CastrodesDiomiel A. BasnigRolando C. DaparMarilou M. CumbaMeriam G. PagaranLeah Georgette B. AmodiaAmanoden A. MulokJames M. dela Fuerta Sr."
        ],
        [
            " • Electorate16,774 voters (2022)Area • Revenue₱ 104.8 million (2020) • Assets₱ 349.6 million (2020) • Expenditure₱ 117.5 million (2020) • Liabilities₱ 66.64 million (2020)Service provider • ElectricityAgusan del Norte Electric Cooperative (ANECO)Time zoneUTC+8 (PST)ZIP code8604PSGC160208000IDD : area code +63 (0)85Native languagesAgusan Butuanon Cebuano Higaonon TagalogWebsitewww.magallanesadn.gov.ph"
        ],
        [
            "Magallanes, officially the Municipality of Magallanes (Cebuano: Lungsod sa Magallanes; Tagalog: Bayan ng Magallanes),  is a 4th class municipality in the province of Agusan del Norte, Philippines.",
            "According to the 2020 census, it has a population of 22,293 people."
        ],
        [
            "The municipality was named after the Hispanized surname of the Portuguese-born maritime explorer Ferdinand Magellan.",
            "Formerly part of Butuan, Magallanes was created as a municipality on June 21, 1969, through Republic Act 5660."
        ],
        [
            "Geography"
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 44.31 square kilometres (17.11 sq mi)  constituting 1.62% of the 2,730.24-square-kilometre- (1,054.15 sq mi) total area of Agusan del Norte."
        ],
        [
            "The topography of the land is mostly flat and rolling, surrounded by mountains.",
            "Swamps characterize much of the landscape that is situated at the mouth of the two major rivers in the province, the Agusan and Baug Rivers."
        ],
        [
            "The elevation of most of lands is 2 feet (0.61 m) below sea level.",
            "The town center is in the river delta and has to be kept protected by dikes.",
            "The land gradually rises in the north-west to the 99-metre- (325 ft) high Mount Taod-oy at barangay Taod-oy and the 162-metre- (531 ft) high Mount Panaytayon."
        ],
        [
            "Around 2,834.89 hectares (7,005.2 acres) of Magallanes lands have slope of 0 to 3 percent, 399.28 hectares (986.6 acres) have 8 to 18 percent, 1,497.30 hectares (3,699.9 acres) 18 to 30 percent and 250.53 hectares (619.1 acres) 30 to 50 percent."
        ],
        [
            "Hydrosol, San Miguel Loam, San Miguel Clay Loam, Malalag Silt Loam and Butuan Loam are its soil types.",
            "Upper Miocene, Cretaceous-Paleogene and recent sedimentary materials are the rock elements that make up Magallanes lands."
        ],
        [
            "Land use"
        ],
        [
            "Of its total land area, 4,109 hectares (10,150 acres) are classified as alienable and disposable.",
            "The other 882 hectares (2,180 acres) are forestlands.",
            "149.95 hectares (370.5 acres) or 3 percent is built-up, 92.26 hectares (228.0 acres) of that for social facilities and the other 59.69 hectares (147.5 acres) for roads.",
            "Around 3,210.72 hectares (7,933.9 acres) or 64.33 percent of its lands are utilized for agriculture, the other 1,630.33 hectares (4,028.6 acres) or 33.20 percent, for forest use.",
            "Four hectares are also being utilized for tourism in special use.",
            "Within the agricultural area, 1,727.63 hectares (4,269.1 acres) are under CARP coverage."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Magallanes, Agusan del Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "277(10.9)"
        ],
        [
            "211(8.3)"
        ],
        [
            "155(6.1)"
        ],
        [
            "109(4.3)"
        ],
        [
            "166(6.5)"
        ],
        [
            "191(7.5)"
        ],
        [
            "154(6.1)"
        ],
        [
            "138(5.4)"
        ],
        [
            "127(5.0)"
        ],
        [
            "173(6.8)"
        ],
        [
            "241(9.5)"
        ],
        [
            "231(9.1)"
        ],
        [
            "2,173(85.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "22.7"
        ],
        [
            "19.1"
        ],
        [
            "20.0"
        ],
        [
            "19.9"
        ],
        [
            "25.9"
        ],
        [
            "27.6"
        ],
        [
            "27.6"
        ],
        [
            "26.1"
        ],
        [
            "25.1"
        ],
        [
            "26.8"
        ],
        [
            "24.3"
        ],
        [
            "23.2"
        ],
        [
            "288.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Magallanes is generally outside the \"typhoon belt\".",
            "Its climate is, by Philippine classification, Type II.",
            "There is no definite dry season in the area.",
            "Maximum rain is from November to January.",
            "Lying within the eastern coast, the place is within the pathway north-east monsoons, trade winds and storms."
        ],
        [
            "Barangays"
        ],
        [
            "Magallanes is politically subdivided into eight barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 160208001   Buhang"
        ],
        [
            " 17.4%"
        ],
        [
            " 3,878"
        ],
        [
            " 4,021"
        ],
        [
            "  ▾"
        ],
        [
            " −0.36%"
        ],
        [
            " 160208002   Caloc-an"
        ],
        [
            " 19.6%"
        ],
        [
            " 4,369"
        ],
        [
            " 4,154"
        ],
        [
            "  ▴"
        ],
        [
            " 0.51%"
        ],
        [
            " 160208003   Guiasan"
        ],
        [
            " 6.6%"
        ],
        [
            " 1,467"
        ],
        [
            " 1,166"
        ],
        [
            "  ▴"
        ],
        [
            " 2.32%"
        ],
        [
            " 160208009   Marcos"
        ],
        [
            " 16.3%"
        ],
        [
            " 3,639"
        ],
        [
            " 3,824"
        ],
        [
            "  ▾"
        ],
        [
            " −0.49%"
        ],
        [
            " 160208005  Poblacion"
        ],
        [
            " 8.4%"
        ],
        [
            " 1,876"
        ],
        [
            " 1,930"
        ],
        [
            "  ▾"
        ],
        [
            " −0.28%"
        ],
        [
            " 160208010   Santo Niño"
        ],
        [
            " 7.5%"
        ],
        [
            " 1,663"
        ],
        [
            " 1,741"
        ],
        [
            "  ▾"
        ],
        [
            " −0.46%"
        ],
        [
            " 160208011   Santo Rosario"
        ],
        [
            " 12.4%"
        ],
        [
            " 2,764"
        ],
        [
            " 3,189"
        ],
        [
            "  ▾"
        ],
        [
            " −1.42%"
        ],
        [
            " 160208008   Taod-oy"
        ],
        [
            " 6.1%"
        ],
        [
            " 1,351"
        ],
        [
            " 1,456"
        ],
        [
            "  ▾"
        ],
        [
            " −0.75%"
        ],
        [
            "Total"
        ],
        [
            "22,293"
        ],
        [
            "21,481"
        ],
        [
            " ▴"
        ],
        [
            "0.37%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MagallanesYearPop.±% p.a.1970 7,377—    1975 11,412+9.14%1980 15,994+6.98%1990 16,211+0.13%1995 17,523+1.47%2000 19,895+2.76%2007 20,930+0.70%2010 21,481+0.95%2015 21,007−0.42%2020 22,293+1.18%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Magallanes had a population of 22,293.",
            "The population density was 500 inhabitants per square kilometre (1,300/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Magallanes"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  34.20"
        ],
        [
            "2009  28.59"
        ],
        [
            "2012  25.85"
        ],
        [
            "2015  30.81"
        ],
        [
            "2018  20.97"
        ],
        [
            "2021  31.37"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Public Market"
        ],
        [
            "The town has two plywood manufacturing firms: EMCO (Barangay Santo Rosario) and PSPI (Barangay Marcos), and one safety matches manufacturing firm: JAKA Equities Corp (Barangay Marcos).",
            "The three manufacturing plants are all on the main street and operating near the Baug River and Agusan River."
        ],
        [
            "A 2,000-hectare (4,900-acre) of prawn/shrimp farm in Magallanes used to be the Philippines' top exporter of first class prawn/shrimp to Japan, until the entire farm was hit by a white spot disease in 2001 leading to the collapse of the industry."
        ],
        [
            "Tourism"
        ],
        [
            "The large branches of the Bitaug was broke according to the residence near at the tree on June 23, 2017"
        ],
        [
            "Philippine Centennial Tree"
        ],
        [
            "The Department of Environment and Natural Resources (DENR) awarded Magallanes as the place that host the Oldest Tree (more than 500 years old) in the Philippines called Bitaug."
        ],
        [
            "Lisagan Festival"
        ],
        [
            "Magallanes celebrates its annual fiesta every third Saturday of October in honor of patroness Nuestra Señora del Rosario, Our Lady of the Rosary, which includes thanksgiving mass, parades and more."
        ],
        [
            "The 'Lisagan Festival' held on Sunday after the fiesta includes street dancing similar to Sinulog Festival and fluvial procession at the Agusan River and Baug River.",
            "The town parish doesn't allow major public gathering like disco, live bands and other similar events the night before the fiesta."
        ],
        [
            "Magellan Shrine"
        ],
        [
            "Magellan Shrine"
        ],
        [
            "Located at Poblacion near the Municipal Hall, the shrine was the site of the 'first' Catholic mass in Mindanao on April 8, 1521.",
            "It was believed that the Magellan's Cross in Cebu was also erected here by the explorer Ferdinand Magellan and his men before they sail North.",
            "Evidence showed church ruins near the Agusan River."
        ],
        [
            "Agusan River"
        ],
        [
            "The Agusan River is the widest and navigable river in Mindanao."
        ],
        [
            "Government"
        ],
        [
            "List of mayors"
        ],
        [
            "Name"
        ],
        [
            "Year of Term"
        ],
        [
            "Florentino P. Magallanes"
        ],
        [
            "1972-1978; 1986-1987"
        ],
        [
            "Francisco M. Herrera"
        ],
        [
            "1978-1984"
        ],
        [
            "Juanito A. Suacillo"
        ],
        [
            "1984-1986"
        ],
        [
            "Rosita C. Cumba"
        ],
        [
            "1988-1994; 1995"
        ],
        [
            "Manuel M. Relampagos"
        ],
        [
            "1994; 1995-1998"
        ],
        [
            "Carlito C. Cumba"
        ],
        [
            "2007-2010"
        ],
        [
            "Demosthenes H. Arabaca"
        ],
        [
            "2010-2019"
        ],
        [
            "Cesar C. Cumba"
        ],
        [
            "1998-2007; 2019–present"
        ],
        [
            "Infrastructure"
        ],
        [
            "Magallanes Coastal Road (Left) and REBAR Sports Center (Right)"
        ],
        [
            "The Magallanes Coastal Road (Known as Cuenca Avenue Street) was started on 2019 under municipal mayor Cesar Cumba, Jr.",
            "The said project was under the Local Government and it was completed in October 2020.",
            "The REBAR Sports Center was located in P-6 Buhang, Magallanes which was opened on October 9, 2020.",
            "The said sports center was owned and maintained by the private family, and it has 2 badminton courts, 2 table tennis courts, 2 darts courts, and the taekwondo dojang."
        ],
        [
            "Communications"
        ],
        [
            "The Philippine Long Distance Telephone Company provides fixed line services.",
            "Wireless mobile communications services are provided by Smart Communications and Globe Telecommunications."
        ],
        [
            "Transportation"
        ],
        [
            "Magallanes can be reached through the Mindanao gateways:"
        ],
        [
            "Air"
        ],
        [
            "Bancasi Airport of Butuan and Laguindingan International Airport of Cagayan de Oro and Iligan"
        ],
        [
            "PAL Express and Cebu Pacific have daily flights from Manila to Butuan and v.v.",
            "Cebu-Butuan-Cebu flights via Cebu Pacific scheduled Mondays, Wednesdays and Saturdays, and PAL."
        ],
        [
            "Magallanes Bay Walk"
        ],
        [
            "Sea"
        ],
        [
            "Masao Port of Butuan"
        ],
        [
            "Port of Nasipit"
        ],
        [
            "Port of Surigao"
        ],
        [
            "Macabalan Port of Cagayan de Oro"
        ],
        [
            "There are several major shipping lines serving the Manila and Cebu routes namely: 2Go, Cokaliong, Medallion Transport and PSACC."
        ],
        [
            "The boat ride from Butuan to Magallanes, navigating the Agusan River, takes about 45 minutes."
        ],
        [
            "Land"
        ],
        [
            "Bachelor Express and PhilTranCo is the dominant public land transport from Manila and Tacloban passing Surigao, Cabadbaran and Butuan to Cagayan de Oro and Davao.",
            "The public mode of transportation within the municipality is by motorcabs and pedicabs.",
            "Passenger vans commonly known as V-Hire are also available for Butuan routes."
        ],
        [
            "References"
        ],
        [
            "^ a b \"Republic Act No.",
            "5660; An Act Creating the Municipality of Magallanes, Province of Agusan\".",
            "The Corpus Juris.",
            "21 June 1969.",
            "Archived from the original on 16 October 2016.",
            "Retrieved 16 October 2016."
        ],
        [
            "^  Municipality of Magallanes |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Agusan del Norte\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Magallanes: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 2 February 2020."
        ],
        [
            "^ \"Municipal: Magallanes, Agusan del Norte\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Caraga\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Caraga\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Agusan del Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Malaking Sanga ng Pambansang Sentenaryong Puno ng Pilipinas, Nabali!\".",
            "rmn.",
            "Retrieved 4 Jul 2017."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Magallanes, Agusan del Norte."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Official website"
        ],
        [
            "Agusan del Norte Tourism - Explore Magallanes"
        ],
        [
            "Places adjacent to Magallanes, Agusan del Norte"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Butuan Bay"
        ],
        [
            "Magallanes"
        ],
        [
            "R. T. Romualdez"
        ],
        [
            "Butuan"
        ],
        [
            "vte Province of Agusan del NorteCabadbaran (capital)Butuan (largest city)Municipalities"
        ],
        [
            "Buenavista"
        ],
        [
            "Carmen"
        ],
        [
            "Jabonga"
        ],
        [
            "Kitcharao"
        ],
        [
            "Las Nieves"
        ],
        [
            "Magallanes"
        ],
        [
            "Nasipit"
        ],
        [
            "Remedios T. Romualdez"
        ],
        [
            "Santiago"
        ],
        [
            "Tubay"
        ],
        [
            "Component city"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Butuan (Administratively independent from the province but grouped under Agusan del Norte by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Magallanes,_Agusan_del_Norte&oldid=1165949533\""
        ],
        [
            "Category: Municipalities of Agusan del NorteHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from October 2016Commons category link from WikidataOfficial website different in Wikidata and WikipediaPages using the Kartographer extension"
        ]
    ]
}