{
    "name": "Magallanes",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Magallanes, Cavite"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°11′N 120°45′E﻿ / ﻿14.18°N 120.75°E﻿ / 14.18; 120.75"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cavite, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Magallanes, Cavite\" – news · newspapers · books · scholar · JSTOR (October 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesMagallanesMunicipalityMunicipality of MagallanesStreet in Magallanes"
        ],
        [
            "FlagSealNickname: Eco-Tourism CenterMap of Cavite with Magallanes highlightedOpenStreetMapMagallanesLocation within the PhilippinesCoordinates: 14°11′N 120°45′E﻿ / ﻿14.18°N 120.75°E﻿ / 14.18; 120.75CountryPhilippinesRegionCalabarzonProvinceCaviteDistrict"
        ],
        [
            "8th districtFoundedJuly 15, 1879Annexation to MaragondonOctober 15, 1903Chartered1916Named forFerdinand MagellanBarangays16"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJasmin Angelli Maligaya-Bautista • Vice MayorJesus B. Antazo • RepresentativeAniela Bianca D. Tolentino • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Janessa Ann M. de RemayoAina Mari M. SisanteMar B. ReducaJohn Alister P. MojicaRenato A. DimapilisJayson P. SantiagoFelipe V. Sisante Jr.Renato M. Villanueva"
        ],
        [
            " • Electorate16,005 voters (2022)Area • Revenue₱ 119.6 million (2020) • Assets₱ 238.5 million (2020) • Expenditure₱ 108.2 million (2020) • Liabilities₱ 55.96 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code4113PSGC042112000IDD : area code +63 (0)46Native languagesTagalogWebsitewww.magallanescavite.gov.ph"
        ],
        [
            "Magallanes, officially the Municipality of Magallanes (Tagalog: Bayan ng Magallanes),  is a 4th class municipality in the province of Cavite, Philippines.",
            "According to the 2020 census, it has a population of 23,851 people, making it the least populated municipality in the province."
        ],
        [
            "The municipality is named after Ferdinand Magellan, who was known in Spanish as Fernando de Magallanes."
        ],
        [
            "History"
        ],
        [
            "Magallanes began its history as a barrio called Panitan, then a part of the municipality of Maragondon.",
            "Panitan was derived from the Tagalog word \"panit\", meaning \"to remove the bark of a tree\".",
            "Long before the coming of the Spaniards, there grew along the mountainside of this barrio big trees called bitangcol which provide a source of income for the people.",
            "The barks of the trees are removed and used as containers for storing palay or unhusked rice.",
            "The fibers of the barks were removed and twined into durable ropes.",
            "Because of this unusual occupation of the people the barrio came to be known as Panitan or Banitan."
        ],
        [
            "The first inhabitants of Panitan were Isidro Baltao, Glicerio Manalo, Florentino Mojica, and Ignacio Arat.",
            "Time came when the people, tired of travelling the long distance to the poblacion of Maragondon, decided to seek the separation of the barrio and its conversion into an independent municipality.",
            "Isidro Baltao headed a three-man delegation to Manila to petition the Spanish Governor-General Domingo Moriones for the conversion of Panitan into a town."
        ],
        [
            "While still in Manila, Baltao and his companions were walking along the paved streets of Intramuros when they came upon Magallanes street.",
            "There and then, they decided to recommend that the new municipality be named Magallanes in honor of Ferdinand Magellan.",
            "The governor-general was said to have been impressed by the name Magallanes, and he also named the barrios of the new town after Spanish leaders and missionaries like Urdaneta, Ramirez, Pacheco, and Medina.",
            "Other streets of the town were also named after prominent Spaniards like Jovellar, Salcedo, Anda, Colon, San Jose, and San Isidro.",
            "The principal street was named Real (Royal), in honor of the Spanish king.",
            "Another street bore the name of De Guia after the patron saint of the town, Nuestra Señore de Guia."
        ],
        [
            "Barrio Panitan, renamed Magallanes, became an independent municipality on July 15, 1879.",
            "The first gobernadorcillo of Magallanes was Anastacio Diones.",
            "The designation gobernadorcillo was changed to capitan municipal shortly before the outbreak of the Philippine Revolution.",
            "Juan Bello, a former capitan municipal, was the leader of Filipino revolutionists again Spain.",
            "When the Americans came the title, capitan municipal was changed to municipal president."
        ],
        [
            "On October 15, 1903, the town was reverted to being part of Maragondon when its annual income became insufficient to maintain its status as an independent municipality."
        ],
        [
            "Geography"
        ],
        [
            "Magallanes is situated about 97 kilometers (60 mi) south of Manila.",
            "Maragondon bounds the town on the north while the municipality of General Emilio Aguinaldo borders the north-east.",
            "Alfonso shares its southeast limits, while Nasugbu, Batangas is at the southern end.",
            "Classified as one of the upland communities of the province, Magallanes is situated about 2,000 feet (610 m) above sea level."
        ],
        [
            "Barangays"
        ],
        [
            "Magallanes is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 042112001  Baliwag"
        ],
        [
            " 6.8%"
        ],
        [
            " 1,617"
        ],
        [
            " 1,388"
        ],
        [
            "  ▴"
        ],
        [
            " 1.54%"
        ],
        [
            " 042112002  Bendita I"
        ],
        [
            " 8.4%"
        ],
        [
            " 1,999"
        ],
        [
            " 1,720"
        ],
        [
            "  ▴"
        ],
        [
            " 1.51%"
        ],
        [
            " 042112003  Caluangan"
        ],
        [
            " 6.4%"
        ],
        [
            " 1,532"
        ],
        [
            " 1,380"
        ],
        [
            "  ▴"
        ],
        [
            " 1.05%"
        ],
        [
            " 042112004  Medina"
        ],
        [
            " 9.8%"
        ],
        [
            " 2,345"
        ],
        [
            " 1,903"
        ],
        [
            "  ▴"
        ],
        [
            " 2.11%"
        ],
        [
            " 042112005  Pacheco"
        ],
        [
            " 8.8%"
        ],
        [
            " 2,107"
        ],
        [
            " 1,701"
        ],
        [
            "  ▴"
        ],
        [
            " 2.16%"
        ],
        [
            " 042112006  Barangay 1 (Pob.)"
        ],
        [
            " 4.8%"
        ],
        [
            " 1,155"
        ],
        [
            " 1,023"
        ],
        [
            "  ▴"
        ],
        [
            " 1.22%"
        ],
        [
            " 042112007  Barangay 2 (Pob.)"
        ],
        [
            " 1.2%"
        ],
        [
            " 276"
        ],
        [
            " 356"
        ],
        [
            "  ▾"
        ],
        [
            " −2.51%"
        ],
        [
            " 042112008  Barangay 3 (Pob.)"
        ],
        [
            " 1.5%"
        ],
        [
            " 351"
        ],
        [
            " 330"
        ],
        [
            "  ▴"
        ],
        [
            " 0.62%"
        ],
        [
            " 042112009  Barangay 4 (Pob.)"
        ],
        [
            " 2.5%"
        ],
        [
            " 598"
        ],
        [
            " 552"
        ],
        [
            "  ▴"
        ],
        [
            " 0.80%"
        ],
        [
            " 042112010  Barangay 5 (Pob.)"
        ],
        [
            " 3.5%"
        ],
        [
            " 829"
        ],
        [
            " 659"
        ],
        [
            "  ▴"
        ],
        [
            " 2.32%"
        ],
        [
            " 042112011  Ramirez"
        ],
        [
            " 7.7%"
        ],
        [
            " 1,841"
        ],
        [
            " 1,713"
        ],
        [
            "  ▴"
        ],
        [
            " 0.72%"
        ],
        [
            " 042112012  Tua"
        ],
        [
            " 8.1%"
        ],
        [
            " 1,940"
        ],
        [
            " 1,971"
        ],
        [
            "  ▾"
        ],
        [
            " −0.16%"
        ],
        [
            " 042112013  Urdaneta"
        ],
        [
            " 9.3%"
        ],
        [
            " 2,225"
        ],
        [
            " 2,092"
        ],
        [
            "  ▴"
        ],
        [
            " 0.62%"
        ],
        [
            " 042112014  Kabulusan"
        ],
        [
            " 7.8%"
        ],
        [
            " 1,854"
        ],
        [
            " 1,675"
        ],
        [
            "  ▴"
        ],
        [
            " 1.02%"
        ],
        [
            " 042112015  Bendita II"
        ],
        [
            " 5.7%"
        ],
        [
            " 1,354"
        ],
        [
            " 1,194"
        ],
        [
            "  ▴"
        ],
        [
            " 1.27%"
        ],
        [
            " 042112016  San Agustin"
        ],
        [
            " 7.7%"
        ],
        [
            " 1,828"
        ],
        [
            " 1,574"
        ],
        [
            "  ▴"
        ],
        [
            " 1.51%"
        ],
        [
            "Total"
        ],
        [
            "23,851"
        ],
        [
            "21,231"
        ],
        [
            " ▴"
        ],
        [
            "1.17%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Magallanes, Cavite"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "10(0.4)"
        ],
        [
            "10(0.4)"
        ],
        [
            "12(0.5)"
        ],
        [
            "27(1.1)"
        ],
        [
            "94(3.7)"
        ],
        [
            "153(6.0)"
        ],
        [
            "206(8.1)"
        ],
        [
            "190(7.5)"
        ],
        [
            "179(7.0)"
        ],
        [
            "120(4.7)"
        ],
        [
            "54(2.1)"
        ],
        [
            "39(1.5)"
        ],
        [
            "1,094(43)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5.2"
        ],
        [
            "4.5"
        ],
        [
            "6.4"
        ],
        [
            "9.2"
        ],
        [
            "19.7"
        ],
        [
            "24.3"
        ],
        [
            "26.9"
        ],
        [
            "25.7"
        ],
        [
            "24.4"
        ],
        [
            "21.0"
        ],
        [
            "12.9"
        ],
        [
            "9.1"
        ],
        [
            "189.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Nuestra Señora De Guia Parish, a Catholic church in Magallanes town proper"
        ],
        [
            "Population census of MagallanesYearPop.±% p.a.1903 3,750—    1918 2,845−1.82%1939 4,095+1.75%1948 3,998−0.27%1960 5,436+2.59%YearPop.±% p.a.1970 7,294+2.98%1975 9,330+5.06%1980 9,691+0.76%1990 12,556+2.62%1995 17,115+5.98%YearPop.±% p.a.2000 18,090+1.19%2007 18,890+0.60%2010 21,231+4.34%2015 22,727+1.31%2020 23,851+0.95%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Magallanes, Cavite, was 23,851 people, with a density of 330 inhabitants per square kilometer or 850 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Magallanes"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  28.70"
        ],
        [
            "2009  19.37"
        ],
        [
            "2012  13.49"
        ],
        [
            "2015  17.17"
        ],
        [
            "2018  13.80"
        ],
        [
            "2021  14.27"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Although the main source of livelihood in Magallanes is agriculture, it is evident that there has been a shift in emphasis from rice farming to coffee production because of the growing market demand for coffee.",
            "This is revealed in a study made by the Provincial Development Staff at Trece Martires City.",
            "Another reason is that the production of rice, corn and a wide variety of vegetables and fruits is more than sufficient to satisfy the nutritional demand of the population."
        ],
        [
            "However, there is a large deficit in livestock and poultry production, which has been relegated to a backyard industry.",
            "To solve this problem there is need to encourage the establishment of livestock and poultry farms on a commercial scale.",
            "The local development plan calls for the introduction of high-yielding breeds and the conversion of idle lands into grazing pastures."
        ],
        [
            "Magallanes has a potential labor force of 5,066 or 52.3% of the total population.",
            "However, only 2,725 or 54% of this number are economically active.",
            "The town has also a low unemployment rate of 3.7% with only 100 of this labor force listed as unemployed.",
            "The existence of large and productive agricultural lands offers a wide variety of economic activities.",
            "The agricultural sector absorbs as much as 82% of the labor force, while the service sector comprising teachers and government employees and workers account for only 15.6%.",
            "A negligible 2.4% are absorbed by the manufacturing, transportation and other commercial industries."
        ],
        [
            "In 1980, the municipality's 2,250 families with an average of four members per family, earned a total of ₱17,992,882 (equivalent to ₱344,117,821 in 2021), showing an average family income of ₱7,997.00 (equivalent to ₱152,944 in 2021).",
            "About 71.9% of the number belonged to the low group while 24.1% comprised the middle class group.",
            "Only about 4% of the population constituted the high income group.",
            "About 54% or 1,223 families fall below the food threshold of ₱5,272.86 (equivalent to ₱100,845 in 2021) and 1,781 or 79% were below the total threshold of ₱9,895.87 (equivalent to ₱189,261 in 2021)."
        ],
        [
            "The 1980 economic survey shows that the municipality had 2,043 households occupying 2,015 dwelling units, or a slight shortage of 28 housing units.",
            "Majority of the dwellings were of strong materials, including wood, galvanized iron, and concrete.",
            "The large percentage of houses using concrete may be due to the presence of a large gravel deposit comprising more than 300 hectares (740 acres) located in barangays Ramirez and Urdaneta.",
            "Plans for its development is now under study by the provincial government coordination with the Bureau of Mines."
        ],
        [
            "In terms of health and sanitation Magallanes is deficient in health personnel and facilities.",
            "It lacks one doctor, one nurse, one dentist and two barangay health stations.",
            "The low awareness of proper sanitation and nutrition among the people, especially those of the lower class, aggravates the present health condition in the municipality."
        ],
        [
            "Transportation within and outside the town is mainly by tricycles and jeepneys.",
            "It has approximately 77.639 kilometers (48.243 mi) of road, 43.922 kilometers (27.292 mi) being classified as primary, 19.217 kilometers (11.941 mi) as secondary, and 15.5 kilometers (9.6 mi) tertiary road.",
            "It has one national road with a length of 22.35 kilometers (13.89 mi), one provincial road extending 0.263 kilometers (0.163 mi), eight municipal roads with a total length of 3.026 kilometers (1.880 mi), and 18 barangay roads totalling 52 kilometers (32 mi)."
        ],
        [
            "Electricity in the municipality is served by Meralco, which serves almost every part of the municipality.",
            "Water is supplied by the Magallanes Water System although some areas get their water from artesian wells, open wells, and springs."
        ],
        [
            "Population growth is relatively low in Magallanes due to outmigration.",
            "The lack of employment and educational opportunities has caused the skilled workers to settle elsewhere."
        ],
        [
            "Government"
        ],
        [
            "Magallanes Town Hall"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Elected officials"
        ],
        [
            "The following are the elected officials of the town elected last May 09, 2022 which serves until 2025:"
        ],
        [
            "Position"
        ],
        [
            "Official"
        ],
        [
            "Mayor"
        ],
        [
            "Jasmin Maligaya-Bautista (Aksyon)"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Jesus B. Antazo (NUP)"
        ],
        [
            "Sangguniang Bayan Members"
        ],
        [
            "Party"
        ],
        [
            "Janessa Ann Maligaya-de Remayo"
        ],
        [
            "NPC"
        ],
        [
            "Aina Mari M. Sisante"
        ],
        [
            "Aksyon"
        ],
        [
            "Mar B. Reduca"
        ],
        [
            "NPC"
        ],
        [
            "John Alister P. Mojica"
        ],
        [
            "Aksyon"
        ],
        [
            "Renato A. Dimapilis"
        ],
        [
            "NUP"
        ],
        [
            "Jayson P. Santiago"
        ],
        [
            "Aksyon"
        ],
        [
            "Felipe V. Sisante, Jr."
        ],
        [
            "NUP"
        ],
        [
            "Renato M. Villanueva"
        ],
        [
            "NUP"
        ],
        [
            "ABC President"
        ],
        [
            "SK Federation President"
        ],
        [
            "List of local chief executives"
        ],
        [
            "The following is a list of town heads of Magallanes since it became a municipality:"
        ],
        [
            "Gobernadorcillos"
        ],
        [
            "Anastacio Diones, 1880–1881"
        ],
        [
            "Ciriaco Rillo, 1881–1882"
        ],
        [
            "Braulio Mendoza (teniente primero), 1882"
        ],
        [
            "Benito Bello, 1883–1884"
        ],
        [
            "?",
            "?",
            "?"
        ],
        [
            "Juan Bello, 1887–1888"
        ],
        [
            "Luis Rillo, 1888–1889"
        ],
        [
            "Modesto Cuajunco, 1890–1891"
        ],
        [
            "Juan Bello, 1892–1893."
        ],
        [
            "Capitanes Municipal"
        ],
        [
            "Juan Bello, 1894–1897"
        ],
        [
            "Pastor Bilugan, 1897–1898"
        ],
        [
            "Juan Bello, 1898–1900."
        ],
        [
            "Municipal Presidents"
        ],
        [
            "Modesto Cuajunco, 1900–1901"
        ],
        [
            "Juan Bello, 1902–1904."
        ],
        [
            "Quirico Ogot (acting), 1916–1917"
        ],
        [
            "Agapito Espineli (elected), 1917–1919"
        ],
        [
            "Antonio Espineli, 1920–1922"
        ],
        [
            "Zacarias Diones, 1923–1925"
        ],
        [
            "Agapito Espineli, 1926–1928"
        ],
        [
            "Zacarias Diones, 1929–1931"
        ],
        [
            "Zacarias Diones, 1932–1934."
        ],
        [
            "Municipal Mayors"
        ],
        [
            "Maximo Linantud, 1935–1937"
        ],
        [
            "Felipe Espineli, 1938–1940"
        ],
        [
            "Felipe Espineli, 1941–1943"
        ],
        [
            "Benvenuto Espineli (acting), 1944–1945"
        ],
        [
            "Gregorio Asuncion, ditto, 1946"
        ],
        [
            "Calixto Espineli, ditto, 1947"
        ],
        [
            "Benvenuto Espineli (elected), 1948–1950"
        ],
        [
            "Benvenuto Espineli, 1951–1955"
        ],
        [
            "Mariano de Raya, 1956–1959"
        ],
        [
            "Mariano de Raya, 1960–1962"
        ],
        [
            "Juan Ramos (Acting), 1962–1963"
        ],
        [
            "Anatalio Reyes (elected), 1964–1967"
        ],
        [
            "Felipe Custodio (Acting), 1967"
        ],
        [
            "Anatalio Reyes (elected), 1967–1969"
        ],
        [
            "Napoleon Beratio (acting), 1969–1970"
        ],
        [
            "Alejandro Reyes (elected), 1970–1972"
        ],
        [
            "Efinito Beltran, 1972–1980"
        ],
        [
            "Napoleon Beratio (elected), 1980–1986, 1988-1998"
        ],
        [
            "Filomeno Maligaya, 1998–2007"
        ],
        [
            "Edwin Sisante, 2007-2016"
        ],
        [
            "Jasmin Angelli M. Maligaya-Bautista, 2016-present"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Magallanes |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Act No.",
            "947 (October 15, 1903), An Act Reducing the Twenty-Three Municipalities of the Province of Cavite to Eleven, retrieved June 17, 2023"
        ],
        [
            "^ The Philippine Index, Millennium Edition, Vol.",
            "1 No.",
            "1"
        ],
        [
            "^"
        ],
        [
            "\"Province: Cavite\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Magallanes: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 12 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cavite\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Magallanes, Cavite."
        ],
        [
            "Profile: Magallanes, Cavite – Official Website of the Province of Cavite"
        ],
        [
            "Profile: Magallanes, Cavite – DILG Calabarzon Region"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Magallanes, Cavite"
        ],
        [
            "Maragondon"
        ],
        [
            "Nasugbu, Batangas"
        ],
        [
            "Magallanes"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "Nasugbu, Batangas"
        ],
        [
            "Alfonso"
        ],
        [
            "vte Province of CaviteTrece Martires  (de facto capital), Imus  (de jure capital)  Dasmariñas (largest city)Municipalities"
        ],
        [
            "Alfonso"
        ],
        [
            "Amadeo"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "Indang"
        ],
        [
            "Kawit"
        ],
        [
            "Magallanes"
        ],
        [
            "Maragondon"
        ],
        [
            "Mendez"
        ],
        [
            "Naic"
        ],
        [
            "Noveleta"
        ],
        [
            "Rosario"
        ],
        [
            "Silang"
        ],
        [
            "Tanza"
        ],
        [
            "Ternate"
        ],
        [
            "Component cities"
        ],
        [
            "Bacoor"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Tagaytay"
        ],
        [
            "Trece Martires"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Magallanes,_Cavite&oldid=1221166890\""
        ],
        [
            "Category: Municipalities of CaviteHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from October 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}