{
    "name": "Magdiwang",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Magdiwang, Romblon"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°29′N 122°31′E﻿ / ﻿12.48°N 122.52°E﻿ / 12.48; 122.52"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Romblon, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesMagdiwang"
        ],
        [
            "MagallanesMunicipalityMunicipality of MagdiwangThe majestic Mount Guiting-Guiting, as seen from south."
        ],
        [
            "FlagSealNickname: The Gateway to Mount Guiting-GuitingMap of Romblon with Magdiwang highlightedOpenStreetMapMagdiwangLocation within the PhilippinesCoordinates: 12°29′N 122°31′E﻿ / ﻿12.48°N 122.52°E﻿ / 12.48; 122.52CountryPhilippinesRegionMimaropaProvinceRomblonDistrict"
        ],
        [
            "Lone districtFounded1820 (as Naylog)Renamed1855 (as Magallanes)IncorporatedMarch 1, 1933 (as Magdiwang)Barangays9"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorArthur R. Tansiongco • Vice MayorGuillermo R. Rocha • RepresentativeEleandro Jesus F. Madrona • Councilors"
        ],
        [
            "Faith Macato"
        ],
        [
            "Jessie Quarre"
        ],
        [
            "Chito Robea"
        ],
        [
            "Jun Caleja"
        ],
        [
            "Roderick Royo"
        ],
        [
            "Melet Rollon"
        ],
        [
            "Edgar Villanueva"
        ],
        [
            "Laarni Rollon"
        ],
        [
            " • Electorate10,091 voters (2022)Area • Revenue₱ 87.74 million (2020) • Assets₱ 291.5 million (2020) • Expenditure₱ 18.56 million (2020) • Liabilities₱ 26.08 million (2020)Service provider • ElectricityRomblon Electric Cooperative (ROMELCO)Time zoneUTC+8 (PST)ZIP code5507PSGC175908000IDD : area code +63 (0)42Native languagesRomblomanon Tagalog"
        ],
        [
            "Magdiwang, officially the Municipality of Magdiwang, is a 5th class municipality in the province of Romblon, Philippines.",
            "According to the 2020 census, it has a population of 15,385 people."
        ],
        [
            "Formerly known as Naylog and Magallanes, it is one of three municipalities in Sibuyan Island, which has been dubbed as the \"Galapagos of Asia\" due to its pristine natural environment and high endemism rate for flora and fauna."
        ],
        [
            "Etymology"
        ],
        [
            "The place got its name from Magdiwang, in honor of the Magdiwang in 1933."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Sibuyan Island in Romblon province"
        ],
        [
            "Based on civil and church records from 1820, Magdiwang was founded as Fundacion de Naylog, a settlement established in the northern coast of Sibuyan Island by religious missionaries led by Don Valentin Ayala.",
            "It was placed under the jurisdiction of Pueblo de Sibuyan, whose seat was located in Cajidiocan town.",
            "In 1855, the settlement was one of 17 new pueblos (towns) added to the four already existing in the province and was renamed Magallanes, in honor of Spanish explorer Ferdinand Magellan."
        ],
        [
            "Six years later, on 21 February 1861, another pueblo, Rancheria de Infiel, was organized close to Magallanes, located in the upstream of the present poblacion in what is now Barangay Dulangan.",
            "This new pueblo was established for the sake of the relocated Mangyanes or May-as tribe, who used to live in the mountains, so that missionary works and Christianizing efforts conducted in the lowland villages will be extended to them as well.",
            "This pueblo was incorporated later on, during the American occupation, as part of Magdiwang."
        ],
        [
            "Thirteen years later, on 11 January 1868, when Romblon was converted into a province, Magallanes was demoted to a missionary center from its former status as pueblo by the first governor of the Romblon, Don Joaquin Corillo."
        ],
        [
            "Modern history"
        ],
        [
            "Civil government in Romblon was established under the Americans on 16 March 1901.",
            "Magallanes was one of 11 new municipalities.",
            "In 1917, due to reorganization and the province's difficult financial status as a newly restored entity, the former municipality of Magallanes was abolished and annexed to Cajidiocan.",
            "It was only restored to its independent municipality status on 1 March 1933, with the new name Magdiwang, in honor of the Magdiwang faction of the Philippine revolutionary group, Katipunan.",
            "It was inaugurated through festivities which lasted from 24 to 25 March 1933 and led by Governor Manuel T. Alvero."
        ],
        [
            "On 8 June 1940, the special municipality of Sibuyan was established through the passage of Commonwealth Act No.",
            "581, sponsored by Congressman Leonardo Festin.",
            "Magdiwang was abolished and was annexed to the new municipality with its seat at Cajidiocan town proper.",
            "The special municipality of Sibuyan was abolished through the passage of Republic Act No.",
            "38, which was authored by Congressman Modesto Formelleza and took effect on 1 October 1946, when President Manuel Roxas signed the Republic Act no.",
            "38, restoring Magdiwang as a municipality."
        ],
        [
            "In February 2018, the government planned the construction of a road that would go through Mt.",
            "Guiting-guiting Natural Park Protected Area, effectively endangering thousands of Sibuyan Island pristine forests that have never been touched by man."
        ],
        [
            "Geography"
        ],
        [
            "Nepenthes argentii, a pitcher plant endemic to Mount Guiting-Guiting in Magdiwang, Romblon."
        ],
        [
            "Magdiwang is one of three municipalities in Sibuyan Island, the second largest among the islands of Romblon.",
            "It is bound on the west by Cajidiocan, on the south by San Fernando, and on the north by Sibuyan Sea, and to the north-west by Romblon, Romblon.",
            "The total land area of Magdiwang is 100.75 km2.",
            "The town has the following soil classification: Tupi loam, Laylay sandy clay loam and Mogpog Farson Complex.",
            "Much of the terrain is hilly and mountainous and is covered by lush tropical rainforest, as it is part of the Mount Guiting-Guiting Natural Park."
        ],
        [
            "Barangays"
        ],
        [
            "Magdiwang is politically subdivided into 9 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Agsao"
        ],
        [
            "Agutay"
        ],
        [
            "Ambulong"
        ],
        [
            "Dulangan"
        ],
        [
            "Ipil"
        ],
        [
            "Jao-asan"
        ],
        [
            "Poblacion"
        ],
        [
            "Silum"
        ],
        [
            "Tampayan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Magdiwang, Romblon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "47(1.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "39(1.5)"
        ],
        [
            "48(1.9)"
        ],
        [
            "98(3.9)"
        ],
        [
            "150(5.9)"
        ],
        [
            "169(6.7)"
        ],
        [
            "147(5.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "172(6.8)"
        ],
        [
            "118(4.6)"
        ],
        [
            "80(3.1)"
        ],
        [
            "1,264(49.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "8.2"
        ],
        [
            "9.3"
        ],
        [
            "9.7"
        ],
        [
            "19.1"
        ],
        [
            "25.6"
        ],
        [
            "27.4"
        ],
        [
            "25.5"
        ],
        [
            "25.5"
        ],
        [
            "25.2"
        ],
        [
            "18.5"
        ],
        [
            "14.5"
        ],
        [
            "219.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "According to the 2015 Philippine census, Magdiwang has a population of 14,142 people.",
            "A variant of the Romblomanon language locally, called Sibuyanon, is the native language of the municipality's inhabitants."
        ],
        [
            "Population census of MagdiwangYearPop.±% p.a.1903 2,275—    1939 4,325+1.80%1948 4,308−0.04%1960 4,802+0.91%1970 6,601+3.23%1975 7,504+2.60%1980 8,149+1.66%1990 10,405+2.47%1995 11,447+1.80%2000 12,032+1.07%2007 12,924+0.99%2010 13,584+1.83%2015 14,142+0.77%2020 15,385+1.67%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Magdiwang"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  48.80"
        ],
        [
            "2009  45.93"
        ],
        [
            "2012  37.54"
        ],
        [
            "2015  35.29"
        ],
        [
            "2018  26.05"
        ],
        [
            "2021  29.29"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Magdiwang is an agricultural municipality with a small percentage of manufacturing and service-oriented activities.",
            "According to the Office of the Provincial Agriculturist, the municipality has the highest agricultural production in the province.",
            "Other potential economic activities include fish culture and processing, cut flower industries, cottage industries, garment manufacturing, banking, and tourism."
        ],
        [
            "Utilities"
        ],
        [
            "Electricity in Magdiwang is provided by the Romblon Electric Cooperative.",
            "As for water supply, the town as 5 community irrigation projects that have service area of 188 hectares.",
            "Potable water is mostly supplied through jet pumps, artesian wells, deep wells, and springs.",
            "Cellular communication is made possible through companies like PLDT, Smart Communications, and Globe Telecom."
        ],
        [
            "Infrastructure"
        ],
        [
            "Ambulong Port in Magdiwang is the port of entry to Sibuyan Island.",
            "There are weekly RORO and motorized boat trips to the municipality from Manila, Batangas City, Lucena, Quezon, Romblon, Romblon, and San Agustin, Romblon.",
            "The municipality is connected to its neighboring towns via the Sibuyan Circumferential Road.",
            "Public utility jeepneys (PUJ), pedicabs, tricycles, and motorcycles are the common form of public transportation in the area."
        ],
        [
            "Tourism"
        ],
        [
            "Because of its preserved natural environment, Magdiwang is touted as a prime eco-tourism destination.",
            "The municipality is staging point of mountain climbers ascending Mount Guiting-Guiting, Romblon's tallest mountain.",
            "It also has several rivers, falls, and beaches, which tourists can enjoy."
        ],
        [
            "Magdiwang Beach: Stretches over two kilometers on the western side of Magdiwang, facing the Sibuyan Sea."
        ],
        [
            "Lambingan Falls: A romantic hideaway marked by huge boulders that deflect the cascade from the heights.",
            "The falls has a natural pool with cool surroundings, ideal for swimming and picnics.",
            "The park is complemented by other tourist potential that is constantly developed for town beautification because of its lush greenery."
        ],
        [
            "Paseo de Magdiwang: A farm close to Magdiwang Beach and is home to a strand of agojo and pine trees that are older than the park."
        ],
        [
            "Marine Garden: A repository of rich marine life that is a boon for scuba divers and explorer of the deep."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Philippine municipality"
        ],
        [
            "As a municipality in the Province of Romblon, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "Pursuant to Chapter II, Title II, Book III of Republic Act 7160 or the Local Government Code of 1991, the municipal government is composed of a mayor (alkalde), a vice mayor (bise alkalde) and members (kagawad) of the legislative branch Sangguniang Bayan alongside a secretary to the said legislature, all of which are elected to a three-year term and are eligible to run for three consecutive terms."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Magdiwang |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Corp., ABS-CBN.",
            "\"The Galapagos of Asia: Sibuyan Island - Choose Philippines.",
            "Find.",
            "Discover.",
            "Share\".",
            "www.choosephilippines.com."
        ],
        [
            "^ a b c d e f g h i j Fabula, Milex (2001).",
            "\"Profile: Magdiwang, Romblon\".",
            "Romblon Travel Guide.",
            "Retrieved 20 August 2014."
        ],
        [
            "^ a b c d e \"The History of Magdiwang, Romblon\".",
            "Reference.com.",
            "2001.",
            "Archived from the original on 21 August 2014.",
            "Retrieved 20 August 2014."
        ],
        [
            "^ a b c d e f \"Magdiwang, Romblon\".",
            "The Official Website of the Provincial Government of Romblon.",
            "2012.",
            "Archived from the original on 14 August 2014.",
            "Retrieved 20 August 2014."
        ],
        [
            "^ \"OFFICIAL STATEMENT: DPWH road project endangers Sibuyan Island protected area - Bayay Sibuyanon Inc\".",
            "bayay.ph.",
            "Archived from the original on 2018-04-13.",
            "Retrieved 2018-04-13."
        ],
        [
            "^ Mt.",
            "Guiting-guiting Natural Park Protected Area"
        ],
        [
            "^"
        ],
        [
            "\"Magdiwang: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Romblon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Poverty Incidence, 2000\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"Poverty Incidence, 2003\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"Poverty Incidence, 2006\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"Poverty Incidence, 2012\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Poverty Incidence, 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Providing for a Local Government Code of 1991\".",
            "The LawPhil Project.",
            "8th Congress of the Republic of the Philippines.",
            "Retrieved April 21, 2014."
        ],
        [
            "External links"
        ],
        [
            "Magdiwang Profile at PhilAtlas.com"
        ],
        [
            "Magdiwang Profile - Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "\"Magdiwang Profile\" at the Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Magdiwang, Romblon"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "Romblon / Romblon Channel"
        ],
        [
            "Magdiwang"
        ],
        [
            "Cajidiocan"
        ],
        [
            "San Fernando"
        ],
        [
            "vte Province of RomblonRomblon (capital)  Odiongan (largest municipality)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Banton"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Calatrava"
        ],
        [
            "Concepcion"
        ],
        [
            "Corcuera"
        ],
        [
            "Ferrol"
        ],
        [
            "Looc"
        ],
        [
            "Magdiwang"
        ],
        [
            "Odiongan"
        ],
        [
            "Romblon"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Magdiwang,_Romblon&oldid=1192471149\""
        ],
        [
            "Category: Municipalities of RomblonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using the Kartographer extension"
        ]
    ]
}