{
    "name": "Magpet",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Magpet"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°07′N 125°07′E﻿ / ﻿7.12°N 125.12°E﻿ / 7.12; 125.12"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cotabato, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Magpet\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Soccsksargen, PhilippinesMagpetMunicipalityMunicipality of MagpetTawsuvan Falls"
        ],
        [
            "SealMap of Cotabato with Magpet highlightedOpenStreetMapMagpetLocation within the PhilippinesCoordinates: 7°07′N 125°07′E﻿ / ﻿7.12°N 125.12°E﻿ / 7.12; 125.12CountryPhilippinesRegionSoccsksargenProvinceCotabatoDistrict"
        ],
        [
            "2nd districtFoundedJune 22, 1963Barangays32"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 290.6 million (2020) • Assets₱ 687.7 million (2020) • Expenditure₱ 248.1 million (2020) • Liabilities₱ 150.9 million (2020)Service provider • ElectricityCotabato Electric Cooperative (COTELCO)Time zoneUTC+8 (PST)ZIP code9404PSGC124706000IDD : area code +63 (0)64Native languagesHiligaynon Cebuano Tagabawa Ilianen Obo TagalogWebsitewww.magpet.gov.ph"
        ],
        [
            "Magpet, officially the Municipality of Magpet (Hiligaynon: Banwa sang Magpet; Cebuano: Lungsod sa Magpet; Filipino: Bayan ng Magpet),  is a 1st class municipality in the province of Cotabato, Philippines.",
            "According to the 2020 census, it has a population of 52,800."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Magpet\" – news · newspapers · books · scholar · JSTOR (June 2020) (Learn how and when to remove this message)"
        ],
        [
            "Magpet derived its name from the word malotpot, which means \"a place where people gather in fellowship to partake of their packed lunch wrapped in banana leaves\"."
        ],
        [
            "Magpet is one of the five daughter municipalities of Kidapawan.",
            "It was the fourth to be created, by Republic Act (RA) No.",
            "3721 in 1963, organizing the northern part of Kidapawan in the latter's largest single loss of territory to date."
        ],
        [
            "The law was signed by President Diosdado Macapagal on June 22.",
            "The first local officials were sworn into office on August 13, 1963, with Froiland Matas as first mayor."
        ],
        [
            "The territory was partitioned in 1991 with the creation of Arakan through RA No.",
            "7152.",
            "The establishment of Magpet and Arakan caused Kidapawan eventually  losing all its borders with the Davao Region, excluding Mount Apo which is being shared by Kidapawan, Davao, and four other towns."
        ],
        [
            "On January 2–3, 1986, atrocities took place in Kabalantian (now part of Arakan), where six individuals were killed and houses were burned down, reportedly by members of the Landasan armed group."
        ],
        [
            "Geography"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "The municipality of Magpet is located in the eastern part of Cotabato Province and at the foothills of Mt.",
            "Apo with generally a sloping to mountainous terrain.",
            "Furthermore, it is a landlocked municipality located at the boundary of the provinces of Cotabato and Davao del Sur.",
            "It is bounded on the North by the Municipality of Arakan; on the East by Davao City, on the West by President Roxas and Antipas and 9.0 km on the South by Kidapawan City of Cotabato Province.",
            "The municipality lies between the latitude 7º 6.178’ N and longitude 125º 7.461’ E."
        ],
        [
            "Barangays"
        ],
        [
            "Magpet is politically subdivided into 32 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Alibayon"
        ],
        [
            "Bagumbayan"
        ],
        [
            "Bangkal"
        ],
        [
            "Bantac"
        ],
        [
            "Basak"
        ],
        [
            "Binay"
        ],
        [
            "Bongolanon"
        ],
        [
            "Datu Celo"
        ],
        [
            "Del Pilar"
        ],
        [
            "Doles"
        ],
        [
            "Gubatan"
        ],
        [
            "Ilian"
        ],
        [
            "Inac"
        ],
        [
            "Kamada"
        ],
        [
            "Kauswagan"
        ],
        [
            "Kisandal"
        ],
        [
            "Magcaalam"
        ],
        [
            "Mahongcog"
        ],
        [
            "Manobo"
        ],
        [
            "Noa"
        ],
        [
            "Owas"
        ],
        [
            "Pangao-an"
        ],
        [
            "Poblacion"
        ],
        [
            "Sallab"
        ],
        [
            "Tagbac"
        ],
        [
            "Temporan"
        ],
        [
            "Amabel"
        ],
        [
            "Balite"
        ],
        [
            "Don Panaca"
        ],
        [
            "Imamaling"
        ],
        [
            "Kinarum"
        ],
        [
            "Manobisa"
        ],
        [
            "Physical and geophysical features"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Magpet has a total land area of 75,536 hectares agricultural and forestlands.",
            "It has 32 barangays of which only Barangay Poblacion is considered an urban barangay.",
            "Barangays with biggest land area are Libertad (8% of total land area), Manobo (7.3%), Mahongkong (6.7%) and Imamaling (6.1%).",
            "Those with smallest land area, on the other hand, are barangays Bagumbayan (0.5% of total land area), Alibayon (0.36%), Del Pilar (0.25%) and Kauswagan (0.17%)."
        ],
        [
            "Topography"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Approximately 34.76% or 26,256 hectares are considered areas with very steep to strongly hilly slopes.",
            "Around 6,381 hectares of slopes 0 – 3% are very good lands for intensive agricultural production."
        ],
        [
            "The soils found in Magpet are quilada sandy loam (9,846 hectares); aroman clay loam (24,345 hectares) and bolinao clay loam (41,345 hectares).",
            "Generally, these lands are classified as No.",
            "45 or mountainous.",
            "Magpet's soil is suitable for crops like rubber, coconut, coffee, cacao, black pepper, banana, fruit trees and vegetables.",
            "Land capability further rates the soil in the municipality as CE and U classification.",
            "Clay loam soils.",
            "However, are also found in various barangays."
        ],
        [
            "Dominant soil types in the area have high and medium water holding capacity.",
            "About 22% of the land area has no apparent erosion problem while 30,194.70 hectares or 31% have been considered to be under slightly eroded condition.",
            "Those classified with moderate erosion potential total to 10,382.20 hectares while 24% or 18,382.20 hectares are already susceptible with severe erosion."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Magpet, Cotabato"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "51(2.0)"
        ],
        [
            "41(1.6)"
        ],
        [
            "38(1.5)"
        ],
        [
            "45(1.8)"
        ],
        [
            "82(3.2)"
        ],
        [
            "108(4.3)"
        ],
        [
            "114(4.5)"
        ],
        [
            "120(4.7)"
        ],
        [
            "95(3.7)"
        ],
        [
            "96(3.8)"
        ],
        [
            "76(3.0)"
        ],
        [
            "52(2.0)"
        ],
        [
            "918(36.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.2"
        ],
        [
            "12.0"
        ],
        [
            "13.8"
        ],
        [
            "15.3"
        ],
        [
            "22.5"
        ],
        [
            "23.9"
        ],
        [
            "25.2"
        ],
        [
            "25.4"
        ],
        [
            "23.3"
        ],
        [
            "24.1"
        ],
        [
            "21.0"
        ],
        [
            "16.8"
        ],
        [
            "236.5"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Land area"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "The municipality has an area of approximately 75,536 hectares, 0.98% (744 hectares) of which covers the urban area, while 99.02% (74,792 hectares) of land is for rural area.",
            "Based on the Municipality Socio-Economic Profile the municipality has 35 barangays, classified into 1 urban area; the Poblacion and rest (34) are rural area."
        ],
        [
            "Natural resources"
        ],
        [
            "Water"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Several rivers located in Magpet are being tapped for irrigation development and potential for hydro power plants.",
            "Others are the major tributaries to Kabacan River, which flows to many barangays of Magpet, to the Municipalities of Pres.",
            "Roxas, Matalam, Kabacan, Carmen and connects with Pulangi River.",
            "As a major source of water supply, it served for irrigation purposes, servicing thousands of hectares of rice fields not only in the Municipality of Magpet, but also in the various areas of the Province as well.",
            "Magpet is serviced by two public water system (Level III) by the Metro Kidapawan Water District(MKWD) servicing to barangays Bongolanon, Kisandal, Tagbak, Poblacion and Gubatan.",
            "While Magpet Water Works Services (MWWS), a water system owned and managed by the Local Government Unit extend its services to barangyas Magkaalam, Tagbak, Poblacion, Owas, Kamada, Gubatan, Kauswagan, Alibayon, Del Pilar, Inac, Doles, Binay, Bantac and Pangao-an  .",
            "Other barangays have their own system, the Barangay Water Sanitation (BAWASA), a level III and level II water system."
        ],
        [
            "Minerals"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Mineral products found in the municipality of Magpet include non-metallic like limestone, sand and gravel which are the basic good materials for constructions while the red and white clay, considered as among the best in the country, are good materials for ceramic production.",
            "These can be found particularly in the barangays of Doles, Inca and Noa.",
            "Metallic minerals include gold, nickel and silver."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Magpet"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  43.9"
        ],
        [
            "2009  36.65"
        ],
        [
            "2012  48.88"
        ],
        [
            "2015  42.23"
        ],
        [
            "2018  41.70"
        ],
        [
            "2021  33.53"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "The municipality has a huge area for agricultural and mostly the people are farmers and their income derived from farming activities.",
            "The average annual family income is Php 83,053 or an average monthly income of Php 6,921."
        ],
        [
            "Wages and salaries as well as entrepreneurial is also as their main income for workers, individual or self-employed income earners has been noted also in the municipality like skylab or single motorcycle driver, tricycle drivers, market and ambulant vendors and among others."
        ],
        [
            "The data of poverty incidence of the municipality from the Philippine Statistic Authority, 2012 show that poverty incidence of Magpet is 43.9% in 2006, 36.7% in 2009 and 48.9% in 2012."
        ],
        [
            "Magpet's primary income is coming from agriculture, this is because of huge potential area for agriculture development, and the major agricultural product produce are rubber, banana both lacatan and cardava, coconuts, coffee and frits.",
            "While the minor products, rice and corn, root crops,Tahiti and vegetables, etc."
        ],
        [
            "The municipality is not so much a meat and poultry producing municipality, but mostly a small or a backyard poultry and hog raising only."
        ],
        [
            "Rice production in Magpet is only 1.16% or 1,028 hectares of the total land area with another 1.50% or 1,115 hectares as potential area due to its land topography, which is mostly hilly or mountainous."
        ],
        [
            "Magpet is the No.",
            "1 Banana producing municipality in the Province of North Cotabato.",
            "Knowing Magpet has a cool climate and high elevation, favourable in growing large and sweet variety of highland lacatan banana."
        ],
        [
            "Of all the commodity crops planted, Lacatan banana is the no.",
            "1 income generating in the municipality.",
            "It covers the entire barangays in Magpet, while some areas identified as rice and corn commodity were subsequently converted into banana plantation areas.",
            "About 25% or a total of 171 hectares were converted into banana production."
        ],
        [
            "Banana covers the largest plantation area in the municipality with a total of 2,123.30 hectares and has a total of 940,531,500.00 metric tons per year as of December 31, 2013 data.",
            "This Lacatan banana variety is being sold to the local market and transported to Cities like Manila, Cebu, Iloilo and Cagayan de Oro via Davao City."
        ],
        [
            "For now, only DOLE Stanfilco grow Cavendish bananas in the southwest portion of the municipality.",
            "This banana variety is exported to Middle East countries and Central Asia countries like China, Singapore and others.",
            "It provides employment to local farmers who do not have a farm of their own to till."
        ],
        [
            "Businesses in the municipality are dominated by small to medium-scale establishments engaged mostly in the distribution of finished products.",
            "As of 2018, number of registered business establishments totaled to 326 (new – 93; renewal – 233)."
        ],
        [
            "Tourism industry is also a very potential entrepreneur in the municipality, this give income to the LGU.",
            "Mostly tourist spot was developed by the LGU like in Tausuvan water falls and Kirongdong water falls in Kinarum.",
            "There are also privately operated resorts in the municipality."
        ],
        [
            "Government"
        ],
        [
            "Municipal mayors (1963–present)"
        ],
        [
            "Name"
        ],
        [
            "Start of term"
        ],
        [
            "End of term"
        ],
        [
            "Manner of assumption"
        ],
        [
            "Froilan M. Matas"
        ],
        [
            "August 13, 1963"
        ],
        [
            "December 31, 1971"
        ],
        [
            "Appointed"
        ],
        [
            "Jesus L. Apostol"
        ],
        [
            "January 1, 1964"
        ],
        [
            "December 31, 1967"
        ],
        [
            "Elected"
        ],
        [
            "Froilan M. Matas"
        ],
        [
            "January 1, 1968"
        ],
        [
            "December 31, 1971"
        ],
        [
            "Elected"
        ],
        [
            "Dominador L. Apostol, Sr"
        ],
        [
            "January 1, 1972"
        ],
        [
            "May 2, 1974"
        ],
        [
            "Elected"
        ],
        [
            "Carlos P. Lebrillo"
        ],
        [
            "May 3, 1974"
        ],
        [
            "May 31, 1986"
        ],
        [
            "Appointed then elected"
        ],
        [
            "Nasario Omandac, Sr"
        ],
        [
            "June 1, 1986"
        ],
        [
            "October 7, 1987"
        ],
        [
            "Appointed"
        ],
        [
            "Eufronio P. Zamoras"
        ],
        [
            "October 8, 1987"
        ],
        [
            "December.",
            "31, 1987"
        ],
        [
            "Appointed"
        ],
        [
            "Nicolas Y. Josue"
        ],
        [
            "January 1, 1988"
        ],
        [
            "January 31, 1988"
        ],
        [
            "Appointed"
        ],
        [
            "Erlinda A. Lebrillo"
        ],
        [
            "February 1, 1988"
        ],
        [
            "March 23, 1992"
        ],
        [
            "Elected"
        ],
        [
            "Federico B. Marañon"
        ],
        [
            "March 24, 1992"
        ],
        [
            "June 30, 1992"
        ],
        [
            "Appointed"
        ],
        [
            "Rolando M. Pelonio, Sr"
        ],
        [
            "July 1, 1992"
        ],
        [
            "June 30, 2001"
        ],
        [
            "Elected"
        ],
        [
            "Angelita P. Pelonio"
        ],
        [
            "June 30, 2001"
        ],
        [
            "June 30, 2004"
        ],
        [
            "Elected"
        ],
        [
            "Efren F. Piñol"
        ],
        [
            "June 30, 2004"
        ],
        [
            "June 30, 2013"
        ],
        [
            "Elected"
        ],
        [
            "Florenito T. Gonzaga"
        ],
        [
            "June 30, 2013"
        ],
        [
            "June 31, 2022"
        ],
        [
            "Elected"
        ],
        [
            "Jay Laurence S. Gonzaga"
        ],
        [
            "July 1, 2022"
        ],
        [
            "Present"
        ],
        [
            "Elected"
        ],
        [
            "Infrastructure"
        ],
        [
            "Roads and bridges"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Magpet has a total road length of 310.91 kilometers of which 38.30 kilometers National Road, 25.30 kilometers Provincial Road, 8.073 kilometers Municipal Road and 239.237 Barangay road."
        ],
        [
            "These roads are categorized into: Concrete (84.37 km), Asphalt (1.05 km), Gravel (116.17 km), and Earth/ unpaved (109.30 km)."
        ],
        [
            "There are 6 bridges and 2 double barrel box culvert along the national highway of Kidapawan-Magpet-Pangao-an Road (KMP) which include 2 FVR type steel bridge and 4 RCDG bridge and 3 bridges and 2 double barrel box culvert along Magpet- Binay- Basak-Temporan Road which include 3 RCDG bridges, in the provincial road along Kisandal-Bongolanon-Magcaalam-Bangkal-Manobo there are 3 bridges, 1 double barrel box culvert and 1 overflow bridge, these 2 bridges are RCDG type of bridges and 1 bailey bridge in Manobo that need immediate repair.",
            "Generally the bridges along these national and provincial roads are in good condition but it need maintenance and rehabilitation to make it sure to sustain durability of the structure.",
            "It needs to construct new RCDG bridge in Tagibaka river, Bongolanon."
        ],
        [
            "On the other hand, in the barangay roads almost all rivers and creeks have existing bridges and overflow bridges, like the 21 lm bailey bridge in Barangay Ilian, 18 lm bailey bridge in Bangkal, and RCDG bridge in Sitio Namuwaran in Manobisa, RCDG bridge in Tagibaka, Magcaalam.",
            "So far all these existing bridges and overflow bridges are in good condition."
        ],
        [
            "People who would like to travel to Cagayan de Oro City may take the route Magpet- Binay- Basak-Temporan - Arakan - Bukidnon highway."
        ],
        [
            "Transportation"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Most areas in the municipality can be reached by any type of transportation especially in the major road networks, but the people prefer to use skylab or single motorcycle type of transportation for the fast transportation especially in the rural barangays.",
            "Tricycle is the mode of transportation in going to nearby city of Kidapawan.",
            "There are also jeepneys plying in the northern part of the municipality."
        ],
        [
            "Power"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Almost all of the barangays in the municipality has power energy service by Cotabato Electric Cooperative (COTELCO) but this can be found near the electric transmission line and the center of the barangay, but in the sitio power services still needs to be implemented."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MagpetYearPop.±% p.a.1970 30,869—    1975 43,983+7.36%1980 47,286+1.46%1990 55,399+1.60%1995 35,256−8.12%2000 38,973+2.17%2007 44,114+1.72%2010 45,183+0.88%2015 49,201+1.64%2020 53,800+1.77%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Magpet, Cotabato, was 53,800 people, with a density of 71 inhabitants per square kilometre or 180 inhabitants per square mile."
        ],
        [
            "Poblacion is the densest barangay with a density of 921."
        ],
        [
            "Five densely populated Barangay in Magpet"
        ],
        [
            "Barangay"
        ],
        [
            "Pop"
        ],
        [
            "km2"
        ],
        [
            "Pop/km2"
        ],
        [
            "Poblacion"
        ],
        [
            "6,849"
        ],
        [
            "7.44"
        ],
        [
            "921"
        ],
        [
            "Kauswagan"
        ],
        [
            "642"
        ],
        [
            "0.98"
        ],
        [
            "655"
        ],
        [
            "Alibayon"
        ],
        [
            "1,001"
        ],
        [
            "2.74"
        ],
        [
            "365"
        ],
        [
            "Gubatan"
        ],
        [
            "1,799"
        ],
        [
            "4.94"
        ],
        [
            "364"
        ],
        [
            "Del Pilar"
        ],
        [
            "686"
        ],
        [
            "1.92"
        ],
        [
            "357"
        ],
        [
            "Barangay"
        ],
        [
            "Population percentage (2015)"
        ],
        [
            "Population  (2015)"
        ],
        [
            "Population  (2010)"
        ],
        [
            "Change  (2010‑2015)"
        ],
        [
            "Annual Population Growth Rate (2010‑2015)"
        ],
        [
            "Alibayon"
        ],
        [
            "2.03%"
        ],
        [
            "1,001"
        ],
        [
            "920"
        ],
        [
            "8.80%"
        ],
        [
            "1.62%"
        ],
        [
            "Amabel"
        ],
        [
            "2.68%"
        ],
        [
            "1,318"
        ],
        [
            "996"
        ],
        [
            "32.33%"
        ],
        [
            "5.48%"
        ],
        [
            "Bagumbayan"
        ],
        [
            "2.17%"
        ],
        [
            "1,066"
        ],
        [
            "955"
        ],
        [
            "11.62%"
        ],
        [
            "2.12%"
        ],
        [
            "Balete"
        ],
        [
            "3.40%"
        ],
        [
            "1,674"
        ],
        [
            "1,596"
        ],
        [
            "4.89%"
        ],
        [
            "0.91%"
        ],
        [
            "Bangkal"
        ],
        [
            "2.24%"
        ],
        [
            "1,104"
        ],
        [
            "995"
        ],
        [
            "10.95%"
        ],
        [
            "2.00%"
        ],
        [
            "Bantac"
        ],
        [
            "2.32%"
        ],
        [
            "1,140"
        ],
        [
            "1,077"
        ],
        [
            "5.85%"
        ],
        [
            "1.09%"
        ],
        [
            "Basak"
        ],
        [
            "5.15%"
        ],
        [
            "2,535"
        ],
        [
            "2,706"
        ],
        [
            "-6.32%"
        ],
        [
            "-1.24%"
        ],
        [
            "Binay"
        ],
        [
            "2.86%"
        ],
        [
            "1,406"
        ],
        [
            "1,285"
        ],
        [
            "9.42%"
        ],
        [
            "1.73%"
        ],
        [
            "Bongolanon"
        ],
        [
            "2.84%"
        ],
        [
            "1,398"
        ],
        [
            "1,274"
        ],
        [
            "9.73%"
        ],
        [
            "1.78%"
        ],
        [
            "Datu Celo"
        ],
        [
            "1.93%"
        ],
        [
            "951"
        ],
        [
            "1,067"
        ],
        [
            "-10.87%"
        ],
        [
            "-2.17%"
        ],
        [
            "Del Pilar"
        ],
        [
            "1.39%"
        ],
        [
            "686"
        ],
        [
            "667"
        ],
        [
            "2.85%"
        ],
        [
            "0.54%"
        ],
        [
            "Doles"
        ],
        [
            "2.61%"
        ],
        [
            "1,284"
        ],
        [
            "1,157"
        ],
        [
            "10.98%"
        ],
        [
            "2.00%"
        ],
        [
            "Don Panaca"
        ],
        [
            "1.52%"
        ],
        [
            "750"
        ],
        [
            "607"
        ],
        [
            "23.56%"
        ],
        [
            "4.11%"
        ],
        [
            "Gubatan"
        ],
        [
            "3.66%"
        ],
        [
            "1,799"
        ],
        [
            "1,537"
        ],
        [
            "17.05%"
        ],
        [
            "3.04%"
        ],
        [
            "Ilian"
        ],
        [
            "1.54%"
        ],
        [
            "759"
        ],
        [
            "733"
        ],
        [
            "3.55%"
        ],
        [
            "0.67%"
        ],
        [
            "Imamaling"
        ],
        [
            "2.11%"
        ],
        [
            "1,040"
        ],
        [
            "938"
        ],
        [
            "10.87%"
        ],
        [
            "1.98%"
        ],
        [
            "Inac"
        ],
        [
            "2.47%"
        ],
        [
            "1,217"
        ],
        [
            "1,129"
        ],
        [
            "7.79%"
        ],
        [
            "1.44%"
        ],
        [
            "Kamada"
        ],
        [
            "2.58%"
        ],
        [
            "1,270"
        ],
        [
            "1,183"
        ],
        [
            "7.35%"
        ],
        [
            "1.36%"
        ],
        [
            "Kauswagan"
        ],
        [
            "1.30%"
        ],
        [
            "642"
        ],
        [
            "628"
        ],
        [
            "2.23%"
        ],
        [
            "0.42%"
        ],
        [
            "Kinarum"
        ],
        [
            "1.96%"
        ],
        [
            "964"
        ],
        [
            "882"
        ],
        [
            "9.30%"
        ],
        [
            "1.71%"
        ],
        [
            "Kisandal"
        ],
        [
            "2.42%"
        ],
        [
            "1,191"
        ],
        [
            "1,020"
        ],
        [
            "16.76%"
        ],
        [
            "2.99%"
        ],
        [
            "Magcaalam"
        ],
        [
            "2.27%"
        ],
        [
            "1,115"
        ],
        [
            "1,121"
        ],
        [
            "-0.54%"
        ],
        [
            "-0.10%"
        ],
        [
            "Mahongcog"
        ],
        [
            "3.81%"
        ],
        [
            "1,875"
        ],
        [
            "2,274"
        ],
        [
            "-17.55%"
        ],
        [
            "-3.61%"
        ],
        [
            "Manobisa"
        ],
        [
            "3.48%"
        ],
        [
            "1,711"
        ],
        [
            "1,507"
        ],
        [
            "13.54%"
        ],
        [
            "2.45%"
        ],
        [
            "Manobo"
        ],
        [
            "5.76%"
        ],
        [
            "2,832"
        ],
        [
            "2,389"
        ],
        [
            "18.54%"
        ],
        [
            "3.29%"
        ],
        [
            "Noa"
        ],
        [
            "3.58%"
        ],
        [
            "1,759"
        ],
        [
            "1,402"
        ],
        [
            "25.46%"
        ],
        [
            "4.41%"
        ],
        [
            "Owas"
        ],
        [
            "1.43%"
        ],
        [
            "705"
        ],
        [
            "728"
        ],
        [
            "-3.16%"
        ],
        [
            "-0.61%"
        ],
        [
            "Pangao‑an"
        ],
        [
            "5.08%"
        ],
        [
            "2,499"
        ],
        [
            "2,237"
        ],
        [
            "11.71%"
        ],
        [
            "2.13%"
        ],
        [
            "Poblacion"
        ],
        [
            "13.92%"
        ],
        [
            "6,849"
        ],
        [
            "5,693"
        ],
        [
            "20.31%"
        ],
        [
            "3.58%"
        ],
        [
            "Sallab"
        ],
        [
            "3.07%"
        ],
        [
            "1,509"
        ],
        [
            "1,475"
        ],
        [
            "2.31%"
        ],
        [
            "0.43%"
        ],
        [
            "Tagbac"
        ],
        [
            "3.45%"
        ],
        [
            "1,699"
        ],
        [
            "1,622"
        ],
        [
            "4.75%"
        ],
        [
            "0.89%"
        ],
        [
            "Temporan"
        ],
        [
            "2.95%"
        ],
        [
            "1,453"
        ],
        [
            "1,383"
        ],
        [
            "5.06%"
        ],
        [
            "0.94%"
        ],
        [
            "Magpet Total"
        ],
        [
            "49,201"
        ],
        [
            "45,183"
        ],
        [
            "8.89%"
        ],
        [
            "1.64%"
        ],
        [
            "Annual population growth rate is at 1.64%.",
            "According to the 2015 Census, the age group with the highest population in Magpet is 5 to 9, with 6,076 individuals.",
            "The age group with the lowest population is 80 and over, with 330 individuals."
        ],
        [
            "Natural attractions"
        ],
        [
            "Towsuvan Falls located at the foothills of Mount Apo in the town of Magpet.",
            "Crystal-clear water that offer a cool respite to a trek through lush forests, with a 20–30 metres (66–98 ft) drop of water with a natural pool.",
            "Its temperature may drop to 6 °C (43 °F) at night."
        ],
        [
            "Kirongdong Falls and Rainforests located at Kinarum, Magpet, with a drop of water between 70 and 80 metres (230 and 260 ft) surrounded by mountain ranges and cliffs."
        ],
        [
            "Mabu Falls and Rainforest located at Manobo, Magpet.",
            "About 120 metres (390 ft) high waterfalls and blessed with bed of flowers and century Cinnamon and Almaciga trees in the surroundings."
        ],
        [
            "Manobo Tribal Village located at Manobo, Magpet.",
            "It is one of the entry point to Mt.",
            "Apo via Lake Venado."
        ],
        [
            "Sitio Dallag Tribal Village located at Manobo, Magpet.",
            "It has an area of 400 hectares (990 acres) and nestled at about 400 metres (1,300 ft) above sea level and it is inhabited with indigenous Obo Manobo tribes."
        ],
        [
            "Recognitions"
        ],
        [
            "Magpet Red Orchid Award 2018"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "2011 Seal of Good Housekeeping (Department of the Interior and Local Government)"
        ],
        [
            "2015 Seal of Good Local Governance (Department of the Interior and Local Government)"
        ],
        [
            "2018 Seal of Good Local Governance (Department of the Interior and Local Government)"
        ],
        [
            "2018 Red Orchid Award (Department of Health)"
        ],
        [
            "2018 National Anti-Drug Abuse Council Performance Award (Department of the Interior and Local Government)"
        ],
        [
            "2019 Red Orchid Award (Department of Health)"
        ],
        [
            "Vision"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "Magpet is a major water resource provider and the eco-tourism capital of the Province of Cotabato in an agri-industrial town of well-managed natural resources in an ecologically balanced environment inhabited by productive, healthy and empowered cultural sensitive people enjoying accessible facilities and services governed by transparent, accountable leadership working towards a dynamic economy and sustainable development."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Magpet |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Our History\".",
            "Cotabatoprov.gov.ph.",
            "Retrieved 16 July 2020."
        ],
        [
            "^ a b c David, Karlo Antonio (January 3, 2024).",
            "\"Moppiyon Kahi Diid Patoy: The Greater Kidapawan Area\".",
            "MindaNews.",
            "Retrieved April 14, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: North Cotabato\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Magpet: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 30 January 2020."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Our History – Magpet, Cotabato\".",
            "Retrieved 2019-06-22."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XII (Soccsksargen)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XII (Soccsksargen)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of North Cotabato\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "External links"
        ],
        [
            "Magpet Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Official website"
        ],
        [
            "Places adjacent to Magpet"
        ],
        [
            "Arakan"
        ],
        [
            "President Roxas"
        ],
        [
            "Magpet"
        ],
        [
            "Davao City"
        ],
        [
            "Kidapawan"
        ],
        [
            "Mount Apo"
        ],
        [
            "vte Province of CotabatoKidapawan (capital)Municipalities"
        ],
        [
            "Alamada"
        ],
        [
            "Aleosan"
        ],
        [
            "Antipas"
        ],
        [
            "Arakan"
        ],
        [
            "Banisilan"
        ],
        [
            "Carmen"
        ],
        [
            "Kabacan"
        ],
        [
            "Libungan"
        ],
        [
            "Magpet"
        ],
        [
            "Makilala"
        ],
        [
            "Matalam"
        ],
        [
            "Midsayap"
        ],
        [
            "M'lang"
        ],
        [
            "Pigcawayan"
        ],
        [
            "Pikit"
        ],
        [
            "President Roxas"
        ],
        [
            "Tulunan"
        ],
        [
            "Component city"
        ],
        [
            "Kidapawan"
        ],
        [
            "Related"
        ],
        [
            "Symbols"
        ],
        [
            "Special Geographic Area (part of Bangsamoro)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Magpet&oldid=1218897520\""
        ],
        [
            "Category: Municipalities of CotabatoHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Cebuano-language textArticles containing Filipino-language textArticles needing additional references from June 2020Articles needing additional references from July 2020Official website different in Wikidata and WikipediaPages using the Kartographer extension"
        ]
    ]
}