{
    "name": "Malaybalay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Malaybalay"
        ],
        [
            "30 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançais한국어IlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSvenskaTagalogТатарча / tatarçaไทยУкраїнськаاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°09′23″N 125°08′00″E﻿ / ﻿8.1564°N 125.1333°E﻿ / 8.1564; 125.1333"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Capital of Bukidnon, Philippines"
        ],
        [
            "Component city in Northern Mindanao, PhilippinesMalaybalayComponent citySkyline of Malaybalay"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "South Summer Capital of the Philippines"
        ],
        [
            "City in the Forest of the South"
        ],
        [
            "Motto(s): Cool Place, Warm PeopleMap of Bukidnon with Malaybalay highlightedOpenStreetMapMalaybalayLocation within the PhilippinesCoordinates: 8°09′23″N 125°08′00″E﻿ / ﻿8.1564°N 125.1333°E﻿ / 8.1564; 125.1333CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "2nd districtFounded15 June 1877Cityhood22 March 1998Barangays46"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorJay Warren R. Pabillaran • Vice MayorEstelito R. Marabe • RepresentativeJonathan Keith T. Flores • City Council"
        ],
        [
            "Members"
        ],
        [
            "Niko P. AldeguerBrian Nelson T. FloresMelchor P. MaramaraZoltan Dindo D. DinlayanKathleen Cecille C. PagalingCromwell Kiril D. DinlayanRoyland M. OrquiaErwin A. DamascoChristopher B. SoriaAlan Ryann O. Legaspi"
        ],
        [
            " • Electorate115,928 voters (2022)Area • Revenue₱ 1,816 million (2020) • Assets₱ 4,579 million (2020) • Expenditure₱ 1,461 million (2020)Service provider • ElectricityBukidnon 2 Electric Cooperative (BUSECO)Time zoneUTC+8 (PST)ZIP code8700PSGC101312000IDD : area code +63 (0)88Native languagesBinukid CebuanoWebsitemalaybalaycity.gov.ph"
        ],
        [
            "Malaybalay, officially the City of Malaybalay (Binukid: Bánuwa ta Malaybaláy), is a 1st class component city and capital of the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 190,712 people."
        ],
        [
            "The city, dubbed as the \"South Summer Capital of the Philippines\", is bordered north by Impasugong; west by Lantapan; south by Valencia and San Fernando; and east by Cabanglasan and Agusan del Sur."
        ],
        [
            "It was formerly part of the province of Misamis Oriental as a municipal district in the late 19th century.",
            "When the special province of Agusan (now Agusan del Norte and Agusan del Sur) and its sub-province (Bukidnon) were created in 1907, Malaybalay was designated as the capital of Bukidnon.",
            "It was then formally established as a municipality on October 19, 1907, and was created into a city on February 11, 1998, by virtue of Republic Act 8490."
        ],
        [
            "Malaybalay City is the venue of the Kaamulan Festival, held annually from mid-February to March 10."
        ],
        [
            "History"
        ],
        [
            "Historiographic accounts for Malaybalay are scarce, and conflicting narratives further obscure the actual history of the city due to the oral nature of passing information by the Indigenous peoples and the incomplete accounts of Spanish registries in the region."
        ],
        [
            "Precolonial history"
        ],
        [
            "Malaybalay is one of the few villages in central Mindanao that was founded by the natives.",
            "People who live in present-day Malaybalay and most of Northern Mindanao and parts of Caraga now call themselves Higaonon.",
            "Higaonon tribal chieftains claim a city was built at the confluence (sabangán) of the Kibalabag and Can-ayan Rivers, at which point the Tagoloan River begins and is considered a sacred place by the tribe.",
            "They never converted to Islam like the tribes in Cotabato and Lanao."
        ],
        [
            "Spanish period, 17th to 19th century"
        ],
        [
            "Map of Misamis Province, 1899"
        ],
        [
            "The Spanish, who arrived in the area in the 18th century, already saw thriving communities along the Tagoloan River.",
            "In 1815, the Province of Misamis was created, which included areas of present-day Bukidnon.",
            "However, some skirmishes with the Spanish administration existed, such as the burning of Kalasungay village in 1850 by Spanish authorities, although the cause of such incident is conflicting.",
            "Nonetheless it dispersed the survivors into neighboring villages such as Silae and Silipon (now Dalwangan).",
            "A group established a new settlement near the Sacub River (a spring near present-day Rizal Park), led by Datù Mampaalong.",
            "In June 15, 1877, in an accord between the Spanish government and Mampaalong with 30 other datù, their settlement called Malaybalay was incorporated into Misamis.",
            "At the same event, Mampaalong and his people embraced Christianity.",
            "Malaybalay was then a barrio headed by an appointed cabeza de barangay.A street in Malaybalay in 1917"
        ],
        [
            "American occupation, 1898-1946"
        ],
        [
            "During the American occupation, administrative structure of Mindanao underwent complete overhaul.",
            "The Province of Misamis was dissolved forming the current provinces of Misamis Occidental and Misamis Oriental.",
            "Likewise, the Philippine Commission then headed by Commissioner Dean C. Worcester, Secretary of Interior and a member of the Philippine Commission proposed the creation of a province of Bukidnon.",
            "With it, the local administration of Sevilla was considered defunct."
        ],
        [
            "Aerial view of Malaybalay, 1935"
        ],
        [
            "On August 20, 1907, the Philippine Commission Act No.",
            "1693 was enacted creating the sub-province of Bukidnon.",
            "Malaybalay was then formally created as a municipality on October 19, 1907, replacing Mailag.",
            "It included the barrios of the former Sevilla except for Maramag, which became a separate Municipality.",
            "Dalwangan, formerly a village under Sumilao during the Spanish administration, was also incorporated within Malaybalay.",
            "When Bukidnon was declared as a regular province and become an independent political unit on March 10, 1917, by virtue of the creation of the Department of Mindanao and Sulu under Act 2711, Malaybalay was designated as its provincial capital."
        ],
        [
            "World War II and Japanese occupation, 1942-1945"
        ],
        [
            "American prisoners of war celebrate the 4th of July in the Japanese prison camp of Casisang in Malaybalay."
        ],
        [
            "During the Second World War, in 1942, the Japanese occupation troops entered Bukidnon.",
            "They occupied Malaybalay, establishing a camp in Casisang.",
            "Guerrilla groups operating around Malaybalay made frequent raids on the Japanese camps from the time of the occupation until the arrival of the Americans.",
            "In 1945 American liberation forces, together with the Philippine Commonwealth Forces and Filipino guerrillas, liberated Malaybalay."
        ],
        [
            "Postwar Malaybalay"
        ],
        [
            "Malaybalay was one of the few municipalities and municipal districts comprising Bukidnon and in the decades that followed, several municipalities were created from Malaybalay's far-flung but populous barangays.",
            "These municipalities eventually became San Fernando (1959, from 8 barrios), Valencia (1961, from 13 barrios), Lantapan (1968, from 12 barrios), and Cabanglasan (1979, from 15 barrios).",
            "As the capital town, most economic activity was centered here until it shifted to the more centrally located Valencia, its daughter town.",
            "In 1980, Valencia overtook Malaybalay as the most populous municipality."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "On March 26, 1996, the Sangguniang Bayan of the municipality of Malaybalay passed Resolution No.",
            "3699-96 petitioning to the House of Representatives for the conversion of Malaybalay into a city.",
            "Reginaldo Tilanduca, 2nd District Representative of Bukidnon at that time, filed House Bill No.",
            "6275, proposing the creation of Malaybalay into a component city.",
            "On March 22, 1998, President Fidel Ramos signed the act (R.A. 8490) that converted Malaybalay to a city, making it the first component city of Bukidnon."
        ],
        [
            "Geography"
        ],
        [
            "Malaybalay, the capital city of Bukidnon, is in the central part of the province.",
            "It is bounded in the east by the municipality of Cabanglasan and the Pantaron Range, which separates Bukidnon from the provinces of Agusan del Sur and Davao del Norte; on the west by the municipality of Lantapan and Mount Kitanglad; on the north by the municipality of Impasugong; and on the south by Valencia City and the municipality of San Fernando."
        ],
        [
            "The whole eastern and southeastern border adjoining Agusan del Sur and Davao del Norte is elevated and densely forested mountains, which is one of the few remaining forest blocks of Mindanao.",
            "The nearest seaports and airports are in Cagayan de Oro, which is 91 kilometers away."
        ],
        [
            "Barangays"
        ],
        [
            "Main article: Barangays of Malaybalay"
        ],
        [
            "Malaybalay is politically subdivided into 46 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "These barangays are conveniently grouped into 5 geographical districts, namely the Poblacion District, North Highway District, South Highway District, Basakan District, and Upper Pulangi District."
        ],
        [
            "Political map of Malaybalay showing the 46 barangays under its jurisdiction.",
            "Poblacion district is enlarged below left.",
            "All boundaries are approximate and are not authoritative."
        ],
        [
            "Barangay"
        ],
        [
            "Geographic district"
        ],
        [
            "Class"
        ],
        [
            "Population (2015)"
        ],
        [
            "Barangay 1"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "5,293"
        ],
        [
            "Barangay 2"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "969"
        ],
        [
            "Barangay 3"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "788"
        ],
        [
            "Barangay 4"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "456"
        ],
        [
            "Barangay 5"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "186"
        ],
        [
            "Barangay 6"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "741"
        ],
        [
            "Barangay 7"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "2,298"
        ],
        [
            "Barangay 8"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "675"
        ],
        [
            "Barangay 9"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "9,022"
        ],
        [
            "Barangay 10 (Impalambong)"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "2,942"
        ],
        [
            "Barangay 11 (Impalambong)"
        ],
        [
            "Poblacion"
        ],
        [
            "Urban"
        ],
        [
            "3,209"
        ],
        [
            "Aglayan"
        ],
        [
            "South Highway"
        ],
        [
            "Urban"
        ],
        [
            "7,594"
        ],
        [
            "Apo Macote"
        ],
        [
            "Basakan"
        ],
        [
            "Rural"
        ],
        [
            "4,903"
        ],
        [
            "Bangcud"
        ],
        [
            "South Highway"
        ],
        [
            "Urban"
        ],
        [
            "5,111"
        ],
        [
            "Busdi"
        ],
        [
            "Upper Pulangi"
        ],
        [
            "Rural"
        ],
        [
            "2,377"
        ],
        [
            "Cabangahan"
        ],
        [
            "South Highway"
        ],
        [
            "Rural"
        ],
        [
            "3,015"
        ],
        [
            "Caburacanan"
        ],
        [
            "Upper Pulangi"
        ],
        [
            "Rural"
        ],
        [
            "1,150"
        ],
        [
            "Can-ayan"
        ],
        [
            "North Highway"
        ],
        [
            "Rural"
        ],
        [
            "5,870"
        ],
        [
            "Capitan Angel"
        ],
        [
            "North Highway"
        ],
        [
            "Rural"
        ],
        [
            "1,160"
        ],
        [
            "Casisang"
        ],
        [
            "South Highway"
        ],
        [
            "Urban"
        ],
        [
            "25,696"
        ],
        [
            "Dalwangan"
        ],
        [
            "North Highway"
        ],
        [
            "Rural"
        ],
        [
            "7,004"
        ],
        [
            "Imbayao"
        ],
        [
            "North Highway"
        ],
        [
            "Rural"
        ],
        [
            "1,833"
        ],
        [
            "Indalasa"
        ],
        [
            "Upper Pulangi"
        ],
        [
            "Rural"
        ],
        [
            "1,690"
        ],
        [
            "Kalasungay"
        ],
        [
            "North Highway"
        ],
        [
            "Urban"
        ],
        [
            "8,272"
        ],
        [
            "Kibalabag"
        ],
        [
            "North Highway"
        ],
        [
            "Rural"
        ],
        [
            "1,158"
        ],
        [
            "Kulaman"
        ],
        [
            "Upper Pulangi"
        ],
        [
            "Rural"
        ],
        [
            "1,341"
        ],
        [
            "Laguitas"
        ],
        [
            "South Highway"
        ],
        [
            "Rural"
        ],
        [
            "3,233"
        ],
        [
            "Linabo"
        ],
        [
            "Basakan"
        ],
        [
            "Urban"
        ],
        [
            "6,933"
        ],
        [
            "Magsaysay"
        ],
        [
            "South Highway"
        ],
        [
            "Rural"
        ],
        [
            "3,001"
        ],
        [
            "Maligaya"
        ],
        [
            "Basakan"
        ],
        [
            "Rural"
        ],
        [
            "2,113"
        ],
        [
            "Managok"
        ],
        [
            "Basakan"
        ],
        [
            "Rural"
        ],
        [
            "7,200"
        ],
        [
            "Manalog"
        ],
        [
            "North Highway"
        ],
        [
            "Rural"
        ],
        [
            "969"
        ],
        [
            "Mapayag"
        ],
        [
            "South Highway"
        ],
        [
            "Rural"
        ],
        [
            "979"
        ],
        [
            "Mapulo"
        ],
        [
            "Upper Pulangi"
        ],
        [
            "Rural"
        ],
        [
            "1,260"
        ],
        [
            "Miglamin"
        ],
        [
            "Basakan"
        ],
        [
            "Rural"
        ],
        [
            "3,188"
        ],
        [
            "Patpat"
        ],
        [
            "North Highway"
        ],
        [
            "Rural"
        ],
        [
            "3,833"
        ],
        [
            "Saint Peter"
        ],
        [
            "Upper Pulangi"
        ],
        [
            "Rural"
        ],
        [
            "2,324"
        ],
        [
            "San Jose"
        ],
        [
            "South Highway"
        ],
        [
            "Urban"
        ],
        [
            "6,856"
        ],
        [
            "San Martin"
        ],
        [
            "Basakan"
        ],
        [
            "Rural"
        ],
        [
            "3,088"
        ],
        [
            "Santo Niño"
        ],
        [
            "Basakan"
        ],
        [
            "Rural"
        ],
        [
            "1,675"
        ],
        [
            "Silae"
        ],
        [
            "Upper Pulangi"
        ],
        [
            "Rural"
        ],
        [
            "2,629"
        ],
        [
            "Simaya"
        ],
        [
            "Basakan"
        ],
        [
            "Rural"
        ],
        [
            "4,161"
        ],
        [
            "Sinanglanan"
        ],
        [
            "Basakan"
        ],
        [
            "Rural"
        ],
        [
            "3,262"
        ],
        [
            "Sumpong"
        ],
        [
            "North Highway"
        ],
        [
            "Urban"
        ],
        [
            "9,302"
        ],
        [
            "Violeta"
        ],
        [
            "Basakan"
        ],
        [
            "Rural"
        ],
        [
            "2,199"
        ],
        [
            "Zamboanguita"
        ],
        [
            "Upper Pulangi"
        ],
        [
            "Rural"
        ],
        [
            "1,667"
        ],
        [
            "Total"
        ],
        [
            "174,625"
        ],
        [
            "Climate"
        ],
        [
            "The climate classification of Malaybalay falls under the Fourth Type or intermediate B type, which is characterized by the absence of a pronounced maximum period and dry season.",
            "Rain falls at a yearly average of 2,800 millimeters (110 in) and occurs throughout the year, though it is more intense during the summer season from April to September.",
            "Outside these months, January to March receive less rain and October to December are intermediate.",
            "Compared with the rest of the country, the climate in Malaybalay is moderate all year round and the area is not on the typhoon belt."
        ],
        [
            "Climate data for Malaybalay, Bukidnon (1981–2010, extremes 1949–2012)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "34.0(93.2)"
        ],
        [
            "35.2(95.4)"
        ],
        [
            "35.5(95.9)"
        ],
        [
            "37.5(99.5)"
        ],
        [
            "36.2(97.2)"
        ],
        [
            "34.0(93.2)"
        ],
        [
            "33.0(91.4)"
        ],
        [
            "33.5(92.3)"
        ],
        [
            "34.0(93.2)"
        ],
        [
            "34.0(93.2)"
        ],
        [
            "34.8(94.6)"
        ],
        [
            "33.6(92.5)"
        ],
        [
            "37.5(99.5)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.0(84.2)"
        ],
        [
            "29.4(84.9)"
        ],
        [
            "30.6(87.1)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "31.2(88.2)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "29.0(84.2)"
        ],
        [
            "29.1(84.4)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "29.6(85.3)"
        ],
        [
            "30.0(86.0)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "29.9(85.8)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "25.1(77.2)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "24.3(75.7)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "17.9(64.2)"
        ],
        [
            "17.6(63.7)"
        ],
        [
            "17.6(63.7)"
        ],
        [
            "18.1(64.6)"
        ],
        [
            "19.1(66.4)"
        ],
        [
            "19.2(66.6)"
        ],
        [
            "18.9(66.0)"
        ],
        [
            "18.8(65.8)"
        ],
        [
            "18.7(65.7)"
        ],
        [
            "18.9(66.0)"
        ],
        [
            "18.6(65.5)"
        ],
        [
            "18.3(64.9)"
        ],
        [
            "18.5(65.3)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "11.7(53.1)"
        ],
        [
            "10.0(50.0)"
        ],
        [
            "12.0(53.6)"
        ],
        [
            "12.5(54.5)"
        ],
        [
            "14.0(57.2)"
        ],
        [
            "12.6(54.7)"
        ],
        [
            "14.2(57.6)"
        ],
        [
            "15.0(59.0)"
        ],
        [
            "15.3(59.5)"
        ],
        [
            "14.9(58.8)"
        ],
        [
            "13.1(55.6)"
        ],
        [
            "12.5(54.5)"
        ],
        [
            "10.0(50.0)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "142.5(5.61)"
        ],
        [
            "106.1(4.18)"
        ],
        [
            "112.5(4.43)"
        ],
        [
            "115.6(4.55)"
        ],
        [
            "224.8(8.85)"
        ],
        [
            "313.5(12.34)"
        ],
        [
            "323.3(12.73)"
        ],
        [
            "294.4(11.59)"
        ],
        [
            "315.7(12.43)"
        ],
        [
            "314.7(12.39)"
        ],
        [
            "176.1(6.93)"
        ],
        [
            "130.7(5.15)"
        ],
        [
            "2,569.9(101.18)"
        ],
        [
            "Average rainy days (≥ 0.1 mm)"
        ],
        [
            "16"
        ],
        [
            "13"
        ],
        [
            "13"
        ],
        [
            "12"
        ],
        [
            "18"
        ],
        [
            "23"
        ],
        [
            "24"
        ],
        [
            "22"
        ],
        [
            "24"
        ],
        [
            "23"
        ],
        [
            "18"
        ],
        [
            "16"
        ],
        [
            "222"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "85"
        ],
        [
            "84"
        ],
        [
            "81"
        ],
        [
            "80"
        ],
        [
            "83"
        ],
        [
            "86"
        ],
        [
            "88"
        ],
        [
            "88"
        ],
        [
            "88"
        ],
        [
            "88"
        ],
        [
            "86"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Land area"
        ],
        [
            "The total land area of the city is 96,919 hectares (239,490 acres), that is about 13% of the total area of Bukidnon.",
            "An estimated of 65% of this is classified as forestland/timberland and the remaining 35% is alienable and disposable areas: lands which could be used for purposes such as for agriculture or for industry."
        ],
        [
            "The city plays a strategic role in the protection of the headwater source of the Pulangi and the Tagoloan rivers because of its location the upper portion of both watershed areas.",
            "The Pulangi River then extends through the Cotabato provinces as the Rio Grande de Mindanao and to Cotabato City, where it empties into Illana Bay.",
            "The Tagoloan River, on the other hand, traverses northwestward toward Tagoloan, Misamis Oriental, where it joins Macajalar Bay.",
            "These watershed areas provided potable water, irrigation, hydro-electric power, and recreation and tourism activities."
        ],
        [
            "Topography and soil type"
        ],
        [
            "Topographic map of MalaybalaySoil map of Malaybalay"
        ],
        [
            "The average elevation of the city is 622 metres (2,041 ft) above sea level.",
            "About 60% of the city's area has above 30% slope, characterized by steep hills, mountains, and cliff-like stream side.",
            "About 25% are level, gently sloping, and undulating.",
            "The rest are rolling and hilly."
        ],
        [
            "One of prominent geographical structure in the city is the Kitanglad Mountain Range, located in the western frontier, on its border with Lantapan and Impasugong.",
            "Some barangays (Dalwangan, Capitan Bayong, Imbayao and Mampayag) are in the foothills of this mountain range.",
            "Steep hills are found in the central portion of the city (Kibalabag, Manalog and Can-ayan), where the Tagoloan River headwater can be found.",
            "The Central Mindanao Cordillera (Pantaron Mountain Range), is on the eastern side of the city, in its boundaries with Agusan del Sur province.",
            "The Pulangi River cuts across the area between the hills in the central part and the Central Cordillera in the eastern part, creating a portion of the Upper Pulangi river valley.",
            "The southern portion of the city is made up of level to undulating area, a river valley created by the Sawaga River and the Manupali River, which are both tributaries of the Pulangi River."
        ],
        [
            "About 66% of the city's soil is identified as undifferentiated mountain soil and the rest are clay.",
            "The predominant types of clay are Kidapawan, Alimodian and Adtuyon, which are generally good for agriculture."
        ],
        [
            "Demography"
        ],
        [
            "Population census of MalaybalayYearPop.±% p.a.1918 16,428—    1939 18,816+0.65%1948 16,458−1.48%1960 32,522+5.84%1970 47,074+3.76%1975 65,198+6.75%1980 60,779−1.39%1990 94,722+4.54%1995 112,277+3.24%2000 123,672+2.09%2007 144,065+2.13%2010 153,085+2.23%2015 174,625+2.54%2020 190,712+1.75%Source: Philippine Statistics Authority"
        ],
        [
            "Historical growth of population of Malaybalay, 1918–2007"
        ],
        [
            "Malaybalay is originally the home of the Bukidnon \"lumads\" or natives, but there has been an influx of settlers and immigrants from the Visayas and Luzon for the last four decades contributing to the growth of the population.",
            "The original inhabitants, the Bukidnons, have retreated to the hinterlands as the migrants continued to occupy and dominate the population centers in the city.",
            "Malaybalay is the second most populous political subdivision in the province, after Valencia."
        ],
        [
            "The historical growth of population of the city showed a variable pattern of growth (See Figure).",
            "The first census of population was made in 1918 with Malaybalay having only 16,428 inhabitants.",
            "The 21 years from 1918 to 1939 was a low-growth period with the city's population growing at a 0.6% annually.",
            "This was then followed by a period of population decline until the post-World War II era, declining by 1.5% per year.",
            "The 12-year period from 1948 to 1960 is a period of high growth, when the city's population almost doubled from its 1948 level.",
            "This pace of growth continued until 1970, growing 6.7%.",
            "In 1970, Malaybalay has 65,918 inhabitants.",
            "A 5-year period of declining growth followed, the population dropped to 60,779.",
            "After the decline, Malaybalay's population has been increasing since then, growing by 3.4% from 1990 to 1995 and by 1.9% from 1995 to 2000."
        ],
        [
            "The city is predominantly rural, with only 16% of the population in urban areas, 40% in urbanizing barangays and 46% in rural areas.",
            "Population is evenly distributed in the urban and rural areas.",
            "The urban areas are generally found on the confines of the Sayre Highway (also known in the city as \"Fortich Street\") that traverses the city.",
            "The main urban population is found in the Poblacion-Casisang-Sumpong area.",
            "Secondary population centers includes barangays Aglayan, Bangcud, Kalasungay and San Jose."
        ],
        [
            "Malaybalay has one of the lowest average population density in the province, second only to Impasug-ong with only 146 persons per square kilometer although there are barangays, especially in the Poblacion area, with high population density."
        ],
        [
            "Cebuano and Binukid are prevailing mediums of communication in the city.",
            "More than half of the city's population are speakers of these languages.",
            "Other languages such as Maranao are spoken by the Maranaos.",
            "Hiligaynon is also spoken by the descendants of the Hiligaynon/Ilonggo settlers in the city."
        ],
        [
            "Religion"
        ],
        [
            "San Isidro Labrador Cathedral"
        ],
        [
            "The majority of the population, about 77% of the population, follow Christianity, with Roman Catholicism as the largest religion.",
            "San Isidro the Farmer Cathedral is the largest church in the city which is located beside Plaza Rizal.",
            "Other Christian religions present are United Methodist, Baptists, Seventh Day Adventists, Born again, Iglesia ni Cristo and the UCCP."
        ],
        [
            "The remainder 23% belong to non-Christian faiths, mainly adherent of Islam.",
            "The believers of Islam are mainly Maranao, Maguindanaon and Balik Islam (converts to Islam).",
            "There are many mosques that can be found in the city.",
            "Malaybalay Grand Mosque is the largest mosque in the city which also serves as the Islamic Center of Bukidnon.",
            "There are also sizeable adherents of Buddhism and animism in the city."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Malaybalay"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  31.70"
        ],
        [
            "2009  34.62"
        ],
        [
            "2012  31.62"
        ],
        [
            "2015  36.46"
        ],
        [
            "2018  21.58"
        ],
        [
            "2021  22.30"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Gaisano Malaybalay"
        ],
        [
            "The city is mainly an agricultural area, and its products include rice, corn, sugarcane, vegetables, legumes, root crops and commercial crops such as rubber, coffee, banana and pineapple.",
            "During the past years, corn used to be the pre-dominant crop in the city.",
            "But as the corn areas gave way to sugarcane, agri-farms (poultry, hog), and residential areas, sugarcane (306,600 metric tons) and rice (30,318 MT) came out now as the predominant crops in terms of production volume.",
            "These products are usually sold in the local market, or in nearby municipalities of the province.",
            "There are also farmers producing larger volume of corn and rice who sell their products in Cagayan de Oro."
        ],
        [
            "Agri-based industries primarily poultry and piggery, now flourish in the city.",
            "These farms are assisted by big corporations such as San Miguel, Purefoods, Monterey and Swift.",
            "Other agri-based industries in the City include Asian Hybrid Philippines (feeds processing), Rubber Tex (rubber shoes manufacturing), and Monastery Farms (peanuts and other preserved foods).",
            "Also notable are the 12 cattle ranches that produce an average of 470 heads yearly."
        ],
        [
            "Data from the License Department of the City showed that a majority or 95.87% of the establishments in the City belong to the service sector.",
            "Looking at the breakdown, sari-sari stores (37%) make up majority of the establishments in this sector, followed by trade/wholesale/retails (21%) and other, social and personal services (14%).",
            "Industry Sector and Agriculture Sector only make up only 2.27% and 1.9% respectively of all establishments."
        ],
        [
            "There is no data available on the employment per sector from the NSO that is specific for Malaybalay, thus the CPDO collected data from DTI, License Department, and City Agriculture Office to get the distribution of employment per industrial sector.",
            "The result showed that 70% of employment is in the farming/ crop production sector followed by government agencies and commercial/private establishments.",
            "Agri-industries and service sectors registered only about 1.63% and 5.99% respectively.",
            "The lowest is the manufacturing/processing sector at only 0.36%."
        ],
        [
            "So far 3 spring resorts, 5 plazas/nature parks have been developed in the city."
        ],
        [
            "Culture"
        ],
        [
            "Street dancing in Kaamulan, the only authentic ethnic festival in the Philippines"
        ],
        [
            "Malaybalay City Charter Day"
        ],
        [
            "Taking place every March 22, the date is declared as a special working holiday through Republic Act 8813 as a commemoration of Malaybalay's anniversary as a chartered city.",
            "Events are lined up by the city to enable residents and visitors to come and experience the charter day activities."
        ],
        [
            "Malaybalay City Fiesta"
        ],
        [
            "Malaybalay City Fiesta takes place every May 15 in honor of the city's patron saint, Saint Isidro Labrador, the patron of agricultural workers, labourers and livestock.",
            "The fiesta is a two-day event starting May 14, a day before the fiesta, wherein residents actively prepare for the festivities, up to fiesta day proper (May 15)."
        ],
        [
            "Kaamulan Festival"
        ],
        [
            "Kaamulan Festival is an ethnic cultural festival held annually in Malaybalay, Bukidnon in the Philippines from the second half of February to March 10, the anniversary date of the foundation of Bukidnon as a province in 1917.",
            "It is held to celebrate the culture and tradition of the seven ethnic tribal groups—Bukidnon, Higaonon, Talaandig, Manobo, Matigsalug, Tigwahanon and Umayamnon—that originally inhabit the province.",
            "It is the only ethnic festival in the Philippines."
        ],
        [
            "Tourism"
        ],
        [
            "This section is written like a travel guide.",
            "Please help improve the section by introducing an encyclopedic style or move the content to Wikivoyage.",
            "(December 2023)"
        ],
        [
            "Malaybalay has several notable tourist destinations."
        ],
        [
            "Inside the Church of the Monastery of Transfiguration"
        ],
        [
            "Monastery of the Transfiguration"
        ],
        [
            "The city's 25-year Benedictine Monastery of Transfiguration on San Jose hill, is made of heavy lime blocks, designed by National Artist for architecture Leandro Locsin.",
            "The first Filipino Abbot, Fr.",
            "Eduardo Africa and former Malaybalay bishop Gaudencio Rosales inaugurated it on August 6, 1983.",
            "Today, 10 monks had its 7 hectares planted to rice, 25 hectares to corn, and the rest for planting the world-famous Monk's Blend Premium coffee.",
            "Its two-story Museum of Transfiguration Monastery (MTM) houses Dom Martin's 50-piece vestment collection included in Philippines' 1998 centennial celebration.",
            "The Worship and Weave book on the vestments won the 2001 National Book Award (art category)."
        ],
        [
            "Nasuli Spring"
        ],
        [
            "Nasuli Spring"
        ],
        [
            "Located in Barangay Bangcud, this spring has blue waters deep enough for diving and swimming.",
            "It also serves as picnic grounds for families."
        ],
        [
            "Bukidnon Forests Inc., (BFI) industrial tree plantation"
        ],
        [
            "This 39,000-hectare reforestation project (21,000 hectares of which are plantable) demonstrates the compatibility of nature with economic objectives.",
            "Funded with the assistance of the New Zealand government under the auspices of DENR, the project has been operational since 1990.",
            "The City of Malaybalay and the municipalities of Impasugong, Manolo Fortich and Malitbog are the areas covered by the plantation.",
            "Its 5-hectare nursery is capable of producing 5.2 million fast-growing seedlings every year."
        ],
        [
            "Kaamulan Grounds"
        ],
        [
            "Located at Barangay 1, Kaamulan Grounds serves as an activity area, refuge and recollection, picnic and other outdoor activities.",
            "The Folk Arts Theater, where some provincial activities and events are held, is also found here."
        ],
        [
            "Carmelite Monastery"
        ],
        [
            "The Carmelite Sister's Monastery is a place for retreat and prayer.",
            "It is at Pal-ing, Barangay Patpat; some 5 km from the city proper bound to the west."
        ],
        [
            "Mt.",
            "Capistrano viewed from Barangay CabangahanView from the summit of Mt.",
            "Capistrano"
        ],
        [
            "Mt.",
            "Capistrano"
        ],
        [
            "Famous as the evacuation area in World War II, this mountain is characterized by its rock formations and caves.",
            "Nature trekkers and mountain climbers find a good spot at the top, albeit rough and sharp, to see a vista of Bukidnon's grandeur as it offers views of the nearby mountains and the acres of rice and cornfields.",
            "Located at Barangay Managok, it is 18 km from the City of Malaybalay proper bound south."
        ],
        [
            "Roxas Monument"
        ],
        [
            "Roxas Monument is a historical park whose principal feature is the monument of the Philippine's first president of the independent Republic, Manuel Roxas.",
            "History has it that President Roxas hid secretly in the old school, now known as Casisang Central Integrated School, after escaping from Japanese Imperial Army at the height of World War II on his way to Australia.",
            "The monument was erected in honor of Roxas’ brief stay as well as to remember the WWII prisoners of war.",
            "The Roxas Monument is located at Casisang, Malaybalay – a few minutes ride going South from the city proper."
        ],
        [
            "Dalwangan Centennial Marker"
        ],
        [
            "This is the spot identified to be where the Northern and Southern Army of the US Air Force linked in World War II.",
            "The centennial marker is erected at Barangay Dalwangan, City of Malaybalay."
        ],
        [
            "Torre ni David (David's Tower)"
        ],
        [
            "Is a popular edifice along the highway of Cabangahan, Malaybalay.",
            "This old three-storey house was built in 1962 by David Valmorida.",
            "An old article which was featured in Inquirer.net in 2007 reported that there are some strange and unexplained occurrences in this house."
        ],
        [
            "Ereccion de Pueblo"
        ],
        [
            "The monument of creation of the town is proudly standing at Plaza Rizal.",
            "It depicts the 1877 agreement between the Spanish Colonizers and local leaders such as Datu Mampaalong"
        ],
        [
            "D' Stable Eco Resort (Quadra)"
        ],
        [
            "D' Stable Eco Resort is more popularly known as Quadra.",
            "It is located in Santa Cruz, Sumpong, Malaybalay, close to Shepherds Meadow Memorial Park.",
            "Quadra has a ranch-like setting, with a horses, stables, huts and cottages built on grassy grounds and a mountain view backdrop.",
            "Accommodation and horseback riding may also be available."
        ],
        [
            "Two Trees"
        ],
        [
            "The Two Trees is a part of the Provincial Tree Park of Bukidnon, which the Northern Entrance is at the Kaamulan Grounds and its Southern Entrance is at Gawad Kalinga (also known as Capitol Village), Barangay 9.",
            "The Park is traversed by the Kalawaig River, a tributary of Sawaga River, the major river of Malaybalay City (except in the Upper Pulangi District where the Pulangi River reigns), which starts at Barangay 1."
        ],
        [
            "Monastery of Carmelite Nuns"
        ],
        [
            "The monastery nuns provide an environment of natural attractions with its grounds as well as spiritual blessings of peace renewal."
        ],
        [
            "Jesuit Retreat House"
        ],
        [
            "Primarily a retreat center, its well kept grounds being on the banks of a creek offer the intrepid a climbing experience amidst a mini rainforest ambiance."
        ],
        [
            "MKAETDC or The Mt.",
            "Kitanglad Agriculture and Ecological Center"
        ],
        [
            "Is a Gawad Saka 2006 First-place winner for showcasing an ecological and agricultural all organic, all natural lifestyle.",
            "This is a site for bird watching, trekking, camping, fishing and eco-walk.",
            "Being situated at the foothill of Mr. Kitanglad, a rare flight of the Bukidnon eagle could be in your sights as you walk along misty eco- trails with a cool temperature to equal that of Trinidad valley in Mt.",
            "Province.",
            "The site hosts conferences and seminars."
        ],
        [
            "Lapanday Farm"
        ],
        [
            "The sweetest pineapples exported fresh are from this Filipino agri-corporation.",
            "Its plantations are located in different sites and the headquarters are found not more than a 10-minute drive from the city's commercial section.",
            "This is owned by the Lorenzo family, a name long associated with the pineapples and agriculture."
        ],
        [
            "Nomiarc and Stock Farm"
        ],
        [
            "This area is the site of farm showcases where animals of good stocks (bred) and high value vegetables are seeded and tested for research by government technicians."
        ],
        [
            "Nature Park and Swimming Pool"
        ],
        [
            "This natural attraction features scenic environs the site of a varied flora and fauna, providing varied environmental activities of which bird watching is one.",
            "A swimming pool and another for children welcome the daring to try clean, coolest water.",
            "Located at Kimambong, Barangay Sumpong"
        ],
        [
            "Hernandez Ranch"
        ],
        [
            "Owned privately by the Hernandez family, the site was developed with horseback riding trails, swimming pools and fishing grounds."
        ],
        [
            "Q Park II"
        ],
        [
            "Here's a new place ideal for prayer and reflection in Bukidnon, Mindanao, Philippines.",
            "Q Park II, located at Barangay Kalasungay, Malaybalay, boasts of a lawn, a view of the Bukidnon mountain ranges and Malaybalay's signature cool breeze.",
            "An alternative to the Monastery of Transfiguration, which is also located in Malaybalay.",
            "Admission to Q Park II is free and this park is open from 9 am to 5 pm, Tuesday to Sunday.",
            "Closed on Mondays."
        ],
        [
            "Matin-ao Spring Resort"
        ],
        [
            "Matin-ao resort is located about 21 kilometers from Malaybalay proper and 8 kilometers away from Valencia City.",
            "Compared to Nasuli, Matin-ao has more shallow areas making it a safe place to swim for children."
        ],
        [
            "Sports"
        ],
        [
            "Malaybalay City Plaza"
        ],
        [
            "The city offers a variety of sports venues, including basketball courts, chess clubs, a bowling alley, a pelota court, and a total of 10 tennis courts.",
            "Impressively, each of the city's barangays features at least one basketball court, with some boasting 2 or more, contributing to a total of 60 basketball courts.",
            "Furthermore, Badminton has experienced a resurgence in popularity, leading to the establishment of four new facilities dedicated to this sport, including the conversion of the former Belyca Cinema."
        ],
        [
            "In addition to these recreational options, the city hosts four gymnasiums and auditoriums, used not only for sporting events but also for various public programs and gatherings.",
            "For cinema entertainment, residents typically travel to Valencia or Cagayan de Oro."
        ],
        [
            "Exciting developments are on the horizon, with plans for the construction of the Bukidnon Sports and Cultural Complex in barangay Laguitas.",
            "This complex will feature a track oval, swimming pool, and other related facilities, adding to the city's sporting infrastructure."
        ],
        [
            "For relaxation and leisure, Malaybalay boasts four spring resorts situated in Nasuli, Bangcud, and Managok, along with four plazas or parks.",
            "Additionally, there are plans for the creation of well-maintained public open spaces in the city."
        ],
        [
            "Furthermore, the Bukidnon Provincial Zoological Park, established in 2019 at the Kaamulan Grounds, offers a unique attraction for animal enthusiasts and visitors."
        ],
        [
            "Government"
        ],
        [
            "Mayors of Malaybalay"
        ],
        [
            "Mayor"
        ],
        [
            "Years"
        ],
        [
            "Juan Melendez"
        ],
        [
            "1903–1908"
        ],
        [
            "Fernando Damasco"
        ],
        [
            "1909–1913"
        ],
        [
            "Jose Ruiz"
        ],
        [
            "1914–1918"
        ],
        [
            "Juan Melendez"
        ],
        [
            "1924–1936"
        ],
        [
            "Faustino Caterial"
        ],
        [
            "1936–1937"
        ],
        [
            "Catalino Damasco"
        ],
        [
            "1937–1939"
        ],
        [
            "Gerardo Pimentel"
        ],
        [
            "1940–1941"
        ],
        [
            "Salvador Alberto"
        ],
        [
            "1943–1947"
        ],
        [
            "Teofilo Salcedo"
        ],
        [
            "1948–1951"
        ],
        [
            "Fortunato Carbajal, Sr."
        ],
        [
            "1951–1955"
        ],
        [
            "Lorenzo S. Dinlayan"
        ],
        [
            "1955–1971"
        ],
        [
            "Timoteo C. Ocaya"
        ],
        [
            "1972–1979"
        ],
        [
            "Edilberto B. Mamawag"
        ],
        [
            "1979-1980*"
        ],
        [
            "Reginaldo N. Tilanduca"
        ],
        [
            "1980–1986"
        ],
        [
            "Violeta T. Labaria"
        ],
        [
            "1986*"
        ],
        [
            "Almaco A. Villanueva"
        ],
        [
            "1987*"
        ],
        [
            "Rogelio M. Bides"
        ],
        [
            "1988*"
        ],
        [
            "Reginaldo N. Tilanduca"
        ],
        [
            "1988–1992"
        ],
        [
            "Bob Tabios-Casanova"
        ],
        [
            "April 1992-June 1992"
        ],
        [
            "Nicolas C. Jurolan"
        ],
        [
            "1992–2001"
        ],
        [
            "Florencio T. Flores, Jr."
        ],
        [
            "2001–2010"
        ],
        [
            "Ignacio W. Zubiri"
        ],
        [
            "2010–2019"
        ],
        [
            "Florencio T. Flores, Jr.  Jay Warren R. Pabillaran – OIC Mayor"
        ],
        [
            "2019–2022"
        ],
        [
            "Jay Warren R. Pabillaran"
        ],
        [
            "2022–2025"
        ],
        [
            "City administration"
        ],
        [
            "The city is administered by the City Mayor together with the Vice Mayor and the Sangguniang Panlungsod.",
            "The mayor is the local chief executive officer of the city and exercises control and supervision over all local administrative offices as mandated by the Local government code of the Philippines (1991).",
            "The city also has a City Administrator that assists the mayor."
        ],
        [
            "The Sangguniang Panlungsod (or SP) serves as the local legislative arm of the city.",
            "It enacts ordinances and issues regulations that are necessary to promote the propriety and general welfare of the city's residents; ensure the health, safety, comfort and convenience of its constituents, maintain peace and order, improve and promote high public morals, and ensure the protection of the properties within the city's jurisdiction.",
            "There are 12 elected Sangguniang members and a permanent Sangguniang Panlungsod secretary.",
            "The Sangguniang Panlungsod is headed by the Vice Mayor, acting as its presiding officer.",
            "There are twelve (12) elected Sanggunian members and one permanent Sangguniang Panlungsod secretary."
        ],
        [
            "Malaybalay 46 barangays each headed by a barangay chairman together with seven Sangguniang Barangay members."
        ],
        [
            "Malaybalay City Hall"
        ],
        [
            "The Provincial Capitol of the province of Bukidnon is in Malaybalay."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "View of Sayre Highway and the downtown Malaybalay"
        ],
        [
            "Roads and highways"
        ],
        [
            "There are about 820.89 kilometers of road linking the different parts of the city.",
            "102.70 km or 12.51% are classified as National Road, 60.40 km or 7.36% Provincial Road, 61.35 km or 7.47% City Road, and 596.44 km or 72.66% barangay roads.",
            "About 14.14% of all roads in the city are paved, that is, either concrete or asphalt.",
            "These are in the poblacion areas.",
            "At least 85.86% are unpaved (gravel or earth filled).",
            "These are primarily the barangay roads.",
            "These unpaved roads leading to the rural barangays usually require regular maintenance since they are easily destroyed by heavy rains.",
            "There are also logging roads leading to the forestal communities, but these are usually passable by farm animals and single motor cycles only, making it hard for communities to transport products into the market."
        ],
        [
            "Connecting the various road networks and cutting across rivers and creeks are at least 22 bridges of various types.",
            "Almost all of these bridges are said to be in good condition.",
            "There are 15 bridges or 69.35% totaling to about 470.67 m in length that are administered nationally, while 3 bridges of about 115.00 m are under the province's administration.",
            "Only about 93.00 m or about 13.70% are under the administration of city and barangays."
        ],
        [
            "The Sayre Highway bisects the Poblacion, the main urban center of the city, serving as the main thoroughfare of the city."
        ],
        [
            "The current main highway in the city center is now congested.",
            "Heavy traffic and congestion has been observed in the main highway, especially during peak hours.",
            "The absence of proper and adequate parking areas further contributes to the congestion.",
            "The situation underlies the need for a bypass road as well as more traffic aides.",
            "The city has two proposed roads to answer the above concerns.",
            "The first proposal is the Circumferential Road from Sumpong to DPWH Depot in Casisang, which is 2.5 km.",
            "in length.",
            "The other is the by-pass road from Dalwangan to San Jose with a total stretch of 15 km.",
            "The Butuan-Malaybalay Road becomes the secondary road connecting Esperanza, Agusan del Sur, which is scheduled to complete in the future."
        ],
        [
            "Public transportation"
        ],
        [
            "There are various types of public transportation.",
            "Buses that ply the Bukidnon, Cagayan de Oro, General Santos, Butuan and Davao City route are used for travel from the city to other provinces.",
            "There are also mini-vans that transport passengers from Cagayan de Oro to Malaybalay.",
            "The multi-cabs ply the main highway from the poblacion proper to other points of destination within the city and nearby barangays.",
            "The four-wheeled motorelas are limited to the inner streets.",
            "Recently, tri-sikads have also begun to operate in the inner streets of Barangay Sumpong.",
            "Jeepneys are usually used for travel from the poblacion to other barangays and municipalities.",
            "In far-flung areas, motorcycles (habal-habal) are the fastest means of transportation."
        ],
        [
            "The main terminal for public transportation vehicles is in the public market, especially for buses, mini-vans, and jeepneys.",
            "For motorelas and tri-sikads, street-corners of convergence serve as terminals or waiting areas."
        ],
        [
            "With the increase in traffic of both vehicles and pedestrians, especially in the poblacion, there is a growing concern for better and safer organized streets.",
            "There is a need to designate walking pavements or pedestrian lanes, including pedestrian overpass especially for the use of children and students crossing the major highway."
        ],
        [
            "Airports and seaports"
        ],
        [
            "Malaybalay once had an airport located at Barangay Casisang but closed in the 1990s by the provincial government to give land for housing; the nearest one is the Laguindingan Airport in Cagayan de Oro.",
            "The city also relies on the Cagayan de Oro seaport for the delivery of its products to other destinations in the Philippines as it is the closest port to the city."
        ],
        [
            "Housing Development"
        ],
        [
            "To close the housing gap of 6.5 million between 2017 and 2020, the government needs to build 250,000 houses a year.",
            "Currently, however, the housing sector can only build 203,000 to 205,000 units annually between 2016 and 2019."
        ],
        [
            "Housing developments in Malaybalay includes Salang Homes Subdivision, Lumina Homes, Greenfields Subdivision, Dumalahay Subdivision, and Legacie Country Homes."
        ],
        [
            "Utilities"
        ],
        [
            "Electricity"
        ],
        [
            "All the 46 barangays are already energized.",
            "Majority or 57.07% of the city's households have electricity for lighting.",
            "39.88% of households still use kerosene."
        ],
        [
            "Malaybalay is served by the Bukidnon Second Electric Cooperative Incorporated or BUSECO, which started its operations in 1979 (Table 77: Number of Connections by Type of Users and Average Consumption).",
            "Recent data from BUSECO indicate a total of 16,157 power connections.",
            "Of these 14,107 or 87.31% are residential connections, while 1,454 or 9.00% are commercial establishments."
        ],
        [
            "While the number of household connections is 9 times more than the combined industrial and commercial connections, the average monthly consumption of households is 3.06% less than the latter.",
            "In actual number, businesses use at least 73,560.39 kWh per month more than households.",
            "This trend is not surprising because businesses tend to use more electricity than households."
        ],
        [
            "However, the data underlines the need to plan ahead to ensure that there is enough power supply for the city's growing power demands.",
            "Already, at least 43% of the population remains without electricity and those who do have experience regular power outage.",
            "This sector needs attention especially with the expected increase in population as well as business establishments."
        ],
        [
            "Water"
        ],
        [
            "The water system and services of Malaybalay is provided by Malaybalay City Water District (MCWD) in which its office is located in Barangay Sumpong."
        ],
        [
            "Telecommunications, Media and Courier Services"
        ],
        [
            "There are 2 major telephone companies in the city, the Southern Telecommunications Company (SOTELCO) and Philcom.",
            "Both Philcom and Sotelco offer Internet connections.",
            "Mobile phone services available in the city include Globe, Smart, TM and Sun.",
            "With the growing demand for better communication systems companies are facing the challenge of providing better and higher quality services to the population."
        ],
        [
            "Broadcast media include 5 radio and 2 television repeater stations, including a cable station.",
            "Most national dailies such as the Philippine Daily Inquirer and Philippine Star are available.",
            "Local newspapers include the Bukidnon Newswatch, Gold Star Daily and Bukidnon Plateau."
        ],
        [
            "There are 4 major courier services available in the city for national and international forwarding.",
            "The post office, the Bureau of Telecommunication and 2 telegraphic companies serve other communication needs."
        ],
        [
            "The telecommunication technologies have continued to improve over the years.",
            "But the mode of communication in the upland barangays are still the old and tested letter sending through vehicle drivers and broadcasting over the public radio stations."
        ],
        [
            "The city's mobile and internet services are provided by Globe Telecom, PLDT, Parasat Cable TV and Smart Communications."
        ],
        [
            "Law enforcement"
        ],
        [
            "The Malaybalay Police Station is responsible for the protection of the city's population against crime.",
            "Data for year 2005 indicate that the police force is 76 and serving a population of 136,210.",
            "This translates to a ratio of 1 policeman for every 1,792 persons in the city.",
            "Ideal ratio for police to population is 1:500 and the minimum standard police-population ratio is 1:1,000.",
            "In terms of area coverage, this translates to 1 policeman for every 1,424 hectares."
        ],
        [
            "There are 9 police community precincts located in Sumpong, Dalwangan, Casisang, Aglayan, Managok, Bangcud, Zamboangita, Can-ayan and Barangay 9 (Public Market).",
            "The police force to population ratio is highest in Casisang with 1 policeman for every 13,874 individuals.",
            "Lowest ratio is in Sumpong with 1:151.",
            "A low ratio indicates that there are more policemen available to serve the population of a given area."
        ],
        [
            "Further analysis indicates that based on the total population, the number of existing police force and the minimum police-population ratio of 1:1,000, the city still needs 606 policemen."
        ],
        [
            "Malaybalay City host 2 military and police camps.",
            "One is the Camp Ramon M. Onahon, located at Barangay 7.",
            "It is the provincial headquarters of the Philippine National Police.",
            "The other one is Camp Osito Bahian, located at Impalambong, Barangay 10.",
            "It is the home of the 403rd Infantry Brigade"
        ],
        [
            "Barangay Public Safety Officer (BPSO) also assists in the peace-keeping efforts at the barangay level."
        ],
        [
            "Medical facilities"
        ],
        [
            "Bukidnon Provincial Medical Center"
        ],
        [
            "Bethel Baptist Hospital, Inc."
        ],
        [
            "Malaybalay Polymedic General Hospital"
        ],
        [
            "Malaybalay Medical Hospital"
        ],
        [
            "St. Jude Thaddeus General Hospital"
        ],
        [
            "Education"
        ],
        [
            "Bukidnon State University"
        ],
        [
            "Colleges and universities"
        ],
        [
            "Malaybalay City has four tertiary schools, found in the Poblacion area:"
        ],
        [
            "Bukidnon State University (BukSU)"
        ],
        [
            "San Isidro College (SIC)"
        ],
        [
            "Mindanao Arts and Technological Institute (MATI)"
        ],
        [
            "STI College Malaybalay"
        ],
        [
            "Primary and secondary schools"
        ],
        [
            "Bukidnon National High School grounds"
        ],
        [
            "The city has 64 primary/elementary schools and 13 secondary schools, under the Division of Malaybalay City.",
            "Almost every barangay has at least one primary/elementary school, while secondary schools are strategically located in areas with higher population.",
            "Majority of the primary and secondary schools are run by the government through the Department of Education."
        ],
        [
            "Public Schools"
        ],
        [
            "District"
        ],
        [
            "School Name"
        ],
        [
            "School ID"
        ],
        [
            "Location"
        ],
        [
            "I"
        ],
        [
            "Capitán Angel Elementary School"
        ],
        [
            "126583"
        ],
        [
            "Capitán Angel"
        ],
        [
            "I"
        ],
        [
            "Dalwangan Elementary School"
        ],
        [
            "126580"
        ],
        [
            "Dalwangan"
        ],
        [
            "I"
        ],
        [
            "Kalasungay Central School"
        ],
        [
            "126582"
        ],
        [
            "Kalasungay"
        ],
        [
            "I"
        ],
        [
            "Kalasungay National High School"
        ],
        [
            "314915"
        ],
        [
            "Kalasungay"
        ],
        [
            "I"
        ],
        [
            "New Ilocos Elementary School"
        ],
        [
            "126589"
        ],
        [
            "Dalwangan"
        ],
        [
            "I"
        ],
        [
            "Patpat Elementary School"
        ],
        [
            "126590"
        ],
        [
            "Patpat"
        ],
        [
            "II"
        ],
        [
            "Baganao Elementary School"
        ],
        [
            "126575"
        ],
        [
            "Kibalabag"
        ],
        [
            "II"
        ],
        [
            "Can-ayan Integrated School"
        ],
        [
            "314917"
        ],
        [
            "Can-ayan"
        ],
        [
            "II"
        ],
        [
            "Candiisan Elementary School"
        ],
        [
            "126578"
        ],
        [
            "Can-ayan"
        ],
        [
            "II"
        ],
        [
            "KIbalabag Elementary School"
        ],
        [
            "126584"
        ],
        [
            "Kibalabag"
        ],
        [
            "II"
        ],
        [
            "Kilap-agan Elementary School"
        ],
        [
            "126585"
        ],
        [
            "Can-ayan"
        ],
        [
            "II"
        ],
        [
            "Manalog Elementary School"
        ],
        [
            "126587"
        ],
        [
            "Manalog"
        ],
        [
            "II"
        ],
        [
            "Sumpong Central School"
        ],
        [
            "126593"
        ],
        [
            "Sumpong"
        ],
        [
            "II"
        ],
        [
            "Tag-ilanao Elementary School"
        ],
        [
            "126594"
        ],
        [
            "Can-ayan"
        ],
        [
            "II"
        ],
        [
            "Tintinaan Elementary School"
        ],
        [
            "126595"
        ],
        [
            "Can-ayan"
        ],
        [
            "III"
        ],
        [
            "Bukidnon National High School"
        ],
        [
            "303950"
        ],
        [
            "Barangay 03"
        ],
        [
            "III"
        ],
        [
            "Bukidnon National High School – Dalwangan Annex"
        ],
        [
            "325504"
        ],
        [
            "Dalwangan"
        ],
        [
            "III"
        ],
        [
            "Bukidnon National High School – Imbayao Annex"
        ],
        [
            "325503"
        ],
        [
            "Imbayao"
        ],
        [
            "III"
        ],
        [
            "Imbayao Elementary School"
        ],
        [
            "126581"
        ],
        [
            "Imbayao"
        ],
        [
            "III"
        ],
        [
            "Santa Ana Elementary School"
        ],
        [
            "125592"
        ],
        [
            "Casisang"
        ],
        [
            "IV"
        ],
        [
            "Barangay 09 Elementary School"
        ],
        [
            "199510"
        ],
        [
            "Barangay 09"
        ],
        [
            "IV"
        ],
        [
            "BCT Elementary School"
        ],
        [
            "126576"
        ],
        [
            "Barangay 10"
        ],
        [
            "IV"
        ],
        [
            "Casisang National High School"
        ],
        [
            "314914"
        ],
        [
            "Casisang"
        ],
        [
            "IV"
        ],
        [
            "Malaybalay City Central School"
        ],
        [
            "126586"
        ],
        [
            "Barangay 04"
        ],
        [
            "V"
        ],
        [
            "Airport Village Elementary School"
        ],
        [
            "126574"
        ],
        [
            "Casisang"
        ],
        [
            "V"
        ],
        [
            "Casisang Central Integrated School"
        ],
        [
            "126579"
        ],
        [
            "Casisang"
        ],
        [
            "V"
        ],
        [
            "Mabuhay Elementary School"
        ],
        [
            "126565"
        ],
        [
            "San Jose"
        ],
        [
            "V"
        ],
        [
            "Malaybalay City National Science High School"
        ],
        [
            "314904"
        ],
        [
            "Aglayan"
        ],
        [
            "V"
        ],
        [
            "Natid-asan Elementary School"
        ],
        [
            "126588"
        ],
        [
            "Casisang"
        ],
        [
            "V"
        ],
        [
            "Panamucan Elementary School"
        ],
        [
            "126551"
        ],
        [
            "San Jose"
        ],
        [
            "V"
        ],
        [
            "San Jose Elementary School"
        ],
        [
            "126591"
        ],
        [
            "San Jose"
        ],
        [
            "VI"
        ],
        [
            "Aglayan Central School"
        ],
        [
            "126557"
        ],
        [
            "Aglayan"
        ],
        [
            "VI"
        ],
        [
            "Balangbang Elementary School"
        ],
        [
            "126535"
        ],
        [
            "Laguitas"
        ],
        [
            "VI"
        ],
        [
            "Bendolan Elementary School"
        ],
        [
            "126559"
        ],
        [
            "Magsaysay"
        ],
        [
            "VI"
        ],
        [
            "Cabangahan Elementary School"
        ],
        [
            "126561"
        ],
        [
            "Cabangahan"
        ],
        [
            "VI"
        ],
        [
            "Laguitas Elementary School"
        ],
        [
            "126564"
        ],
        [
            "Laguitas"
        ],
        [
            "VI"
        ],
        [
            "Magsaysay Elementary School"
        ],
        [
            "126567"
        ],
        [
            "Magsaysay"
        ],
        [
            "VI"
        ],
        [
            "Malaybalay City National High School"
        ],
        [
            "314916"
        ],
        [
            "San Jose"
        ],
        [
            "VI"
        ],
        [
            "Mapayag Elementary School"
        ],
        [
            "126569"
        ],
        [
            "Mapayag"
        ],
        [
            "VII"
        ],
        [
            "Bangcud Central School"
        ],
        [
            "126558"
        ],
        [
            "Bangcud"
        ],
        [
            "VII"
        ],
        [
            "Bangcud National High School"
        ],
        [
            "303946"
        ],
        [
            "Bangcud"
        ],
        [
            "VII"
        ],
        [
            "Binalbagan Elementary School"
        ],
        [
            "126560"
        ],
        [
            "Simayà"
        ],
        [
            "VII"
        ],
        [
            "Calawag Elementary School"
        ],
        [
            "126562"
        ],
        [
            "Ápò Macote"
        ],
        [
            "VII"
        ],
        [
            "Dapulan Elementary School"
        ],
        [
            "126563"
        ],
        [
            "Ápò Macote"
        ],
        [
            "VII"
        ],
        [
            "Macote Elementary School"
        ],
        [
            "126566"
        ],
        [
            "Ápò Macote"
        ],
        [
            "VII"
        ],
        [
            "Padernal Elementary School"
        ],
        [
            "126570"
        ],
        [
            "Santo Niño"
        ],
        [
            "VII"
        ],
        [
            "Simayà Elementary School"
        ],
        [
            "126573"
        ],
        [
            "Simayà"
        ],
        [
            "VIII"
        ],
        [
            "Apò Macote National High School"
        ],
        [
            "325505"
        ],
        [
            "Ápò Macote"
        ],
        [
            "VIII"
        ],
        [
            "Lalawan Elementary School"
        ],
        [
            "126542"
        ],
        [
            "Linabò"
        ],
        [
            "VIII"
        ],
        [
            "Linabò Central School"
        ],
        [
            "126544"
        ],
        [
            "Linabò"
        ],
        [
            "VIII"
        ],
        [
            "Malapgap Elementary School"
        ],
        [
            "126568"
        ],
        [
            "Sinanglanan"
        ],
        [
            "VIII"
        ],
        [
            "Paiwaig Elementary School"
        ],
        [
            "199511"
        ],
        [
            "Linabò"
        ],
        [
            "VIII"
        ],
        [
            "San Martin Elementary School"
        ],
        [
            "126571"
        ],
        [
            "San Martin"
        ],
        [
            "VIII"
        ],
        [
            "San Martin Agro-Industrial National High School"
        ],
        [
            "303982"
        ],
        [
            "San Martin"
        ],
        [
            "VIII"
        ],
        [
            "San Roque Elementary School"
        ],
        [
            "126572"
        ],
        [
            "Sinanglanan"
        ],
        [
            "VIII"
        ],
        [
            "Sawaga Elementary School"
        ],
        [
            "126552"
        ],
        [
            "Violeta"
        ],
        [
            "IX"
        ],
        [
            "Bagong Silang Elementary School"
        ],
        [
            "126534"
        ],
        [
            "Maligaya"
        ],
        [
            "IX"
        ],
        [
            "Dumayas Elementary School"
        ],
        [
            "126539"
        ],
        [
            "Maligaya"
        ],
        [
            "IX"
        ],
        [
            "Langasihan Elementary School"
        ],
        [
            "126543"
        ],
        [
            "Managók"
        ],
        [
            "IX"
        ],
        [
            "Lunokan Elementary School"
        ],
        [
            "126545"
        ],
        [
            "Miglamin"
        ],
        [
            "IX"
        ],
        [
            "Maligaya Elementary School"
        ],
        [
            "126546"
        ],
        [
            "Maligaya"
        ],
        [
            "IX"
        ],
        [
            "Managók Central School"
        ],
        [
            "126547"
        ],
        [
            "Managók"
        ],
        [
            "IX"
        ],
        [
            "Managók National High School"
        ],
        [
            "303973"
        ],
        [
            "Managók"
        ],
        [
            "IX"
        ],
        [
            "Managók National High School – Lalawan Annex"
        ],
        [
            "325501"
        ],
        [
            "Linabò"
        ],
        [
            "IX"
        ],
        [
            "Managók National High School – Miglamin Annex"
        ],
        [
            "314920"
        ],
        [
            "Miglamin"
        ],
        [
            "IX"
        ],
        [
            "Matangpatang Elementary School"
        ],
        [
            "126549"
        ],
        [
            "Miglamin"
        ],
        [
            "IX"
        ],
        [
            "Miglamin Elementary School"
        ],
        [
            "126550"
        ],
        [
            "Miglamin"
        ],
        [
            "X"
        ],
        [
            "Busdì Integrated School"
        ],
        [
            "325502"
        ],
        [
            "Busdì"
        ],
        [
            "X"
        ],
        [
            "Caburacanan Elementary School"
        ],
        [
            "126537"
        ],
        [
            "Caburacanan"
        ],
        [
            "X"
        ],
        [
            "Indalasà Elementary School"
        ],
        [
            "126540"
        ],
        [
            "Indalasà"
        ],
        [
            "X"
        ],
        [
            "Kibalabag (Silae) Elementary School"
        ],
        [
            "199518"
        ],
        [
            "Silae"
        ],
        [
            "X"
        ],
        [
            "Kulaman Elementary School"
        ],
        [
            "126541"
        ],
        [
            "Kulaman"
        ],
        [
            "X"
        ],
        [
            "Mapulo Elementary School"
        ],
        [
            "126548"
        ],
        [
            "Mapulo"
        ],
        [
            "X"
        ],
        [
            "Saint Peter Elementary School"
        ],
        [
            "126554"
        ],
        [
            "Saint Peter"
        ],
        [
            "X"
        ],
        [
            "Silae Elementary School"
        ],
        [
            "126553"
        ],
        [
            "Silae"
        ],
        [
            "X"
        ],
        [
            "Silae National High School"
        ],
        [
            "303984"
        ],
        [
            "Silae"
        ],
        [
            "X"
        ],
        [
            "Silae National High School – Saint Peter Annex"
        ],
        [
            "314905"
        ],
        [
            "Saint Peter"
        ],
        [
            "X"
        ],
        [
            "Tuburan Elementary School"
        ],
        [
            "259006"
        ],
        [
            "Mapulo"
        ],
        [
            "X"
        ],
        [
            "Zamboanguita Central School"
        ],
        [
            "126556"
        ],
        [
            "Zamboanguita"
        ],
        [
            "Private Schools"
        ],
        [
            "Bethel Baptist Christian Academy"
        ],
        [
            "Casisang International Christian School"
        ],
        [
            "Marywoods Academy"
        ],
        [
            "St. John's School of Malaybalay City"
        ],
        [
            "Xific University Prep"
        ],
        [
            "Media"
        ],
        [
            "Parasat Cable TV and Prime Cable Network are prominent cable television providers in the city, known for their exceptional signal quality.",
            "GMA, a major network, boasts excellent reception through these providers.",
            "Their broadcasting towers are strategically perched at the summit of Mount Kitanglad, the fourth tallest peak in the Philippines.",
            "Additionally, satellite dish cable TV options like Cignal TV and Dream Satellite TV have gained popularity in the region."
        ],
        [
            "Radio stations have good and clear receptions in the city."
        ],
        [
            "AM Stations"
        ],
        [
            "DXDB Radyo Totoo 594 Malaybalay (Catholic Media Network)"
        ],
        [
            "DXMB RMN Malaybalay 648 (Radio Mindanao Network)"
        ],
        [
            "FM Stations"
        ],
        [
            "88.1 Radyo Bandera Malaybalay (Bandera News Philippines/Palawan Broadcasting Corporation)"
        ],
        [
            "89.5 Juander Radyo Malaybalay (SIAM Broadcasting Network/RSV Broadcasting Network, Inc.)"
        ],
        [
            "DXGH-FM 99.3 Magik FM (Century Broadcasting Network)"
        ],
        [
            "101.7 XFM Bukidnon (Rizal Memorial Colleges Broadcasting Corporation)"
        ],
        [
            "DXBU 104.5 (Bukidnon State University)"
        ],
        [
            "Praise Radio 105.3 (MIT Radio-TV Network)"
        ],
        [
            "106.3 Love Radio Malaybalay (Manila Broadcasting Company is the major radio station in the city."
        ],
        [
            "107.1 Happy FM (Iddes Broadcast Group)"
        ],
        [
            "Nations newspapers are available in the city like the Philippine Daily Inquirer, Philippine Star and Manila Bulletin.",
            "The Central Mindanao Newswatch is the major local newspaper distributor."
        ],
        [
            "Cities"
        ],
        [
            "Domestic"
        ],
        [
            "Valencia, Bukidnon"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Ozamiz"
        ],
        [
            "Tandag"
        ],
        [
            "Marawi"
        ],
        [
            "Tagum"
        ],
        [
            "Baguio"
        ],
        [
            "Iligan"
        ],
        [
            "International"
        ],
        [
            " Ürümqi, China"
        ],
        [
            " Lhasa, China"
        ],
        [
            "Notable personalities"
        ],
        [
            "Elenito Galido – Bishop of the Roman Catholic Diocese of Iligan"
        ],
        [
            "Archie Gamboa – 23rd Chief of the Philippine National Police, 2019–2020"
        ],
        [
            "Teofisto Guingona III – Philippine Senator, 2010–2016"
        ],
        [
            "Gerald Tabios – Elite endurance athlete"
        ],
        [
            "Migz Zubiri – Philippine Senator, 2007–2011; 2016–present"
        ],
        [
            "See also"
        ],
        [
            "Kaamulan Festival"
        ],
        [
            "References"
        ],
        [
            "^  City of Malaybalay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Cultural and Historical Sites & Events"
        ],
        [
            "^ \"Historical Background | THE CITY GOVERNMENT OF MALAYBALAY\".",
            "Retrieved January 5, 2023."
        ],
        [
            "^ El archipiélago filipino : colección de datos geográficos, estadísticos, cronológicos y científicos, relativos al mismo, entresacados de anteriores obras ú obtenidos con la propia observación y estudio / por algunos padres de la Misión de la Compañía de Jesús en estas islas ; .",
            "2005."
        ],
        [
            "^ Administrative Code for the Department of Mindanao and Sulu.",
            "Zamboanga: THE MINDANAO HERALD PUB.",
            "CO. 1918."
        ],
        [
            "^ a b c d e \"Commission on Population – Malaybalay City Profile\".",
            "Archived from the original on August 28, 2008.",
            "Retrieved April 30, 2008."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ \"Malaybalay City, Bukidnon Climatological Normal Values\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on October 18, 2018.",
            "Retrieved October 18, 2018."
        ],
        [
            "^ \"Malaybalay City, Bukidnon Climatological Extremes\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on October 18, 2018.",
            "Retrieved October 18, 2018."
        ],
        [
            "^ Malaybalay Socio-Economic Profile (2007).",
            "Malaybalay: City Government of Malaybalay."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ a b \"Diocese of Malaybalay\".",
            "Archived from the original on May 9, 2008.",
            "Retrieved May 9, 2008."
        ],
        [
            "^ \"Appeals for peace dominate Bukidnon madrasah's graduation rites\".",
            "Archived from the original on August 6, 2016.",
            "Retrieved July 29, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Official Website of City Government of Malaybalay\".",
            "Archived from the original on January 26, 2016.",
            "Retrieved December 29, 2015."
        ],
        [
            "^ Northern Mindanao–an exciting summer destination – Inquirer"
        ],
        [
            "^ \"R.A. No.",
            "8813, DECLARING MARCH TWENTY-TWO OF EVERY YEAR AS MALAYBALAY CITY CHARTER DAY AND a SPECIAL WORKING HOLIDAY IN THE CITY OF MALAYBALAY IN ORDER TO COMMEMORATE THE ANNIVERSARY OF THE SAID CITY - PhilippineLaw.info\".",
            "Archived from the original on July 14, 2014.",
            "Retrieved December 27, 2018."
        ],
        [
            "^ Malaybalay City Archived May 29, 2012, at the Wayback Machine,"
        ],
        [
            "^ showbizandstyle.inquirer.net A Healing Silence Archived October 22, 2008, at the Wayback Machine"
        ],
        [
            "^ a b c d e f g h i j k l \"Tourism\".",
            "Official Website of City Government of Malaybalay.",
            "Retrieved October 14, 2019."
        ],
        [
            "^ \"Malaybalay Bukidnon Tourist Spots and Tourist Attractions\".",
            "December 23, 2012."
        ],
        [
            "^ \"Bukidnon Photo Journal: D' Stable Eco Resort (Quadra), Malaybalay City\".",
            "September 19, 2010."
        ],
        [
            "^ \"EXPLORE MALAYBALAY CITY: The View from the Famous Two Trees\".",
            "May 15, 2012."
        ],
        [
            "^ a b c \"Official Website of City Government of Malaybalay\".",
            "Archived from the original on January 7, 2016.",
            "Retrieved December 28, 2015."
        ],
        [
            "^ Bolivar, Earl E. (December 15, 2010).",
            "\"Bukidnon Photo Journal: Matin-ao Spring in Bangcud, Malaybalay City\".",
            "Bukidnon Photo Journal.",
            "Retrieved October 14, 2019."
        ],
        [
            "^ \"PROJECT WATCH: Bukidnon Sports and Cultural Complex\".",
            "April 10, 2019."
        ],
        [
            "^ a b Malaybalay City Government Archived May 2, 2008, at the Wayback Machine"
        ],
        [
            "^ When the Sayre Highway reaches the Poblacion of Malaybalay City, it is known as Fortich Street, named after the first governor of the province of Bukidnon"
        ],
        [
            "^ Malaybalay City Transportation Archived May 3, 2008, at the Wayback Machine"
        ],
        [
            "^ a b c d \"Official Website of City Government of Malaybalay\".",
            "Archived from the original on January 26, 2016.",
            "Retrieved December 29, 2015."
        ],
        [
            "^ Ordinario, Cai (June 12, 2020).",
            "\"Citing 22-million backlog forecast, government steps up housing projects\".",
            "businessmirror.com.ph.",
            "Business Mirror.",
            "Retrieved March 5, 2021."
        ],
        [
            "^ \"BUSECO – Bukidnon Second Electric Cooperative, Inc\".",
            "Retrieved October 14, 2019."
        ],
        [
            "^ \"MCWD – Water is Life, Save It – The Official Website of the Malaybalay City Water District\".",
            "Retrieved October 14, 2019."
        ],
        [
            "^ \"Official Website of City Government of Malaybalay\".",
            "Archived from the original on January 26, 2016.",
            "Retrieved December 29, 2015."
        ],
        [
            "^ City of Malaybalay – Basic Services Archived May 2, 2008, at the Wayback Machine"
        ],
        [
            "^ \"Division of Malaybalay City Map\".",
            "October 20, 2012.",
            "Retrieved September 27, 2016."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Malaybalay."
        ],
        [
            "Wikimedia Commons has media related to Malaybalay."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Malaybalay"
        ],
        [
            "Sumilao"
        ],
        [
            "Impasugong"
        ],
        [
            "San Luis, Agusan del Sur"
        ],
        [
            "Mount Kitanglad"
        ],
        [
            "Malaybalay"
        ],
        [
            "La Paz, Agusan del SurLoreto, Agusan del Sur"
        ],
        [
            "Lantapan"
        ],
        [
            "Valencia"
        ],
        [
            "CabanglasanSan Fernando"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "vteNorthern Mindanao (Region X)Regional center"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Provinces"
        ],
        [
            "Bukidnon"
        ],
        [
            "Camiguin"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Iligan"
        ],
        [
            "Component cities"
        ],
        [
            "El Salvador"
        ],
        [
            "Gingoog"
        ],
        [
            "Malaybalay"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Tangub"
        ],
        [
            "Valencia"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Malaybalay"
        ],
        [
            "Mambajao"
        ],
        [
            "Oroquieta"
        ],
        [
            "Tubod"
        ],
        [
            "Municipalities"
        ],
        [
            "Aloran"
        ],
        [
            "Alubijid"
        ],
        [
            "Bacolod"
        ],
        [
            "Baliangao"
        ],
        [
            "Balingasag"
        ],
        [
            "Balingoan"
        ],
        [
            "Baloi"
        ],
        [
            "Baroy"
        ],
        [
            "Baungon"
        ],
        [
            "Binuangan"
        ],
        [
            "Bonifacio"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Calamba"
        ],
        [
            "Catarman"
        ],
        [
            "Clarin"
        ],
        [
            "Claveria"
        ],
        [
            "Concepcion"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Don Victoriano Chiongbian"
        ],
        [
            "Gitagum"
        ],
        [
            "Guinsiliban"
        ],
        [
            "Impasugong"
        ],
        [
            "Initao"
        ],
        [
            "Jasaan"
        ],
        [
            "Jimenez"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kapatagan"
        ],
        [
            "Kauswagan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kinoguitan"
        ],
        [
            "Kitaotao"
        ],
        [
            "Kolambugan"
        ],
        [
            "Lagonglong"
        ],
        [
            "Laguindingan"
        ],
        [
            "Lala"
        ],
        [
            "Lantapan"
        ],
        [
            "Libertad"
        ],
        [
            "Libona"
        ],
        [
            "Linamon"
        ],
        [
            "Lopez Jaena"
        ],
        [
            "Lugait"
        ],
        [
            "Magsaysay (Lanao del Norte)"
        ],
        [
            "Magsaysay (Misamis Oriental)"
        ],
        [
            "Mahinog"
        ],
        [
            "Maigo"
        ],
        [
            "Malitbog"
        ],
        [
            "Mambajao"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Manticao"
        ],
        [
            "Maramag"
        ],
        [
            "Matungao"
        ],
        [
            "Medina"
        ],
        [
            "Munai"
        ],
        [
            "Naawan"
        ],
        [
            "Nunungan"
        ],
        [
            "Opol"
        ],
        [
            "Panaon"
        ],
        [
            "Pangantucan"
        ],
        [
            "Pantao Ragat"
        ],
        [
            "Pantar"
        ],
        [
            "Plaridel"
        ],
        [
            "Poona Piagapo"
        ],
        [
            "Quezon"
        ],
        [
            "Sagay"
        ],
        [
            "Salay"
        ],
        [
            "Salvador"
        ],
        [
            "San Fernando"
        ],
        [
            "Sapad"
        ],
        [
            "Sapang Dalaga"
        ],
        [
            "Sinacaban"
        ],
        [
            "Sugbongcogon"
        ],
        [
            "Sultan Naga Dimaporo"
        ],
        [
            "Sumilao"
        ],
        [
            "Tagoloan (Lanao del Norte)"
        ],
        [
            "Tagoloan (Misamis Oriental)"
        ],
        [
            "Talakag"
        ],
        [
            "Talisayan"
        ],
        [
            "Tangcal"
        ],
        [
            "Tubod"
        ],
        [
            "Tudela"
        ],
        [
            "Villanueva"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "Articles Related to Malaybalay"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "vteLargest cities and municipalities in MindanaoPSA Census May 2020"
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            "Pop."
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            "Pop."
        ],
        [
            "Davao CityZamboanga City"
        ],
        [
            "1"
        ],
        [
            "Davao City"
        ],
        [
            "Davao Region"
        ],
        [
            "1,776,949"
        ],
        [
            "11"
        ],
        [
            "Panabo"
        ],
        [
            "Davao Region"
        ],
        [
            "209,230"
        ],
        [
            "Cagayan de OroGeneral Santos"
        ],
        [
            "2"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Zamboanga Peninsula"
        ],
        [
            "977,234"
        ],
        [
            "12"
        ],
        [
            "Marawi"
        ],
        [
            "Bangsamoro"
        ],
        [
            "207,010"
        ],
        [
            "3"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "728,402"
        ],
        [
            "13"
        ],
        [
            "Koronadal"
        ],
        [
            "Soccsksargen"
        ],
        [
            "195,398"
        ],
        [
            "4"
        ],
        [
            "General Santos"
        ],
        [
            "Soccsksargen"
        ],
        [
            "697,315"
        ],
        [
            "14"
        ],
        [
            "Malaybalay"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "190,712"
        ],
        [
            "5"
        ],
        [
            "Butuan"
        ],
        [
            "Caraga Region"
        ],
        [
            "372,910"
        ],
        [
            "15"
        ],
        [
            "Digos"
        ],
        [
            "Davao Region"
        ],
        [
            "188,376"
        ],
        [
            "6"
        ],
        [
            "Iligan"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "363,115"
        ],
        [
            "16"
        ],
        [
            "Polomolok"
        ],
        [
            "Soccsksargen"
        ],
        [
            "172,605"
        ],
        [
            "7"
        ],
        [
            "Cotabato City"
        ],
        [
            "Bangsamoro"
        ],
        [
            "325,079"
        ],
        [
            "17"
        ],
        [
            "Surigao City"
        ],
        [
            "Caraga Region"
        ],
        [
            "171,107"
        ],
        [
            "8"
        ],
        [
            "Tagum"
        ],
        [
            "Davao Region"
        ],
        [
            "296,202"
        ],
        [
            "18"
        ],
        [
            "Kidapawan"
        ],
        [
            "Soccsksargen"
        ],
        [
            "160,791"
        ],
        [
            "9"
        ],
        [
            "Valencia"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "216,546"
        ],
        [
            "19"
        ],
        [
            "Mati"
        ],
        [
            "Davao Region"
        ],
        [
            "147,547"
        ],
        [
            "10"
        ],
        [
            "Pagadian"
        ],
        [
            "Zamboanga Peninsula"
        ],
        [
            "210,452"
        ],
        [
            "20"
        ],
        [
            "Ozamiz"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "140,334"
        ],
        [
            "vte Provincial capital cities and municipalities of the PhilippinesLuzon"
        ],
        [
            "Abra: Bangued"
        ],
        [
            "Albay: Legazpi"
        ],
        [
            "Apayao: Kabugao / Luna1"
        ],
        [
            "Aurora: Baler"
        ],
        [
            "Bataan: Balanga"
        ],
        [
            "Batanes: Basco"
        ],
        [
            "Batangas: Batangas City"
        ],
        [
            "Benguet: La Trinidad"
        ],
        [
            "Bulacan: Malolos"
        ],
        [
            "Cagayan: Tuguegarao"
        ],
        [
            "Camarines Norte: Daet"
        ],
        [
            "Camarines Sur: Pili"
        ],
        [
            "Catanduanes: Virac"
        ],
        [
            "Cavite: Imus / Trece Martires1"
        ],
        [
            "Ifugao: Lagawe"
        ],
        [
            "Ilocos Norte: Laoag"
        ],
        [
            "Ilocos Sur: Vigan"
        ],
        [
            "Isabela: Ilagan"
        ],
        [
            "Kalinga: Tabuk"
        ],
        [
            "La Union: San Fernando"
        ],
        [
            "Laguna: Santa Cruz"
        ],
        [
            "Marinduque: Boac"
        ],
        [
            "Masbate: Masbate City"
        ],
        [
            "Mountain Province: Bontoc"
        ],
        [
            "Nueva Ecija: Palayan"
        ],
        [
            "Nueva Vizcaya: Bayombong"
        ],
        [
            "Occidental Mindoro: Mamburao"
        ],
        [
            "Oriental Mindoro: Calapan"
        ],
        [
            "Palawan: Puerto Princesa"
        ],
        [
            "Pampanga: San Fernando"
        ],
        [
            "Pangasinan: Lingayen"
        ],
        [
            "Quezon: Lucena"
        ],
        [
            "Quirino: Cabarroguis"
        ],
        [
            "Rizal: Antipolo"
        ],
        [
            "Romblon: Romblon"
        ],
        [
            "Sorsogon: Sorsogon City"
        ],
        [
            "Tarlac: Tarlac City"
        ],
        [
            "Zambales: Iba"
        ],
        [
            "Visayas"
        ],
        [
            "Aklan: Kalibo"
        ],
        [
            "Antique: San Jose de Buenavista"
        ],
        [
            "Biliran: Naval"
        ],
        [
            "Bohol: Tagbilaran"
        ],
        [
            "Capiz: Roxas"
        ],
        [
            "Cebu: Cebu City"
        ],
        [
            "Eastern Samar: Borongan"
        ],
        [
            "Guimaras: Jordan"
        ],
        [
            "Iloilo: Iloilo City"
        ],
        [
            "Leyte: Tacloban"
        ],
        [
            "Negros Occidental: Bacolod"
        ],
        [
            "Negros Oriental: Dumaguete"
        ],
        [
            "Northern Samar: Catarman"
        ],
        [
            "Samar: Catbalogan"
        ],
        [
            "Siquijor: Siquijor"
        ],
        [
            "Southern Leyte: Maasin"
        ],
        [
            "Mindanao"
        ],
        [
            "Agusan del Norte: Cabadbaran / Butuan1"
        ],
        [
            "Agusan del Sur: Prosperidad"
        ],
        [
            "Basilan: Lamitan / Isabela1"
        ],
        [
            "Bukidnon: Malaybalay"
        ],
        [
            "Camiguin: Mambajao"
        ],
        [
            "Cotabato: Kidapawan"
        ],
        [
            "Davao de Oro: Nabunturan"
        ],
        [
            "Davao del Norte: Tagum"
        ],
        [
            "Davao del Sur: Digos"
        ],
        [
            "Davao Occidental: Malita"
        ],
        [
            "Davao Oriental: Mati"
        ],
        [
            "Dinagat Islands: San Jose"
        ],
        [
            "Lanao del Norte: Tubod"
        ],
        [
            "Lanao del Sur: Marawi"
        ],
        [
            "Maguindanao del Norte: Datu Odin Sinsuat"
        ],
        [
            "Maguindanao del Sur: Buluan"
        ],
        [
            "Misamis Occidental: Oroquieta"
        ],
        [
            "Misamis Oriental: Cagayan de Oro"
        ],
        [
            "Sarangani: Alabel"
        ],
        [
            "South Cotabato: Koronadal"
        ],
        [
            "Sultan Kudarat: Isulan"
        ],
        [
            "Sulu: Jolo"
        ],
        [
            "Surigao del Norte: Surigao City"
        ],
        [
            "Surigao del Sur: Tandag"
        ],
        [
            "Tawi-Tawi: Bongao"
        ],
        [
            "Zamboanga del Norte: Dipolog"
        ],
        [
            "Zamboanga del Sur: Pagadian"
        ],
        [
            "Zamboanga Sibugay: Ipil"
        ],
        [
            "1 de facto seat of provincial government"
        ],
        [
            "Authority control databases: Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Malaybalay&oldid=1230399668\""
        ],
        [
            "Categories: Malaybalay1907 establishments in the PhilippinesCities in BukidnonMountain resorts in the PhilippinesPopulated places established in 1907Populated places on the Rio Grande de MindanaoProvincial capitals of the PhilippinesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataUse Philippine English from April 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2023Pages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataAll articles with unsourced statementsArticles with unsourced statements from March 2019Wikipedia articles with style issues from December 2023All articles with style issuesPages using multiple image with auto scaled imagesWikipedia articles with style issues from March 2019Commons category link from WikidataPages using largest cities with nav classArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}