{
    "name": "Malalag",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Malalag"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 6°36′N 125°24′E﻿ / ﻿6.6°N 125.4°E﻿ / 6.6; 125.4"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Davao del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Malalag\" – news · newspapers · books · scholar · JSTOR (May 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Davao Region, PhilippinesMalalagMunicipalityMunicipality of MalalagMunicipal Hall"
        ],
        [
            "FlagSealAnthem: MalalageneosMap of Davao del Sur with Malalag highlightedOpenStreetMapMalalagLocation within the PhilippinesCoordinates: 6°36′N 125°24′E﻿ / ﻿6.6°N 125.4°E﻿ / 6.6; 125.4CountryPhilippinesRegionDavao RegionProvinceDavao del SurDistrict"
        ],
        [
            "Lone districtFoundedMay 28, 1953Barangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPeter Paul T. Valentin • Vice MayorErvin S. Emphasis • RepresentativeMercedes C. Cagas • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Saniel J. MangubatHowell M. MedezFrancisco T. Valentin Jr.Gillen G. MontejoRodolfo C. Aringo Jr.Teresita C. MonroidStephine C. SasumanPatrocenio S. Alcoba"
        ],
        [
            " • Electorate25,956 voters (2022)Area • Revenue₱ 202.4 million (2020) • Assets₱ 466.5 million (2020) • Expenditure₱ 158.2 million (2020) • Liabilities₱ 164.1 million (2020)Service provider • ElectricityDavao del Sur Electric Cooperative (DASURECO)Time zoneUTC+8 (PST)ZIP code8010PSGC112408000IDD : area code +63 (0)82Native languagesDavawenyo Cebuano Kalagan Tagalog Ata ManoboWebsitewww.malalag.gov.ph"
        ],
        [
            "Malalag, officially the Municipality of Malalag (Cebuano: Lungsod sa Malalag; Tagalog: Bayan ng Malalag), is a 2nd class municipality in the province of Davao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 40,158 people."
        ],
        [
            "Malalag is the agricultural center of Davao del Sur, and its main products are banana, coconut and other fruits and vegetables.",
            "Other primary industries include fishing and mining."
        ],
        [
            "Etymology"
        ],
        [
            "Malalag derives its name from the color that describes the river running within the heart of the town.",
            "The water flowing towards the bay appeared yellowish.",
            "The natives referring to the river called it, “malalag nga tubig”, meaning “yellow water.”  The distinct appearance of the river attracted migrants to the place."
        ],
        [
            "Some pioneers trace the town's name from a disagreement between a Spanish soldier and Datu Alag, a famous chieftain among the early tribes.",
            "It was said that Datu Alag made an appointment with the Spaniard and promised him to be his guide.",
            "However, Datu Alag broke his promise and not one of his followers could tell where he has gone.",
            "Sensing that he had somehow been tricked, the Spanish soldier became enraged and shouted, “Mal Alag, Mal Alag.” (Bad Alag!)",
            "The tribe members confounded by his words kept on repeating it.",
            "The same story was told over the generations, so that even settlers coming from Visayas and Luzon became accustomed to calling the place Malalag."
        ],
        [
            "History"
        ],
        [
            "Malalag Health Center"
        ],
        [
            "Malalag Bay was previously known as Casilaran Bay, The name Malalag was applied to it some time during the Second World War after a Philippine National Police (PNP) barracks was established.",
            "The same area, now known as Crossing Baybay and adjacent to the 434th PNP Mobile Force Company barrack, was a center of commerce with Chinese traders.",
            "Also, the Malalag Wharf that is located about a kilometer away used to accommodate three to four sea vessels that loaded products for transport to Visayas."
        ],
        [
            "Malalag became a municipality by virtue of Executive Order No.",
            "596 dated May 28, 1953 issued by H.E.",
            "President Elpidio Quirino.",
            "This legal document stated that Malalag shall comprise the southern and south-eastern part of Padada and separated from its mother municipality of Padada by a straight west-to-east line passing through the Bolton Barrio Boundary Monument No.",
            "20, Santa Cruz Cadastre 275 Davao.",
            "Its boundary on the South was redefined under Republic Act 1008 stating among others that the boundary line between the municipalities of Padada and Malalag shall be from east to west of Balasinon River from the Gulf of Davao to Km.",
            "327 of the Digos-Malalag-Makar Road and a straight line along latitude 6°36' from the provinces of Davao and Cotabato.",
            "Even upon the creation of Sulop pursuant to Executive Order 295, the Padada-Malalag boundary as defined in R.A. 1008 was reiterated.",
            "For two decades, the boundary dispute arising from the encroachment of the Municipality of Sulop into the territory of Malalag remained unsettled."
        ],
        [
            "Originally, Malalag contained the Poblacion that is the seat of the Municipal Government, Bulacan, Bolton, Santa Maria, New Baclayon and Sulop.",
            "At present, it has fifteen (15) regular barangays: Poblacion, Baybay, Bulacan, Bolton, New Baclayon, Caputian, Bagumbayan, Ibo, Pitu, Tagansule, Kiblagon, Rizal, San Isidro, Mabini and Lapu-lapu."
        ],
        [
            "The Municipality used to celebrate \"Araw ng Malalag\" every 2nd day of July, but by virtue of Municipal Ordinance No.",
            "10 dated May 21, 1990, and consistent with its charter day, the celebration was transferred to May 28.",
            "On July 2, 1953, the first sets of local officials were appointed and assumed office, headed by Mayor Col. Antonio Lanzar."
        ],
        [
            "Since 1954, the municipal government has been run by the following elected mayors:"
        ],
        [
            "Felix M. Brandares 1954 - 1959"
        ],
        [
            "Angel Y. Carr 1959 - 1967"
        ],
        [
            "Judge Godofredo Cabahug 1967 - 1971"
        ],
        [
            "Andres B. Montejo 1971 - 1986"
        ],
        [
            "Dr. Zabino P. Zantua 1986 - 1988 (Appointed under the revolutionary government)"
        ],
        [
            "Andres B. Montejo 1988 - 1998"
        ],
        [
            "Givel M. Mamaril 1998–2007"
        ],
        [
            "Roel O. Paras 2007 – 2016"
        ],
        [
            "Peter Paul T. Valentin 2016–present"
        ],
        [
            "Malalag also harbors a \"Lumad\" tribe called \"Tagakaolo\".",
            "It comes from the phrase “olo sa tubig” which means inhabitants of headwater.",
            "These places have been the favored dwellings of the Kaolos."
        ],
        [
            "Their traditional territories are in Davao Del Sur and the Sarangani Province.",
            "The Tagakaolo tribe originally came from the western shores of the gulf of Davao and south of Mt.",
            "Apo a long time ago."
        ],
        [
            "In 1955, the barrios of Basiawan, Kibulan and the sitios of Kimatay and Kilalag were transferred from the town of Malita, Davao del Sur, to Malalag."
        ],
        [
            "Geography"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Malalag, Davao del Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "59(2.3)"
        ],
        [
            "46(1.8)"
        ],
        [
            "41(1.6)"
        ],
        [
            "54(2.1)"
        ],
        [
            "105(4.1)"
        ],
        [
            "159(6.3)"
        ],
        [
            "179(7.0)"
        ],
        [
            "197(7.8)"
        ],
        [
            "162(6.4)"
        ],
        [
            "147(5.8)"
        ],
        [
            "102(4.0)"
        ],
        [
            "65(2.6)"
        ],
        [
            "1,316(51.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.3"
        ],
        [
            "11.7"
        ],
        [
            "12.2"
        ],
        [
            "14.5"
        ],
        [
            "22.6"
        ],
        [
            "25.6"
        ],
        [
            "26.6"
        ],
        [
            "27.5"
        ],
        [
            "25.5"
        ],
        [
            "26.0"
        ],
        [
            "21.2"
        ],
        [
            "16.0"
        ],
        [
            "241.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Malalag is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Bagumbayan"
        ],
        [
            "Baybay"
        ],
        [
            "Bolton"
        ],
        [
            "Bulacan"
        ],
        [
            "Caputian"
        ],
        [
            "Ibo"
        ],
        [
            "Kiblagon"
        ],
        [
            "Lapla"
        ],
        [
            "Mabini"
        ],
        [
            "New Baclayon"
        ],
        [
            "Pitu"
        ],
        [
            "Poblacion"
        ],
        [
            "Tagansule"
        ],
        [
            "Rizal (Parame)"
        ],
        [
            "San Isidro"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MalalagYearPop.±% p.a.1960 40,153—    1970 34,764−1.43%1975 44,034+4.85%1980 44,690+0.30%1990 27,709−4.67%1995 30,733+1.96%2000 33,334+1.76%2007 35,241+0.77%2010 35,295+0.06%2015 38,731+1.79%2020 40,158+0.71%Source: Philippine Statistics Authority"
        ],
        [
            "The municipality in 1970 had a total population of 34,764 and in the 1980 official result it had a total of 44,690.",
            "In 1983, upon the court decision for case 1212 Boundary disputes between the Provinces of South Cotabato and Davao del Sur, there were 6 barangays in the Municipality of Malalag transferred to Malungon, South Cotabato.",
            "Consequently, there was a sudden decreased in population during the 1990 census.",
            "The population gradually increased from 27,709 in 1990 to 35,241 in 2007."
        ],
        [
            "Population and number of households by barangay"
        ],
        [
            "As of the 2007 census, the municipality had a total registered population of 35,241 with a total of 7,477 corresponding households.",
            "Out of the 15 barangays comprising Malalag, Barangay Poblacion has the largest population in the entire municipality (population 6,105) and the highest number of households (1,240 households), followed by the barangays of Bulacan (population 4,277), Baybay (population 3,619) and New Baclayon (population 3,483).",
            "Other barangays are moderately populated.",
            "Three barangays were identified as urban with a total population of 11,939: Poblacion, Baybay and Bagumbayan.",
            "The rural areas at present have a total population of 23,302 with 11 component rural barangays.",
            "The barangay of Bulacan is the largest among the rural barangays with a total population of 4,277 followed by Mabini and New Baclayon."
        ],
        [
            "Malalag Safe Birthing Home"
        ],
        [
            "Barangay"
        ],
        [
            "Population(2007)"
        ],
        [
            "Households(2007)"
        ],
        [
            "Population(2010)"
        ],
        [
            "Urban/Rural"
        ],
        [
            "Poblacion"
        ],
        [
            "6,105"
        ],
        [
            "1,240"
        ],
        [
            "6,156"
        ],
        [
            "Urban"
        ],
        [
            "Baybay"
        ],
        [
            "3,483"
        ],
        [
            "786"
        ],
        [
            "3,790"
        ],
        [
            "Urban"
        ],
        [
            "Bagumbayan"
        ],
        [
            "2,351"
        ],
        [
            "455"
        ],
        [
            "2,301"
        ],
        [
            "Urban"
        ],
        [
            "Bolton"
        ],
        [
            "1,794"
        ],
        [
            "379"
        ],
        [
            "1,860"
        ],
        [
            "Rural"
        ],
        [
            "Bulacan"
        ],
        [
            "4,277"
        ],
        [
            "874"
        ],
        [
            "4,213"
        ],
        [
            "Rural"
        ],
        [
            "Caputian"
        ],
        [
            "1,756"
        ],
        [
            "362"
        ],
        [
            "1,589"
        ],
        [
            "Rural"
        ],
        [
            "Ibo"
        ],
        [
            "1,842"
        ],
        [
            "410"
        ],
        [
            "1,763"
        ],
        [
            "Rural"
        ],
        [
            "Kiblagon"
        ],
        [
            "1,228"
        ],
        [
            "263"
        ],
        [
            "1,127"
        ],
        [
            "Rural"
        ],
        [
            "Lapu-lapu"
        ],
        [
            "385"
        ],
        [
            "105"
        ],
        [
            "406"
        ],
        [
            "Rural"
        ],
        [
            "Mabini"
        ],
        [
            "2,268"
        ],
        [
            "489"
        ],
        [
            "2,222"
        ],
        [
            "Rural"
        ],
        [
            "New Baclayon"
        ],
        [
            "3,619"
        ],
        [
            "781"
        ],
        [
            "3,566"
        ],
        [
            "Rural"
        ],
        [
            "Pitu"
        ],
        [
            "1,960"
        ],
        [
            "406"
        ],
        [
            "1,965"
        ],
        [
            "Rural"
        ],
        [
            "Rizal"
        ],
        [
            "1,055"
        ],
        [
            "243"
        ],
        [
            "1,168"
        ],
        [
            "Rural"
        ],
        [
            "San Isidro"
        ],
        [
            "1,519"
        ],
        [
            "327"
        ],
        [
            "1,498"
        ],
        [
            "Rural"
        ],
        [
            "Tagansule"
        ],
        [
            "1,599"
        ],
        [
            "359"
        ],
        [
            "1,671"
        ],
        [
            "Rural"
        ],
        [
            "Total"
        ],
        [
            "35,241"
        ],
        [
            "7,479"
        ],
        [
            "35,295"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Malalag"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  39.60"
        ],
        [
            "2009  41.23"
        ],
        [
            "2012  35.57"
        ],
        [
            "2015  17.25"
        ],
        [
            "2018  17.38"
        ],
        [
            "2021  19.18"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agriculture: Among agricultural crops, coconut leads in production followed by banana and sugarcane.",
            "Other major crops are corn and vegetables.",
            "The municipality also produces high value fruits like mango.",
            "Cattle leads in livestock production."
        ],
        [
            "Fisheries: The long coastline of Malalag which forms part of Davao Gulf provides a rich fishing grounds."
        ],
        [
            "Forestry: Tropical evergreen and other timber cover the vast timberland and forest area.",
            "Rattan, bamboo and other vines are also in abundance."
        ],
        [
            "Mining: Deposits of copper and or limestone were also traced but still have to be tapped for commercial and industrial uses.",
            "The Sagittarius Mines Inc. (SMI) has picked Davao del Sur to host the supporting infrastructure for the $5.9-billion Tampakan copper-gold project and identified Malalag as the preferred site for the PPFP (Port, Power Station and Filter Plant Project) development."
        ],
        [
            "Malalag Wharf"
        ],
        [
            "The Malalag Wharf is along the south-west coastline of Malalag Bay, about 25 kilometres (16 mi) south of Digos and approximately 88 kilometres (55 mi) south of Davao City.",
            "It is more than 4 kilometres (2.5 mi) long and 1 kilometre (0.62 mi) wide.",
            "Port facilities include:"
        ],
        [
            "50m wharf"
        ],
        [
            "One berth, 30m x 15m"
        ],
        [
            "Controlling depth of 9m - 12m below MLLW"
        ],
        [
            "Fendering system is of clustered timber files distributed equally alongside the wharf"
        ],
        [
            "Tanks and pipelines for shipment of molasses"
        ],
        [
            "Malalag Arrastre Porters and Stevedoring Multi-Purpose Coop (MAPOSTMUCO) are the cargo handling operators of general cargoes such as molasses, sugar, steel products, vehicle and heavy equipment."
        ],
        [
            "Approach for Malalag Wharf is through the Malalag Bay.",
            "Ships can anchor at a depth of 21 fathoms free of hazardous underwater obstructions/currents and is notably sheltered from direct exposure to the open sea.",
            "Vessels entering the Malalag Port navigate through the south-west route of the Malalag Bay which is a tributary of the larger Davao Gulf waters."
        ],
        [
            "Ships serving the Malalag Port"
        ],
        [
            "Vessel"
        ],
        [
            "GRT"
        ],
        [
            "LOA"
        ],
        [
            "Route"
        ],
        [
            "M/T Ocean Queen Nine"
        ],
        [
            "1058"
        ],
        [
            "68.14"
        ],
        [
            "Manila-Malalag-Batangas"
        ],
        [
            "M/T Alvin"
        ],
        [
            "164.88"
        ],
        [
            "39"
        ],
        [
            "Manila-Malalag-Batangas"
        ],
        [
            "M/V Grand Pacific III"
        ],
        [
            "498.27"
        ],
        [
            "67.37"
        ],
        [
            "Davao-Malalag-Manila"
        ],
        [
            "LCT Nicia"
        ],
        [
            "483.25"
        ],
        [
            "68"
        ],
        [
            "Ormoc-Malalag-Davao"
        ],
        [
            "LCT Jaime Ongpin"
        ],
        [
            "497.54"
        ],
        [
            "61.4"
        ],
        [
            "Davao-Malalag-Iloilo"
        ],
        [
            "LCT Filipino"
        ],
        [
            "857.94"
        ],
        [
            "65.39"
        ],
        [
            "Iloilo-Malalag-Cebu"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Malalag |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Transferring the Barrios of Basiawan, Kibulan and the Sitios of Kimatay and Kilalag in the Municipality of Malita, to the Municipality of Malalag, Province of Davao\".",
            "LawPH.com.",
            "Retrieved 2011-04-11."
        ],
        [
            "^"
        ],
        [
            "\"Malalag: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 January 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XI (Davao Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XI (Davao Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Davao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Total Population by Province, City, Municipality and Barangay: as of May 1, 2010\" (PDF).",
            "2010 Census of Population and Housing.",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on 1 November 2013.",
            "Retrieved 7 May 2014."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"The Environment Report\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on 2014-05-08.",
            "Retrieved 2013-03-18."
        ],
        [
            "^ \"Business - Sagittarius to build power plant for Tampakan - INQUIRER.net\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on 2014-05-08.",
            "Retrieved 2013-03-18."
        ],
        [
            "^ \"More cargo ships laid up at Davao port - INQUIRER.net, Philippine News for Filipinos\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on 2014-05-08.",
            "Retrieved 2013-03-18."
        ],
        [
            "^ \"Philippine Ports Authority - Port District Office of Southern Mindanao\".",
            "Archived from the original on 2007-12-17."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Malalag."
        ],
        [
            "Malalag Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "National Statistical Coordination Board: Data on Malalag"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Malalag"
        ],
        [
            "Columbio, Sultan Kudarat"
        ],
        [
            "Kiblawan / Sulop"
        ],
        [
            "Davao Gulf"
        ],
        [
            "Malalag"
        ],
        [
            "Tampakan, South Cotabato"
        ],
        [
            "Malungon, Sarangani"
        ],
        [
            "Santa Maria, Davao Occidental"
        ],
        [
            "vte Province of Davao del SurDigos (capital)  Davao City (largest city)Municipalities"
        ],
        [
            "Bansalan"
        ],
        [
            "Hagonoy"
        ],
        [
            "Kiblawan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Malalag"
        ],
        [
            "Matanao"
        ],
        [
            "Padada"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Sulop"
        ],
        [
            "Component City"
        ],
        [
            "Digos"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Davao City (Administratively independent from the province but grouped under Davao del Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Malalag&oldid=1224372515\""
        ],
        [
            "Categories: Municipalities of Davao del SurPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from May 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}