{
    "name": "Malangas",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Malangas"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschفارسیFrançaisIlokanoItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°37′54″N 123°01′56″E﻿ / ﻿7.6317°N 123.0322°E﻿ / 7.6317; 123.0322"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Zamboanga Sibugay, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Malangas\" – news · newspapers · books · scholar · JSTOR (August 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Zamboanga Peninsula, PhilippinesMalangasMunicipalityMunicipality of Malangas"
        ],
        [
            "FlagSealMap of Zamboanga Sibugay with Malangas highlightedOpenStreetMapMalangasLocation within the PhilippinesCoordinates: 7°37′54″N 123°01′56″E﻿ / ﻿7.6317°N 123.0322°E﻿ / 7.6317; 123.0322CountryPhilippinesRegionZamboanga PeninsulaProvinceZamboanga SibugayDistrict"
        ],
        [
            "1st districtFoundedJuly 23, 1951Barangays25"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMarcelo M. Baquial Jr. • Vice MayorRoberto P. Intol • RepresentativeWilter W. Palma II • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Loreto G. BanquiaoMelba L. ArnuzaEduardo N. CuizonRonelio G. LuceñoRogelio C. EvalarozaAlonto A. DatukaliArlene C. SaavedraCarnain P. Tampipi"
        ],
        [
            " • Electorate21,754 voters (2022)Area • Revenue₱ 161.4 million (2020) • Assets₱ 559.7 million (2020) • Expenditure₱ 133.3 million (2020) • Liabilities₱ 219.3 million (2020)Service provider • ElectricityZamboanga del Sur 2 Electric Cooperative (ZAMSURECO 2)Time zoneUTC+8 (PST)ZIP code7038PSGC098308000IDD : area code +63 (0)62Native languagesSubanon Cebuano Chavacano Tagalog  MaguindanaonWebsitewww.malangassibugay.gov.ph"
        ],
        [
            "Malangas, officially the Municipality of Malangas (Cebuano: Lungsod sa Malangas; Filipino (Tagalog): Bayan ng Malangas; Maguindanaon: Inged nu Malangas, Jawi: ايڠد نو ملاڠس); Zamboangueño/Chavacano: Municipio de Malangas, is a 3rd class municipality in the province of Zamboanga Sibugay, Philippines.",
            "According to the 2020 census, it has a population of 32,022 people."
        ],
        [
            "The municipality is generally rolling near the shorelines and mountainous in the hinterland with some patches of flat land located within the mangroves near the shorelines.",
            "It borders Buug to the north-east; Diplahan to the north-west; Imelda to the west; Margosatubig, Zamboanga del Sur, to the east; and Alicia to the south."
        ],
        [
            "Malangas is the site of coal mining in Western Mindanao area, operated by the Philippine National Oil Company - Exploration Corporation.",
            "The coalmine is one of the largest in the country.",
            "Its town center nests in a harbor in Dumanquilas Bay, boasts of its twin ports, one for coal, the other for passengers."
        ],
        [
            "Etymology"
        ],
        [
            "The name Malangas got its name from a sitio later named Malangas Gamay, probably of Spanish origin.",
            "Though the exact origin of “Malangas” is unclear, the word itself might have Spanish origins, probably taken from the word “Malanga” which means “Taro” (Colocasia Esculenta to Botanists) in English (“Taro” is called “Gabi” in Filipino), as the natives of Malangas might have been planting this crops during the time when the Spaniards paid them a visit."
        ],
        [
            "History"
        ],
        [
            "Malangas is one of the oldest municipality of its former province, Zamboanga del Sur."
        ],
        [
            "The municipality was created through Republic Act No.",
            "654, issued on June 16, 1951, during the leadership of President Elpidio Quirino, upon separation of twenty barrios from Margosatubig in the old province of Zamboanga."
        ],
        [
            "After the partition of Zamboanga, Malangas became part of Zamboanga del Sur, and its territory was later reduced.",
            "In 1956, six barrios and sitios, along with parts of Kabasalan, were separated to establish Siay."
        ],
        [
            "In 1977, Imelda was created, constituting seven barangays, including Sta.",
            "Fe which would be the seat of government in the newly-created municipality, detached from Malangas, along with parts of Siay and Alicia."
        ],
        [
            "A booming coal town during the 1900s, and the mother town of various towns namely Buug, Diplahan, Imelda, part of Siay in Zamboanga Sibugay and the towns of Bayog and Kumalarang in Zamboanga del Sur."
        ],
        [
            "Geography"
        ],
        [
            "The town is Located on the south-eastern tip of Zamboanga Sibugay province.",
            "It is bounded on the east by Dumanquilas Bay and south by the Celebes Sea.",
            "The total distance from Manila to Malangas, Philippines is 492 miles (792 km).",
            "This is equivalent to 792 kilometers or 428 nautical miles (793 km).",
            "It is two and a half hours away from Pagadian city, 45 minutes drive from the Provincial capital, and 133 kilometers away from the city of Zamboanga."
        ],
        [
            "Malangas also includes the island of Muyong, having endowed with white sand beaches, and other of uninhabited islands near the shorelines.",
            "Mainland area are steeply sloping terrain of hills and mountains.",
            "Due to its topography and elevation the town do not experience flooding."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Malangas, Zamboanga Sibugay"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "61(2.4)"
        ],
        [
            "55(2.2)"
        ],
        [
            "75(3.0)"
        ],
        [
            "81(3.2)"
        ],
        [
            "145(5.7)"
        ],
        [
            "189(7.4)"
        ],
        [
            "189(7.4)"
        ],
        [
            "197(7.8)"
        ],
        [
            "162(6.4)"
        ],
        [
            "181(7.1)"
        ],
        [
            "115(4.5)"
        ],
        [
            "70(2.8)"
        ],
        [
            "1,520(59.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.4"
        ],
        [
            "15.7"
        ],
        [
            "19.1"
        ],
        [
            "21.5"
        ],
        [
            "26.9"
        ],
        [
            "27.1"
        ],
        [
            "26.4"
        ],
        [
            "25.0"
        ],
        [
            "24.2"
        ],
        [
            "26.8"
        ],
        [
            "23.5"
        ],
        [
            "18.7"
        ],
        [
            "271.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "The Municipality of Malangas enjoys a location that is free from the typhoon belt area.",
            "March to May is hot and dry, with temperature at 32 to 34 °C (90 to 93 °F), while in June to October is rainy, and November to February is cool, with temperatures ranging from 22 to 28 °C (72 to 82 °F).",
            "Average humidity year round is 77%."
        ],
        [
            "Barangays"
        ],
        [
            "Malangas is politically subdivided into 25 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Bacao"
        ],
        [
            "Basakbawang"
        ],
        [
            "Bontong"
        ],
        [
            "Camanga"
        ],
        [
            "Candiis"
        ],
        [
            "Catituan"
        ],
        [
            "Dansulao"
        ],
        [
            "Del Pilar"
        ],
        [
            "Guilawa"
        ],
        [
            "Kigay"
        ],
        [
            "La Dicha"
        ],
        [
            "Lipacan"
        ],
        [
            "Logpond"
        ],
        [
            "Malongon"
        ],
        [
            "Molom"
        ],
        [
            "Mabini"
        ],
        [
            "Overland"
        ],
        [
            "Palalian"
        ],
        [
            "Payag"
        ],
        [
            "Poblacion"
        ],
        [
            "Rebocon"
        ],
        [
            "San Vicente"
        ],
        [
            "Sinusayan"
        ],
        [
            "Tackling"
        ],
        [
            "Tigabon"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MalangasYearPop.±% p.a.1960 24,733—    1970 31,394+2.41%1975 29,305−1.37%1980 20,190−7.18%1990 28,957+3.67%1995 28,916−0.03%2000 29,770+0.63%2007 29,834+0.03%2010 31,243+1.69%2015 33,380+1.27%2020 32,022−0.81%Source: Philippine Statistics Authority"
        ],
        [
            "The indigenous people of the area now known as Malangas were the Malangeneous."
        ],
        [
            "The large majority of the population of Malangas is Roman Catholic (87%).",
            "Other religions represented are Protestant (3%), and Islam (10%)."
        ],
        [
            "Language"
        ],
        [
            "The Main language of Malangas is Bisaya.",
            "Locals can also speak well in Tagalog and English."
        ],
        [
            "English is widely used in education and understood.",
            "Other languages of the Philippines are also spoken, mostly between family members, relatives, or neighbors belonging to the same ethnic group.",
            "Among these languages, the most spoken include Chavacano languages, Maguindanaon, Tausug and the Subanen."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Malangas"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  34.80"
        ],
        [
            "2009  40.54"
        ],
        [
            "2012  31.52"
        ],
        [
            "2015  36.35"
        ],
        [
            "2018  30.80"
        ],
        [
            "2021  33.27"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            " \"Pinikas na isda\" a variety of dried fish are common in the poblacion market"
        ],
        [
            "Coal mining has been in operation in Malangas since the early 1930s, which strengthens the local economy as well as that of the entire province Zamboanga Sibugay.",
            "In 1938, the Malangas Coal Reservation was established.",
            "Although the scale of the present operations is relatively modest, the production is of considerable national significance.",
            "There are relatively large deposits of coal and this estimates to contain nearly 10 million tons of coal (according to Frederick L. Wernstedt,Joseph Earle Spencer) some of which is of coking quality - a small quantity to be sure, but one that gains added significance in light of the general overall shortage of mineral fuels in the Philippines.",
            "The present production of Malangas coal is being shipped to the Iligan Industrial area."
        ],
        [
            "The rest of Malangas is still heavily dependent on agriculture and aquaculture, while in the coastal areas there is also commercial fishing."
        ],
        [
            "Manufacturing:"
        ],
        [
            "Rice and Corn Milling"
        ],
        [
            "Coffee Milling"
        ],
        [
            "Coal mining"
        ],
        [
            "There are Philippine coals which are of such quality that they can be used by current users without the need for any coal preparation or blending with imported coals.",
            "Among these are the coal deposits being mined in Malangas.",
            "The PNOC (Philippine National Oil Company) and the TMC its Taiwanese partner operates coal within the Malangas Coal Reservation.",
            "It also operates a large-scale coal mine known as the Integrated Little Baguio (ILB) colliery, which is currently the largest semi-mechanized underground coal mine in the country."
        ],
        [
            "In the year 1995, a worst tragedy happened when a huge methane gas explosion ripped through a coal mine tunnel in Malangas town, killing more than 100 people.",
            "The blast set off a fireball, which swept through nine kilometers of mines, and setting off other explosives which had been stockpiled inside the tunnel.",
            "Ten years later, six miners were killed when a coal tunnel collapsed in Diplahan town."
        ],
        [
            "News about the coal mine in Malangas has been rumored that PNOC-EC may sell mine to San Miguel Corp."
        ],
        [
            "According to the news, the Philippine National Oil Company - Exploration Corp. (PNOC-EC) is in talks with diversified conglomerate San Miguel Corp. to sell a coal mine in Mindanao and this is probably in Zamboanga Peninsula where Malangas is located.",
            "For 2009, total coal production in Malangas amounted to 91,440 metric tons, a decrease from the 2008 output of 110, 549 metric tons due to major repair and rehabilitation “conducted immediately upon takeover of the mines.” Today, Mining operators are still operating in the coal reservation of the town."
        ],
        [
            "Tourism"
        ],
        [
            "Malangas is endowed with several islets that are ideal for resort development.",
            "One of these is Isla Muyong, comparable to Buluan island of Ipil.",
            "One characteristic that they have in common is their white sand beaches.",
            "Others are also sprawled in some of the town's coastline."
        ],
        [
            "The most notable beach in Malangas is the Municipal Government owned beach resort, located in Bunker, the site of the town's coal port.",
            "Many people who live in the nearby towns like it because of the proximity of the place."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "The local council is administered by the mayor, with the assistance of the vice mayor.",
            "There is only one representative Sangguniang Kabataan (Youth Council) and Association of Barangay Captains (ABC)."
        ],
        [
            "Malangas has been administered by elected and appointed officials since July 23, 1951, with a strong Mayor-council government.",
            "For much of its modern history, from the 70's up until around 2013, Malangas was governed by the Tura political family.",
            "Starting with strongman Mayor Cecilio G. Tura, whose no-nonsense approach to crime and injustice endeared him deeply to his constituents.He was followed by his daughter Mayor Denia Tura-Tapodoc, who also served as Board Member in the undivided Zamboanga del Sur.",
            "Another daughter would take the mantle in 2001 when Mayor Cecille L. Tura won her first term as Mayor of Malangas.",
            "She would serve as Mayor until 2010.",
            "Then as vice-mayor until 2013.",
            "The current mayor is governed by Alfredo A. Atilano, the first male elected mayor in the 21st century in the history of Malangas.",
            "The Municipal mayor is restricted to three consecutive terms, totaling nine years, although a mayor can be elected again after an interruption of one term.",
            "Marcelo Baquial Jr. is the municipal's incumbent vice mayor.",
            "The vice mayor heads the legislative arm composed of the elected Municipal councilors."
        ],
        [
            "Congress representation"
        ],
        [
            "Malangas belongs to the 1st District of Zamboanga Sibugay.",
            "Currently, it is being represented by Wilter W. Palma II in the House of Representatives."
        ],
        [
            "Infrastructure"
        ],
        [
            "Water Supply"
        ],
        [
            "One of the major problems in Malangas is the water system.",
            "Water resources are also less abundant.",
            "Almost 90 percent of the population get its water supply from a nearby barangay.",
            "But this is not abundant for the population.",
            "This explains the water scarcity in the area.",
            "While some barangays receive enough water, others experience constant water deficiency most especially in the poblacion area.",
            "Lack of access to water is a larger problem in the population anywhere else in the town center.",
            "The water supply only runs hourly within the different districts/purok.",
            "There are recent government efforts to improve the management of water resources in Malangas but all had failed.",
            "As of now, the government is trying to solve the problem to help get the people a good and fine water system."
        ],
        [
            "Education"
        ],
        [
            "Malangas is home to one of the satellite campuses of Western Mindanao State University, the state university in western Mindanao region which is ranked sixth among 68 universities all over the country, according to a survey on the Top Academic Institutions in the Philippines conducted by the Commission on Higher Education.",
            "Head office of the university is in Zamboanga City The campus is located at the mountain hill of the town viewing the Dumaguillas Bay and neighboring islets."
        ],
        [
            "See also"
        ],
        [
            "Malangas Coal Reservation"
        ],
        [
            "Malangas Institute"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Malangas |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Republic Act No.",
            "654\".",
            "Supreme Court E-Library.",
            "Supreme Court of the Philippines.",
            "June 16, 1951.",
            "Retrieved May 1, 2024."
        ],
        [
            "^ \"Executive Order No.",
            "223\".",
            "The LawPhil Project.",
            "Arellano Law Foundation.",
            "December 28, 1956.",
            "Retrieved May 1, 2024."
        ],
        [
            "^ \"Presidential Decree No.",
            "1239\".",
            "Official Gazette (Philippines).",
            "Government of the Philippines.",
            "November 11, 1977.",
            "Retrieved April 30, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Malangas: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 1 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IX (Zamboanga Peninsula)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Zamboanga Sibugay\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Republic Act No.",
            "9134: An Act Reclassifying as Agricultural Land Open to Disposition under the Provisions of the Public Land Act, as Amended, a Portion of the Land Embraced in Proclamation No.",
            "223, Dated February 29, 1988 which was excluded from the Operation of Proclamation No.",
            "284, Dated July 19, 1938, Establishing the Malangas Coal Reservation in the Municipality of Malangas, Province of Zamboanga Del Sur, Island of Mindanao\".",
            "Philippine Laws, Statues and Codes.",
            "Chan Robles Virtual Law Library.",
            "Retrieved 6 August 2014."
        ],
        [
            "External links"
        ],
        [
            "Malangas Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Malangas"
        ],
        [
            "Diplahan"
        ],
        [
            "Buug"
        ],
        [
            "Imelda"
        ],
        [
            "Malangas"
        ],
        [
            "Dumanquilas Bay / Margosatubig, Zamboanga del Sur"
        ],
        [
            "Alicia"
        ],
        [
            "vte Province of Zamboanga SibugayIpil (capital and largest municipality)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Buug"
        ],
        [
            "Diplahan"
        ],
        [
            "Imelda"
        ],
        [
            "Ipil"
        ],
        [
            "Kabasalan"
        ],
        [
            "Mabuhay"
        ],
        [
            "Malangas"
        ],
        [
            "Naga"
        ],
        [
            "Olutanga"
        ],
        [
            "Payao"
        ],
        [
            "Roseller Lim"
        ],
        [
            "Siay"
        ],
        [
            "Talusan"
        ],
        [
            "Titay"
        ],
        [
            "Tungawan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Malangas&oldid=1223979786\""
        ],
        [
            "Categories: Municipalities of Zamboanga SibugayMining communities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from August 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Maguindanaon-language textPages using the Kartographer extension"
        ]
    ]
}