{
    "name": "Malabang",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Malabang"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°35′36″N 124°04′20″E﻿ / ﻿7.59333°N 124.07222°E﻿ / 7.59333; 124.07222"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Lanao del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Malabang\" – news · newspapers · books · scholar · JSTOR (May 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bangsamoro Autonomous Region in Muslim Mindanao, PhilippinesMalabang"
        ],
        [
            "ملابانجMunicipalityMunicipality of Malabang"
        ],
        [
            "FlagSealMap of Lanao del Sur with Malabang highlightedOpenStreetMapMalabangLocation within the PhilippinesCoordinates: 7°35′36″N 124°04′20″E﻿ / ﻿7.59333°N 124.07222°E﻿ / 7.59333; 124.07222CountryPhilippinesRegionBangsamoro Autonomous Region in Muslim MindanaoProvinceLanao del SurDistrict"
        ],
        [
            "2nd districtFounded1520CharteredMay 19, 1893Barangays37"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAlinader M. Balindong • Vice MayorRaizoli S. Balindong • RepresentativeYasser A. Balindong • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Farrajibah D. PadateJerry M. RakimMalik B. BolotoAltaf D. BalindongCosain B. MalawaniMalic A. BalindongAlmubarak A. PagayawanNedaya B. Padate"
        ],
        [
            " • Electorate37,720 voters (2022)Area • Revenue₱ 171.4 million (2020) • Assets₱ 80.29 million (2020) • Expenditure₱ 161.6 million (2020) • Liabilities₱ 0.5527 million (2020)Service provider • ElectricityLanao del Sur Electric Cooperative (LASURECO)Time zoneUTC+8 (PST)ZIP code9300PSGC153615000IDD : area code +63 (0)63Native languagesMaranao TagalogWebsitehttps://malabang.com.ph/"
        ],
        [
            "Malabang, officially the Municipality of Malabang (Maranao: Inged a Malabang; Tagalog: Bayan ng Malabang), is a 3rd class municipality in the province of Lanao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 49,088 people.",
            "The town is one of the two former capitals of the Sultanate of Maguindanao from 1515 until the Spanish conquered the land in 1888."
        ],
        [
            "History"
        ],
        [
            "Malabang, in Lanao del Sur, is considered the oldest settlement in mainland Mindanao."
        ],
        [
            "The Sultanate of T'bok was an established kingdom in present-day Malabang long before the Philippines became a country.",
            "The people of Malabang are mostly Maranaos, a southern Mindanao ethnicity; they are also often identified with the Iranuns because of Iranuns who live in some of the barangays in the southern part of Malabang, comprising what is now Balabagan.",
            "In March 1969, Executive Order 386, signed by President Carlos P. Garcia, reconstituted the southern part of Malabang as the Municipality of Balabagan.",
            "Thus, Iranuns are now residents of Balabagan rather than Malabang."
        ],
        [
            "Malabang played a significant part in the early battles against invaders of the Philippines.",
            "During the defensive campaigns against Spain, Malabang became the headquarters of Sultan Muhammad Kudarat of Maguindanao.",
            "He used to spend time recuperating in Malabang throughout the period when he was fighting to defend Maguindanao against invasion.",
            "He later retired to Malabang when he fell ill.",
            "He eventually died and was buried there.",
            "In May 1977, Presidential Decree 1135 of President Ferdinand Marcos created the Municipality of Picong (formerly Sultan Gumander) out of the north-western portion of Malabang, where Sultan Kudarat's grave was located."
        ],
        [
            "During the Second World War, when the Japanese invaded the Philippines, the Japanese military built a large camp in Malabang, including a network of tunnels around it.",
            "It was considered a major camp of the Japanese forces.",
            "In 1942, the Philippine Supreme Court Chief Justice José Abad Santos was brought to this camp, after he was captured in Cebu while fleeing from Japanese forces.",
            "Chief Justice Abad Santos was executed in the camp for refusing to cooperate with the Japanese, and was buried in barangay Curahab.",
            "The place where the camp is situated and where Mr. Santos was executed was later on named Camp Jose Abad Santos (Camp JAS)."
        ],
        [
            "In 1945, United States and Philippine Commonwealth forces, working with Maranao guerillas, occupied Malabang after a siege.",
            "During the Siege of Malabang, the guerillas used weapons like the Maranao kris, barong and kampilan to fight the Japanese forces.",
            "The victorious American and Philippine Commonwealth troops, together with their Maranao guerrilla allies, eventually defeated the Japanese Imperial forces.",
            "When the built of the general headquarters and military camp base of the Philippine Commonwealth Army and Philippine Constabulary was station's active in Malabang from 1945 to 1946 during and ended of World War II."
        ],
        [
            "Malabang as a municipality was founded on March 1, 1893.",
            "The locals of the town celebrate the founding day, the Araw ng Malabang every March 1 annually."
        ],
        [
            "Geography"
        ],
        [
            "Malabang is one of thirty-nine municipalities comprising the province of Lanao del Sur in northern Mindanao.",
            "It lies on the south-west part of the province and belongs to the second district.",
            "It has 37 barangays with a total land area of 37,789.28 km2.",
            "The distance from Marawi City to Malabang is 71 kilometers.",
            "Malabang is bounded on the north by the municipality of Calanogas; on the north-west by the municipality of Picong (Sultan Gumander); on the east by the municipality of Marogong; and on the south by the municipality of Balabagan.",
            "To the west of Malabang is Illana Bay."
        ],
        [
            "It is under the administrative supervision of the Autonomous Region in Muslim Mindanao (ARMM) since November 1989, pursuant to R.A. No.",
            "6734 dated June 8, 1989, known as the \"Organic Act of ARM"
        ],
        [
            "M\"."
        ],
        [
            "The municipality is a level plain in its central to southern portion.",
            "A slope in the north is bounded by the Municipality of Calanogas.",
            "There is also a slope in eastern Malabang."
        ],
        [
            "Barangays"
        ],
        [
            "Malabang is politically subdivided into 37 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Bacayawan"
        ],
        [
            "Badak Lumao"
        ],
        [
            "Bagoaingud"
        ],
        [
            "Banday"
        ],
        [
            "Betayan"
        ],
        [
            "Boniga"
        ],
        [
            "BPS Village"
        ],
        [
            "Bunk House"
        ],
        [
            "Cabasaran (South)"
        ],
        [
            "Calembog"
        ],
        [
            "Calibagat"
        ],
        [
            "Campo Muslim"
        ],
        [
            "China Town (Poblacion)"
        ],
        [
            "Corahab"
        ],
        [
            "Diamaro"
        ],
        [
            "Inandayan"
        ],
        [
            "Jose Abad Santos"
        ],
        [
            "Lamin"
        ],
        [
            "Mable"
        ],
        [
            "Macuranding"
        ],
        [
            "Madaya"
        ],
        [
            "Mananayo"
        ],
        [
            "Manggahan"
        ],
        [
            "Masao"
        ],
        [
            "Matalin"
        ],
        [
            "Matampay"
        ],
        [
            "Matling"
        ],
        [
            "Montay"
        ],
        [
            "Pasir"
        ],
        [
            "Pialot"
        ],
        [
            "Rebocun"
        ],
        [
            "Sarang"
        ],
        [
            "Sumbagarogong"
        ],
        [
            "Tacub"
        ],
        [
            "Tambara"
        ],
        [
            "Tiongcop"
        ],
        [
            "Tubok"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Malabang, Lanao del Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "236(9.3)"
        ],
        [
            "225(8.9)"
        ],
        [
            "244(9.6)"
        ],
        [
            "235(9.3)"
        ],
        [
            "304(12.0)"
        ],
        [
            "287(11.3)"
        ],
        [
            "200(7.9)"
        ],
        [
            "175(6.9)"
        ],
        [
            "158(6.2)"
        ],
        [
            "200(7.9)"
        ],
        [
            "287(11.3)"
        ],
        [
            "243(9.6)"
        ],
        [
            "2,794(110.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "24.3"
        ],
        [
            "22.3"
        ],
        [
            "26.0"
        ],
        [
            "27.2"
        ],
        [
            "28.3"
        ],
        [
            "27.2"
        ],
        [
            "25.8"
        ],
        [
            "24.8"
        ],
        [
            "22.2"
        ],
        [
            "25.4"
        ],
        [
            "27.2"
        ],
        [
            "25.8"
        ],
        [
            "306.5"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MalabangYearPop.±% p.a.1903 164—    1918 980+12.66%1939 10,210+11.81%1948 10,380+0.18%1960 27,152+8.34%1970 28,692+0.55%1975 32,618+2.61%1980 18,955−10.28%1990 25,714+3.10%1995 28,840+2.17%2000 33,177+3.05%2007 41,024+2.97%2010 38,724−2.08%2015 43,957+2.44%2020 49,088+2.19%Source: Philippine Statistics Authority"
        ],
        [
            "Languages"
        ],
        [
            "Religion in Malabang Lanao del Sur"
        ],
        [
            "Religion"
        ],
        [
            "Percent"
        ],
        [
            "Islam"
        ],
        [
            "98.7%"
        ],
        [
            "Christianity"
        ],
        [
            "1.26%"
        ],
        [
            "The languages spoken in Malabang vary by location and by barangay.",
            "Maranao is the most commonly spoken language in Malabang, as the native speakers are the original inhabitants of Malabang."
        ],
        [
            "Cebuano is spoken in some barangays with significant Cebuano Visayan immigrant populations who are mostly Catholic Christians.",
            "Along with English, Cebuano is used in Catholic masses and religious services as Malabang is part of the Prelature of Marawi, subject to the Archdiocese of Ozamiz."
        ],
        [
            "Some descendants of Chinese settlers in China Town (Poblacion) speak Mandarin and to some degree, Hokkien."
        ],
        [
            "English is also a commonly spoken language due to American settlers in Matalin and European missionaries, and is also the medium of instruction and working language of the municipal government.",
            "Arabic is used in madrassas and spoken by qualified local and visiting ustadz (Islamic scholar) and imams.",
            "Settlers from the Maguindanao, Samal and Tausūg ethnic groups in barangay Bunkhouse still use their tribal tongues."
        ],
        [
            "Although there are no settlers from the Tagalog region in Lanao del Sur, Tagalog is still used in schools, being the national language of the Philippines through its national register Filipino.",
            "It is also the alternative language of the Maranao townsfolk when conversing with Visayans, since not all of them know how to speak Cebuano."
        ],
        [
            "Other languages varyingly spoken include Ilocano, Hiligaynon, Bicolano, Higaonon, and Iranun."
        ],
        [
            "Economy"
        ],
        [
            "Poverty Incidence of Malabang"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "80"
        ],
        [
            "2000  69.43"
        ],
        [
            "2003  46.84"
        ],
        [
            "2006  28.80"
        ],
        [
            "2009  37.72"
        ],
        [
            "2012  68.06"
        ],
        [
            "2015  61.60"
        ],
        [
            "2018  71.01"
        ],
        [
            "2021  10.81"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agriculture and fishery are the major resources of Malabang.",
            "They are also widely known for coconut production.",
            "Warehouses of coconut can be found along the major highways of Malabang.",
            "Mills in barangay Matalin produce cassava flour.",
            "Other agricultural products produced in Malabang include corn, vegetables and rice.",
            "Malabang also plays a major role in fishery production.",
            "They are known for puzan (a preserved fish product) and bakas (smoked dried fish).",
            "Malabang is central to commerce and trade activity in the coastal area of Lanao del Sur."
        ],
        [
            "Government"
        ],
        [
            "The municipality has a mayor, the head of the municipality of Malabang, a municipal vice mayor, and eight municipal councilors.",
            "The municipality also has one Sangguniang Kabataan (youth council) representative and one ABC representative from the Punong Barangay (barangay captains)."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Land Transport"
        ],
        [
            "Malabang is quite sufficient when it comes to land transportation to the nearby municipalities.",
            "Tricycles are the most-commonly-used transportation around the town.",
            "Usually, in the elevated part of Malabang, public transportation such as town ace and multi-cab are used.",
            "There are also public utility vans and jeepneys available to nearby cities and municipalities."
        ],
        [
            "Air Transport"
        ],
        [
            "Malabang Airport is the small airport of Malabang in the province of Lanao del Sur.",
            "It has IATA code MLP, GPS Code RPMM, an elevation of 27 feet (8.2 meters), latitude 7.6172 and longitude 124.059.",
            "This airport is classified as a secondary airport, or a minor commercial airport, by the Philippine Air Transportation Office.",
            "Its runway is 4,265 feet (1,300 meters) long.",
            "Malabang Airport is the only airport in the province.",
            "As of 2015, no airlines serve this airport."
        ],
        [
            "Sea Transport"
        ],
        [
            "Malabang has only a small seaport.",
            "Daily coastal launches connect Malabang with Cotabato City, Maguindanao.",
            "Privately owned boats and rental boats are available for sea travel."
        ],
        [
            "Medical Services"
        ],
        [
            "Dr. Serapio B. Montañer Memorial District Hospital or known to many as Mabul Hospital is the public hospital in Malabang, and is listed as a secondary hospital in the province.",
            "There are also several municipal private clinics in Malabang."
        ],
        [
            "Telecommunications"
        ],
        [
            "The Philippine Long Distance Telephone Company provides fixed line services.",
            "Wireless mobile communications services are provided by Smart Communications and Globe Telecommunications."
        ],
        [
            "Education"
        ],
        [
            "Although listed as 4th class municipality, all levels of education are attainable in Malabang, a center of learning in the coastal area of Lanao del Sur.",
            "Multiple colleges are present, including the community branch of Mindanao State University.",
            "Arabic studies are also offered at all levels.",
            "Other notable secondary school in Malabang is Our Lady of Peace High School, a Catholic school and Malabang National High School"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Malabang |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Bangsamoro (BARMM)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Malabang, Lanao del Sur : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved January 27, 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Lanao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Malabang Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Malabang"
        ],
        [
            "Picong"
        ],
        [
            "Tubaran"
        ],
        [
            "Malabang"
        ],
        [
            "Marogong"
        ],
        [
            "Illana Bay"
        ],
        [
            "Balabagan"
        ],
        [
            "vte Province of Lanao del SurMarawi (capital)Municipalities"
        ],
        [
            "Amai Manabilang"
        ],
        [
            "Bacolod-Kalawi"
        ],
        [
            "Balabagan"
        ],
        [
            "Balindong"
        ],
        [
            "Bayang"
        ],
        [
            "Binidayan"
        ],
        [
            "Buadiposo-Buntong"
        ],
        [
            "Bubong"
        ],
        [
            "Butig"
        ],
        [
            "Calanogas"
        ],
        [
            "Ditsaan-Ramain"
        ],
        [
            "Ganassi"
        ],
        [
            "Kapai"
        ],
        [
            "Kapatagan"
        ],
        [
            "Lumba-Bayabao"
        ],
        [
            "Lumbaca-Unayan"
        ],
        [
            "Lumbatan"
        ],
        [
            "Lumbayanague"
        ],
        [
            "Madalum"
        ],
        [
            "Royal Sultanate of Madamba"
        ],
        [
            "Maguing"
        ],
        [
            "Malabang"
        ],
        [
            "Marantao"
        ],
        [
            "Marogong"
        ],
        [
            "Masiu"
        ],
        [
            "Mulondo"
        ],
        [
            "Pagayawan"
        ],
        [
            "Piagapo"
        ],
        [
            "Picong"
        ],
        [
            "Poona Bayabao"
        ],
        [
            "Pualas"
        ],
        [
            "Saguiaran"
        ],
        [
            "Sultan Dumalondong"
        ],
        [
            "Tagoloan"
        ],
        [
            "Tamparan"
        ],
        [
            "Taraka"
        ],
        [
            "Tubaran"
        ],
        [
            "Tugaya"
        ],
        [
            "Wao"
        ],
        [
            "Component city"
        ],
        [
            "Marawi"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Malabang&oldid=1231495787\""
        ],
        [
            "Categories: 1907 establishments in the PhilippinesMunicipalities of Lanao del SurPopulated places established in 1907Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from May 2014All articles needing additional referencesUse Philippine English from April 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}