{
    "name": "Malitbog",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Malitbog, Bukidnon"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°32′10″N 124°52′51″E﻿ / ﻿8.5361°N 124.8808°E﻿ / 8.5361; 124.8808"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Malitbog, Bukidnon\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesMalitbogMunicipalityMunicipality of MalitbogMunicipal/Town Hall"
        ],
        [
            "FlagSealNickname: Bukidnon's Great NorthMap of Bukidnon with Malitbog highlightedOpenStreetMapMalitbogLocation within the PhilippinesCoordinates: 8°32′10″N 124°52′51″E﻿ / ﻿8.5361°N 124.8808°E﻿ / 8.5361; 124.8808CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "1st districtFoundedJune 25, 1963Barangays11"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorOsmundo N. dela Rosa • Vice MayorCindy E. Aritrangco • RepresentativeMa.",
            "Lourdes O. Acosta-Alba • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Gary D. CasiñoAida B. dela RosaChem D. SabunodFredolino C. LomponRegie E. DominguezJose C. EmanoLeonard M. EmataMa.",
            "Vida B. Bandialan"
        ],
        [
            " • Electorate18,806 voters (2022)Area"
        ],
        [
            " • Revenue₱ 194.6 million (2020) • Assets₱ 864.8 million (2020) • Expenditure₱ 136.9 million (2020) • Liabilities₱ 183.5 million (2020)Service provider • ElectricityBukidnon 2 Electric Cooperative (BUSECO)Time zoneUTC+8 (PST)ZIP code8704PSGC101313000IDD : area code +63 (0)88Native languagesBinukid Cebuano Ata Manobo TagalogWebsitewww.malitbogbuk.gov.ph"
        ],
        [
            "Malitbog, officially the Municipality of Malitbog (Bukid and Higaonon: Banuwa ta Malitbog; Cebuano: Lungsod sa Malitbog; Tagalog: Bayan ng Malitbog), is a 2nd class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 26,741 people."
        ],
        [
            "History"
        ],
        [
            "The pioneers of the municipality were a group of Bukidnon tribe who has a small settlement along a spring called Abo-on."
        ],
        [
            "As their number increased, they began to call the entire area as Abo-on.",
            "However, there were divergent opinions to have this name because Abo-on refer only to a small cluster of settlers in the area."
        ],
        [
            "The name was then changed to Malitbog, on the account of Malitbog River transversing their settlement and likewise the principal source of fishing, the native's favorite livelihood.",
            "Their seat of government near the Malitbog River was also another consideration."
        ],
        [
            "By virtue of Executive No.",
            "42, dated June 25, 1963, Malitbog became a 5th Class municipality by operation of the provision of Section 2 of Republic Act 1515 and considered a regular municipality pursuant to Republic Act 23 and 88 duly signed by President Diosdado Macapagal."
        ],
        [
            "Geography"
        ],
        [
            "Malitbog is located at the northernmost part of the province, between parallel 8°25'35\" and 8°36'8\" North Latitude and Meridians 124°49'39\" and 125°11'39\" East Longitude.",
            "Malitbog is a land locked municipality bounded on north by the municipality of Claveria and on the western side by Tagoloan - both of which are part of Misamis Oriental.",
            "Bounding it on its southern part are the municipalities of Manolo Fortich and Impasugong of Bukidnon Province while on its eastern side is the municipality of Esperanza, Agusan del Sur."
        ],
        [
            "The municipality is about 40 kilometres (25 mi) from the regional capital, Cagayan de Oro, and about 2½ hours ride from the provincial capital, Malaybalay City.",
            "It is reachable via Tagoloan and is approximately 2 hours ride from the City of Cagayan de Oro through secondary and first class road type (gravel and concrete pavement)."
        ],
        [
            "Barangays"
        ],
        [
            "Malitbog is politically subdivided into 11 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "The data below shows the full details of area subdivisions for the municipality of Malitbog."
        ],
        [
            "Land area by barangay, Malitbog, Bukidnon"
        ],
        [
            "Name of Barangay"
        ],
        [
            "A & D (km2)"
        ],
        [
            "Forest land (km2)"
        ],
        [
            "Land area (km2)"
        ],
        [
            "Percent of total"
        ],
        [
            "1.",
            "Kalingking"
        ],
        [
            "7.42"
        ],
        [
            "2.73"
        ],
        [
            "10.15"
        ],
        [
            "1.74"
        ],
        [
            "2.",
            "Kiabo"
        ],
        [
            "7.99"
        ],
        [
            "19.65"
        ],
        [
            "27.64"
        ],
        [
            "4.75"
        ],
        [
            "3.",
            "Mindagat"
        ],
        [
            "13.45"
        ],
        [
            "4.00"
        ],
        [
            "17.45"
        ],
        [
            "3.00"
        ],
        [
            "4.",
            "Omagling"
        ],
        [
            "9.39"
        ],
        [
            "0.03"
        ],
        [
            "9.42"
        ],
        [
            "1.62"
        ],
        [
            "5.",
            "Patpat"
        ],
        [
            "2.85"
        ],
        [
            "8.69"
        ],
        [
            "11.54"
        ],
        [
            "1.98"
        ],
        [
            "6.",
            "Poblacion"
        ],
        [
            "5.10"
        ],
        [
            "1.56"
        ],
        [
            "6.66"
        ],
        [
            "1.14"
        ],
        [
            "7.",
            "Sampiano"
        ],
        [
            "0.93"
        ],
        [
            "39.90"
        ],
        [
            "40.83"
        ],
        [
            "7.02"
        ],
        [
            "8.",
            "San Luis"
        ],
        [
            "12.56"
        ],
        [
            "376.11"
        ],
        [
            "388.68"
        ],
        [
            "66.80"
        ],
        [
            "9.",
            "Siloo"
        ],
        [
            "3.78"
        ],
        [
            "42.61"
        ],
        [
            "46.38"
        ],
        [
            "7.97"
        ],
        [
            "10.",
            "Santa Inez"
        ],
        [
            "6.92"
        ],
        [
            "7.30"
        ],
        [
            "14.22"
        ],
        [
            "2.44"
        ],
        [
            "11.",
            "Sumalsag"
        ],
        [
            "6.31"
        ],
        [
            "2.57"
        ],
        [
            "8.88"
        ],
        [
            "1.53"
        ],
        [
            "Total"
        ],
        [
            "76.70"
        ],
        [
            "505.15"
        ],
        [
            "581.85"
        ],
        [
            "100.00"
        ],
        [
            "Source: MASSO"
        ],
        [
            "Land area"
        ],
        [
            "It covers a total land area of 581.85 km2 which about 7.02 percent of the land under the province's jurisdiction.",
            "Among its eleven barangays, San Luis occupied the largest area with a total coverage of 388.68 km2 - about 66.8 percent of Malitbog's land area.",
            "Barangay Poblacion on the other hand is the smallest in terms of land area coverage with only about 6.66 km2.",
            "This represents a mere 1.14 percent of the municipality's area coverage."
        ],
        [
            "Climate"
        ],
        [
            "The climate in Malitbog is classified as belonging to Type IV or Intermediate B which is typical throughout the province.",
            "Its climate has been characterized by moderate season from February to April and wet season starting from May which would last up to January."
        ],
        [
            "Climate data for Malitbog, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "271(10.7)"
        ],
        [
            "217(8.5)"
        ],
        [
            "193(7.6)"
        ],
        [
            "178(7.0)"
        ],
        [
            "344(13.5)"
        ],
        [
            "423(16.7)"
        ],
        [
            "362(14.3)"
        ],
        [
            "358(14.1)"
        ],
        [
            "329(13.0)"
        ],
        [
            "320(12.6)"
        ],
        [
            "322(12.7)"
        ],
        [
            "260(10.2)"
        ],
        [
            "3,577(140.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "23.2"
        ],
        [
            "19.5"
        ],
        [
            "22.0"
        ],
        [
            "22.8"
        ],
        [
            "29.6"
        ],
        [
            "28.9"
        ],
        [
            "30.3"
        ],
        [
            "29.8"
        ],
        [
            "28.1"
        ],
        [
            "28.8"
        ],
        [
            "26.1"
        ],
        [
            "24.1"
        ],
        [
            "313.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Topography"
        ],
        [
            "Being naturally characterized by mountains and hilly terrain, slope ranging from 30 to 50 percent and above are therefore the most prevalent category.",
            "These are the steep to very steep slope found mostly in mountains areas.",
            "The largest part which can be found at the north and north-eastern part having an elevation of 1,000 to 1,500 meters above the sea level.",
            "Smaller portion at the northern part has the highest elevation of 1,500 to 2,400 meters above sea level.",
            "Erosion maps shows that slight to moderate erosion can be found in this area.",
            "From Barangay San Luis and Kiabo going south-western part, it has patches of slope 30 to 50 percent and above with an elevation 200 to 1,000 meters above sea level.",
            "Major portion of this area has a severe erosion only small area have the slight erosion based on thematic map."
        ],
        [
            "It can be noted from the derived slope map that even areas where settlements are established are in lands with slope more than 18 percent in grade.",
            "Major portion of this area can be found at the north-western part covers 8 barangays with an elevation of ranging from 200 to 1,000 meters above sea level.",
            "Largest part of the area has severe erosion.",
            "Other areas with 18 percent slope can also be found near the border of Malitbog and Agusan del Sur.",
            "The elevation of this area is 600 to 800 meters ASL with slight erosion based in the erosion map.",
            "It can also be well further noted from the map that slope under the 0-3 percent are 3-8 percent are small patches that are scattered mostly in the south-western part and at Calabugao Plain near the Malitbog and Agusan del Sur.",
            "These grades are supposedly ideal for settlements and agricultural production yet combine its area is measured and their corresponding areas."
        ],
        [
            "Barangays"
        ],
        [
            "Malitbog is politically subdivided into 11 barangays."
        ],
        [
            "Kalingking"
        ],
        [
            "Kiabo"
        ],
        [
            "Mindagat"
        ],
        [
            "Omagling"
        ],
        [
            "Patpat"
        ],
        [
            "Poblacion"
        ],
        [
            "Sampiano"
        ],
        [
            "San Luis"
        ],
        [
            "Santa Ines"
        ],
        [
            "Silo-o"
        ],
        [
            "Sumalsag"
        ],
        [
            "Land classification"
        ],
        [
            "The total land area of the municipality of Malitbog is approximately at 581.85 km2 based on Administrative/Thematic Maps of DENR-CENRO Office No.",
            "B-340 and certified by Land Management Bureau.",
            "The classified forest land is estimated at 505.15 km2 or 86.82 percent of the total land area.",
            "Only 76.70 km2 or 13.18% of the total land area of Malitbog is classified as alienable and disposable lands."
        ],
        [
            "The Thematic Maps from CENRO that are gathered from Topographic Map of NAMRIA, showed that there are three categories of vegetative cover in the municipality: Timber Lnd is one of the categories that covers the largest part of the total land area with an estimated area of about 338.73 km2 or 58.22 percent of the total land area of the municipality.",
            "Timberland is within Forest Land that can be found only in Barangay San Luis and Kiabo."
        ],
        [
            "Cultivated Area developed for agricultural endeavors and areas settled in by people covers an estimated area of 162.24 km2 or 27.88 percent of the total land area of Malitbog.",
            "Alienable and Disposable Lands is within this cultivated area having an area of only 76.70 km2.",
            "These A&D Lands are intended for settlements and agricultural development and can be found in the north and north-western side of Malitbog.",
            "All barangays of Malitbog have A&D lands, though these are particularly small with barangay Siloo, Sampiano and Santa Inez.",
            "The total cultivated area minus the A&D lands will have a difference of 85.54 km2 or 14.70 percent of the total land area of Malitbog.",
            "This area is within forest land can be found also in all barangays."
        ],
        [
            "Grassland on the other hand covers most part of barangay Sampiano and Siloo with small patches dots of barangay San Luis.",
            "Grassland category is within forest land having an estimated area of 80.88 km2 or 13.90 percent of the total land area of Malitbog."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MalitbogYearPop.±% p.a.1918 1,263—    1939 2,002+2.22%1948 2,143+0.76%1960 5,326+7.88%1970 8,230+4.44%1975 11,885+7.65%1980 13,581+2.70%1990 14,934+0.95%1995 16,414+1.79%2000 19,465+3.72%2007 21,948+1.67%2010 22,880+1.52%2015 24,453+1.27%2020 26,741+1.77%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Malitbog, Bukidnon, was 26,741 people, with a density of 46 inhabitants per square kilometre or 120 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Malitbog"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "2006  47.80"
        ],
        [
            "2009  61.42"
        ],
        [
            "2012  65.34"
        ],
        [
            "2015  65.70"
        ],
        [
            "2018  35.62"
        ],
        [
            "2021  42.67"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Malitbog |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Malitbog: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Malitbog, Bukidnon."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Malitbog, Bukidnon"
        ],
        [
            "Villanueva, Misamis Oriental"
        ],
        [
            "Claveria, Misamis Oriental"
        ],
        [
            "Tagoloan, Misamis Oriental"
        ],
        [
            "Malitbog"
        ],
        [
            "Impasugong"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Malitbog,_Bukidnon&oldid=1164195080\""
        ],
        [
            "Category: Municipalities of BukidnonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}