{
    "name": "Malinao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Malinao, Aklan"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°38′35″N 122°18′26″E﻿ / ﻿11.6431°N 122.3072°E﻿ / 11.6431; 122.3072"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Aklan, Philippines"
        ],
        [
            "Municipality in Western Visayas, PhilippinesMalinaoMunicipalityChurch of Malinao"
        ],
        [
            "FlagSealMap of Aklan with Malinao highlightedOpenStreetMapMalinaoLocation within the PhilippinesCoordinates: 11°38′35″N 122°18′26″E﻿ / ﻿11.6431°N 122.3072°E﻿ / 11.6431; 122.3072CountryPhilippinesRegionWestern VisayasProvinceAklanDistrict"
        ],
        [
            "2nd districtFounded1796Barangays23"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJosephine I. Iquiña • Vice MayorWilbert Ariel I. Igoy • RepresentativeTeodorico T. Haresco Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Gregorio V. Imperial Jr.Ricardo C. IbarretaChristian Amado D. IlioEleanor G. AgustinoJunito I. IscalaTsaldariz D. IldesaRaul R. QuinisioFrederick I. Rey"
        ],
        [
            " • Electorate16,428 voters (2022)Area • Revenue₱ 120.9 million (2020) • Assets₱ 495.4 million (2020) • Expenditure₱ 92.13 million (2020) • Liabilities₱ 164.1 million (2020)Service provider • ElectricityAklan Electric Cooperative (AKELCO)Time zoneUTC+8 (PST)ZIP code5606PSGC060413000IDD : area code +63 (0)36Native languagesAklanon Hiligaynon TagalogWebsitewww.lgu-malinao.ph"
        ],
        [
            "Malinao, officially the Municipality of Malinao (Aklanon: Banwa it Malinao; Hiligaynon: Banwa sang Malinao; Tagalog: Bayan ng Malinao), is a 4th-class municipality in the province of Aklan, Philippines.",
            "According to the 2020 census, it has a population of 24,517 people."
        ],
        [
            "History"
        ],
        [
            "This section has multiple issues.",
            "Please help improve it or discuss these issues on the talk page.",
            "(Learn how and when to remove these template messages)"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            "This section's tone or style may not reflect the encyclopedic tone used on Wikipedia.",
            "See Wikipedia's guide to writing better articles for suggestions.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            " (Learn how and when to remove this message)"
        ],
        [
            "Once an arrabal of the town of Banga to the east, Malinao's town leaders in the mid-18th century were able to submit a petition of separation direct, to Manila that was approved.",
            "In addition, Malinao rose to prominence in Philippine history during the struggle against colonial rule under Spain at the end of the 19th century.",
            "Candido Iban, a resident of Malinao, was a member of the inner circle of the original Katipuneros, directly under Andres Bonifacio."
        ],
        [
            "The people of Malinao are mainly of Malay stock.",
            "Aklanons are believed to be descendants of the settlers who fled the oppressive rule of Makatunaw, Sultan of Brunei.",
            "Led by Datu Puti, ten datus settled in the plains of the island of Panay.",
            "The colonization by the Spaniards, the trading by the Chinese have infused new blood to the original Malay race into what are now the people of Malinao."
        ],
        [
            "There is no record of the history of Malinao until the 18th century.",
            "By this time, the area of what is now Malinao was part of the adjacent municipality of Banga.",
            "The Poblacion of Banga then was the Poblacion of Malinao today.",
            "In 1792, however, the town authorities transferred the Poblacion of Banga across the Aklan River at the foot of Manduyog Hill where it is now located."
        ],
        [
            "Some prominent families decided to remain in the 'old town' which was reduced to the status of barrio and named Malinao - derived from the name of the placid river that traverses the western and southern portion of the area as it empties into the Aklan River."
        ],
        [
            "The people who remained in Malinao led by Don Juan Nepomuceno agitated to separate the lands west of the Aklan River to form a new town with Malinao as its poblacion."
        ],
        [
            "Malinao as a municipality came into being in the year 1796 with Don Casimiro Barrera as its first gobernadorcillo."
        ],
        [
            "Little written history is known of Malinao in its early existence, except for church records on baptism which starts on the year 1796, the same year Malinao became a town.",
            "The Spanish decree on change family names for easy identification of inhabitants led to the assignment of the initial letter 'Y'/ 'I' for families originating from Malinao."
        ],
        [
            "By the close of the 19th century, the political, economic and even the physical structure of Malinao conform to the classical colonial and feudal set-up existing throughout Christian Philippines.",
            "The layout of the Poblacion follows the classical Spanish town plan of the church facing the municipio with the plaza in between and streets laid out in grid pattern.",
            "The principalia partook of choice residential lots around the plaza.",
            "Their importance and influence reflected in the proximity of their lots to the center of power."
        ],
        [
            "There was no concentration of land holdings by few families, unlike in other areas of the country.",
            "Original families in Malinao have their own pieces of land to work on.",
            "The land west of the Aklan River, because of its topography, must have escaped the encomienderos and hacienderos in the early part of Spanish colonization."
        ],
        [
            "Despite its seeming ordinariness and unimportance in the national or provincial scheme of things, Malinao rose in prominence during the struggle against colonial rule at the end of the 19th century."
        ],
        [
            "A native of Lilo-an, Malinao, Candido Iban was a member of the inner circle of the original Katipuneros directly under Andres Bonifacio.",
            "Candido Iban was the first overseas contract worker from Malinao, diving for pearls in Australia.",
            "As luck would have it, he won a considerable sum in a lottery and came back to Manila.",
            "He was befriended by Procopio Bonifacio, the brother of Andres, and was inducted as a Katipunero by Andres in the caves of Montalban.",
            "The first printing press of the Katipunan was paid for the lottery winnings of Candido Iban."
        ],
        [
            "In 1897, Candido Iban and Francisco Castillo were sent to Aklan to organize the Katipunan in the Visayas.",
            "Barrio Lilo-an became the base of the katipunan.",
            "And in 1897, believing that the time was ripe for the start of the revolution, eighty-two (82) Katipuneros from Lilo-an marched to the Poblacion to persuade the local authorities to join the revolution.",
            "The uprising failed and the leaders captured.",
            "Candido Iban, Benito Iban and Gabino Yonsal were among the 19 Martyrs of Aklan executed by the Spanish authorities on March 23, 1897."
        ],
        [
            "A monument of Candido Iban and the failed uprising called El Levantamiento de los 82 de Lilo-an stands prominently beside the town hall."
        ],
        [
            "When the Japanese Imperial Army invaded the country during World War II, young men from Malinao were among the first to organize the guerrilla movement in this part of the country.",
            "During the Marcos dictatorship, many young Malinaonons took up arms to fight it."
        ],
        [
            "The leadership of the town since the Spanish regime always come from the leading families of the Poblacion.",
            "From Juan Nepomuceno in 1792 to Atty.",
            "Wilbert Ariel Igoy in 2016, this leadership reflect the political and economic clout of the leading families.",
            "Leaders were appointed by Spanish authorities during the Spanish period.",
            "When democratic election were started during the American colonial regime, the leading families divided into two factions, each vying for leadership of the town.",
            "Whether it is the Nationalista Party or Liberal Party, KBL or Laban, Puersa ng Masa or Lakas, these politicos come from these two factions."
        ],
        [
            "Geography"
        ],
        [
            "Malinao is located in the geographic centre of the province, at 11°38′35″N 122°18′26″E﻿ / ﻿11.6431°N 122.3072°E﻿ / 11.6431; 122.3072.",
            "It is 14 kilometres (8.7 mi) from the provincial capital, Kalibo."
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 186.01 square kilometres (71.82 sq mi)  constituting 10.21% of the 1,821.42-square-kilometre- (703.25 sq mi) total area of Aklan."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Makato, Aklan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "47(1.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "39(1.5)"
        ],
        [
            "48(1.9)"
        ],
        [
            "98(3.9)"
        ],
        [
            "150(5.9)"
        ],
        [
            "169(6.7)"
        ],
        [
            "147(5.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "172(6.8)"
        ],
        [
            "118(4.6)"
        ],
        [
            "80(3.1)"
        ],
        [
            "1,264(49.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "8.2"
        ],
        [
            "9.3"
        ],
        [
            "9.7"
        ],
        [
            "19.1"
        ],
        [
            "25.6"
        ],
        [
            "27.4"
        ],
        [
            "25.5"
        ],
        [
            "25.5"
        ],
        [
            "25.2"
        ],
        [
            "18.5"
        ],
        [
            "14.5"
        ],
        [
            "219.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Malinao, Aklan Map Image"
        ],
        [
            "Malinao is politically subdivided into 23 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 060413001   Banaybanay"
        ],
        [
            " 3.7%"
        ],
        [
            " 919"
        ],
        [
            " 1,007"
        ],
        [
            "  ▾"
        ],
        [
            " −0.91%"
        ],
        [
            " 060413002   Biga-a"
        ],
        [
            " 3.6%"
        ],
        [
            " 879"
        ],
        [
            " 805"
        ],
        [
            "  ▴"
        ],
        [
            " 0.88%"
        ],
        [
            " 060413003   Bulabud"
        ],
        [
            " 6.3%"
        ],
        [
            " 1,551"
        ],
        [
            " 1,764"
        ],
        [
            "  ▾"
        ],
        [
            " −1.28%"
        ],
        [
            " 060413004   Cabayugan"
        ],
        [
            " 5.0%"
        ],
        [
            " 1,228"
        ],
        [
            " 1,260"
        ],
        [
            "  ▾"
        ],
        [
            " −0.26%"
        ],
        [
            " 060413005   Capataga"
        ],
        [
            " 0.2%"
        ],
        [
            " 40"
        ],
        [
            " 129"
        ],
        [
            "  ▾"
        ],
        [
            " −11.05%"
        ],
        [
            " 060413006   Cogon"
        ],
        [
            " 2.0%"
        ],
        [
            " 491"
        ],
        [
            " 419"
        ],
        [
            "  ▴"
        ],
        [
            " 1.60%"
        ],
        [
            " 060413007   Dangcalan"
        ],
        [
            " 2.8%"
        ],
        [
            " 679"
        ],
        [
            " 723"
        ],
        [
            "  ▾"
        ],
        [
            " −0.63%"
        ],
        [
            " 060413008   Kinalangay Nuevo"
        ],
        [
            " 3.9%"
        ],
        [
            " 968"
        ],
        [
            " 952"
        ],
        [
            "  ▴"
        ],
        [
            " 0.17%"
        ],
        [
            " 060413009   Kinalangay Viejo"
        ],
        [
            " 8.3%"
        ],
        [
            " 2,043"
        ],
        [
            " 1,871"
        ],
        [
            "  ▴"
        ],
        [
            " 0.88%"
        ],
        [
            " 060413010   Lilo-an"
        ],
        [
            " 5.9%"
        ],
        [
            " 1,437"
        ],
        [
            " 1,478"
        ],
        [
            "  ▾"
        ],
        [
            " −0.28%"
        ],
        [
            " 060413011   Malandayon"
        ],
        [
            " 3.6%"
        ],
        [
            " 876"
        ],
        [
            " 767"
        ],
        [
            "  ▴"
        ],
        [
            " 1.34%"
        ],
        [
            " 060413012   Manhanip"
        ],
        [
            " 4.7%"
        ],
        [
            " 1,149"
        ],
        [
            " 1,177"
        ],
        [
            "  ▾"
        ],
        [
            " −0.24%"
        ],
        [
            " 060413013   Navitas"
        ],
        [
            " 4.8%"
        ],
        [
            " 1,170"
        ],
        [
            " 1,290"
        ],
        [
            "  ▾"
        ],
        [
            " −0.97%"
        ],
        [
            " 060413014   Osman"
        ],
        [
            " 2.8%"
        ],
        [
            " 691"
        ],
        [
            " 715"
        ],
        [
            "  ▾"
        ],
        [
            " −0.34%"
        ],
        [
            " 060413015  Poblacion"
        ],
        [
            " 6.1%"
        ],
        [
            " 1,505"
        ],
        [
            " 1,660"
        ],
        [
            "  ▾"
        ],
        [
            " −0.98%"
        ],
        [
            " 060413016   Rosario"
        ],
        [
            " 7.7%"
        ],
        [
            " 1,889"
        ],
        [
            " 2,199"
        ],
        [
            "  ▾"
        ],
        [
            " −1.51%"
        ],
        [
            " 060413017   San Dimas"
        ],
        [
            " 3.6%"
        ],
        [
            " 873"
        ],
        [
            " 892"
        ],
        [
            "  ▾"
        ],
        [
            " −0.22%"
        ],
        [
            " 060413018   San Ramon"
        ],
        [
            " 3.8%"
        ],
        [
            " 940"
        ],
        [
            " 893"
        ],
        [
            "  ▴"
        ],
        [
            " 0.51%"
        ],
        [
            " 060413019   San Roque"
        ],
        [
            " 5.7%"
        ],
        [
            " 1,406"
        ],
        [
            " 1,413"
        ],
        [
            "  ▾"
        ],
        [
            " −0.05%"
        ],
        [
            " 060413020   Sipac"
        ],
        [
            " 1.7%"
        ],
        [
            " 417"
        ],
        [
            " 522"
        ],
        [
            "  ▾"
        ],
        [
            " −2.22%"
        ],
        [
            " 060413021   Sugnod"
        ],
        [
            " 2.0%"
        ],
        [
            " 498"
        ],
        [
            " 476"
        ],
        [
            "  ▴"
        ],
        [
            " 0.45%"
        ],
        [
            " 060413022   Tambuan"
        ],
        [
            " 4.7%"
        ],
        [
            " 1,163"
        ],
        [
            " 1,346"
        ],
        [
            "  ▾"
        ],
        [
            " −1.45%"
        ],
        [
            " 060413023   Tigpalas"
        ],
        [
            " 1.6%"
        ],
        [
            " 382"
        ],
        [
            " 350"
        ],
        [
            "  ▴"
        ],
        [
            " 0.88%"
        ],
        [
            "Total"
        ],
        [
            "24,517"
        ],
        [
            "24,108"
        ],
        [
            " ▴"
        ],
        [
            "0.17%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MalinaoYearPop.±% p.a.1903 5,027—    1918 8,230+3.34%1939 10,768+1.29%1948 11,000+0.24%1960 12,987+1.39%1970 14,947+1.41%1975 16,483+1.98%1980 18,117+1.91%1990 20,180+1.08%1995 21,509+1.20%2000 23,699+2.10%2007 23,921+0.13%2010 24,108+0.28%2015 23,194−0.73%2020 24,517+1.10%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Malinao had a population of 25,845.",
            "The population density was 140 inhabitants per square kilometre (360/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Malinao"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  37.00"
        ],
        [
            "2009  43.26"
        ],
        [
            "2012  19.61"
        ],
        [
            "2015  22.17"
        ],
        [
            "2018  14.59"
        ],
        [
            "2021  24.29"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Malinao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Aklan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Malinao: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 1 May 2020."
        ],
        [
            "^ \"Municipal: Malinao, Aklan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Aklan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Official website"
        ],
        [
            "Malinao Gallery"
        ],
        [
            "Places adjacent to Malinao, Aklan"
        ],
        [
            "Makato"
        ],
        [
            "Lezo"
        ],
        [
            "Sebaste, Antique"
        ],
        [
            "Malinao"
        ],
        [
            "Banga"
        ],
        [
            "Madalag"
        ],
        [
            "vte Province of AklanKalibo (capital and largest municipality)Municipalities"
        ],
        [
            "Altavas"
        ],
        [
            "Balete"
        ],
        [
            "Banga"
        ],
        [
            "Batan"
        ],
        [
            "Buruanga"
        ],
        [
            "Ibajay"
        ],
        [
            "Kalibo"
        ],
        [
            "Lezo"
        ],
        [
            "Libacao"
        ],
        [
            "Madalag"
        ],
        [
            "Makato"
        ],
        [
            "Malay"
        ],
        [
            "Malinao"
        ],
        [
            "Nabas"
        ],
        [
            "New Washington"
        ],
        [
            "Numancia"
        ],
        [
            "Tangalan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Malinao,_Aklan&oldid=1183134168\""
        ],
        [
            "Category: Municipalities of AklanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles needing additional references from October 2016All articles needing additional referencesWikipedia articles with style issues from October 2016All articles with style issuesArticles with multiple maintenance issuesPages using the Kartographer extension"
        ]
    ]
}