{
    "name": "Manolo Fortich",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°22′03″N 124°51′56″E﻿ / ﻿8.3675°N 124.8656°E﻿ / 8.3675; 124.8656"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Manolo Fortich\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesManolo Fortich"
        ],
        [
            "MalukoMunicipalityMunicipality of Manolo FortichSign in Manolo Fortich"
        ],
        [
            "FlagSealNickname: Adventure Capital of BukidnonMap of Bukidnon with Manolo Fortich highlightedOpenStreetMapManolo FortichLocation within the PhilippinesCoordinates: 8°22′03″N 124°51′56″E﻿ / ﻿8.3675°N 124.8656°E﻿ / 8.3675; 124.8656CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "1st districtFoundedApril 4, 1946Named forMayor Manolo FortichBarangays22"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRogelio N. Quiño • Vice MayorReynaldo L. Bagayas Jr. • RepresentativeJose Manuel F. Alba • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Miguel D. DemataJay S. AlbareceRina E. QuiñoElziver A. DagunlayJoy L. CordovezChristy Leparto-SalabeRaquel Abales-BayacagJunidini J. Artajo"
        ],
        [
            " • Electorate65,072 voters (2022)Area • Revenue₱ 555 million (2020) • Assets₱ 1,848 million (2020) • Expenditure₱ 567.8 million (2020) • Liabilities₱ 613 million (2020)Service provider • ElectricityBukidnon 2 Electric Cooperative (BUSECO)Time zoneUTC+8 (PST)ZIP code8703PSGC101314000IDD : area code +63 (0)88Native languagesBinukid Cebuano Ata Manobo TagalogWebsitemanolofortich.com.ph"
        ],
        [
            "Manolo Fortich, officially the Municipality of Manolo Fortich (Bukid and Higaonon: Banuwa ta Manolo Fortich; Cebuano: Lungsod sa Manolo Fortich; Tagalog: Bayan ng Manolo Fortich), is a 1st class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 113,200 people."
        ],
        [
            "Manolo Fortich used to be known as Maluko; it was renamed in 1957.",
            "Maluko also happens to be the name of one of the municipality's barangay."
        ],
        [
            "History"
        ],
        [
            "Before the coming of the Spaniards, the term \"Bukidnon\" referred to as the semi-sedentary Indigenous inhabitants of the high plateaus and rugged mountain ranges of central Mindanao.",
            "The more prominent of these peoples were the Manobo people who were the earliest settlers of this region.",
            "Located on the northern part of Bukidnon, is the Municipality of Manolo Fortich."
        ],
        [
            "The MacArthur Monument in Barangay Diclum, the site of the World War II Del Monte Airfield from which Douglas MacArthur was evacuated to Australia from the Philippines after the fall of Corregidor and Bataan"
        ],
        [
            "The Forest Camp in barangay Dahilayan"
        ],
        [
            "The great pre-historic Asiatic migration was believed to have brought the early settlers of Bukidnon.",
            "It was theorized that they came from places of what is now known as Indonesia.",
            "Traveling by the sea, these migrants reached the gulf of Davao where some ventured further to areas of what is now known as Bukidnon and Misamis Oriental.",
            "The Asiatic beginnings of these people can be seen from their oral tradition and folktales, like the \"Kalikat Hu Mga Elaw Dini Ta Mindanao\" (Origin of the People of Mindanao).",
            "This folktale revolved on the story of two brothers from Asia \"who crossed the seas\" in their long journey \"towards the east\" which refers to the islands of the Philippines.",
            "The brothers reportedly landed in the island of Mindanao.",
            "With the region experiencing a drought, one of the brothers was forced to venture Northward in order to survive.",
            "He did this by following a dried up river to its almost dried up source, a lake.",
            "He settled and inter-married with the local inhabitants in the upstream of what is now known as Pulangi River.",
            "He and his family were considered as the ancestors of the present Bukidnons."
        ],
        [
            "During the pre-historic era, the Bukidnons, also called Monteses or mountain-people, had settled in the area of what is now the Province of Bukidnon.",
            "These people have remained traditional till 1860 preserving most of their customs and traditions.",
            "Furthermore, these people had not been significantly influenced by the Spanish colonizers because of their isolation.",
            "The rugged mountain ranges and high plateaus which serve as home to these people presented an overwhelming obstacle to these colonizers.",
            "The Bukidnons undoubtedly have links to the culture predominant in the Southeast Asian region as evidenced by the similar customs and traditions.",
            "Their presence here can be traced to the early migration of these Asians throughout the region.",
            "Today, the surviving tribes inhabiting the mountains of Bukidnon still bear the culture they have inherited from their ancestors."
        ],
        [
            "Manolo Fortich is named after Don Manuel \"Manolo\" González Fortich, a provincial resident of Barrio Damilag who became the first governor (1907-1914) of the Sub-province of Bukidnon.",
            "Don Manuel Fortich was born on November 27, 1879, in San Nicolas (now Barangay Basak San Nicolas), Cebu City.",
            "A Philippine Constabulary officer, he served as a guide to Dean C. Worcester while on expedition to Bukidnon.",
            "Upon retirement from government service in 1920, he established ranches in Maluko and Maramag, and acquired 3,000 cows.",
            "He died on January 15, 1943, at the age of 64."
        ],
        [
            "The original name of the town was Maluko, and was headed by Santiago Mambinonsad who was appointed as Alcalde de Barrio from 1922 to 1924.",
            "It was during the term of Ciriaco Asilan as Presidente del Barrio from 1926 to 1928, that the seat of municipal government was permanently transferred to Tangkulan.",
            "Mateo Gumaling was the first appointed municipal mayor of Maluko and in 1940 Margarito Cabang became the first elected Mayor."
        ],
        [
            "World War II"
        ],
        [
            "Manolo Fortich was captured by Japanese forces of the Kawamura Detachment of the IJA 5th Division attacking from Cagayan on May 6, 1942.",
            "They advance further eastward two days later."
        ],
        [
            "Post-war"
        ],
        [
            "Maluko was then renamed to Manolo Fortich by virtue of Republic Act No.",
            "1720 on June 21, 1957."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "On August 16, 2018, Representative Maria Lourdes Acosta-Alba of Bukidnon's First District filed House Bill 8115, which aims for the cityhood of Manolo Fortich as a component city."
        ],
        [
            "Another House Bill No.",
            "8283 was filed last December 21, 2020, for the conversion of the municipality of Manolo Fortich into a component city in the province of Bukidnon."
        ],
        [
            "On July 27, 2022, House Bill No.",
            "2597 was filed by Jose Manuel F. Alba which seeks to convert Manolo Fortich into a component city."
        ],
        [
            "Geography"
        ],
        [
            "Mangima Canyon"
        ],
        [
            "The municipality of Manolo Fortich has a total area of 506.64 square kilometres (195.61 sq mi), accounting 6.1% of the total land area of the province of Bukidnon."
        ],
        [
            "Manolo Fortich is situated in the northern part of the province of Bukidnon.",
            "It is about 40 minutes away from the bustling commercial center of Cagayan de Oro."
        ],
        [
            "It is bounded in the north by Cagayan de Oro and the municipality of Malitbog.",
            "In the east by the municipality of Sumilao, in the west by the municipality of Libona and Baungon and in the south by the rugged ranges of Mount Kitanglad."
        ],
        [
            "Barangays"
        ],
        [
            "Manolo Fortich political map"
        ],
        [
            "Del Monte Pineapple fields with the Kitanglad Mountain Range in the background from Camp Phillips"
        ],
        [
            "Manolo Fortich is politically subdivided into 22 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101314001   Agusan Canyon"
        ],
        [
            " 8.8%"
        ],
        [
            " 9,985"
        ],
        [
            " 9,850"
        ],
        [
            "  ▴"
        ],
        [
            " 0.14%"
        ],
        [
            " 101314002   Alae"
        ],
        [
            " 8.1%"
        ],
        [
            " 9,135"
        ],
        [
            " 8,552"
        ],
        [
            "  ▴"
        ],
        [
            " 0.66%"
        ],
        [
            " 101314003   Dahilayan"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,743"
        ],
        [
            " 1,527"
        ],
        [
            "  ▴"
        ],
        [
            " 1.33%"
        ],
        [
            " 101314004   Dalirig"
        ],
        [
            " 4.3%"
        ],
        [
            " 4,844"
        ],
        [
            " 3,541"
        ],
        [
            "  ▴"
        ],
        [
            " 3.18%"
        ],
        [
            " 101314005   Damilag"
        ],
        [
            " 10.3%"
        ],
        [
            " 11,713"
        ],
        [
            " 11,385"
        ],
        [
            "  ▴"
        ],
        [
            " 0.28%"
        ],
        [
            " 101314006   Dicklum"
        ],
        [
            " 3.6%"
        ],
        [
            " 4,033"
        ],
        [
            " 3,731"
        ],
        [
            "  ▴"
        ],
        [
            " 0.78%"
        ],
        [
            " 101314007   Guilang‑guilang"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,247"
        ],
        [
            " 1,152"
        ],
        [
            "  ▴"
        ],
        [
            " 0.80%"
        ],
        [
            " 101314008   Kalugmanan"
        ],
        [
            " 3.3%"
        ],
        [
            " 3,684"
        ],
        [
            " 2,986"
        ],
        [
            "  ▴"
        ],
        [
            " 2.12%"
        ],
        [
            " 101314009   Lindaban"
        ],
        [
            " 2.1%"
        ],
        [
            " 2,325"
        ],
        [
            " 2,017"
        ],
        [
            "  ▴"
        ],
        [
            " 1.43%"
        ],
        [
            " 101314010   Lingion"
        ],
        [
            " 5.6%"
        ],
        [
            " 6,336"
        ],
        [
            " 5,496"
        ],
        [
            "  ▴"
        ],
        [
            " 1.43%"
        ],
        [
            " 101314011   Lunocan"
        ],
        [
            " 6.5%"
        ],
        [
            " 7,346"
        ],
        [
            " 6,341"
        ],
        [
            "  ▴"
        ],
        [
            " 1.48%"
        ],
        [
            " 101314012   Maluko"
        ],
        [
            " 3.6%"
        ],
        [
            " 4,125"
        ],
        [
            " 3,871"
        ],
        [
            "  ▴"
        ],
        [
            " 0.64%"
        ],
        [
            " 101314013   Mambatangan"
        ],
        [
            " 3.8%"
        ],
        [
            " 4,349"
        ],
        [
            " 3,248"
        ],
        [
            "  ▴"
        ],
        [
            " 2.96%"
        ],
        [
            " 101314014   Mampayag"
        ],
        [
            " 1.2%"
        ],
        [
            " 1,334"
        ],
        [
            " 1,312"
        ],
        [
            "  ▴"
        ],
        [
            " 0.17%"
        ],
        [
            " 101314015   Minsuro"
        ],
        [
            " 0.9%"
        ],
        [
            " 981"
        ],
        [
            " 870"
        ],
        [
            "  ▴"
        ],
        [
            " 1.21%"
        ],
        [
            " 101314016   Mantibugao"
        ],
        [
            " 2.8%"
        ],
        [
            " 3,185"
        ],
        [
            " 2,678"
        ],
        [
            "  ▴"
        ],
        [
            " 1.75%"
        ],
        [
            " 101314017   Tankulan (Poblacion)"
        ],
        [
            " 7.7%"
        ],
        [
            " 8,711"
        ],
        [
            " 7,907"
        ],
        [
            "  ▴"
        ],
        [
            " 0.97%"
        ],
        [
            " 101314018   San Miguel"
        ],
        [
            " 4.3%"
        ],
        [
            " 4,867"
        ],
        [
            " 4,524"
        ],
        [
            "  ▴"
        ],
        [
            " 0.73%"
        ],
        [
            " 101314019   Sankanan"
        ],
        [
            " 3.3%"
        ],
        [
            " 3,737"
        ],
        [
            " 3,287"
        ],
        [
            "  ▴"
        ],
        [
            " 1.29%"
        ],
        [
            " 101314020   Santiago"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,554"
        ],
        [
            " 2,066"
        ],
        [
            "  ▾"
        ],
        [
            " −2.81%"
        ],
        [
            " 101314021   Santo Niño"
        ],
        [
            " 3.3%"
        ],
        [
            " 3,704"
        ],
        [
            " 3,445"
        ],
        [
            "  ▴"
        ],
        [
            " 0.73%"
        ],
        [
            " 101314023   Ticala"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,272"
        ],
        [
            " 1,240"
        ],
        [
            "  ▴"
        ],
        [
            " 0.26%"
        ],
        [
            "Total"
        ],
        [
            "113,200"
        ],
        [
            "91,026"
        ],
        [
            " ▴"
        ],
        [
            "2.20%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Manolo Fortich, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "26(80)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "271(10.7)"
        ],
        [
            "217(8.5)"
        ],
        [
            "193(7.6)"
        ],
        [
            "178(7.0)"
        ],
        [
            "344(13.5)"
        ],
        [
            "423(16.7)"
        ],
        [
            "362(14.3)"
        ],
        [
            "358(14.1)"
        ],
        [
            "329(13.0)"
        ],
        [
            "320(12.6)"
        ],
        [
            "322(12.7)"
        ],
        [
            "260(10.2)"
        ],
        [
            "3,577(140.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "23.2"
        ],
        [
            "19.5"
        ],
        [
            "22.0"
        ],
        [
            "22.8"
        ],
        [
            "29.6"
        ],
        [
            "28.9"
        ],
        [
            "30.3"
        ],
        [
            "29.8"
        ],
        [
            "28.1"
        ],
        [
            "28.8"
        ],
        [
            "26.1"
        ],
        [
            "24.1"
        ],
        [
            "313.2"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "The climate is classified as belonging to type IV or Intermediate.",
            "It is characterized by a moderate dry season with average rainfall of about 2,000 millimetres (79 in).",
            "Its temperature is relatively cool and humid making the place suitable for production of any kind of crops.",
            "Production of high valued crops, which include vegetables, cut flowers and ornamentals is a big potential in the area."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Manolo FortichYearPop.±% p.a.1918 3,780—    1939 7,677+3.43%1948 9,560+2.47%1960 16,833+4.83%1970 27,159+4.89%1975 31,840+3.24%1980 42,493+5.94%1990 61,329+3.74%1995 67,400+1.78%2000 74,252+2.10%2007 82,051+1.39%2010 91,026+3.85%2015 100,210+1.85%2020 113,200+2.43%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Manolo Fortich was 113,200 people, with a density of 270 inhabitants per square kilometre or 700 inhabitants per square mile."
        ],
        [
            "In the 2010 census, the population of the municipality was 91,026 people, up from 82,051 in 2007.",
            "Manolo Fortich belongs to a very low-density area which has only approximately 162 persons per square kilometre.",
            "The urban population is confined in barangays Agusan Canyon, Damilag and Tankulan."
        ],
        [
            "Ethnic origin"
        ],
        [
            "There are three major ethnic groups in Manolo Fortich and they are the Higaonon, Talaandig and the Cebuano-Bohol ethnic groups.",
            "the latter were mostly migrants from Cebu and Bohol who came to work as agricultural laborers in the plantation and orchard farms of the highland plateau, about 55% of the residents are Higaonons who are indigenous people in the area."
        ],
        [
            "Languages"
        ],
        [
            "Cebuano, a Visayan language, is the major spoken language of the town.",
            "In the upland barangay plateau areas of Dahilayan, Guilang-guilang, Kalugmanan, Santiago and Ticala, the Higa-onons and Talaandigs speak their indigenous language called \"Binukid\"."
        ],
        [
            "Economy"
        ],
        [
            "Del Monte welcome marker"
        ],
        [
            "Poverty incidence of Manolo Fortich"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  31.60"
        ],
        [
            "2009  33.52"
        ],
        [
            "2012  33.95"
        ],
        [
            "2015  35.73"
        ],
        [
            "2018  23.07"
        ],
        [
            "2021  25.21"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "While Del Monte Philippines' manufacturing plant is located in nearby Cagayan de Oro, yet its pineapple plantation is located in the municipality specifically in Camp Phillips Road, Barangay Agusan Canyon while the company's clubhouse is located at Barangay San Miguel, still in Camp Phillips Road.",
            "The Del Monte Golf Course & Country Club on the other hand is located in Sitio Cawayanon, Barangay San Miguel.",
            "Just a few meters from the golf course is the Del Monte School, still located in Sitio Cawayanon.",
            "The Cawayanon Compound also located in Sitio Cawayanon is a residential area mostly inhabited by Del Monte employees."
        ],
        [
            "Infrastructure"
        ],
        [
            "The Dahilayan Adventure Park is located in the municipality.",
            "The park is popular for its single and dual zip-lines, drop zones, Sky Tower Base Jump (the highest of its kind in the country), \"Python Roller Zipride\" (the first of its kind in Asia) and the \"Flying Lizard\" canopy glider.",
            "The park's dual zipline has 840 meters in length making it Asia's longest dual zip-line."
        ],
        [
            "Water/drainage systems"
        ],
        [
            "Manolo Fortich has three major river systems crisscrossing the upstream and downstream agricultural lands.",
            "These are the Tagoloan, Mangima and Agusan Rivers, which serve as natural boundaries and drainage of excess water and run-off from around the municipality.",
            "The other rivers of the municipality are, among others: Dicklum, Kumaykay, Guihian, Tasaon and Kulaman Rivers.",
            "The river systems also serve as sources of potable water supply for domestic use.",
            "About 26 creeks spread across nine barangays in the municipality."
        ],
        [
            "Natural resources"
        ],
        [
            "Forests"
        ],
        [
            "Forest areas in Manolo Fortich are found in two barangays along the Mt.",
            "Kitanglad Range.",
            "Mt.",
            "Kitanglad hosts a diverse species of flora and fauna, many of them rare and endemic, making it a potential for tourism and bio-diversity research."
        ],
        [
            "Minerals"
        ],
        [
            "The major metallic mineral found in the municipality is chromite and the non-metallic includes semi-precious stones.",
            "Also available are clay, limestone, feldspar, silica quartz and schist."
        ],
        [
            "Notable personalities"
        ],
        [
            "Melvin Jerusalem - Professional boxer"
        ],
        [
            "See also"
        ],
        [
            "List of renamed cities and municipalities in the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Manolo Fortich |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"An Act Changing the Name of the Municipality of Maluko, Province of Bukidnon, to Municipality of Manolo Fortich\".",
            "LawPH.com.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ \"Sagisag Kultura: Fortich, Manolo\".",
            "Retrieved February 23, 2023."
        ],
        [
            "^ \"An Act Changing the Name of the Municipality of Maluko, Province of Bukidnon, to Municipality of Manolo Fortich\".",
            "ChanRobles Virtual Law Library.",
            "Retrieved February 23, 2023."
        ],
        [
            "^ \"Sagisag Kultura: Fortich, Manolo\".",
            "Retrieved February 23, 2023."
        ],
        [
            "^ Sablad, Jo Ann (August 21, 2018).",
            "\"Lawmaker files bill to make Manolo Fortich a city\".",
            "SunStar.",
            "Retrieved July 23, 2020."
        ],
        [
            "^ \"AN ACT CONVERTING THE MUNICIPALITY OF MANOLO FORTICH IN THE PROVINCE OF BUKIDNON INTO A COMPONENT CITY TO BE KNOWN AS THE CITY OF MANOLO FORTICH\" (PDF).",
            "House of Representatives.",
            "Retrieved April 20, 2021."
        ],
        [
            "^ Zubiri, Juan Miguel (February 8, 2021).",
            "\"AN ACT CONVERTING THE MUNICIPALITY OF MANOLO FORTICH IN THE PROVINCE OF BUKIDNON INTO A COMPONENT CITY TO BE KNOWN AS THE CITY OF MANOLO FORTICH\" (PDF).",
            "Senate of the Philippines.",
            "Retrieved September 1, 2021."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Manolo Fortich: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved April 29, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Manolo Fortich."
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Old Official Website of Manolo Fortich"
        ],
        [
            "Places adjacent to Manolo Fortich"
        ],
        [
            "Tagoloan, Misamis Oriental"
        ],
        [
            "Malitbog"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Impasugong"
        ],
        [
            "Libona"
        ],
        [
            "Sumilao"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Manolo_Fortich&oldid=1234581849\""
        ],
        [
            "Category: Municipalities of BukidnonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesUse mdy dates from November 2022Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataOfficial website different in Wikidata and WikipediaPages using the Kartographer extension"
        ]
    ]
}