{
    "name": "Maramag",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Maramag"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°45′47″N 125°00′18″E﻿ / ﻿7.7631°N 125.005°E﻿ / 7.7631; 125.005"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Maramag\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesMaramagMunicipalityMunicipality of MaramagKalatungan Mountains as seen from Maramag"
        ],
        [
            "FlagSealNickname: The Place for Secured InvestmentMotto(s): Maramag for all, All for Maramag!Map of Bukidnon with Maramag highlightedOpenStreetMapMaramagLocation within the PhilippinesCoordinates: 7°45′47″N 125°00′18″E﻿ / ﻿7.7631°N 125.005°E﻿ / 7.7631; 125.005CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "3rd districtFoundedJuly 1, 1956Barangays20"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJose Joel P. Doromal • Vice MayorMaribeth Estrella-Lopez • RepresentativeJose Ma.",
            "R. Zubiri Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Maribeth E. LopezNestor G. PaulicanJoselyn L. PuerinAbundio U. GaiteraRoy Y. CabalquintoRuben R. VillapazEsterlla C. CuadrasalBernard Lawrence L. Zubiri"
        ],
        [
            " • Electorate65,907 voters (2022)Area • Revenue₱ 424.9 million (2020) • Assets₱ 1,277 million (2020) • Expenditure₱ 361.3 million (2020) • Liabilities₱ 432.9 million (2020)Service provider • ElectricityFirst Bukidnon Electric Cooperative (FIBECO)Time zoneUTC+8 (PST)ZIP code8714PSGC101315000IDD : area code +63 (0)88Native languagesWestern Bukidnon Manobo Binukid Cebuano Ata Manobo TagalogWebsitemaramag.gov.ph"
        ],
        [
            "Maramag, officially the Municipality of Maramag (Cebuano: Lungsod sa Maramag; Tagalog: Bayan ng Maramag), is a 1st class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 108,293 people."
        ],
        [
            "History"
        ],
        [
            "Aerial view of Maramag, 1935"
        ],
        [
            "Maramag from “Ag Ramag”, a contracted Manobo term for “Ag Ramag Ki Dini”, which as freely translated, means “Let us eat our breakfast here.” The story as officially published by the late Prescioso Velez Abellanosa Sr. (a former municipal mayor) goes that the Manobos were constantly in conflict with the Maranaos for supremacy over the locality.",
            "Each time they set out for the battle they would stop on the bank of Pulangi River where flat stones that serve as their tables abound the area.",
            "Atop of these, they would draw their plans and eat their breakfast.",
            "This habit becomes their practice that even in times of peace and as a sign of good faith, these “Lumads”, the natives or early settlers invite others who happen to pass by to partake meals with them.",
            "Maramag then was a picnic ground were one can rest and take his meal as a short respite either from travel, trekking, hunting and trapping or from battle."
        ],
        [
            "Through the years, even Christians (referred to as \"Dumagats\", literally 'seaborne/coming from beyond the sea') started to come and settle near the place.",
            "They too would stop and eat their meals on these big flat stones during hunting trips or as they travel on foot from one valley to another.",
            "As more and more Christian settlers occupied the surrounding places, Ag Ramag became more commonly called as Maramag – a homonym or a contraction of the original Manobo term “Ag Ramag”."
        ],
        [
            "The political history of the municipality traces back in 1916 when the late Deputy Governor Cenon R. Paulican positively declared that people from different parts of the country began settling in the area.",
            "Years later, the people informally elected a leader among them as the incipient local government started to take form.",
            "They called their leaders “Captain”.",
            "These leaders normally remained in office for as long as their political abilities and faithfulness to duty would allow; Monarchial in so many ways although an election process is in place.",
            "This system prevailed up to the Second World War."
        ],
        [
            "In 1945, the first appointed Mayor was put in place to head the municipal government followed by two others.",
            "The first election for the position of the Municipal Mayor was held in 1951.",
            "The election for the members of the Barrio Council was held in 1955.",
            "From then on, ten other Municipal Mayors were either appointed or elected in the past 56 years up to the present."
        ],
        [
            "Maramag was formally created as a municipality through Executive Order No.",
            "272 issued by then President Carlos P. Garcia on July 1, 1956.",
            "The Poblacion of Maramag was formerly located in Barangay Base Camp, three kilometers away from the present Poblacion.",
            "After World War II and upon the completion of the Sayre Highway, people started to move along the highway in a linear then nodal fashion and later concentrically forming the Poblacion today, composing Barangay North and South Poblacions."
        ],
        [
            "The municipal boundaries between Maramag, Pangantucan and Kibawe were established in 1935 by the then deputy Governor Cenon Paulican.",
            "Then, Maramag, with the organization of the former barangays Don Carlos and Quezon into regular municipalities, was reduced to its present area of about 58,198.98 hectares.",
            "As reported too, in the late sixties, a Memorandum of Agreement between Maramag and Valencia, Bukidnon was forged as to their common boundaries.",
            "Purportedly, the Lumbo Creek, as it flows to the Pulangi River defines the demarcation between the two municipalities."
        ],
        [
            "Central Mindanao University (CMU) at Musuan, Maramag, Bukidnon"
        ],
        [
            "The current seat of the government of Maramag consists of two barangays: the North and South Poblacion.",
            "When the Central Mindanao University (CMU) is transferred to Musuan, Dologon, Maramag, Bukidnon from Managok, Malaybalay, Bukidnon, the municipality became the host of the premier agricultural school in Mindanao."
        ],
        [
            "The municipality likewise served as the nodal point of the major national roads of the province to the different places of Mindanao namely: the Bukidnon–Wao (Lanao del Sur) road the Bukidnon – North Cotobato Road and the Bukidnon – Cagayan de Oro Road."
        ],
        [
            "Maramag boasts its agricultural importance to the development of the province.",
            "It has the Crystal Sugar Corporation with a rated capacity of 6,000 tons per day.",
            "As of 1999, the total area planted to sugarcane was 20,500 hectares, which ranked as the number one crop.",
            "Corn ranks second with 10,800 hectares planted and rice accounts for the third major crop in the municipality with the irrigated areas reaching 4,900 hectares."
        ],
        [
            "The National Power Corporation (NAPOCOR) Pulangi IV Hydroelectric Plant with a rated capacity of 255 megawatts is found in Maramag.",
            "The Power Plant contributed the Mindanao Grid."
        ],
        [
            "In terms of environment, the municipality plays a vital role in the protection of the Bukidnon Watershed.",
            "Thirty percent of the land, approximately 17,340 hectares, of Maramag has been designated as forest land.",
            "These include the protected forest (10.45%), production forest (85.85%) and buffer zones (3.7%).",
            "The forest area categorized under the NIPAS is the 1,939.62 hectares within the confines of Mt.",
            "Kalatungan Range, the third highest mountain of the country."
        ],
        [
            "Maramag also boasts a number of spectacular springs, which had contributed to its esteemed title, \"The Land of Springs\".",
            "Because of its prominence within the municipality, it attracted many tourists from near and afar to feel and indulge upon the cold and crystalline waters."
        ],
        [
            "Geography"
        ],
        [
            "Political map of Maramag, showing its 20 barangays"
        ],
        [
            "Maramag, a landlocked municipality of Bukidnon, is approximately 158 kilometres (98 mi) southeast of Cagayan de Oro, around 50 kilometres (31 mi) south of Malaybalay City, 152 kilometres (94 mi) from Davao City and 281 kilometres (175 mi) from General Santos."
        ],
        [
            "It is bounded on the north and north-eastern by the municipality of Valencia; on the east by the municipality of Quezon; on the south by the municipality of Don Carlos; and on the west by the municipality of Pangantucan, all within the Province of Bukidnon.",
            "It is located within the geographic coordinates of 7°41’, to 7°58’ North latitude and 124°47’ to 125°14’ East longitude."
        ],
        [
            "Maramag covers a total land area of 44,726 hectares (110,520 acres) and politically divided into 20 barangays.",
            "The largest barangay is Kuya."
        ],
        [
            "Barangays"
        ],
        [
            "Maramag is politically subdivided into 20 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Five barangays are categorized as urban: Base Camp, Dagumba-an, Dologon, North and South Poblacions; and fifteen as rural."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101315001   Anahawon"
        ],
        [
            " 2.8%"
        ],
        [
            " 3,016"
        ],
        [
            " 2,350"
        ],
        [
            "  ▴"
        ],
        [
            " 2.53%"
        ],
        [
            " 101315002   Base Camp"
        ],
        [
            " 7.0%"
        ],
        [
            " 7,569"
        ],
        [
            " 6,905"
        ],
        [
            "  ▴"
        ],
        [
            " 0.92%"
        ],
        [
            " 101315003   Bayabason (Spring)"
        ],
        [
            " 2.5%"
        ],
        [
            " 2,737"
        ],
        [
            " 2,370"
        ],
        [
            "  ▴"
        ],
        [
            " 1.45%"
        ],
        [
            " 101315004   Camp I"
        ],
        [
            " 4.5%"
        ],
        [
            " 4,852"
        ],
        [
            " 4,416"
        ],
        [
            "  ▴"
        ],
        [
            " 0.95%"
        ],
        [
            " 101315005   Colambugon"
        ],
        [
            " 1.8%"
        ],
        [
            " 1,916"
        ],
        [
            " 1,761"
        ],
        [
            "  ▴"
        ],
        [
            " 0.85%"
        ],
        [
            " 101315006   Dagumba‑an"
        ],
        [
            " 7.1%"
        ],
        [
            " 7,638"
        ],
        [
            " 7,134"
        ],
        [
            "  ▴"
        ],
        [
            " 0.68%"
        ],
        [
            " 101315007   Danggawan"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,680"
        ],
        [
            " 1,587"
        ],
        [
            "  ▴"
        ],
        [
            " 0.57%"
        ],
        [
            " 101315008   Dologon"
        ],
        [
            " 13.0%"
        ],
        [
            " 14,093"
        ],
        [
            " 11,747"
        ],
        [
            "  ▴"
        ],
        [
            " 1.84%"
        ],
        [
            " 101315009   Kisanday"
        ],
        [
            " 2.4%"
        ],
        [
            " 2,599"
        ],
        [
            " 2,620"
        ],
        [
            "  ▾"
        ],
        [
            " −0.08%"
        ],
        [
            " 101315010   Kuya"
        ],
        [
            " 4.4%"
        ],
        [
            " 4,819"
        ],
        [
            " 4,294"
        ],
        [
            "  ▴"
        ],
        [
            " 1.16%"
        ],
        [
            " 101315011   La Roxas"
        ],
        [
            " 2.2%"
        ],
        [
            " 2,430"
        ],
        [
            " 2,191"
        ],
        [
            "  ▴"
        ],
        [
            " 1.04%"
        ],
        [
            " 101315012   Panadtalan"
        ],
        [
            " 4.4%"
        ],
        [
            " 4,774"
        ],
        [
            " 3,983"
        ],
        [
            "  ▴"
        ],
        [
            " 1.83%"
        ],
        [
            " 101315013   Panalsalan"
        ],
        [
            " 2.2%"
        ],
        [
            " 2,344"
        ],
        [
            " 2,194"
        ],
        [
            "  ▴"
        ],
        [
            " 0.66%"
        ],
        [
            " 101315014   North Poblacion"
        ],
        [
            " 13.7%"
        ],
        [
            " 14,799"
        ],
        [
            " 12,352"
        ],
        [
            "  ▴"
        ],
        [
            " 1.82%"
        ],
        [
            " 101315015   South Poblacion"
        ],
        [
            " 11.2%"
        ],
        [
            " 12,165"
        ],
        [
            " 11,408"
        ],
        [
            "  ▴"
        ],
        [
            " 0.64%"
        ],
        [
            " 101315016   San Miguel"
        ],
        [
            " 6.0%"
        ],
        [
            " 6,518"
        ],
        [
            " 5,942"
        ],
        [
            "  ▴"
        ],
        [
            " 0.93%"
        ],
        [
            " 101315017   San Roque"
        ],
        [
            " 2.9%"
        ],
        [
            " 3,126"
        ],
        [
            " 2,952"
        ],
        [
            "  ▴"
        ],
        [
            " 0.57%"
        ],
        [
            " 101315018   Tubigon"
        ],
        [
            " 2.0%"
        ],
        [
            " 2,201"
        ],
        [
            " 1,902"
        ],
        [
            "  ▴"
        ],
        [
            " 1.47%"
        ],
        [
            " 101315019   Bagongsilang"
        ],
        [
            " 1.0%"
        ],
        [
            " 1,045"
        ],
        [
            " 1,041"
        ],
        [
            "  ▴"
        ],
        [
            " 0.04%"
        ],
        [
            " 101315020   Kiharong"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,768"
        ],
        [
            " 1,752"
        ],
        [
            "  ▴"
        ],
        [
            " 0.09%"
        ],
        [
            "Total"
        ],
        [
            "108,293"
        ],
        [
            "90,901"
        ],
        [
            " ▴"
        ],
        [
            "1.77%"
        ],
        [
            "Topography"
        ],
        [
            "Aerial view of Maramag at night"
        ],
        [
            "Maramag is bounded in the North-East by mountain ranges of Mount Kilakron and Mount Kalatungan.",
            "Among its important landmarks are the Adtuyon Plateau and the Musuan Peak, at the base of which lies the Central Mindanao University (CMU), a state university at Musuan, Barangay Dologon."
        ],
        [
            "The municipality is well distributed in terms of slope gradients.",
            "The eastern and central sections of Maramag except in some patches are characteristically flat but undulated towards the northern and western boundaries of the area."
        ],
        [
            "Areas having slopes of 0–18 percent occupies almost half (48.84%) of the entire municipality with the 0-3% slope category accounting for 26.47 percent.",
            "Another slope category with considerable area is the 8-18% occupying around 9,014.76 hectares and comprising 17.27 percent of the total land area.",
            "The largest area in Maramag in terms of the slope grouping is the 18-30%, which comprised 27.39 percent of the land area or an equivalent area of 14,297.30 hectares.",
            "The very steep hills and mountains (50% and above in slope) in Maramag occupy only 6,566.63 or 12.58% of the total land area.",
            "These areas are located mostly in the western and northern boundaries of Maramag."
        ],
        [
            "Water bodies"
        ],
        [
            "Bodies of water abound the area, the Baguic-ican River in the east, flowing downstream as tributary of Muleta River that drains in the South to Don Carlos; and the Maramag River whose tributaries upstream originates from the central portion of the municipality, which flows further towards the Pulangi River.",
            "Another tributary to Pulangi River that flows within the area are the Kibalagon Creek and the Kulaman River, both found in the North East."
        ],
        [
            "Only Pulangi Watershed is identified to have an influence on the availability of water resources in Maramag."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Maramag, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "21(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "44(1.7)"
        ],
        [
            "27(1.1)"
        ],
        [
            "32(1.3)"
        ],
        [
            "35(1.4)"
        ],
        [
            "76(3.0)"
        ],
        [
            "117(4.6)"
        ],
        [
            "108(4.3)"
        ],
        [
            "108(4.3)"
        ],
        [
            "94(3.7)"
        ],
        [
            "100(3.9)"
        ],
        [
            "76(3.0)"
        ],
        [
            "46(1.8)"
        ],
        [
            "863(34.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.3"
        ],
        [
            "8.1"
        ],
        [
            "8.5"
        ],
        [
            "9.6"
        ],
        [
            "21.0"
        ],
        [
            "24.9"
        ],
        [
            "25.0"
        ],
        [
            "24.2"
        ],
        [
            "22.5"
        ],
        [
            "23.4"
        ],
        [
            "17.7"
        ],
        [
            "11.4"
        ],
        [
            "206.6"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MaramagYearPop.±% p.a.1918 5,854—    1939 3,459−2.47%1948 4,064+1.81%1960 32,654+18.96%1970 21,839−3.94%1975 29,901+6.50%1980 36,734+4.20%1990 55,394+4.19%1995 62,673+2.34%2000 75,233+3.99%2007 85,647+1.80%2010 90,901+2.19%2015 102,089+2.24%2020 108,293+1.17%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Maramag, Bukidnon, was 108,293 people, with a density of 240 inhabitants per square kilometre or 620 inhabitants per square mile."
        ],
        [
            "Ethnicity"
        ],
        [
            "The population in the municipality is a mixture of different tribal origins.",
            "We can observe people speaking in different dialects/languages which are an implication of being foreign or in migrant to the locality."
        ],
        [
            "Based from historical accounts, the original inhabitants of Maramag came from the blood of Manobos and Maranaos.",
            "Through the years, Christians or Dumagats started to come and settle in the area.",
            "Among them, Cebuano tongue predominated the place, while other majority groups find their living in all the corners of Maramag, although Lumads can still be found."
        ],
        [
            "Languages and dialects"
        ],
        [
            "As shown in the Calendar Year 2000 Census of Population, the inhabitants of Maramag is composed of 77 carried ethnic groups.",
            "Cebuano is the dominant group among these carried ethnic groups.",
            "Other ethnic groups of higher headcount include Boholano, Hiligaynon/Ilonggo, Bukidnon, Ilocano and Tagalog."
        ],
        [
            "Economy"
        ],
        [
            "Waig Crystal Spring Resort"
        ],
        [
            "Maramag is home to inland aqua-culture hatcheries and Techno Demo Farm where agricultural technology is developed.",
            "The Dole Banana Plantation has a total area of 800 hectares.",
            "The plantation contributes to the supply of bananas exportation of the known DOLE Company."
        ],
        [
            "Industries include mulberry production, mineral and purified drinking water production, and sugar processing."
        ],
        [
            "RR Family Spring Resort"
        ],
        [
            "Tourism sect is booming with spring resorts scattered around the municipality, namely Waig, RR, MGM, Edlimar, Enchanted and Rockstar spring resort."
        ],
        [
            "Screenshots Cafe which opened in 2016 provided home theater facilities, the first of its kind in Bukidnon."
        ],
        [
            "Electric power is generated at the Pulangi IV Hydro Electric Plant in Barangay Camp 1.",
            "With rated capacity of 255 megawatts, the power plant supplies power to various provinces of Mindanao."
        ],
        [
            "The Maramag Public Wet Market was named as the cleanest wet market in the country by numerous blogging award-giving bodies."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Maramag |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Maramag: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved April 29, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ Pati CR!",
            "Palengke sa Bukidnon, tinaguriang pinakamalinis na wet market sa Pilipinas"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Maramag."
        ],
        [
            "Maramag"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Maramag"
        ],
        [
            "Valencia City"
        ],
        [
            "Pangantucan"
        ],
        [
            "Maramag"
        ],
        [
            "Quezon"
        ],
        [
            "Don Carlos"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Maramag&oldid=1214135919\""
        ],
        [
            "Categories: Municipalities of BukidnonPopulated places on the Rio Grande de MindanaoPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesUse mdy dates from November 2022Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}