{
    "name": "Masbate City",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Masbate City"
        ],
        [
            "29 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançais한국어IlokanoBahasa IndonesiaItalianoKapampanganLatviešuBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSimple EnglishSvenskaTagalogТатарча / tatarçaไทยاردوWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°22′26″N 123°37′29″E﻿ / ﻿12.3739°N 123.6247°E﻿ / 12.3739; 123.6247"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Capital of Masbate, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Masbate City\" – news · newspapers · books · scholar · JSTOR (January 2013) (Learn how and when to remove this message)"
        ],
        [
            "Component city in Bicol Region, PhilippinesMasbate CityComponent cityCity of Masbate"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "Rodeo Capital of Southeast Asia"
        ],
        [
            "Melting Pot of Diverse Cultures and Traditions in Central Philippines"
        ],
        [
            "Motto(s): Padayon na Pag-urusad, Katawhayan kag Progreso!",
            "(Continuing Unity for Peace and Prosperity!",
            ")Map of Masbate with Masbate City highlightedOpenStreetMapMasbate CityLocation within the PhilippinesCoordinates: 12°22′26″N 123°37′29″E﻿ / ﻿12.3739°N 123.6247°E﻿ / 12.3739; 123.6247CountryPhilippinesRegionBicol RegionProvinceMasbateDistrict"
        ],
        [
            "2nd districtFounded1864CityhoodSeptember 30, 2000Barangays30"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorSocrates M. Tuason • Vice MayorRowena R. Tuason • RepresentativeElisa T. Kho • City Council"
        ],
        [
            "Members"
        ],
        [
            "Rodolfo C. AbellaJarvey Jasper D. BalaRosemarie V. SalvacionAlberto R. AbayonAlex D. San PabloJoel V. IbañezAllan T. LimMeden G. DiezRamil O. YanezaJerry A. Rey"
        ],
        [
            " • Electorate63,105 voters (2022)Area • Revenue₱ 707.7 million (2020) • Assets₱ 1,608 million (2020) • Expenditure₱ 601 million (2020) • Liabilities₱ 453.3 million (2020)Service provider • ElectricityMasbate Electric Cooperative (MASELCO)Time zoneUTC+8 (PST)ZIP code5400PSGC054111000IDD : area code +63 (0)56Native languagesMasbateño TagalogWebsitewww.masbatecity.gov.ph"
        ],
        [
            "Masbate City, officially the City of Masbate (Masbateño: Syudad san Masbate; Filipino: Lungsod ng Masbate), is a 4th class component city and capital of the province of Masbate, Philippines.",
            "According to the 2020 census, it has a population of 104,522 people."
        ],
        [
            "As the only city in the province, Masbate City serves as the province's main commercial center and chief seaport.",
            "The city is more or less situated at the center of Masbate province and Masbate Island, about 212 aerial miles and 362 nautical miles from Manila.",
            "It is noted for its well-protected seaport, with Ticao Island acting as barrier against the effects of inclement weather from the north-east.",
            "Being located at the central part of the Philippine archipelago, the city serves as Bicol Region's gateway to the Visayas and Mindanao.",
            "It is accessible through sea and air transportation.",
            "The term \"Masbate\" comes from \"masbad\" which means \"machete\" when the spanish landed on the island of masbate in the 1790s the people welcomed the Spaniards into their area.",
            "As a sign of friendship with the Spaniards, they presented the Spaniards with gold and some utensils.",
            "The Spaniards found several gold mines in the mountains now covered by the town of Aroroy.",
            "And in the 1850s, there were spanish settlements in masbate.",
            "the town of Masbate was first founded in 1864. they later founded the Pueblo de Cervantéz (later named Placer) and the Town of Milagros in 1869 and the town of Malobago (Cataingan) in 1872."
        ],
        [
            "History"
        ],
        [
            "The account that \"Masbate\" was coined after the words \"masa\" and \"bate\" or from another word \"masibat\" remains anecdotal up to the present."
        ],
        [
            "Spanish colonial era and the Philippine Revolution"
        ],
        [
            "The islands of Masbate, Ticao and Burias were explored by Captain Luis Enriquez de Guzman in 1569.",
            "This exploration work was continued by Captain Andres de Ibarra.",
            "Ibalon (Albay) Province assumed jurisdiction over Masbate Islands, and Masbate was named the town's capital village; for security reasons, the seat of government had to be moved time and time again.",
            "It was first moved to Mobo and then again, to Guiom.",
            "It was later transferred to Palanog near the mouth of Lumbang River to make it more accessible to Bicol mainland and to the islands of Burias and Ticao.",
            "However, government records were kept inland in Cagay."
        ],
        [
            "The political history of the town dates back to the 1850s when the Spaniards established their government under a Spanish gobernadorcillo.",
            "Spanish control over Masbate was lost in mid-1898 when the Pulahanes forces besieged the town before handing it to the Philippine revolutionaries that arrived in Masbate soon after."
        ],
        [
            "Philippine-American War"
        ],
        [
            "Sometime after General Emilio Aguinaldo declared Philippine independence at Kawit, Cavite, he issued a military order to overthrow the Spanish Government in Masbate and the Visayas.",
            "General Justo Lucban and General Diego de Dios acted on this order with the help of Masbateño rebels under Pedro Kipte.",
            "Immediately thereafter, the military government under Aguinaldo's government was established.",
            "But when the American forces reached Masbate in November 1900, it took over the government of Masbate without any resistance from the Masbateños."
        ],
        [
            "American colonial era"
        ],
        [
            "Aerial view of Masbate, 1936"
        ],
        [
            "After a devastating typhoon in 1908, an Executive Order was passed annexing the province of Masbate to the province of Sorsogon.",
            "Masbate, by force of circumstance, became a sub-province of Sorsogon until 1922 when its provincial status was restored.",
            "Shortly before the restoration of Philippine Independence in 1946, the town of Masbate was established as the provincial capital."
        ],
        [
            "During World War II, the first elements of Japanese troops from Legazpi arrive on Masbate province at the dawn of January 7, 1942, on several places without any opposition as the forces stationed there retreated to Panay Island."
        ],
        [
            "Independent Philippines"
        ],
        [
            "In the mid-1990s, the idea of converting the municipality into a city was pushed by 2nd District House Representative Luz Cleta Reyes Bakunawa.",
            "Her successor, Congressman Emilio Espinosa Jr. together with the Municipal Mayor Juan P. Sanchez Sr. and some local officials and employees took over where she left off."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "On August 16, 2000, President Joseph Estrada signed Republic Act 8807 converting the Municipality of Masbate into a component city.",
            "In a plebiscite held later that year, Masbateños voted 7,800 to 3,200 in favor of cityhood, and on September 30, 2000, the Commission on Elections Regional Office in Region 5 officially proclaimed Masbate as a component city."
        ],
        [
            "Geography"
        ],
        [
            "The city is bounded on the north-east by Masbate Pass; on the south-west by the municipality of Milagros and on the north-west by a portion of Asid River and the municipalities of Milagros and Baleno."
        ],
        [
            "The city's territory, with 37.6 kilometres (23.4 mi) of shoreline, includes 300 square kilometres (120 sq mi) of municipal waters, 1,240 hectares (3,100 acres) of mangroves, 560 hectares (1,400 acres) of coral reefs, and 400 hectares (990 acres) of sea grasses.",
            "Residential land use covers 229.920 hectares (568.14 acres); commercial 15.0515 hectares (37.193 acres); fish ponds 252.9759 hectares (625.117 acres); and institutional 2,813.9192 hectares (6,953.346 acres)."
        ],
        [
            "Climate"
        ],
        [
            "Dry season is from February to June and rainy from July to February."
        ],
        [
            "Climate data for Masbate City, Philippines (1981–2010, extremes 1908–2012)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "37.6(99.7)"
        ],
        [
            "35.4(95.7)"
        ],
        [
            "36.3(97.3)"
        ],
        [
            "37.5(99.5)"
        ],
        [
            "37.4(99.3)"
        ],
        [
            "36.8(98.2)"
        ],
        [
            "36.8(98.2)"
        ],
        [
            "35.8(96.4)"
        ],
        [
            "36.1(97.0)"
        ],
        [
            "36.0(96.8)"
        ],
        [
            "36.0(96.8)"
        ],
        [
            "34.2(93.6)"
        ],
        [
            "37.6(99.7)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30.4(86.7)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "32.2(90.0)"
        ],
        [
            "33.5(92.3)"
        ],
        [
            "34.0(93.2)"
        ],
        [
            "33.4(92.1)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "32.4(90.3)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "30.7(87.3)"
        ],
        [
            "32.2(90.0)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "27.2(81.0)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "29.3(84.7)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "28.8(83.8)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "28.8(83.8)"
        ],
        [
            "28.6(83.5)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "27.3(81.1)"
        ],
        [
            "28.4(83.1)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "25.0(77.0)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "25.1(77.2)"
        ],
        [
            "25.1(77.2)"
        ],
        [
            "25.0(77.0)"
        ],
        [
            "24.8(76.6)"
        ],
        [
            "24.6(76.3)"
        ],
        [
            "23.8(74.8)"
        ],
        [
            "24.6(76.3)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "19.0(66.2)"
        ],
        [
            "16.1(61.0)"
        ],
        [
            "19.5(67.1)"
        ],
        [
            "21.1(70.0)"
        ],
        [
            "21.3(70.3)"
        ],
        [
            "21.3(70.3)"
        ],
        [
            "21.3(70.3)"
        ],
        [
            "19.8(67.6)"
        ],
        [
            "20.1(68.2)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "20.4(68.7)"
        ],
        [
            "18.2(64.8)"
        ],
        [
            "16.1(61.0)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "169.3(6.67)"
        ],
        [
            "101.8(4.01)"
        ],
        [
            "86.9(3.42)"
        ],
        [
            "54.1(2.13)"
        ],
        [
            "118.0(4.65)"
        ],
        [
            "155.7(6.13)"
        ],
        [
            "227.0(8.94)"
        ],
        [
            "178.1(7.01)"
        ],
        [
            "212.6(8.37)"
        ],
        [
            "233.0(9.17)"
        ],
        [
            "254.9(10.04)"
        ],
        [
            "258.9(10.19)"
        ],
        [
            "2,050.4(80.72)"
        ],
        [
            "Average rainy days (≥ 0.1 mm)"
        ],
        [
            "16"
        ],
        [
            "12"
        ],
        [
            "11"
        ],
        [
            "7"
        ],
        [
            "9"
        ],
        [
            "14"
        ],
        [
            "18"
        ],
        [
            "17"
        ],
        [
            "18"
        ],
        [
            "18"
        ],
        [
            "18"
        ],
        [
            "20"
        ],
        [
            "178"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "86"
        ],
        [
            "84"
        ],
        [
            "83"
        ],
        [
            "80"
        ],
        [
            "80"
        ],
        [
            "81"
        ],
        [
            "83"
        ],
        [
            "83"
        ],
        [
            "83"
        ],
        [
            "84"
        ],
        [
            "85"
        ],
        [
            "86"
        ],
        [
            "83"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Barangays"
        ],
        [
            "Masbate is politically subdivided into 30 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Here are the list of the Barangays with their corresponding population as of 2015 (outdated):"
        ],
        [
            "Anas - 1,152 (Rural)"
        ],
        [
            "Asid - 2,400 (Rural)"
        ],
        [
            "B. Titong (formerly Bugsayon)- 1,635 (Rural)"
        ],
        [
            "Bagumbayan - 4,806 (Urban)"
        ],
        [
            "Bantigue - 3,272 (Rural)"
        ],
        [
            "Bapor - 1,381 (Urban)"
        ],
        [
            "Batuhan - 1,953 (Rural)"
        ],
        [
            "Bayombon - 2,174 (Rural)"
        ],
        [
            "Biyong - 2,117 (Rural)"
        ],
        [
            "Bolo - 3,321 (Rural)"
        ],
        [
            "Cagay - 1,769 (Rural)"
        ],
        [
            "Cawayan Exterior - 1,330 (Rural)"
        ],
        [
            "Cawayan Interior - 945 (Rural)"
        ],
        [
            "Centro - 1,985 (Urban)"
        ],
        [
            "Espinosa - 5,741 (Urban)"
        ],
        [
            "F. Magallanes - 3,387 (Urban)"
        ],
        [
            "Ibingay - 7,144 (Urban)"
        ],
        [
            "Igang - 1,771 (Rural)"
        ],
        [
            "Kalipay (now known as J.T.",
            "Fernandez) - 1,944 (Urban)"
        ],
        [
            "Kinamaligan - 5,917 (Rural)"
        ],
        [
            "Maingaran - 3,664 (Rural)"
        ],
        [
            "Malinta - 4,153 (Rural)"
        ],
        [
            "Mapiña - 1,543 (Rural)"
        ],
        [
            "Nursery - 12,125 (Urban)"
        ],
        [
            "Pating - 3,480 (Urban)"
        ],
        [
            "Pawa - 2,253 (Rural)"
        ],
        [
            "Sinalongan - 1,114 (Rural)"
        ],
        [
            "Tugbo - 6,833 (Urban)"
        ],
        [
            "Ubongan Dacu - 1,267 (Rural)"
        ],
        [
            "Usab - 2,813 (Rural)"
        ],
        [
            "Anas"
        ],
        [
            "Anas came from the word \"Dangas\" which literally means bald.",
            "A native whose hair had seriously thinned out at the pâté lived in this place.",
            "\"Dangas\" later on became \"Angas\" and finally \"Angas\" became \"Anas\".",
            "Anas was established as a barangay in 1880 by the following persons: Vicente Lerit, Lorenzo Verano, Pedro Bello, Juan Cortes and Cornelio Bello.",
            "The tenientes who served the barangay in early times were Pedro Bello, Tomas Cortes, Antonio Suplito, Pedro Badillo, Timoteo Asne, Andres Verano, Epifanio Buhion, Felipe Zaragoza, Constantino Zaragoza, Casiano Lerit, Lucio Lerit, Bernabe Asne, Carmelito Cortes and Serapio Serrano.",
            "The sitios of Anas are Purang, Cabanatihan, Can-anab and Libas."
        ],
        [
            "Ibingay"
        ],
        [
            "Barangay Ibingay was originally called Punta Ibingay the name came from the word \"Bingcay\" or assorted seashells, which children played with, while their mothers were busy with the entre cuatro or card playing.",
            "In 1973, it was renamed \"Balo\" or swordfish, the kind of fish often caught by fishermen in Ibingay waters.",
            "However, \"Balo\" did not stick.",
            "People continued to refer to the place as \"Ibingay\".",
            "So, today, Ibingay remains as its official name."
        ],
        [
            "Asid"
        ],
        [
            "Asid, according to the legend, was formerly called \"Asin\".",
            "Asid River separates Masbate City from Milagros Municipality.",
            "This barangay is known for its bamboo craft.",
            "Incidentally, Asid is also the name for the gulf which is a rich fishing ground in the vicinity of Milagros town."
        ],
        [
            "B. Titong"
        ],
        [
            "Barangay B. Titong was named after Benigno Titong Jr. who donated the barangay site of B. Titong.",
            "His father, Benigno Sr. was a German national who came to Masbate as a trader of lumber.",
            "He settled in what is now B. Titong.",
            "Formerly the place was called \"Bugsayon\".",
            "The barangay was established in 1890.",
            "The original families of Bugsayon were the Veranos, Tumambacs and the Titongs.",
            "The first Teniente del Barrio was Bernaldo Verano followed by Eulogio Verano, Isidro Verano, Felipe Verano and Mario Verano."
        ],
        [
            "Bagumbayan"
        ],
        [
            "Bagumbayan was formerly called \"goma\".",
            "In time, the place was used by laborers as a temporary corral for cattle while the shippers were waiting for the vessel that would transport the animals to Manila.",
            "Later, the laborers called the place Bagumbayan or New Town when transients built their homes near the shore and a community was created.",
            "The name \"goma\" was forgotten due to disuse.",
            "Today, Bagumbayan is bursting at the seams so to speak, because of the influx of people."
        ],
        [
            "Bantigue"
        ],
        [
            "Bantigue, a barangay across the sea facing the city poblacion is a fishing village founded by the Boholano fishermen who migrated to Masbate sometime in the 1950s.",
            "Its name was derived from the Borobantigue tree, a species of mangrove abundantly growing in the Bantigue mudflats in the olden days.",
            "Bantigue barangay is better known as the place where the native dance \"Lapay Bantigue\" originated."
        ],
        [
            "Bapor"
        ],
        [
            "Barangay Bapor in earlier times was called \"Puerto de San Antonio\", then it was named Muelle later on, and then renamed \"Eldorado\", because this was the name of the Corporation which bought copra, the bodega of which was called El Dorado.",
            "In 1973, it was named bapor because of the ships that dock at Masbate wharf, which is found in the barangay.",
            "An incident tells that in 1973, when the barangay officials were deliberating and mulling on the proper name for their barangay, an incoming boat sounded its horn.",
            "Then, someone in the group said, \"Why don't we call this place \"Bapor\" and everyone nodded in approval."
        ],
        [
            "Batuhan"
        ],
        [
            "Barangay Batuhan came from \"Kabatuhan\" meaning, where rocks or boulders abound.",
            "The locality of this barangay has a large deposit of marble rocks or \"kabatuhan\".",
            "It is unfortunate that up to this writing, no effort has been exerted to quarry the deposit of marbles or to exploit the \"guano\" (bat droppings) and the edible birds nest from the caves of this barangay.",
            "Some of the noted settlers of Batuhan were Lucas Zurbito, Felipe Danao, Pedro Rosero, Venancio Natural, Ambrosio Brioso, Nicolas Danao, Francisco Malunes, Apolinario Ebona and Aproniano Torres.",
            "The sitios of Batuhan are Ed-idan, Makalangkag, Kampoon, Bukana, Ilawod, Iraya, Pacil, Kabagohan, and Ubo.",
            "The barangay was founded in 1882.",
            "With Lucas Zurbito as the first Cabeza de Barangay.",
            "The Tenientes del Barrio who were selected by the people through the years were Mariano Cervantes, Toribio Brioso, Onofre Danao, Epifanio Torres, Rufino Cebu, Jose Espinosa, and Agaton Espinosa."
        ],
        [
            "Bayombon"
        ],
        [
            "Bayombon originated from the term Bayong and Bong.",
            "Bayong is a large buri bag, where farmers place the things they bought from Malinta during the market days.",
            "Bong is a nickname of endearment for a boy.",
            "\"Daraha tabi an bayong, Bong\", or please bring the bag, Bong.",
            "Later it evolved into \"Bayongbong\" and then \"Bayombon\".",
            "Another legend about the name Bayombon tells that it was named \"baybay sa bobon\" which refers to the sand in the well.",
            "The sitios of Bayombon are Mapugahan and Macawayan.",
            "The barangay was established in 1895 by the following families: Bacar, Torres, Guadayo, Andaya, Danao, Recto, Nerza, Francisco and Manlapaz.",
            "The Tenientes del Barrio were: Fructuoso Candidato, Eulalio Ramos, Ciriaco Bevantucios, Bibrano Manlapaz, Prudencio Nerza, Heracleo Fermin, Saturnino Tupas, Gaudencio Natural and Cresencio Bacar."
        ],
        [
            "Biyong hills"
        ],
        [
            "Biyong"
        ],
        [
            "Biyong came from the native term \"lambiyong\", meaning whirlwind.",
            "Biyong is a level land below Igang Mountain.",
            "During bad weather, the wind tends to form into a whirlwind, which usually destroys houses and crops.",
            "In the course of time \"lambiyong\" shortened to \"Biyong\".",
            "This is a farming barangay."
        ],
        [
            "Bolo"
        ],
        [
            "Nipa and Pagbato-on are sitios of Bolo.",
            "The barangay was established in 1926 by the following people: Daniel Fernandez, Mateo Fernandez, Julian Antonio, Timoteo Valladores, Emiliano Gutierrez, Hilario Dometita.",
            "The barangay captains were Fortunato Flores, Mateo Fernandez, Andres Buhion, Cesario Natural, Enrique Ragaza, Venancio Azuto, and Bino Gutierrez.",
            "Bolo is an Ilonggo word which means a small variety of bamboo called Bolo Bagacay, which grew abundantly in Bolo before."
        ],
        [
            "Cagay"
        ],
        [
            "Cagay got its name from the common vine plant called \"cagay\".",
            "The vine was used for ropes of carabaos because it is stronger than rattan.",
            "The sitios of Cagay are Caly, Tagbon, and Burabod.",
            "The barangay was established in 1897 by Telesforo Rejuso, and the families of Dalanon, Espares, Malunes, delos Reyes, Saldivar and Robles."
        ],
        [
            "Cawayan Exterior"
        ],
        [
            "Cawayan is a Masbateño word for bamboo.",
            "Barangay Cawayan Exterior was established in the 1900s.",
            "The sitios are: Danao, Bil-at, Lab-ogan and Pocdol.",
            "The original families of Cawayan were: Hermogenes Verano, Domingo Bajar, Pedro Cabug, Dionisio Celebre, Basilio Floresta, Pedro Cornal, Pio Cebu, Timoteo Valladores, Regacio Verano, Alberto Cabug and Florencio Fernandez Sr., the father of the governor of Masbate, Jolly T. Fernandez."
        ],
        [
            "Cawayan Interior"
        ],
        [
            "The barangay is called Cawayan Interior because the place were bounded from coastal to upland west was situated in between Bolo, Batuhan, and Cawayan exterior.",
            "Since Cawayan upland is a sitio of Cawayan coastal (Cawayan Exterior), there happened to be an agreement of splitting into two Cawayans.",
            "This was them the idea of a certain leader Mr. Florencio Fernandez Sr. soon the official separation was made in October 1966 initiative of them Mayor Juan P. Sanchez Sr. according to sources the barangay was organized sometimes in 1971:kind hearted individuals donated the lot to be the barangay site it was Mr. Leopoldo Brioso who solicited from the late Lope Buncaras Sr. and Antonio Luzanta Sr. to donate.",
            "Folks main sources of income were farming left coastal community and settled fishing remained in the coast to fish for a decent living."
        ],
        [
            "Downtown Masbate"
        ],
        [
            "Centro"
        ],
        [
            "Barangay Centro is situated at the center of the city.",
            "The first Barangay Chairman was Mr. Agapito Guadayo Sr., followed by Dr. Antonio Chang and Dr. Ricardo Lazaga.",
            "Juan Zaragoza and his family resided along Lugsadan during Spanish Era occupying his property."
        ],
        [
            "Espinosa"
        ],
        [
            "Barangay Talahib, formerly known as Lomboy got its name sometime in 1972, when the late Tito R. Espinosa became the Municipal Mayor of Masbate Town.",
            "Talahib was the former Mayor's moniker when addressed by his close associates.",
            "Later, Talahib became Barangay Espinosa when an assassin gunned down Tito who died in Quezon City in 1995."
        ],
        [
            "F. Magallanes"
        ],
        [
            "Barangay Magallanes was formerly called \"Upa\".",
            "It was a soggy swampy place but because of the Veloso Rice Mill, which deposits rice hull, the swamp was reclaimed from the sea in the course of time.",
            "Eventually, homeless settlers occupied and named the place Barangay F. Magallanes in honor of the late Francisco Magallanes the Mayor of Masbate in 1931, and the father of former Mayor of Masbate Benjamin M. Magallanes who served the town for 25 years."
        ],
        [
            "Igang"
        ],
        [
            "Igang was named after the sharp stones that litter the area or kaigangan.",
            "The sitios of Igang are Cacia, Cabulu-an, Manticaun.",
            "Casili, Tuminobo and Buyog.",
            "The barangay was established in 1890.",
            "The original families of Igang were: Marcos, Pusing, Amaro, Andaya, Dela Peña, Gamgam, Esquillo and Arciete.",
            "The barangay tenientes were: Zoilo Amaro, Nicolas Lupango, Benito Marcos, Macario Senede, and Rencio Presado."
        ],
        [
            "J. T. Fernandez"
        ],
        [
            "JT Fernandez is a poblacion barangay.",
            "This barangay was known as barangay Kalipay, which means happiness, since the 1973 when the City poblacion was divided into barangays.",
            "Kalipay was renamed into JT Fernandez to honor the former OIC Governor and former Assemblyman Jolly T. Fernandez through Resolution No.113-94 by motion of Esteban G. Almero on December 20, 1994."
        ],
        [
            "Kinamaligan"
        ],
        [
            "Kinamaligan was an old name.",
            "It literally means a \"camalig\" or a nipa hut built in the area.",
            "Today, Kinamaligan is being urbanized.",
            "However, because of the narrow strip between the sea and the roadside, houses are overcrowded.",
            "For its expansion, it has to reclaim a generous portion of the sea nearby."
        ],
        [
            "Malinta"
        ],
        [
            "The name \"Malinta\" originated from the root word \"Linta\" which means leech – a small (about one inch in length and ¼ inch in width) blood-sucking worm that inhabit the dark but warm forest corridor.",
            "When engorged with blood, the worm swells to about two inches in length and a half inch in width.",
            "\"Malinta\" literally means the place where linta/leeches are plentiful.",
            "This must have started in the later part of the 1800s when Malinta was still forested.",
            "A highland barangay, Malinta is a growing community with 500 households according to the latest Census.",
            "During saudan or tiangge (marketdays) Malinta is a center of trade for various goods such as farm products, livestock, fish and assorted commercial commodities.",
            "It is a meeting place for minor entrepreneurs and farmers.",
            "Juan Villamor was the first Teniente del Barrio of Malinta."
        ],
        [
            "Mapiña"
        ],
        [
            "Mapiña may have gotten its name from the piña or pineapple grove planted in the area.",
            "Mapiña means the place where pineapple is plentiful."
        ],
        [
            "Maingaran"
        ],
        [
            "Maingaran probably came about in the 1930s when Pio V. Corpuz was a Congressman for Masbate.",
            "His residential house was built one hundred meters away from the road.",
            "In order to inform his visitors, the name \"Don Pio V. Corpuz\" was printed and placed right at the roadside.",
            "Since then, the people refer to the place \"May ngaran\" which literally means – the site where the name was printed.",
            "May Ngaran eventually evolved into Maingaran.",
            "The sitios of Maingaran are Calpi, Buyog, Pukdol, Bagalihog, Daan-Lungsod, and Panangdangan.",
            "The original families were: Julian Casadangan, Antonio Malunes, Lorenzo Malunes, Jorge Malunes, Lutz Radaza, Leoncio Cabatingan, Isidro Villaraiz, Macario Cristobal, Juan Dioquino, Antonio Fernandez, and Gregorio Sampaga."
        ],
        [
            "Nursery"
        ],
        [
            "Barangay Nursery, was the original name of the place.",
            "Sometime in the 1950s, the area was occupied by the Masbate Provincial Nursery under Mr. Romeo Escuadra, Provincial Agriculturist.",
            "In the course of time, at the periphery of Nursery, the population grew.",
            "In 1973, the place was renamed \"Acacia\", but like \"Balo\" the name was not popular.",
            "The residents continued to call their place Nursery.",
            "So Nursery remains as the official name of the barangay."
        ],
        [
            "Pating"
        ],
        [
            "Barangay Pating, formerly called \"Ubos\" elected Natividad Cervantes whose alias was \"Pating\", the first Barangay Chairman of the said barangay."
        ],
        [
            "Pawa"
        ],
        [
            "Pawa is a Masbateño term for clearing.",
            "In the olden days, the place was heavily forested with mangrove trees.",
            "The residents decided to cut the trees and created a clearing.",
            "They built a cluster of houses and then in the course of time, Pawa community was formed.",
            "Boat building and fishing are the major industries of Pawa barangay."
        ],
        [
            "Tugbo"
        ],
        [
            "Tugbo Barangay is situated some four kilometers south of Masbate City proper.",
            "The legend of the place tells that its name originated from \"tigbe\" a kind of wild plant which thrived abundantly in olden days.",
            "Tugbo is a fishing community, no wonder then that the Badjaos who came in droves some two years ago had chosen the shoreline of Tugbo as their dwelling place."
        ],
        [
            "Ubongan Dacu"
        ],
        [
            "Ubongan, on the other hand was named after the portion of the river where residents wade especially during the rainy season when the river swells.",
            "Originally, it was \"ubogan\", meaning, where one wades, from the root word \"ubog\" or wade."
        ],
        [
            "Usab"
        ],
        [
            "Usab originated from the Cebuano word \"usab\" which literally means \"again\".",
            "When the Combined American-Filipino Liberation Army came in 1945, it is said that a Cebuano farmer had crossed the street and was almost run over by a large army truck.",
            "Later, he told the people that he will not cross the street again if there is a vehicle around by saying \"Dili na ako mo-usab paglakaw sa kalsada ug na-ay sakyahan nga mo-agi\".",
            "The people named the place where the incident happened, \"Usab\".",
            "The barangay is a farming community."
        ],
        [
            "Demographics"
        ],
        [
            "City Hall of Masbate"
        ],
        [
            "Population census of Masbate CityYearPop.±% p.a.1903 5,235—    1918 10,821+4.96%1939 23,312+3.72%1948 24,999+0.78%1960 31,613+1.98%1970 45,591+3.72%1975 46,728+0.50%1980 52,944+2.53%YearPop.±% p.a.1990 58,714+1.04%1995 66,049+2.23%2000 71,441+1.70%2007 81,585+1.85%2010 85,227+1.60%2015 95,389+2.17%2020 104,522+1.81%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Masbate City was 104,522 people, with a density of 560 inhabitants per square kilometre or 1,500 inhabitants per square mile.",
            "The city's majority language is Masbateño, with Hiligaynon, Waray, Cebuano and Bicolano following next."
        ],
        [
            "Religion"
        ],
        [
            "The city is the ecclesiastical seat of the Roman Catholic Diocese of Masbate with the Cathedral of Saint Anthony of Padua (Masbate Cathedral) as its church.",
            "Like most Filipinos, the vast majority of the city's residents are Roman Catholics."
        ],
        [
            "Economy"
        ],
        [
            "Lugsadan Commercial Center, Masbate City"
        ],
        [
            "Poverty incidence of Masbate City"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  29.10"
        ],
        [
            "2009  28.88"
        ],
        [
            "2012  22.18"
        ],
        [
            "2015  30.04"
        ],
        [
            "2018  19.55"
        ],
        [
            "2021  15.95"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Masbate City was recognized by the Philippine Chamber of Commerce and Industry as Top 4 Awardee Nationwide in the 2013 Most Business-Friendly LGU Award (City Level 3 Category).",
            "The city is also cited as the 20th Most Competitive City among 143 cities in the Philippines."
        ],
        [
            "The city is the center of trading activities in the province.",
            "It serves as the intra-distributor of almost all commodities being traded to other municipalities in the entire province."
        ],
        [
            "Industry"
        ],
        [
            "Masbate's main products are copra and marine resources such as fish.",
            "These are traded to Manila, Lucena, Legazpi, and Cebu cities.",
            "Other traded products such as dried fish, crabs, prawn, bangus, livestock, and rice are coming from the neighboring or nearby municipalities on the island."
        ],
        [
            "Trading relations"
        ],
        [
            "The city has existing trading relations with Manila, Iligan, Lucena, Daet, Legazpi, Naga, Sorsogon, Panay, Negros, Cebu, Bohol, Ormoc, Calbayog and Tacloban.",
            "These are the main destinations of the products traded by the city and those of the other municipalities passing through the city's port.",
            "Copra, cattle and aquamarine products are also shipped-out to Manila, Cebu, Batangas and Lucena, etc.",
            "Shrimps, crabs and prawns are shipped to Japan, mud crabs to Taiwan, headless squid to United States of America and Japan, crab meat to U.S.A. and scallops to Europe."
        ],
        [
            "The city is importing products mainly from Manila, Lucena, Cebu and Legazpi.",
            "These are mostly rice, bakery raw materials, transport vehicles and appliances, farm inputs, construction materials and basic commodities.",
            "These are also traded by the city to other municipalities in the whole province."
        ],
        [
            "Banking and finance"
        ],
        [
            "Masbate City is the Financial Center of Masbate Province.",
            "The total number of Banks in the city is 15, consisting of different Government-owned Banks, Universal Bank, Commercial Banks, Rural Banks, Development Banks and Thrift Banks.",
            "Banco de Oro or BDO which is the country's largest bank in terms of assets open its first branch in the entire province in the city."
        ],
        [
            "Shopping malls"
        ],
        [
            "LCC Mall and Gaisano Capital Masbate are the only two shopping malls in the city.",
            "LCC Masbate is located at Barangay Bapor, Zurbito St.",
            "Port Area, while Gaisano Capital Masbate is located in Cagba St."
        ],
        [
            "Tourism"
        ],
        [
            "Festivals and events"
        ],
        [
            "Pagdayao Festival"
        ],
        [
            "This festival honors, praises and give thanks to the city's Patron Saint Anthony of Padua every June 13 of the year."
        ],
        [
            "Lapay Bantigue Dance Festival"
        ],
        [
            "It is celebrated during the City Anniversary on 30th day of September.",
            "This event highlights the traditional folk dance created by \"Lola Felisa\" many years ago, when she imitated the graceful movement of the seagull (locally known as Lapay).",
            "The dance has evolved and is now recognized by the Cultural Center of the Philippines as one of the official folk dances of the country.",
            "This dance was also recognized during the Spanish Colonization."
        ],
        [
            "Rodeo Masbateño"
        ],
        [
            "It is the only rodeo show in Asia.",
            "It is celebrated annually in April and showcase 10 competitive rodeo events.",
            "Highlighting this event is the difficult \"figure of eight\" competition where the cowboy crisscrosses around a group of barrels.",
            "Women participate in heart stopping events like calf wrestling, calf lassoing and carambola."
        ],
        [
            "Places of interest"
        ],
        [
            "Masbate Cathedral"
        ],
        [
            "Masbate Cathedral formally known as the Cathedral-Parish of Saint Anthony of Padua, is a Roman Catholic church located at Quezon Street, Masbate City.",
            "It is the cathedral or seat of the Roman Catholic Diocese of Masbate.",
            "It belongs to the Vicariate of St. Anthony of Padua, which includes also Sacred Heart of Jesus Parish in Malinta, Masbate City and St. Nicholas of Tolentino Parish in Mobo.",
            "It was founded in 1578 by Spanish Missionaries."
        ],
        [
            "Coastal Resource Management Interpretative Center (CRMIC)"
        ],
        [
            "Being the first of its kind in the Philippines is a great staging point from which you can plan and begin your journey of discovery and exploration of the diverse and amazing natural and cultural wonders of Masbate."
        ],
        [
            "Magallanes Coliseum"
        ],
        [
            "Magallanes Coliseum The Magallanes Coliseum is a 1230 square meter amenity constructed in 2004 as a venue for sports, recreation, and other major city celebrations."
        ],
        [
            "Natural attractions"
        ],
        [
            "Pawa Mangrove Nature Park"
        ],
        [
            "The city's biggest area of natural mangrove growth, with 300 hectares of mangrove plantation along its 1.3 kilometer boardwalk."
        ],
        [
            "Buntod Sand Bar and Marine Sanctuary"
        ],
        [
            "Buntod Sand Bar The first established marine sanctuary of the city where live hard and soft coral covers highlights the majestic underwater sceneries."
        ],
        [
            "Bugsayon Marine Sanctuary"
        ],
        [
            "A 50-hectare marine sanctuary where you can experience to see the amazing live corals and its diverse marine animals."
        ],
        [
            "Tattoo Island"
        ],
        [
            "Also called as Minalayo Island.",
            "It has a number of openings of various sizes that lead to an underground lagoon where sea snakes and bats reign."
        ],
        [
            "Transportation"
        ],
        [
            "By air"
        ],
        [
            "The city is accessible by air via the Moises R. Espinosa Airport that is located within the city proper.",
            "Cebu Pacific (operated by Cebgo) has morning flights to and from Manila."
        ],
        [
            "By land"
        ],
        [
            "Masbate can be reached from Manila by land through South Road to the Port of Pio Duran, Albay, Pilar, Sorsogon, and Bulan, Sorsogon.",
            "From there, RORO ferry and fastcraft take about two hours and fifteen minutes or motorized boat for a three-hour ride to the Port of Masbate."
        ],
        [
            "By sea"
        ],
        [
            "Masbate Port"
        ],
        [
            "Masbate can also be reached through the sea on board in a luxury shipping lines from the Port of Manila, taking about 16 to 18 hours.",
            "Other sea trips are via Dalahican Port in Lucena, Pio Duran Port in Pio Duran, Albay and to Allen, Northern Samar."
        ],
        [
            "To the neighboring islands, Masbate City is three hours away by boat from the nearest point in Bicol mainland; three hours away from the nearest point in Burias; three hours away from the nearest municipality in Ticao Island; five hours from the nearest point in the island of Cebu and five hours from the nearest point in Panay island."
        ],
        [
            "Notable personalities"
        ],
        [
            "Emilio R. Espinosa Jr.: served as Secretary of Labor under President Ferdinand Marcos."
        ],
        [
            "Leonardo Quisumbing: former Secretary of Labor and Employment and Associate Justice of the Supreme Court."
        ],
        [
            "Bea Rose Santiago: Miss International 2013"
        ],
        [
            "Jesse Robredo: The secretary who died in a plane crash at Masbate islands nearby."
        ],
        [
            "Kisses Delavin: Actress and singer"
        ],
        [
            "Hannah Arnold: Binibining Pilipinas International 2021"
        ],
        [
            "Sister cities"
        ],
        [
            "Local"
        ],
        [
            " Legazpi City, Albay"
        ],
        [
            " Daet, Camarines Norte"
        ],
        [
            " Kalibo"
        ],
        [
            "See also"
        ],
        [
            "Masbateño people"
        ],
        [
            "Masbateño language"
        ],
        [
            "References"
        ],
        [
            "^  City of Masbate |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b c d \"History of Masbate City\".",
            "Official Website of the City of Masbate.",
            "September 3, 2013.",
            "Retrieved May 2, 2014."
        ],
        [
            "^"
        ],
        [
            "\"Masbate Climatological Normal Values\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on October 18, 2018.",
            "Retrieved October 18, 2018."
        ],
        [
            "^"
        ],
        [
            "\"Masbate Climatological Extremes\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on October 18, 2018.",
            "Retrieved October 18, 2018."
        ],
        [
            "^ \"An Act to Change the Name of Barrio Bugsayon, Municipality of Masbate, Province of Masbate, to Barrio B. Titong\".",
            "LawPH.com.",
            "Retrieved April 11, 2011."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Masbate\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Masbate."
        ],
        [
            "Wikimedia Commons has media related to Masbate City."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Region V Local Government Units"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Masbate City"
        ],
        [
            "San JacintoMasbate Pass"
        ],
        [
            "San FernandoMasbate Pass"
        ],
        [
            "Baleno"
        ],
        [
            "Masbate City"
        ],
        [
            "Milagros"
        ],
        [
            "Mobo"
        ],
        [
            "vte Province of MasbateMasbate City (capital and largest city)Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Batuan"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Dimasalang"
        ],
        [
            "Esperanza"
        ],
        [
            "Mandaon"
        ],
        [
            "Milagros"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Palanas"
        ],
        [
            "Pio V. Corpus"
        ],
        [
            "Placer"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Pascual"
        ],
        [
            "Uson"
        ],
        [
            "Component city"
        ],
        [
            "Masbate City"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "vteBicol Region (Region V)Provinces"
        ],
        [
            "Albay"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Catanduanes"
        ],
        [
            "Masbate"
        ],
        [
            "Sorsogon"
        ],
        [
            "Regional center"
        ],
        [
            "Legazpi"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Daet"
        ],
        [
            "Legazpi"
        ],
        [
            "Masbate City"
        ],
        [
            "Pili"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Virac"
        ],
        [
            "Metropolitan areas"
        ],
        [
            "Metro Naga"
        ],
        [
            "Independent component cities"
        ],
        [
            "Naga"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Iriga"
        ],
        [
            "Ligao"
        ],
        [
            "Masbate City"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Tabaco"
        ],
        [
            "Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baao"
        ],
        [
            "Bacacay"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Balatan"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Baras"
        ],
        [
            "Barcelona"
        ],
        [
            "Basud"
        ],
        [
            "Bato (Camarines Sur)"
        ],
        [
            "Bato (Catanduanes)"
        ],
        [
            "Batuan"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camalig"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Capalonga"
        ],
        [
            "Caramoan"
        ],
        [
            "Caramoran"
        ],
        [
            "Casiguran"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Daet"
        ],
        [
            "Daraga"
        ],
        [
            "Del Gallego"
        ],
        [
            "Dimasalang"
        ],
        [
            "Donsol"
        ],
        [
            "Esperanza"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Gigmoto"
        ],
        [
            "Goa"
        ],
        [
            "Gubat"
        ],
        [
            "Guinobatan"
        ],
        [
            "Irosin"
        ],
        [
            "Jose Panganiban"
        ],
        [
            "Jovellar"
        ],
        [
            "Juban"
        ],
        [
            "Labo"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Libon"
        ],
        [
            "Lupi"
        ],
        [
            "Magallanes"
        ],
        [
            "Magarao"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Mandaon"
        ],
        [
            "Manito"
        ],
        [
            "Matnog"
        ],
        [
            "Mercedes"
        ],
        [
            "Milaor"
        ],
        [
            "Milagros"
        ],
        [
            "Minalabac"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Nabua"
        ],
        [
            "Oas"
        ],
        [
            "Ocampo"
        ],
        [
            "Palanas"
        ],
        [
            "Pamplona"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "Paracale"
        ],
        [
            "Pasacao"
        ],
        [
            "Pilar"
        ],
        [
            "Pili"
        ],
        [
            "Pio Duran"
        ],
        [
            "Pio V. Corpuz"
        ],
        [
            "Placer"
        ],
        [
            "Polangui"
        ],
        [
            "Presentacion"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Ragay"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Sagñay"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando (Camarines Sur)"
        ],
        [
            "San Fernando (Masbate)"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Jose"
        ],
        [
            "San Lorenzo Ruiz"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pascual"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Talisay"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Tiwi"
        ],
        [
            "Uson"
        ],
        [
            "Viga"
        ],
        [
            "Vinzons"
        ],
        [
            "Virac"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provincial capital cities and municipalities of the PhilippinesLuzon"
        ],
        [
            "Abra: Bangued"
        ],
        [
            "Albay: Legazpi"
        ],
        [
            "Apayao: Kabugao / Luna1"
        ],
        [
            "Aurora: Baler"
        ],
        [
            "Bataan: Balanga"
        ],
        [
            "Batanes: Basco"
        ],
        [
            "Batangas: Batangas City"
        ],
        [
            "Benguet: La Trinidad"
        ],
        [
            "Bulacan: Malolos"
        ],
        [
            "Cagayan: Tuguegarao"
        ],
        [
            "Camarines Norte: Daet"
        ],
        [
            "Camarines Sur: Pili"
        ],
        [
            "Catanduanes: Virac"
        ],
        [
            "Cavite: Imus / Trece Martires1"
        ],
        [
            "Ifugao: Lagawe"
        ],
        [
            "Ilocos Norte: Laoag"
        ],
        [
            "Ilocos Sur: Vigan"
        ],
        [
            "Isabela: Ilagan"
        ],
        [
            "Kalinga: Tabuk"
        ],
        [
            "La Union: San Fernando"
        ],
        [
            "Laguna: Santa Cruz"
        ],
        [
            "Marinduque: Boac"
        ],
        [
            "Masbate: Masbate City"
        ],
        [
            "Mountain Province: Bontoc"
        ],
        [
            "Nueva Ecija: Palayan"
        ],
        [
            "Nueva Vizcaya: Bayombong"
        ],
        [
            "Occidental Mindoro: Mamburao"
        ],
        [
            "Oriental Mindoro: Calapan"
        ],
        [
            "Palawan: Puerto Princesa"
        ],
        [
            "Pampanga: San Fernando"
        ],
        [
            "Pangasinan: Lingayen"
        ],
        [
            "Quezon: Lucena"
        ],
        [
            "Quirino: Cabarroguis"
        ],
        [
            "Rizal: Antipolo"
        ],
        [
            "Romblon: Romblon"
        ],
        [
            "Sorsogon: Sorsogon City"
        ],
        [
            "Tarlac: Tarlac City"
        ],
        [
            "Zambales: Iba"
        ],
        [
            "Visayas"
        ],
        [
            "Aklan: Kalibo"
        ],
        [
            "Antique: San Jose de Buenavista"
        ],
        [
            "Biliran: Naval"
        ],
        [
            "Bohol: Tagbilaran"
        ],
        [
            "Capiz: Roxas"
        ],
        [
            "Cebu: Cebu City"
        ],
        [
            "Eastern Samar: Borongan"
        ],
        [
            "Guimaras: Jordan"
        ],
        [
            "Iloilo: Iloilo City"
        ],
        [
            "Leyte: Tacloban"
        ],
        [
            "Negros Occidental: Bacolod"
        ],
        [
            "Negros Oriental: Dumaguete"
        ],
        [
            "Northern Samar: Catarman"
        ],
        [
            "Samar: Catbalogan"
        ],
        [
            "Siquijor: Siquijor"
        ],
        [
            "Southern Leyte: Maasin"
        ],
        [
            "Mindanao"
        ],
        [
            "Agusan del Norte: Cabadbaran / Butuan1"
        ],
        [
            "Agusan del Sur: Prosperidad"
        ],
        [
            "Basilan: Lamitan / Isabela1"
        ],
        [
            "Bukidnon: Malaybalay"
        ],
        [
            "Camiguin: Mambajao"
        ],
        [
            "Cotabato: Kidapawan"
        ],
        [
            "Davao de Oro: Nabunturan"
        ],
        [
            "Davao del Norte: Tagum"
        ],
        [
            "Davao del Sur: Digos"
        ],
        [
            "Davao Occidental: Malita"
        ],
        [
            "Davao Oriental: Mati"
        ],
        [
            "Dinagat Islands: San Jose"
        ],
        [
            "Lanao del Norte: Tubod"
        ],
        [
            "Lanao del Sur: Marawi"
        ],
        [
            "Maguindanao del Norte: Datu Odin Sinsuat"
        ],
        [
            "Maguindanao del Sur: Buluan"
        ],
        [
            "Misamis Occidental: Oroquieta"
        ],
        [
            "Misamis Oriental: Cagayan de Oro"
        ],
        [
            "Sarangani: Alabel"
        ],
        [
            "South Cotabato: Koronadal"
        ],
        [
            "Sultan Kudarat: Isulan"
        ],
        [
            "Sulu: Jolo"
        ],
        [
            "Surigao del Norte: Surigao City"
        ],
        [
            "Surigao del Sur: Tandag"
        ],
        [
            "Tawi-Tawi: Bongao"
        ],
        [
            "Zamboanga del Norte: Dipolog"
        ],
        [
            "Zamboanga del Sur: Pagadian"
        ],
        [
            "Zamboanga Sibugay: Ipil"
        ],
        [
            "1 de facto seat of provincial government"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Masbate_City&oldid=1224927735\""
        ],
        [
            "Categories: Cities in the Bicol RegionPopulated places in MasbateProvincial capitals of the PhilippinesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse mdy dates from July 2022Articles needing additional references from January 2013All articles needing additional referencesPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Filipino-language textCommons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}