{
    "name": "Minalin",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Minalin"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°58′N 120°41′E﻿ / ﻿14.97°N 120.68°E﻿ / 14.97; 120.68"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "The Municipality of Minalin Pampanga Philippines"
        ],
        [
            "Municipality in Central Luzon, PhilippinesMinalinMunicipalityMunicipality of MinalinSta.",
            "Monica Parish Church"
        ],
        [
            "FlagSealNickname: Egg basket of Central LuzonMotto: \"Minaleño First/Panyulung Minalin\"Anthem: Himno ning Minalin (Minalin Hymn)Map of Pampanga with Minalin highlightedOpenStreetMapMinalinLocation within the PhilippinesCoordinates: 14°58′N 120°41′E﻿ / ﻿14.97°N 120.68°E﻿ / 14.97; 120.68CountryPhilippinesRegionCentral LuzonProvincePampangaDistrict"
        ],
        [
            "4th districtFoundedAugust 27, 1614Barangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorNoel Philip S. Naguit • Vice MayorRondon M. Mercado • RepresentativeAnna York P. Bondoc • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Richelle P. NaguitDanilo S. SungaChristian S. LagmanQuerolico D. DaagFrancisco G. Flores Jr.Edgar S. SitchonEnrico P. SubaJohn Nikki P. Sotto"
        ],
        [
            " • Electorate32,654 voters (2022)Area • Revenue₱ 164.8 million (2020) • Assets₱ 122.6 million (2020) • Expenditure₱ 140.1 million (2020) • Liabilities₱ 37.56 million (2020)Service provider • ElectricityPampanga 3 Electric Cooperative (PELCO 3)Time zoneUTC+8 (PST)ZIP code2019PSGC035414000IDD : area code +63 (0)45Native languagesKapampangan TagalogWebsitewww.minalin.gov.ph"
        ],
        [
            "Minalin, officially the Municipality of Minalin (Kapampangan: Balen ning Minalin; Filipino: Bayan ng Minalin), is a 4th class municipality in the province of Pampanga, Philippines.",
            "According to the 2020 census, it has a population of 48,380 people."
        ],
        [
            "Originally known as Minalis, it has a land area of about 48.27 km2 (18.64 sq mi), and it is located south-west of the capital city of San Fernando."
        ],
        [
            "The name of the Municipality \"Minalin\" came from the word \"Minalis\" or \"Minalis la ding dutung\".",
            "This got its name during the construction of the Sta.",
            "Maria Tabungao Church, when a flood came and wiped out all the materials or dutung meaning woods and carried them to Santa Monica Parish Church."
        ],
        [
            "The town is known for its 400-year-old church, the Santa Monica Parish Church, with its unique design that incorporates pre-colonial architectural motif alongside its European Catholic iconography."
        ],
        [
            "Etymology"
        ],
        [
            "Pansomun (grandson of Prince Balagtas, the ruler of the Kapampangan empire and Luzon), in his will, claimed to be a cousin of Rajah Soliman and Lakandula, the chieftains of Manila and Tondo in 1571 (conquest by Spain).",
            "Pansomun, as Christian convert Fernando Malang Balagtas signed in 1589 a will on the Kapampangan territory.",
            "Pansomun/Balagtas stated that he was born in Tabungao (Santa Maria, the old location of Minalin)."
        ],
        [
            "The legend of Minalin's name came from \"minalis la ding dutung, minalis ya ing pisamban\" (the lumber moved, and so must the church).",
            "Lumber stocks at Santa Maria for the church construction were carried by floods to a hilly Burol.",
            "Capitan Diego Tolentino wrote \"minalis\", thus, the name Minalin evolved."
        ],
        [
            "A Malayan settlement of Kahn Bulaun, Prince Balagtas' descendant, also found in the place, beautiful women.",
            "The Spaniards called the sitio, \"mina linda de las mujerers\"  (a mine of beautiful women), which could also be the source of the town's name.",
            "Subsequently, Chinese traders abbreviated the words to \"Minalin\"."
        ],
        [
            "Minalin's name might have originated also from \"minalis\" (\"to move to\").",
            "\"Mina\" means mine, a word written on a rock left at the sitio in 1700 by a Spaniard José Espeleta, and  \"Lin\", the founder's name."
        ],
        [
            "Gobernadorcillo (Mayor) Diego Tolentino wrote Minalin in lieu of Minalis and the Calendario Manual y Guia de Forasteros, 1839 to 1841, spelled Minalin, thus Minalin."
        ],
        [
            "In 1860, Minalin was a producer of rice, corn, sugar cane, cacao, indigo (añil) and fruits, including dye, nipa wine, vinegar and mats (petates)."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Minalin is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bulac"
        ],
        [
            "Dawe"
        ],
        [
            "Lourdes"
        ],
        [
            "Maniango"
        ],
        [
            "San Francisco Javier"
        ],
        [
            "San Francisco de Asisi"
        ],
        [
            "San Isidro"
        ],
        [
            "San Nicolas (Poblacion)"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Rosario"
        ],
        [
            "Saplad"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Minalin, Pampanga"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "8(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "15(0.6)"
        ],
        [
            "34(1.3)"
        ],
        [
            "138(5.4)"
        ],
        [
            "203(8.0)"
        ],
        [
            "242(9.5)"
        ],
        [
            "233(9.2)"
        ],
        [
            "201(7.9)"
        ],
        [
            "126(5.0)"
        ],
        [
            "50(2.0)"
        ],
        [
            "21(0.8)"
        ],
        [
            "1,280(50.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.7"
        ],
        [
            "4.1"
        ],
        [
            "6.5"
        ],
        [
            "11.2"
        ],
        [
            "21.2"
        ],
        [
            "24.9"
        ],
        [
            "27.7"
        ],
        [
            "26.5"
        ],
        [
            "25.5"
        ],
        [
            "21.8"
        ],
        [
            "12.6"
        ],
        [
            "5.6"
        ],
        [
            "191.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MinalinYearPop.±% p.a.1903 6,282—    1918 7,219+0.93%1939 9,805+1.47%1948 9,856+0.06%1960 16,223+4.24%1970 21,896+3.04%1975 25,428+3.04%1980 27,414+1.51%YearPop.±% p.a.1990 34,795+2.41%1995 35,670+0.47%2000 35,150−0.31%2007 40,084+1.83%2010 44,001+3.45%2015 47,713+1.55%2020 48,380+0.27%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Minalin, Pampanga, was 48,380 people, with a density of 1,000 inhabitants per square kilometre or 2,600 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Minalin"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  6.40"
        ],
        [
            "2009  9.04"
        ],
        [
            "2012  5.97"
        ],
        [
            "2015  8.83"
        ],
        [
            "2018  6.16"
        ],
        [
            "2021  10.71"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Minalin is one of the fastest growing economy in Pampanga despite its propensity to develop flooding."
        ],
        [
            "Merchandising, farming and fishing are the usual source of living of Minalenos.",
            "The town is known as the \"Egg Basket of Central Luzon\" because of its large scale production of eggs and chickens.",
            "Tilapia, shrimp, crabs are also major products of the town."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Town hall (seat of Government, Pamahalaang Bayan)"
        ],
        [
            "The municipal government is divided into three branches: executive, legislative and judiciary.",
            "The judicial branch is administered solely by the Supreme Court of the Philippines.",
            "The legislative branch is composed of the Sangguniang Bayan (town assembly), Sangguniang Barangay (barangay council), and the Sangguniang Kabataan for the youth sector."
        ],
        [
            "The mayor and vice mayor are elected to three-year terms.",
            "The mayor is the executive head and leads the town's departments in executing the ordinances and improving public services.",
            "The vice mayor heads a legislative council (Sangguniang Bayan) consisting of councilors from the barangays or barrios."
        ],
        [
            "Elected officials"
        ],
        [
            "Municipal Officials (2022–2025):"
        ],
        [
            "Mayor: NOEL PHILIP SIOJO NAGUIT"
        ],
        [
            "Vice Mayor: RONDON MUSNGI MERCADO"
        ],
        [
            "Councilors:"
        ],
        [
            "NAGUIT, SAE"
        ],
        [
            "SUNGA, DANILO"
        ],
        [
            "LAGMAN, RAMBO"
        ],
        [
            "DAAG, QUEROLICO"
        ],
        [
            "FLORES, FRANCISCO JR."
        ],
        [
            "SITCHON, EDGAR"
        ],
        [
            "SUBA, RICO"
        ],
        [
            "SOTTO, JOHN NIKKI"
        ],
        [
            "Landmarks and attractions"
        ],
        [
            "Tourist attractions of the town include its \"Aguman Sandoc\" New Year's Celebration and the 400-year old Santa Monica Parish Church in Barangay San Nicolas."
        ],
        [
            "\"Aguman Sanduk\" Festival (Minalin New Year's Celebration)"
        ],
        [
            "One major tourist attraction in Minalin is its \"Aguman Sanduk\" New Year's Celebration in which the straight men of the town dress as beauty queens and ride through town on festive floats - displaying not only humor but also the camaraderie and charity of each member of the community."
        ],
        [
            "The celebration has also been referred to as the \"Belles of Minalin\" but Minalin natives prefer to continue calling the event \"Aguman Sanduk\", which translates literally as \"Association of the Ladle\".The event is differentiated from gay pride parades because the event is specifically intended for heterosexual males, and is intended simply to be an act of fun, rather than a statement about gender."
        ],
        [
            "This is an avenue where men from all walks of life cross-dress and dare to step out of their statuses.",
            "Whether you are a known public figure, a farmer, or a professional, it is with utmost pride that a man from Minalin will dare step out of his status to give joy (pikatulan) to his people.",
            "With the continuous celebration of the festival, it is a living proof of how Minaleños value camaraderie (pamakiabe).",
            "It is the dare that keeps the community's bond and strengthen the ties of Minaleños."
        ],
        [
            "This annual display of beautiful dresses and expertise in women's make up signifies that this town follows the dynamic changes in women's fashion not only in the Philippines but also in Europe, Asia and in other countries."
        ],
        [
            "Egg Festival"
        ],
        [
            "On June 4, 2008, Minalin celebrated its fame for producing over a million chicken eggs per day by holding the country's first \"First Egg Festival.\"",
            "An exhibit of Minalin's egg produce was put up, and a taste test of 10,000 boiled eggs was held.",
            "Also, 70 poultry raisers donated 100,000 eggs to Typhoon Cosme's victims in the nearby provinces of Pangasinan and Zambales."
        ],
        [
            "Mayor Edgar Flores and President Gloria Macapagal Arroyo graced the exhibit of their egg produce, and a taste test of 10,000 boiled eggs.",
            "Also, 70 poultry raisers donated 80,000 eggs to Pangasinan's \"Cosme\" typhoon victims, and 20,000 shall go to Zambales."
        ],
        [
            "La Purisima Concepcion Festival"
        ],
        [
            "On 2008, the Sta Maria Barangay Youth Ministry of Barangay Sta Maria spearheaded the said festival.",
            "It is in honor of the Image of La Purisima Concepcion which was according to the book, Piaquitan qng Milabas ning Sta Maria, in the year 1609, an image was found placed inside a dried gourd skin (Tabungao in Spanish) floating in front of the chapel they were building."
        ],
        [
            "the chairmen of this Festival are:"
        ],
        [
            "2019- Noelene Pingol and Jaycee Lagman"
        ],
        [
            "2018- Jovaine Ordonez and Kriz Miranda"
        ],
        [
            "2017- Roana Kelly Sese and Jaycee Lagman"
        ],
        [
            "2016- Roana Kelly Sese and Renalyn Guuiriba"
        ],
        [
            "2015- Claud Domme Yambao and Rhysdale Sabado"
        ],
        [
            "2014-2013- Mary Donna Mae Mangsal"
        ],
        [
            "2012- Romel Zapata"
        ],
        [
            "2011- Jerry Canlas"
        ],
        [
            "2010- +Liway Manalansan"
        ],
        [
            "2009- Aizelle Tubig"
        ],
        [
            "2008- Nevil Pineda"
        ],
        [
            "Sunset Park"
        ],
        [
            "A 3,896 sq.m.",
            "Minalin Sunset Park in Santa Rita was inaugurated on July 14, 2018.",
            "It is like an esplanade or boardwalk built along  ‘Tabun Road’  now Sunset Boulevard, next to a river adjacent to the Minalin Tail Dike."
        ],
        [
            "Notable personalities"
        ],
        [
            "Governor Eddie T. Panlilio, the former governor of Pampanga."
        ],
        [
            "Gallery"
        ],
        [
            "Old Municipal Hall Museum"
        ],
        [
            "Museum-Library of Minalin"
        ],
        [
            "Minalin Poultry & Livestock Cooperative (MIPOLCO)"
        ],
        [
            "Bancas by the bridge serving the residents of the barrios"
        ],
        [
            "Santa Rita Elementary School"
        ],
        [
            "Dr. Emigdio A. Bondoc Memorial Health Center (beside the Town hall)"
        ],
        [
            "Sunset Park"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Minalin |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Orejas, Tonette (2011-07-12).",
            "\"Minalin Mural Awaits Restoration\".",
            "Philippine Daily Inquirer.",
            "Makati City.",
            "Retrieved 2012-02-25."
        ],
        [
            "^ a b c d e Manuel, Mark Anthony (January 4, 2012).",
            "\"'Queen Edgarda' delights Minalin Folk\".",
            "Tempo.",
            "Manila: Manila Bulletin Publishing Corporation.",
            "Archived from the original on January 14, 2012."
        ],
        [
            "^ a b c \"First Egg Festival of Minalin in Pampanga\".",
            "Central Luzon Local Search.",
            "CentralLuzon.com.",
            "2008-07-17.",
            "Retrieved 2012-02-25."
        ],
        [
            "^"
        ],
        [
            "\"Minalin: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 5 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Pampanga\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ gmanews.tv,  Arroyo to grace first-ever egg festival in Pampanga"
        ],
        [
            "^ Arcellaz, Princess (September 20, 2021).",
            "\"40,000 fingerlings dispersed in Minalin waters\".",
            "SunStar."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Minalin."
        ],
        [
            "Minalin Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Minalin"
        ],
        [
            "Bacolor / Santo Tomas"
        ],
        [
            "San Simon"
        ],
        [
            "Guagua"
        ],
        [
            "Minalin"
        ],
        [
            "Apalit"
        ],
        [
            "Sasmuan"
        ],
        [
            "Macabebe"
        ],
        [
            "vte Province of PampangaSan Fernando (capital)  Angeles City (largest city)Municipalities"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Candaba"
        ],
        [
            "Floridablanca"
        ],
        [
            "Guagua"
        ],
        [
            "Lubao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Masantol"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Porac"
        ],
        [
            "San Luis"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Component cities"
        ],
        [
            "Mabalacat"
        ],
        [
            "San Fernando"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Angeles (Administratively independent from the province but grouped under Pampanga by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Minalin&oldid=1220886140\""
        ],
        [
            "Category: Municipalities of PampangaHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Kapampangan-language textArticles containing Filipino-language textAll articles with unsourced statementsArticles with unsourced statements from April 2024Articles with unsourced statements from March 2016Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}