{
    "name": "Mina",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Mina, Iloilo"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°56′N 122°35′E﻿ / ﻿10.93°N 122.58°E﻿ / 10.93; 122.58"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Mina, Iloilo\" – news · newspapers · books · scholar · JSTOR (March 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Western Visayas, PhilippinesMinaMunicipalityMunicipality of Mina"
        ],
        [
            "FlagMap of Iloilo with Mina highlightedOpenStreetMapMinaLocation within the PhilippinesCoordinates: 10°56′N 122°35′E﻿ / ﻿10.93°N 122.58°E﻿ / 10.93; 122.58CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "3rd districtFoundedJuly 1, 1870Barangays22"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRey P. Grabato • Vice MayorBernardino P. Chichirita • RepresentativeLorenz R. Defensor • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Arnel C. MattaAriel V. NovoGermaine D. DableoCelso S. JustadoJuanito D. Grabato Jr.Noel P. EspirituIreneo D. PecinaRose Kareen S. Defensor"
        ],
        [
            " • Electorate15,593 voters (2022)Area • Revenue₱ 106.1 million (2020) • Assets₱ 482.5 million (2020) • Expenditure₱ 79.72 million (2020) • Liabilities₱ 131.1 million (2020)Service provider • ElectricityIloilo 2 Electric Cooperative (ILECO 2)Time zoneUTC+8 (PST)ZIP code5032PSGC063031000IDD : area code +63 (0)33Native languagesKaray-a Hiligaynon Ati TagalogWebsitewww.mina.gov.ph"
        ],
        [
            "Mina, officially the Municipality of Mina (Kinaray-a: Banwa kang Mina; Hiligaynon: Banwa sang Mina, Tagalog: Bayan ng Mina),  is a 5th class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 24,042 people."
        ],
        [
            "History"
        ],
        [
            "Spanish colonization (1521–1898)"
        ],
        [
            "Prior to 1870, Mina was formerly named Barrio Mantugaui under the jurisdiction of Pototan.",
            "On June 20, 1864, a league of influential citizens and inhabitants of this Barrio, officially pleaded to the Quartermaster General of the Visayas to elevate this barrio into a new town independent of its matrix of Pototan to be named “Pueblo de Molto”.",
            "The reasons why there was a petition to elevate said barrio into a pueblo, were due to: (1) great distance between the town and the barrio; (2) during those times, the residents of the said barrio had difficulty travelling to Pototan when they want to hear mass on required days; (3) when some barrio folks fell ill due to some pestilence and eventually died without receiving the Sacrament of Extreme Unction for the good of their souls.",
            "For a predominantly-Catholic inhabitants of this barrio, receiving and getting blessed with the sacraments as taught by the church, were important.",
            "(4) Another case in point was those women who suffered complications and died during childbirth had no chance of receiving the final sacrament, and (5) their infants often died without being baptized.",
            "It was for these reasons, that the leaders sought his approval praying that their request would be granted.",
            "July 30, 1864 - The Parish Priest and the Principales of Pototan endorsed to the Political-Military Government of Iloilo the required sketch and lists of more than a thousand tax payers and sixteen Cabezas de Barangay, informing the need of elevating Barrio Mantugaui into a town.",
            "Likewise to also elevate this petition to the superior knowledge of the Governor General of the Philippines for his royal resolution/decision."
        ],
        [
            "There were so many disputes that had happened in the creation of this town.",
            "Arguments as to the other barrios to be included as part of Molto, as well as the boundaries and the “tributos” taxpayers, have become the major contention.",
            "Barrio Paranginan el Maya was merged to Talarocan now Tolarucan,  to become part of Molto.",
            "A dispute between the Municipalities of Pototan and Janiuay over the jurisdiction of Talarocan resulted to the delay of elevating this barrio into a town.",
            "On January 20, 1868, a decree ordered by then the Gobernador Politico Militar de Visayas, contained an assignment which was delegated to the Captain of the Police Force in this District, Don Evaristo Fernandez, who conducted the survey of the boundaries concerned.",
            "Upon completion of the survey, the recommendation regarding the boundary between Mantugaui and Janiuay was objected by Fr.",
            "Miguel Claro of Janiuay Parish, hence the delay occurred for its approval.",
            "On March 30, 1869, the Bishop of Jaro appointed Don Juan Manzano y Vazques, the lawyer of this Province and was designated to form a committee to establish the official boundaries for the creation of a new town to be named “Pueblo de Molto”.",
            "Together with him in the said committee were the Reverend Parish Priests of Pototan and Janiuay and with the chiefs of the Barrio Mantugaui, they also handled the case filed regarding the objection of the Parish Priest of Janiuay.",
            "Another important task of this committee was to establish the site where the new town of Molto and the barrios which should be part of it should be situated and indicated as well as the land for the public buildings."
        ],
        [
            "On April 5, 1870, the final report of the boundaries for “Pueblo de Molto” was submitted to the Political Military Governor of the District by the said committee.",
            "On July 1, 1870, a Superior Decree issued by the Superior Government of General Carlos Ma.",
            "De la Torre to establish the demarcation and markings of the new town and named it into “Pueblo de Mina” instead of “Pueblo de Molto”.",
            "No parish priest yet was assigned at that time because some of the requirements imposed for the creation of a new parish like the construction of the Church, Parish House for the priest, Convent School, Court, Municipio, were not fully complied yet.",
            "On July 30, 1873, when all these terms and conditions were accomplished, a decree was issued making the new town of Mina as a full- fledged parish as approved by the Government of the Republic.",
            "The parish, which was created through the Bishop of Jaro appointed an Augustinian Priest, Father Tiburcio Casbresana, a Spaniard, to become the first parish priest in the new town of Mina.",
            "The Parish of Mina was given an official title of “Nuestra Sra.",
            "Del Pilar” or “Our Lady of the Pillar”."
        ],
        [
            "American colonization (1898–1946)3"
        ],
        [
            "The Americans changed the structure of government in the Philippines at the start of the occupation.",
            "On 4 April 1903, the 50 towns in the Province of Iloilo were reduced to 17 with the passage of Act No.",
            "719.",
            "The town of Dingle and Mina, together with other neighboring barrios, were placed under the jurisdiction of Pototan.",
            "Mina became an “arrabal” of Pototan, then considered as the biggest “arrabal” because it had a parish of its own.",
            "But the townsfolk of Mina continued to celebrate the feast day of Our Lady of the Pillar."
        ],
        [
            "World War II and after"
        ],
        [
            "During World War II, the presence of the Japanese occupation was also felt within Mina, hence, for three years, the Chapel in Barangay Abat, Mina, became the location of the parish of Mina, where the feast day of Our Lady of the Pillar on October 12, was celebrated with a mass each year.",
            "Immediately after liberation, the Parish went back to its original location in the town plaza."
        ],
        [
            "In 1947, the Parish Priest, having observed that the economic life of the people in the parish was pitifully difficult, transferred the celebration of the religious fiesta on December 30 from October 12.",
            "The purpose of the change was to afford the parishioners the chance to have a decent and festive celebration.",
            "For two years, the religious activities and festivities were celebrated on December 30 after which the feast day was moved back to its original date, simultaneously with the celebration of Spain where the feast of the Lady of the Pillar was originated.",
            "Thus, since then, the town of Mina celebrates the religious festival every 12 October annually."
        ],
        [
            "A group of local leaders residing in Mina made a petition to separate Mina as an independent town from Pototan.",
            "On October 1, 1964, then President Diosdado Macapagal signed Executive Order No.",
            "106 creating the Municipality of Mina.",
            "Mina's status as a municipality became controversial.",
            "A complaint filed by then Senator Emmanuel Pelaez reached the Supreme Court.",
            "It had to do with the official acts of President Diosdado Macapagal issuing Executive Order for the creation of the Municipality of Mina, which Pelaez found to be unconstitutional.",
            "The creation of a Municipality should be through a Bill passed in Congress.",
            "The legality of President Macapagal's issuance of Executive Order No.",
            "106 was questioned.",
            "In the end, the Supreme Court ruled in favor of Pelaez and ordered Mina to revert to its status as a suburb of Pototan.",
            "Its existence as an again independent Municipality was short-lived, only 14 months, from 1 January 1965 to 18 February 1966.",
            "It was then Congressman Ricardo Y. Ladrido of the Fourth District of Iloilo, who authored and sponsored House Bill No.",
            "16661 creating the Municipality of Mina in 1968.",
            "On 9 September 1968, R.A. No.",
            "5442 was passed, declaring Mina as a municipality of Iloilo."
        ],
        [
            "On November 11, 1969, a special election for the newly created town was held simultaneously with the general (presidential) election.",
            "Arthur D. Defensor, a 25-year old lawyer, was the first elected Municipal Mayor."
        ],
        [
            "Geography"
        ],
        [
            "Mina is located in the central part of the province.",
            "It is 38 kilometres (24 mi) from Iloilo City."
        ],
        [
            "Mina has a total land area of 4,340 hectares and composed of 22 barangays.",
            "Being predominantly agriculture, 97% of its land area is classified as rural."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Mina, Iloilo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "48(1.9)"
        ],
        [
            "41(1.6)"
        ],
        [
            "58(2.3)"
        ],
        [
            "82(3.2)"
        ],
        [
            "223(8.8)"
        ],
        [
            "300(11.8)"
        ],
        [
            "346(13.6)"
        ],
        [
            "307(12.1)"
        ],
        [
            "311(12.2)"
        ],
        [
            "292(11.5)"
        ],
        [
            "167(6.6)"
        ],
        [
            "81(3.2)"
        ],
        [
            "2,256(88.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "7.7"
        ],
        [
            "11.3"
        ],
        [
            "15.4"
        ],
        [
            "25.7"
        ],
        [
            "28.5"
        ],
        [
            "29.5"
        ],
        [
            "28.7"
        ],
        [
            "28.3"
        ],
        [
            "28.7"
        ],
        [
            "21.8"
        ],
        [
            "15.2"
        ],
        [
            "252.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Mina is politically subdivided into 22 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Abat"
        ],
        [
            "Agmanaphao"
        ],
        [
            "Amiroy"
        ],
        [
            "Badiangan"
        ],
        [
            "Bangac"
        ],
        [
            "Cabalabaguan"
        ],
        [
            "Capul-an"
        ],
        [
            "Dala"
        ],
        [
            "Guibuangan"
        ],
        [
            "Janipa-an West"
        ],
        [
            "Janipa-an East"
        ],
        [
            "Mina East (Poblacion)"
        ],
        [
            "Mina West (Poblacion)"
        ],
        [
            "Nasirum"
        ],
        [
            "Naumuan"
        ],
        [
            "Singay"
        ],
        [
            "Talibong Grande"
        ],
        [
            "Talibong Pequeño"
        ],
        [
            "Tipolo"
        ],
        [
            "Tolarucan"
        ],
        [
            "Tumay"
        ],
        [
            "Yugot"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MinaYearPop.±% p.a.1903 4,280—    1970 9,649+1.22%1975 11,641+3.84%1980 12,290+1.09%1990 15,808+2.55%1995 16,419+0.71%2000 18,096+2.11%2007 19,809+1.26%2010 21,785+3.52%2015 23,546+1.49%2020 24,042+0.41%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Mina, Iloilo, was 24,042 people, with a density of 550 inhabitants per square kilometre or 1,400 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Mina"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  21.20"
        ],
        [
            "2009  15.54"
        ],
        [
            "2012  24.30"
        ],
        [
            "2015  22.05"
        ],
        [
            "2018  16.07"
        ],
        [
            "2021  16.70"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Major source of income of the residents is rice farming.",
            "Some are engaged in livelihood projects such as hog raising/fattening, poultry and small business enterprises."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Mina |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Compiled and written by Lydia E. Grabato, gathering of official documents facilitated by Dory P. Emelo (2011–2017).",
            "Researched by the staffs from the original manuscripts of (NAP) National Achieve of the Philippines, (NHC) National Historical Commission (NL), National Library – Philippines.",
            "Further reference from the archive of Archdiocese of Jaro, Iloilo, Libraries of the University of San Agustin and University of the Philippines both in Iloilo City."
        ],
        [
            "^"
        ],
        [
            "\"Mina: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 3 May 2020."
        ],
        [
            "^"
        ],
        [
            "\"Province: Iloilo\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Official website"
        ],
        [
            "Places adjacent to Mina, Iloilo"
        ],
        [
            "Badiangan"
        ],
        [
            "Pototan"
        ],
        [
            "Janiuay"
        ],
        [
            "Mina"
        ],
        [
            "Pototan"
        ],
        [
            "Cabatuan"
        ],
        [
            "New Lucena"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Mina,_Iloilo&oldid=1230369473\""
        ],
        [
            "Categories: Municipalities of IloiloPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from March 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Kinaray-a-language textArticles containing Hiligaynon-language textArticles containing Tagalog-language textOfficial website different in Wikidata and WikipediaPages using the Kartographer extension"
        ]
    ]
}