{
    "name": "Moalboal",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Moalboal"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°57′N 123°24′E﻿ / ﻿9.95°N 123.4°E﻿ / 9.95; 123.4"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cebu, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Moalboal\" – news · newspapers · books · scholar · JSTOR (April 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Visayas, PhilippinesMoalboalMunicipalityMunicipality of MoalboalPoblacion (town centre)"
        ],
        [
            "FlagSealNickname: Dagway sa ParaisoAnthem: Moalboal HymnMap of Cebu with Moalboal highlightedOpenStreetMapMoalboalLocation within the PhilippinesCoordinates: 9°57′N 123°24′E﻿ / ﻿9.95°N 123.4°E﻿ / 9.95; 123.4CountryPhilippinesRegionCentral VisayasProvinceCebuDistrict"
        ],
        [
            "7th districtFounded6 February 1852Barangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorInocentes G. Cabaron • Vice MayorPaz A. Rozgoni • RepresentativePeter John D. Calderon • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jinky C. HanikaVirgilio A. DomughoSusan G. BillonesZerg C. TabañagMarcelino D. DeniegaCesar B. MahinayRichard P. DomughoAlfonso F. Sabac Jr."
        ],
        [
            " • Electorate23,585 voters (2022)Area • Revenue₱ 188.5 million (2020) • Assets₱ 403.3 million (2020) • Expenditure₱ 153.5 million (2020) • Liabilities₱ 136.3 million (2020)Service provider • ElectricityCebu 1 Electric Cooperative (CEBECO 1)Time zoneUTC+8 (PST)ZIP code6032PSGC072233000IDD : area code +63 (0)32Native languagesCebuano TagalogWebsitewww.moalboal.gov.ph"
        ],
        [
            "Moalboal ("
        ],
        [
            "Moalboal is one of the eight municipalities comprising the 7th Congressional District Cebu Province.",
            "It is 105 kilometres (65 mi) south from Cebu City."
        ],
        [
            "Pescador Island, a popular tourist attraction, is part of the municipality and is one of the best known diving sites in the Philippines."
        ],
        [
            "Etymology"
        ],
        [
            "There are two versions of etymology that was proposed about the origins of the town's name, both based on phonetic distortions, are ascribed as the origin of the place named “Moalboal,” The first version is an onomatopeic derivation from the bubbling sound called as \"bocalbocal\" (bukál-bukál) in Cebuano, emitted by the waters of a spring located within the town proper.",
            "The second is a less popular version attributes to the belief that most of the town’s first settlers are from the island of Bohol, known as Boholanos or Bol-anons.",
            "In either version, it is believed by many residents that bocalbocal or Bol-anon eventually was transformed into “Moalboal”."
        ],
        [
            "Perhaps, the real clue to the etymology of Moalboal is its old orthography.",
            "Redondo’s  \"Breve Reseña de la Diocesis de Cebu en las Islas Filipinas\" spells the name of the town as “Mualbual”.",
            "The same spelling is reflected on a page from Sale’s \"Ang Sugbo sa Karaang Panahon\" showing a map of the Cebu Province."
        ],
        [
            "History"
        ],
        [
            "Spanish Colonial Period"
        ],
        [
            "During the pre-colonial to early colonial period in the Philippines.",
            "There is a legend said that Laurente Sabanal who is popularly known as \"Laguno\" (also spelled as Llaguno) was the founder and the first ruler of Moalboal.",
            "It was said that he was a Bol-anon which roots originated from Bohol, where he killed a guardia civil that abused him.",
            "He then escaped and eventually discovered the town.",
            "People believed that he possessed supernatural abilities where he was gifted with an oración also known in Cebuano as yamyam which make objects float in the air whenever he could.",
            "Due to the frequent Moro attacks, he would use this ability to scare the Moro raiders and make them return to their vintas."
        ],
        [
            "When Laguno died, his body was buried in the sandy shore where he made his defense against invaders.",
            "On his grave was placed a log, that serves as a symbol of the uttermost respect for his heroism, bravery and exemplary life.",
            "A street along the shore where he was buried was named after him which is the \"Laguno Street\"."
        ],
        [
            "Moalboal as a Parish"
        ],
        [
            "San Juan Nepumoceno Parish Church"
        ],
        [
            "During the Spanish era, the church and state were unified, which meant that the formation of a parish required the combined authority of both the Bishop and the Provincial Governor.",
            "This authority was governed by the Royal Order of July 31, 1874, which became effective in the Philippines from June 2, 1886, and was later revised by the Royal Decree of July 10, 1894.",
            "As a result of this arrangement, parishes in Cebu, including the town of Moalboal, were established by local religious authorities."
        ],
        [
            "Sometime in the year 1851, the Spanish Governor passed a decree approving the petition which was the erection of Moalboal as a parish.",
            "By the following year, January 20, 1852, the corresponding decree from the Bishop was received.",
            "And on February 6, 1852, San Juan Nepomuceno Parish, Moalboal, Cebu was officially established."
        ],
        [
            "American Occupation"
        ],
        [
            "The Americans then replaced the Spaniards as colonizers of the Philippines in 1899.",
            "And in 1917, the town was then declared to be an independent municipality separated from Alcantara (which was a former barrio of Moalboal).",
            "The first to be appointed as municipal president was Melecio Lambo.",
            "Some of the notable families in Moalboal include the Gadors, Gakos, Cabarons, and Babieras, who believed to be migrants from Bohol.",
            "The Gadors were a ruling class family in pre-Hispanic times and one of the most prominent families in pre-American Moalboal."
        ],
        [
            "Second World War"
        ],
        [
            "During the Japanese occupation and the Battle of Visayas, the war also took place all over the province of Cebu where Filipino guerillas fought the Japanese forces as a campaign for liberation of the Philippines during World War II.",
            "Moalboal is one of the notable places in Cebu where the Japanese soldiers surrendered, which is then the historic \"Battle of Tomonoy\" took event at exactly August 13, 1944.",
            "Japanese Combatant Units travelled to southern Cebu and eventually reaching Moalboal in which they ransacked and pillaged houses.",
            "With the command of Lt. Epic Faunillan along with Guerilla units of Southern Cebu Sector station, they immediately reported to the Tomonoy-Balabagon area."
        ],
        [
            "No old ancestral houses can be found in Moalboal due to the town being burned to the ground by the Japanese in retaliation for the successful ambush of their troops.",
            "The only remaining 18th century architecture was the original San Juan Nepumoceno Parish Church.",
            "With only the belfry tower and exterior walls of the façade stood still in the present day as it was abandoned in 2005 due to the structure's deterioration.",
            "A marker site was put up by the municipal government along the Tomonoy Valley to commemorate the events of war."
        ],
        [
            "Geography"
        ],
        [
            "Moalboal is a peninsula situated on the south-western coast of Cebu Island, bordered to the west by the Tañon Strait;  Negros Island is visible from its shore."
        ],
        [
            "Moalboal is bordered to the north by the town of Alcantara, to the west is the Tañon Strait, to the east is the town of Argao, and to the south is the town of Badian."
        ],
        [
            "The municipality has a land area of 124.86 square kilometers or 48.21 square miles which constitutes 2.53% of the total area of the Cebu province."
        ],
        [
            "Barangays"
        ],
        [
            "Map showing Barangays of Moalboal"
        ],
        [
            "Moalboal is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 072233001   Agbalanga"
        ],
        [
            " 2.5%"
        ],
        [
            " 940"
        ],
        [
            " 916"
        ],
        [
            "  ▴"
        ],
        [
            " 0.26%"
        ],
        [
            " 072233002   Bala"
        ],
        [
            " 1.9%"
        ],
        [
            " 700"
        ],
        [
            " 697"
        ],
        [
            "  ▴"
        ],
        [
            " 0.04%"
        ],
        [
            " 072233003   Balabagon"
        ],
        [
            " 4.9%"
        ],
        [
            " 1,825"
        ],
        [
            " 1,572"
        ],
        [
            "  ▴"
        ],
        [
            " 1.50%"
        ],
        [
            " 072233004   Basdiot"
        ],
        [
            " 16.1%"
        ],
        [
            " 5,949"
        ],
        [
            " 5,291"
        ],
        [
            "  ▴"
        ],
        [
            " 1.18%"
        ],
        [
            " 072233005   Batadbatad"
        ],
        [
            " 3.6%"
        ],
        [
            " 1,318"
        ],
        [
            " 1,248"
        ],
        [
            "  ▴"
        ],
        [
            " 0.55%"
        ],
        [
            " 072233006   Bugho"
        ],
        [
            " 4.9%"
        ],
        [
            " 1,824"
        ],
        [
            " 1,430"
        ],
        [
            "  ▴"
        ],
        [
            " 2.46%"
        ],
        [
            " 072233007   Buguil"
        ],
        [
            " 2.0%"
        ],
        [
            " 756"
        ],
        [
            " 710"
        ],
        [
            "  ▴"
        ],
        [
            " 0.63%"
        ],
        [
            " 072233016   Busay"
        ],
        [
            " 3.5%"
        ],
        [
            " 1,309"
        ],
        [
            " 1,167"
        ],
        [
            "  ▴"
        ],
        [
            " 1.15%"
        ],
        [
            " 072233008   Lanao"
        ],
        [
            " 3.9%"
        ],
        [
            " 1,424"
        ],
        [
            " 1,352"
        ],
        [
            "  ▴"
        ],
        [
            " 0.52%"
        ],
        [
            " 072233010  Poblacion East"
        ],
        [
            " 6.8%"
        ],
        [
            " 2,521"
        ],
        [
            " 2,223"
        ],
        [
            "  ▴"
        ],
        [
            " 1.27%"
        ],
        [
            " 072233011   Poblacion West"
        ],
        [
            " 8.8%"
        ],
        [
            " 3,240"
        ],
        [
            " 2,742"
        ],
        [
            "  ▴"
        ],
        [
            " 1.68%"
        ],
        [
            " 072233012   Saavedra"
        ],
        [
            " 7.8%"
        ],
        [
            " 2,881"
        ],
        [
            " 2,618"
        ],
        [
            "  ▴"
        ],
        [
            " 0.96%"
        ],
        [
            " 072233013   Tomonoy"
        ],
        [
            " 5.5%"
        ],
        [
            " 2,018"
        ],
        [
            " 1,874"
        ],
        [
            "  ▴"
        ],
        [
            " 0.74%"
        ],
        [
            " 072233014   Tuble"
        ],
        [
            " 5.4%"
        ],
        [
            " 2,012"
        ],
        [
            " 1,591"
        ],
        [
            "  ▴"
        ],
        [
            " 2.38%"
        ],
        [
            " 072233015   Tunga"
        ],
        [
            " 6.5%"
        ],
        [
            " 2,413"
        ],
        [
            " 2,245"
        ],
        [
            "  ▴"
        ],
        [
            " 0.72%"
        ],
        [
            "Total"
        ],
        [
            "36,930"
        ],
        [
            "27,676"
        ],
        [
            " ▴"
        ],
        [
            "2.93%"
        ],
        [
            "Barangay Basdiot, Balabagon, Poblacion East, Poblacion West, Tomonoy, Tuble, Tunga and Saavedra are geographically classified as coastal with four of them situated in the peninsula.",
            "While Barangay Agbalanga, Bala, Batadbatad, Buguil, Bugho, Busay and Lanao are landlocked with most of them being hilly and mountainous."
        ],
        [
            "Busay is the largest barangay in terms of land area."
        ],
        [
            "Poblacion East and Poblacion West are the downtown/urban barangays that serves as a  commercial hub, and Basdiot being the most populous barangay in Moalboal is also considered urban to some extent as it is the busiest area of the town."
        ],
        [
            "Climate"
        ],
        [
            "The climate in Moalboal experiences a significant amount of rainfall, even during the month with historically low precipitation levels.",
            "Köppen and Geiger classify this climate as Af (Tropical monsoon)."
        ],
        [
            "Climate data for Moalboal, Cebu"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "42(1.7)"
        ],
        [
            "34(1.3)"
        ],
        [
            "40(1.6)"
        ],
        [
            "61(2.4)"
        ],
        [
            "124(4.9)"
        ],
        [
            "188(7.4)"
        ],
        [
            "190(7.5)"
        ],
        [
            "191(7.5)"
        ],
        [
            "189(7.4)"
        ],
        [
            "186(7.3)"
        ],
        [
            "124(4.9)"
        ],
        [
            "73(2.9)"
        ],
        [
            "1,442(56.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.0"
        ],
        [
            "8.5"
        ],
        [
            "9.5"
        ],
        [
            "12.8"
        ],
        [
            "22.3"
        ],
        [
            "26.8"
        ],
        [
            "28.4"
        ],
        [
            "27.9"
        ],
        [
            "27.3"
        ],
        [
            "27.6"
        ],
        [
            "20.5"
        ],
        [
            "13.1"
        ],
        [
            "234.7"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Moalboal Heritage Park"
        ],
        [
            "Population census of MoalboalYearPop.±% p.a.1903 11,743—    1918 14,897+1.60%1939 14,868−0.01%1948 15,019+0.11%1960 13,745−0.74%1970 15,679+1.32%1975 16,182+0.64%1980 16,420+0.29%1990 20,041+2.01%1995 22,021+1.78%2000 23,402+1.31%2007 27,398+2.20%2010 27,676+0.37%2015 31,130+2.27%2020 36,930+3.42%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Moalboal was 36,930 people, with a density of 296 inhabitants per square kilometre or 766 inhabitants per square mile."
        ],
        [
            "Though the majority of the people in Moalboal are Cebuanos, a few members of cultural minorities have found their way there.",
            "Bajaus who are similar to Muslim nomads, are often seen in the streets, especially during the holiday season, as some of them make their living by begging.",
            "There is no evidence though that the badjaos have taken up permanent residence in the town."
        ],
        [
            "Due to the tourism boom that the town has experienced in the 2000s and 2010s, a small contingent of expatriates have also started to settle in Moalboal.",
            "Europeans and Americans are the most prominent expatriates in the town, but recently, expatriates from East Asian countries have also started to settle in the area."
        ],
        [
            "Language"
        ],
        [
            "Most of Moalboalanons (people living in Moalboal) mainly speak Cebuano which is the most spoken language throughout Visayas and Mindanao.",
            "Filipino (the standardized version of Tagalog) and English are taught in schools and both are used as medium of instruction in all levels.",
            "It is also necessary to speak either languages especially on locals, for the sake of communicating with foreign and domestic tourists."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Moalboal"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  45.00"
        ],
        [
            "2009  48.92"
        ],
        [
            "2012  27.87"
        ],
        [
            "2015  26.58"
        ],
        [
            "2018  16.90"
        ],
        [
            "2021  33.46"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Moalboal is a peninsula and therefore it is almost entirely surrounded by water.",
            "The majority of the people who live in the flat lands engage in fishing as their main mode of livelihood.",
            "Those who live in the mountain regions like Agbalanga, Bala, Batadbatad, Buguil and Busay live through farming."
        ],
        [
            "Tourism Infrastructure and Enterprise Zone Authority (TIEZA) eyes Moalboal as one of the major tourism investment destinations in the province of Cebu."
        ],
        [
            "The downtown area serves as a commercial center, with some residents from the neighboring towns of southwestern Cebu flock to Moalboal due to numerous business establishments spawning throughout the town."
        ],
        [
            "There are two operating shopping malls in the municipality namely the Gaisano Grand Mall Moalboal and Gaisano Town Center Moalboal, both located in Poblacion East.",
            "Poblacion West on the other hand serves as an education and government center of the town."
        ],
        [
            "The tourist flocked areas of Moalboal such as Basdiot, Tuble and Saavedra have several other business establishments such as hotels, resorts, lodging houses, pension houses, spa, bars, internationally-inspired restaurants and diving schools."
        ],
        [
            "Transportation"
        ],
        [
            "Bus stop going to Cebu City located at the downtown area"
        ],
        [
            "The common mode of transportation is by bicycles with side cars, known locally as pedicabs or tricycles with side cars, called trisikads.",
            "There are motorcycles also known as habal-habal, and the fare may vary depending on distance."
        ],
        [
            "Several buses and vans-for-hire travel to or from Moalboal at 30-minute intervals.",
            "The ride from Cebu South Bus Terminal in Cebu City is three to four hours depending on traffic."
        ],
        [
            "Bus the is mostly the preferred transportation for traveling to or from Moalboal."
        ],
        [
            "Tourism"
        ],
        [
            "Panagsama Beach"
        ],
        [
            "Since the 1970s, Moalboal has developed a tourism industry based on recreational diving and beaches.",
            "Panagsama Beach (Basdiot) is where most resorts and restaurants are established, while further north on the peninsula, in Saavedra, is White Beach (Basdako), a two-kilometre (1.2 mi) beach.",
            "This beach used to be mostly frequented by locals, but has since developed an international tourist trade.",
            "In Moalboal, most tourists stay at either Panagsama Beach (Basdiot) or White Beach (Basdako), both located 3–5 kilometres (1.9–3.1 mi) away from the main bus stop in Moalboal."
        ],
        [
            "Coral reef"
        ],
        [
            "Recreational diving is the main tourist activity in Moalboal, and reefs along the west coast of the Copton peninsula are home to a great variety of marine life.",
            "Pescador Island, about 3 kilometres (1.9 mi) off the coast, is the most popular dive spot with an underwater cave known as \"the Cathedral\".",
            "Indeed a breath-taking view of the underwater world as some of the country’s best diving sites in Moalboal as the terrain of the reef follows the entire coast line, making the place ideal for scuba-diving, snorkeling and freediving, with a drop-off close to shore descending to more than 40 metres (130 ft).",
            "The area is also known to be a home for sea turtles, as well as a vast school of sardines.",
            "Whale sharks, dolphins and thresher sharks are also seen."
        ],
        [
            "Aerial view of Pescador Island"
        ],
        [
            "Further information: Pescador Island"
        ],
        [
            "Other attractions of Moalboal include:"
        ],
        [
            "Airplane Wreck (dive site) - Located in Saavedra, the airplane is approximately 7m down the slope at the wall’s edge at 20m depth.",
            "The airplane was put there as a dive attraction in 1993."
        ],
        [
            "Batadbatad Falls - Locally known as Taginis falls, a hidden and less popular waterfalls is located in barangay Batadbatad."
        ],
        [
            "Budlot Spring - A freshwater spring is located in barangay Bala."
        ],
        [
            "Busay Cave - A spring inside a cave that serves as a potable water throughout the whole town."
        ],
        [
            "Magpayong Rocks - Also known as \"Mushroom rocks\", is a rock formation located at the northernmost seashore of Basdaku/White Beach in Saavedra.",
            "It is called Magpayong because each rock resembles an umbrella."
        ],
        [
            "Moalboal Heritage Park - Also known as \"Seaside Park\".",
            "It is located at the back of the municipal hall and sports complex.",
            "A picturesque attraction with lush green spaces and extensive murals of marine life ideal for strolling and sunset viewing."
        ],
        [
            "Orchid Gallery - A scenic garden of orchids and different types of flowers with a swimming pool."
        ],
        [
            "Rizal Monument - A Dr. José Rizal statue located along the highway of Moalboal"
        ],
        [
            "Talisay Wall (dive site) - Located at the southern part of Panagsama Beach in Basdiot.",
            "The shallow reef top is covered with hard corals.",
            "Talisay wall is full of black coral, sea fans, sponges and various sea creatures."
        ],
        [
            "Tongo Point (dive site) - Also known as Tongo Marine Sanctuary, it is a well protected area of Moalboal.",
            "The reef is covered with hard and soft corals, dramatic drop off, and a great variety of marine life."
        ],
        [
            "Tomonoy Valley (rice field) - A vast rice field located along the highway of barangay Tomonoy"
        ],
        [
            "Tulay (Wharf) - Located near the Seaside Park and Wet Market.",
            "With fruit stands and multi-purpose buildings getting constructed, the wharf is frequented by locals especially during holidays to enjoy swimming.",
            "It also serves as a base point for island-hopping to the Pescador Island."
        ],
        [
            "Tuble Marine Sanctuary (dive site) - One of the protected areas of Moalboal located in barangay Tuble.",
            "The reef also offers stunning coral formations and marine life."
        ],
        [
            "Moalboal has been featured by several Filipino TV show hosts, such as Kuya Kim Atienza of Matanglawin, Drew Arellano of Biyahe ni Drew, Slater Young, and Kryz Uy.",
            "Pol-kun, self-made renowned local Anime artists of Cebu which is one of the supporters for Moalboal too."
        ],
        [
            "Moalboal also serves as a base for other activities, such as canyoneering in Badian and the Kawasan Falls, 20 kilometres (12 mi) away from Moalboal."
        ],
        [
            "Kagasangan Festival"
        ],
        [
            "The annual feast of Moalboal is held on the 15th and 16th of May.",
            "Moalboal is also known for its \"Kagasangan Festival\" (from the Cebuano word Gasang which literally translates to coral).",
            "The festival symbolizes the town's rich marine life in which they perform dances and music with dancers dressed in colorful costumes depicting the sea's flora and fauna.",
            "It is held in honor of St. John of Nepomuk  (San Juan Nepumoceno)."
        ],
        [
            "Education"
        ],
        [
            "The public schools in the town of Moalboal are administered by one school district under the Schools Division of Cebu Province."
        ],
        [
            "Elementary schools:"
        ],
        [
            "Agbalanga Elementary School — Agbalanga"
        ],
        [
            "Bala Elementary School — Bala"
        ],
        [
            "Balabagon Elementary School — Balabagon"
        ],
        [
            "Basdiot Elementary School — Basdiot"
        ],
        [
            "Batadbatad Elementary School  — Batadbatad"
        ],
        [
            "Buguil Elementary School — Buguil"
        ],
        [
            "Busay Elementary School — Busay"
        ],
        [
            "Lanao Elementary School — Lanao"
        ],
        [
            "Moalboal Central Elementary School — Poblacion West"
        ],
        [
            "Omay Elementary School — Sitio Omay, Busay"
        ],
        [
            "Saavedra Elementary School —  Saavedra"
        ],
        [
            "Tomonoy Primary School — Tomonoy"
        ],
        [
            "Tuble Elementary School — Tuble"
        ],
        [
            "Tunga Elementary School — Tunga"
        ],
        [
            "Integrated schools:"
        ],
        [
            "Bugho Integrated School (formerly Bugho Elementary School) — Bugho"
        ],
        [
            "Moalboal Tourism Management Integrated National High School — Balabagon"
        ],
        [
            "Secondary schools:"
        ],
        [
            "Bala National High School — Bala"
        ],
        [
            "Busay National High School — Busay"
        ],
        [
            "Moalboal National High School — Basdiot"
        ],
        [
            "Private schools:"
        ],
        [
            "Moalboal Christian School Inc.— Tunga"
        ],
        [
            "Nuevo School of Technology and Humanities — Tunga"
        ],
        [
            "Our Lady of Mount Carmel Learning Center — Tunga"
        ],
        [
            "San Juan High School of Moalboal, Cebu Inc. — Poblacion West"
        ],
        [
            "College/University:"
        ],
        [
            "Cebu Technological University - Moalboal Campus (formerly Cebu State College of Science and Technology - College of Fisheries) — Poblacion West"
        ],
        [
            "Gallery"
        ],
        [
            "Moalboal Municipal Hall, Laguno Street"
        ],
        [
            "Basdako (White Beach)"
        ],
        [
            "Sunset near Moalboal"
        ],
        [
            "See also"
        ],
        [
            "Municipalities of the Philippines"
        ],
        [
            "Legislative districts of Cebu"
        ],
        [
            "List of islands of Cebu"
        ],
        [
            "List of beaches in the Philippines"
        ],
        [
            "Scuba diving"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Moalboal |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Brief History of Moalboal.",
            "moalboalcebu.gov.ph"
        ],
        [
            "^ \"Brief history of Moalboal\"."
        ],
        [
            "^ \"Brief history of Moalboal\"."
        ],
        [
            "^ \"Pioneer Families of Moalboal, Cebu\".",
            "www.philstar.com.ph.",
            "September 22, 2015.",
            "Retrieved April 16, 2024."
        ],
        [
            "^ \"A notable remembrance\".",
            "cebudailynews.inquirer.net.",
            "December 13, 2015.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ \"Moalboal Weather and temperature by month\".",
            "en.climate-data.org."
        ],
        [
            "^"
        ],
        [
            "\"Moalboal: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 10 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cebu\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Tieza sees Moalboal as major tourism investment destination\".",
            "sunstar.com.ph.",
            "July 13, 2023.",
            "Retrieved November 30, 2023."
        ],
        [
            "^ \"Central Visayas Regional Development Plan 2017-2022\" (PDF).",
            "neda.gov.ph.",
            "February 13, 2017."
        ],
        [
            "^ \"Central Visayas Regional Development Plan 2023-2028\" (PDF).",
            "neda.gov.ph.",
            "August 8, 2023."
        ],
        [
            "^ \"Getting To Moalboal\".",
            "travelingcebu.com."
        ],
        [
            "^ \"Moalboal Cebu\".",
            "cebucitytour.com."
        ],
        [
            "^ Andryskova, Katt.",
            "\"20 Best Dive Sites in the Philippines in 2023\".",
            "divein.com."
        ],
        [
            "^ \"Municipality of Moalboal Tourism Heritage Map\".",
            "February 15, 2019."
        ],
        [
            "^ \"Uncover the Hidden Gem of Moalboal: Budlot Spring\".",
            "sugbo.ph."
        ],
        [
            "^ \"Discover Moalboal's enchanting Busay Spring and Cave, the town's source of potable water\".",
            "sugbo.ph."
        ],
        [
            "^ \"Mushroom Rocks\".",
            "cebuvisayastravel.com."
        ],
        [
            "^ \"Moalboal launches \"Kagasangan Festival\"\".",
            "philstar.com.",
            "May 16, 2009."
        ],
        [
            "^ \"Campus History\".",
            "ctu.edu.ph."
        ],
        [
            "Sources"
        ],
        [
            "SunStar Cebu, Earl Kim H. Padronia (July 13, 2023).",
            "\"Tieza sees Moalboal as major tourism investment destination\".",
            "Cebu: SunStar Publishing.",
            "Retrieved November 30, 2023."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Moalboal."
        ],
        [
            "Wikivoyage has a travel guide for Moalboal."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Sunstar News Travel Guide"
        ],
        [
            "Places adjacent to Moalboal"
        ],
        [
            "Alcantara"
        ],
        [
            "Tañon Strait"
        ],
        [
            "Moalboal"
        ],
        [
            "Argao"
        ],
        [
            "Badian"
        ],
        [
            "vte Province of CebuCebu City (capital and largest city)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Alcoy"
        ],
        [
            "Alegria"
        ],
        [
            "Aloguinsan"
        ],
        [
            "Argao"
        ],
        [
            "Asturias"
        ],
        [
            "Badian"
        ],
        [
            "Balamban"
        ],
        [
            "Bantayan"
        ],
        [
            "Barili"
        ],
        [
            "Boljoon"
        ],
        [
            "Borbon"
        ],
        [
            "Carmen"
        ],
        [
            "Catmon"
        ],
        [
            "Compostela"
        ],
        [
            "Consolacion"
        ],
        [
            "Cordova"
        ],
        [
            "Daanbantayan"
        ],
        [
            "Dalaguete"
        ],
        [
            "Dumanjug"
        ],
        [
            "Ginatilan"
        ],
        [
            "Liloan"
        ],
        [
            "Madridejos"
        ],
        [
            "Malabuyoc"
        ],
        [
            "Medellin"
        ],
        [
            "Minglanilla"
        ],
        [
            "Moalboal"
        ],
        [
            "Oslob"
        ],
        [
            "Pilar"
        ],
        [
            "Pinamungajan"
        ],
        [
            "Poro"
        ],
        [
            "Ronda"
        ],
        [
            "Samboan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Francisco"
        ],
        [
            "San Remigio"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santander"
        ],
        [
            "Sibonga"
        ],
        [
            "Sogod"
        ],
        [
            "Tabogon"
        ],
        [
            "Tabuelan"
        ],
        [
            "Tuburan"
        ],
        [
            "Tudela"
        ],
        [
            "Component cities"
        ],
        [
            "Bogo"
        ],
        [
            "Carcar"
        ],
        [
            "Danao"
        ],
        [
            "Naga"
        ],
        [
            "Talisay"
        ],
        [
            "Toledo"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Cebu City"
        ],
        [
            "Lapu-Lapu"
        ],
        [
            "Mandaue"
        ],
        [
            "(Administratively independent from the province but grouped under Cebu by the Philippine Statistics Authority.",
            "However, qualified voters in Mandaue are allowed to vote in elections for Cebu provincial officials by virtue of Republic Act No.",
            "6641, in accordance with Section 452-c of the Local Government Code of 1991.)"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Moalboal&oldid=1229613551\""
        ],
        [
            "Category: Municipalities of CebuHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Cebuano IPAArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}