{
    "name": "Molave",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Molave, Zamboanga del Sur"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°05′36″N 123°29′06″E﻿ / ﻿8.0933°N 123.485°E﻿ / 8.0933; 123.485"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Zamboanga del Sur, Philippines"
        ],
        [
            "For the tree, see Vitex parviflora."
        ],
        [
            "Municipality in Zamboanga Peninsula, PhilippinesMolaveMunicipalityMunicipality of MolavePortion of Molave's Poblacion"
        ],
        [
            "FlagSealMap of Zamboanga del Sur with Molave highlightedOpenStreetMapMolaveLocation in the PhilippinesCoordinates: 8°05′36″N 123°29′06″E﻿ / ﻿8.0933°N 123.485°E﻿ / 8.0933; 123.485CountryPhilippinesRegionZamboanga PeninsulaProvinceZamboanga del SurDistrict"
        ],
        [
            "1st districtFoundedJune 16, 1948Barangays"
        ],
        [
            "List"
        ],
        [
            "25"
        ],
        [
            "  (see Barangays)"
        ],
        [
            "Government  • TypeSangguniang Bayan • MayorCyril Reo A. Glepa • Vice MayorMonalisa J. Glepa • RepresentativeDivina Grace C. Yu • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Desiderio L. JabelloVictor Jose M. Geromo Jr.Zadrac S. BermejoJonathan S. UyLinda M. SanielRicardo P. GolezJacosalem A. Perong Jr.Illuwil D. Orbita"
        ],
        [
            " • Electorate34,204 voters (2022)Area • Revenue₱ 261.2 million (2020) • Assets₱ 971.6 million (2020) • Expenditure₱ 173.3 million (2020) • Liabilities₱ 202.8 million (2020)Service provider • ElectricityZamboanga del Sur 1 Electric Cooperative (ZAMSURECO 1)Time zoneUTC+8 (PST)ZIP code7023PSGC097319000IDD : area code +63 (0)62Native languagesSubanon Cebuano Chavacano TagalogWebsitemolave.gov.ph"
        ],
        [
            "Molave, officially known as the Municipality of Molave (Cebuano: Lungsod sa Molave; Subanen: Benwa Molave; Chavacano: Municipalidad de Molave; Maranao: Inged a Molave; Tagalog: Bayan ng Molave), is a 1st class municipality in the province of Zamboanga del Sur, Philippines.",
            "In the 2020 census, it had 53,140 people.",
            "It is in the eastern part of the province of Zamboanga del Sur, and has an area of 21,685 hectares (83.73 square miles).",
            "The name \"Molave\" refers to the tree (and its hardwood) that was common in the area.",
            "Its economy is focused on agricultural production, and 1,378.5 hectares (3,406 acres) of fertile land is irrigated and planted with rice.",
            "Corn, coconut, cassava, banana, camote and various vegetables are also grown.",
            "These are marketed to neighboring towns and cities, and reach Cebu.",
            "Due to its strategic location, Molave is becoming the commercial hub of the Salug Valley.",
            "It is the most populous municipality in Zamboanga del Sur, and the third most populous in Region IX."
        ],
        [
            "Molave originated during the 1930s as a small settlement in a marshy jungle, originally known as Salug.",
            "The Subanons were early settlers of the area; the fertile land of the Salug Valley later attracted settlers from throughout the Philippines, making the area ethnically diverse.",
            "On June 16, 1948, the settlement was separated from the municipality of Aurora as a separate municipality and designated the new capital of the province of Zamboanga."
        ],
        [
            "History"
        ],
        [
            "The Subanon people were early inhabitants of the area.",
            "Molave originated during the early 1930s as a small settlement in a marshy jungle which was known originally as Salug.",
            "The fertile soil of the Salug Valley attracted settlers from Luzon, Visayas and Mindanao, making the area's population a diverse mix of Cebuano, Boholano, Ilongo, Tagalog, Ilocano, Leyteño, Misamisnon, Surigaonon, and Muslim and other ethnic groups.",
            "A number of Chinese and Filipino businessmen settled in the region before World War II."
        ],
        [
            "The population influx enabled the settlement's rapid development.",
            "Molave became a municipality with Republic Act No.",
            "286, authored by Representative  Juan S. Alano, on June 16, 1948."
        ],
        [
            "Pelagio Blancia was appointed Molave's first mayor.",
            "Blancia was defeated in the 1951 elections, and Mayor Javier Ariosa moved the seat of government from Camp 7 (present-day Barangay Blancia) to its present site.",
            "was Molave's youngest and longest-serving vice mayor.",
            "Unopposed for two terms as vice-mayor, Glepa was elected mayor in May 2010."
        ],
        [
            "Geography"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(August 2019) (Learn how and when to remove this message)"
        ],
        [
            "Molave is in the northeastern part of the province of Zamboanga del Sur, at the foot of a hill, and is bounded by the Salug River and mountains which protect it from typhoons.",
            "It is bordered by the municipalities of Tambulig in the east, Mahayag in the west, Josefina and Province of Zamboanga del Norte in the north, and Ramon Magsaysay in the south.",
            "Molave is about 38 kilometres (24 mi) from Pagadian, the provincial capital, and 58 kilometres (36 mi) from Ozamiz.",
            "It is 15 metres (49 ft) above sea level."
        ],
        [
            "Topography"
        ],
        [
            "Molave is divided into two topographical areas.",
            "The east and southwest lowlands, which cover 30 percent of its total land area, consist of nine barangays and are generally flat, swampy and marshy.",
            "The upland, which covers 70 percent of Molave's total area, is hilly and mostly deforested.",
            "The terrain is moderately sloping to rolling, with the overall grade varying from 10 percent in the lowlands to 27 percent in the mountains."
        ],
        [
            "The municipality has two types of soil.",
            "The lowlands and part of the upper barangays are composed of San Miguel silt loam, and is well-suited for cultivation.",
            "Adtoyon clay loam is found in the upland areas, and can be used for grazing and a variety of crops such as corn, cassava, and camote."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Molave, Zamboanga del Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "48(1.9)"
        ],
        [
            "44(1.7)"
        ],
        [
            "56(2.2)"
        ],
        [
            "56(2.2)"
        ],
        [
            "112(4.4)"
        ],
        [
            "135(5.3)"
        ],
        [
            "124(4.9)"
        ],
        [
            "124(4.9)"
        ],
        [
            "115(4.5)"
        ],
        [
            "134(5.3)"
        ],
        [
            "90(3.5)"
        ],
        [
            "56(2.2)"
        ],
        [
            "1,094(43)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.0"
        ],
        [
            "11.7"
        ],
        [
            "15.6"
        ],
        [
            "18.1"
        ],
        [
            "25.6"
        ],
        [
            "25.7"
        ],
        [
            "25.2"
        ],
        [
            "24.1"
        ],
        [
            "23.8"
        ],
        [
            "26.1"
        ],
        [
            "22.3"
        ],
        [
            "16.5"
        ],
        [
            "247.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Molave is the fourth type on the PAGASA climatology map, with rainfall evenly distributed throughout the year.",
            "Its average temperature is 29.7 °C (85.5 °F)."
        ],
        [
            "Barangays"
        ],
        [
            "Molave is divided into 25 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Alicia"
        ],
        [
            "Ariosa"
        ],
        [
            "Bagong Argao"
        ],
        [
            "Bagong Gutlang"
        ],
        [
            "Blancia"
        ],
        [
            "Bogo Capalaran"
        ],
        [
            "Culo"
        ],
        [
            "Dalaon"
        ],
        [
            "Dipolo"
        ],
        [
            "Dontulan"
        ],
        [
            "Gonosan"
        ],
        [
            "Lower Dimalinao"
        ],
        [
            "Pablo Bahinting Sr. (Lower Dimorok)"
        ],
        [
            "Mabuhay"
        ],
        [
            "Madasigon (Poblacion)"
        ],
        [
            "Makuguihon (Poblacion)"
        ],
        [
            "Maloloy-on (Poblacion)"
        ],
        [
            "Miligan"
        ],
        [
            "Parasan"
        ],
        [
            "Rizal"
        ],
        [
            "Santo Rosario"
        ],
        [
            "Silangit"
        ],
        [
            "Simata"
        ],
        [
            "Sudlon"
        ],
        [
            "Upper Dimorok"
        ],
        [
            "Demographics"
        ],
        [
            "Population of MolaveYearPop.±% p.a.1960 38,568—    1970 21,579−5.64%1975 22,363+0.72%1980 29,698+5.84%1990 36,556+2.10%1995 40,423+1.90%2000 45,082+2.37%2007 48,215+0.93%2010 48,939+0.54%2015 52,006+1.16%2020 53,140+0.43%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Molave"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  24.00"
        ],
        [
            "2009  26.46"
        ],
        [
            "2012  22.34"
        ],
        [
            "2015  29.30"
        ],
        [
            "2018  18.59"
        ],
        [
            "2021  18.27"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Gross sales of registered companies: ₱1,358,640,795"
        ],
        [
            "Total capitalization of new businesses, 2015: ₱150,000,000"
        ],
        [
            "Growth of capitalization of new businesses, 2014–2015: 286.9 percent"
        ],
        [
            "Molave is the commercial hub of the Salug Valley.",
            "Rice trading, milling and farming are major agricultural industries, others are major non-agricultural industries.",
            "Molave's economy is focused on agricultural production; 91.85 percent of its total land area is devoted to agriculture, and 1,378.5 hectares (3,406 acres) are irrigated and planted with rice.",
            "Corn, coconut, cassava, bananas, camote, and other vegetables are also grown.",
            "They are marketed to neighboring towns and cities as far as Cebu.",
            "Molave has 23 farmer cooperatives (19 of which are registered), with a total membership of 7,566."
        ],
        [
            "Healthcare"
        ],
        [
            "Molave has ten barangay health stations, one maternity clinic, 26 health and nutrition posts, and a municipal health center staffed by one rural-health physician, one dentist, one sanitary inspector, three nurses and 11 midwives.",
            "It has three private hospitals (Lumapas Hospital, Salug Valley Medical Center and Blancia Hospital), five private clinics, ten pharmacies, and two funeral chapels, the oldest being the Valley of Angels Memorial Chapels establish in 1967 by the Arapoc Family and now has their newly renovated state of the art 2 storey memorial chapels with elevator that offers embalming, burial and air con and non aircon chapels  ."
        ],
        [
            "Sports and Recreation"
        ],
        [
            "Sports facilities include a municipal gymnasium, three tennis courts, four basketball courts, three volleyball courts and the Molave Regional Pilot School sports complex.",
            "Molave also has a wide function hall offered by the now newly renovated Courtyard Business Hotel in Rizal Avenue.",
            "A landscaped municipal plaza has a playground.",
            "A driving range is in the barangay of Parasan, 4 kilometres (2.5 mi) from Molave."
        ],
        [
            "Law enforcement"
        ],
        [
            "The Molave Municipal Police station has two commissioned officers and 24 non-commissioned officers.",
            "It has two outposts, in the Dipolo and Sudlon barangays.",
            "Crime has decreased in recent years, and the 10th Infantry Battalion of the 1st Infantry Division (stationed in Barangay Bag-ong Argao) and the 906th Provincial Mobile Group help to maintain order."
        ],
        [
            "Education"
        ],
        [
            "Molave has four private preschools, 23 public and one private elementary school, six primary schools, five secondary schools and four tertiary schools.",
            "The secondary schools are:"
        ],
        [
            "Blancia Carreon College Foundation, Inc. (High School Department)"
        ],
        [
            "Molave Vocational Technical School (MVTS)"
        ],
        [
            "Parasan National High School"
        ],
        [
            "Sacred Heart Diocesan School"
        ],
        [
            "Simata National High School"
        ],
        [
            "The tertiary schools are:"
        ],
        [
            "J.H.",
            "Cerilles State College, Molave Campus"
        ],
        [
            "Our Lady Of Triumph Institute of Technology, Molave"
        ],
        [
            "Western Mindanao State University - External Studies Unit, Molave"
        ],
        [
            "Zamboanga del Sur Maritime Institute of Technology"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Molave |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"An act creating the municipality of Molave in the province of Zamboanga and making said municipality the capital of the province\".",
            "LawPH.com.",
            "Retrieved 2011-04-08."
        ],
        [
            "^ a b \"Republic Act No.",
            "711 - An Act to Create the Provinces of Zamboanga del Norte and Zamboanga del Sur\".",
            "Chan Robles Virtual Law Library.",
            "Retrieved December 29, 2019."
        ],
        [
            "^ a b c \"History\".",
            "Molave.gov.ph.",
            "Retrieved December 29, 2019."
        ],
        [
            "^ Feliciano, Mario (January 2, 1988).",
            "\"Bet gunned down for 'blood debts'\".",
            "Philippine Daily Inquirer.",
            "Zamboanga City: The Philippine Daily Inquirer, Inc. p. 1."
        ],
        [
            "^ \"Elected Officials\".",
            "molave.gov.ph.",
            "Retrieved December 29, 2019."
        ],
        [
            "^"
        ],
        [
            "\"Molave: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 1 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IX (Zamboanga Peninsula)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Zamboanga del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c \"Municipality of Molave\".",
            "Retrieved January 11, 2020."
        ],
        [
            "^ Blancia Carreon College Foundation, Inc. (High School Department)"
        ],
        [
            "^ \"Molave Vocational Technical School\".",
            "Archived from the original on 2013-07-05.",
            "Retrieved 2013-04-27."
        ],
        [
            "External links"
        ],
        [
            "Official website"
        ],
        [
            "Molave Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine census information"
        ],
        [
            "Places adjacent to Molave, Zamboanga del Sur"
        ],
        [
            "Sergio Osmeña Sr., Zamboanga del Norte"
        ],
        [
            "Mahayag"
        ],
        [
            "Molave"
        ],
        [
            "JosefinaTambulig"
        ],
        [
            "Ramon Magsaysay"
        ],
        [
            "vte Province of Zamboanga del SurPagadian (capital)  Zamboanga City (largest city)Municipalities"
        ],
        [
            "Aurora"
        ],
        [
            "Bayog"
        ],
        [
            "Dimataling"
        ],
        [
            "Dinas"
        ],
        [
            "Dumalinao"
        ],
        [
            "Dumingag"
        ],
        [
            "Guipos"
        ],
        [
            "Josefina"
        ],
        [
            "Kumalarang"
        ],
        [
            "Labangan"
        ],
        [
            "Lakewood"
        ],
        [
            "Lapuyan"
        ],
        [
            "Mahayag"
        ],
        [
            "Margosatubig"
        ],
        [
            "Midsalip"
        ],
        [
            "Molave"
        ],
        [
            "Pitogo"
        ],
        [
            "Ramon Magsaysay"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pablo"
        ],
        [
            "Sominot"
        ],
        [
            "Tabina"
        ],
        [
            "Tambulig"
        ],
        [
            "Tigbao"
        ],
        [
            "Tukuran"
        ],
        [
            "Vincenzo A. Sagun"
        ],
        [
            "Component city"
        ],
        [
            "Pagadian"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Zamboanga City (Administratively independent and geographically separate from the province but grouped under Zamboanga del Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Molave,_Zamboanga_del_Sur&oldid=1198922235\""
        ],
        [
            "Category: Municipalities of Zamboanga del SurHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listAll articles with dead external linksArticles with dead external links from February 2018Articles with permanently dead external linksArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textArticles needing additional references from August 2019All articles needing additional referencesAll self-contradictory articlesSelf-contradictory articles from January 2020All articles with failed verificationArticles with failed verification from January 2020Official website different in Wikidata and WikipediaPages using the Kartographer extension"
        ]
    ]
}