{
    "name": "Monkayo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Monkayo"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°49′26″N 126°03′13″E﻿ / ﻿7.8239°N 126.0536°E﻿ / 7.8239; 126.0536"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Davao de Oro, Philippines"
        ],
        [
            "Municipality in Davao Region, PhilippinesMonkayoMunicipalityMunicipality of Monkayo"
        ],
        [
            "FlagSealNickname: Gold Ore Hub of Davao de OroMap of Davao de Oro with Monkayo highlightedOpenStreetMapMonkayoLocation within the PhilippinesCoordinates: 7°49′26″N 126°03′13″E﻿ / ﻿7.8239°N 126.0536°E﻿ / 7.8239; 126.0536CountryPhilippinesRegionDavao RegionProvinceDavao de OroDistrict"
        ],
        [
            "1st districtFoundedSeptember 14, 1954Barangays21"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorManuel E. Zamora • Vice MayorManuel B .",
            "Brillantes jr • RepresentativeMaria Carmen S. Zamora • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jocelyn C. BurgosMarlon H. TumaobKimberly Benazir May R. CodillaJoel D. Basañes IIBrendo T. CenizaRonald T. ManzanoAvelino T. CabagAntonio F. Saavedra Jr."
        ],
        [
            " • Electorate64,668 voters (2022)Area • Revenue₱ 447.6 million (2020) • Assets₱ 979.6 million (2020) • Expenditure₱ 376.5 million (2020) • Liabilities₱ 329.4 million (2020)Service provider • ElectricityDavao del Norte Electric Cooperative (DANECO)Time zoneUTC+8 (PST)ZIP code8805PSGC118207000IDD : area code +63 (0)87Native languagesDavawenyo Cebuano Kalagan Mansaka Tagalog Ata ManoboWebsitemonkayo.gov.ph"
        ],
        [
            "Monkayo, officially the Municipality of Monkayo (Cebuano: Lungsod sa Monkayo; Filipino: Bayan ng Monkayo),  is a 1st class municipality in the province of Davao de Oro, Philippines.",
            "According to the 2020 census, it has a population of 93,937 people, making it the most populous town in the province."
        ],
        [
            "Monkayo is an agricultural town, with vast tracts of land planted to rice and banana.",
            "The municipality is also host to the gold-rich barangay of Mount Diwata, popularly known as \"Diwalwal\" (which in the local dialect means one's tongue is hanging out due to exhaustion), a 1,000-meter high range known for its rich gold ore deposit."
        ],
        [
            "Monkayo's seat of government is located in Barangay Poblacion."
        ],
        [
            "Etymology"
        ],
        [
            "The Municipality of Monkayo is a political unit with a land area that was once and for a long period of time a wilderness in the Northern hinterlands of Davao de Oro.",
            "The name “Monkayo” is derived from a gigantic tree towering on top Tandawan mountains and its northern tip in between and immediately adjacent to the Agusan River.",
            "The tree is called “Mondabon Kayo” (Mondabon Tree).",
            "It was however shortened by the first settlers of the area as “Monkayo”."
        ],
        [
            "In the other related version, it is believed that a certain Fr.",
            "Ladour, the first missionary priest assigned in the area, gave the place the name of Moncayo, a snow-topped mountain dividing the kingdoms of Aragon and Castile, in Spain, probably as an analogy to the high mountains in the area that reminded him of his own place of birth."
        ],
        [
            "History"
        ],
        [
            "Monkayo belonged to the northern hinterland of what is now called Davao de Oro.",
            "It was occupied by Lumad groups such as the Mandaya, Manobo, Mansaka, Manguangan and Dibabawon people who dwelt on primitive life and lived by hunting, fishing and crude method of farming (Kaingin) long before the Spanish conquistadors penetrated deep in Mindanao in the middle part of the 19th century.",
            "These different tribes or groups, each had a bagani as head or chief.",
            "They wore clothing and armed with bladed weapons and bows and arrows, they sang hymns called Tudom and long narrative songs called Owaging they danced and held rituals, feasted and chewed beetle nuts.",
            "Nevertheless, when Spanish missionaries came, these natives changed their lives and attitudes and eventually receptive to Christian teachings and ultimately embraced Christianity.",
            "Today, this municipality still has Mandaya, Dibabawon, Manguangan and Manobo, other tribes have transferred to other places."
        ],
        [
            "Monkayo became a Municipality District in 1917.",
            "The position given to the highest official was District President.",
            "The first one appointed to the position was Adolfo Mongado, the first Mandayan educator who served from 1917 to 1925.",
            "The other prominent leaders who held the same position were : Ignacio Cervantes – 1926–1933; Ildefonso Labrador – 1934–1935; and Pedro Aroma – 1936–1937.",
            "The title of the position was changed to District Mayor in 1938 with the following officials: Jose Ibañez who served from 1938 to 1939, followed by Feliciano Cervantes who held the position from 1940 up to the end of the World War II."
        ],
        [
            "During the Second World War, Monkayo was made an important military outpost.",
            "The 81st Military Division under the command of Col. Kangleon was established in the Poblacion and was named Camp Kalaw."
        ],
        [
            "On September 4, 1954, Monkayo became a separate district and founded as a Municipality by virtue of a Presidential Executive Order No.",
            "65 by then President Ramon Magsaysay of the Republic of the Philippines.",
            "The first mayor was Angelo Ortiz (Sept. 1954–Oct.",
            "1955), who also was responsible for making Monkayo an independent municipality.",
            "Alejandro Peñaranda (Nov. 1955-Dec. 1955) was the shortest reigning mayor for only one month, the next appointed mayor who donated portion of his land which became part of the Municipal Town Site.",
            "He was followed by Severino Lacson (Jan. 1956-Nov. 1964), Jose T. Amacio (Nov. 1964-Mar.",
            "1972), and Anastacio C. Basañes.",
            "After the EDSA Revolution, Mayor Anastacio Basañes was succeeded by Constantino Alcaraz (April 1986 – 1992) as Officer In-Charge by virtue of the Freedom Constitution implemented under President Corazon Aquino.",
            "He was succeeded by Rizal G. Gentugaya, and Avelino T. Cabag (1998 to 2001)."
        ],
        [
            "In September 1983, gold was discovered by a Lumad named Camilo Banad at Mount Diwata in the town's mountainous eastern portion."
        ],
        [
            "On June 28, 2003, Mayor Joel Brillantes was assassinated by lone gunman Aniceto Dejeto Jr. in Davao City.",
            "Dejeto himself would be shot and killed shortly after by three unknown men according to Criminal Investigation and Detection Group Chief Eduardo Matillano."
        ],
        [
            "Geography"
        ],
        [
            "Monkayo is 120 kilometres (75 mi) from Mindanao's regional center of Davao City, and some 30 kilometres (19 mi) from Nabunturan, the provincial center."
        ],
        [
            "Barangays"
        ],
        [
            "Monkayo is politically subdivided into 21 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Awao"
        ],
        [
            "Babag"
        ],
        [
            "Banlag"
        ],
        [
            "Baylo"
        ],
        [
            "Casoon"
        ],
        [
            "Inambatan"
        ],
        [
            "Haguimitan"
        ],
        [
            "Macopa"
        ],
        [
            "Mamunga"
        ],
        [
            "Mount Diwata (Mt.",
            "Diwalwal)"
        ],
        [
            "Naboc"
        ],
        [
            "Olaycon"
        ],
        [
            "Pasian (Santa Filomena)"
        ],
        [
            "Poblacion"
        ],
        [
            "Rizal"
        ],
        [
            "Salvacion"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "Tubo-tubo (New Del Monte)"
        ],
        [
            "Upper Ulip"
        ],
        [
            "Union"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Monkayo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "160(6.3)"
        ],
        [
            "127(5.0)"
        ],
        [
            "96(3.8)"
        ],
        [
            "62(2.4)"
        ],
        [
            "141(5.6)"
        ],
        [
            "197(7.8)"
        ],
        [
            "185(7.3)"
        ],
        [
            "186(7.3)"
        ],
        [
            "183(7.2)"
        ],
        [
            "181(7.1)"
        ],
        [
            "128(5.0)"
        ],
        [
            "111(4.4)"
        ],
        [
            "1,757(69.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "20.0"
        ],
        [
            "17.2"
        ],
        [
            "15.9"
        ],
        [
            "13.9"
        ],
        [
            "23.8"
        ],
        [
            "27.2"
        ],
        [
            "28.1"
        ],
        [
            "28.2"
        ],
        [
            "27.0"
        ],
        [
            "27.0"
        ],
        [
            "21.3"
        ],
        [
            "18.7"
        ],
        [
            "268.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MonkayoYearPop.±% p.a.1918 4,898—    1939 2,741−2.73%1960 16,062+8.78%1970 24,597+4.35%1975 34,120+6.78%1980 37,571+1.94%1990 58,239+4.48%1995 66,550+2.53%2000 85,830+5.61%2007 90,971+0.81%2010 94,827+1.52%2015 94,908+0.02%2020 93,937−0.20%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Monkayo was 93,937 people, with a density of 150 inhabitants per square kilometre or 390 inhabitants per square mile."
        ],
        [
            "It is the most populous among the municipalities of Compostela Valley."
        ],
        [
            "Ethnic groups:"
        ],
        [
            "Mandayas"
        ],
        [
            "Dibabawons"
        ],
        [
            "Mansakas"
        ],
        [
            "Manobos"
        ],
        [
            "Religion"
        ],
        [
            "The largest group is the Roman Catholic having 65% of the population, other Christian group comprises (Evangelicals, Born Again, Kingdom of Jesus Christ) comprises 10%, the Iglesia ni Cristo comprises 10% and the remaining 15% belong to the other non-Christian groups."
        ],
        [
            "Roman Catholic: 65%"
        ],
        [
            "Islam: 12.5%"
        ],
        [
            "Iglesia ni Cristo 10%"
        ],
        [
            "Other Christian Groups: 10%"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Monkayo"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  25.70"
        ],
        [
            "2009  32.92"
        ],
        [
            "2012  25.92"
        ],
        [
            "2015  30.81"
        ],
        [
            "2018  28.04"
        ],
        [
            "2021  23.31"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Kumbilan Cave(Casoon)"
        ],
        [
            "Kumbilan Cave has tunnel-like features and wide chambers laden with stalactites, stalagmites and other formations.",
            "Fauna observed within the cave are snakes and fruit flies.",
            "The cave is home to the \"kabyaw\" fruit bats."
        ],
        [
            "Mt.",
            "Diwalwal"
        ],
        [
            "A barangay of 18,000 people, mostly migrants from Surigao, Agusan and Cebu - all dependent on gold.",
            "Small-scale mining has been their major industry since the gold-rush in the area in the 1980s.",
            "Diwalwal is a relatively quiet town but recently caught the headlines when an estimated 25 miners died on October 25 inside a tunnel allegedly due to toxic gas suffocation."
        ],
        [
            "Seven Waterfalls of Awao"
        ],
        [
            "The gushing water coming from above are not that high in volume but cold but not chilling; it is noticeable that the fauna on its surroundings as well as the moss that was formed above the rocks where the falls are flowing are still thick indicating that this falls is not frequently visited by outsiders."
        ],
        [
            "Octagon Farm"
        ],
        [
            "This is man-made wonder owned by Congressman Manuel Zamora Sr., it has been visited by various personalities, Josh Hartnett being one of them."
        ],
        [
            "Upper Ulip Hot Spring"
        ],
        [
            "This is one of the nearest springs near the famed Mount Diwata."
        ],
        [
            "Sagay and Pasian Falls"
        ],
        [
            "These are the falls that remain untouched by modernity."
        ],
        [
            "Culture"
        ],
        [
            "Another Spanish influence that remains up to this day is the observance and celebration of barrios, or villages, of the day of their respective patron saint called \"Fiesta\".",
            "It is in these celebrations wherein songs, dances and other forms of arts and merrymaking from various cultures have evolved creatively into the sights and sounds of Monkayo now."
        ],
        [
            "Kariyawan Festival"
        ],
        [
            "Kariyawan Festival which is celebrated every September 4 is also one of the highlights in the municipality.",
            "This tells of the story of a diwata who has protected the people of Monkayo and who has given the first gold to the people."
        ],
        [
            "Binibining Monkayo"
        ],
        [
            "Is the organization responsible for sponsoring the annual town beauty pageant which selects the beautiful girl throughout the municipality of Monkayo."
        ],
        [
            "Drum and Bugle"
        ],
        [
            "Is a musical marching unit (similar to a marching band) consisting of brass instruments, percussion instruments, and color guard.",
            "Typically operating as independent non-profit organizations, they perform in competitions, parades, festivals, and other civic functions.",
            "Participants from different schools throughout the town compete for the title."
        ],
        [
            "Monkayo Fiesta"
        ],
        [
            "Monkayo's celebration of the Feast of St. Ignatius de Loyola every July 31."
        ],
        [
            "Araw ng Monkayo"
        ],
        [
            "The celebration falls on the fourth day of September."
        ],
        [
            "Transportation"
        ],
        [
            "There are various means to travel to Monkayo.",
            "The common modes of transportation within the municipality are multicabs, jeepneys, motorcycles.",
            "Tricycles play the routes that are outside the main streets of the town.",
            "In mountainous areas, the habal-habal passenger motorcycle is the main mode of transportation."
        ],
        [
            "Education"
        ],
        [
            "Elementary"
        ],
        [
            "There are 37 public elementary schools within Monkayo, namely;"
        ],
        [
            "Anagase Elementary School, located at Casoon"
        ],
        [
            "Awao Elementary School, located at Awao"
        ],
        [
            "Bagong Taas Elementary School, located at Haguimitan"
        ],
        [
            "Babag Elementary School, located at Babag"
        ],
        [
            "Banlag Elementary School, located at Banlag"
        ],
        [
            "Baylo Elementary School, located at Baylo"
        ],
        [
            "BLISS Elementary School, located at Poblacion"
        ],
        [
            "Boay Elementary School, located at Salvacion"
        ],
        [
            "Cabangkalan Elementary School, located at Casoon"
        ],
        [
            "Casoon Elementary School, located at Casoon"
        ],
        [
            "Depot Elementary School, located at Upper Ulip"
        ],
        [
            "Haguimitan Elementary School, located at Haguimitan"
        ],
        [
            "Inambatan Elementary School, located at Inambatan"
        ],
        [
            "Liwanag Elementary School, located at Banlag"
        ],
        [
            "Mabuhay Elementary School, located at Awao"
        ],
        [
            "Macopa Elementary School, located at Macopa"
        ],
        [
            "Mamunga Elementary School, located at Mamunga"
        ],
        [
            "Matangad Elementary School, located at Upper Ulip"
        ],
        [
            "Monkayo Central Elementary School, located at Poblacion"
        ],
        [
            "Moria Elementary School, located at Banlag"
        ],
        [
            "Mt.",
            "Diwata Elementary School, located at Mt.",
            "Diwata"
        ],
        [
            "Munoz Elementary School, located at Union"
        ],
        [
            "Naboc Elementary School, located at Naboc"
        ],
        [
            "New Kapatagan Elementary School, located at Casoon"
        ],
        [
            "Olaycon Elementary School, located at Olaycon"
        ],
        [
            "Paco Primary School, located at Banlag"
        ],
        [
            "Pasian Elementary School, located at Pasian"
        ],
        [
            "Pilar Elementary School, located at Babag"
        ],
        [
            "Rizal Elementary School, located at Rizal"
        ],
        [
            "Samuag Elementary School, located at Salvacion"
        ],
        [
            "San Jose Elementary School, located at San Jose"
        ],
        [
            "San Isidro Elementary School, located at San Isidro"
        ],
        [
            "Sugod Elementary School, located at Union"
        ],
        [
            "Totoy Elementary School, located at San Jose"
        ],
        [
            "Tuburan Elementary School, located at Casoon"
        ],
        [
            "Tubo-tubo Elementary School, located at Tubo-tubo"
        ],
        [
            "Ulip Elementary School, located at Upper Ulip"
        ],
        [
            "There are also three private elementary schools, namely;"
        ],
        [
            "Casa Amazing Grace School- Poblacion"
        ],
        [
            "Agape Christian Academy"
        ],
        [
            "Casa Amazing Grace School- Mt.",
            "Diwata"
        ],
        [
            "Secondary"
        ],
        [
            "Public High Schools:"
        ],
        [
            "Awao National High School, located at Awao"
        ],
        [
            "Babag National High School, located at Babag"
        ],
        [
            "Casoon National High School, located at Casoon"
        ],
        [
            "Monkayo National High School, located at Poblacion"
        ],
        [
            "Mt.",
            "Diwata National High School, located at Mt.Diwata"
        ],
        [
            "Pasian National High School, located at Pasian"
        ],
        [
            "Tubo-tubo National High School, located at Tubo-tubo"
        ],
        [
            "Union National High School, located at Union"
        ],
        [
            "Upper Ulip National High School, located at Upper Ulip."
        ],
        [
            "Private High School:"
        ],
        [
            "Assumption Academy of Monkayo, Inc., located at Poblacion"
        ],
        [
            "Colleges and University"
        ],
        [
            "Monkayo College of Arts Science And Technology (MONCAST) - administered by the municipal government of Monkayo."
        ],
        [
            "MATIF - TESDA accredited school"
        ],
        [
            "References"
        ],
        [
            "^ \"2019 Election Results:Monkayo, Compostela Valley\".",
            "GMA News.",
            "Retrieved October 7, 2021."
        ],
        [
            "^  Municipality of Monkayo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"CREATING THE MUNICIPALITY OF MONKAYO IN THE PROVINCE OF DAVAO\".",
            "Retrieved October 1, 2021."
        ],
        [
            "^ \"Diwalwal Mineral Reservation\".",
            "Retrieved October 1, 2021."
        ],
        [
            "^ \"Philippines (Mt.",
            "Diwalwal) – Cyanide in Artisanal Gold Mining Mercury\".",
            "Retrieved October 1, 2021."
        ],
        [
            "^ Carmel Crimmins (February 13, 2007).",
            "\"Philippine gold enchants but does not enrich\".",
            "Reuters.",
            "Retrieved October 1, 2021."
        ],
        [
            "^ \"The Diwalwal gold mining community is built on stilts along the hill slopes, without any water or sanitation.",
            "Over 130,000 people lived there during its hey-days in late 1980's.",
            "Today there are less than 30,000.",
            "In 12-hour shifts, 10,000 miners dig for gold more than 200 meters underground.",
            "The work is dangerous and cave-ins are common.",
            "In 1989, 1,000 people were killed in just one landslide.",
            "Miners chip away with hammers and metal spikes at the white rock from which the gold will be extracted.",
            "They carry 75-kg bags of ore for several kilometres through tunnels often only a meter wide.",
            "Salary is either 15% of the gold found, or more recently 130 pesos a day (less than US$ 3).",
            "Mercury inhalation and methyl-mercury ingestion have sent many miners and people living near mining camps to either their sick or death beds.\"",
            "Getty Images - Diwata"
        ],
        [
            "^ \"Ecological Profile of Monkayo\".",
            "Retrieved October 1, 2021."
        ],
        [
            "^ Jeremy Malcampo, Maria Concepcion Sakai, Dianne Galang, Jamie Caparas, & Estessa Xaris Que.",
            "\"Deep within the mines: The Mt.",
            "Diwalwal story\".",
            "The Philippine STAR.",
            "Retrieved October 1, 2021.",
            "{{cite web}}:  CS1 maint: multiple names: authors list (link)"
        ],
        [
            "^ \"EXCLUDING A CERTAIN AREA FROM THE OPERATION OF PROCLAMATION NO.",
            "369 DATED FEBRUARY 27, 1931, AND DECLARING THE SAME AS MINERAL RESERVATION AND AS ENVIRONMENTALLY CRITICAL AREA\".",
            "Retrieved October 1, 2021."
        ],
        [
            "^ DENR, COMPOSTELA VALLEY LGU TEAM UP FOR NABOC RIVER"
        ],
        [
            "^ Inquirer News Service (June 30, 2003).",
            "\"NPA eyed in slay of Monkayo town mayor\".",
            "Inq7.net.",
            "INQ7 Interactive, Inc. Archived from the original on October 25, 2003.",
            "Retrieved April 28, 2022."
        ],
        [
            "^"
        ],
        [
            "\"Province: Compostela Valley\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Monkayo: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved November 16, 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XI (Davao Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XI (Davao Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Compostela Valley\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Monkayo."
        ],
        [
            "Monkayo Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "http://nap.psa.gov.ph/ru11/Municipal%20Profile/nabunturan/Nabunturan,%20Compostela%20Valley.pdf"
        ],
        [
            "http://lgumonkayo.com/about_monkayo/aboutcont2.html"
        ],
        [
            "https://web.archive.org/web/20100824132920/http://202.91.162.20/moncayo/features.html"
        ],
        [
            "Places adjacent to Monkayo"
        ],
        [
            "Veruela, Agusan del Sur"
        ],
        [
            "Santa Josefa, Agusan del Sur"
        ],
        [
            "Trento, Agusan del Sur"
        ],
        [
            "Laak"
        ],
        [
            "Monkayo"
        ],
        [
            "Boston, Davao Oriental"
        ],
        [
            "Asuncion, Davao del Norte"
        ],
        [
            "Montevista / Compostela"
        ],
        [
            "Cateel, Davao Oriental"
        ],
        [
            "vte Province of Davao de OroNabunturan (capital)  Monkayo (largest municipality)Municipalities"
        ],
        [
            "Compostela"
        ],
        [
            "Laak"
        ],
        [
            "Mabini"
        ],
        [
            "Maco"
        ],
        [
            "Maragusan"
        ],
        [
            "Mawab"
        ],
        [
            "Monkayo"
        ],
        [
            "Montevista"
        ],
        [
            "Nabunturan"
        ],
        [
            "New Bataan"
        ],
        [
            "Pantukan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Monkayo&oldid=1194740571\""
        ],
        [
            "Categories: Municipalities of Davao de OroMining communities in the PhilippinesPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: multiple names: authors listCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Filipino-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}