{
    "name": "Morong",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Morong, Rizal"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°30′43″N 121°14′20″E﻿ / ﻿14.5119°N 121.2389°E﻿ / 14.5119; 121.2389"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Rizal, Philippines"
        ],
        [
            "For the politico-military district, see Morong (district)."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Morong, Rizal\" – news · newspapers · books · scholar · JSTOR (October 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesMorongMunicipalityMunicipality of MorongStreet in Morong"
        ],
        [
            "FlagSealMotto: Where Education is first.Map of Rizal with Morong highlightedOpenStreetMapMorongLocation within the PhilippinesCoordinates: 14°30′43″N 121°14′20″E﻿ / ﻿14.5119°N 121.2389°E﻿ / 14.5119; 121.2389CountryPhilippinesRegionCalabarzonProvinceRizalDistrict"
        ],
        [
            "2nd districtFoundedSeptember 30, 1578Barangays8"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorSidney B. Soriano • Vice MayorJose Fred R. Feliciano Jr. • RepresentativeEmigdio P. Tanjuatco III • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Leonardo S. PantaleonNemesio D. FelixOscar B. PantaleonIreneo M. PascualJoeven G. CondezRene O. AlejanFelix R. MarcelinoElpidio S. San Juan IIMatt Anthony G. Sy"
        ],
        [
            " • Electorate41,363 voters (2022)Area • Revenue₱ 205.2 million (2020) • Assets₱ 428.2 million (2020) • Expenditure₱ 180.4 million (2020) • Liabilities₱ 94.89 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code1960PSGC045809000IDD : area code +63 (0)2Native languagesTagalogMajor religionsRoman CatholicCatholic dioceseDiocese of AntipoloPatron saintSt.",
            "JeromeWebsitemorongrizal.gov.ph"
        ],
        [
            "Morong, officially the Municipality of Morong (Tagalog: Bayan ng Morong), is a second class municipality located in the province of Rizal, Philippines.",
            "As per the 2020 census, Morong has a population of 71,151 people."
        ],
        [
            "The town is also known for promoting education as its priority, with the vision \"Una Ang Edukasyon\" (Education First).",
            "During the early-1970s and early-1990s, Morong became a center of education with students from nearby towns of Rizal coming to study in the numerous academic institutions situated in the town."
        ],
        [
            "Some popular town attraction are the St. Jerome's Parish Church built in the Spanish Era as well as the featuring side dish called balaw-balaw."
        ],
        [
            "Morong is 28 kilometers (17 mi) from Antipolo and 45 kilometers (28 mi) from Manila."
        ],
        [
            "History"
        ],
        [
            "Discovery, founding and Christianization"
        ],
        [
            "On January 16, 1572, Captain Juan Maldonado, a trusted officer under Martin de Goiti, a Deputy of Miguel Lopez de Legaspi, came to a thriving community by a river while leading a Spanish contingent exploring the areas East of Manila.",
            "They named the community, Moron, after a township in Spain.",
            "This happened almost a year after Martin De Goit occupied Manila after routing the forces of Rajah Soliman (Sulayman)."
        ],
        [
            "The Spaniards found an organized community along both banks of the river but outlying settlements / barangays were in conflict with each other.",
            "The barangays were subjugated and the natives Christianized starting 1578 by Franciscan missionaries Juan de Placencia and Diego de Oropesa.",
            "They constructed chapels (visitas) attached to a bigger settlement to allow religious and civil administration.",
            "Later, this settlement was converted into a pueblo.",
            "which they called Pueblo de Moron.",
            "Baras, Tanay, Pililla, Binangonan were the visitas under Pueblo de Morong."
        ],
        [
            "Pueblo de Morong was made the provincial capital of the Franciscan Order at that time."
        ],
        [
            "The visita of Pilang separated from Morong and became the independent town of Pililla.",
            "Binangonan followed in 1621."
        ],
        [
            "Politico-Militar Distrito de Morong"
        ],
        [
            "Main article: Morong (district)"
        ],
        [
            "The Politico-Militar Distrito de Morong or Distrito de Morong was created out of the provinces of Manila and Laguna, composing the pueblos of Morong, Pililla, Tanay, Baras, Binangonan, Jalajala, Angono, Antipolo, Boso-Boso, Cainta and Taytay.",
            "Morong served as the district capital until 1901, when the district was dissolved due to the establishment of Rizal province."
        ],
        [
            "During the Spanish colonization in the Philippines, each town (pueblo) was administered by a gobernadorcillo, elected annually by all natives of the locality, subject to the approval of the superior government in located in Manila.",
            "In the 19th century, gobernadorcillos were elected by 12 cabezas de barangay."
        ],
        [
            "In the pueblo of Morong, it was different.",
            "A gobernadorcillo was not elected but was appointed by the governor of the province based on his economic wealth, training and educational background.",
            "He chose his own people and were not elected to help him with his duties.",
            "They did not receive salary but were exempted from paying taxes and doing forced labor."
        ],
        [
            "Public works built under forced labor"
        ],
        [
            "Morong Church and bridge"
        ],
        [
            "Puente de San Geronimo"
        ],
        [
            "The original Bridge of Morong was made of adobe stones, shaped and placed together, forming an arch over the river.",
            "The strength and stability of the bridge came from the weight of its wedge-shaped stone blocks and its upright position.",
            "The stones were cemented with mortar, a mixture of fine sand, lime, molasses and juice of ground puso-puso leaves.",
            "Heavy piers of the arch were planted on the opposite banks of the river.",
            "No metals were used during its construction from 1696 to 1701."
        ],
        [
            "St. Jerome Parish Church"
        ],
        [
            "Main article: St. Jerome Parish Church (Morong, Rizal)"
        ],
        [
            "The Catholic church was constructed by men, women and children from stones dug from a hill called Kay Ngaya; lime from the stones of the mountain Kay Maputi; sand and gravel from Morong River; and timber were contributed by the townspeople."
        ],
        [
            "Irrigation works"
        ],
        [
            "In 1850, Fr.",
            "Maximo Rico drew the plan of the irrigation dam at Uugong where it drew water from the falls and supervised the construction of the irrigation canal from Uugong dam to the ricefield in San Pedro.",
            "The canal measured 501 meters long and 2.1 meters deep.",
            "Other sources say that the construction started by Franciscan priests in 1848."
        ],
        [
            "Commandancia"
        ],
        [
            "La Commandancia"
        ],
        [
            "During the period of Spanish colonization, this building housed the Comandacia del Distrito Politico-Militar de Morong, the seat of Government for the Distrito.",
            "It was originally made of adobe stones, hard wood and galvanized iron sheets for roofing.",
            "During the early American period, it was converted into a school.",
            "It was damaged after the second world war, but rebuilt with alterations and continued to be used as a primary school building.",
            "It was later torn down and rebuilt using reinforced concrete materials.",
            "It was used as the municipal office building for the government of Morong.",
            "Currently, the second floor of the building serves as a museum which can be visited today."
        ],
        [
            "Bantayan and Torrita"
        ],
        [
            "Bantayan was a small guardhouse where civil guards were stationed at the entrance of the town.",
            "On the other hand, a torrita was a small tower with bells that provided the signal directed to the central station in front of the Commandancia."
        ],
        [
            "World War I"
        ],
        [
            "Tomas Claudio Monument"
        ],
        [
            "The first Filipino to die in World War I was Private Tomas Mateo Claudio, who served with the U.S. Marine Corps as part of the American Expeditionary Forces to Europe.",
            "He died in the Battle of Château Thierry in France on June 29, 1918.",
            "The Tomas Claudio Memorial College in Morong, which was founded in 1950, was named in his honor.",
            "The main street of the town was also named in his honor."
        ],
        [
            "World War II"
        ],
        [
            "The Puente de San Geronimo (old Morong Bridge) was intentionally blasted by the guerrillas so that Japanese troops could not cross and occupy the Northern part of Morong and Rizal until reinforcements could come.",
            "The plan worked for a few days but Japanese troops were eventually able to cross the river at a shallower part farther downriver.",
            "The Japanese occupation of the town was broken up by then-Lieutenant Edwin Ramsey, leading the last cavalry charge in U.S. military history with horses from the 26th Cavalry Regiment which he and a platoon of Philippine Scouts had ridden there from Fort Stotsenburg."
        ],
        [
            "During the Liberation, Filipino troops of the 4th and 42nd Infantry Division of the Philippine Army and 4th Constabulary Regiment of the Philippine Constabulary including the recognized guerrillas of the Col. Markings Guerrillas and the Hunters ROTC guerrillas liberated and captured the towns in Morong, defeated Japanese forces and forced them to surrender by the end of the War."
        ],
        [
            "Geography"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Morong, Rizal"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "40(1.6)"
        ],
        [
            "33(1.3)"
        ],
        [
            "35(1.4)"
        ],
        [
            "38(1.5)"
        ],
        [
            "138(5.4)"
        ],
        [
            "190(7.5)"
        ],
        [
            "242(9.5)"
        ],
        [
            "216(8.5)"
        ],
        [
            "224(8.8)"
        ],
        [
            "200(7.9)"
        ],
        [
            "114(4.5)"
        ],
        [
            "94(3.7)"
        ],
        [
            "1,564(61.6)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.2"
        ],
        [
            "9.0"
        ],
        [
            "11.0"
        ],
        [
            "11.7"
        ],
        [
            "21.5"
        ],
        [
            "24.0"
        ],
        [
            "27.2"
        ],
        [
            "26.1"
        ],
        [
            "26.8"
        ],
        [
            "22.3"
        ],
        [
            "16.3"
        ],
        [
            "15.1"
        ],
        [
            "223.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "The Political Map of Morong, Rizal (Subject for correction).",
            "This shows the barangays of Morong, Rizal and the adjacent city/municipality in the area."
        ],
        [
            "Morong is politically subdivided into 8 barangays with 3 situated in the poblacion.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bombongan"
        ],
        [
            "Caniogan-Calero-Lanang (CCL)"
        ],
        [
            "Lagundi"
        ],
        [
            "Maybancal"
        ],
        [
            "San Guillermo/ San Guilmo"
        ],
        [
            "San Pedro (Poblacion)"
        ],
        [
            "San Jose (Poblacion)"
        ],
        [
            "San Juan (Poblacion)"
        ],
        [
            "San Guillermo"
        ],
        [
            "In terms of area, San Guillermo or San Guilmo as it is locally called, is the biggest of the eight barangays of Morong.",
            "It borders the towns of Binangonan, Teresa and Tanay."
        ],
        [
            "Brgy.",
            "San Guillermo is a farming community with a population of 6,522 and 1,377 total dwellings (2000 census).",
            "While majority in the barrio depend on farming as a livelihood, many others are engaged in businesses such as garment, poultry and piggery."
        ],
        [
            "San Isidro Labrador is the patron Saint of San Guillermo, a feast in his honor is celebrated annually 15 May.",
            "In 2005, the small chapel of San Isidro Labrador became a full pledge Parish in the Diocese of Antipolo serving 10,500 Catholics."
        ],
        [
            "Also in 2005, San Guillermo National High School was established."
        ],
        [
            "The first wave of San Guillermo immigrants to America came in the early-1900s.",
            "San Guillermo natives living in California maintain their cultural heritage by hosting a gathering on Memorial Day in celebration of feast of patron saint San Isidro Labrador.",
            "Most San Guillermo natives live in the metropolitan areas of Los Angeles and San Francisco, and the feast is alternately celebrated in both cities since its conception in 1979."
        ],
        [
            "Maybancal"
        ],
        [
            "Caballero monument, Barangay Maybancal"
        ],
        [
            "Located in the east of the town, the main industries in Brgy.",
            "Maybancal are farming, food and textile manufacturing.",
            "There are about 8,709 residents living in the area with the ratio of men to women of 1:2."
        ],
        [
            "San Juan"
        ],
        [
            "Barangay San Juan is Morong's center of business and trade.",
            "It is said to be the highest remitting income revenue among the barangays of the town."
        ],
        [
            "Also located in Brgy.",
            "San Juan is the town's parish church & St. Jerome's Academy.",
            "The facade of St. Jerome Parish Church is a Department of Tourism recognized tourist spot."
        ],
        [
            "San Pedro"
        ],
        [
            "Barangay San Pedro is the capital barangay of Morong.",
            "It lies adjacent with the Laguna Bay in the east, bounded at the south with the town of Cardona, on the west by Brgy.",
            "Bombongan and on the north by Brgy.",
            "San Jose and Brgy.",
            "San Juan."
        ],
        [
            "Brgy.",
            "San Pedro has a total land area of 368 has.",
            "and around 7,000 populations as of 2010 census."
        ],
        [
            "As a poblacion barangay, the offices Local Government of Morong are located in Brgy.",
            "San Pedro."
        ],
        [
            "Located in the barangay are establishments such as Morong Public Market, Sea Oil Gasoline Station, Phil Oil Gasoline Station, Aldec Agri-Dynamics Company, Era Plaza Restaurant, Emma's Panciteria Restaurant, Kainan, Inuman, At iba pa Beer House, Arena de Morong (\"Sabungan\"), AMA Bank, Macro Bank."
        ],
        [
            "Brgy.",
            "San Pedro is also the center of education in Morong.",
            "Several educational institution can be found in the barangay, namely San Pedro Day Care Center, Jose S. Mapa, St. Claire School, Jesus My Shepherd Montessori School, Renaissance School of Science and Technology, EAST Systems Colleges of Rizal, Inc., and Timoteo A. Reyes Elementary School."
        ],
        [
            "Landmarks such as Morong Town Plaza, \"Statwa ng Magsasaka\", and \"Puking Bato\" sa Boulevard Park are also found in Brgy.",
            "San Pedro."
        ],
        [
            "Lagundi"
        ],
        [
            "Barangay Lagundi is the easternmost barangay of Morong, Rizal.",
            "Its main road Raymundo Street connects the northernmost barangay to the boundary of Baras, Rizal and the capital of Rizal Province, Antipolo."
        ],
        [
            "There are two public elementary schools in the barangay, namely: Lagundi Elementary School and Pulong Kumunoy Elementary School.",
            "To cater the needs of accessibility of students, Morong National High School annexed a campus beside the Lagundi Elementary School."
        ],
        [
            "Commercial establishments are abundant, most especially to the entry point.",
            "Alfamart and certain stores and restaurant chains are located within the vicinity.",
            "During All Saint's Day, the area is known to be a marketplace for flowers from Baguio and neighboring municipalities in Cordillera."
        ],
        [
            "The barangay's patron saint is the Immaculate Heart of Mary and Sunday masses are celebrated in the chapel every 5 P.M. presided by a Roman Catholic Priest from the mother parish, St. Jerome Church.",
            "During the feast day in June, a procession is often held."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MorongYearPop.±% p.a.1903 5,276—    1918 6,840+1.75%1939 8,623+1.11%1948 10,035+1.70%1960 13,694+2.62%YearPop.±% p.a.1970 18,970+3.31%1975 21,058+2.12%1980 24,858+3.37%1990 32,165+2.61%1995 36,048+2.16%YearPop.±% p.a.2000 42,489+3.59%2007 50,538+2.42%2010 52,194+1.18%2015 58,118+2.07%2020 71,151+4.06%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Morong, Rizal, was 71,151 people, with a density of 1,900 inhabitants per square kilometre or 4,900 inhabitants per square mile."
        ],
        [
            "Religion"
        ],
        [
            "60% of the population in Morong Rizal is composed of Roman Catholics.",
            "Other religions in town are the following:"
        ],
        [
            "|2|"
        ],
        [
            "Iglesia Filipina Independiente"
        ],
        [
            "Iglesia ni Cristo"
        ],
        [
            "United Methodist"
        ],
        [
            "Protestant Denominations"
        ],
        [
            "Members Church of God International"
        ],
        [
            "Church of Animasola"
        ],
        [
            "Jehovah's Witnesses"
        ],
        [
            "The Church of Jesus Christ of Latter-day Saints"
        ],
        [
            "Morong Bible Church"
        ],
        [
            "Morong Christian Church"
        ],
        [
            "Grace City Church"
        ],
        [
            "Church of Christ"
        ],
        [
            "Sovereign Grace Reformed Christian Church (Reformed Baptist)"
        ],
        [
            "Members Church of God International (ADD)"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Morong"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "9"
        ],
        [
            "2006  4.80"
        ],
        [
            "2009  2.24"
        ],
        [
            "2012  3.50"
        ],
        [
            "2015  4.93"
        ],
        [
            "2018  3.81"
        ],
        [
            "2021  9.00"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Landmarks"
        ],
        [
            "The view of old Uugong falls at the Uugong park resort"
        ],
        [
            "Uugong Park - During the early 60's until the early 80's, Uugong Park was known for its astonishing sight of the rice field and cascading waterfalls.",
            "The orchestra of roaring rapids echoing in the gorge branded the park's name, \"u-ugong\" from the Tagalog word which meant \"echoing.\"",
            "Uugong Park now includes a resort made and owned by the local artist, Rafael Pacheco.",
            "Rafael Pacheco is a world-renowned artist and is considered as the Father of Palm and Finger Painting in the Philippines.",
            "The resort does not use the old falls anymore, instead it houses two pools where one can view the now dead waterfalls and its river.",
            "Also found in the new Uugong resort are the displayed collection of paintings and sculpture of Pacheco."
        ],
        [
            "Puking Bato - Also called Duckling Society Park, it is located at Natividad street (Ibaba Dulo) and is colloquially referred to as Boulevard.",
            "It is a popular local spot for Morongueños to jog, stroll and sightsee."
        ],
        [
            "Cavalier Statue - Located at Brgy.",
            "Maybancal, it serves as the symbol of the barangay.",
            "The statue depicts an armored knight holding battleaxe charging atop his horse.",
            "Maybancaleños celebrate the Cavalier's Day annually on 25 October."
        ],
        [
            "Morong's Old Municipal office (\"Commandancia\") - Located in Brgy.",
            "San Pedro, it is now the home of Museong Pambayan ng Morong.",
            "A declared historical site, it was the seat of Government for the \"Distrito Politico Militar de Morong.\"",
            "With the reorganization of the province into Rizal during the American colonialization, municipalities were added and the seat of the Provincial Government was transferred to Pasig.",
            "The building served as the Municipal Hall of Morong from the 1960s up until the transfer of local government offices to the new municipal building in 2011."
        ],
        [
            "St. Jerome Parish Church - The most notable landmark in Morong, it was built by Chinese craftsman during the arrival of the first Spanish priest.",
            "Known for its unique and intricate neo-baroque style design and its three-storey belfry as its facade, the parish church sit visibly on top of a hill."
        ],
        [
            "Main article: St. Jerome Parish Church (Morong, Rizal)"
        ],
        [
            "Culture and tradition"
        ],
        [
            "St. Jerome image displayed at the main altar of the church during his feast day"
        ],
        [
            "Fiesta - The celebrated fiesta in Morong is the town fiesta, which is the first Sunday of February.",
            "During the early times, February would be known for the harvesting month in the town, it is a form of celebration and thanksgiving for a bounty harvest."
        ],
        [
            "Catholic Fiesta - The patron saint of Morong, Rizal is Saint Jerome.",
            "A doctor of the church, a priest and translator of the Bible.",
            "His feast day is September 30."
        ],
        [
            "Pabasa - A holy week activity, which is chanting the life and Passion of Christ.",
            "It signifies the start of the 40 days before holy week.",
            "In the town of Morong, not an ordinary Pabasa tone is used, but it is mostly a tone of sadness and agony.",
            "This is done from different houses, who owns a \"santo\" or a saint that is an image used during Holy Week."
        ],
        [
            "Cordero - It is only in Morong that this tradition has been done for almost 60 years.",
            "Kordero, which means lamb of God, is a re-enactment of the preparation of the paschal lamb for the passover meal, that Jesus and his 12 apostles took, and eventually became the Institution of the holy Eucharist.",
            "Kordero also symbolizes Jesus as a sacrificial lamb who suffered to redeem mankind from sin.",
            "In Morong a lamb which is made of sweet potatoes and potatoes is processioned before the Maundy Thursday Mass.",
            "A tradition which is also being copied by other nearby towns of Rizal, and has been featured in the national newspaper.",
            "The Hermano represents the owner of the upper room, the place where the last supper took place."
        ],
        [
            "The main tableau of the 2010 Pabasang Bayan in Morong"
        ],
        [
            "Pabasang bayan - A yearly event/exhibit that showcases the 40+ processional images, that started in 1996.",
            "Said event is usually done the Saturday before Palm Sunday in the town's gymnasium wherein a breathtaking tableau is made yearly showing the chronological events of the life of Jesus (e.g.",
            "1996 - 1997 -\"Last Supper\", 1998 - \"Wedding in Canaan\", 1999 - \"The multiplication of bread and fish\", 2004 - \"Jesus teaches in the Mountain\", 2005 - \"The teaching of Christ in the lake of Galilee\", 2006 - \"The public ministry of Jesus\", 2007 -\" The baptism of Jesus in the river Jordan\", 2008 - \"Jesus in the Temple\", 2009 - \"The calling of the twelve apostles\", 2010 - \"Jesus calls the tax collector Matthew\", 2011 - \"Jesus healed the Centurion's servant\", 2012 - \"Jesus Healed a paralytic man\", 2013 - \" Sermon in the Mount\").",
            "A must see attraction that is first done by the people of Morong, that has captured the attention of some nearby towns in Rizal and Metro Manila such as Pililla, Tanay, Cardona, Baras, Teresa, Binangonan, Cainta, Pasig, Quezon City, etc.",
            "The event was even featured thrice in The Philippine Daily Inquirer a national newspaper in the Philippines and was covered by national networks such as ABS-CBN, TFC (the Filipino Channel- ABS-CBN), GMA Network and GMA News TV (former QTV channel 11).",
            "The difference between the usual Pabasa and Pabasang bayan is that the whole town is welcome to this event.",
            "Saturday night before Palm Sunday, anticipated mass is held in the gymnasium."
        ],
        [
            "Senakulo - A yearly activity during Holy week, a dramatization of the life and death of Christ.",
            "Senakulo in Morong is entitled \"Ang Tagapagligtas\".",
            "The play is divided into 3 nights.",
            "It starts in the evening of Holy Wednesday and ends on Good Friday, usually after the Procession.",
            "On the first night it tells the brief story of the Old Testament starting from the Creation, Adam and Eve, the giving of the Ten Commandments, the fall of Sodom and Gomorrah, Annunciation of Mary, birth of our Savior, and ends in the finding of Jesus in the temple.",
            "On the second night it tells the teachings, public life and ministry of Jesus, and ends in the planning to kill him by the Priests.",
            "Third night the most dramatic scenes are seen, such as Entry to Jerusalem, Institution of the Eucharist, his Agony in the Garden, the stations of the cross, his death and ends in his Resurrection."
        ],
        [
            "Kruz Na Mahal - The re-enactment of the finding of the cross of Jesus by Reyna Elena and Prinsepe Constanino.",
            "Each barrio will prepare a small caro with a cross.",
            "They would go around the place singing the kruz na mahal song: \"Krus na mahal, Krus na mapalad, ang dakilang armas, bandila ni Kristo!",
            "sumakop sa lahat....\" After the mini procession, the children present will be given lengua de patatas."
        ],
        [
            "Flores de Mayo - An old tradition of Morong that has been banned since the early 1980s up to present as it became a fashion show and where the rich could show off in the town of Morong.",
            "The real purpose used to be for the veneration of the Virgin Mary.",
            "Girls from Morong, ages 6–30, would offer flowers and prayers to the blessed Mother.",
            "Girls included in this procession would also bring the seven alays for the Blessed Mother such as: Rosa Mystica, Torre ni David, Crown of Mary, Gates of Heaven etc.",
            "This tradition is attempted to be revived again by the Catholic Church in the year 2007 through voting, but comments such as the main purpose of it might again not be done and the fashion show and showing off would once again reign, the church decided to just make it a simple celebration, by doing a rosary and offering flowers to the Virgin Mother."
        ],
        [
            "Malatines - Is a Christmas Eve mass or usually called MISA- de Gallo by other places.",
            "December 24.",
            "Usually celebrated outside the church Patio.",
            "The much awaited scenario in the mass is the dancing of the star.",
            "Wherein a big parol comes down, from the top of the main facade of the church down to the belen located in front of the altar, while singing \"Gloria\" or \"Papuri\"."
        ],
        [
            "Kasalan or Wedding - In the town of Morong Rizal, there is a different way to celebrate a wedding or in Filipino \"Kasalan\".",
            "In other towns such as Batangas they have the money dance, wherein the couple would do their first dance, and visitors would approach them and pin money, in Morong Rizal, a tradition of \"Panganga\" is done to help the couple start themselves.",
            "The couple accompanied by an old member of the family with a lighted candle.",
            "they would go to each table with a basket.",
            "the candle symbolizes the guiding light of the couple.",
            "As the couple approach each table, visitors would put their donation and sip a shot of whisky or wine as a \"Thank you\".",
            "The basket has a green clothe inside to cover the money given, so that the couple would not know how much the visitor would put.",
            "Another tradition during weddings would be the \"hatiran\" or wherein the bride accompanied by her parents would now transfer house.",
            "It is like a formal farewell of the bride to her house as she will transfer to the groom's house.",
            "What is exciting in this tradition is that each lightpost/electric post that the couple would pass through going to the groom's house, the newlyweds would kiss each other.",
            "This is appropriate if both the bride and the groom are from Morong Rizal."
        ],
        [
            "Artistry"
        ],
        [
            "Kayas Kawayan: art made of Bamboo"
        ],
        [
            "Morong is also known for its \"Kayas Kawayan\".",
            "The town is the first and is known to make Baluwartes, an art made of bamboo, with intricate designs.",
            "Usually used during special events such as weddings, cordero, and fiestas, its usually found in the entrance gate of the event.",
            "During cordero, the lamb which is made of cake, sweet potatoes and potatoes, is placed and processioned around the town until the church in a small kayas kawayan, carried by men, adorned with flowers."
        ],
        [
            "Now this art is being copied by the nearby towns."
        ],
        [
            "Games"
        ],
        [
            "Some of the famous games in Morong, Rizal are the following.",
            "This dates from the 1940s to 1997."
        ],
        [
            "Putitiro - A Filipino street game also referred to as \"patintero\", wherein an \"it\" person will stands in a line, while their opponents try to cross that line without getting touched by the \"It\"."
        ],
        [
            "Hulugang Ginto - popular night game especially during full moon."
        ],
        [
            "Pasenorden - follow the leader game.",
            "The leader would shout \"Pasenorden!\"",
            "the players will say \"combento\" then the leader will say his command: \"unahan sa pag bigay sa akin ng dahon\" (bring me a leaf) the players will ask: \"anong dahon?\"",
            "(what kind of leaf).",
            "Once the leader states his command all player will look for that kind of leaf.",
            "The first one to bring the given leaf would be the next leader."
        ],
        [
            "Pati cobra (Pati-Kubra) - Morong (San Guillermo) version of baseball and cricket, uses bamboo stick as paddle or bat."
        ],
        [
            "Espadahan"
        ],
        [
            "Jolen - It is a game which uses balls, specifically marbles."
        ],
        [
            "Stekenapan -\"Stick 'em up an\" a western cowboy gun game."
        ],
        [
            "Taguan - Is also known as hide and seek.",
            "It is a popular game which usually played during full moon."
        ],
        [
            "Dirabes - popular games by school kids in 60s and 70s particularly in San Guillermo."
        ],
        [
            "Sikaran - Filipino Martial Art that originated in Lagundi and Baras.",
            "Sikaran closely means Sipaan (to kick each other)"
        ],
        [
            "Hospitals"
        ],
        [
            "Rizal Provincial Hospital System Morong (RPHS) - Public hospital, offers internal medicine, pediatrics, OB Gyne, general surgery, dental."
        ],
        [
            "Morong Doctors' Hospital - a private hospital which is governed by Board of Directors."
        ],
        [
            "Education"
        ],
        [
            "University of Rizal System Morong Campus (URSM) - an organized academic entity composed of separate but interrelated units coordinates and integrates system-wide functions and activities.",
            "It has the prime mandate of providing instruction, research, extension and production to the public."
        ],
        [
            "Tomas Claudio Colleges - formerly Tomas Claudio Memorial College, located in Sitio Taghangin, Morong, Rizal."
        ],
        [
            "Morong National High School - a public high school."
        ],
        [
            "Tomas Claudio Memorial Elementary School"
        ],
        [
            "Renaissance School of Science and Technology (RSST)- located at the border of Morong and Cardona, formerly a preschool to elementary school, now offers up to 4 year college degree and many TESDA accredited courses(free from the government)."
        ],
        [
            "Jesus My Shepherd Montessori School (JMSMS) - a public elementary senior and high school"
        ],
        [
            "Notable personalities"
        ],
        [
            "Tomás Mateo Claudio - Filipino soldier who enlisted in the U.S. Army during the First World War.",
            "He was considered as the first Filipino to die overseas in the midst of an international conflict."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Morong |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b c d e f g h i j k Pascual, Timoteo; Guillermo, Liwayway (1978).",
            "Morong's 400 Years.",
            "Manila: UST Press."
        ],
        [
            "^ Couttie, Bob (2009).",
            "\"17.",
            "The Last Charge\".",
            "Chew the Bones: Maddog Essays on Philippine History.",
            "pp. 103–105.",
            "ISBN 978-1442142596."
        ],
        [
            "^ fixDavison, Phil (April 3, 2013).",
            "\"Lieutenant-Colonel Edwin Ramsey: Soldier who led the last cavalry charge by the US army\".",
            "The Independent."
        ],
        [
            "^ Elaine Woo (March 17, 2013).",
            "\"WWII cavalry officer in the Philippines\".",
            "Los Angeles Times.",
            "Archived from the original on March 19, 2013."
        ],
        [
            "^"
        ],
        [
            "\"Morong: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 11, 2020."
        ],
        [
            "^"
        ],
        [
            "\"Province: Rizal\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Rizal\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Rizal Provincial Government Official Website\".",
            "www.rizalprovince.ph.",
            "Retrieved January 5, 2023."
        ],
        [
            "^ \"About Us |\".",
            "www.urs.edu.ph.",
            "Retrieved January 5, 2023."
        ],
        [
            "^ \"HOME | TOMAS CLAUDIO COLLEGES\".",
            "www.tomasclaudiocolleges.edu.ph.",
            "Retrieved January 5, 2023."
        ],
        [
            "^ \"CALABARZON - NEP: All courses\".",
            "r4a-3.lms.deped.gov.ph.",
            "Retrieved January 5, 2023."
        ],
        [
            "^ \"Barangay San Pedro\".",
            "Municipality of Morong, Rizal.",
            "Retrieved March 15, 2023."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Morong, Rizal."
        ],
        [
            "Website of Morong, Rizal"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Morong, Rizal"
        ],
        [
            "Teresa"
        ],
        [
            "Tanay"
        ],
        [
            "Binangonan"
        ],
        [
            "Morong"
        ],
        [
            "Baras"
        ],
        [
            "Cardona"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "vte Province of RizalAntipolo (capital and largest city)Municipalities"
        ],
        [
            "Angono"
        ],
        [
            "Baras"
        ],
        [
            "Binangonan"
        ],
        [
            "Cainta"
        ],
        [
            "Cardona"
        ],
        [
            "Jalajala"
        ],
        [
            "Morong"
        ],
        [
            "Pililla"
        ],
        [
            "Rodriguez"
        ],
        [
            "San Mateo"
        ],
        [
            "Tanay"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Component City"
        ],
        [
            "Antipolo"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Morong,_Rizal&oldid=1230492621\""
        ],
        [
            "Categories: Municipalities of RizalPopulated places on Laguna de BayFormer provincial capitals of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Articles needing additional references from October 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textWikipedia articles needing clarification from June 2019Commons category link from WikidataAll articles with dead external linksArticles with dead external links from April 2020Articles with permanently dead external linksPages using the Kartographer extension"
        ]
    ]
}