{
    "name": "Mulanay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Mulanay"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°31′20″N 122°24′15″E﻿ / ﻿13.5222°N 122.4042°E﻿ / 13.5222; 122.4042"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Quezon, Philippines"
        ],
        [
            "Not to be confused with Mulaney."
        ],
        [
            "Municipality in Calabarzon, PhilippinesMulanayMunicipalityMunicipality of MulanayMulanay Church"
        ],
        [
            "FlagSealMap of Quezon with Mulanay highlightedOpenStreetMapMulanayLocation within the PhilippinesCoordinates: 13°31′20″N 122°24′15″E﻿ / ﻿13.5222°N 122.4042°E﻿ / 13.5222; 122.4042CountryPhilippinesRegionCalabarzonProvinceQuezonDistrict"
        ],
        [
            "3rd districtFoundedFebruary 4, 1745Barangays28"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAristotle L. Aguirre • Vice MayorJay E. Castilleja • RepresentativeReynante U. Arrogancia • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Kristine A. AdaoAlexander Derrick B. MoralesEmmanuel M. de LunaFernandito T. BaroniaMaria Victoria R. SarapatAntonio R. RodelasMarcelino C. DiazRodil M. Rogel"
        ],
        [
            " • Electorate35,227 voters (2022)Area • Revenue₱ 253.8 million (2020) • Assets₱ 535.8 million (2020) • Expenditure₱ 212.9 million (2020) • Liabilities₱ 273.9 million (2020)Service provider • ElectricityQuezon 1 Electric Cooperative (QUEZELCO 1)Time zoneUTC+8 (PST)ZIP code4312PSGC045628000IDD : area code +63 (0)42Native languagesTagalogWebsitewww.mulanayquezon.gov.ph"
        ],
        [
            "Mulanay, officially the Municipality of Mulanay (Tagalog: Bayan ng Mulanay),  is a 1st class municipality in the province of Quezon, Philippines.",
            "According to the 2020 census, it has a population of 55,576 people."
        ],
        [
            "This place is situated on the Bondoc Peninsula; its geographical coordinates are 13° 31′ 20″ North, 122° 24′ 15″ East, and its original name was Malunay.",
            "Mulanay is 149 kilometres (93 mi) from Lucena and 279 kilometres (173 mi) from Manila."
        ],
        [
            "The town proper, with her plain landscape, is a coastal town facing the Tayabas Bay.",
            "The municipality is being considered to be listed in the tentative list for UNESCO World Heritage Site inscription due to its architectural marvels, notably its baroque church, its preserved ancestral houses, and the Limestone tombs of Kamhantik, a highly-significant Tagalog archaeological site and dambana, in the Buenavista Protected Landscape."
        ],
        [
            "Etymology"
        ],
        [
            "Some legends would relate Mulanay to have derived its name from the Tagalog word Malunay, which means \"Plenty of Lunay\".",
            "Lunay is the vernacular term for Pili wax, which was abundant in the area."
        ],
        [
            "History"
        ],
        [
            "The findings of the conducted archaeological exploration and excavation at Mt.",
            "Kamhantik Archaeological Site by the team from the National Museum headed by Dr. Eusebio Z. Dizon, Scientist III and a world renown archaeologist says Mulanay was inhabited by an organized community in the year 500AD-1300AD, who were our ancestors belonging to the Austronesian speaking people and originated from Taiwan (Peter Belwood).",
            "Austronesian people or Austronesian-speaking people are various populations found in Asia, Oceania and Africa that speak languages of the Austronesian family.",
            "These include Taiwanese aborigines; the majority ethnic groups of Malaysia, East Timor, the Philippines, Indonesia, Brunei, Singapore, Madagascar, Micronesia, and Polynesia, as well as the Polynesian people of New Zealand and Hawaii, and the non-Papuan people of Melanesia.",
            "The Austronesian language is a language family that is widely dispersed throughout Maritime Southeast Asia, Madagascar and the islands of the Pacific Ocean, with a few members on continental Asia.",
            "Austronesian languages are spoken by about 386 million people, making it the fifth-largest language family by number of speakers."
        ],
        [
            "The result of the C-14 (carbon dating) on teeth found in burial No.5 at the Mt Kamhantik Archaeological Site was dated in the year 890AD or 1,220 years old (radio carbon dating result for sample IV2011F657AB,  BETA ANALYTIC INC. MIAMI, FLORIDA, USA).",
            "The recent archaeological investigation on July 15–30, 2015 found a surface archaeological artifact, stone tool.",
            "And according to Dr. Eusebio Z.  Dizon, Scientist III, it was a tool from the Neolithic period 10,000 BC-2,000 BC used for carving, cutting and sharpening.",
            "Other artifacts found were potteries with incised designs which were similar to the early Huynh-Kalanay Potteries of Taiwan and Vietnam from the period of 1000 BCE and 200 CE.",
            "Some were also present in the different areas in the Philippines like Sarangani, Cagayan, Isabela, Nueva Ecija, Bicol, Masbate and many others dating to 1000BC-300AD.",
            "Ceramics shreds from the Sung Dynasty (960AD-1279AD) were are also found in the area.",
            "These archaeological findings were evidences showing the participation of our ancestors from Mt.",
            "Kamhantik to a trade network in 500AD-1300AD."
        ],
        [
            "The evangelization of Mulanay by the Franciscan Missionaries was in 1600 while its civil foundation as a municipality was effected in 1745 through the approval of the King of Spain.",
            "During the Spanish regime, Mulanay was composed of the municipal territories of San Narciso, San Francisco, Catanauan and San Andres which was as big as the province of Bataan.",
            "In 1755, Catanauan became a separate municipality followed by other remaining municipalities.",
            "Mulanay's territorial jurisdiction was reduced to 42,000 hectares.",
            "The original town of Mulanay composed of six (6) barangays was raided by the Moro pirates that led the town's executive together with the barangay heads to transfer the town site to the so-called Mayordomo, a sitio of Barangay Latangan.",
            "After several years, raids along coastal areas were lessened.",
            "The people returned to the town site, however, few barangay heads disagreed and left for Bantuin, Marinduque and Mindoro."
        ],
        [
            "The populace of Mulanay is composed of different ethnic groups like Tagalogs, Visayas and Bicolanos.",
            "Based on the Philippine Statistics Authority Census Calendar Year 2010, it has a population of 50,826.",
            "The first town head of Mulanay during the Spanish Regime was Alcalde Mayor Eustaquio Manlangit, while the first town mayor during the American Occupation was Mayor Atanacio Ojeda.",
            "The municipality had been under twenty seven mayors from Spanish Regime up to present.",
            "The incumbent mayor is Aris Aguirre."
        ],
        [
            "At present, Mulanay is composed of twenty eight (28) barangays, four of which comprise the poblacion.",
            "The municipality is an agricultural town where farm crops like coconut, garlic, bananas, rice, corn, peanuts, mongo, ginger, squash, and other vegetables are abundantly harvested.",
            "Mulanay lies along the coast of Tayabas Bay, an abundant fishing ground."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Mulanay is politically subdivided into 28 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Ajos"
        ],
        [
            "Amuguis"
        ],
        [
            "Anonang"
        ],
        [
            "Bagong Silang"
        ],
        [
            "Bagupaye"
        ],
        [
            "Barangay Poblacion 1"
        ],
        [
            "Barangay Poblacion 2"
        ],
        [
            "Barangay Poblacion 3"
        ],
        [
            "Barangay Poblacion 4"
        ],
        [
            "Bolo"
        ],
        [
            "Buenavista"
        ],
        [
            "Burgos"
        ],
        [
            "Butanyog"
        ],
        [
            "Canuyep"
        ],
        [
            "F. Nanadiego"
        ],
        [
            "Ibabang Cambuga"
        ],
        [
            "Ibabang Yuni"
        ],
        [
            "Ilayang Cambuga (Mabini)"
        ],
        [
            "Ilayang Yuni"
        ],
        [
            "Latangan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Matataja"
        ],
        [
            "Pakiing"
        ],
        [
            "Patabog"
        ],
        [
            "Sagongon"
        ],
        [
            "San Isidro"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Mulanay, Quezon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31(1.2)"
        ],
        [
            "23(0.9)"
        ],
        [
            "25(1.0)"
        ],
        [
            "30(1.2)"
        ],
        [
            "85(3.3)"
        ],
        [
            "145(5.7)"
        ],
        [
            "182(7.2)"
        ],
        [
            "153(6.0)"
        ],
        [
            "172(6.8)"
        ],
        [
            "150(5.9)"
        ],
        [
            "113(4.4)"
        ],
        [
            "68(2.7)"
        ],
        [
            "1,177(46.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.3"
        ],
        [
            "8.5"
        ],
        [
            "9.7"
        ],
        [
            "11.3"
        ],
        [
            "18.3"
        ],
        [
            "23.2"
        ],
        [
            "26.6"
        ],
        [
            "25.4"
        ],
        [
            "25.9"
        ],
        [
            "24.2"
        ],
        [
            "19.7"
        ],
        [
            "15.2"
        ],
        [
            "219.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MulanayYearPop.±% p.a.1903 2,149—    1918 3,404+3.11%1939 3,957+0.72%1948 5,149+2.97%1960 9,859+5.56%1970 23,481+9.05%1975 28,011+3.60%1980 31,701+2.50%1990 38,659+2.00%1995 43,617+2.29%2000 45,903+1.10%2007 48,538+0.77%2010 50,826+1.69%2015 53,123+0.85%2020 55,576+0.89%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Mulanay"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "2006  66.30"
        ],
        [
            "2009  31.49"
        ],
        [
            "2012  39.69"
        ],
        [
            "2015  34.28"
        ],
        [
            "2018  21.14"
        ],
        [
            "2021  20.34"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Town Hall and ML Quezon Monument"
        ],
        [
            "Elected officials"
        ],
        [
            "Municipal council (2022 - 2025):"
        ],
        [
            "Mayor: Aris Aguirre"
        ],
        [
            "Vice-Mayor: Jay E. Castilleja"
        ],
        [
            "Councilors"
        ],
        [
            "Tinan Aguirre-Adao"
        ],
        [
            "Alex Morales"
        ],
        [
            "Emmanuel De Luna"
        ],
        [
            "Andy Baronia"
        ],
        [
            "Vicky Sarapat"
        ],
        [
            "Antonio Rodelas"
        ],
        [
            "Marcel Diaz"
        ],
        [
            "Rodil Rogel"
        ],
        [
            "Source: GMA News"
        ],
        [
            "Tourism"
        ],
        [
            "Amuguis Falls"
        ],
        [
            "Amuguis Falls are located in Barangay Amuguis, Mulanay.",
            "With its own distinct and unique characteristics, waterfalls are undeveloped tourist destination.",
            "They are surrounded by forest trees and big rock formation where local folks usually go for picnics and gathering."
        ],
        [
            "Malaking Bato"
        ],
        [
            "The century-old legendary boulder along the coast of Barangay Santa Rosa which had been famous as a unique picnic spot among the residents and visitors alike."
        ],
        [
            "Buenavista Protected Landscape"
        ],
        [
            "A protected area situated in Barangay Buenavista that preserves a major watershed forest."
        ],
        [
            "Limestone tombs of Kamhantik"
        ],
        [
            "A thousand-year-old limestone-curved burial site of ancient people declared as a certified historical site by the National Museum of the Philippines.",
            "It is located within the Buenavista Protected Landscape.",
            "The site is a high-level dambana to Anitism adherents."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Mulanay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Philippine archaeologists work on an unearthed limestone coffin | View photo - Yahoo!",
            "News Philippines\".",
            "Archived from the original on 2012-09-26.",
            "Retrieved 2013-02-26."
        ],
        [
            "^ http://www.bangkokpost.com/news/asia/313462/tomb-raiders-spoil-philippine-archaeological-find"
        ],
        [
            "^ \"This Webs.com site has not yet been published\"."
        ],
        [
            "^"
        ],
        [
            "\"Mulanay: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 27 January 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Quezon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Mulanay."
        ],
        [
            "Mulanay Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Mulanay"
        ],
        [
            "Catanauan"
        ],
        [
            "Buenavista"
        ],
        [
            "Mongpong Pass"
        ],
        [
            "Mulanay"
        ],
        [
            "San Narciso"
        ],
        [
            "San Francisco"
        ],
        [
            "vte Province of QuezonLucena (capital and largest city)Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Alabat"
        ],
        [
            "Atimonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Calauag"
        ],
        [
            "Candelaria"
        ],
        [
            "Catanauan"
        ],
        [
            "Dolores"
        ],
        [
            "General Luna"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Infanta"
        ],
        [
            "Jomalig"
        ],
        [
            "Lopez"
        ],
        [
            "Lucban"
        ],
        [
            "Macalelon"
        ],
        [
            "Mauban"
        ],
        [
            "Mulanay"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagbilao"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Narciso"
        ],
        [
            "Sariaya"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Tiaong"
        ],
        [
            "Unisan"
        ],
        [
            "Component city"
        ],
        [
            "Tayabas"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Lucena (Administratively independent from the province but grouped under Quezon by the Philippine Statistics Authority.",
            "However, qualified voters of this city are still allowed to participate in the election of provincial officials as part of Quezon’s 2nd Sangguniang Panlalawigan district.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Mulanay&oldid=1227680621\""
        ],
        [
            "Category: Municipalities of QuezonHidden categories: Pages using gadget WikiMiniAtlasAll articles with dead external linksArticles with dead external links from February 2022CS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from April 2021Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}