{
    "name": "Nabas",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Nabas, Aklan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°49′40″N 122°05′38″E﻿ / ﻿11.8278°N 122.0939°E﻿ / 11.8278; 122.0939"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Aklan, Philippines"
        ],
        [
            "Municipality in Western Visayas, PhilippinesNabasMunicipalityMunicipality of NabasBoracay Airport Union Arrival Terminal and Pawa Windfarm"
        ],
        [
            "FlagSealEtymology: NavasNickname: Nature's HavenMotto: Pangibabaw NabasAnthem: Nabas, Banwa KoMap of Aklan with Nabas highlightedOpenStreetMapNabasLocation within the PhilippinesCoordinates: 11°49′40″N 122°05′38″E﻿ / ﻿11.8278°N 122.0939°E﻿ / 11.8278; 122.0939CountryPhilippinesRegionWestern VisayasProvinceAklanDistrict"
        ],
        [
            "2nd districtBarangays20"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMaria Fe Lasaleta • Vice MayorJames V. Solanoy • RepresentativeTeodorico T. Haresco Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Celon T. dela TorreStephen Z. BolivarLeovilyn S. dela TorreCognito D. Palomata Jr.Maria Fe T. LasaletaCiciron Myton C. PalanogJoselito E. SantiagoRhuna F. Tipgos"
        ],
        [
            " • Electorate25,481 voters (2022)Area • Revenue₱ 143.3 million (2020) • Assets₱ 415.8 million (2020) • Expenditure₱ 128.2 million (2020) • Liabilities₱ 158.5 million (2020)Service provider • ElectricityAklan Electric Cooperative (AKELCO)Time zoneUTC+8 (PST)ZIP code5607PSGC060414000IDD : area code +63 (0)36"
        ],
        [
            "Nabas, officially the Municipality of Nabas (Aklanon: Banwa it Nabas; Hiligaynon: Banwa sang Nabas; Tagalog: Bayan ng Nabas), is a 4th class municipality in the province of Aklan, Philippines.",
            "Nabas serves as the arrival gateway of Boracay Airport.",
            "According to the 2020 census, it has a population of 40,632 people, making it the fifth most populous town in Aklan Province.."
        ],
        [
            "The resort island of Boracay is located 2 kilometres (1.2 mi) from the north-westernmost tip of the town."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            "Accounts about the earliest community of Nabas are uncertain but the initial documentation for the town's existence was recorded in 1845.",
            "Facing the Sibuyan Sea, the town started as a small coastal village referred to as Barrio Alimbo which extends to the hills and mountains to the west.",
            "This small community occupies the floodplains of Alimbo River where the village derived its name.",
            "Fishing and farming is the primary source of livelihood, even today except for the hunting which was common on that time because of the abundances of wild pig, monkey and deer in the area."
        ],
        [
            "Before, the town was part of the municipality of Ibajay under the jurisdiction of Capiz Province.",
            "Ibajay's municipal boundary was so vast but with poor road system."
        ],
        [
            "The developing populaces whose tongue and customs diverge from those of the eastern community build awareness amongst people of the west.",
            "The invasion of migrants from the nearby province of Antique continued that further emphasized the difference in dialect and culture to some extent.",
            "In 1853, their notion of a separate municipality for better living and independence serves as the foundation for taking a part of Alimbo together with its adjoining barrios of Nagustan, Panaytayon (Toledo), Gibon, Namao (Rizal), Kabangrosan (Union), and Pakilawa (Unidos) ceased to be a barrio to form a new municipality inevitably."
        ],
        [
            "The municipality was formed in 1854 and named Navas, after Governor Nava of the province of Capiz who came to inspect the area before its creation."
        ],
        [
            "In 1861, the residents of Carabao Island (locally known as Hambil Island) chose to be annexed to the municipality of Navas, Capiz following the abolition of the Pueblo de Cabalian in Tablas Island.",
            "The annexation continued until 1897 when residents of Carabao Island voted to join the municipality of Looc, Romblon."
        ],
        [
            "The Cartilla System, an early teaching methods that dominantly use the letter \"b\" than \"v\" caused the variable spelling of \"Navas\" and \"Nabas\".",
            "In 1906, the Municipal Council in a resolution approved by unanimous vote adopted the name Nabas as the official name."
        ],
        [
            "Recently, Nabas is currently applying for cityhood making it the third in the province after neighboring Malay and the provincial capital Kalibo."
        ],
        [
            "Geography"
        ],
        [
            "Nabas is a strip of land located east of the town of Malay at the north-west tip of Panay Island called Northwest Panay Peninsula.",
            "It bounded on the north by Sibuyan Sea; on the south by Pandan, Antique; east by Ibajay; and west by Malay.",
            "It is 43 kilometres (27 mi) from Kalibo, the provincial capital."
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 96.82 square kilometres (37.38 sq mi)  constituting 5.32% of the 1,821.42-square-kilometre- (703.25 sq mi) total area of Aklan."
        ],
        [
            "Landscape"
        ],
        [
            "The Municipality of Nabas is considered as rolling terrain and rugged terrain land topographic formation.",
            "It has an elongated land area situated along the Northwestern Panay Peninsula, with 21-kilometer coastline facing Sibuyan Sea, and with such a large span of municipal waters, approximately 300 square kilometers."
        ],
        [
            "Unidos Landscape"
        ],
        [
            "This town features natural wonders both on the mountains with its natural cold springs, caves and tiny water falls, and the sea which boast of crystal clear waters, coral reefs, and from grey or white sand to assorted coloured pebbly shores."
        ],
        [
            "Nabas has one of the last remaining low elevation intact rainforest that is home to various endemic flora and fauna."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Nabas"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "79(3.1)"
        ],
        [
            "48(1.9)"
        ],
        [
            "63(2.5)"
        ],
        [
            "52(2.0)"
        ],
        [
            "127(5.0)"
        ],
        [
            "229(9.0)"
        ],
        [
            "239(9.4)"
        ],
        [
            "181(7.1)"
        ],
        [
            "204(8.0)"
        ],
        [
            "283(11.1)"
        ],
        [
            "245(9.6)"
        ],
        [
            "187(7.4)"
        ],
        [
            "1,937(76.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "15"
        ],
        [
            "11"
        ],
        [
            "9"
        ],
        [
            "6"
        ],
        [
            "11"
        ],
        [
            "18"
        ],
        [
            "20"
        ],
        [
            "18"
        ],
        [
            "18"
        ],
        [
            "21"
        ],
        [
            "19"
        ],
        [
            "20"
        ],
        [
            "186"
        ],
        [
            "Source: World Weather Online (calculated/modeled data, not measured locally)"
        ],
        [
            "Barangays"
        ],
        [
            "Nabas is politically subdivided into 20 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "There are 11 barangays which considered coastal and the rest of which are landlocked barangays.",
            "Twelve of these 20 barangays are located along the highway."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 060414001   Alimbo-Baybay"
        ],
        [
            " 3.3%"
        ],
        [
            " 1,356"
        ],
        [
            " 1,020"
        ],
        [
            "  ▴"
        ],
        [
            " 2.89%"
        ],
        [
            " 060414003   Buenafortuna"
        ],
        [
            " 3.1%"
        ],
        [
            " 1,262"
        ],
        [
            " 1,107"
        ],
        [
            "  ▴"
        ],
        [
            " 1.32%"
        ],
        [
            " 060414002   Buenasuerte"
        ],
        [
            " 4.9%"
        ],
        [
            " 2,009"
        ],
        [
            " 1,603"
        ],
        [
            "  ▴"
        ],
        [
            " 2.28%"
        ],
        [
            " 060414004   Buenavista"
        ],
        [
            " 3.7%"
        ],
        [
            " 1,491"
        ],
        [
            " 1,434"
        ],
        [
            "  ▴"
        ],
        [
            " 0.39%"
        ],
        [
            " 060414005   Gibon"
        ],
        [
            " 8.0%"
        ],
        [
            " 3,239"
        ],
        [
            " 2,887"
        ],
        [
            "  ▴"
        ],
        [
            " 1.16%"
        ],
        [
            " 060414006   Habana"
        ],
        [
            " 3.2%"
        ],
        [
            " 1,313"
        ],
        [
            " 1,096"
        ],
        [
            "  ▴"
        ],
        [
            " 1.82%"
        ],
        [
            " 060414007   Laserna"
        ],
        [
            " 7.3%"
        ],
        [
            " 2,950"
        ],
        [
            " 2,497"
        ],
        [
            "  ▴"
        ],
        [
            " 1.68%"
        ],
        [
            " 060414008   Libertad"
        ],
        [
            " 4.1%"
        ],
        [
            " 1,653"
        ],
        [
            " 1,263"
        ],
        [
            "  ▴"
        ],
        [
            " 2.73%"
        ],
        [
            " 060414009   Magallanes"
        ],
        [
            " 2.2%"
        ],
        [
            " 885"
        ],
        [
            " 680"
        ],
        [
            "  ▴"
        ],
        [
            " 2.67%"
        ],
        [
            " 060414010   Matabana"
        ],
        [
            " 2.1%"
        ],
        [
            " 854"
        ],
        [
            " 642"
        ],
        [
            "  ▴"
        ],
        [
            " 2.89%"
        ],
        [
            " 060414012   Nagustan"
        ],
        [
            " 8.1%"
        ],
        [
            " 3,307"
        ],
        [
            " 2,937"
        ],
        [
            "  ▴"
        ],
        [
            " 1.19%"
        ],
        [
            " 060414013   Pawa"
        ],
        [
            " 0.8%"
        ],
        [
            " 309"
        ],
        [
            " 208"
        ],
        [
            "  ▴"
        ],
        [
            " 4.04%"
        ],
        [
            " 060414014   Pinatuad"
        ],
        [
            " 1.8%"
        ],
        [
            " 736"
        ],
        [
            " 729"
        ],
        [
            "  ▴"
        ],
        [
            " 0.10%"
        ],
        [
            " 060414015  Poblacion"
        ],
        [
            " 5.2%"
        ],
        [
            " 2,115"
        ],
        [
            " 1,897"
        ],
        [
            "  ▴"
        ],
        [
            " 1.09%"
        ],
        [
            " 060414016   Rizal"
        ],
        [
            " 3.7%"
        ],
        [
            " 1,489"
        ],
        [
            " 1,291"
        ],
        [
            "  ▴"
        ],
        [
            " 1.44%"
        ],
        [
            " 060414017   Solido"
        ],
        [
            " 4.6%"
        ],
        [
            " 1,855"
        ],
        [
            " 1,757"
        ],
        [
            "  ▴"
        ],
        [
            " 0.54%"
        ],
        [
            " 060414018   Tagororoc"
        ],
        [
            " 2.7%"
        ],
        [
            " 1,091"
        ],
        [
            " 846"
        ],
        [
            "  ▴"
        ],
        [
            " 2.58%"
        ],
        [
            " 060414019   Toledo"
        ],
        [
            " 6.4%"
        ],
        [
            " 2,608"
        ],
        [
            " 2,222"
        ],
        [
            "  ▴"
        ],
        [
            " 1.61%"
        ],
        [
            " 060414020   Unidos"
        ],
        [
            " 7.5%"
        ],
        [
            " 3,066"
        ],
        [
            " 2,344"
        ],
        [
            "  ▴"
        ],
        [
            " 2.72%"
        ],
        [
            " 060414021   Union"
        ],
        [
            " 7.0%"
        ],
        [
            " 2,847"
        ],
        [
            " 2,592"
        ],
        [
            "  ▴"
        ],
        [
            " 0.94%"
        ],
        [
            "Total"
        ],
        [
            "40,632"
        ],
        [
            "31,052"
        ],
        [
            " ▴"
        ],
        [
            "2.72%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of NabasYearPop.±% p.a.1903 6,455—    1918 7,355+0.87%1939 9,768+1.36%1948 10,442+0.74%1960 11,879+1.08%1970 13,850+1.55%1975 15,051+1.68%1980 16,607+1.99%1990 20,538+2.15%1995 21,391+0.77%2000 25,014+3.41%2007 28,345+1.74%2010 31,052+3.38%2015 36,435+3.09%2020 40,632+2.17%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Nabas has grown dramatically for the past decade.",
            "It holds the record of fastest growing population in the whole province of Aklan covering 2011–2015, and third fastest growing population covering 2016-2020."
        ],
        [
            "The Municipality of Nabas was  among the fastest growing town having a population growth rate almost three times the rate of the provincial and regional levels.",
            "The rapid increase in the population growth could be attributed to in-migration due to its developing tourism industry."
        ],
        [
            "Language"
        ],
        [
            "The residents of Nabas speaks Nabasnon, a variant of Karay-a and quite similar to Onhan Language of the islands of Hambil and Southern Tablas in Romblon Province.",
            "The eastern half of the municipality has the accent influenced and similar to Karay-a, spoken by the neighboring Antiqueños particularly the people from the towns Libertad, Pandan, and Sebaste of Antique.",
            "Those in the western half speak similar to the dialect currently regarded as Malaynon with softer intonation.",
            "Aklanon, Hiligaynon, and Tagalog are also widely used."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Nabas"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  36.60"
        ],
        [
            "2009  36.85"
        ],
        [
            "2012  25.43"
        ],
        [
            "2015  25.11"
        ],
        [
            "2018  16.90"
        ],
        [
            "2021  20.89"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Nabas, a 4th class municipality, is noted for its hat and mat industry made of indigenous bariw leaves which abound on the hillsides and plain lowlands of the town.",
            "It is likewise a farming and fishing community with its vast lowlands and long shoreline.",
            "While the cost of marine commodity has soared due to the proximity of Nabas to Boracay Island, the fishermen remained impoverished."
        ],
        [
            "One of the most imposing presence in Nabas is PetroWind Energy Inc. 36-megawatt wind farm in Brgy Pawa.",
            "An array of gigantic wind turbines lined-up along a mountain ridge aimed to spur tourism and add livelihood in the area is the biggest single venture in the province of Aklan."
        ],
        [
            "The town serves as a satellite area for the expansion of tourism from the traditional town of Malay to expand and stretch developments to Nabas."
        ],
        [
            "Culture and Festivals"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            "Nabas is predominantly Roman Catholic.",
            "Various religious festivity is being celebrated throughout the year in different villages and in the town as a whole."
        ],
        [
            "The Nabas Bariw Festival is celebrated to commemorate the feast day of Saint Isidore the Farmer, which is chosen as the town's patron saint for the town being originally agricultural.",
            "It is celebrated annually from May 12 to 15.",
            "This celebration showcases the town's hat, mat and other bariw products as well as the town's unique tourism sites and natural attractions.",
            "During this affair, various skills in mat, hat and bag making and designing are demonstrated.",
            "Among the events is a contest to produce the biggest hat and mat contest.",
            "The festival is highlighted by continuous street dancing by folks from the town's 20 barangays dressed in colorful bariw costumes accompanied by indigenous bamboo instruments."
        ],
        [
            "The Nabas Municipal and Religious Fiesta is celebrated annually to commemorate the feast of Nuestra Señora de Salvacion every September 24.",
            "The feast honors the Patron Saint of Our Lady Of Salvation after the town is spared from the Japanese fatal ruthlessness during the World War II."
        ],
        [
            "The Ati-Atihan Festival is also celebrated in Nagustan every February."
        ],
        [
            "The San Juan Fiesta is celebrated along the coastal communities every June 24.",
            "Beach side tent parties are being held by families joining the event.",
            "Boat racing, swimming, and fluvial parades are among the highlights of the fair."
        ],
        [
            "The Pailaw sa Nabas is a music and light festival held every last quarter of November or 1st quarter of December to mark the start of yuletide season in the town.",
            "The opening of lights, musical performances, live bands, and firework display are the highlights of the event."
        ],
        [
            "Gallery"
        ],
        [
            "Union Seascape"
        ],
        [
            "Gibon Seascape"
        ],
        [
            "Unidos Landscape"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Nabas |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Aklan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Gibon, Philippines: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 24 January 2015."
        ],
        [
            "^ \"Municipal: Nabas, Aklan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Aklan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Nabas, Aklan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Official website"
        ],
        [
            "Places adjacent to Nabas, Aklan"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "Malay"
        ],
        [
            "Nabas"
        ],
        [
            "Ibajay"
        ],
        [
            "Pandan, Antique"
        ],
        [
            "vte Province of AklanKalibo (capital and largest municipality)Municipalities"
        ],
        [
            "Altavas"
        ],
        [
            "Balete"
        ],
        [
            "Banga"
        ],
        [
            "Batan"
        ],
        [
            "Buruanga"
        ],
        [
            "Ibajay"
        ],
        [
            "Kalibo"
        ],
        [
            "Lezo"
        ],
        [
            "Libacao"
        ],
        [
            "Madalag"
        ],
        [
            "Makato"
        ],
        [
            "Malay"
        ],
        [
            "Malinao"
        ],
        [
            "Nabas"
        ],
        [
            "New Washington"
        ],
        [
            "Numancia"
        ],
        [
            "Tangalan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Nabas,_Aklan&oldid=1214861172\""
        ],
        [
            "Category: Municipalities of AklanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataPages using infobox settlement with unknown parametersArticles containing Tagalog-language textArticles needing additional references from October 2016All articles needing additional referencesCommons category link from WikidataOfficial website not in WikidataAll articles with dead external linksArticles with dead external links from June 2020Pages using the Kartographer extension"
        ]
    ]
}