{
    "name": "Naga",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "31 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançais한국어Bahasa HulontaloIlokanoBahasa IndonesiaItalianoעבריתKapampanganქართულიLatviešuBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsSimple EnglishSvenskaTagalogТатарча / tatarçaاردوWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°37′28″N 123°11′11″E﻿ / ﻿13.6244°N 123.1864°E﻿ / 13.6244; 123.1864"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Independent component city in Camarines Sur, Philippines"
        ],
        [
            "Independent component city in Bicol Region, PhilippinesNagaIndependent component cityCity of Naga(From top, left to right) Universidad de Santa Isabel, Holy Rosary Seminary, Ateneo de Naga University, Our Lady of Peñafrancia, Naga Metropolitan Cathedral, Naga City Hall, Malabsay Falls, Our Lady of Peñafrancia Shrine, Peñafrancia Festival, Carmelite Monastery"
        ],
        [
            "FlagSealNicknames: Queen City of BicolThe Heart of BicolAn Maogmang Lugar (The Happy Place)Pilgrim City of NagaOne of the Seven Golden Cities of the SunMotto(s): Naga Na, Uswag Pa!",
            "(Naga Now, Prosper More!",
            ")Anthem: Heart of Bicol MarchMap of Camarines Sur with Naga highlightedOpenStreetMapNagaLocation within the PhilippinesCoordinates: 13°37′28″N 123°11′11″E﻿ / ﻿13.6244°N 123.1864°E﻿ / 13.6244; 123.1864CountryPhilippinesRegionBicol RegionProvinceCamarines Sur (geographically only)District"
        ],
        [
            "3rd districtFounded (as Ciudad de Nueva Caceres)1575Royal City-Charter1595Renamed as Naga1919CityhoodJune 18, 1948Founded byCapt.",
            "Pedro de ChavezBarangays27"
        ],
        [
            "  (see Barangays)Government • RepresentativeGabriel H. Bordado Jr. • City Council"
        ],
        [
            "Members"
        ],
        [
            "Jessie R. AlbeusJoselito S. del RosarioGhiel G. RosalesMelvin Ramon G. BuenafeGilda Gayle A. GomezVidal P. CastilloJose C. RañolaJose B. PerezSalvador M. del CastilloAntonio B. Beltran"
        ],
        [
            " • Electorate117,481 voters (2022)Area • Revenue₱ 1,362 million (2020) • Assets₱ 5,536 million (2020) • Expenditure₱ 1,294 million (2020) • Liabilities₱ 718.8 million (2020)Service provider • ElectricityCamarines Sur 2 Electric Cooperative  (CASURECO 2)Time zoneUTC+8 (PST)ZIP code4400PSGC051724000IDD : area code +63 (0)54Native languagesCentral BikolTagalogFeast dateThird Saturday and Third Sunday of SeptemberCatholic dioceseArchdiocese of CaceresPatron saintOur Lady of PeñafranciaWebsitenaga.gov.ph"
        ],
        [
            "Naga, officially the City of Naga (Central Bikol: Syudad nin Naga; Rinconada Bikol: Syudad ka Naga; Filipino: Lungsod ng Naga; Spanish: Ciudad de Nueva Cáceres), or the Pilgrim City of Naga, is a 1st class independent component city in the Bicol Region of the Philippines.",
            "According to the 2020 census, it has a population of 209,170 people."
        ],
        [
            "The town was established in 1575 by order of Spanish Governor-General Francisco de Sande.",
            "The city, then named Ciudad de Nueva Cáceres (New Cáceres City), was one of the Spanish royal cities in the Spanish East Indies, along with Manila, Cebu, and Iloilo, the third oldest to be exact."
        ],
        [
            "Geographically and statistically classified, as well as legislatively represented within Camarines Sur, but administratively independent of the provincial government, Naga is considered by some sources to be the Bicol Region's trade,"
        ],
        [
            "Naga is known as the \"Queen City of Bicol\" due to the historical significance of Naga in the Bicol Region;"
        ],
        [
            "It is one of the two Philippine cities named Naga, the other being Naga, Cebu in Visayas."
        ],
        [
            "Etymology"
        ],
        [
            "Lignum nephriticum cup made of narra wood (the namesake of the province) produced opalescent colors when water is poured into it.",
            "These wooden cups were a major pre-colonial and colonial industry of Naga."
        ],
        [
            "Naga is the native pre-colonial name of the city.",
            "It is named after the narra tree (Pterocarpus indicus), which is known as naga in the Bikol language.",
            "It was abundant in the region and was part of a pre-colonial industry of wooden cups and bowls made from narra that produced distinctive blue and yellow opalescent colors when water is poured into them (later known to Europeans as lignum nephriticum).",
            "During the Spanish colonial era, they were exported to Mexico as luxury goods for their purported diuretic properties via the Manila-Acapulco Galleons, and from there, to Europe.",
            "They were often presented as gifts to European nobility."
        ],
        [
            "The Jesuit missionary and historian Juan José Delgado (1697-1755) describes the industry in the following:"
        ],
        [
            "\"The city called Nueva Cáceres by the Spaniards bears among the natives the name Naga, on account of the abundance of this tree throughout those provinces of Camarines and Albay, where they carve very curious cups out of it for drinking water.",
            "Those made of female naga (pale white wood) are much the better, for this wood tinges the water very quickly to a celestial color, more quickly than the male (reddish wood).",
            "These cups are much esteemed in Europe and are regarded as a gift well worthy of any prince.",
            "Out of one of these cups they made me drink when I was a child, in Cadiz (Spain), as a remedy for hydropsy and oppilation, and I think that it might have helped me had I not drunk too much.",
            "\"— Juan José Delgado, Biblioteca Histórica Filipina: Historia general sacro-profana, política y natural de las islas del poniente llamadas Filipinas (1751),"
        ],
        [
            "History"
        ],
        [
            "Precolonial era"
        ],
        [
            "The Bicolandia was closely allied with the Kedatuan of Madja-as Confederation, which was located southeast on Panay Island.",
            "According to the epic Maragtas, two datus and their followers, who followed Datu Puti, arrived at Taal Lake, with one group later settling around Laguna de Bay, and another group pushing southward into the Bicol Peninsula, placing the Bicolanos between people from Luzon and people from the Visayas.",
            "An ancient tomb preserved among the Bicolanos, discovered and examined by anthropologists during the 1920s, refers to some of the same deities and personages mentioned in the Maragtas."
        ],
        [
            "Spanish colonial period"
        ],
        [
            "Main article: Nueva Cáceres"
        ],
        [
            "Visit of Gov.-Gen Narciso Claveria y Zaldua at Nueva Caceres in Feb 16, 1845.",
            "Painting by Honorato Lozano"
        ],
        [
            "In 1573, on his second expedition to this region, the conquistador Juan de Salcedo landed in a settlement named Naga in the native languages, because of the abundance of narra trees (naga in Bikol)."
        ],
        [
            "In 1575, Captain Pedro de Chávez, the commander of the garrison left behind by Salcedo, founded on the site of the present business centre (across the river from the original Naga) a Spanish city which he named La Ciudad de Cáceres, in honor of Francisco de Sande, the Governor-General and a native of Cáceres in Spain.",
            "Nueva Caceres, had 30 Spanish Households then."
        ],
        [
            "It was by this name of \"Nueva Caceres\" that it was identified in the papal bull of August 14, 1595, which established the see of Cáceres, together with Cebú and Nueva Segovia, and made it the seat of the new bishopric subject to the Archdiocese of Manila.",
            "Nueva Caceres was settled by around 100 Spaniards from Europe and reinforced by migrations from Mexico."
        ],
        [
            "In time, the Spanish city and the native village merged into one community and became popularly known as \"Nueva Cáceres\", to distinguish it from its namesake in Spain.",
            "It had a city government as prescribed by Spanish law, with an ayuntamiento and cabildo of its own.",
            "At the beginning of the 17th century, there were only five other ciudades in the Philippines.",
            "Nueva Cáceres remained the capital of the Ambos Camarines provinces and later of Camarines Sur province until the formal creation of the independent chartered city of Naga under a sovereign Philippines."
        ],
        [
            "For hundreds of years during the Spanish colonial era, Naga grew to become the center of trade, education, and culture, and the seat of ecclesiastical jurisdiction in Bicol."
        ],
        [
            "Liberation (1898)"
        ],
        [
            "Under the commands of Corporals Elias Angeles and Felix Plazo, revolutionaries planned a revolt against the Spanish on September 18, 1898.",
            "Gunfire rang out until 5 AM in the morning, and the remaining Spaniards sought shelter at the convent of San Francisco Church.",
            "When the Spaniards could no longer withstand the pressure, they signed a peace treaty at the University of Sta.",
            "Isabel, a school.",
            "The aforementioned \"peace treaty\" is displayed at the USI Museum."
        ],
        [
            " A display at Museo Historico de Universidad de Sta.",
            "Isabel depicting Elias Angeles and Felix Plazo, two Bicolano revolutionaries during the Spanish period."
        ],
        [
            "This revolt marked a turning point in Naga City's history, bringing an end to over 323 years of Spanish rule since the founding of Nueva Cáceres.",
            "A city ordinance, passed by the Naga City Government, designates September 19th as Liberation Day in the City of Naga.",
            "This is ordinance number 2006-050.",
            "The ordinance also outlines activities for commemorating Liberation Day and allocates funds to support them."
        ],
        [
            "American colonial period"
        ],
        [
            "Naga, Camarines Sur (1935)"
        ],
        [
            "With the advent of American rule, the city was reduced to a municipality.",
            "In 1919, it lost its Spanish name and became officially known as Naga."
        ],
        [
            "World War II and Japanese occupation"
        ],
        [
            "Naga came under Japanese occupation on December 18, 1941, following the Japanese invasion of Legaspi a few days earlier."
        ],
        [
            "In 1945, toward the end of World War II, combined U.S. and Philippine Commonwealth troops—of the United States Army, Philippine Commonwealth Army, Philippine Constabulary, as well as Bicolano guerrilla resistance groups—liberated Naga from Imperial Japanese troops."
        ],
        [
            "Independent Philippines"
        ],
        [
            "After Naga was liberated from the Japanese, Naga began rebuilding.",
            "Having suffered only a few casualties, Naga was able to rebuild quickly after the war."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "After many petitions, Naga became a city on June 18, 1948, when it acquired its present city charter; and its city government was inaugurated on December 15 of the same year by virtue of Republic Act No.",
            "305."
        ],
        [
            "Geography"
        ],
        [
            "Naga is located within the province of Camarines Sur at the southeastern part of Luzon, 15 kilometres (9.3 mi) from Pili and 435 kilometres (270 mi) southeast of Manila, the nation's capital, and near the center of the Bicol Region."
        ],
        [
            "It is surrounded on all sides by forests and by rich agricultural and fishing areas.",
            "It has an area of 84.48 km2 and is located on the serpentine and historic Naga River, at the confluence of the Naga and Bikol rivers.",
            "Thus, it has always been an ideal place for trade, and as center for schools, church, and government offices.",
            "Included in its territory is Mount Isarog, a declared protected area known as Mount Isarog Natural Park covering 10,090.89 hectares."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Naga"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "34.3(93.7)"
        ],
        [
            "34.2(93.6)"
        ],
        [
            "32.4(90.3)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "31.2(88.2)"
        ],
        [
            "31.0(87.8)"
        ],
        [
            "30.3(86.5)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "26.1(79.0)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "29.1(84.4)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "28.4(83.1)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "27.4(81.3)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.3(81.1)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "26.0(78.8)"
        ],
        [
            "27.4(81.4)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20.9(69.6)"
        ],
        [
            "21.1(70.0)"
        ],
        [
            "22.5(72.5)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "24.8(76.6)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "22.8(73.0)"
        ],
        [
            "21.6(70.9)"
        ],
        [
            "23.1(73.6)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "6.3(0.25)"
        ],
        [
            "3.3(0.13)"
        ],
        [
            "7.1(0.28)"
        ],
        [
            "9.3(0.37)"
        ],
        [
            "100.4(3.95)"
        ],
        [
            "272.7(10.74)"
        ],
        [
            "341.2(13.43)"
        ],
        [
            "398.3(15.68)"
        ],
        [
            "326.0(12.83)"
        ],
        [
            "230.0(9.06)"
        ],
        [
            "120.4(4.74)"
        ],
        [
            "48.8(1.92)"
        ],
        [
            "1,863.8(73.38)"
        ],
        [
            "Average rainy days"
        ],
        [
            "1.0"
        ],
        [
            "1.0"
        ],
        [
            "1.0"
        ],
        [
            "1.0"
        ],
        [
            "7.0"
        ],
        [
            "14.0"
        ],
        [
            "16.0"
        ],
        [
            "19.0"
        ],
        [
            "17.0"
        ],
        [
            "13.0"
        ],
        [
            "9.0"
        ],
        [
            "5.0"
        ],
        [
            "104"
        ],
        [
            "According to the Köppen climate classification system, Naga has a tropical savanna climate."
        ],
        [
            "The weather in the city from March to May is hot and dry, with temperatures ranging from 24 to 34 °C (75 to 93 °F).",
            "The typhoon season is from June to October, and the weather then is generally rainy.",
            "From November to February, the climate is cooler with temperatures ranging from 22 to 28 °C (72 to 82 °F).",
            "The average year-round humidity is 77%."
        ],
        [
            "Barangays"
        ],
        [
            "Naga is politically subdivided into 27 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Political subdivisions of Naga"
        ],
        [
            "Barangays"
        ],
        [
            "Class"
        ],
        [
            "Population"
        ],
        [
            "Barangay head"
        ],
        [
            "Abella"
        ],
        [
            "Urban"
        ],
        [
            "5,757"
        ],
        [
            "Manuel Antonio Berja"
        ],
        [
            "Bagumbayan Norte"
        ],
        [
            "Urban"
        ],
        [
            "2,203"
        ],
        [
            "Antonio B. Beltran"
        ],
        [
            "Bagumbayan Sur"
        ],
        [
            "Urban"
        ],
        [
            "7,867"
        ],
        [
            "Jorge I. Salva Jr."
        ],
        [
            "Balatas"
        ],
        [
            "Urban"
        ],
        [
            "11,112"
        ],
        [
            "Pedro San Juan Jr."
        ],
        [
            "Calauag"
        ],
        [
            "Urban"
        ],
        [
            "11,295"
        ],
        [
            "Ma.",
            "Corazon M. Peñaflor"
        ],
        [
            "Cararayan"
        ],
        [
            "Urban"
        ],
        [
            "19,692"
        ],
        [
            "Rodrigo B. Agravante Jr."
        ],
        [
            "Carolina"
        ],
        [
            "Urban"
        ],
        [
            "6,870"
        ],
        [
            "Eufresenia E. Manguiat"
        ],
        [
            "Concepcion Grande"
        ],
        [
            "Urban"
        ],
        [
            "11,125"
        ],
        [
            "Michael G. Oliva"
        ],
        [
            "Concepcion Pequeña"
        ],
        [
            "Urban"
        ],
        [
            "25,139"
        ],
        [
            "Jewelin G. Regmalos"
        ],
        [
            "Dayangdang"
        ],
        [
            "Urban"
        ],
        [
            "4,130"
        ],
        [
            "Julius Cesar B. Sanchez"
        ],
        [
            "Del Rosario"
        ],
        [
            "Urban"
        ],
        [
            "10,337"
        ],
        [
            "Jose T. Peñas"
        ],
        [
            "Dinaga"
        ],
        [
            "Urban"
        ],
        [
            "344"
        ],
        [
            "Doris Dianne G. Lee"
        ],
        [
            "Igualdad Interior"
        ],
        [
            "Urban"
        ],
        [
            "3,008"
        ],
        [
            "Antonio F. Galido"
        ],
        [
            "Lerma"
        ],
        [
            "Urban"
        ],
        [
            "1,640"
        ],
        [
            "Domingo R. Serrado"
        ],
        [
            "Liboton"
        ],
        [
            "Urban"
        ],
        [
            "3,105"
        ],
        [
            "Ronald M. Luntok"
        ],
        [
            "Mabolo"
        ],
        [
            "Urban"
        ],
        [
            "8,125"
        ],
        [
            "Ramil G. Job"
        ],
        [
            "Pacol"
        ],
        [
            "Urban"
        ],
        [
            "14,747"
        ],
        [
            "Josue P. Perez"
        ],
        [
            "Panicuason"
        ],
        [
            "Urban"
        ],
        [
            "3,100"
        ],
        [
            "Domingo L. Ramos"
        ],
        [
            "Peñafrancia"
        ],
        [
            "Urban"
        ],
        [
            "4,503"
        ],
        [
            "Ricardo P. Sierra Jr."
        ],
        [
            "Sabang"
        ],
        [
            "Urban"
        ],
        [
            "6,838"
        ],
        [
            "Cyrus L. Caballero"
        ],
        [
            "San Felipe"
        ],
        [
            "Urban"
        ],
        [
            "21,098"
        ],
        [
            "Alfonso R. Rodriguez"
        ],
        [
            "San Francisco"
        ],
        [
            "Urban"
        ],
        [
            "722"
        ],
        [
            "Efren C. Nepomuceno"
        ],
        [
            "San Isidro"
        ],
        [
            "Urban"
        ],
        [
            "3,432"
        ],
        [
            "Veronica C. Panganiban"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Urban"
        ],
        [
            "7,135"
        ],
        [
            "Lorenzo D. Narvaez"
        ],
        [
            "Tabuco"
        ],
        [
            "Urban"
        ],
        [
            "4,240"
        ],
        [
            "Marcelo R. Bagadiong"
        ],
        [
            "Tinago"
        ],
        [
            "Urban"
        ],
        [
            "2,904"
        ],
        [
            "Estelita N. Bautista"
        ],
        [
            "Triangulo"
        ],
        [
            "Urban"
        ],
        [
            "8,702"
        ],
        [
            "Allan D. Beriso"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of NagaYearPop.±% p.a.1903 17,943—    1918 9,396−4.22%1939 22,505+4.25%1948 56,238+10.71%1960 55,506−0.11%YearPop.±% p.a.1970 79,846+3.70%1975 83,337+0.86%1980 90,712+1.71%1990 115,329+2.43%1995 126,972+1.82%YearPop.±% p.a.2000 137,810+1.77%2007 160,516+2.13%2010 174,931+3.18%2015 196,003+2.19%2020 209,170+1.29%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2020 census, the population of Naga is 209,170 people, with a density of 2,300/km2.",
            "Naga had an average annual population growth of 1.29% between 2010 and 2020 according to same census.",
            "All populated areas of the city are classified as urban.",
            "Naga City has about the same population as Legazpi City (209,533)."
        ],
        [
            "Religion"
        ],
        [
            "Roman Catholicism"
        ],
        [
            "Minor Basilica of Our Lady of Peñafrancia"
        ],
        [
            "The city is the ecclesiastical seat of the Archdiocese of Caceres, which oversees the Catholic population in the Bicol Region, whose archbishop is the primate of the region.",
            "This dominant faith is supported by the presence of old and influential Catholic institutions, from universities to churches run by different religious institutes, notably the Ateneo de Naga University by the Jesuits; the Universidad de Santa Isabel by the Daughters of Charity; the Naga Metropolitan Cathedral, which is the oldest cathedral that is still standing in Luzon outside Metro Manila; Peñafrancia Basilica Minore, which is the largest Catholic structure in southern Luzon in terms of size and land area; Our Lady of Peñafrancia Shrine; the historic San Francisco Church; and Peñafrancia Museum."
        ],
        [
            "Other Christian faiths"
        ],
        [
            "Protestant denominations in the city include Seventh-day Adventists and Bible Baptists, whose churches are located along Magsaysay Avenue, while other Protestants attend the Methodist Church which is among the old structures along Peñafrancia Avenue."
        ],
        [
            "The Assemblies of God maintains a fast-growing ministry in Naga.",
            "Aside from Naga Bethel Church (formerly Naga Bethel Temple), which is located on Felix Plazo Street, other local congregations are Philippians Christian Fellowship (in barangays San Felipe), Gethsemane Christian Ministries (in Carolina), and outreach ministries in other barangays."
        ],
        [
            "The largest minority religion in Naga is Iglesia ni Cristo (INC).",
            "INC has several chapels in different barangays in the city, and the local congregation is the largest in the district.",
            "It is followed by The Church of Jesus Christ of Latter-day Saints (formerly known as \"Mormon\") which has several congregations (wards) with their main church building situated along Panganiban Drive not far from the INC's."
        ],
        [
            "There is also a concentration of Jesus Miracle Crusade ministries in the city."
        ],
        [
            "Other religions"
        ],
        [
            "Taoist Temple along Naga river"
        ],
        [
            "Muslims, Sikhs, and Taoists can also be found in the city."
        ],
        [
            "Language"
        ],
        [
            "The Coastal Bikol-Central dialect of the Coastal Bikol language is the dominant dialect spoken by the population in Naga.",
            "The majority of the city's population can understand and speak English, Filipino, and Tagalog.",
            "Because of the influx of people from the Rinconada area that are studying in different universities, Rinconada Bikol can also be heard in different schools and throughout the city.",
            "Some Nagueños have varying degrees of proficiency with Rinconada Bikol, due to the fact that the southern half of Pili, which is the boundary between Rinconada Bikol and Coastal Bikol speakers, is just few kilometers away from Naga.",
            "Although the main language is Bikol, and the medium of instruction in school is English, people in Naga usually tell time and count in Spanish."
        ],
        [
            "Isarog Agta Language"
        ],
        [
            "In 2010, UNESCO released its 3rd volume of Atlas of the World's Languages in Danger, where three critically endangered languages were in the Philippines.",
            "One of these is the Isarog Agta language, of the Isarog Agta people, who live on Mount Isarog and are one of the original Negrito settlers in the Philippines, belonging to the Aeta people classification but with language and belief systems unique to their own culture and heritage."
        ],
        [
            "Only five Isarog Agta spoke their indigenous language in the year 2000.",
            "The language was classified as \"Critically Endangered\", meaning the youngest speakers are grandparents and older, speak the language partially and infrequently, and hardly pass the language to their children and grandchildren.",
            "If the remaining 150 Isarog Agta do not pass their native language to the next generation, it will be extinct within one to two decades."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Naga"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  16.60"
        ],
        [
            "2009  24.39"
        ],
        [
            "2012  15.69"
        ],
        [
            "2015  19.29"
        ],
        [
            "2018  9.12"
        ],
        [
            "2021  21.37"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Central Business District 2"
        ],
        [
            "Naga is the Bicol Region's center of commerce and industry.",
            "Strategically located at the heart of Bicol, Naga is the trade center in Bicol for goods from Visayas and Manila.",
            "Naga is cited as one of the \"Most Business-Friendly Cities in Asia\", is considered to be one of the Philippines's Top-10 cities, and is the No.",
            "1 competitive independent component city (2022) of the Philippines."
        ],
        [
            "The city's economy was impacted really hard by the pandemic during mid 2020 and was estimated that its assets contracted by 4% and a lot of small businesses closed.",
            "In the Q2 of 2021 following the 11-12% quarterly growth of the country, a lot of businesses in the city proper reopened while some didn't.",
            "Currently the city is experiencing rapid economic recovery and is forecasted to surpass Legazpi again by 2024."
        ],
        [
            "Business districts"
        ],
        [
            "Panganiban Drive"
        ],
        [
            "Downtown Naga is located in the southern part of the city.",
            "It is bordered on the north by the Naga University Belt and on the south by the historical Naga City Peoples Mall or simply Naga City Community Supermarket.",
            "It encompasses the three plazas of Naga: The Plaza Quince Martires, The Plaza Quezon, and the Plaza Rizal, which is the center of Central Business District 1 (CBD-1).",
            "Downtown Naga is the location of local businesses that sell local delicacies and native products from neighboring municipalities and provinces."
        ],
        [
            "A second business district, known as the Central Business District 2 (CBD-2), is located along Panganiban Drive and Roxas, Ninoy, and Cory avenues.",
            "It is also the location of 3 shopping complexes, a bus terminal,"
        ],
        [
            "South Riverfront growth area"
        ],
        [
            "South Riverfront is composed of the whole of Barangay Sabang except those areas that are socialized housing sites or are otherwise excluded by the Naga City land-use plan for commercial or industrial development.",
            "It is bordered by CBD-1 (to the east), the Naga River, and the town of Camaligan, Camarines Sur."
        ],
        [
            "Magsaysay district"
        ],
        [
            "Naga City-Magsaysay skyline."
        ],
        [
            "The main road in the city is Magsaysay Avenue, or Boulevard, which runs from Bagumbayan Road (Naga-Calabanga–Siruma–Garchitorena–Partido North Road), connecting it to Magsaysay district, where accommodations and restaurants catering to travelers are found.",
            "Businesses are open until late at night, with some shops open 24/7.",
            "Naga also has its share of fastfood restaurant chains.",
            "The city hall and several provincial offices are also located in the district, around the Peñafrancia Basilica."
        ],
        [
            "Banking and finance"
        ],
        [
            "Bangko Sentral ng Pilipinas (Central Bank of the Philippines) Naga Office, handling Clearing house and Gold trade."
        ],
        [
            "In 2017, the banks in the city numbered around 66, excluding Bangko Sentral ng Pilipinas.",
            "The city hosts the regional bank offices of Banco de Oro, Philippine National Bank, Development Bank of the Philippines, Metrobank, RCBC, Allied Bank, China Banking Corporation, Philtrust Bank, UnionBank of the Philippines, Philippine Veterans Bank, Asia United Bank, Maybank, Bank of Commerce, East West Bank, Bank of Makati, Bank of the Philippine Islands, and the Philippine Postal Savings Bank.",
            "Other government banks include Landbank of the Philippines and Development Bank of the Philippines."
        ],
        [
            "Shopping malls and Hotels"
        ],
        [
            "SM City Naga"
        ],
        [
            "SM City Naga is one of the largest and most-visited shopping malls in the Bicol Region.",
            "Robinsons Place Naga opened in 2017.",
            "Nagaland E-Mall is in Downtown Naga.",
            "LCC Central Mall Naga is located on Felix Plazo Street.",
            "Gaisano Mall Naga is near the Bicol Medical Center.",
            "The Vista Mall is located along Maharlika Highway, in Barangay Del Rosario.",
            "Avenue Square is the region's first \"lifestyle center\", built in 2005 along Magsaysay Avenue.",
            "There are also leisure hubs in the city, the majority along Magsaysay Avenue, Dayangdang and along Diversion Road.",
            "There are around sixty (60) hotels and inns within the city proper, having two 4-star hotels which is Avenue Plaza Hotel and Summit Hotel Naga and ten (10) 3-star hotels."
        ],
        [
            "IT–Business Process outsourcing"
        ],
        [
            "Naga City Technology Park"
        ],
        [
            "Naga was cited as one of the best places to conduct information technology–business process outsourcing (IT–BPO) activities in the Philippines."
        ],
        [
            "The city currently has three IT parks—Naga City IT Park, Camarines Sur Industrial and Technological Park, and Naga City Technology Center."
        ],
        [
            "IBM leased their own client innovation center in front of SM City Naga."
        ],
        [
            "Culture"
        ],
        [
            "Naga is considered to be Bicol's cultural center, due to the largest festival in the region, the Peñafrancia Festival, being held in the city."
        ],
        [
            "Festivals"
        ],
        [
            "Fluvial Procession for Our Lady of Peñafrancia"
        ],
        [
            "Peñafrancia Festival"
        ],
        [
            "The city celebrates the feast of Nuestra Señora de Peñafrancia (Our Lady of Peñafrancia), the patroness of the Bicol Region.",
            "Starting on the second Friday of September each year, the 10-day feast, the largest Marian devotion in the country.",
            "The start of the festival is signalled by a procession (or Translacion) when the centuries-old image of the Blessed Virgin Mary is transferred from its shrine at the Peñafrancia Basilica Minore de Nuestra Señora de Peñafrancia to the 400-year-old Naga Metropolitan Cathedral.",
            "Coinciding with nine days of novena prayer at the cathedral, the city celebrates with parades, pageants, street parties, singing contests, exhibits, concerts, and other activities.",
            "Finally, on the third Saturday of September, the image is returned, shoulder-borne by so-called voyadores, to the basilica via the historic Naga River.",
            "The following day marks the feast day of Our Lady of Peñafrancia, when Pontifical High Masses are celebrated in the basilica, attended by hundreds of thousands of faithful devotees."
        ],
        [
            "Kamundagan Festival"
        ],
        [
            "Naga celebrates the Kamundagan Festival every Christmas.",
            "It begins with the lighting of the Christmas Village in the Plaza Quezon Grandstand."
        ],
        [
            "Kinalas Festival"
        ],
        [
            "Naga celebrates the Kinalas Festival during its yearly anniversary of chartership or cityhood.",
            "It honors local delicacies, including kinalas and siling labuyo, with a food contest."
        ],
        [
            "Food and delicacies"
        ],
        [
            "Naga is known for some native foods and delicacies."
        ],
        [
            "Kinalas and log-log are noodle soup dishes served Bicol style, similar to mami except for a topping of what looks like a pansit palabok sauce, and the meaty dark soup made from boiling a cow's or a pig's head until the flesh falls off.",
            "Kinalas is from the old Bicol word kalas, The soup is topped with very tender meat slices that also come from the head.",
            "It is usually served hot with an egg, and sprinkled with roasted garlic and spring onions.",
            "Kalamansi and patis may be added according to taste.",
            "Kinalas is usually paired with Baduya, or with Banana or camote cue."
        ],
        [
            "Other delicacies, such as, buko juice, nata de coco, and pan de Naga are found in the city."
        ],
        [
            "Sports"
        ],
        [
            "Jesse M. Robredo Coliseum"
        ],
        [
            "The Metro Naga Sports Complex, in Barangay Pacol, has Olympic-sized swimming pools, tennis courts, and a track oval."
        ],
        [
            "The Jesse M. Robredo Coliseum, formerly the Naga City Coliseum which is renamed in honor of the late DILG secretary and former mayor of Naga, is the largest indoor arena in southern Luzon."
        ],
        [
            "Transportation"
        ],
        [
            "Airport"
        ],
        [
            "Naga Airport"
        ],
        [
            "The city is served by the Naga Airport (WNP) located in Barangay San Jose in the neighboring town of Pili.",
            "It has a runway of 1,402 meters (4,600 ft) and thus is capable of handling only small aircraft."
        ],
        [
            "Railways"
        ],
        [
            "Philippine National Railways Naga StationNaga is the regional head office and the center point of the Philippine National Railway's Bicol Line."
        ],
        [
            "Naga—along with those of adjacent towns and cities, from Tagkawayan, Quezon Province, to Ligao, Albay—is served daily by the Bicol Express.",
            "There is a plan for extending the line to Legazpi in the near future."
        ],
        [
            "Roads and bridges"
        ],
        [
            "As of December 2009"
        ],
        [
            "The city is connected to the capital Manila by the Andaya and Maharlika highways."
        ],
        [
            "In order to spur development in the city, the Toll Regulatory Board declared Toll Road 5 the extension of South Luzon Expressway."
        ],
        [
            "Public transportation"
        ],
        [
            "Bicol Central Station"
        ],
        [
            "The most common vehicles used for intra-city travel are public utility jeepneys (PUJ), trimobiles, and padyak."
        ],
        [
            "Public utility jeepneys and multicabs, a total of 323 units, are a major mode of intra-city transport used by regular commuters."
        ],
        [
            "Trimobiles are the most used land transport in the city.",
            "There are 1,500 units available for hire while 1,150 are for private use.",
            "There is now stiffer competition among drivers, which creates a wide range of problems, such as fare overcharging, refusal to convey passengers, an uneven distribution of trimobile service resulting in a shortage of transport service in some areas of the city, and rampant traffic violations."
        ],
        [
            "Padyak can be used in subdivision and barangay transportation.",
            "They provide a moderate amount of speed for those travelling to the city center."
        ],
        [
            "Inter-town trips are served by 403 filcab vans and 708 jeepneys, while inter-provincial trips are served by an average of 300 airconditioned and non-airconditioned buses and 88 Filcab vans."
        ],
        [
            "Recently, about 50 taxi units became available in the city.",
            "They use the new SM Naga City mall as a waiting area for passengers."
        ],
        [
            "Public services"
        ],
        [
            "Health care"
        ],
        [
            "The Bicol Medical Center"
        ],
        [
            "Naga is the medical center of the Bicol Region.",
            "The largest hospitals include the government-owned Bicol Medical Center (1000-bed capacity by virtue of Republic Act No.",
            "11478) and Camarines Sur Provincial Hospital, and the Universidad de Sta Isabel – Mother Seton Hospital, owned and operated by the Daughters of Charity.",
            "The Metropolitan Naga Medical District, in Naga, is the only medical district in Bicol."
        ],
        [
            "Bicol Medical Center (BMC) is located in Concepcion Pequeña.",
            "It offers specialty training in internal medicine, pediatrics, general surgery, obstetrics and gynecology, anesthesiology, radiology, ophthalmology, otolaryngology, orthopedics, and traumatology.",
            "It is also a base hospital of the Helen Keller Foundation, where eye specialists from all over the country are trained and later assigned to different parts of the Philippines."
        ],
        [
            "Universidad de Santa Isabel - Mother Seton Hospital (USI – MSH), is the largest private hospital in the region by number of admissions, medical equipment facilities, number of beds available, physical structure, and number of board-certified medical consultants.",
            "It is the only private hospital in Bicol offering specialty training programs, accredited by the Philippine Medical Association's component society, in major fields of medicine, such as internal medicine, pediatrics, and general surgery."
        ],
        [
            "The Plaza Medica houses the Naga Endocrine Laboratory (also called the Endolab), a modern hormone laboratory and facility."
        ],
        [
            "Bicol Access Health Centrum is another large hospital located in the city.",
            "It houses the Regional Disease Research Center, the first and only in the region."
        ],
        [
            "Several secondary and tertiary hospitals can be found in the city."
        ],
        [
            "Waste management and disposal"
        ],
        [
            "Solid waste"
        ],
        [
            "The main pollutants in the city come in the form of solid waste generated daily.",
            "Generally, these wastes come from various sources: residential, commercial, industrial, and institutional."
        ],
        [
            "Naga generates approximately 85.8 tons of waste per year, based on the latest 2009 estimates, where agricultural waste makes up a little more than one-fourth (26%) of the total volume.",
            "Food waste makes up a slightly smaller share, at 23%.",
            "Paper-based materials compose 12%, while other categories contribute smaller percentages."
        ],
        [
            "Solid wastes are disposed of and collected via the city's garbage trucks, which traverse ten routes on a daily basis.",
            "Collected wastes are then dumped at the dump site in Barangay Balatas, where they are segregated according to type of waste, and whether biodegradable or non-biodegradable."
        ],
        [
            "Liquid waste"
        ],
        [
            "A study of wastewater treatment facilities is incorporated in the proposed septage management ordinance, where the city will be very strict in forcing compliance with proper waste treatment by housing and establishment owners.",
            "The local water-utility agency has made the Metro Naga Water District its local partner in providing septage services, in exchange for adding environmental fees to water bills."
        ],
        [
            "The new wastewater treatment facility of SM City Naga, operational since April 20, 2009, has a capacity of 500 cubic meters per day; but at present, it is treating only around 200."
        ],
        [
            "Fire safety"
        ],
        [
            "The Naga City Fire Station is one of the most well equipped fire stations in the country.",
            "Other fire stations include Naga Chin Po Tong Fire Brigade, and the Naga White Volunteers."
        ],
        [
            "Police and law enforcement"
        ],
        [
            "The city is the location of two of the largest police stations in the Bicol Region.",
            "The historic Naga City Police Station, which had been the military base of operations of the Guardia Civil in the region, during the time of Spanish rule."
        ],
        [
            "Education"
        ],
        [
            "Naga is the home of the three largest universities in the Bicol Region.",
            "The city is also the home of several colleges."
        ],
        [
            "Tertiary education"
        ],
        [
            "Ateneo de Naga University"
        ],
        [
            "Universidad de Santa Isabel"
        ],
        [
            "Ateneo de Naga University is a Jesuit university and the largest Catholic university in the Bicol Region.",
            "The school has been accredited by PAASCU since 1979 and is the first university in the Philippines to achieve PAASCU Institutional Accreditation, on top of its Autonomous and Level III status.",
            "It is a \"center of excellence\" in teacher education, and a center of development in business administration, entrepreneurship, and information technology.",
            "It has produced animators for the country since it launched its bachelor's degree in animation."
        ],
        [
            "The Universidad de Santa Isabel was inaugurated on April 12, 1869, as a private Catholic university owned and run by the Daughters of Charity and is the \"first normal school for women in the Philippines and Southeast Asia and the Heritage and Historical University of Bicol\".",
            "It was established by six sisters of the order who arrived in the Bicol Region on April 4, 1868, with the Bishop of Caceres, Francisco Gainza, O.P., the founder of Colegio de Santa Isabel."
        ],
        [
            "University of Nueva Caceres was the very first university in Bicol, and is considered to be largest in the region, due to its attendance and size, that offers courses from kindergarten to graduate school.",
            "Founded by Dr. Jaime Hernandez in 1948, it has grown to become one of the leading institutions of higher learning in the Philippines.",
            "All course offerings are recognized by the government, and the colleges of Arts and Sciences, Education, and Commerce are accredited by the Philippine Association of Colleges and Universities Commission on Accreditation (PACU-COA).",
            "Its College of Engineering and Architecture is now one of the few regional centers for technological education in the Philippines."
        ],
        [
            "Technical colleges in the city include the South East Asian University of Technology, Naga College Foundation, AMA Computer College, and STI College.",
            "Specialized computer schools include Worldtech Resources Institute (WRI), Philippine Computer Foundation College (PCFC), and Computer Communication Development Institute (CCDI)."
        ],
        [
            "The country's oldest live-in Christian higher educational institute for the clergy was established in the city in the early part of the 18th century.",
            "The Holy Rosary Seminary (El Seminario del Santissimo Rosario), a Roman Catholic seminary run by the Archdiocese of Caceres, has produced 22 bishops, including the first Filipino bishop, Jorge Barlin, and the first Filipino cardinal to work in the Roman Curia, Jose Tomas Sanchez.",
            "The seminary has contributed, as well, to the national heritage, through José María Panganiban, Tomás Arejola, and seven of the Fifteen Martyrs of Bicol.",
            "On January 29, 1988, the National Historical Institute declared the Holy Rosary Seminary a National Historical Landmark."
        ],
        [
            "Secondary and primary education"
        ],
        [
            "The government-run Camarines Sur National High School, which was established in 1902, registers over 10,000 enrollees every school year, and it is the biggest secondary school in the region.",
            "Among other secondary schools in the city is the Tinago National High School."
        ],
        [
            "Naga City Science High School was established in Naga in 1994.",
            "It has pilot curricula, including the Spanish curriculum, which is the third one in the Philippines, and the journalism curriculum, which allows students to receive training and exposure to college-level situations.",
            "The school is consistently a champion at the Doon Po Sa Amin national documentary contest."
        ],
        [
            "Two schools in the city, Saint Joseph School (SJS) and Naga Hope Christian School (NHCS), cater to Filipino-Chinese students."
        ],
        [
            "Naga Parochial School (NPS) is the largest parochial school in the region; it receives 850 enrollees yearly.",
            "It is run by priests of the Archdiocese of Caceres.",
            "It is the first PAASCU-accredited parochial school in the Philippines.",
            "Some members of the clergy (63 as of 2007 with 3 bishops) assigned to the city are alumni of the school.",
            "Well-known personalities—such as the late Raul Roco, Jesse Robredo, Francis Garchitorena, Luis Villafuerte, Jaime Fabregas, Jonathan Dela Paz Zaens, Archbishop Adolfo Tito Yllana, and Bishop Jose Rojas—are graduates of NPS."
        ],
        [
            "Private schools—such as Arborvitae Plains Montessori, Inc.; Naga City Montessori School; and the Village Montessori School—can be found in the city.",
            "Tutorial and review centers for higher education are also found in the city."
        ],
        [
            "Media"
        ],
        [
            "Television networks"
        ],
        [
            "For the complete lists of the TV and radio stations, see List of television and radio stations in Naga, Camarines Sur."
        ],
        [
            "All of the major television broadcasting channels' regional offices are located in the city.",
            "ABS-CBN Corporation expanded its network in Bicol by establishing ABS-CBN Naga, which operates ABS-CBN channel 11 Naga, ABS-CBN Sports and Action Naga and MOR!",
            "Local shows such as TV Patrol Bicol, Marhay na Aga Kapamilya are broadcast throughout the region via ABS-CBN Regional, which is also stationed in the city.",
            "TV5 Network Inc.'s TV5 airs shows via channel 22, GMA Network's channel 7 and GMA News TV channel 28 are also available and the newscast Balitang Bicolandia."
        ],
        [
            "Cable and satellite TV"
        ],
        [
            "The city's cable and satellite TV companies include South Luzon Cable and DCTV Cable Network Naga (Formerly SkyCable Naga)."
        ],
        [
            "Radio stations"
        ],
        [
            "Naga has a number of FM and AM radio stations, some of which operate 24 hours daily."
        ],
        [
            "Notable personalities"
        ],
        [
            "Andrew E – Filipino singer and rapper"
        ],
        [
            "Johnny Abarrientos – a Philippine basketball player who played in the PBA from 1993 to 2010.",
            "He is currently serving as coach of the team B-Meg Llamados"
        ],
        [
            "Kyline Alcantara – Filipina actress"
        ],
        [
            "Tomás Arejola –  lawyer, legislator, diplomat, political writer and a propagandist during the Spanish colonial period."
        ],
        [
            "Joker Arroyo"
        ],
        [
            "Wally Bayola – is a Filipino comedian, actor, and TV host of Eat Bulaga!"
        ],
        [
            "Ely Buendia – whose real name is Eleandre Basiño Buendia.",
            "He is a Filipino singer, frontman of Eraserheads and Pupil"
        ],
        [
            "Jose Fabian Cadiz – Filipino politician and vice mayor of Marikina."
        ],
        [
            "Arnold Clavio – Philippine news anchor"
        ],
        [
            "AJ Dee – whose real name is Angel James Dee III, is an actor and an international competitive swimmer, like his younger brother Enchong Dee."
        ],
        [
            "Enchong Dee – whose real name is Ernest Lorenzo Velasquez Dee, is an actor, director and model, and an international competitive swimmer.",
            "He is a contract artist of ABS-CBN and has won numerous awards for his work in movies and television.",
            "He is the younger brother of AJ Dee, also an actor and swimmer.",
            "He came to prominence after starring in his first major TV drama Katorse (2009).",
            "He played the role of \"Luis\" in the Filipino remake Maria La Del Barrio (2011).",
            "He also starred in Ina, Kapatid, Anak (2012–13), and Muling Buksan Ang Puso."
        ],
        [
            "Amalia Fuentes – Filipina actress"
        ],
        [
            "Jerome Martinez Davis aka Boss Ka Reppa - Bicolano Content Creator and former NCAA Basketball player via Lyceum Pirates"
        ],
        [
            "Victor Dennis T. Nierva – poet, teacher, journalist, theatre actor, translator, graphic and book designer."
        ],
        [
            "Salvador Panelo – former spokesman and chief legal counsel of President Rodrigo Duterte; practicing lawyer known for representing controversial figures."
        ],
        [
            "Jesse Robredo – was a Filipino statesman and former mayor of Naga.",
            "Robredo was able to transform Naga from being dull and lethargic to being one of the \"Most Improved Cities in Asia\", as cited by Asiaweek Magazine in 1999.",
            "During his time in city hall, Robredo was credited for \"dramatically improved stakeholdership and people participation in governance, in the process restoring Naga to its preeminent position as the premier city of Bicol Region.\"",
            "In 1995, in recognition of his skills and competence as a leader and development manager, Robredo was elected president of the League of Cities of the Philippines, the national association of city mayors.",
            "Robredo also chaired the Metro Naga Development Council.",
            "He served as chairman of the Regional Development Council, the regional planning and coordinative body of Bicol's six provinces and seven cities, from 1992 to 1998."
        ],
        [
            "Leni Robredo – wife of Jesse Robredo, former congresswoman of the Third District of Camarines Sur (2013–16), and the 14th Vice President of the Philippines."
        ],
        [
            "Raul Roco – was a political figure in the Philippines.",
            "He was the standard-bearer of Aksyon Demokratiko, which he founded in 1997 as a vehicle for his presidential bids in 1998 and 2004.",
            "He was a then senator and secretary of the Department of Education under the presidency of Gloria Macapagal Arroyo.",
            "He had a strong following among young voters in the Philippines, due to his efforts to promote honesty and good governance."
        ],
        [
            "Tecla San Andres Ziga – female senator in the Philippines notable for being the first woman in the country to top the bar examination for law-degree graduates."
        ],
        [
            "Adolfo Tito Yllana – catholic Archbishop serving as Apostolic Nuncio to Israel and Cyprus, and Apostolic Delegate to Jerusalem and Palestine"
        ],
        [
            "Gallery"
        ],
        [
            "Downtown Naga"
        ],
        [
            "Avenue Square"
        ],
        [
            "Naga City Hall"
        ],
        [
            "Plaza Oragon"
        ],
        [
            "Malabsay falls at Mt.",
            "Isarog, Panicuason"
        ],
        [
            "Plaza de Nueva Caceres"
        ],
        [
            "Sister cities"
        ],
        [
            "Local"
        ],
        [
            " Bacolod, Negros Occidental"
        ],
        [
            " Cotabato City"
        ],
        [
            " General Santos, South Cotabato"
        ],
        [
            " Iloilo City, Iloilo"
        ],
        [
            " Lucena, Quezon"
        ],
        [
            " Makati"
        ],
        [
            " Ozamiz, Misamis Occidental"
        ],
        [
            " Parañaque"
        ],
        [
            " Quezon City"
        ],
        [
            " San Fernando, Pampanga"
        ],
        [
            " Vigan, Ilocos Sur"
        ],
        [
            " Puerto Princesa, Palawan"
        ],
        [
            "International"
        ],
        [
            " San Leandro, California, United States"
        ],
        [
            " Scranton, Pennsylvania, United States"
        ],
        [
            "See also"
        ],
        [
            "List of renamed cities and municipalities in the Philippines"
        ],
        [
            "Roman Catholic Archdiocese of Caceres"
        ],
        [
            "Bicolano People"
        ],
        [
            "List of Bicol Region Cities and Municipalities"
        ],
        [
            "References"
        ],
        [
            "^ a b \"Welcome to the City of Naga!\".",
            "Naga City.",
            "Retrieved July 7, 2019."
        ],
        [
            "^  City of Naga |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"The oldest royal city in the Philippines\".",
            "City Government of Naga Official Website.",
            "Retrieved May 19, 2020."
        ],
        [
            "^ a b Perez, Jose B.",
            "(February 27, 2015).",
            "\"Bicol's Boom Town: Bongat sees bullish Naga\".",
            "Bicol Mail.",
            "Archived from the original on April 2, 2015.",
            "Retrieved February 13, 2019."
        ],
        [
            "^ a b The Philippine Island World: A Physical, Cultural, and Regional Geography, p. 415, at Google Books"
        ],
        [
            "^ a b Orbita, Erlinda Hospicia V. (April 25, 2010).",
            "\"Naga City, the Heart of Bicol: 'An Maogmang Lugar '\".",
            "The Philippine Star.",
            "Archived from the original on April 13, 2014.",
            "Retrieved February 24, 2019."
        ],
        [
            "^ \"Home\".",
            "Bicol Medical Center.",
            "Retrieved February 24, 2019."
        ],
        [
            "^ \"Bicol Medical Center Modernization\".",
            "Naga City Deck.",
            "Retrieved February 24, 2019."
        ],
        [
            "^ \"Education\".",
            "Naga City.",
            "Retrieved February 25, 2019."
        ],
        [
            "^ \"Number of Schools in Naga City\".",
            "Naga City Government.",
            "February 28, 2023.",
            "Retrieved February 28, 2023."
        ],
        [
            "^ Kawanaka, Takeshi (2002).",
            "\"2.",
            "Naga City\" (PDF).",
            "Power in a Philippine City.",
            "Institute of Developing Economies, Japan External Trade Organization (IDE-JETRO).",
            "ISBN 978-425852038-1.",
            "Retrieved February 25, 2019."
        ],
        [
            "^ Bongat, John G. Naga Business Licensing Program (NBLP) (PDF) (Report).",
            "Retrieved February 25, 2019."
        ],
        [
            "^ Robredo, Jesse M. (May 3, 2000).",
            "City Strategy and Governance: The Naga City Experience (PDF).",
            "East Asia Urban and City Management Course.",
            "Retrieved February 25, 2019."
        ],
        [
            "^ \"Bongat bares State of City, hails Naga as Bicol's tiger economy\".",
            "Naga City.",
            "Retrieved February 25, 2019."
        ],
        [
            "^ \"Naga cited as one of  most competitive cities\".",
            "Bicol Mail.",
            "August 8, 2013.",
            "Archived from the original on September 2, 2013.",
            "Retrieved February 25, 2019."
        ],
        [
            "^ \"Naga City\".",
            "Philippines Cities.",
            "Retrieved February 25, 2019."
        ],
        [
            "^ Hermoso, Christina I.",
            "(September 13, 2013).",
            "\"Naga City set for traslacion\".",
            "Manila Bulletin.",
            "Archived from the original on April 29, 2014.",
            "Retrieved February 26, 2019."
        ],
        [
            "^ Llorin, Jean N. (June 27, 2010).",
            "\"Learning from 'The Heart of Bicol'\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on June 30, 2010.",
            "Retrieved February 27, 2019."
        ],
        [
            "^ \"Naga City: Where Bicol's heart is\".",
            "GMA News.",
            "September 19, 2012.",
            "Retrieved February 27, 2019."
        ],
        [
            "^ Abella, D. The Bikol Annals.",
            "Manila"
        ],
        [
            "^ \"The Naga We Know to be launched Aug. 31\".",
            "Likhaan: The UP Institute of Creative Writing.",
            "August 26, 2018.",
            "Archived from the original on April 13, 2014.",
            "Retrieved April 4, 2019."
        ],
        [
            "^ a b Safford, William Edwin (1916).",
            "\"Lignum nephriticum\" (PDF).",
            "Annual report of the Board of Regents of the Smithsonian Institution.",
            "Washington: Government Printing Office.",
            "p. 271–298."
        ],
        [
            "^ Muyskens, M.; Ed Vitz (2006).",
            "\"The Fluorescence of Lignum nephriticum: A Flash Back to the Past and a Simple Demonstration of Natural Substance Fluorescence\".",
            "Journal of Chemical Education.",
            "83 (5): 765.",
            "Bibcode:2006JChEd..83..765M.",
            "doi:10.1021/ed083p765."
        ],
        [
            "^ G. Nye Steiger, H. Otley Beyer, Conrado Benitez, A History of the Orient, Oxford: 1929, Ginn and Company, p. 122."
        ],
        [
            "^ \"Jesuits In The Philippines (1581-1768)\" Page 59"
        ],
        [
            "\"These settlements were much smaller than Manila.",
            "In 1582 Manila had"
        ],
        [
            "an adult male population of 300 Spaniards; Vigan, 60; Nueva Caceres,"
        ],
        [
            "30; Cebu, 70; Arevalo, 20.",
            "In 1586 Manila had 329 Spanish men and"
        ],
        [
            "youths capable of bearing arms ; the most recently established settlement, Nueva Segovia in Cagayan, had 97; Nueva Caceres, 69; Arevalo, 65; Cavite, 64; Cebu, 63; Villa Fernandina, 19."
        ],
        [
            "^ \"A History of the Philippines by David P. Barrows\".",
            "The City of Nueva Caceres, in the Camarines, was founded by Governor La-Sande.",
            "It, too, was the seat of a bishopric, and had one hundred Spanish inhabitants."
        ],
        [
            "^ https://www2.naga.gov.ph/culture-and-heritage-and-naming-of-streets/.",
            "Copied 10-06-22."
        ],
        [
            "^ \"The First Landings\".",
            "Retrieved March 18, 2014."
        ],
        [
            "^ \"R.A. No.",
            "305, Naga City Charter\".",
            "LawPH.com.",
            "1948.",
            "Archived from the original on April 6, 2012.",
            "Retrieved January 10, 2019."
        ],
        [
            "^ \"Google Maps\".",
            "Retrieved February 25, 2023."
        ],
        [
            "^ \"Mount Isarog Natural Park, Sec.",
            "5 a.1, R.A. 11038, An Act Declaring Protected Areas and Providing For Their Management, Amending For This Purpose Republic Act No.",
            "7658, Otherwise Known As The \"National Integrated Protected Areas Systems (NIPAS) Act of 1992\" And For Other Purposes\".",
            "February 25, 2023.",
            "Retrieved February 25, 2023."
        ],
        [
            "^ \"General Information\".",
            "See Naga – Official Website of Naga City.",
            "Retrieved on May 13, 2012."
        ],
        [
            "^ \"Municipality/City: NAGA CITY\".",
            "PSGC Interactive.",
            "Makati, Philippines: National Statistical Coordination Board.",
            "Archived from the original on November 13, 2015.",
            "Retrieved April 22, 2014."
        ],
        [
            "^ \"City of Naga\".",
            "psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 24, 2024."
        ],
        [
            "^ \"Barangay Officials 2010\".",
            "Naga City.",
            "Retrieved April 4, 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Camarines Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Demography\".",
            "Naga City.",
            "Retrieved April 4, 2019."
        ],
        [
            "^ \"Useful Filipino Words – Bicol Translations\".",
            "Cam Sur Guide Delights.",
            "2012.",
            "Archived from the original on April 27, 2014.",
            "Retrieved April 4, 2019."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Daet, Naga City among most competitive LGUs in 2014\".",
            "Bicol Standard.",
            "2014.",
            "Retrieved April 6, 2019."
        ],
        [
            "^ \"2022 RANKINGS OF COMPONENT CITIES\".",
            "Department of Trade and Industry.",
            "2022.",
            "Retrieved February 25, 2023."
        ],
        [
            "^ Macatangay, Analiza S. (January 2, 2014).",
            "\"Naga City, among the most competitive LGUs in the country\".",
            "Philippine Information Agency.",
            "Archived from the original on April 16, 2014.",
            "Retrieved February 16, 2019."
        ],
        [
            "^ \"P2.9M ingreso kan bus terminal cada bulan\" .",
            "Naga City (in Filipino).",
            "Retrieved February 13, 2019."
        ],
        [
            "^ \"South Riverfront Growth Area\".",
            "City Government of Naga.",
            "Retrieved January 12, 2019."
        ],
        [
            "^ Atiyah, Jeremy (2002).",
            "\"Rough Guide to Southeast Asia\", pg.",
            "880.",
            "Rough Guides Ltd., London.",
            "ISBN 1-85828-893-2."
        ],
        [
            "^ \"Curran + Associates :: Home\".",
            "www.curranrecruit.com.au.",
            "Archived from the original on December 11, 2007."
        ],
        [
            "^ \"IBM unit to set up BPO facility in Naga City\".",
            "ABS-CBN News.",
            "ABS-CBN Corporation.",
            "May 21, 2013.",
            "Retrieved April 6, 2019."
        ],
        [
            "^ Lisboa, Maŕcos de.",
            "\"Calas\".",
            "Vocabulario de la lengua Bicol: compuesto por Maŕcos de Lisboa (in Spanish).",
            "p. 89.",
            "Retrieved April 8, 2019."
        ],
        [
            "^ Lisboa, Maŕcos de.",
            "\"Hinglas\".",
            "Vocabulario de la lengua Bicol: compuesto por Maŕcos de Lisboa (in Spanish).",
            "p. 181.",
            "Retrieved April 6, 2019."
        ],
        [
            "^ Naguenian (August 23, 2010).",
            "\"Kinalas\".",
            "Blogspot.",
            "Retrieved April 8, 2019."
        ],
        [
            "^ Gonzalez, Eduardo (January 16, 2013).",
            "\"The Beneficial Buko Juice\".",
            "Philippine Council For Health Research And Development.",
            "Archived from the original on April 24, 2013.",
            "Retrieved April 8, 2019."
        ],
        [
            "^ Leah (October 17, 2012).",
            "\"Pan de Naga (Pugon Pandesal)\".",
            "The Bright Spot.",
            "Retrieved April 22, 2019."
        ],
        [
            "^ \"Heritage Tour\".",
            "See Naga.",
            "Retrieved on June 13, 2012."
        ],
        [
            "^ \"Stations & Train Schedules - Philippine National Railways\".",
            "Archived from the original on August 20, 2013.",
            "Retrieved September 6, 2013."
        ],
        [
            "^ a b c \"Transportation\".",
            "Naga City.",
            "Retrieved February 16, 2019."
        ],
        [
            "^ \"SLEX Toll Road 5 to connect Quezon province to Sorsogon\".",
            "YugaTech.",
            "August 18, 2020.",
            "Retrieved January 9, 2021."
        ],
        [
            "^ \"San Miguel investing P122B for SLEX Toll Road 5, Pasig River Expressway projects\".",
            "GMA News Online.",
            "August 25, 2020.",
            "Retrieved January 9, 2021."
        ],
        [
            "^ \"Bicol Medical Center\" Archived July 27, 2005, at the Wayback Machine"
        ],
        [
            "^ \"Universidad de Santa Isabel-Mother Seton Hospital\"."
        ],
        [
            "^ Neola, Jason B.",
            "\"Solid Waste Management Office created; also named as Special Concerns Office\".",
            "Naga City.",
            "Retrieved February 27, 2019."
        ],
        [
            "^ a b \"Waste Management\".",
            "Naga City.",
            "Retrieved February 27, 2019."
        ],
        [
            "^ Macatangay, Ana-Liza S. (March 4, 2014).",
            "\"Naga City kicks off observance of Fire Prevention Month\".",
            "Philippine Information Agency.",
            "Archived from the original on May 12, 2014.",
            "Retrieved April 10, 2019."
        ],
        [
            "^ \"Naga City Police Station\".",
            "Naga City.",
            "Retrieved April 10, 2019."
        ],
        [
            "^ http://r05.pia.gov.ph/index.php?article=861357375545"
        ],
        [
            "^ Macatangay, Ana-Liza S. (November 28, 2013).",
            "\"PNP CamSur cites outstanding police stations, personnel\".",
            "Philippine Information Agency.",
            "Archived from the original on May 11, 2014.",
            "Retrieved November 19, 2021."
        ],
        [
            "^ \"Formation - Information - Sharing - Prayer... | Filles de la Charité de Saint Vincent de Paul\".",
            "Retrieved May 14, 2019."
        ],
        [
            "^ \"CATHOLIC ENCYCLOPEDIA: Sisters of Charity of St. Vincent de Paul\".",
            "www.newadvent.org.",
            "Retrieved May 14, 2019."
        ],
        [
            "^ \"About UNC\".",
            "University of Nueva Caceres.",
            "2013.",
            "Archived from the original on December 3, 2013.",
            "Retrieved April 11, 2019."
        ],
        [
            "^ \"ACLC College\".",
            "ACLC College.",
            "Retrieved April 11, 2019."
        ],
        [
            "^ \"STI College - Naga\".",
            "STI College.",
            "Retrieved on May 13, 2012."
        ],
        [
            "^ \"Naga generates best hometown stories\".",
            "Smart Communications, Inc. (Press release).",
            "February 20, 2014.",
            "Archived from the original on March 12, 2014.",
            "Retrieved April 11, 2019."
        ],
        [
            "^ \"Barroca draws comparisons with Abarrientos as he steps up for injury-hit San Mig | PBA | SPIN.PH\".",
            "Archived from the original on April 13, 2014.",
            "Retrieved April 11, 2014."
        ],
        [
            "^ Chua-Eoan, Howard (September 21, 1987).",
            "\"The Philippines – The Joker Was Not Laughing\".",
            "Time.",
            "Retrieved April 11, 2019."
        ],
        [
            "^ Toms, S. \"The Philippine name game\", BBC News, January 14, 2006.",
            "Accessed last February 21, 2007."
        ],
        [
            "^ Mydans, S. \"Aquino, Under Pressure, Removes Her Closest Adviser\", The New York Times, September 18, 1987.",
            "Accessed last February 21, 2007."
        ],
        [
            "^ Chua-Eoan, H. \"The Philippines The Joker Was Not Laughing\", Time p. 2, September 21, 1987.",
            "Accessed last February 21, 2007."
        ],
        [
            "^ \"Tecla San Andres Ziga\".",
            "Senate of the Philippines.",
            "Retrieved November 23, 2013."
        ],
        [
            "^ \"Sister Cities\".",
            "The Local Government of Quezon City.",
            "Archived from the original on October 1, 2017.",
            "Retrieved April 9, 2019."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Naga, Camarines Sur."
        ],
        [
            "Wikivoyage has a travel guide for Naga City."
        ],
        [
            " Geographic data related to Naga, Camarines Sur at OpenStreetMap"
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Naga, Camarines Sur"
        ],
        [
            "Magarao"
        ],
        [
            "Bombon / Calabanga"
        ],
        [
            "CanamanCamaligan"
        ],
        [
            "Naga"
        ],
        [
            "Mount Isarog"
        ],
        [
            "Milaor"
        ],
        [
            "Pili"
        ],
        [
            "vteMetro NagaStatistically grouped with the Province of Camarines SurAdministrative divisionsCity"
        ],
        [
            "Naga"
        ],
        [
            "Municipalities"
        ],
        [
            "Bombon"
        ],
        [
            "Bula"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Gainza"
        ],
        [
            "Libmanan"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "San Fernando"
        ],
        [
            "Geography"
        ],
        [
            "Mount Isarog"
        ],
        [
            "Mount Bernacci (Tangcong Vaca)"
        ],
        [
            "History"
        ],
        [
            "History of Metro Naga"
        ],
        [
            "Religion"
        ],
        [
            "Religion in Naga"
        ],
        [
            "Archdiocese of Caceres"
        ],
        [
            "Our Lady of Peñafrancia"
        ],
        [
            "Public utilities and services"
        ],
        [
            "Metropolitan Naga Water District"
        ],
        [
            "Public Services"
        ],
        [
            "TransportationRailways"
        ],
        [
            "Philippine National Railways"
        ],
        [
            "Road & Highways"
        ],
        [
            "Major Roads"
        ],
        [
            "Pan-Philippine Highway"
        ],
        [
            "South Luzon Expressway (Toll Road 5)"
        ],
        [
            "Airports"
        ],
        [
            "Naga Airport"
        ],
        [
            "Education"
        ],
        [
            "Education in Naga"
        ],
        [
            "Naga Parochial School"
        ],
        [
            "Ateneo de Naga University"
        ],
        [
            "Universidad de Santa Isabel"
        ],
        [
            "University of Nueva Caceres"
        ],
        [
            "Holy Rosary Seminary"
        ],
        [
            "Holy Rosary Minor Seminary"
        ],
        [
            "Holy Rosary Major Seminary"
        ],
        [
            "Naga College Foundation"
        ],
        [
            "Bicol State College of Applied Sciences and Technology"
        ],
        [
            "Naga City Science High School"
        ],
        [
            "AMA Computer University"
        ],
        [
            "Camarines Sur National High School"
        ],
        [
            "STI College"
        ],
        [
            "Landmarks"
        ],
        [
            "Porta Mariae"
        ],
        [
            "Naga Cathedral"
        ],
        [
            "Our Lady of Peñafrancia Shrine"
        ],
        [
            "Peñafrancia Basilica Minore"
        ],
        [
            "San Francisco Church"
        ],
        [
            "St. Anthony of Padua Parish Church"
        ],
        [
            "Highways in Italics are either under construction, not yet operational, or have been closed."
        ],
        [
            "Bicol Region"
        ],
        [
            "Philippines"
        ],
        [
            "Articles Related to Naga, Camarines Sur"
        ],
        [
            "vteBicol Region (Region V)Provinces"
        ],
        [
            "Albay"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Catanduanes"
        ],
        [
            "Masbate"
        ],
        [
            "Sorsogon"
        ],
        [
            "Regional center"
        ],
        [
            "Legazpi"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Daet"
        ],
        [
            "Legazpi"
        ],
        [
            "Masbate City"
        ],
        [
            "Pili"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Virac"
        ],
        [
            "Metropolitan areas"
        ],
        [
            "Metro Naga"
        ],
        [
            "Independent component cities"
        ],
        [
            "Naga"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Iriga"
        ],
        [
            "Ligao"
        ],
        [
            "Masbate City"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Tabaco"
        ],
        [
            "Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baao"
        ],
        [
            "Bacacay"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Balatan"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Baras"
        ],
        [
            "Barcelona"
        ],
        [
            "Basud"
        ],
        [
            "Bato (Camarines Sur)"
        ],
        [
            "Bato (Catanduanes)"
        ],
        [
            "Batuan"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camalig"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Capalonga"
        ],
        [
            "Caramoan"
        ],
        [
            "Caramoran"
        ],
        [
            "Casiguran"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Daet"
        ],
        [
            "Daraga"
        ],
        [
            "Del Gallego"
        ],
        [
            "Dimasalang"
        ],
        [
            "Donsol"
        ],
        [
            "Esperanza"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Gigmoto"
        ],
        [
            "Goa"
        ],
        [
            "Gubat"
        ],
        [
            "Guinobatan"
        ],
        [
            "Irosin"
        ],
        [
            "Jose Panganiban"
        ],
        [
            "Jovellar"
        ],
        [
            "Juban"
        ],
        [
            "Labo"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Libon"
        ],
        [
            "Lupi"
        ],
        [
            "Magallanes"
        ],
        [
            "Magarao"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Mandaon"
        ],
        [
            "Manito"
        ],
        [
            "Matnog"
        ],
        [
            "Mercedes"
        ],
        [
            "Milaor"
        ],
        [
            "Milagros"
        ],
        [
            "Minalabac"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Nabua"
        ],
        [
            "Oas"
        ],
        [
            "Ocampo"
        ],
        [
            "Palanas"
        ],
        [
            "Pamplona"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "Paracale"
        ],
        [
            "Pasacao"
        ],
        [
            "Pilar"
        ],
        [
            "Pili"
        ],
        [
            "Pio Duran"
        ],
        [
            "Pio V. Corpuz"
        ],
        [
            "Placer"
        ],
        [
            "Polangui"
        ],
        [
            "Presentacion"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Ragay"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Sagñay"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando (Camarines Sur)"
        ],
        [
            "San Fernando (Masbate)"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Jose"
        ],
        [
            "San Lorenzo Ruiz"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pascual"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Talisay"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Tiwi"
        ],
        [
            "Uson"
        ],
        [
            "Viga"
        ],
        [
            "Vinzons"
        ],
        [
            "Virac"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Province of Camarines SurPili (capital)  Naga (largest city)Municipalities"
        ],
        [
            "Baao"
        ],
        [
            "Balatan"
        ],
        [
            "Bato"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Caramoan"
        ],
        [
            "Del Gallego"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Goa"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Lupi"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Nabua"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "Presentacion"
        ],
        [
            "Ragay"
        ],
        [
            "Sagñay"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Component city"
        ],
        [
            "Iriga"
        ],
        [
            "Independent component city"
        ],
        [
            "Naga (Administratively independent from the province but grouped under Camarines Sur by the Philippine Statistics Authority.)"
        ],
        [
            "vteMetro NagaStatistically grouped with the Province of Camarines SurAdministrative divisionsCity"
        ],
        [
            "Naga"
        ],
        [
            "Municipalities"
        ],
        [
            "Bombon"
        ],
        [
            "Bula"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Gainza"
        ],
        [
            "Libmanan"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "San Fernando"
        ],
        [
            "Geography"
        ],
        [
            "Mount Isarog"
        ],
        [
            "Mount Bernacci (Tangcong Vaca)"
        ],
        [
            "History"
        ],
        [
            "History of Metro Naga"
        ],
        [
            "Religion"
        ],
        [
            "Religion in Naga"
        ],
        [
            "Archdiocese of Caceres"
        ],
        [
            "Our Lady of Peñafrancia"
        ],
        [
            "Public utilities and services"
        ],
        [
            "Metropolitan Naga Water District"
        ],
        [
            "Public Services"
        ],
        [
            "TransportationRailways"
        ],
        [
            "Philippine National Railways"
        ],
        [
            "Road & Highways"
        ],
        [
            "Major Roads"
        ],
        [
            "Pan-Philippine Highway"
        ],
        [
            "South Luzon Expressway (Toll Road 5)"
        ],
        [
            "Airports"
        ],
        [
            "Naga Airport"
        ],
        [
            "Education"
        ],
        [
            "Education in Naga"
        ],
        [
            "Naga Parochial School"
        ],
        [
            "Ateneo de Naga University"
        ],
        [
            "Universidad de Santa Isabel"
        ],
        [
            "University of Nueva Caceres"
        ],
        [
            "Holy Rosary Seminary"
        ],
        [
            "Holy Rosary Minor Seminary"
        ],
        [
            "Holy Rosary Major Seminary"
        ],
        [
            "Naga College Foundation"
        ],
        [
            "Bicol State College of Applied Sciences and Technology"
        ],
        [
            "Naga City Science High School"
        ],
        [
            "AMA Computer University"
        ],
        [
            "Camarines Sur National High School"
        ],
        [
            "STI College"
        ],
        [
            "Landmarks"
        ],
        [
            "Porta Mariae"
        ],
        [
            "Naga Cathedral"
        ],
        [
            "Our Lady of Peñafrancia Shrine"
        ],
        [
            "Peñafrancia Basilica Minore"
        ],
        [
            "San Francisco Church"
        ],
        [
            "St. Anthony of Padua Parish Church"
        ],
        [
            "Highways in Italics are either under construction, not yet operational, or have been closed."
        ],
        [
            "Bicol Region"
        ],
        [
            "Philippines"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "Authority control databases International"
        ],
        [
            "FAST"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Spain"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Naga,_Camarines_Sur&oldid=1233244047\""
        ],
        [
            "Categories: Naga, Camarines SurCities in Camarines SurIndependent component cities in the PhilippinesPopulated places established in 15751575 establishments in the PhilippinesFormer provincial capitals of the PhilippinesMetro NagaCities in the Bicol RegionHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listCS1 foreign language sources (ISO 639-2)CS1 Spanish-language sources (es)Webarchive template wayback linksAll articles with dead external linksArticles with dead external links from April 2019Articles with short descriptionShort description is different from WikidataUse Philippine English from August 2022All Wikipedia articles written in Philippine EnglishUse mdy dates from July 2022Pages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using PH wikidata incorrectlyPages using infobox settlement with possible demonym listArticles containing Filipino-language textCitation overkillArticles tagged with the inline citation overkill template from June 2020All articles with unsourced statementsArticles with unsourced statements from April 2012Articles containing potentially dated statements from December 2009All articles containing potentially dated statementsCommons category link from WikidataOfficial website different in Wikidata and WikipediaArticles with FAST identifiersArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with BNE identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}