{
    "name": "Naguilian",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Naguilian, La Union"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიLëtzebuergeschBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°32′N 120°24′E﻿ / ﻿16.53°N 120.4°E﻿ / 16.53; 120.4"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in La Union, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Naguilian, La Union\" – news · newspapers · books · scholar · JSTOR (August 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesNaguilian"
        ],
        [
            "Nag-ili-anMunicipalityMunicipality of NaguilianNaguilian Municipal Hall along the Naguilian Road"
        ],
        [
            "FlagSealNickname(s): The True Heart of La UnionHome of the Original BasiMotto: Tattan Naguilian!Map of La Union with Naguilian highlightedOpenStreetMapNaguilianLocation within the PhilippinesCoordinates: 16°32′N 120°24′E﻿ / ﻿16.53°N 120.4°E﻿ / 16.53; 120.4CountryPhilippinesRegionIlocos RegionProvinceLa UnionDistrict"
        ],
        [
            "2nd districtFoundedFebruary 18, 1839Barangays37"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorHon.",
            "Nieri T. Flores • Vice MayorHon.",
            "Reynaldo J. Flores • RepresentativeHon.",
            "Dante S. Garcia • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ruperto A. Rillera Jr.Diomedes F. HipolGeorgina F. Estepa-FloresHelen C. ObispoDanilo T. SorianoHulgar Redentor R. RimandoAurelio F. FloraRoger A. Floresca"
        ],
        [
            " • Electorate36,150 voters (2022)Area • Revenue PHP 240,181,428.55 million (-0.73%) (2021) • Assets PHP 917,466,907.48 million (12.19%) (2021) • Equity PHP 802,228,226.57 million (18.07%) (2021) • Expenditure PHP  138,694,692.24 million (-8.43%) (2021) • Liabilities PHP 112,238,680.91 million (-17.31%) (2021)Service provider • ElectricityLa Union Electric Cooperative (LUELCO)Time zoneUTC+8 (PST)ZIP code2511PSGC013311000IDD : area code +63 (0)72Native languagesIlocano TagalogMajor religionsRoman CatholicPatron saintSaint Augustine of HippoNotable FestivalBasi FestivalWebsitewww.naguilian.gov.ph"
        ],
        [
            "Naguilian, officially the Municipality of Naguilian (Ilocano: Ili ti Naguilian; Filipino: Bayan ng Naguilian), is a 1st class municipality in the province of La Union, Philippines.",
            "According to the 2020 census, it has a population of 52,189 people."
        ],
        [
            "Naguilian is 40 kilometres (25 mi) from Baguio via the Naguilian Road, 17 kilometres (11 mi) from the provincial capital, San Fernando, and 266 kilometres (165 mi) from Manila."
        ],
        [
            "History"
        ],
        [
            "Aerial view of Naguilian, 1938"
        ],
        [
            "Originally a part of Bauang in the province of Pangasinan, Naguilian derived its name from the Iloko phrase “Nag-ili-an dagiti gan-ganaet” meaning “a place where people from other places come to stay”.",
            "It is formed from the Iloko root word “ili” meaning “town” which was later modified as “Naguilian”."
        ],
        [
            "Its separation from Bauang coincided with the centennial celebration of the Catholic Church of Naguilian in 1839.",
            "When La Union was created by a Royal Decree in 1850, Naguilian was one of the twelve (12) towns that comprised the province."
        ],
        [
            "The founding of Naguilian"
        ],
        [
            "Due to increasing population density, a group of immigrants drifted to the shore of La Union and began building the town of Bauang at the south of the river and settled thereat.",
            "Later, however, due to population explosion, they followed the meander of the river in search of a new territory.",
            "They found a fertile valley at the bank of the river, which they called Naguilian.",
            "They built a colony at the fork of the two (2) rivers and began developing the territory.",
            "They were the first inhabitants of Naguilian."
        ],
        [
            "Ethnic origin of the people"
        ],
        [
            "Records have shown that when the Ilocanos arrived in town, Igorot settlers are already at par.",
            "At present, “natives” as the Igorots are popularly called can still be found at the southern and northern parts of the town while majority of the Ilocanos are settled at the lowlands."
        ],
        [
            "The subdivision of Naguilian"
        ],
        [
            "During its establishment as a town, it was believed that a few portions of Burgos and Bagulin were originally a part of Naguilian.",
            "These include the lower portion of Burgos known as “Disdis” meaning “a small barrio” and the barangays along the southwestern bank of the Naguilian River (Bagulin portion).",
            "“Disdis” was also called “Stancia” by the Spaniards as it served as a pasture ground for their horses while the portion which eventually became a part of Bagulin was predominantly inhabited by the Igorots."
        ],
        [
            "However, during the American Regime, by virtue of a Resolution of the Provincial Government of La Union, Naguilian was divided into three portions namely, that portion which became the town of Naguilian, that portion forming part of Burgos and that portion forming part of Bagulin."
        ],
        [
            "Political development"
        ],
        [
            "The earliest political system used during the Spanish colonial period was the “encomienda” system.",
            "Under this system, the native inhabitants in a given geographic region were entrusted to conquistadores, friars, and native nobles in exchange for their services to the King.",
            "In return, the person granted the encomienda, known as an encomiendero, were given the privilege to collect tribute from its inhabitants and to provide military protection, justice and governance.",
            "The encomienda system however was abused by encomienderos and by 1700 was largely replaced by administrative units.",
            "With the main purpose of governance and tax collection, small towns or pueblos were ruled by Gobernadorcillos and Capitanes."
        ],
        [
            "Geography"
        ],
        [
            "Naguilian River along the Naguilian Road"
        ],
        [
            "Naguilian is characterized by hills and mountains that are gently rolling, bordered by the Cordillera Mountains in the east.",
            "The alienable lands are rolling plains in narrow strips, framed by the mountains slopes and the banks of rivers, crisscrossed by streams and springs from the side of the mountains.",
            "Its soil varies from clay loam to sandy loam and golds."
        ],
        [
            "There are two major rivers in Naguilian.",
            "The Naguilian River is located in the western portion of the town.",
            "It flows westward beginning from the province of Benguet towards La Union and empties into the South China Sea, draining the valleys of Barangays Bimmotobot, Mamat-ing Sur, Mamat-ing Norte, Tuddingan, Gusing Sur, Gusing Norte, Baraoas Norte, Daramuangan, Dal-lipaoen, Cabaritan Sur, Ortiz, Natividad, Suguidan Norte, and Suguidan Sur.",
            "It has a length of approximately 67 kilometres (42 mi) and has a basin area of 658 square kilometres (254 sq mi).",
            "As classified by the Environmental Management Bureau, the upper reaches of the river falls under Class A which means that it is suitable as water supply source for drinking.",
            "The lower reaches have lower water quality, categorized under Class C."
        ],
        [
            "The other major stream springs from the Municipality of Burgos and drains the valleys of Barangays Aguioas, Sili, Al-alinao Norte, Nagsidorisan, Angin, Suguidan Norte, and Natividad.",
            "These two rivers meet at the poblacion where it forms a delta, then meander through the center of the municipality and empty at the mouth of the river in Bauang."
        ],
        [
            "Climate"
        ],
        [
            "The municipality's climate falls under the first type of climate in the Philippines, characterized by two (2) distinct seasons, wet and dry.",
            "The wet season usually comes in May and ends in the early part of October.",
            "The rest of the year is dry season."
        ],
        [
            "Climate data for Naguilian, La Union"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "42(1.7)"
        ],
        [
            "48(1.9)"
        ],
        [
            "74(2.9)"
        ],
        [
            "110(4.3)"
        ],
        [
            "269(10.6)"
        ],
        [
            "275(10.8)"
        ],
        [
            "362(14.3)"
        ],
        [
            "325(12.8)"
        ],
        [
            "330(13.0)"
        ],
        [
            "306(12.0)"
        ],
        [
            "126(5.0)"
        ],
        [
            "61(2.4)"
        ],
        [
            "2,328(91.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.2"
        ],
        [
            "12.0"
        ],
        [
            "17.1"
        ],
        [
            "21.2"
        ],
        [
            "27.1"
        ],
        [
            "26.8"
        ],
        [
            "28.1"
        ],
        [
            "27.0"
        ],
        [
            "26.0"
        ],
        [
            "24.5"
        ],
        [
            "17.7"
        ],
        [
            "12.4"
        ],
        [
            "251.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Land use"
        ],
        [
            "Built-up areas of the town are generally spread along the barangay roads.",
            "Of the total land area, 50 hectares (120 acres), equivalent to 0.50% of the total land area, are classified as built-up areas.",
            "Urban built-up area, totaling 18.90 hectares (46.7 acres), constitute 11.22% of the total urban land area.",
            "Rural built-up areas total 31.10 hectares (76.8 acres), or 0.31% of the total rural area."
        ],
        [
            "Through Proclamation No.",
            "52, a portion of Barangay Casilagan, with an area of 897.26 hectares (2,217.2 acres), was proclaimed as a watershed area by the Bureau of Forestry.",
            "This is equivalent to .10% of the total land area of the town."
        ],
        [
            "Barangays"
        ],
        [
            "Naguilian is politically subdivided into 37"
        ],
        [
            "barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aguioas"
        ],
        [
            "Al-alinao Norte"
        ],
        [
            "Al-alinao Sur"
        ],
        [
            "Ambaracao Norte"
        ],
        [
            "Ambaracao Sur"
        ],
        [
            "Angin"
        ],
        [
            "Balecbec"
        ],
        [
            "Bancagan"
        ],
        [
            "Baraoas Norte"
        ],
        [
            "Baraoas Sur"
        ],
        [
            "Bariquir"
        ],
        [
            "Bato"
        ],
        [
            "Bimmotobot"
        ],
        [
            "Cabaritan Norte"
        ],
        [
            "Cabaritan Sur"
        ],
        [
            "Casilagan"
        ],
        [
            "Dal-lipaoen"
        ],
        [
            "Daramuangan"
        ],
        [
            "Guesset"
        ],
        [
            "Gusing Norte"
        ],
        [
            "Gusing Sur"
        ],
        [
            "Imelda"
        ],
        [
            "Lioac Norte"
        ],
        [
            "Lioac Sur"
        ],
        [
            "Magungunay"
        ],
        [
            "Mamat-ing Norte"
        ],
        [
            "Mamat-ing Sur"
        ],
        [
            "Nagsidorisan"
        ],
        [
            "Natividad"
        ],
        [
            "Ortiz"
        ],
        [
            "Ribsuan"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "Sili"
        ],
        [
            "Suguidan Norte"
        ],
        [
            "Suguidan Sur"
        ],
        [
            "Tuddingan"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of NaguilianYearPop.±% p.a.1903 11,885—    1918 14,828+1.49%1939 15,933+0.34%1948 15,227−0.50%1960 19,528+2.09%1970 25,177+2.57%1975 27,114+1.50%1980 29,304+1.57%1990 36,328+2.17%1995 39,989+1.82%2000 43,501+1.82%2007 45,232+0.54%2010 48,407+2.50%2015 54,221+2.18%2020 52,189−0.75%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Naguilian was 52,189 people, with a density of 500 inhabitants per square kilometre or 1,300 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Naguilian"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  27.00"
        ],
        [
            "2009  21.90"
        ],
        [
            "2012  5.06"
        ],
        [
            "2015  5.94"
        ],
        [
            "2018  2.81"
        ],
        [
            "2021  9.00"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agriculture"
        ],
        [
            "Generally, the agricultural lands are narrow strips in the valleys, running from the sides of the mountains to the bank of the rivers, brooks, and streams.",
            "The rolling areas from the top of the mountains and hills are also utilized for the planting of rice and other crops.",
            "The area devoted for agricultural purposes, which totals 9,859.71 hectares (24,363.9 acres) constituting 97% of the total land area."
        ],
        [
            "Industries"
        ],
        [
            "Industries in the different parts of the municipality include woodcraft, metal craft, bamboo craft, ceramics or brick making, concrete hollow block making, basi (sugarcane wine) making and furniture making and upholstery, .28% of the total land area of the town is devoted for industrial purposes."
        ],
        [
            "Commerce"
        ],
        [
            "The center of commercial activities is the public market located in Barangay Ortiz.",
            "There are, however, other commercial establishments found in the different barangays, the most common of which are sari-sari stores.",
            "The area devoted to commerce constitutes .03% of the total land area of the town."
        ],
        [
            "Fishery"
        ],
        [
            "Fishing is done in almost all barangays traversed by the rivers, namely, Barangays Bimmotobot, Mamat-ing Sur, Mamat-ing Norte, Gusing Norte, Gusing Sur, Baraoas Norte, Baraoas Sur, Ortiz, Cabaritan Norte, Cabaritan Sur, Dal-lipaoen, Nagsidorisan, Suguidan Norte, Suguidan Sur, Guesset, Sili, Al-alinao Norte, Al-alinao Sur, Aguioas, and Ribsuan."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Naguilian, belonging to the second congressional district of the province of La Union, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022-Present)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Dante S. Garcia"
        ],
        [
            "Mayor"
        ],
        [
            "Nieri T. Flores"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Reynaldo J. Flores"
        ],
        [
            "Councilors"
        ],
        [
            "Ruperto A. Rillera Jr."
        ],
        [
            "Diomedes F. Hipol"
        ],
        [
            "Georgina F. Estepa-Flores"
        ],
        [
            "Helen C. Casuga-Obispo"
        ],
        [
            "Danilo T. Soriano"
        ],
        [
            "Hulgar Redentor R. Rimando"
        ],
        [
            "Aurelio F. Flora"
        ],
        [
            "Roger A. Floresca"
        ],
        [
            "Sister cities"
        ],
        [
            "Suisun City, California, United States of America"
        ],
        [
            "Notable personalities"
        ],
        [
            "Hermogenes F. Belen, Ilocano-language novelist, poet, and playwright"
        ],
        [
            "Gallery"
        ],
        [
            "Naguilian rural landscape"
        ],
        [
            "Naguilian Downtown"
        ],
        [
            "Naguilian Town Plaza"
        ],
        [
            "Naguilian Municipal Hall"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Naguilian |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Naguilian: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ \"Proclamation No.",
            "52; Reserving and Designating As Naguilian Watershed Reservation For Watershed Protection and Timber Production the Parcel of the Public Domain Situated in the Municipality of Naguilian, Province of La Union, Island of Luzon\".",
            "Official Gazette of the Republic of the Philippines.",
            "11 April 1936.",
            "Retrieved 3 October 2016."
        ],
        [
            "^"
        ],
        [
            "\"Province: La Union\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of La Union\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Keith, Charles (20 September 2011).",
            "\"Naguilian struggles to save native brew\".",
            "Philippine Daily Inquirer.",
            "Inquirer Northern Luzon.",
            "Archived from the original on 27 February 2015.",
            "Retrieved 3 October 2016."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 6, 2022."
        ],
        [
            "^ \"Memorandum of Agreement Establishing the Sister City Relationship Between The Municipality of Naguilian, La Union, Philippines and The City of Suisun City, California, United States of America\" (PDF).",
            "Sistercities.org.",
            "16 May 2006.",
            "Retrieved 15 September 2018."
        ],
        [
            "^ Gruenberg, Estrellita (2000).",
            "Un-uni: Echoes from Ilokandia.",
            "Malate, Manila, Philippines: De La Salle University Press.",
            "p. 99.",
            "ISBN 971-555-321-4.",
            "Retrieved 9 October 2019."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Naguilian, La Union."
        ],
        [
            "Official Website of the Provincial Government of La Union"
        ],
        [
            "Local Government Unit: Naguilian La Union"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Naguilian, La Union"
        ],
        [
            "San Fernando"
        ],
        [
            "Bagulin"
        ],
        [
            "Bauang"
        ],
        [
            "Naguilian"
        ],
        [
            "Burgos"
        ],
        [
            "Caba / Aringay"
        ],
        [
            "Sablan, Benguet"
        ],
        [
            "vteProvince of La UnionSan Fernando (capital and largest city)Municipalities"
        ],
        [
            "Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Bacnotan"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Bangar"
        ],
        [
            "Bauang"
        ],
        [
            "Burgos"
        ],
        [
            "Caba"
        ],
        [
            "Luna"
        ],
        [
            "Naguilian"
        ],
        [
            "Pugo"
        ],
        [
            "Rosario"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santol"
        ],
        [
            "Sudipen"
        ],
        [
            "Tubao"
        ],
        [
            "Component city"
        ],
        [
            "San Fernando"
        ],
        [
            "BarangaysSee: List of barangays in La Union"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Naguilian,_La_Union&oldid=1177523134\""
        ],
        [
            "Category: Municipalities of La UnionHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from August 2013All articles needing additional referencesPages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}