{
    "name": "Naic",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Naic"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°19′N 120°46′E﻿ / ﻿14.32°N 120.77°E﻿ / 14.32; 120.77"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cavite, Philippines"
        ],
        [
            "For \"NAIC\" as an abbreviation, see NAIC (disambiguation)."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Naic\" – news · newspapers · books · scholar · JSTOR (March 2018) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesNaicMunicipalityMunicipality of NaicDiocesan Shrine of the Immaculate Conception (Naic Parish)"
        ],
        [
            "FlagSealAnthem: Himno ng NaicNaic HymnMap of Cavite with Naic highlightedOpenStreetMapNaicLocation within the PhilippinesCoordinates: 14°19′N 120°46′E﻿ / ﻿14.32°N 120.77°E﻿ / 14.32; 120.77CountryPhilippinesRegionCalabarzonProvinceCaviteDistrict"
        ],
        [
            "8th districtFounded1869Barangays30"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRuperto C. Dualan • Vice MayorJunio C. Dualan • RepresentativeAniela Bianca D. Tolentino • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Rommel Anthony V. MagbintangMaria Teresa B. Puno(Suspended; Detained)Ferdinand S. WakayEimeren M. NazarenoBernardino H. LopezBonifacio M. Atienza Jr.Jerry C. BarreraRodrigo A. Castillo"
        ],
        [
            " • Electorate89,121 voters (2022)Area • Revenue₱ 392.3 million (2020) • Assets₱ 1,229 million (2020) • Expenditure₱ 300.7 million (2020) • Liabilities₱ 208.8 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code4110PSGC042115000IDD : area code +63 (0)46Native languagesTagalogMajor religions"
        ],
        [
            "Roman Catholicism"
        ],
        [
            "Protestantism"
        ],
        [
            "Aglipayan Church"
        ],
        [
            "Feast dateDecember 8Catholic dioceseDiocese of ImusPatron saintOur Lady of the Immaculate ConceptionWebsitewww.naic.cavite.gov.ph"
        ],
        [
            "Naic ( Naic has a land area of 76.24 square kilometers."
        ],
        [
            "Etymology"
        ],
        [
            "Naic, Cavite is one of the former barrios of Maragondon, along with 1) Magallanes (named after the Portuguese explorer Ferdinand Magellan); 2) Bailen (named after a town in Spain wherefrom the Friar Baltazar Narváez came, but renamed and now, General Emilio Aguinaldo, after the first President of the First Philippine Republic; 3) Tagaytay City, a former part of Alfonso; 4) Alfonso, (named after the King Alfonso who ascended the throne as a youngster, after his mother, a child Queen abdicated—after being enthroned by a General -later Count- Narváez); and 5) Ternate (a town with three names, Ternate, Wawa, Barra.",
            "Ternate was the name of the home in Mollucas of the settlers who were sent by the Dutch and Portuguese to the Philippines to fight the Chinese Pirates; Wawa was the name for this Shores-rich little site; Barra was the name given for this \"Docking Place or Site\" of Maragondon.)"
        ],
        [
            "Naic has several histories when it comes to the origin of its name.",
            "One theory suggests that it originated when a Spaniard asked a native about what the pig is doing and he said \"na-igik\" (crying sound of pigs), thus later on developed as Naic.",
            "Another one suggests that it came from a Spanish word \"Ca – Naic\" meaning \"neighboring place\" by which its mother town was the present Maragondon.",
            "Another theory put forward is that Naic is an acronym for Nuestra Adorada Immaculada Concepcion.",
            "The town's name is the Spanish translation of the town's patron saint, Our Lady of Immaculate Concepcion.",
            "As an honor and reverence to Our Lady of Immaculate Conception, the town folks celebrate annually their town fiesta on every 8th day of December."
        ],
        [
            "History"
        ],
        [
            "Thousands of years ago, Naic was a part of the towering Taal Volcano.",
            "Naic was the western slope of the volcano until its internal eruption which led to the sinking of its apex in its present condition."
        ],
        [
            "When the Jesuits discovered Maragondon in 1627, its total land area covers the whole of Naic, Ternate, and Magallanes (Vance; Saulo and De Ocampo, 1990; Medina, 1992).",
            "In 1758, the Jesuits founded a community in the western bank of the river (present Barangay Muzon) and made it into a \"sitio\" with a visita still under Maragondon."
        ],
        [
            "In 1791, the community was finally made into a town with its population still in the western bank.",
            "The town was named Naic after the old archaic word \"can(ia)ayic\" meaning \"town near one another\" or \"the other side\" (Medina, 1992), while Alfredo B. Saulo contends that Naic is a highly cultured Tagalog word meaning \"suburbs\" or \"countryside\".",
            "Also in Malaysia, Naic means \"overboard\"."
        ],
        [
            "Moreover, due to the closeness of Naic to the population in Maragondon, Naic transferred its center in 1798 to the eastern bank of the river (the present poblacion)(Medina, 1992).",
            "Also during this time, the town was already a flourishing fishing and agricultural village (Villanueva, 1982).",
            "On the other hand, the church, since 1797, was under the secular clergy who were mostly Filipinos (Jose, 1997; Medina, 1992).",
            "Upon the \"Royal Audiencia\" issued in 1849, the church was transferred to the Dominican Friars in 1865.",
            "The Dominicans upon finding out that the land in Naic was fertile, built the Casa Hacienda de Naic (the present Naic Elementary School) to be the administration building for the overseer of the larger friar lands in Naic (Jose, 1996)."
        ],
        [
            "In the Philippine Revolution of 1896–1898, all of the names of the towns in Cavite were Filipinized, thus, the name of Naic was changed to Naik, but was also commonly known as \"Maguagi\".",
            "Furthermore, five events significant to the revolution took place in Naic.",
            "These were as follows:"
        ],
        [
            "1.",
            "The designing of the first official flag of the country which took place in Sulok, Naic, Cavite (the present Velamart)."
        ],
        [
            "2.",
            "The creation of the Naic Military Agreement, a document by which Andres Bonifacio sought to assert his authority as leader of the Philippine revolutionary government in defiance of Emilio Aguinaldo's government initiated in Tejeros (Casa Hacienda de Naic)."
        ],
        [
            "3.",
            "The appointment of the first cabinet ministers including the Departments of Interior, Justice, Finance, and Defence (Casa Hacienda de Naic)."
        ],
        [
            "4.",
            "The Battle of Timalan where the Filipino revolutionists won overwhelmingly against the Spanish troops in May 1897 (Timalan, Naic Cavite)."
        ],
        [
            "5.",
            "The Battle of Naic where Aguinaldo declared the town to be his last defense (Poblation) (Medina, 1996, de Achutegui, 1972; Aguinaldo, 1964; T.A.",
            "Agoncillo, 1963)."
        ],
        [
            "6.",
            "The Founding of The Taparan Guerilla Unit in February 1942 by Lt. Col. Emilio Arenas, Tomas Arenas, and Jose Arenas-Paman, which delayed the invasion of Japanese Imperial forces and gave way to the safe flight of Naik's residents to Maragonon."
        ],
        [
            "The prominent people who paved the way for the revolution in Naic included former gobernadorcillos and capitanes municipal; namely, Cirilo Arenas, Gregorio (Goyo) Jocson, in whose house General Aguinaldo recuperated from illness, Benito Poblete, and Tobal Bustamante."
        ],
        [
            "A sprinkling of upperclassmen could also be found in other towns of Cavite whose wealth came from rural landholdings, urban properties, and/or successful business ventures.",
            "The Cuencas of Bacoor, the Papa, De Castro, Valentin, and Arenas families of Naic, the Darwins of Indang, who were/are Spanish nobilities and margraves with ranks of Duques, Marquis, Condes and Vizcondes, pertained to this class."
        ],
        [
            "From 1903 to 1917, the adjacent municipality of Ternate became part of Naic."
        ],
        [
            "Naic is also the very first town in the country to pass an ordinance banning pigs from the street.",
            "It had been a perennial problem of the country.",
            "It is one of the greatest achievement of Naic because the other towns followed suit."
        ],
        [
            "Geography"
        ],
        [
            "The municipality of Naic is located on the western part of the province along the shorelines of Manila Bay.",
            "Trece Martires City and Tanza bound it to the east.",
            "Situated beyond the southern portion of Naic is Indang and the western boundary is shared with Ternate and Maragondon.",
            "Naic is 36 kilometres (22 mi) from Imus and 46 kilometres (29 mi) from Metro Manila.",
            "Majority of the upland towns and some of those in lowlands trade with Naic due to its strategic geographical position.",
            "The coordinates of Naic are 14°32 latitude and 120°768 longitude."
        ],
        [
            "Barangays"
        ],
        [
            "Naic is politically subdivided into 30 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bagong Kalsada"
        ],
        [
            "Balsahan"
        ],
        [
            "Bancaan"
        ],
        [
            "Bucana Malaki"
        ],
        [
            "Bucana Sasahan"
        ],
        [
            "Calubcob"
        ],
        [
            "Capt.",
            "C. Nazareno (Poblacion)"
        ],
        [
            "Gombalza(Poblacion)"
        ],
        [
            "Halang"
        ],
        [
            "Humbac"
        ],
        [
            "Ibayo Estacion"
        ],
        [
            "Ibayo Silangan"
        ],
        [
            "Kanluran Rizal"
        ],
        [
            "Latoria"
        ],
        [
            "Labac"
        ],
        [
            "Mabolo"
        ],
        [
            "Malainen Bago"
        ],
        [
            "Malainen Luma"
        ],
        [
            "Maquina"
        ],
        [
            "Molino"
        ],
        [
            "Munting Mapino"
        ],
        [
            "Muzon"
        ],
        [
            "Palangue 2 & 3"
        ],
        [
            "Palangue Central"
        ],
        [
            "Sabang"
        ],
        [
            "San Roque"
        ],
        [
            "Santulan"
        ],
        [
            "Sapa"
        ],
        [
            "Timalan Balsahan"
        ],
        [
            "Timalan Concepcion"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Naic, Cavite"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "10(0.4)"
        ],
        [
            "10(0.4)"
        ],
        [
            "12(0.5)"
        ],
        [
            "27(1.1)"
        ],
        [
            "94(3.7)"
        ],
        [
            "153(6.0)"
        ],
        [
            "206(8.1)"
        ],
        [
            "190(7.5)"
        ],
        [
            "179(7.0)"
        ],
        [
            "120(4.7)"
        ],
        [
            "54(2.1)"
        ],
        [
            "39(1.5)"
        ],
        [
            "1,094(43)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5.2"
        ],
        [
            "4.5"
        ],
        [
            "6.4"
        ],
        [
            "9.2"
        ],
        [
            "19.7"
        ],
        [
            "24.3"
        ],
        [
            "26.9"
        ],
        [
            "25.7"
        ],
        [
            "24.4"
        ],
        [
            "21.0"
        ],
        [
            "12.9"
        ],
        [
            "9.1"
        ],
        [
            "189.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of NaicYearPop.±% p.a.1903 9,225—    1918 9,794+0.40%1939 13,813+1.65%1948 15,222+1.09%1960 27,818+5.15%1970 28,723+0.32%1975 32,130+2.27%1980 38,243+3.54%1990 51,629+3.05%1995 58,046+2.22%2000 72,683+4.94%2007 87,058+2.52%2010 88,144+0.45%2015 111,454+4.57%2020 160,987+7.50%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Naic, was 160,987 people, with a density of 2,100 inhabitants per square kilometer or 5,400 inhabitants per square mile."
        ],
        [
            "It is the 9th most populous and the 14th most densely populated municipality/city in the province.",
            "The massive increase can be observed in the year 1990 when industrialization was introduced in the Province of Cavite (including Naic).",
            "Investors established their businesses in different industrial estates that magnetized people to migrate to Cavite due to job opportunities the province offers.",
            "Another factor attributed to the increase of population is the mushrooming of housing subdivisions (such as Belmont Homes in Palangue and Dorothea Homes in both Halang and Calubcob).",
            "Natural increase also contributes to the increase in population.",
            "The population density of the municipality based on the 2015 census was 1,500 inhabitants per square kilometre or 3,800 inhabitants per square mile."
        ],
        [
            "Among the barangays in Naic, Barangay Ibayo Silangan has the biggest population with 11,250 people while Barangay Balsahan has registered the smallest population with 478 people."
        ],
        [
            "The population of Naic have grown from the past few years.",
            "In 1990 the recorded population count by the Philippine Statistics Authority is about 52,000, about 73,000 in year 2000 (which increased by 3.45%), 87,058 is recorded in 2007 (2.46% increase), about 88,000 in 2010 (0.39% increase) and 111,454 in 2015 (increased by 4.60%)."
        ],
        [
            "Languages"
        ],
        [
            "The vernacular language is Filipino, based mostly on the Tagalog of surrounding areas, and this Tagalog form used is the Manila form of spoken Tagalog which essentially become the lingua franca of the Philippines, having spread throughout the archipelago through mass media and entertainment.",
            "English is the language most widely used in education and business."
        ],
        [
            "Religion"
        ],
        [
            "The Catholic population of Naic is primarily served by the Diocesan Shrine of the Immaculate Conception Church.",
            "And there has been fast growth of other Protestant denominations including Iglesia ni Cristo.",
            "Aglipayan Church is the third majority denomination in town."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Naic"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  11.60"
        ],
        [
            "2009  8.35"
        ],
        [
            "2012  8.32"
        ],
        [
            "2015  12.33"
        ],
        [
            "2018  6.03"
        ],
        [
            "2021  11.67"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Elected officials"
        ],
        [
            "The following are the elected officials of the town elected last May 09, 2022 which serves until 2025:"
        ],
        [
            "Position"
        ],
        [
            "Official"
        ],
        [
            "Mayor"
        ],
        [
            "Ruperto C. Dualan (NPC)"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Junio C. Dualan (NPC)"
        ],
        [
            "Sangguniang Bayan Members"
        ],
        [
            "Party"
        ],
        [
            "Rommel Anthony V. Magbitang"
        ],
        [
            "NPC"
        ],
        [
            "Maria Teresa B. Puno"
        ],
        [
            "NPC"
        ],
        [
            "Ferdinand S. Wakay"
        ],
        [
            "NPC"
        ],
        [
            "Eimeren M. Nazareno"
        ],
        [
            "NUP"
        ],
        [
            "Bernardino H. Lopez"
        ],
        [
            "NPC"
        ],
        [
            "Bonifacio M. Atienza Jr."
        ],
        [
            "NPC"
        ],
        [
            "Jerry C. Barrera"
        ],
        [
            "NPC"
        ],
        [
            "Rodrigo A. Castillo"
        ],
        [
            "NPC"
        ],
        [
            "Roger N. Camilo"
        ],
        [
            "ABC President"
        ],
        [
            "Ma.",
            "Patricia R.Caparas"
        ],
        [
            "SK Federation President"
        ],
        [
            "Education"
        ],
        [
            "Education in the Philippines is managed and regulated by the Department of Education (DepEd), Commission on Higher Education (CHED) and Technical Education and Skills Development Authority (TESDA).",
            "DepEd is responsible for the K–12 basic education; it exercises full and exclusive control over public schools and nominal regulation overprivate schools, and it also enforces the national curriculum that has been put in place since 2013.",
            "CHED and TESDA, on the other hand, are responsible for higher education; CHED regulates the academically-oriented universities and colleges while TESDA oversees the development of technical and vocational education institutions and programs in the country."
        ],
        [
            "Public schools"
        ],
        [
            "High Schools"
        ],
        [
            "Naic Coastal National High School"
        ],
        [
            "Naic Integrated National High School"
        ],
        [
            "Ciudad Nuevo de Naic National High School (CNDNNHS)"
        ],
        [
            "Pueblo del Mar National High School"
        ],
        [
            "Centro de Naic National High School"
        ],
        [
            "Cavite State University (CvSU) Laboratory Science High School"
        ],
        [
            "Private schools"
        ],
        [
            "High-Schools"
        ],
        [
            "Colegio de Montessori"
        ],
        [
            "Cavite Community Academy"
        ],
        [
            "Colegio de Naic"
        ],
        [
            "Immaculate Concepcion School"
        ],
        [
            "King's Way Christian Academe"
        ],
        [
            "La Vlaize Integrated Science School"
        ],
        [
            "The Valley Cathedral Academy"
        ],
        [
            "Western Colleges"
        ],
        [
            "Far East Asia Pacific Institute of Tourism Science and Technology"
        ],
        [
            "Abeniano Delos Santos Academy Inc."
        ],
        [
            "See also"
        ],
        [
            "Casa Hacienda de Naic"
        ],
        [
            "Naic Military Agreement"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Naic |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Phase 2 Guerrillas"
        ],
        [
            "^ Magsasaka (28 May 2008).",
            "\"Kasaysayan at Kultura ng Cavite: HISTORY OF NAIC\"."
        ],
        [
            "^ THE INQUILINOS OF CAVITE AND FILIPINO CLASS STRUCTURE IN THE LATE NINETEENTH CENTURY, SOLEDAD BORROMEO-BUHLER."
        ],
        [
            "^ Act No.",
            "947 (October 15, 1903), An Act Reducing the Twenty-Three Municipalities of the Province of Cavite to Eleven, retrieved June 17, 2023"
        ],
        [
            "^ \"Naic: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 12 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cavite\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Naic."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Municipality of Naic – Cavite.gov.ph"
        ],
        [
            "Official website"
        ],
        [
            "Places adjacent to Naic"
        ],
        [
            "Manila Bay"
        ],
        [
            "TernateMaragondon"
        ],
        [
            "Naic"
        ],
        [
            "Tanza"
        ],
        [
            "Indang"
        ],
        [
            "Trece Martires"
        ],
        [
            "vte Province of CaviteTrece Martires  (de facto capital), Imus  (de jure capital)  Dasmariñas (largest city)Municipalities"
        ],
        [
            "Alfonso"
        ],
        [
            "Amadeo"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "Indang"
        ],
        [
            "Kawit"
        ],
        [
            "Magallanes"
        ],
        [
            "Maragondon"
        ],
        [
            "Mendez"
        ],
        [
            "Naic"
        ],
        [
            "Noveleta"
        ],
        [
            "Rosario"
        ],
        [
            "Silang"
        ],
        [
            "Tanza"
        ],
        [
            "Ternate"
        ],
        [
            "Component cities"
        ],
        [
            "Bacoor"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Tagaytay"
        ],
        [
            "Trece Martires"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Naic&oldid=1231810548\""
        ],
        [
            "Categories: Municipalities of CavitePopulated places on Manila BayHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from March 2018All articles needing additional referencesArticles containing Tagalog-language textCoordinates on WikidataPages with Tagalog IPAAll articles lacking reliable referencesArticles lacking reliable references from June 2020Commons category link from WikidataOfficial website different in Wikidata and WikipediaArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}