{
    "name": "Natividad",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Natividad, Pangasinan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°02′32″N 120°47′43″E﻿ / ﻿16.0422°N 120.7953°E﻿ / 16.0422; 120.7953"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pangasinan, Philippines"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesNatividadMunicipalityMunicipality of NatividadMunicipal hall"
        ],
        [
            "SealMotto: Lipad NatividadAnthem: Natividad HymnMap of Pangasinan with Natividad highlightedOpenStreetMapNatividadLocation within the PhilippinesCoordinates: 16°02′32″N 120°47′43″E﻿ / ﻿16.0422°N 120.7953°E﻿ / 16.0422; 120.7953CountryPhilippinesRegionIlocos RegionProvincePangasinanBarangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRosita G. Rafael • Vice MayorRodrigo L. Rafael • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ma.",
            "Luisa M. SupnetCarlota G. SupnetBetha Fe R. De GuzmanManuelito M. NovedaFrederick N. ZaragozaPablo G. MallaTirso C. DanipogEdgar A. Acosta"
        ],
        [
            " • Electorate17,981 voters (2022)Area • Revenue₱ 116 million (2020) • Assets₱ 323.8 million (2020) • Expenditure₱ 86.11 million (2020) • Liabilities₱ 22.82 million (2020)Service provider • ElectricityPangasinan 3 Electric Cooperative (PANELCO 3)Time zoneUTC+8 (PST)ZIP code2446PSGC015529000IDD : area code +63 (0)75Native languagesPangasinan Ilocano TagalogWebsitewww.natividad.gov.ph"
        ],
        [
            "Natividad, officially the Municipality of Natividad (Pangasinan: Baley na Natividad; Ilocano: Ili ti Natividad; Tagalog: Bayan ng Natividad), is a 4th class municipality in the province of Pangasinan, Philippines.",
            "According to the 2020 census, it has a population of 25,771 people."
        ],
        [
            "Etymology"
        ],
        [
            "There was no strong historical account as to how the town of Natividad got its name.",
            "It is believed however, that the name Natividad arose from the literal meaning of the birth or nativity of the town.",
            "The town of Natividad was born after the conversion of the community of people from the different parts of the Province of Pangasinan and neighboring provinces, into a Municipality that they came up with a name Natividad."
        ],
        [
            "History"
        ],
        [
            "The town of Natividad was once a conglomeration of barrios and sitios bounded by the Municipality of San Quintin on the south, San Nicolas on the north, and Tayug on the west."
        ],
        [
            "Dating back on December 12, 1901, this humble place was visited by a number of enterprising men who came from neighboring towns of Pangasinan and Ilocos Provinces.",
            "These people were looking for a location that could be a good place for settlements.",
            "On January 2 of the following year, these people finally settled in this place with their families.",
            "They added to the several groups of people living in the territory prior to their arrival."
        ],
        [
            "Because of increased number in people and area ran by a single leader whom they appointed, plans were drawn for the organization of a municipality.",
            "Organizational meetings and activities were undertaken to pursue this noble endeavor.",
            "The enactment of Act 371 of the Philippine Commission on March 7, 1902 that converted the community into a municipality awarded these people for their efforts and hard work."
        ],
        [
            "There were 11 barangays that emerged first and these are now the barangays of San Eugenio, Licud, Recodo, Barangobong, Amanit and San Modesto, from the Municipality of San Nicolas;  San Narciso, Canarem and Cabuaan, from the Municipality of Tayug;  and Tolin and Bucno from the Municipality of San Quintin."
        ],
        [
            "Natividad’s history takes a common story of new migrants from different places with the objectives to seek for new frontiers to conquer and new place to tame for settlements.",
            "People from the various quarters of Pangasinan, La Union, Ilocos Sur and Abra constituted to be the first inhabitants of the town."
        ],
        [
            "With the natural resources that the forest served, the people used these to cultivate the area and prepare the land for the production of their food supply and other needs.",
            "The present central and eastern sections of the municipality were then a dense forest wherein the people got most of their food supplies and farming materials."
        ],
        [
            "Values of industry, peacefulness, kindness and religiousness guided these first settlers, despite the difficulty of communication and transportation services, which was made even worse because they lived in very distant places, they remained close and intact.",
            "Their leaders showed good and exemplary behaviors and gave their best to improve the social life of the people."
        ],
        [
            "During the early part of the American sovereignty in the Philippines, an American with the name of Captain Joseph B. Batchelor of the American Army consequently made possible the foundation of a stronger and unified municipality.",
            "Captain Batchelor possessed the bearing and culture that spoke loudly on American and Anglo-Saxon traditions and ideals, thus, the inhabitants had their new and unique experiences during these times."
        ],
        [
            "Captain Batchelor became a big contributor in the development of the town for his dissemination and dedication to guide and help the people.",
            "He guided them with all integrity and educated them with noble examples of life, incorporating with them the American values of love of freedom and self-dissemination.",
            "These values later on were inculcated in the hearts and minds of the people and became their guides in their journey to life.",
            "In memory of this noble man and as a sign of gratitude, two barangays – Batchelor East and Batchelor West-of the town were named after him."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Natividad is politically subdivided into 18"
        ],
        [
            "barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Barangobong"
        ],
        [
            "Batchelor East"
        ],
        [
            "Batchelor West"
        ],
        [
            "Burgos (San Narciso)"
        ],
        [
            "Cacandungan"
        ],
        [
            "Calapugan"
        ],
        [
            "Canarem"
        ],
        [
            "Luna"
        ],
        [
            "Poblacion East"
        ],
        [
            "Poblacion West"
        ],
        [
            "Rizal"
        ],
        [
            "Salud"
        ],
        [
            "San Eugenio"
        ],
        [
            "San Macario Norte"
        ],
        [
            "San Macario Sur"
        ],
        [
            "San Maximo"
        ],
        [
            "San Miguel"
        ],
        [
            "Silag"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Natividad, belonging to the sixth congressional district of the province of Pangasinan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Mayor"
        ],
        [
            "Hon.",
            "Rosita G. Rafael"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Hon.",
            "Rodrigo L. Rafael"
        ],
        [
            "Councilors"
        ],
        [
            "Hon.",
            "Ma.",
            "Luisa M. Supnet"
        ],
        [
            "Hon.",
            "Carlota G. Supnet"
        ],
        [
            "Hon.",
            "Betha Fe R. De Guzman"
        ],
        [
            "Hon.",
            "Manuelito M. Noveda"
        ],
        [
            "Hon.",
            "Frederick N. Zaragoza"
        ],
        [
            "Hon.",
            "Pablo G. Malla"
        ],
        [
            "Hon.",
            "Tirso C. Danipog"
        ],
        [
            "Hon.",
            "Edgar A. Acosta"
        ],
        [
            "Gallery"
        ],
        [
            "Natividad Palace"
        ],
        [
            "Sky Plaza"
        ],
        [
            "Maranum Falls"
        ],
        [
            "Our Lady of Nativity Parish Church"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Natividad |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Natividad, Pangasinan."
        ],
        [
            "Natividad Profile at PhilAtlas.com"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Natividad at the Pangasinan Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Natividad, Pangasinan"
        ],
        [
            "San Nicolas"
        ],
        [
            "Tayug"
        ],
        [
            "Natividad"
        ],
        [
            "Carranglan, Nueva Ecija"
        ],
        [
            "San Quintin"
        ],
        [
            "vte Province of PangasinanLingayen (capital)  San Carlos City (largest city)Municipalities"
        ],
        [
            "Agno"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Anda"
        ],
        [
            "Asingan"
        ],
        [
            "Balungao"
        ],
        [
            "Bani"
        ],
        [
            "Basista"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos"
        ],
        [
            "Calasiao"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lingayen"
        ],
        [
            "Mabini"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Natividad"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Rosales"
        ],
        [
            "San Fabian"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Quintin"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sison"
        ],
        [
            "Sual"
        ],
        [
            "Tayug"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "San Carlos"
        ],
        [
            "Urdaneta"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan (Administratively independent from the province but grouped under Pangasinan by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Pangasinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Natividad,_Pangasinan&oldid=1217328653\""
        ],
        [
            "Category: Municipalities of PangasinanHidden categories: Pages using gadget WikiMiniAtlasArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}