{
    "name": "Noveleta",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Noveleta"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°26′N 120°53′E﻿ / ﻿14.43°N 120.88°E﻿ / 14.43; 120.88"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cavite, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Noveleta\" – news · newspapers · books · scholar · JSTOR (October 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesNoveleta"
        ],
        [
            "Tierra AltaMunicipalityMunicipality of Noveleta(From top, left to right): Downtown Crossing and Antonia Building, Holy Cross Parish Church, 1869 Old Tribunal Hall, Noveleta Municipal Hall, Public Market, Long Beach Resort."
        ],
        [
            "FlagSealNickname(s): Filipino: Bayan ng mga BayaniEnglish: (Town of Heroes)Motto(s): Filipino: Dangal at Pag-ibig sa Diyos at sa BayanEnglish: (Honor and Love for God and for the Country)Anthem: Noveleta HymnMap of Cavite with Noveleta highlightedOpenStreetMapNoveletaLocation within the PhilippinesCoordinates: 14°26′N 120°53′E﻿ / ﻿14.43°N 120.88°E﻿ / 14.43; 120.88CountryPhilippinesRegionCalabarzonProvinceCaviteDistrict"
        ],
        [
            "1st districtFoundedJanuary 5, 1868Founded byGen.",
            "Jose dela Gandera y NavarroNamed forVioleta (according to tradition)Barangays16"
        ],
        [
            "  (see Barangays)Government  • TypeCouncilors • MayorDino Reyes Chua • Vice MayorArlynn A. Torres • RepresentativeRamon Jolo Revilla • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Katherine B. ButawanEmelito S. LontocDonato B. AlvarezEdwin M. SaludElvira S. MagatRonel A. LamitRicky O. SariaDave M. ManaloJoshe Lorenz C. Reyes"
        ],
        [
            " • Electorate33,423 voters (2022)Area • Revenue₱ 173.9 million (2020) • Assets₱ 169.3 million (2020) • Expenditure₱ 164 million (2020) • Liabilities₱ 30.1 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code4105PSGC042116000IDD : area code +63 (0)46Native languagesTagalogMajor religions"
        ],
        [
            "Roman Catholicism"
        ],
        [
            "Aglipayan Church"
        ],
        [
            "Protestantism"
        ],
        [
            "Islam"
        ],
        [
            "Feast date"
        ],
        [
            "May 2  (Grand Karakol)"
        ],
        [
            "May 3  (Town Fiesta)"
        ],
        [
            "Ecclesiastical dioceses"
        ],
        [
            "Diocese of Imus (Roman Catholic)"
        ],
        [
            "Diocese of Cavite (Aglipayan Church)"
        ],
        [
            "Patron saint"
        ],
        [
            "Holy Cross  (Titular Patron of both Roman Catholic and Aglipayan Church)"
        ],
        [
            "Saint Helena of Constantinople  (Roman Catholic)"
        ],
        [
            "Nuestra Señora de la Paz y Buen Viaje  (Aglipayan Church)"
        ],
        [
            "Websitewww.noveleta.gov.ph"
        ],
        [
            "Noveleta, officially the Municipality of Noveleta (Tagalog: Bayan ng Noveleta), formerly known as Tierra Alta during the Spanish colonial era, is a 3rd class municipality in the province of Cavite, Philippines.",
            "According to the 2020 census, it has a population of 49,452 people."
        ],
        [
            "With the continuous expansion of Metro Manila, the municipality is now included in the Manila built-up area which reaches Lipa, Batangas in its southernmost part."
        ],
        [
            "History"
        ],
        [
            "Noveleta was originally a barrio of the municipality of Kawit (Cavite El Viejo) and some part of Cavite City (Dalahican).",
            "It was made an independent pueblo on January 5, 1868, by Gen. Jose dela Gandera y Navarro.",
            "Ironically, Noveleta was referred to by the Spaniards as Tierra Alta meaning higher ground as it was more elevated than Cavite la Punta (now Cavite City).",
            "The name Noveleta is said to have originated from Nueva Isla or (new island), a term frequently used by the Spaniards, referring to the locality.",
            "In the early years of the Spanish regime visiting priests described the place as Nueva Late (New fate or Fortune).",
            "In the course of time these terms Nueva Isla and Nueva Lete involved of Noveleta."
        ],
        [
            "But one legend tells the story of a beautiful maiden named Violeta who was betrothed by her father to a Spanish officer against her will.",
            "The unhappy girl, who was already engaged to a young Katipunero, committed suicide on the eve of her wedding to the Spaniard.",
            "The Spanish officer cried in deep anguish for the loss of his love, Madre de Dios, no Violeta!",
            "The phrase  No Violeta eventually became Noveleta."
        ],
        [
            "Noveleta has the distinction of leading a pivotal role in the Philippine revolutionary activities in Cavite.",
            "It used to be the seat of the Magdiwang Council of the Katipunan, the counterpart of the Magdalo Council under Gen. Emilio Aguinaldo in Kawit town (then Cavite el Viejo).",
            "The capture of the Noveleta Tribunal on August 31, 1896, was led by Gen. Mariano Alvarez, founder and president of the Sangguniang Bayan Magdiwang.",
            "Its revolutionary name is Magdiwang, meaning to celebrate a momentous event.",
            "The revolution against the Spanish colonialism produced five brave and able military generals and tacticians from Noveleta in the persons of Gen. Mariano Alvarez, Gen. Santiago Alvarez (Son of Mariano), Gen. Pascual Alvarez (Cousin of Pascual), Gen. Luciano San Miguel.",
            "He was the Last President of the Philippine Revolutionary Government after the capture of Gen. Mariano Trias (First Vice President of the Philippines) and Gen. Miguel Malvar of Batangas.",
            "Another hero is Gen. Ariston Villanueva who together with Gen. Santiago Alvarez emerged as the hero of the Battle of Calero."
        ],
        [
            "Geography"
        ],
        [
            "Noveleta is the smallest municipality of the Cavite province.",
            "It is 17 kilometres (11 mi) from Imus and 27 kilometres (17 mi) away from Metro Manila and is accessible by land transport modes.",
            "The municipality is bordered on the north by Cavite City, on the west by Manila Bay and Rosario.",
            "It is flanked by General Trias on the south and Kawit on the east."
        ],
        [
            "Land area"
        ],
        [
            "Noveleta has a total land area of 16.43 km2, which is roughly 5.41% of the total land area of the province of Cavite.",
            "The municipality has 16 barangays.",
            "Based on the 2007 Annual Report of the Municipality, the major land use include, residential, agricultural, saltbeds and fishponds and industrial."
        ],
        [
            "Barangays"
        ],
        [
            "Noveleta is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 042116001  Magdiwang"
        ],
        [
            " 4.5%"
        ],
        [
            " 2,233"
        ],
        [
            " 1,823"
        ],
        [
            "  ▴"
        ],
        [
            " 2.05%"
        ],
        [
            " 042116002  Poblacion"
        ],
        [
            " 4.4%"
        ],
        [
            " 2,176"
        ],
        [
            " 1,966"
        ],
        [
            "  ▴"
        ],
        [
            " 1.02%"
        ],
        [
            " 042116003  Salcedo I"
        ],
        [
            " 3.8%"
        ],
        [
            " 1,899"
        ],
        [
            " 2,166"
        ],
        [
            "  ▾"
        ],
        [
            " −1.31%"
        ],
        [
            " 042116004  San Antonio I"
        ],
        [
            " 11.1%"
        ],
        [
            " 5,513"
        ],
        [
            " 4,713"
        ],
        [
            "  ▴"
        ],
        [
            " 1.58%"
        ],
        [
            " 042116005  San Juan I"
        ],
        [
            " 6.0%"
        ],
        [
            " 2,973"
        ],
        [
            " 1,920"
        ],
        [
            "  ▴"
        ],
        [
            " 4.47%"
        ],
        [
            " 042116006  San Rafael I"
        ],
        [
            " 2.5%"
        ],
        [
            " 1,250"
        ],
        [
            " 1,258"
        ],
        [
            "  ▾"
        ],
        [
            " −0.06%"
        ],
        [
            " 042116007  San Rafael II"
        ],
        [
            " 7.1%"
        ],
        [
            " 3,521"
        ],
        [
            " 3,257"
        ],
        [
            "  ▴"
        ],
        [
            " 0.78%"
        ],
        [
            " 042116008  San Jose I"
        ],
        [
            " 2.9%"
        ],
        [
            " 1,455"
        ],
        [
            " 1,108"
        ],
        [
            "  ▴"
        ],
        [
            " 2.76%"
        ],
        [
            " 042116009  Santa Rosa I"
        ],
        [
            " 10.0%"
        ],
        [
            " 4,932"
        ],
        [
            " 3,180"
        ],
        [
            "  ▴"
        ],
        [
            " 4.49%"
        ],
        [
            " 042116010  Salcedo II"
        ],
        [
            " 13.0%"
        ],
        [
            " 6,414"
        ],
        [
            " 5,769"
        ],
        [
            "  ▴"
        ],
        [
            " 1.07%"
        ],
        [
            " 042116011  San Antonio II"
        ],
        [
            " 4.2%"
        ],
        [
            " 2,073"
        ],
        [
            " 1,736"
        ],
        [
            "  ▴"
        ],
        [
            " 1.79%"
        ],
        [
            " 042116012  San Jose II"
        ],
        [
            " 3.7%"
        ],
        [
            " 1,844"
        ],
        [
            " 1,116"
        ],
        [
            "  ▴"
        ],
        [
            " 5.15%"
        ],
        [
            " 042116013  San Juan II"
        ],
        [
            " 6.7%"
        ],
        [
            " 3,313"
        ],
        [
            " 2,741"
        ],
        [
            "  ▴"
        ],
        [
            " 1.91%"
        ],
        [
            " 042116014  San Rafael III"
        ],
        [
            " 12.5%"
        ],
        [
            " 6,165"
        ],
        [
            " 5,835"
        ],
        [
            "  ▴"
        ],
        [
            " 0.55%"
        ],
        [
            " 042116015  San Rafael IV"
        ],
        [
            " 5.0%"
        ],
        [
            " 2,456"
        ],
        [
            " 1,864"
        ],
        [
            "  ▴"
        ],
        [
            " 2.80%"
        ],
        [
            " 042116016  Santa Rosa II"
        ],
        [
            " 2.5%"
        ],
        [
            " 1,235"
        ],
        [
            " 1,226"
        ],
        [
            "  ▴"
        ],
        [
            " 0.07%"
        ],
        [
            "Total"
        ],
        [
            "49,452"
        ],
        [
            "41,678"
        ],
        [
            " ▴"
        ],
        [
            "1.72%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Noveleta, Cavite"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "10(0.4)"
        ],
        [
            "10(0.4)"
        ],
        [
            "12(0.5)"
        ],
        [
            "27(1.1)"
        ],
        [
            "94(3.7)"
        ],
        [
            "153(6.0)"
        ],
        [
            "206(8.1)"
        ],
        [
            "190(7.5)"
        ],
        [
            "179(7.0)"
        ],
        [
            "120(4.7)"
        ],
        [
            "54(2.1)"
        ],
        [
            "39(1.5)"
        ],
        [
            "1,094(43)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5.2"
        ],
        [
            "4.5"
        ],
        [
            "6.4"
        ],
        [
            "9.2"
        ],
        [
            "19.7"
        ],
        [
            "24.3"
        ],
        [
            "26.9"
        ],
        [
            "25.7"
        ],
        [
            "24.4"
        ],
        [
            "21.0"
        ],
        [
            "12.9"
        ],
        [
            "9.1"
        ],
        [
            "189.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of NoveletaYearPop.±% p.a.1903 2,343—    1918 2,886+1.40%1939 4,241+1.85%1948 5,003+1.85%1960 7,029+2.87%1970 10,560+4.15%1975 12,141+2.84%1980 14,460+3.56%1990 20,409+3.51%1995 27,306+5.61%2000 31,959+3.43%2007 39,294+2.89%2010 41,678+2.17%2015 45,846+1.83%2020 49,452+1.50%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Noveleta was 49,452 people, with a density of 3,000 inhabitants per square kilometre or 7,800 inhabitants per square mile."
        ],
        [
            "Religion"
        ],
        [
            "Holy Cross (titular patron of both Roman Catholic and Aglipayan Church), Saint Helena of Constantinople (Roman Catholic) and Nuestra Señora de la Paz y Buen Viaje (Aglipayan Church), Patron saints of Noveleta."
        ],
        [
            "Christianity"
        ],
        [
            "The majority of the people of Noveleta are Roman Catholic under the jurisdiction of the Diocese of Imus.",
            "Adherents of the Philippine Independent Church, also known as the Aglipayan Church, under the jurisdiction of the Diocese of Cavite is the second majority and third is Iglesia Ni Cristo but there has been fast growth of other Protestant denominations including Members Church of God International, Baptist, Pentecostal, Mormonism, Jehovah's Witnesses and Born Again Christian."
        ],
        [
            "Islam"
        ],
        [
            "With the influx of migrants from other provinces especially from Mindanao other non-Christian faiths particularly Islam is practiced in the town."
        ],
        [
            "Other faiths"
        ],
        [
            "Non-Abrahamic faiths include native-Tagalog Anitism, Animism and with the local Indian and Chinese communities Hinduism, Buddhism, Taoism and Confucianism are followed."
        ],
        [
            "Languages"
        ],
        [
            "The main languages spoken are Tagalog, and English.",
            "Due to the town a large number of people from farther provinces have migrated to Noveleta, resulting in minor but significant usage of the Bicolano, Cebuano, Ilocano, Hiligaynon and Waray languages."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Noveleta"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  2.90"
        ],
        [
            "2009  2.96"
        ],
        [
            "2012  3.42"
        ],
        [
            "2015  8.57"
        ],
        [
            "2018  4.07"
        ],
        [
            "2021  12.34"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The agricultural sector in Noveleta centers on crop production, fishery, livestock and poultry raising.",
            "Fishery is a major source of livelihood in the municipality.",
            "Around 100 hectares are utilized for aquaculture and fishpond activities, most of which are in Barangay San Rafael II, III, and IV.",
            "The main products of Noveleta include milk-fish, prawns, crabs, tilapia, mussels and oysters.",
            "The fishponds are converted to salt beds during the dry season.",
            "A big enterprise, which spurs the output in the service sector, is the presence of the Noveca Industries in Barangay Santa Rosa II.",
            "Manufacturing is limited to light and medium industries such as sash factories and several garment factories.",
            "Other activities are the manufacture of furniture, iron gates and grills, and hollowblocks.",
            "The construction boom, on the other hand, is due to the mushrooming of residential subdivisions in the area.",
            "A number of commercial establishments are located along Noveleta's major thoroughfares.",
            "Small retail stores, service firms, and some medium scale enterprises, dot the municipality.",
            "There are specialty stores engaged in the trade of construction supplies and materials, auto parts, furniture and home decors, sportswear as well as fresh food items like meat, fruits and vegetables.",
            "Also based in the town are three pharmacies, eleven bakeries and two gasoline stations.",
            "The tourism industry in Noveleta relies mainly on its coastline with Manila Bay bordering its western portion.",
            "Restaurants, cottages, conference rooms, and social halls/pavilions are situated along the beaches of Barangay San Rafael III and IV."
        ],
        [
            "Salt industry"
        ],
        [
            "In 2024, Noveleta's salt farmers revived their salt production, especially in Barangay San Rafael through the Bureau of Fisheries and Aquatic Resources and the Municipal Agriculture Office's assistance.",
            "Republic Act 8172, the \"Asin Law\" which required salt to be iodized, caused the decline of the production since 2000.",
            "However, the 2024 \"Philippine Salt Industry Development Act\" and Philippine Salt Industry Development Roadmap revitalized the ailing industry."
        ],
        [
            "Communication"
        ],
        [
            "The Philippine Postal Corporation manages one post office situated in the municipal building.",
            "The Bureau of Telecommunications of the Department of Transportation and Communication presently operates its office at the Old Noveleta Tribunal.",
            "PLDT, Globe and Digitel Telephone Company provide telephone services in the municipality."
        ],
        [
            "Banking"
        ],
        [
            "Four banks operating in the town of Noveleta are Banco de Oro (BDO), Bank of the Philippine Islands (BPI) Family Bank, the OUR Bank and the Rizal Commercial Banking Corporation (RCBC).",
            "There are other financial institutions in the area extending credit for investment ventures."
        ],
        [
            "Investments"
        ],
        [
            "The agricultural activities in the municipality are gradually decreasing due to urbanization.",
            "The current trend in Noveleta is in conversion of land from agriculture use to urban settlements.",
            "This may be attributed to its growing population and its proximity to Metro Manila and the Cavite Economic Processing Zone in Rosario, a 10-minute drive from Noveleta.",
            "Majority of Noveleta's population is involved in commercial and industrial activities.",
            "Historical and tourism landmarks include the Noveleta Tribunal, Calero Bridge, Villamar Beach Resort I, Villamar Beach Resort II, Lido Beach Resort, TIP Beach Resort and the New Noveleta Cockpit Arena.",
            "The strips of beaches in Noveleta combined with the town's proximity to major urban centers make it an ideal tourist attraction.",
            "Noveleta is included in the \"Manila Build-up Area\" which makes it ideal for housing and commercial developments.",
            "It is only 3 kilometers from Cavitex exit and also 3 kilometers to Sangley Point in Cavite City, the next International Airport."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Noveleta is best accessed through jeeps, and mini buses that frequently ply its major thoroughfares, specifically the roads that lead to Rosario, Bacoor, and Cavite City.",
            "Tricycles and pedicabs service the tight and cool backroads of the municipality."
        ],
        [
            "Electricity"
        ],
        [
            "The Manila Electric Company (Meralco) distributes the power supply of Noveleta from the Luzon Grid of the National Power Corporation (NPC)."
        ],
        [
            "Water supply"
        ],
        [
            "The Metropolitan Waterworks System in Noveleta provides the water requirement of Noveleta."
        ],
        [
            "But majority of the people in Noveleta uses Deep Well, specially on the remote area where the waterworks can't reach."
        ],
        [
            "Education"
        ],
        [
            "There are 39 schools in the municipality."
        ],
        [
            "Public primary schools"
        ],
        [
            "Noveleta Central Elementary School"
        ],
        [
            "Ambrocio S. Robles Memorial Elementary School"
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "Gen. Luciano San Miguel Elementary School"
        ],
        [
            "Salcedo Elementary School"
        ],
        [
            "Pacifico O. Aquino Elementary School"
        ],
        [
            "San Juan Elementary School"
        ],
        [
            "Public secondary school"
        ],
        [
            "Noveleta National High School"
        ],
        [
            "Noveleta Senior High School"
        ],
        [
            "Private schools"
        ],
        [
            "Atheneum School"
        ],
        [
            "Gospel Light Christian Academy"
        ],
        [
            "Saint Therese Catholic School"
        ],
        [
            "Holy Cross Catholic School"
        ],
        [
            "Montgard Learning Center"
        ],
        [
            "Unida Nehemiah Christian Academy"
        ],
        [
            "Patnubay Academy"
        ],
        [
            "College"
        ],
        [
            "Columbia College and Computer Technology Center"
        ],
        [
            "Mother Theresa Colegio de Noveleta"
        ],
        [
            "Cavite State University- Noveleta Campus"
        ],
        [
            "Healthcare"
        ],
        [
            "Noveleta has ten government health centers and one private clinic as of 1996.",
            "There is one private medical hospital located at Salcedo II.",
            "The municipality also has three ambulances to support the medical practitioners in responding to the needs of the populace."
        ],
        [
            "Government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Noveleta Municipal Hall."
        ],
        [
            "Elected officials"
        ],
        [
            "The following are the elected officials of the town elected last May 9, 2022 which serves until June 30, 2025:"
        ],
        [
            "Position"
        ],
        [
            "Official"
        ],
        [
            "Mayor"
        ],
        [
            "Dino Reyes Chua"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Arlynn Torres"
        ],
        [
            "Sangguniang Bayan  Members"
        ],
        [
            "Kate Bernal"
        ],
        [
            "Emelito Lontoc"
        ],
        [
            "Elvira Magat"
        ],
        [
            "Donato Alvarez"
        ],
        [
            "Dave Manalo"
        ],
        [
            "Enriq Joseph Alvarez"
        ],
        [
            "Ronel Lamit"
        ],
        [
            "Allan Villaluz (ABC President)"
        ],
        [
            "Joshe Lorenz Reyes (SK President)"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Noveleta |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Noveleta: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 12 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cavite\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Abrina, Dennis (May 4, 2024).",
            "\"Noveleta revives salt making industry\".",
            "The Manila Times.",
            "Retrieved May 5, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Noveleta."
        ],
        [
            "Noveleta at the Official Website of Cavite Province"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Noveleta"
        ],
        [
            "Manila Bay"
        ],
        [
            "Cavite City"
        ],
        [
            "Noveleta"
        ],
        [
            "Kawit"
        ],
        [
            "Rosario"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "vte Province of CaviteTrece Martires  (de facto capital), Imus  (de jure capital)  Dasmariñas (largest city)Municipalities"
        ],
        [
            "Alfonso"
        ],
        [
            "Amadeo"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "Indang"
        ],
        [
            "Kawit"
        ],
        [
            "Magallanes"
        ],
        [
            "Maragondon"
        ],
        [
            "Mendez"
        ],
        [
            "Naic"
        ],
        [
            "Noveleta"
        ],
        [
            "Rosario"
        ],
        [
            "Silang"
        ],
        [
            "Tanza"
        ],
        [
            "Ternate"
        ],
        [
            "Component cities"
        ],
        [
            "Bacoor"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Tagaytay"
        ],
        [
            "Trece Martires"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Noveleta&oldid=1230783423\""
        ],
        [
            "Categories: Municipalities of CavitePopulated places on Manila BayHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from October 2013All articles needing additional referencesPages using infobox settlement with possible nickname listPages using infobox settlement with possible motto listCoordinates on WikidataArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from July 2018Articles with unsourced statements from April 2018Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}