{
    "name": "Numancia",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Numancia, Aklan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°42′15″N 122°19′44″E﻿ / ﻿11.7042°N 122.3289°E﻿ / 11.7042; 122.3289"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Aklan, Philippines"
        ],
        [
            "Municipality in Western Visayas, PhilippinesNumanciaMunicipalityMunicipality of NumanciaChurch of Numancia"
        ],
        [
            "FlagSealMap of Aklan with Numancia highlightedOpenStreetMapNumanciaLocation within the PhilippinesCoordinates: 11°42′15″N 122°19′44″E﻿ / ﻿11.7042°N 122.3289°E﻿ / 11.7042; 122.3289CountryPhilippinesRegionWestern VisayasProvinceAklanDistrict"
        ],
        [
            "2nd districtFounded1920Barangays17"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJeserel T. Templonuevo • Vice MayorRogelio M. Enero II • RepresentativeTeodorico T. Haresco Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Mariel Cielo M. CochingJerome T. VegaRose F. NepomucenoFlorentino C. FernandezAdelma T. RegaladoJossel V. Maribojo Jr.Lilyn V. JauodRomeo N. Ricafuente"
        ],
        [
            " • Electorate24,163 voters (2022)Area • Revenue₱ 124.7 million (2020) • Assets₱ 410.8 million (2020) • Expenditure₱ 107.3 million (2020) • Liabilities₱ 96.16 million (2020)Service provider • ElectricityAklan Electric Cooperative (AKELCO)Time zoneUTC+8 (PST)ZIP code5604PSGC060416000IDD : area code +63 (0)36Native languagesAklanon Hiligaynon Tagalog"
        ],
        [
            "Numancia, officially the Municipality of Numancia (Aklanon: Banwa it Numancia; Hiligaynon: Banwa sang Numancia; Tagalog: Bayan ng Numancia), is a 4th class municipality in the province of Aklan, Philippines.",
            "Because of its proximity to the Capital Town of Kalibo, majority of its baranggays are classified as urbanized making the municipality the second most densely populated municipality in the province with 1,200 inhabitants per square kilometres.",
            "According to the 2020 census, it has a population of 35,693 people."
        ],
        [
            "Numancia is bounded on the east by Kalibo, the north by the Sibuyan Sea, the west by Makato, and the south by Lezo."
        ],
        [
            "History"
        ],
        [
            "This section has multiple issues.",
            "Please help improve it or discuss these issues on the talk page.",
            "(Learn how and when to remove these template messages)"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            "This section may need to be rewritten to comply with Wikipedia's quality standards.",
            "You can help.",
            "The talk page may contain suggestions.",
            "(October 2016)"
        ],
        [
            "This section possibly contains original research.",
            "Please improve it by verifying the claims made and adding inline citations.",
            "Statements consisting only of original research should be removed.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            " (Learn how and when to remove this message)"
        ],
        [
            "The original name of Numancia is Majanos.",
            "The name Majanos, of Malayan in origin, could mean \"lowland\" for this is the only town in the Province of Aklan that has no highland or even a small hill.",
            "From Numancia one can view the mountain of Majaas with its peak shaped like a sarok or sadok.",
            "The name Madyaas could have been a derivative of the word mataas meaning \"high\"."
        ],
        [
            "When the ten Malay Datus arrived from Borneo, they bought the island of Panay, formerly called the Aninipay from the Aeta Chief Marikudo.",
            "The transaction was known as the barter of Panay, Datu Puti gave a sarok to Marikudo and the gold necklace of Kapinagan, and wife of Datu Puti was given to Maniwangtiwan, the wife of Marikudo.",
            "There were other goods involved in the transaction and Marikudo gave the lowland area to Datu Puti and members of his party while Marikudo and his tribe occupied the high lands or the hills and the mountains."
        ],
        [
            "In about the year 1213 A.D. after having explored the whole island, the Malay leaders met and organized the Madjaas Confederacy or the Katilingban it Madjaas.",
            "They divided the islands in three sakops or provinces and naming them Akean, Hantik and Irong-Irong.",
            "Sumakwel was assigned as head of Hantik, Bangkaya was assigned as head of Akean, and Paiburong was assigned as head of Irong-Irong.",
            "Sumakwel who was the senior among the three heads was chosen by popular votes to head the confederation."
        ],
        [
            "The capitals of each sakop or province are the following: Bugasong in Hantik, Ogtom in Irong-Irong and Madjanos in Akean.",
            "Since Sumakwel was the first punu-an of the Madjaas Confederacy, Bugasong was the first capital of Panay."
        ],
        [
            "Many historical accounts have different versions about the exact locations of the first settlement established by Bangkaya in Aklan.",
            "In Numancia there is still the small river called Madjanos that serves the boundary between Marianos and Languinbanwa.",
            "This river used to be wide and navigable.",
            "According to the old folks, sailboats used to sail up to this river but because of floods, mudflows and silting, it became narrow and shallow."
        ],
        [
            "Barangay Marianos could be the very place where Datu bangkaya and his family lived together with the other Malay families who arrived with him.",
            "The present name of this barangay was corrupted to Marianos.",
            "It is not difficult to guess with less margin of error that the original name of this barangay is Madjanos considering that the Madjanos River is still there retaining its old name."
        ],
        [
            "In the course of time, Madjanos like the other settlements in the island of Panay became a thriving community.",
            "The population increased and more settlers came.",
            "Many other settlements were established and were scattered throughout the whole province up to what is now the province of Capiz, Capiz was formerly a part of Aklan but later the whole province was named Capiz during the arrival of Legaspi in Panay."
        ],
        [
            "The eighteenth century records in the national archive and historical sketches by some local chroniclers show that there were two names mentioned pertaining to the town of Numancia.",
            "They were Madjanos and Lawan.",
            "Lawan consists of what is now Albasan is located along seashores while Madjanos located inland.",
            "Madjanos is grown into a township, when reached up to the west bank of Aklan River.",
            "It has its own church and trading post."
        ],
        [
            "Since the confederation has expanded to include Lusong, Buglas, Rorom, Sugbo and Mait, volumes of trades increased.",
            "Chinese, Indonesians and Malayan traders came to trade.",
            "When Balinganga, the son of Datu Bangkaya, was the Punuan of the Minuro it Aklan and at the same time the head of Madjaas Confederacy and shortly after the death of Datu Paiburong, Madjanos was again the seat of the whole government of Panay and consequently became the national capital of Pre-Hispanic Philippines."
        ],
        [
            "The Minuro it Aklan became the clearing port of immigrants coming from other places.",
            "For more than fifty years Balinganga ruled the confederacy reminding his subject about the Code of Sumakwel.",
            "In the meanwhile, he followed the policy of his father throughout the Katilingban of Madjaas.",
            "From the death of Balinganga up to the arrival of Legaspi in 1570, several successors has ruled the province of Aklan and the seat of the government was transferred to different places due to demographic movement and the exigency of time."
        ],
        [
            "The old site of Madjanos, which is quite neglected, was renamed Laguinbanwa meaning \"old town\" in 1620 to revive the former vitality of the community.",
            "The town of Laguinbanwa included the territories, which is now occupied by Lezo and Numancia.",
            "But as the community across the Aklan River became more prosperous, the seat of the town was transferred in 1785 to what is now Kalibo, and Lezo and Numancia became barrios of Kalibo."
        ],
        [
            "As the town of Kalibo grew in importance it has become the hub where people gathered for important celebrations and where other municipalities pay their tribute money or taxes.",
            "Every Sunday people faithfully attended mass in Kalibo since the priests make church attendance compulsory especially during fiestas and other religious holidays.",
            "Fearing hell and the ire of the church authorities, the people were docile followers of the priests and hence, they found it necessary to hear mass and made confessions for the absolutions of their sins."
        ],
        [
            "At the time, however, there were no good roads, only trails and there were no strong bridges to span wide Aklan River.",
            "During the rainy season, it was difficult to cross the swollen river.",
            "In view of this, the residents of Laguinbanwa and Guicod petitioned to the bishop of Cebu and the Military governor of the Visayas to allow them to build their own church and to have a separate municipality explaining their problems and difficulties."
        ],
        [
            "After assessing the situation, the Bishop of Cebu and the military governor of the Visayas considered that the people of Laguinbanwa and Guicod are capable of providing tribute tax to run their own municipality informed the leaders of Laguinbanwa that they interpose no objection to their objection to separate from Kalibo.",
            "They requested that delegates should be sent to Kalibo were representatives of the bishop and the military governor will hear their cases."
        ],
        [
            "A delegation from Laguinbanwa headed by Silvino Kimpo met the representative of the bishop and the military governor of the Visayas in Kalibo where they talked about their petition.",
            "When they were asked where to place their town and where to build their church, they explained that the consensus of the people in Laguinbanwa, Madjanos, and Lauan and also Guicod was to put the Poblacion in what is now the site of Numancia being the center of these communities.",
            "Most of the members of the delegation of Tan Binong came from Madjanos and Laguinbanwa.",
            "So in 1856 Numancia was constituted as a municipality with Silvino Kimpo as the First Head of Kapitan Basal The appointment was approved by the Provincial Chief Executive and carried a term of two years."
        ],
        [
            "Numancia as integrated with Banga, Lezo, and Kalibo"
        ],
        [
            "When the Americans came in 1899, the military government appointed Felix Kimpo as head of the town.",
            "During the election in 1901 he was elected as the president from 1901 to 1903.",
            "At that time there were 34 towns in the province of Capiz, but these were reduced to 24 towns by a law passed by the civil Commission when it was found out that some towns were incapable of meeting their financial obligations and maintenance.",
            "So on March 4, 1904, an executive order was passed fusing Banga, Lezo, Numancia, and Kalibo into one municipality."
        ],
        [
            "Numancia as Barrio of Lezo/Lezo as Part of Numancia"
        ],
        [
            "Five years after on July 31, 1909, the civil commission passed another law separation Lezo and Numancia from Kalibo and making Lezo as the seat of government.",
            "Numancia then, became a barrio of Lezo.",
            "In 1920 the situation was reversed with regards to the status of Lezo and Numancia.",
            "By Executive Order No.",
            "17, series of 1920, the seat of government was transferred to Numancia and Lezo became a barrio of Numancia."
        ],
        [
            "Separation of Lezo from Numancia"
        ],
        [
            "Before the outbreak of the Second World War, President Manuel L. Quezon issued Executive Order No.",
            "364 series of 1941 dated August 28, 1941 making Lezo a separate municipality from Numancia.",
            "The actual inauguration for the separation of Lezo from Numancia was deferred to January 1, 1945.",
            "On this date both Lezo and Numancia became separate municipalities."
        ],
        [
            "Geography"
        ],
        [
            "Numancia is 5 kilometres (3.1 mi) from Kalibo, the provincial capital."
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 28.84 square kilometres (11.14 sq mi)  constituting 1.58% of the 1,821.42-square-kilometre- (703.25 sq mi) total area of Aklan."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Numancia, Aklan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "47(1.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "39(1.5)"
        ],
        [
            "48(1.9)"
        ],
        [
            "98(3.9)"
        ],
        [
            "150(5.9)"
        ],
        [
            "169(6.7)"
        ],
        [
            "147(5.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "172(6.8)"
        ],
        [
            "118(4.6)"
        ],
        [
            "80(3.1)"
        ],
        [
            "1,264(49.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "8.2"
        ],
        [
            "9.3"
        ],
        [
            "9.7"
        ],
        [
            "19.1"
        ],
        [
            "25.6"
        ],
        [
            "27.4"
        ],
        [
            "25.5"
        ],
        [
            "25.5"
        ],
        [
            "25.2"
        ],
        [
            "18.5"
        ],
        [
            "14.5"
        ],
        [
            "219.9"
        ],
        [
            "Source: Meteoblue (Use with caution: this is modeled/calculated data, not measured locally.)"
        ],
        [
            "Barangays"
        ],
        [
            "Numancia is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Currently, barangays Poblacion, Bulwang, Laguinbanua East and West are considered urban while the rest are classified as rural."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 060416001   Albasan"
        ],
        [
            " 4.3%"
        ],
        [
            " 1,526"
        ],
        [
            " 1,503"
        ],
        [
            "  ▴"
        ],
        [
            " 0.15%"
        ],
        [
            " 060416002   Aliputos"
        ],
        [
            " 7.0%"
        ],
        [
            " 2,493"
        ],
        [
            " 2,132"
        ],
        [
            "  ▴"
        ],
        [
            " 1.58%"
        ],
        [
            " 060416003   Badio"
        ],
        [
            " 4.3%"
        ],
        [
            " 1,551"
        ],
        [
            " 1,470"
        ],
        [
            "  ▴"
        ],
        [
            " 0.54%"
        ],
        [
            " 060416004   Bubog"
        ],
        [
            " 4.6%"
        ],
        [
            " 1,647"
        ],
        [
            " 1,639"
        ],
        [
            "  ▴"
        ],
        [
            " 0.05%"
        ],
        [
            " 060416006   Bulwang"
        ],
        [
            " 12.3%"
        ],
        [
            " 4,401"
        ],
        [
            " 4,170"
        ],
        [
            "  ▴"
        ],
        [
            " 0.54%"
        ],
        [
            " 060416007   Camanci Norte"
        ],
        [
            " 8.1%"
        ],
        [
            " 2,880"
        ],
        [
            " 2,488"
        ],
        [
            "  ▴"
        ],
        [
            " 1.47%"
        ],
        [
            " 060416008   Camanci Sur"
        ],
        [
            " 3.0%"
        ],
        [
            " 1,085"
        ],
        [
            " 977"
        ],
        [
            "  ▴"
        ],
        [
            " 1.05%"
        ],
        [
            " 060416009   Dongon East"
        ],
        [
            " 5.4%"
        ],
        [
            " 1,915"
        ],
        [
            " 1,593"
        ],
        [
            "  ▴"
        ],
        [
            " 1.86%"
        ],
        [
            " 060416010   Dongon West"
        ],
        [
            " 6.1%"
        ],
        [
            " 2,185"
        ],
        [
            " 2,071"
        ],
        [
            "  ▴"
        ],
        [
            " 0.54%"
        ],
        [
            " 060416011   Joyao-Joyao"
        ],
        [
            " 4.8%"
        ],
        [
            " 1,696"
        ],
        [
            " 1,609"
        ],
        [
            "  ▴"
        ],
        [
            " 0.53%"
        ],
        [
            " 060416012   Laguinbanua East"
        ],
        [
            " 6.6%"
        ],
        [
            " 2,354"
        ],
        [
            " 2,081"
        ],
        [
            "  ▴"
        ],
        [
            " 1.24%"
        ],
        [
            " 060416013   Laguinbanua West"
        ],
        [
            " 4.8%"
        ],
        [
            " 1,714"
        ],
        [
            " 1,708"
        ],
        [
            "  ▴"
        ],
        [
            " 0.04%"
        ],
        [
            " 060416014   Marianos"
        ],
        [
            " 2.9%"
        ],
        [
            " 1,052"
        ],
        [
            " 1,003"
        ],
        [
            "  ▴"
        ],
        [
            " 0.48%"
        ],
        [
            " 060416015   Navitas"
        ],
        [
            " 4.1%"
        ],
        [
            " 1,451"
        ],
        [
            " 1,465"
        ],
        [
            "  ▾"
        ],
        [
            " −0.10%"
        ],
        [
            " 060416016  Poblacion"
        ],
        [
            " 4.4%"
        ],
        [
            " 1,573"
        ],
        [
            " 1,536"
        ],
        [
            "  ▴"
        ],
        [
            " 0.24%"
        ],
        [
            " 060416017   Pusiw"
        ],
        [
            " 4.1%"
        ],
        [
            " 1,454"
        ],
        [
            " 1,484"
        ],
        [
            "  ▾"
        ],
        [
            " −0.20%"
        ],
        [
            " 060416018   Tabangka"
        ],
        [
            " 2.7%"
        ],
        [
            " 957"
        ],
        [
            " 933"
        ],
        [
            "  ▴"
        ],
        [
            " 0.25%"
        ],
        [
            "Total"
        ],
        [
            "35,693"
        ],
        [
            "29,862"
        ],
        [
            " ▴"
        ],
        [
            "1.80%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of NumanciaYearPop.±% p.a.1903 6,548—    1939 12,883+1.90%1948 9,065−3.83%1960 10,194+0.98%1970 12,285+1.88%1975 13,764+2.31%1980 16,216+3.33%1990 19,899+2.07%1995 22,356+2.21%2000 24,614+2.08%2007 27,570+1.58%2010 29,862+2.95%2015 31,934+1.29%2020 35,693+2.21%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Numancia had a population of 35,693.",
            "The population density was 1,200 inhabitants per square kilometre (3,100/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Numancia"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  11.00"
        ],
        [
            "2009  24.35"
        ],
        [
            "2012  9.08"
        ],
        [
            "2015  12.60"
        ],
        [
            "2018  6.61"
        ],
        [
            "2021  11.03"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Numancia's tourist attractions include beach resort situated along coastline barangays like the Doña Crispina Beach Resort and Hotel and other existing Beach resorts in Barangay Navitas and in Barangay Camanci Norte and Nadal Castle in Laguinbanua West (Nadal Castle is already closed; Allegedly due to bankruptcy)."
        ],
        [
            "Education"
        ],
        [
            "Numancia is home to the lone seminary in Aklan.",
            "By reason of its proximity to Kalibo, only few schools were established in the town.",
            "The following are the major schools of the municipality:"
        ],
        [
            "Santo Niño Seminary"
        ],
        [
            "Numancia National School of Fisheries"
        ],
        [
            "Madyaas Institute"
        ],
        [
            "Irao Institute"
        ],
        [
            "Numancia Integrated School"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Numancia |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "364; Segregating from the Municipality of Numancia, Province of Capiz, the Barrio of Lezo and Organizing the Same Into a Separate Municipality Under the Name of Lezo, with the Seat of Government at the Barrio of Lezo\".",
            "Official Gazette of the Republic of the Philippines.",
            "Malacañan Palace, Manila, Philippines.",
            "28 August 1941.",
            "Retrieved 21 October 2016."
        ],
        [
            "^"
        ],
        [
            "\"Province: Aklan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Numancia: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 1 May 2020."
        ],
        [
            "^ \"Municipal: Numancia, Aklan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Aklan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Numancia, Aklan."
        ],
        [
            "Numancia Municipal Library"
        ],
        [
            "Places adjacent to Numancia, Aklan"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "Makato"
        ],
        [
            "Numancia"
        ],
        [
            "Kalibo"
        ],
        [
            "Lezo"
        ],
        [
            "vte Province of AklanKalibo (capital and largest municipality)Municipalities"
        ],
        [
            "Altavas"
        ],
        [
            "Balete"
        ],
        [
            "Banga"
        ],
        [
            "Batan"
        ],
        [
            "Buruanga"
        ],
        [
            "Ibajay"
        ],
        [
            "Kalibo"
        ],
        [
            "Lezo"
        ],
        [
            "Libacao"
        ],
        [
            "Madalag"
        ],
        [
            "Makato"
        ],
        [
            "Malay"
        ],
        [
            "Malinao"
        ],
        [
            "Nabas"
        ],
        [
            "New Washington"
        ],
        [
            "Numancia"
        ],
        [
            "Tangalan"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Numancia,_Aklan&oldid=1163587349\""
        ],
        [
            "Category: Municipalities of AklanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles needing additional references from October 2016All articles needing additional referencesWikipedia articles needing rewrite from October 2016All articles needing rewriteArticles that may contain original research from October 2016All articles that may contain original researchArticles with multiple maintenance issuesAll articles with unsourced statementsArticles with unsourced statements from October 2016Commons category link from WikidataArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}