{
    "name": "Ocampo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Ocampo, Camarines Sur"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°33′34″N 123°22′34″E﻿ / ﻿13.5594°N 123.3761°E﻿ / 13.5594; 123.3761"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Camarines Sur, Philippines"
        ],
        [
            "Municipality in Bicol Region, PhilippinesOcampo"
        ],
        [
            "MabatobatoMunicipalityMunicipality of OcampoMunicipal Hall"
        ],
        [
            "FlagMotto: Padagos Ocampo!Map of Camarines Sur with Ocampo highlightedOpenStreetMapOcampoLocation within the PhilippinesCoordinates: 13°33′34″N 123°22′34″E﻿ / ﻿13.5594°N 123.3761°E﻿ / 13.5594; 123.3761CountryPhilippinesRegionBicol RegionProvinceCamarines SurDistrict"
        ],
        [
            "3rd districtFounded1949Barangays25"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRonald Allan J.",
            "Go • Vice MayorEula C. Fomalejo • RepresentativeGabriel H. Bordado Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Fidel R. Carido Jr.Vilma P. OlarteKenneth Sean A. BihagBernard C. AquilerJayson J. YamsonLeonil U. AlfelorJose V. DacuyaMidel P. Tanay"
        ],
        [
            " • Electorate29,764 voters (2022)Area • Revenue₱ 155.6 million (2020) • Assets₱ 335.4 million (2020) • Expenditure₱ 119 million (2020) • Liabilities₱ 112.2 million (2020)Service provider • ElectricityCamarines Sur 4 Electric Cooperative  (CASURECO 4)Time zoneUTC+8 (PST)ZIP code4419PSGC051725000IDD : area code +63 (0)54Native languagesCentral BikolTagalogWebsiteocampo.camarinessur.gov.ph"
        ],
        [
            "Ocampo, officially the Municipality of Ocampo (Central Bikol: Banwaan kan Ocampo; Rinconada Bikol: Banwāan ka Ocampo; Tagalog: Bayan ng Ocampo), is a 1st class municipality in the province of Camarines Sur, Philippines.",
            "According to the 2020 census, it has a population of 51,073 people."
        ],
        [
            "Ocampo is 14 kilometres (8.7 mi) from Pili and 464 kilometres (288 mi) from Manila."
        ],
        [
            "History"
        ],
        [
            "Don Julian Ocampo, former governor of Camarines Sur, is the namesake of the town."
        ],
        [
            "The municipality of Ocampo traced its existence as the former “Mission de Mabatobato” launched by the Franciscan friars in 1735.",
            "The place was named “Mabatobato” because of the presence of huge rocks scattered all over the place believed to have erupted from Mt.",
            "Isarog.",
            "As a mission, it has four barrios; Ayugan, Tinablanan, Pinit and Moriones."
        ],
        [
            "In the early 1800s, people from neighboring towns began to flock the area to settle and till the vast areas of lands suited for agriculture.",
            "The place began to flourish that the people began to dream of transforming the settlement into a new municipality.",
            "Cabeza de Barangay Michael Alcantara and Don Jose Barangbang requested and pleaded to the Bishop of Caceres to make the barrio into a town.",
            "The request was granted."
        ],
        [
            "In 1917, Mabatobato was annexed to the municipality of Pili to help it recover from the Spanish–American War and for effective governance.",
            "By 1922 it was made into a new parish.",
            "Baptisms and burials were first recorded that year.",
            "The place began to flourish again and influx of immigrants from neighboring towns as well as from Batangas and Tayabas were observed."
        ],
        [
            "After three decades, the leaders and the people of Mabatobato began to clamor for independence and to govern themselves once again.",
            "In 1948, during the incumbency of Congressman Sebastian C. Moll, Jr., 2nd District Camarines Sur, the dream to separate had been brewed.",
            "President Elpidio Quirino signed Executive Order No.",
            "243 dated 15 July 1949 entitled: “Organizing Certain Barrios of the Municipality of Pili, Camarines Sur, into an Independent Municipality under the name of OCAMPO”."
        ],
        [
            "Mabatobato was renamed in honor of Don Julian Ocampo who was the Governor of Camarines Sur in the 1930s.",
            "Upon the appointment and qualification of the first municipal officials, Ocampo has begun to officially exist as an independent municipality on August 10, 1949."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Ocampo is politically subdivided into 25 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Ayugan"
        ],
        [
            "Cabariwan"
        ],
        [
            "Cagmanaba"
        ],
        [
            "Del Rosario"
        ],
        [
            "Gatbo"
        ],
        [
            "Guinaban"
        ],
        [
            "Hanawan"
        ],
        [
            "Hibago"
        ],
        [
            "La Purisima Nuevo"
        ],
        [
            "May-Ogob"
        ],
        [
            "New Moriones"
        ],
        [
            "Old Moriones"
        ],
        [
            "Pinit"
        ],
        [
            "Poblacion Central"
        ],
        [
            "Poblacion East"
        ],
        [
            "Poblacion West"
        ],
        [
            "Salvacion"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Jose Oras"
        ],
        [
            "San Roque Commonal"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santo Niño"
        ],
        [
            "Villaflorida"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Ocampo, Camarines Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "37(99)"
        ],
        [
            "38(100)"
        ],
        [
            "36(97)"
        ],
        [
            "35(95)"
        ],
        [
            "33(91)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "34(94)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "36.66(1.44)"
        ],
        [
            "58.6(2.31)"
        ],
        [
            "37.91(1.49)"
        ],
        [
            "76.31(3.00)"
        ],
        [
            "98.34(3.87)"
        ],
        [
            "151.99(5.98)"
        ],
        [
            "288.39(11.35)"
        ],
        [
            "291.41(11.47)"
        ],
        [
            "186.77(7.35)"
        ],
        [
            "363.21(14.30)"
        ],
        [
            "97.5(3.84)"
        ],
        [
            "292.1(11.50)"
        ],
        [
            "1,979.19(77.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18"
        ],
        [
            "23"
        ],
        [
            "16"
        ],
        [
            "17"
        ],
        [
            "25"
        ],
        [
            "28"
        ],
        [
            "31"
        ],
        [
            "26"
        ],
        [
            "27"
        ],
        [
            "29"
        ],
        [
            "24"
        ],
        [
            "29"
        ],
        [
            "293"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of OcampoYearPop.±% p.a.1960 14,572—    1970 18,757+2.55%1975 19,283+0.56%1980 24,794+5.15%1990 30,876+2.22%1995 34,898+2.32%2000 36,316+0.86%2007 39,759+1.26%2010 43,523+3.35%2015 45,934+1.03%2020 51,073+2.11%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Ocampo, Camarines Sur, was 51,073 people, with a density of 430 inhabitants per square kilometre or 1,100 inhabitants per square mile."
        ],
        [
            "Language"
        ],
        [
            "The Partido variant of Central Bikolano is the primary language spoken in the entire town.",
            "Riŋkonāda or Rinconada Bikol is spoken by a minority of the population, along with the Naga variant of Central Bikolano.",
            "Tagalog and English are also spoken and understood."
        ],
        [
            "Isarog Agta Language"
        ],
        [
            "In 2010, UNESCO released its 3rd world volume of Endangered Languages in the World, where 3 critically endangered languages were in the Philippines.",
            "One of these languages in the Isarog Agta language which has an estimated speaker of 5 people in the year 2000.",
            "The language was classified as Critically Endangered, meaning the youngest speakers are grandparents and older, and they speak the language partially and infrequently and hardly pass the language to their children and grandchildren anymore.",
            "If the remaining 150 people do not pass their native language to the next generation of Isarog Agta people, their indigenous language will be extinct within a period of 1 to 2 decades."
        ],
        [
            "The Isarog Agta people live within the circumference of Mount Isarog, though only 5 of them still know their indigenous language.",
            "They are one of the original Negrito settlers in the entire Philippines.",
            "They belong to the Aeta people classification, but have distinct language and belief systems unique to their own culture and heritage."
        ],
        [
            "Religion"
        ],
        [
            "The religious groups in the locality are: Roman Catholic, Seventh Day Adventist, The Church of Jesus Christ of Latter Day Saints, Jehovah's Witnesses, Iglesia Ni Cristo, Word International Ministries and other groups of Born-Again Christians."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Ocampo"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  51.10"
        ],
        [
            "2009  43.83"
        ],
        [
            "2012  31.47"
        ],
        [
            "2015  35.04"
        ],
        [
            "2018  30.99"
        ],
        [
            "2021  38.81"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Ocampo Public Market & Terminal"
        ],
        [
            "Commercial establishments include internet shops, bank, pawnshops, hardware stores, groceries, drug stores, eateries, computer shops, bakeries, motorcycle dealers, agri-dealers, gas stations and several ricemills.",
            "Various businesses are sprouting."
        ],
        [
            "Local products include palay, corn, root crops, sugarcane, coconut, and vegetables.",
            "Livestock and poultry products are also available."
        ],
        [
            "CASURECO IV supplies power requirement in the town."
        ],
        [
            "Tourism"
        ],
        [
            "Deer farm in Ocampo"
        ],
        [
            "Tourist destinations include the province-owned: Ocampo Deer Farm in Barangay Santa Cruz, Bamboo Farm in Barangay Hanawan and Murokburok Spring in Barangay Gatbo.",
            "There's also Tera Mater Resort, the first resort in the town, located in Barangay New Moriones and a newly opened resort in Barangay San Antonio."
        ],
        [
            "Ocampo Deer Farm is situated at an elevated area about four kilometers up in the forests of Mt.",
            "Isarog, in Barangay Santa Cruz, the 28-hectare reindeer farm is considered as the original reindeer farm of the Philippines.",
            "It was stocked entirely with Australian species such as Blackbuck Antelope, Fallow Deer, Chital Deer, Red Deer and Elk."
        ],
        [
            "The farm was started late in 1996 with only 208 heads of five species from Australia.",
            "As of today, the number remains at 220 heads.",
            "Its goal was to make the province a supplier of deer meat (venison) which is a delicacy in class restaurants while the hides can be used as material for bags belts and other goods, and the antlers can be extracted for medicinal value."
        ],
        [
            "Pacific Santa's Inc., founded by Santa R-Kayma Klaws, is entering an exclusive management agreement with the provincial government to micro-manage and promote the farm."
        ],
        [
            "The Bicol Strawberry Farm owned by the Libreja family is found in Barangay Pinit."
        ],
        [
            "Fiestas and festivals"
        ],
        [
            "The town fiesta of Ocampo is celebrated in the month August in commemoration of the town's patron saint, Saint Bernard Abbot.",
            "The only festival at Ocampo is the Tinagba Festival which showcases the locally produced products of the town.",
            "It is celebrated annually during the month of August a week before the town fiesta.",
            "During this time, various activities are done."
        ],
        [
            "Transportation"
        ],
        [
            "The town is the gateway to 4th District of Camarines Sur, and via Hanawan junction, Consocep falls northward and Iriga City southward.",
            "Accessible by land transportation, via National Highway going to Lagonoy, Camarines Sur.",
            "From Naga City, the easiest way to go to the town is to ride a bus going to Lagonoy from the Naga City Central Bus Terminal and disembark at Ocampo Poblacion bus stop."
        ],
        [
            "Education"
        ],
        [
            "Ocampo Central School"
        ],
        [
            "Elementary schools"
        ],
        [
            "Ocampo Evangelical School"
        ],
        [
            "Ocampo Holy Saviour School Inc."
        ],
        [
            "Glorious Adonai Learning Academy"
        ],
        [
            "Ocampo Central School"
        ],
        [
            "Ayugan Elementary School"
        ],
        [
            "Cabariwan Elementary School"
        ],
        [
            "Del Rosario Elementary School"
        ],
        [
            "Gatbo Elementary School"
        ],
        [
            "Guinaban Elementary School"
        ],
        [
            "Hanawan Elementary School"
        ],
        [
            "Hibago Elementary School"
        ],
        [
            "La Purisima Nuevo Elementary School"
        ],
        [
            "May-Ogob Elementary School"
        ],
        [
            "Moriones Elementary School"
        ],
        [
            "New Moriones Elementary School"
        ],
        [
            "Pinit Elementary School"
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "San Jose Oras Elementary School"
        ],
        [
            "San Roque Commonal Elementary School"
        ],
        [
            "Santa Cruz Elementary School"
        ],
        [
            "Santo Niño Elementary School"
        ],
        [
            "Villaflorida Elementary School"
        ],
        [
            "Little Blessings Learning Center School"
        ],
        [
            "High schools"
        ],
        [
            "Three secondary schools: Ocampo National High School in Barangay San Francisco, Malate-Olos High School in Barangay Cagmanaba and Hanawan High School in Barangay Hanawan."
        ],
        [
            "Vocational Schools"
        ],
        [
            "Ryden International and IConnect Global are the two TESDA schools offering vocational courses."
        ],
        [
            "Notable personalities"
        ],
        [
            "Bugoy Drilon – Singer under ABS-CBN and Second Star Dreamer of Pinoy Dream Academy Season 2"
        ],
        [
            "Kyline Alcantara (Kyline Nicole Aquino Manga) – Actress under GMA Network"
        ],
        [
            "Gallery"
        ],
        [
            "St. Bernard Abbot Parish Church"
        ],
        [
            "Ocampo Town Plaza"
        ],
        [
            "Strawberry farm in Ocampo"
        ],
        [
            "Gov.",
            "Jose T. Fuentebella Highway at Ocampo Town Proper"
        ],
        [
            "See also"
        ],
        [
            "List of renamed cities and municipalities in the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Ocampo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "243, s. 1949 | GOVPH\".",
            "15 July 1949."
        ],
        [
            "^ \"Executive Order No.",
            "243\" (PDF).",
            "The President of the Philippines.",
            "Retrieved 2024-05-20."
        ],
        [
            "^ \"History | Ocampo Camarines Sur\".",
            "Archived from the original on 2020-10-30.",
            "Retrieved 2019-05-14."
        ],
        [
            "^"
        ],
        [
            "\"Ocampo, Camarines Sur: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 29 October 2017."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Camarines Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"A deer farm in Bicol\", ABS-CBN News, Jan. 22, 2018"
        ],
        [
            "^ \"Bugoy Drilon Biography\".",
            "hello.pinoystop.com.",
            "Retrieved 2020-08-01."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Ocampo, Camarines Sur."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Official Site of the Province of Camarines Sur"
        ],
        [
            "Places adjacent to Ocampo, Camarines Sur"
        ],
        [
            "Mount Isarog"
        ],
        [
            "Pili"
        ],
        [
            "Ocampo"
        ],
        [
            "TigaonSagñay"
        ],
        [
            "Bula"
        ],
        [
            "Baao"
        ],
        [
            "Iriga City"
        ],
        [
            "vteMetro NagaStatistically grouped with the Province of Camarines SurAdministrative divisionsCity"
        ],
        [
            "Naga"
        ],
        [
            "Municipalities"
        ],
        [
            "Bombon"
        ],
        [
            "Bula"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Gainza"
        ],
        [
            "Libmanan"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "San Fernando"
        ],
        [
            "Geography"
        ],
        [
            "Mount Isarog"
        ],
        [
            "Mount Bernacci (Tangcong Vaca)"
        ],
        [
            "History"
        ],
        [
            "History of Metro Naga"
        ],
        [
            "Religion"
        ],
        [
            "Religion in Naga"
        ],
        [
            "Archdiocese of Caceres"
        ],
        [
            "Our Lady of Peñafrancia"
        ],
        [
            "Public utilities and services"
        ],
        [
            "Metropolitan Naga Water District"
        ],
        [
            "Public Services"
        ],
        [
            "TransportationRailways"
        ],
        [
            "Philippine National Railways"
        ],
        [
            "Road & Highways"
        ],
        [
            "Major Roads"
        ],
        [
            "Pan-Philippine Highway"
        ],
        [
            "South Luzon Expressway (Toll Road 5)"
        ],
        [
            "Airports"
        ],
        [
            "Naga Airport"
        ],
        [
            "Education"
        ],
        [
            "Education in Naga"
        ],
        [
            "Naga Parochial School"
        ],
        [
            "Ateneo de Naga University"
        ],
        [
            "Universidad de Santa Isabel"
        ],
        [
            "University of Nueva Caceres"
        ],
        [
            "Holy Rosary Seminary"
        ],
        [
            "Holy Rosary Minor Seminary"
        ],
        [
            "Holy Rosary Major Seminary"
        ],
        [
            "Naga College Foundation"
        ],
        [
            "Bicol State College of Applied Sciences and Technology"
        ],
        [
            "Naga City Science High School"
        ],
        [
            "AMA Computer University"
        ],
        [
            "Camarines Sur National High School"
        ],
        [
            "STI College"
        ],
        [
            "Landmarks"
        ],
        [
            "Porta Mariae"
        ],
        [
            "Naga Cathedral"
        ],
        [
            "Our Lady of Peñafrancia Shrine"
        ],
        [
            "Peñafrancia Basilica Minore"
        ],
        [
            "San Francisco Church"
        ],
        [
            "St. Anthony of Padua Parish Church"
        ],
        [
            "Highways in Italics are either under construction, not yet operational, or have been closed."
        ],
        [
            "Bicol Region"
        ],
        [
            "Philippines"
        ],
        [
            "vte Province of Camarines SurPili (capital)  Naga (largest city)Municipalities"
        ],
        [
            "Baao"
        ],
        [
            "Balatan"
        ],
        [
            "Bato"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Caramoan"
        ],
        [
            "Del Gallego"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Goa"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Lupi"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Nabua"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "Presentacion"
        ],
        [
            "Ragay"
        ],
        [
            "Sagñay"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Component city"
        ],
        [
            "Iriga"
        ],
        [
            "Independent component city"
        ],
        [
            "Naga (Administratively independent from the province but grouped under Camarines Sur by the Philippine Statistics Authority.)"
        ],
        [
            "vteBicol Region (Region V)Provinces"
        ],
        [
            "Albay"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Catanduanes"
        ],
        [
            "Masbate"
        ],
        [
            "Sorsogon"
        ],
        [
            "Regional center"
        ],
        [
            "Legazpi"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Daet"
        ],
        [
            "Legazpi"
        ],
        [
            "Masbate City"
        ],
        [
            "Pili"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Virac"
        ],
        [
            "Metropolitan areas"
        ],
        [
            "Metro Naga"
        ],
        [
            "Independent component cities"
        ],
        [
            "Naga"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Iriga"
        ],
        [
            "Ligao"
        ],
        [
            "Masbate City"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Tabaco"
        ],
        [
            "Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baao"
        ],
        [
            "Bacacay"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Balatan"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Baras"
        ],
        [
            "Barcelona"
        ],
        [
            "Basud"
        ],
        [
            "Bato (Camarines Sur)"
        ],
        [
            "Bato (Catanduanes)"
        ],
        [
            "Batuan"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camalig"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Capalonga"
        ],
        [
            "Caramoan"
        ],
        [
            "Caramoran"
        ],
        [
            "Casiguran"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Daet"
        ],
        [
            "Daraga"
        ],
        [
            "Del Gallego"
        ],
        [
            "Dimasalang"
        ],
        [
            "Donsol"
        ],
        [
            "Esperanza"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Gigmoto"
        ],
        [
            "Goa"
        ],
        [
            "Gubat"
        ],
        [
            "Guinobatan"
        ],
        [
            "Irosin"
        ],
        [
            "Jose Panganiban"
        ],
        [
            "Jovellar"
        ],
        [
            "Juban"
        ],
        [
            "Labo"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Libon"
        ],
        [
            "Lupi"
        ],
        [
            "Magallanes"
        ],
        [
            "Magarao"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Mandaon"
        ],
        [
            "Manito"
        ],
        [
            "Matnog"
        ],
        [
            "Mercedes"
        ],
        [
            "Milaor"
        ],
        [
            "Milagros"
        ],
        [
            "Minalabac"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Nabua"
        ],
        [
            "Oas"
        ],
        [
            "Ocampo"
        ],
        [
            "Palanas"
        ],
        [
            "Pamplona"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "Paracale"
        ],
        [
            "Pasacao"
        ],
        [
            "Pilar"
        ],
        [
            "Pili"
        ],
        [
            "Pio Duran"
        ],
        [
            "Pio V. Corpuz"
        ],
        [
            "Placer"
        ],
        [
            "Polangui"
        ],
        [
            "Presentacion"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Ragay"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Sagñay"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando (Camarines Sur)"
        ],
        [
            "San Fernando (Masbate)"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Jose"
        ],
        [
            "San Lorenzo Ruiz"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pascual"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Talisay"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Tiwi"
        ],
        [
            "Uson"
        ],
        [
            "Viga"
        ],
        [
            "Vinzons"
        ],
        [
            "Virac"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Ocampo,_Camarines_Sur&oldid=1224783570\""
        ],
        [
            "Categories: Municipalities of Camarines SurMetro NagaPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Central Bikol-language textArticles containing Tagalog-language textCommons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}