{
    "name": "Padada",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Padada"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 6°38′N 125°21′E﻿ / ﻿6.63°N 125.35°E﻿ / 6.63; 125.35"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Davao del Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Padada\" – news · newspapers · books · scholar · JSTOR (May 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Davao Region, PhilippinesPadadaMunicipalityMunicipality of PadadaDowntown area"
        ],
        [
            "FlagMap of Davao del Sur with Padada highlightedOpenStreetMapPadadaLocation within the PhilippinesCoordinates: 6°38′N 125°21′E﻿ / ﻿6.63°N 125.35°E﻿ / 6.63; 125.35CountryPhilippinesRegionDavao RegionProvinceDavao del SurDistrict"
        ],
        [
            "Lone districtFoundedJuly 15, 1949Barangays17"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFrancisco L. Guerrero Jr. • Vice MayorJuwill Carpentero • RepresentativeJohn Tracy F. Cagas • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Carmelo M. delos Cientos IVTyrone S. dela CernaPrince Amando A. Razonable IINoel L. DepalubosDarwin T. GepitulanJo-ann R. RoiloJundel B. CamineroJuwill G. Carpentero"
        ],
        [
            " • Electorate22,943 voters (2022)Area • Revenue₱ 141 million (2020) • Assets₱ 257.1 million (2020) • Expenditure₱ 114.6 million (2020) • Liabilities₱ 40.43 million (2020)Service provider • ElectricityDavao del Sur Electric Cooperative (DASURECO)Time zoneUTC+8 (PST)ZIP code8007PSGC112411000IDD : area code +63 (0)82Native languagesDavawenyo Cebuano Kalagan Tagalog Ata ManoboWebsitewww.padada.gov.ph"
        ],
        [
            "Padada, officially the Municipality of Padada (Cebuano: Lungsod sa Padada; Tagalog: Bayan ng Padada), is a 3rd class municipality in the province of Davao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 29,878 people, making it the least populated municipality in the province."
        ],
        [
            "Its boundaries were defined by Republic Act No.",
            "1008, approved June 12, 1954."
        ],
        [
            "\"Padada\" refers to a tree from the mangrove family which were once abundant along its entire shoreline and estuaries but due to encroachment and indiscriminate fish farming, the Padada trees became extinct."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Padada\" – news · newspapers · books · scholar · JSTOR (June 2023) (Learn how and when to remove this message)"
        ],
        [
            "Guihing was once the original sitio of Padada and its formation was brought about by Mr. Walstrom, an American expatriate who owned a vast coconut plantation in the area called the Mindanao Estate Co., together with the effort of Don Bartolome Hernandez Sr., a coconut planter and a pioneer of the area too."
        ],
        [
            "Entrance to Municipal hall"
        ],
        [
            "Padada as a town was organized on July 15, 1949, after its creation into such by virtue of Executive Order # 236 of Elpidio Quirino, then president of the Republic of the Philippines.",
            "The territorial jurisdiction of Padada originally embraced the present town of Santa Maria, Malalag, and Sulop in the south, Kiblawan in the west, Hagonoy in the north, and part of Matanao in the north-west with the seat of government in the barrio of Limonso which is now the Padada Poblacion."
        ],
        [
            "In 1946, after the proclamation of the Philippine Republic, hordes of home seekers mostly Filipino veterans of the Second World War headed by Major Froilan Mascardo Matas, settled the area called Padada Valley occupying several repossessed Japanese Plantations in the vicinity.",
            "With the influx of numerous migrants of all walks of life, Limonso as the center of trade, grew into a large community, and qualified to become a separate municipality.",
            "As early as January 1949, the bid for the creation of Padada Town was prepared, finally securing its approval through Executive Order No.",
            "236, dated July 15, 1949."
        ],
        [
            "Antonio Go Pace was the first mayor by appointment who was erstwhile a councilor of Santa Cruz.",
            "With him, Innocentes Zanoria Adolfo was also assigned as the first municipal treasurer of Padada.",
            "The creation of Limonso now Padada into a municipality and the subdivision of the poblacion into commercial and residential districts was attributed to him.",
            "Gregorio Matas was the first elected mayor and held the position for three consecutive terms with Mr. Felix Brandares as vice mayor and in which the municipal building was possible thru his effort.",
            "Atty.",
            "Isidro M. Ordaneza succeeded the former and holds the longest tenure of office—16 years from 1963 and re-elected again in 1967 and 1971 until March 1979.",
            "Padada ABC gymnasium was built during his term."
        ],
        [
            "However, in the process of re-organization of local governments by President Ferdinand E. Marcos, then Vice Mayor Benjamin A. Saragena was designated Acting Mayor of Padada, assuming office on March 19, 1979.",
            "In the 1980 local elections, Acting Mayor Saragena was elected mayor with Pascuala Dizon as Vice Mayor and his entire Sangguniang Bayan ticket was swept into office."
        ],
        [
            "After the People Power Revolution in EDSA, Corazon C. Aquino appointed Atty.",
            "Carmelo R. De Los Cientos III as OIC of this Municipality and assumes the office with Elpidio R. Pantojan as OIC Vice Mayor and 8 OIC Sangguniang Banyan."
        ],
        [
            "Prior to the 1988 local elections, all OIC Municipal Officials we made to resign during the campaign period from December 1987 to February 1988.",
            "It was on this short period of time that another OIC ruled the municipality.",
            "OIC Mayor Leonardo U. Pillerin and Vice Mayor Margarito Mendez were installed from December 1987 to February 1988, together with the 8 OIC S.B.",
            "members.",
            "During the 1988 elections, the people of Padada elected Atty.",
            "Carmelo R. De los Cientos III as municipal mayor and Elpidio R. Pantojan as vice mayor.",
            "Both were re-elected and served for three terms.",
            "In the 1998 local election, former Mayor Benjamin A. Saragena won the election of mayor and Antonio N. Razonable as the Vice Mayor."
        ],
        [
            "In the 2001 local elections, Atty.",
            "Antonio N. Razonable and Pedro F. Caminero Jr. won the mayoralty and Vice Mayoralty post.",
            "Both were re-elected and served from 2001 to 2010.",
            "The 2010 elections, which made use of Precinct Count Optical Scan (PCOS) system, paved the way to Pedro F. Caminero Jr, a vice mayor for three terms during the administration of Razonable, to reign the local government of Padada as the new mayor.",
            "He was accompanied by Alexander V. Morales as his vice mayor and partner in the local governance."
        ],
        [
            "In the May 2013 national election, he was replaced by Atty.",
            "Gladys A. Razonable-Gascon, the daughter of then Mayor Antonio N. Razonable and the first female mayor of Padada.",
            "In the May 2016 national election, she was replaced by the former mayor Pedro F. Caminero Jr.",
            "He was accompanied by Francisco \"Frashale\" Guerrero Jr as his vice mayor."
        ],
        [
            "In the May 2022 National and Local Elections, paved the way to Francisco L. Guerrero, Jr, a Vice Mayor for two terms during the Administration of Caminero, to reign the local government of Padada as new Mayor.",
            "Juwill G. Carpentero, won the Vice Mayoral race, a Sangguniang Bayan Member for two terms during the Administration of Caminero."
        ],
        [
            "On December 15, 2019, a 6.9 earthquake hit at around 2:11 p.m. with epicenter 6 kilometers northwest of Padada."
        ],
        [
            "Geography"
        ],
        [
            "Padada is part of the province of Davao del Sur lying between 125 degrees 20’ east longitude and 6 degree 28’ 44’ north latitude.",
            "It is bounded on the north by the municipality of Hagonoy, on the west by the municipality of Kiblawan, on the south by the municipalities of Sulop and Malalag and on the east by Davao Gulf.",
            "The Poblacion is approximately 12 kilometres (7.5 mi) from Digos, the capital town of Davao del Sur."
        ],
        [
            "Land area"
        ],
        [
            "The total land area of the municipality is 8,300 hectares (21,000 acres), 65% of which is planted to coconut and 35% to banana, corn, rice and other crops.",
            "It has three urban barangays namely, NCO, Almendras, and Quirino that totals to one hundred eighty one hectares.",
            "Three of the remaining fourteen barangays are located along the coastal portion and the other on the internal area.",
            "Two (2%) of the total provincial land area is what constitute the municipality of Padada."
        ],
        [
            "Climate"
        ],
        [
            "Hot and humid most of the year.",
            "May to November is typhoon season.",
            "The mean annual temperature of the municipality is between 22.4 to 31.5 °C (72.3 to 88.7 °F).",
            "The annual rainfall range from 1,500 to 2,500 millimetres (59 to 98 in).",
            "The coldest part of the year is usually during the month of December to February and the hottest month are April and May.",
            "Rainfall distribution is more or less even during the year."
        ],
        [
            "Climate data for Padada, Davao del Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "59(2.3)"
        ],
        [
            "46(1.8)"
        ],
        [
            "41(1.6)"
        ],
        [
            "54(2.1)"
        ],
        [
            "105(4.1)"
        ],
        [
            "159(6.3)"
        ],
        [
            "179(7.0)"
        ],
        [
            "197(7.8)"
        ],
        [
            "162(6.4)"
        ],
        [
            "147(5.8)"
        ],
        [
            "102(4.0)"
        ],
        [
            "65(2.6)"
        ],
        [
            "1,316(51.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.3"
        ],
        [
            "11.7"
        ],
        [
            "12.2"
        ],
        [
            "14.5"
        ],
        [
            "22.6"
        ],
        [
            "25.6"
        ],
        [
            "26.6"
        ],
        [
            "27.5"
        ],
        [
            "25.5"
        ],
        [
            "26.0"
        ],
        [
            "21.2"
        ],
        [
            "16.0"
        ],
        [
            "241.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Padada is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Barangay"
        ],
        [
            "Code"
        ],
        [
            "Urban/Rural"
        ],
        [
            "Population(2007)"
        ],
        [
            "Population(2010)"
        ],
        [
            "Almendras (Poblacion)"
        ],
        [
            "112411001"
        ],
        [
            "Urban"
        ],
        [
            "4196"
        ],
        [
            "3,983"
        ],
        [
            "Don Sergio Osmena, Sr."
        ],
        [
            "112411002"
        ],
        [
            "Rural"
        ],
        [
            "647"
        ],
        [
            "776"
        ],
        [
            "Harada Butai"
        ],
        [
            "112411003"
        ],
        [
            "Rural"
        ],
        [
            "1452"
        ],
        [
            "1,728"
        ],
        [
            "Lower Katipunan"
        ],
        [
            "112411004"
        ],
        [
            "Rural"
        ],
        [
            "686"
        ],
        [
            "683"
        ],
        [
            "Lower Limonzo"
        ],
        [
            "112411005"
        ],
        [
            "Rural"
        ],
        [
            "1030"
        ],
        [
            "1,173"
        ],
        [
            "Lower Malinao"
        ],
        [
            "112411006"
        ],
        [
            "Rural"
        ],
        [
            "1033"
        ],
        [
            "1,198"
        ],
        [
            "N C Ordaneza District (Poblacion)"
        ],
        [
            "112411007"
        ],
        [
            "Urban"
        ],
        [
            "2332"
        ],
        [
            "2,401"
        ],
        [
            "Northern Paligue"
        ],
        [
            "112411008"
        ],
        [
            "Rural"
        ],
        [
            "1703"
        ],
        [
            "1,522"
        ],
        [
            "Palili"
        ],
        [
            "112411009"
        ],
        [
            "Rural"
        ],
        [
            "1054"
        ],
        [
            "1,064"
        ],
        [
            "Piape"
        ],
        [
            "112411010"
        ],
        [
            "Rural"
        ],
        [
            "1429"
        ],
        [
            "1,394"
        ],
        [
            "Punta Piape"
        ],
        [
            "112411011"
        ],
        [
            "Rural"
        ],
        [
            "1118"
        ],
        [
            "1,056"
        ],
        [
            "Quirino District (Poblacion)"
        ],
        [
            "112411012"
        ],
        [
            "Urban"
        ],
        [
            "1831"
        ],
        [
            "1,721"
        ],
        [
            "San Isidro"
        ],
        [
            "112411013"
        ],
        [
            "Rural"
        ],
        [
            "1366"
        ],
        [
            "1,407"
        ],
        [
            "Southern Paligue"
        ],
        [
            "112411014"
        ],
        [
            "Rural"
        ],
        [
            "1329"
        ],
        [
            "1,455"
        ],
        [
            "Tulugan"
        ],
        [
            "112411015"
        ],
        [
            "Rural"
        ],
        [
            "845"
        ],
        [
            "973"
        ],
        [
            "Upper Limonzo"
        ],
        [
            "112411016"
        ],
        [
            "Rural"
        ],
        [
            "1934"
        ],
        [
            "2,089"
        ],
        [
            "Upper Malinao"
        ],
        [
            "112411017"
        ],
        [
            "Rural"
        ],
        [
            "1142"
        ],
        [
            "1,101"
        ],
        [
            "Natural environment"
        ],
        [
            "Piape Hills"
        ],
        [
            "It is a 65-hectare (160-acre) site, 4.5 kilometers east of Poblacion Padada facing Davao Gulf.",
            "Known as the crocodile mountain for when viewed above it look like a sleeping crocodile resting in the shore of Padada.",
            "It is being identified as the Provincial Jamboree Site and an Agro-forest area of the municipality.",
            "The hill is covered with shrubs, trees and rocks.",
            "It is planted with trees since 1972, as an environmental concern of the people of Padada.",
            "A potential mountain trail for tourist.",
            "On top of the summit, you will have a panoramic view of Padada Valley, Davao Gulf, Mt.",
            "Apo, and Mt Matutum.",
            "It can be reached by 30–45 minutes hiking from the foot of the hill."
        ],
        [
            "Piape Reef"
        ],
        [
            "A coral reef with an area of more or less four (4) hectares located within the municipal fish sanctuary.",
            "The whole area is covered with a variety of corals and 10–12 depth fathom blue clear water used to be the breeding ground of variety of species of marine life.",
            "The area will submerge during high tide and is visible during low tide.",
            "It is one of the best take off point of scuba divers and a scuba diving destination in the south.",
            "It is estimated to be nine (9) kilometers from the Poblacion and only around five (5) kilometers from the Piape shoreline.",
            "It is accessible by all type of land transportation from Poblacion Padada to barangay Piape and by boat or motorized banca from Piape to the reef.",
            "A prelude to Piape coral reef is a sandy reef locally known as Pasig which will also submerge during high tide but is only ½ hectare in area surrounded with a knee-length muddy water not conducive to swimming and diving."
        ],
        [
            "Piape Marine Sanctuary"
        ],
        [
            "It is located adjacent to Piape Reef facing Piape Hills.",
            "It is 4.5 km east of Poblacion facing Davao Gulf and can be reached on a motorized boat in 5–7 minutes.",
            "It has an area of 50 hectares (120 acres) surrounded with buoys from BFAR (Bureau of Fisheries and Aquatic Resources (Philippines)) for its protection and identification.",
            "It is a breeding ground of 50–60 species of marine life."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PadadaYearPop.±% p.a.1960 12,147—    1970 14,402+1.72%1975 15,648+1.68%1980 17,218+1.93%1990 21,051+2.03%1995 22,384+1.16%2000 24,112+1.61%2007 25,127+0.57%2010 25,724+0.86%2015 26,587+0.63%2020 29,878+2.32%Source: Philippine Statistics Authority"
        ],
        [
            "Based on National Statistical Coordination Board, the total population was 25,724 as of May 1, 2010, up from 27,127 in the August 2007 census.",
            "The registered number of voters is 16,815 as of 2010."
        ],
        [
            "Languages"
        ],
        [
            "The Municipal Hall of Padada"
        ],
        [
            "English, Pilipino, Chinese, Cebuano is the mother tongue spoken by 68.82% of the total population.",
            "Other dialects spoken in the area are; B´laan, 6.40%; Bagobo 2.88%; Hiligaynon (Ilongo) 1.70%; Manobo 6.72%; Ilocano 1.22% and Tagacaolos 8.",
            "36%"
        ],
        [
            "English and Filipino , which is based on Tagalog, is the official language.",
            "About 95 percent of the population speaks Visaya.",
            "English is widely and commonly used for educational, governmental, and commercial purposes."
        ],
        [
            "Religion"
        ],
        [
            "Majority of the population are Roman Catholics , a few are Muslims and Protestants, as well as Iglesia Ni Cristo and Mormons."
        ],
        [
            "St. Michael Parish"
        ],
        [
            "St. Michael Parish Padada"
        ],
        [
            "As early as 1848 the Spanish missionaries set foot on Davao.",
            "Fr.",
            "Francisco Lopez from the Augustinian Recollects together with Don Jose Oyanguren came to establish a Christian settlement after defeating local chieftain, Datu Bago.",
            "The following years, the Jesuits took over the apostolic responsibility from the Recollects.",
            "Instrumental to the evangelization and expansion of the Davao church were missionaries like Fr.",
            "Quirico More, Mateo Gisbert, Pablo Pastells and Saturnino Urius.",
            "The entire Mindanao area was under the Diocese of Cebu since 1595, until some parts were placed under the jurisdiction of Jaro in 1865.",
            "On April 10, 1910, the Diocese of Zamboanga was created and took all ecclesiastical territories in Mindanao away from Cebu.",
            "Then, on January 20, 1933, Pope Pius XI created Cagayan de Oro as second diocese in Mindanao.",
            "During this time Mindanao was divided into two dioceses, Zamboanga and Cagayan de Oro."
        ],
        [
            "In 1934 because of the scarce number of missionaries and since Davao has only eight Jesuits administering it, Bishop Luis del Rosario of Zamboanga sought for foreign help and one of those who responded was the Foreign Mission Society of Quebec or popularly known as P.M.E.",
            "Fathers or La Société des Missions-Étrangères (in French: Pretres de Missions-Étrangères,).",
            "In 1937, the first P.M.E.",
            "Fathers who arrive here in Davao were Fr.",
            "Clovis Rondeau, Omer Leblanc, Leo Lamy, Conrad Cote, and Msgr.",
            "Clovis Thibault who was the main proponent of establishing the Parish of Padada.",
            "After the first five P.M.E.",
            "Fathers, many others followed.",
            "On December 17, 1949, Davao became the Prelature Nullius to which Clovis Thibault was appointed as administrator."
        ],
        [
            "St. Michael Parish Of Padada"
        ],
        [
            "On June 29, 1951 Pope Pius XII elevated Cagayan de Oro to an archdiocese together with Jaro.",
            "The Archdiocese of Cagayan de Oro became the first archdiocese in Mindanao.",
            "It had as its suffragans all the dioceses and prelatures then in Mindanao: Surigao, Cotabato, Sulu, Davao, Ozamiz, and Zamboanga which had been its mother diocese.",
            "It became an archdiocese seven years ahead of its mother diocese, Zamboanga."
        ],
        [
            "And on December 31, 1954, Clovis Thibault, P.M.E.",
            "was appointed as prelate and on February 11, 1955, he was ordained as bishop.",
            "When Davao was later elevated into a diocese, Bishop Thibault was canonically instituted as its ruling bishop on July 11, 1966."
        ],
        [
            "On the account of Fr.",
            "Paul Gravel, P.M.E.",
            "in his 25th Padada Parish anniversary message dated May 1, 1977, he recalls of the establishment of the Parish.",
            "It started with the proposal of Msgr.",
            "Clovis Thibault during the Parish fiesta of Digos on August 22, 1952.",
            "In the following month September 7, together with his close friend Diosdado Ypil they ventured the new undertaking.",
            "They were welcomed by the people of Padada in the person of Mayor Gregorio Matas, Bonifacio Semilla the president of Catholic Association and many others who were supportive of the said plan."
        ],
        [
            "Padada Parish Church"
        ],
        [
            "Christians during this time must have been excited upon hearing the news.",
            "Given that Santa Cruz was long before became a parish in 1941 and Digos in 1948, to some degree Padada reached the appropriate moment to become a parish.",
            "At that moment Padada had only a chapel situated near the highway, standing near the bread fruit or locally known as ‘kamansi’ (Artocarpus altilis) that is within the vicinity and residence of a certain Rodem.",
            "Right after that day they repaired the old chapel and afterward moved it in the residence of the Yap Family which is the location of the church at present.",
            "They effectively did it in three weeks time before their fiesta with the help of the people.",
            "They called the project ‘Tagbo’ (encounter).",
            "We could not be certain whether they dismantled it piece by piece or carried the entire structure all the way to its new place like what we Filipinos usually do in bayanihan which greatly witness our spirit of communal unity and effort.",
            "It was an enormous undertaking that they informed and sought help from leaders like Mr. Ronda of Hagonoy, Mr. Pascual, Diel and Calumpong of Malalag, and other places like Pawa, Kiblawan, Tanwalang, and Santa Maria.",
            "There were hundreds of them including the tribal minorities of B’laans of Maragaa and the Tagacaolos of Malalag shared their earnest involvement of the said project.",
            "On September 29 that year, Fr.",
            "Gravel celebrated the annual fiesta of St. Michael the archangel in the new site.",
            "They completed the initial stage that sets another milestone in the lives of the people in Padada.",
            "After the fiesta, the same spirit of enthusiasm and solidarity continued to intensify as they started to plan the construction of a bigger church.",
            "Finally, on July 6, 1953, they laid the foundation of the structure.",
            "Again, the structure that was planned needed help from the affiliated communities.",
            "It was a protracted effort to finish the main and internal structure of the church that they continually relied on the financial aid from few of the wealthy families of the neighboring municipalities and the masons who volunteered their service."
        ],
        [
            "Fr.",
            "Gravel was the first and said to be the longest assigned priest of Padada.",
            "Ambiguously he was remembered serving the parish for ten years.",
            "The parish records show that there had been a great deal of assistance coming from the P.M.E.",
            "'s who took the role as Parish priests, but probably he stayed a little longer.",
            "Even at present his persona endured in the memories of the people as the driving force who laid the foundations of their dream."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Padada"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  40.90"
        ],
        [
            "2009  14.55"
        ],
        [
            "2012  14.10"
        ],
        [
            "2015  14.32"
        ],
        [
            "2018  9.49"
        ],
        [
            "2021  11.00"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Banana Plantation, Padada"
        ],
        [
            "Padada is basically an agricultural area where coconuts abound and to which copra is the main produce, maize comes to second as the important crops that is grown including bananas and cassava.",
            "Other crops include sugarcane, mangoes and papayas.",
            "Livestock on farms include chickens, goats and hogs."
        ],
        [
            "Marine fishing is an important industry.",
            "Barangays along the coastal portion are mostly converted into fishponds that yields bangus (milkfish) and shrimp.",
            "The Poblacion serves as the economic and the business center."
        ],
        [
            "Government"
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Padada Municipal council (2022-2025):"
        ],
        [
            "Mayor: Francisco L. Guerrero Jr."
        ],
        [
            "Vice Mayor: Juwill Carpentero"
        ],
        [
            "-Sangguniang Bayan Member-"
        ],
        [
            "Antonietta Razonable-Tecson"
        ],
        [
            "Tyrone Dela Cerna"
        ],
        [
            "Jundel Caminero"
        ],
        [
            "Jo-Ann Razonable-Roilo"
        ],
        [
            "Noel Depalubos"
        ],
        [
            "Charisma Razonable"
        ],
        [
            "Emma Bongcawel"
        ],
        [
            "Emil Libradores"
        ],
        [
            "Transportation"
        ],
        [
            "Padada Transport Terminal"
        ],
        [
            "Padada Overland transport terminal is at the center of the town, where all the major businesses, commercial establishments and public market are situated.",
            "Concrete-paved national highway runs along Padada connecting Davao City and General Santos and adjacent provinces like South Cotabato, Sultan Kudarat, Maguindanao, Cotabato and Santa Cruz Province.",
            "Air and water transport is accessible in the area through the international air and sea ports located in Davao City and General Santos.",
            "Jeepneys and buses are used widely for major routes.",
            "Mostly Tricycles in the poblacion and in neighboring barangays.",
            "Bikes are used for leisure and sporting events."
        ],
        [
            "Education"
        ],
        [
            "Private schools"
        ],
        [
            "ATO Padada Christian School"
        ],
        [
            "Saint Michael's School of Padada"
        ],
        [
            "Southeastern College of Padada"
        ],
        [
            "Homepal Padada"
        ],
        [
            "Public schools"
        ],
        [
            "Limonzo Elementary School"
        ],
        [
            "Piape Elementary School"
        ],
        [
            "Padada South Elementary School"
        ],
        [
            "Padada Central Elementary School"
        ],
        [
            "German Lanticse Elementary School"
        ],
        [
            "Lower Katipunan Primary School"
        ],
        [
            "Harada Butai Primary School"
        ],
        [
            "Don Sergio Osmeña Primary School"
        ],
        [
            "Mariano Sarona Elementary School"
        ],
        [
            "Padada National High School"
        ],
        [
            "Padada National High School-Malinao Extension"
        ],
        [
            "Carmelo C. Delos Cientos Sr. National Trade School"
        ],
        [
            "Maria Cleta R. Delos Cientos National High School - Piape"
        ],
        [
            "Tulogan Elementary School"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Padada |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Defining the Boundaries of the Municipality of Padada, Province of Davao\".",
            "LawPH.com.",
            "Retrieved 2011-04-09."
        ],
        [
            "^ \"Magnitude 6.9 earthquake jolts Davao del Sur\".",
            "December 15, 2019."
        ],
        [
            "^"
        ],
        [
            "\"Padada: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 January 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XI (Davao Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XI (Davao Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Davao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Padada."
        ],
        [
            "Padada Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Padada"
        ],
        [
            "Hagonoy"
        ],
        [
            "Kiblawan"
        ],
        [
            "Padada"
        ],
        [
            "Davao Gulf"
        ],
        [
            "Sulop"
        ],
        [
            "vte Province of Davao del SurDigos (capital)  Davao City (largest city)Municipalities"
        ],
        [
            "Bansalan"
        ],
        [
            "Hagonoy"
        ],
        [
            "Kiblawan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Malalag"
        ],
        [
            "Matanao"
        ],
        [
            "Padada"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Sulop"
        ],
        [
            "Component City"
        ],
        [
            "Digos"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Davao City (Administratively independent from the province but grouped under Davao del Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Padada&oldid=1222502399\""
        ],
        [
            "Categories: Municipalities of Davao del SurPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from May 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from June 2023Articles needing additional references from June 2023Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}