{
    "name": "Palapag",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Palapag"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°32′49″N 125°06′58″E﻿ / ﻿12.547°N 125.116°E﻿ / 12.547; 125.116"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Northern Samar, Philippines"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesPalapagMunicipalityMunicipality of PalapagClockwise from top: Poblacion, Pinsker's hawk-eagle, Century Old Bell, Rakitdakit, ruins of 17th-century Catholic church, Maragano shore"
        ],
        [
            "FlagSealMap of Northern Samar with Palapag highlightedOpenStreetMapPalapagLocation within the PhilippinesCoordinates: 12°32′49″N 125°06′58″E﻿ / ﻿12.547°N 125.116°E﻿ / 12.547; 125.116CountryPhilippinesRegionEastern VisayasProvinceNorthern SamarDistrict"
        ],
        [
            "2nd districtBarangays32"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFlorencio A. Batula • Vice MayorMelvic L. Chy • RepresentativeHarris Christopher M. Ongchuan.",
            "• Councilors"
        ],
        [
            "List"
        ],
        [
            "• Noel Aoyang• Ricardo Batula• Nizza Gorembalem• Kent Caballa• Eden Majuelo• Rufina Quibal• Delia Cerbito• Pepito LaorenoDILG Masterlist of Officials"
        ],
        [
            " • Electorate25,641 voters (2022)Area • Revenue₱ 139 million (2020) • Assets₱ 468.7 million (2020) • Expenditure₱ 110.5 million (2020)Service provider • ElectricityNorthern Samar Electric Cooperative (NORSAMELCO)Time zoneUTC+8 (PST)ZIP code6421PSGC084814000IDD : area code +63 (0)55Native languagesWaray TagalogWebsitewww.palapag-nsamar.gov.ph"
        ],
        [
            "Palapag, officially the Municipality of Palapag (Waray: Bungto han Palapag; Tagalog: Bayan ng Palapag), is a 3rd class municipality in the province of Northern Samar, Philippines.",
            "According to the 2020 census, it has a population of 34,034 people."
        ],
        [
            "It is located in the northernmost part of Samar Island."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Palapag\" – news · newspapers · books · scholar · JSTOR (July 2022) (Learn how and when to remove this message)"
        ],
        [
            "Pre-Hispanic"
        ],
        [
            "Ages before the coming of the Spaniards, the Philippines was already settled.",
            "Each settlement was an independent kingdom known as barangay.",
            "About one hundred families consisted each barangay.",
            "Each barangay had a ruler called datu, also known as hari or raja.",
            "He exercised executive, legislative and judicial power in the barangay.",
            "During wartime, he was the commander of barangay warriors.",
            "The datu usually obtained his position by inheritance, wisdom, wealth or physical strength."
        ],
        [
            "The early Filipinos had their own form of government.",
            "They had both oral and written laws.",
            "The unwritten laws were the customs which were passed down from generation to generation and the written laws were promulgated by the datus."
        ],
        [
            "In Samar, there were already settlements located along the coast and the river before the Spaniards arrived.",
            "These settlements called bungto were ruled by a datu, also called the ginaopan or gindolohan.",
            "The datus who ruled the bayside settlements or alongside deep harbors were the most richest and powerful."
        ],
        [
            "The society in prehispanic Samar was composed of datu, the freemen or timawa, the tuhay or mamahay which were also known as aliping namamahay in the Tagalog region, and the hayuhay or ayuway which were equivalent of the aliping sagigilid."
        ],
        [
            "Provincial and municipal government"
        ],
        [
            "By the 17th century, Spanish colonists numbered only a few thousand throughout the Philippines and had few incentives to settle and carve out the land in the provinces.",
            "On the Island of Samar, the land and people were distributed among the Spanish colonists under the encomienda system.",
            "A Spaniard who was trusted with encomienda was called an encomendero.",
            "He was tasked to collect tributes, recruit able-bodied males for public services or polo and ensure the physical and spiritual well-being of the inhabitants.",
            "But because of abuses, the system was abolished."
        ],
        [
            "In order to enhance their administration on the colony, the Spaniards did not abolish the old barangays and merged it into towns called pueblos and the groups of pueblos were called alcaldia or districts headed by alcalde mayor."
        ],
        [
            "When the Jesuits were expelled in Samar in 1768, there were sixteen pueblos already established but only fifteen pueblos had Jesuit parish priests resident and were already divided into three residences: the east, north and the west coasts.",
            "The center of the north-east coasts referred to as Ibabao, was Palapag, while for the west coast was Catbalogan and at the same time the capital of Samar Island.",
            "Being the capital, it was there where the provincial government personnel numbering no more than three or four Spaniards including the governor.",
            "His prime duty was to collect revenues, pay the accounts and balance the books.",
            "He had executives, judicial and legislative functions."
        ],
        [
            "As of 1830, a royal order was issued substituting civilian governor by a military governor.",
            "He assumed office on 1830 as the first military governor of Samar and the number of government personnel was increased.",
            "For administrative purposes, he suggested the division of Samar into three administrative districts, the west, north and the east coasts.",
            "It was approved on 1867 in Manila and in the Council of Administration in Madrid, however it was not realized.",
            "By 1890, the Franciscans divided Samar into three vicariates, the west, north and east coasts."
        ],
        [
            "On the municipal level, the pueblo was headed by a Gobernadorcillo elected annually.",
            "He was both the judicial and executive officer, the general supervisor and ensure of public order, the main collector of tributes and in charge of the repair and maintenance of public buildings and roads.",
            "In order to perform his task efficiently he had to work closely with the priest for support and visto bueno of documents.",
            "His subordinates were called cabeza de barangay who was in charge of collecting tributes and other taxes of each family.",
            "Aside from them, there were three superintendents and assistants of fields, livestock, police and lieutenants (tenientes) and police for every visita and barrio.",
            "With the increase of pueblo officials the role of the priest was reduced."
        ],
        [
            "Geography"
        ],
        [
            "Palapag is bounded on the north by the vast Pacific Ocean, on the east by the municipality of Mapanas, on the west by the municipality of Laoang and on the south by the municipality of Catubig.",
            "The town center is located in the north-eastern part of the municipality.",
            "Its physical features are characterized by mountainous part on the east and a relatively plain on the north-western side of the municipality.",
            "Palapag has a total land area of 17,960 hectares (44,400 acres)."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Catubig, Northern Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "105(4.1)"
        ],
        [
            "67(2.6)"
        ],
        [
            "65(2.6)"
        ],
        [
            "53(2.1)"
        ],
        [
            "86(3.4)"
        ],
        [
            "129(5.1)"
        ],
        [
            "135(5.3)"
        ],
        [
            "113(4.4)"
        ],
        [
            "131(5.2)"
        ],
        [
            "163(6.4)"
        ],
        [
            "167(6.6)"
        ],
        [
            "162(6.4)"
        ],
        [
            "1,376(54.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.6"
        ],
        [
            "13.2"
        ],
        [
            "15.5"
        ],
        [
            "14.9"
        ],
        [
            "19.6"
        ],
        [
            "24.3"
        ],
        [
            "26.6"
        ],
        [
            "25.4"
        ],
        [
            "24.9"
        ],
        [
            "25.4"
        ],
        [
            "22.9"
        ],
        [
            "20.9"
        ],
        [
            "251.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "The climate falls under Type 2, no distinct dry season with a very pronounced rainy season, maximum rain period generally occur in December and January.",
            "It has an average annual rainfall of 3,000 to 4,000 millimetres (120 to 160 in) per year with an average annual temperature of 26.9 °C (80.4 °F).",
            "The warmest month mean temperature is 28 °C (82 °F)."
        ],
        [
            "This climate type in Palapag plays an important rule to its agricultural economy.",
            "Although the agricultural land area is wide enough for the farmers, mostly the cultivation is being limited by the excessive rainfall and the regular sweeping of the typhoon on Samar Islands."
        ],
        [
            "Barangays"
        ],
        [
            "Palapag is subdivided into 32 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Asum (Poblacion)"
        ],
        [
            "Bagacay"
        ],
        [
            "Bangon"
        ],
        [
            "Benigno S. Aquino, Jr. (Poblacion)"
        ],
        [
            "Binay"
        ],
        [
            "Cabariwan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Campedico"
        ],
        [
            "Capacujan"
        ],
        [
            "Jangtud"
        ],
        [
            "Laniwan (Poblacion)"
        ],
        [
            "Mabaras"
        ],
        [
            "Magsaysay"
        ],
        [
            "Manajao"
        ],
        [
            "Mapno"
        ],
        [
            "Maragano"
        ],
        [
            "Matambag"
        ],
        [
            "Monbon"
        ],
        [
            "Nagbobtac"
        ],
        [
            "Napo"
        ],
        [
            "Natawo"
        ],
        [
            "Nipa"
        ],
        [
            "Osmeña"
        ],
        [
            "Pangpang"
        ],
        [
            "Paysud"
        ],
        [
            "Sangay"
        ],
        [
            "Simora"
        ],
        [
            "Sinalaran"
        ],
        [
            "Sumoroy"
        ],
        [
            "Talolora"
        ],
        [
            "Tambangan (Poblacion)"
        ],
        [
            "Tinampo (Poblacion)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PalapagYearPop.±% p.a.1903 9,609—    1918 10,920+0.86%1939 19,745+2.86%1948 17,021−1.64%1960 16,055−0.49%1970 19,438+1.93%1975 21,266+1.82%1980 23,115+1.68%1990 20,114−1.38%1995 24,947+4.12%2000 30,520+4.42%2007 31,398+0.39%2010 33,453+2.33%2015 34,286+0.47%2020 34,034−0.14%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Palapag"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  50.40"
        ],
        [
            "2009  52.09"
        ],
        [
            "2012  51.71"
        ],
        [
            "2015  48.17"
        ],
        [
            "2018  39.99"
        ],
        [
            "2021  24.43"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Transportation"
        ],
        [
            "The municipality is not directly connected by land to other regions of the Philippine archipelago; it still relies on the wharfs provided by the Barangay's near coastal areas (Barangay Sumoroy and Barangay Pangpang) through motorized boats on going to and from the town.",
            "It has a small port in Barangay Mapno but currently idle, no facilities yet provided for the port users."
        ],
        [
            "Education"
        ],
        [
            "Elementary:"
        ],
        [
            "Palapag Central Elementary School"
        ],
        [
            "Cabatuan Elementary School"
        ],
        [
            "Secondary:"
        ],
        [
            "Sumoroy Agro-Industrial School"
        ],
        [
            "Capacujan National High School"
        ],
        [
            "Cabatuan National High School"
        ],
        [
            "Pangpang National High School"
        ],
        [
            "Jangtud National High School"
        ],
        [
            "Tertiary:"
        ],
        [
            "Eastern Visayas Central Colleges (EVCC)"
        ],
        [
            "Colegio de Nuestra Seniora de la Assuncion"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Palapag |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Gregorio F. Zaide and Sonia M. Zaide, Philippine History, Fifth Edition (Quezon City: All – Nations Publishing Co., Inc. 2002), pp.",
            "38-39."
        ],
        [
            "^ Ricco M. Alejandro, The Untold People’s History Samar Philippines (Los Angeles, CA: Sidelakes Press, 2004), pp.",
            "30 – 43."
        ],
        [
            "^ Vilchez, Op.",
            "Cit.",
            "p. 43."
        ],
        [
            "^ Philippine History and Government.",
            "Manila: IBON Foundations, Inc. 1999. pp. 64–66.",
            "{{cite book}}:  CS1 maint: location missing publisher (link)"
        ],
        [
            "^ Cruikshank, Robert Bruce (1975).",
            "A History of Samar Island, 1768 - 1898 (Unpublished Doctoral Thesis, University of Wisconsin, USA, 1975).",
            "pp.",
            "18–19."
        ],
        [
            "^ Ibid.",
            "pp.",
            "18–19."
        ],
        [
            "^"
        ],
        [
            "\"Palapag, Northern Samar : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 6 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Northern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Palapag"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Laoang"
        ],
        [
            "Palapag"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Catubig"
        ],
        [
            "Mapanas"
        ],
        [
            "vte Province of Northern SamarCatarman (capital and largest municipality)Municipalities"
        ],
        [
            "Allen"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Capul"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Gamay"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lope de Vega"
        ],
        [
            "Mapanas"
        ],
        [
            "Mondragon"
        ],
        [
            "Palapag"
        ],
        [
            "Pambujan"
        ],
        [
            "Rosario"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Victoria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Palapag&oldid=1188754015\""
        ],
        [
            "Category: Municipalities of Northern SamarHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: location missing publisherCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textArticles needing additional references from July 2022All articles needing additional referencesPages using the Kartographer extension"
        ]
    ]
}