{
    "name": "Palo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Palo, Leyte"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPolskiPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°09′30″N 124°59′30″E﻿ / ﻿11.1583°N 124.9917°E﻿ / 11.1583; 124.9917"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Leyte, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Palo, Leyte\" – news · newspapers · books · scholar · JSTOR (June 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesPaloMunicipalityMunicipality of PaloPalo Cathedral"
        ],
        [
            "FlagSealMap of Leyte with Palo highlightedOpenStreetMapPaloLocation within the PhilippinesCoordinates: 11°09′30″N 124°59′30″E﻿ / ﻿11.1583°N 124.9917°E﻿ / 11.1583; 124.9917CountryPhilippinesRegionEastern VisayasProvinceLeyteDistrict"
        ],
        [
            "1st districtFounded1596 (as a Jesuit mission)"
        ],
        [
            "1768 (as a town)Barangays33"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRemedios L. Petilla (PDP-Laban) • Vice MayorJonathan Chiquillo (LP) • RepresentativeFerdinand Martin G. Romualdez • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Jonathan P. Chiquillo• Chiqui Ruth C. Uy• Magdalena M. Torres• Gregorio P. Dolina• Aaron H. Roca• Imelda B. Parado• Felipe T. Ygrubay• Jon Jezreel S. AgnerDILG Masterlist of Officials"
        ],
        [
            " • Electorate43,755 voters (2022)Area • Revenue₱ 313.8 million (2020) • Assets₱ 981.1 million (2020) • Expenditure₱ 269.1 million (2020) • Liabilities₱ 289.7 million (2020)Service provider • ElectricityLeyte 2 Electric Cooperative (LEYECO 2)Time zoneUTC+8 (PST)ZIP code6501PSGC0803739000IDD : area code +63 (0)53Native languagesWaray TagalogWebsitewww.palo-leyte.gov.ph"
        ],
        [
            "Palo (IPA:"
        ],
        [
            "The municipality is the seat of most government departments, bureaus and regional offices of Region VIII, although some are situated at the neighboring city of Tacloban.",
            "The municipality is also home to the offices of the ecclesiastical government of the Archdiocese of Palo; the archbishop's residence; as well as the secondary, tertiary and theology seminaries of the archdiocese."
        ],
        [
            "On March 17, 2022, the new Leyte Provincial Capitol in Palo was inaugurated by President Rodrigo Duterte, officially moving the seat of provincial government to the municipality pending an enabling law changing the provincial capital from the current highly urbanized city of Tacloban."
        ],
        [
            "Etymology"
        ],
        [
            "According to existing records those who went to Kutay after the tribal war in Bunga were all equipped with palo, a sort of club for fighting or self-protection.",
            "Being the settlement of a tribe with palos, this is likely the reason why the community was known as \"Palo\"."
        ],
        [
            "However, the late Justice Norberto Romualdez, in an issue of Noli Me Tangere, a Tacloban-based newspaper of that time, asserted on June 9, 1909, that this town was named Palo because of its many carpenters sporting hammers (mazo or palo)."
        ],
        [
            "Believers in superstition and the supernatural ascribe the origin of the Palo name to the town's experience during pre-Spanish time often being visited by typhoons every eight (walo) days.",
            "They called the phenomenon walo-walo, hence walo-palo (eight-hammer)."
        ],
        [
            "History"
        ],
        [
            "The first settlers of Palo were the tribes Panganuron, Kadampog, Manlangit, Kamagung, Kawaring, Kabalhin, Kumagang Maglain, Bilyo and Dilyo.",
            "They lived peacefully in an area resembling the shape of a bridge in what is now Barrio Bunga (present-day San Joaquin), which spanned an area on both sides of the river bearing the same name.",
            "As the population increased, tribal feuds would cause the people to disperse.",
            "Survivors would settle in Payapay, and others in Canpetik.",
            "The bulk went to Kutay.",
            "Those in Kutay would eventually establish the town of Palo."
        ],
        [
            "Barangay and pueblo"
        ],
        [
            "The settlers in Kutay moved to Bangon river and there started the first barrio, Barangay de Palo, in 1521.",
            "Barangay de Palo would then become Pueblo de Palo in 1768.",
            "Its first elected gobernadorcillo was Capitan Balasabas.",
            "The first curate was R. P. Fray Matias Rosel, O.S.A., an Augustinian friar from Andalucia, Spain."
        ],
        [
            "The Missions"
        ],
        [
            "In October 1596, the Jesuit Frs.",
            "Cristobal Jimenez and Francisco Encinas left Dulag traversing to Palo along the eastern coasts They were accompanied by principales Don Alonso Ambuyao and four others.",
            "They found there only two small houses used by the two servants of the encomenderos.",
            "A few boys that attended the mission schools in Dulag welcomed the two priests and taught them the dialect.",
            "These missionaries opened the first school in Palo and taught the children to play the flute.",
            "Later when Fr.",
            "Encinas was called to Carigara, Fr.",
            "Jimenez carried on alone until Bro.",
            "Miguel Gomez arrived to help him."
        ],
        [
            "Fr.",
            "Jimenez learned enough of the local language to be understood but his influence was limited in \"his mission area\" to only a few.",
            "The people probably suspected him of being a tax collector.",
            "For a long time the natives avoided him and resisted all his attempts at friendship.",
            "Nothing he did or offered to do for them seemed to breakdown their distrust him and he was distressed and worried at their antipathy."
        ],
        [
            "In his rounds of the villages, he noticed that there were many sick of which the greater the number succumbed to diseases for lack of medical attention.",
            "This observation gave him an idea.",
            "At that time, medical service was very expensive and available only to families of means for they alone could afford to pay work animals, slaves, or the equivalent of the patient's ransom.",
            "if he were captured."
        ],
        [
            "Palo is well known as the site of Gen. Douglas MacArthur's return to the Philippines together with Philippine and American military forces after a period of exile in 1944.",
            "Hill 522, a hill located near the town center, was the site of fierce fighting between Allied and Japanese forces during the Second World War.",
            "The metropolitan cathedral of the archdiocese, located right across Palo's municipal hall, was used as a hospital for wounded Filipino and American forces.",
            "A memorial now stands at the beach site where MacArthur and his troops landed, locally known as MacArthur Park.",
            "The first Gabaldon Building is also situated in Barangay San Joaquin, Palo, Leyte.",
            "It was inaugurated by President Sergio Osmeña."
        ],
        [
            "Palo was also once the capital of Leyte.",
            "The town's Purissima Bridge was the first steel bridge built in the province."
        ],
        [
            "In 1957, sitio Campitic was converted into a barrio,"
        ],
        [
            "Typhoon Haiyan"
        ],
        [
            "On November 8, 2013, Palo was severely struck by Typhoon Haiyan (Yolanda), which destroyed a large portion of Eastern Visayas and killed a number of residents in the town."
        ],
        [
            "Geography"
        ],
        [
            "The municipality is located in the north-eastern part of the province of Leyte, 8 miles from the capital city of Tacloban."
        ],
        [
            "Barangays"
        ],
        [
            "Palo is politically subdivided into 33 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Anahaway"
        ],
        [
            "Arado"
        ],
        [
            "Baras"
        ],
        [
            "Barayong"
        ],
        [
            "Cabarasan Daku"
        ],
        [
            "Cabarasan Guti"
        ],
        [
            "Campetic"
        ],
        [
            "Candahug"
        ],
        [
            "Cangumbang"
        ],
        [
            "Canhidoc"
        ],
        [
            "Capirawan"
        ],
        [
            "Castilla"
        ],
        [
            "Cogon"
        ],
        [
            "San Joaquin"
        ],
        [
            "Gacao"
        ],
        [
            "Guindapunan"
        ],
        [
            "Libertad"
        ],
        [
            "Naga-naga"
        ],
        [
            "Pawing"
        ],
        [
            "Buri (Poblacion barangay)"
        ],
        [
            "Cavite East (Pob.",
            "barangay)"
        ],
        [
            "Cavite West (Poblacion)"
        ],
        [
            "Luntad (Poblacion)"
        ],
        [
            "Santa Cruz (Poblacion)"
        ],
        [
            "Salvacion"
        ],
        [
            "San Agustin"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "St. Michael (Poblacion)"
        ],
        [
            "Tacuranga"
        ],
        [
            "Teraza"
        ],
        [
            "San Fernando"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Palo, Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "90(3.5)"
        ],
        [
            "67(2.6)"
        ],
        [
            "82(3.2)"
        ],
        [
            "70(2.8)"
        ],
        [
            "97(3.8)"
        ],
        [
            "145(5.7)"
        ],
        [
            "142(5.6)"
        ],
        [
            "127(5.0)"
        ],
        [
            "132(5.2)"
        ],
        [
            "152(6.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "144(5.7)"
        ],
        [
            "1,417(55.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.0"
        ],
        [
            "13.5"
        ],
        [
            "16.0"
        ],
        [
            "16.5"
        ],
        [
            "20.6"
        ],
        [
            "24.3"
        ],
        [
            "26.0"
        ],
        [
            "25.4"
        ],
        [
            "25.2"
        ],
        [
            "26.4"
        ],
        [
            "23.0"
        ],
        [
            "21.0"
        ],
        [
            "254.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "The Palo Municipal Building"
        ],
        [
            "Population census of PaloYearPop.±% p.a.1903 17,480—    1918 20,518+1.07%1939 25,471+1.04%1948 27,253+0.75%1960 25,325−0.61%1970 26,063+0.29%1975 26,218+0.12%1980 31,124+3.49%YearPop.±% p.a.1990 38,100+2.04%1995 43,095+2.34%2000 47,982+2.33%2007 56,781+2.35%2010 62,727+3.69%2015 70,052+2.13%2020 76,213+1.67%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Palo, Leyte, was 76,213 people, with a density of 340 inhabitants per square kilometre or 880 inhabitants per square mile."
        ],
        [
            "Literacy rate in Palo is 99.5%."
        ],
        [
            "The town's native language is Waray-Waray, the major language and lingua franca in the Eastern Visayas region."
        ],
        [
            "Religion"
        ],
        [
            "Palo is the seat of the ecclesiastical province, the Archdiocese, where the Roman Catholic archbishop resides in Bukid Tabor.",
            "One can also find the archdiocese's Metropolitan Cathedral in Palo.",
            "Meanwhile, Palo is also a seedbed of vocations to the priesthood with the Sacred Heart Seminary and the St. John the Evangelist School of Theology.",
            "Two Paloan nuns also became Superiors General in their respective congregations.",
            "To date, there are 158 ordained priests and 106 nuns from the town alone."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Palo"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  19.50"
        ],
        [
            "2009  24.62"
        ],
        [
            "2012  17.90"
        ],
        [
            "2015  22.43"
        ],
        [
            "2018  18.55"
        ],
        [
            "2021  20.12"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Palo is the seat of the 6.8-hectare Leyte Information and Communications Technology (ICT) Park and the 22-hectare Leyte Mikyu Economic Zone.",
            "The Leyte ICT Park hosts two BPOs while the Leyte Mikyu Ecozone is undergoing development."
        ],
        [
            "The town's historic municipal building was the former seat of the Provincial Government of Leyte."
        ],
        [
            "Agriculture is the municipality's dominant industry.",
            "The area produces and ferments the local coconut wine called tuba."
        ],
        [
            "Tourism"
        ],
        [
            "The giant cross at the top of Guinhangdan Hill"
        ],
        [
            "MacArthur Landing Memorial National Park"
        ],
        [
            "Guinhangdan Hill, a destination of Holy Week pilgrims.",
            "The hill is now a forest reserve."
        ],
        [
            "Japanese Shrine in Barangay Caloogan"
        ],
        [
            "Red Beach - The landmark that has brought Palo to the annals of world history is the Red Beach, in barangay Candahug, where Gen. Douglas MacArthur first landed to liberate the Philippines from the Japanese occupation on October 20, 1944."
        ],
        [
            "WW2 Memorial for the Filipino Soldiers"
        ],
        [
            "Palo Metropolitan Cathedral"
        ],
        [
            "Palo Binangalan coral reefs"
        ],
        [
            "Palo Mangrove Reservation (open season for duck hunting whole year round)"
        ],
        [
            "Palo Municipal Library and Heritage Museum"
        ],
        [
            "Korean Park"
        ],
        [
            "\"Tanggal\" - In 2024, the Roman Catholic Archdiocese of Palo announced 60,000 pilgrims and tourists participated in the annual \"Senakulo\", the re-enactment or \"Tanggal\" on Good Friday which had been staged since 1974."
        ],
        [
            "\"Tais-Dupol\" - Taking center stage also, are the Good Friday \"Tais-Dupol\" “penitentes” who are dressed in capirotes as “descendants of the former flagellants which abound during Holy Week in the 1600s (as attested to by the Jesuit chronicler-historian Pedro Chirino).” Fray Pantaleon de la Fuente, O.F.M.",
            "organized these barefoot flagellants in the 1800s."
        ],
        [
            "Sister city"
        ],
        [
            "Palo is sister city with Palo Alto, California, USA, since 1963."
        ],
        [
            "Education"
        ],
        [
            "Private"
        ],
        [
            "Saint Paul School of Professional Studies"
        ],
        [
            "Sacred Heart Seminary"
        ],
        [
            "St. John The Evangelist School of Theology"
        ],
        [
            "Palo Angelicum"
        ],
        [
            "St. Mary's Academy of Palo, Inc."
        ],
        [
            "St. Augustine College of Practical Nursing"
        ],
        [
            "Bethel International School"
        ],
        [
            "Zion Bible College"
        ],
        [
            "AMA Computer College Tacloban"
        ],
        [
            "ELA English Language Academy"
        ],
        [
            "Alpha-Omega Learning Center"
        ],
        [
            "St. Scholastica's College, Tacloban"
        ],
        [
            "Public"
        ],
        [
            "University of the Philippines Manila School of Health Sciences in Leyte"
        ],
        [
            "Philippine Science High School - Eastern Visayas Campus"
        ],
        [
            "Palo National High School"
        ],
        [
            "Palo Central School (Regular)"
        ],
        [
            "Palo Central School (SPED)"
        ],
        [
            "San Joaquin Central School"
        ],
        [
            "San Joaquin National High School"
        ],
        [
            "Libertad Elementary School"
        ],
        [
            "Anahaway National High School"
        ],
        [
            "Kauswagan National High School"
        ],
        [
            "Luntad Elementary School"
        ],
        [
            "Naga-Naga Elementary School"
        ],
        [
            "Arado Elementary School"
        ],
        [
            "Pawing Elementary School"
        ],
        [
            "Guindapunan Elementary School"
        ],
        [
            "Baras Elementary School"
        ],
        [
            "Canhidoc Elementary School"
        ],
        [
            "Palo National High School- Pawing Annex"
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "Cogon Elementary School"
        ],
        [
            "Salvacion Elementary School"
        ],
        [
            "San Fernando Elementary School"
        ],
        [
            "Candahug Elementary School"
        ],
        [
            "Caloogan Elementary School"
        ],
        [
            "Teraza Elementary School"
        ],
        [
            "Notable personalities"
        ],
        [
            "Francisco Alvarado - Waray-language poet and playwright"
        ],
        [
            "Ely Capacio - basketball player and coach"
        ],
        [
            "Glenn Capacio - basketball player and coach"
        ],
        [
            "Vicente I. de Veyra - Waray-language poet, anthologist, orthographer and phonetician"
        ],
        [
            "Iluminado Lucente - Waray-language playwright"
        ],
        [
            "Carmen Pedrosa - journalist and author"
        ],
        [
            "Leopoldo Petilla - former governor of Leyte"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Palo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Large statue of Lapulapu in Leyte elates Duterte\".",
            "Philippine Daily Inquirer.",
            "18 March 2022.",
            "Retrieved 3 April 2022."
        ],
        [
            "^ a b \"Leyte Landing\".",
            "Official Gazette of the Republic of the Philippines.",
            "Retrieved 25 January 2015."
        ],
        [
            "^ Misagal, Monch Mikko E. (16 October 2014).",
            "\"Did MacArthur land on Leyte before Oct. 20, 1944?\".",
            "Manila Bulletin.",
            "Retrieved 25 January 2015."
        ],
        [
            "^ \"R.A. No.",
            "1722: An Act Converting the Sitio of Campitic in the Municipality of Palo, Province of Leyte, into a Barrio to Be Known As the Barrio of Campitic\".",
            "LawPH.com.",
            "Retrieved 2011-04-12."
        ],
        [
            "^ \"R.A. No.",
            "1723: An Act Creating the Barrios of Baras and Candahug in the Municipality of Palo, Province of Leyte\".",
            "LawPH.com.",
            "Retrieved 2011-04-12."
        ],
        [
            "^ \"R.A. No.",
            "1740: An Act Changing the Name of the Barrio of Malirong, Municipality of Palo, Province of Leyte, to Libertad\".",
            "LawPH.com.",
            "Retrieved 2011-04-12."
        ],
        [
            "^ \"Five years later: How 'Yolanda'-hit areas look now\".",
            "The Philippine Star.",
            "November 8, 2018."
        ],
        [
            "^ \"Pope Francis arrives in Leyte to console Yolanda victims\".",
            "Rappler.",
            "17 January 2015.",
            "Retrieved 17 January 2015."
        ],
        [
            "^"
        ],
        [
            "\"Province:\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Palo: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 February 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ http://peza.gov.ph Archived 28 March 2013 at the Wayback Machine"
        ],
        [
            "^ \"DOST Eyes Palo, Leyte as Country's Coco Wine Capital\".",
            "Interaksyon.com.",
            "Philippines News Agency.",
            "1 July 2013.",
            "Retrieved 25 January 2015."
        ],
        [
            "^ \"Boosting Philippines' Coconut Wine Industry\".",
            "Tempo.",
            "20 July 2013.",
            "Archived from the original on 25 January 2015.",
            "Retrieved 25 January 2015."
        ],
        [
            "^ Amazona, Roel (March 27, 2024).",
            "\"Live street 'Senakulo' to draw more than 60K on Good Friday\".",
            "Philippine News Agency.",
            "Retrieved April 2, 2024."
        ],
        [
            "^ \"'Tais-Dupol' in Palo, Leyte stirs netizens\".",
            "GMA Integrated News.",
            "March 31, 2024.",
            "Retrieved April 2, 2024."
        ],
        [
            "^ \"Palo, Leyte Sister City Committee Joins Neighbors Abroad's International Festival in Palo Alto - Philippine Consulate General in San Francisco\".",
            "31 August 2022.",
            "Retrieved 3 December 2023."
        ],
        [
            "^ \"Palo, Leyte, Philippines\".",
            "NEIGHBORS ABROAD.",
            "Retrieved 3 December 2023."
        ],
        [
            "^ Sugbo, Victor, ed.",
            "(1995).",
            "Tinipigan: An Anthology of Waray Literature.",
            "Manila, Philippines: National Commission for Culture and the Arts.",
            "p. 270.",
            "OCLC 645852700.",
            "Retrieved 27 September 2019."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Palo, Leyte."
        ],
        [
            "Wikivoyage has a travel guide for Palo, Leyte."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Palo, Leyte"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tacloban"
        ],
        [
            "Pastrana"
        ],
        [
            "Palo"
        ],
        [
            "San Pedro Bay"
        ],
        [
            "Tanauan"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Palo,_Leyte&oldid=1230394043\""
        ],
        [
            "Categories: Municipalities of Leyte (province)1768 establishments in the Spanish EmpirePopulated places established in 1768Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2013All articles needing additional referencesCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from May 2022Commons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersPages using the Kartographer extension"
        ]
    ]
}