{
    "name": "Pambujan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pambujan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°34′N 124°56′E﻿ / ﻿12.57°N 124.93°E﻿ / 12.57; 124.93"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Northern Samar, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Pambujan\" – news · newspapers · books · scholar · JSTOR (April 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesPambujanMunicipalityMunicipality of PambujanPambujan Welcome Rotunda"
        ],
        [
            "FlagMap of Northern Samar with Pambujan highlightedOpenStreetMapPambujanLocation within the PhilippinesCoordinates: 12°34′N 124°56′E﻿ / ﻿12.57°N 124.93°E﻿ / 12.57; 124.93CountryPhilippinesRegionEastern VisayasProvinceNorthern SamarDistrict"
        ],
        [
            "2nd districtBarangays26"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFelipe A. Sosing • Vice MayorRonil A. Tan • RepresentativeJose L. Ong Jr. • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Iluminada R. Salazar• Narita B. Salvador• John D. Balanquit• Owen Lamberto L. Siervo• Jenice T. Abobo• Melany S. Lucban• Ray B. Galupo• Carlos S. TanDILG Masterlist of Officials"
        ],
        [
            " • Electorate20,697 voters (2022)Area • Revenue₱ 165 million (2020) • Assets₱ 285.7 million (2020) • Expenditure₱ 149.5 million (2020) • Liabilities₱ 26.23 million (2020)Service provider • ElectricityNorthern Samar Electric Cooperative (NORSAMELCO)Time zoneUTC+8 (PST)ZIP code6413PSGC084815000IDD : area code +63 (0)55Native languagesWaray TagalogWebsitewww.pambujan-nsamar.gov.ph"
        ],
        [
            "Pambujan, officially the Municipality of Pambujan (Waray: Bungto han Pambujan; Tagalog: Bayan ng Pambujan), is a 4th class municipality in the province of Northern Samar, Philippines.",
            "According to the 2020 census, it has a population of 35,532 people."
        ],
        [
            "It is a coastal town with an area of 18,650 hectares.",
            "It is a town with notable qualities and resources.",
            "It boasts a 16th-century Roman Catholic church, a scenic islet named Caohagan, baseball players who won international tournaments, professionals and achievers, a socio-cultural activity held every first full moon of the year (known as Kadayaw Festival), and a sports arena which has been the venue for various municipal, provincial and regional sports gatherings."
        ],
        [
            "The municipality has a number of daycare centers in each barangay, two private and one public preparatory schools, a number of primary and elementary schools and two secondary schools.",
            "It is accessible to Region VIII's premiere state university- the University of Eastern Philippines- as well as other private colleges in Catarman, the capital town of Northern Samar."
        ],
        [
            "It has earned provincial and regional citations as Child-Friendly municipality."
        ],
        [
            "Pambujan is in the heart of the second district of Northern Samar."
        ],
        [
            "Brief Historical Sketch of the Town of Pambujan (17th to 19th Century)"
        ],
        [
            "By: Manuelito Uy"
        ],
        [
            "The town of Pambujan is one of the municipalities of the province of Northern Samar.",
            "It is situated on a river of the same name and is bounded by the town of Laoang in east-northeast and with the town of Catarman on the west."
        ],
        [
            "In the ancient times, this town carries a name Bayog which according to old Bisayan Vocabulario means, a male who acts as a female and dresses like a woman, synonymous to bantot or asog.",
            "It also refers to a certain tree and its wood is fine for building and with its bark are treated broken pots by rubbing them with it."
        ],
        [
            "Later, the town was also identified with the name Pambujan or Pamboan.",
            "In the 19th century, it was named Pambujan del Norte because there was another Pambujan del Sur on the east coast which is now the present town of MacArthur."
        ],
        [
            "This article will review the events that occurred in this town from the period of the seventeenth to the nineteenth century."
        ],
        [
            "𝙀𝙫𝙚𝙣𝙩𝙨 𝙙𝙪𝙧𝙞𝙣𝙜 𝙩𝙝𝙚 𝙅𝙚𝙨𝙪𝙞𝙩 𝙈𝙞𝙨𝙨𝙞𝙤𝙣"
        ],
        [
            "The Christianization of the North of Samar Island owes to the mission planted first by the Jesuit missionaries in the village of Tinago in 1596.",
            "The faith spread to Ibabao, the ancient name of the northern portion of Samar when another mission was established in Catubig."
        ],
        [
            "Due to certain reasons, around 1610, the Jesuit Residence was transferred from Catubig to Palapag.",
            "Evangelization in Pambujan might brought by the Jesuit missionaries from the Palapag Residencia."
        ],
        [
            "In the Annuae Litterae penned by Fr.",
            "Gregorio Lopez, SJ on the Status of the Jesuit Missions from 1612 to 1613, under Residencia de Cabo del Espiritu Santo, the village of Pamboan (sic Pambujan) was listed as having three hundred forty (340) tribute payers."
        ],
        [
            "In 1649, an uprising led by Agustin Sumuroy which started in Palapag made the people of Bayog or Pambujan joined the revolt against the Spaniards.",
            "After it was suppressed in 1650, many people from this town were reluctant to return.",
            "Fr.",
            "Francisco Ignacio Alcina, while being the rector of Palapag wrote in 1660's, \"from the town of Pambuhan only thirty tributos came together."
        ],
        [
            "Examing the archival records of the Archivum Romanum Societatis Iesu (ARSI) it seemed that the village of Pambujan never continued as a town or as a visita until the Jesuit expulsion in 1768.",
            "It will only came back to life as a town during the period of the Franciscan administration in the middle of the 1800's."
        ],
        [
            "𝙍𝙚-𝙛𝙤𝙪𝙣𝙙𝙞𝙣𝙜 𝙩𝙝𝙚 𝙏𝙤𝙬𝙣 𝙪𝙣𝙙𝙚𝙧 𝙩𝙝𝙚 𝙁𝙧𝙖𝙣𝙘𝙞𝙨𝙘𝙖𝙣𝙨"
        ],
        [
            "In 1767, the Jesuits were expelled by King Charles III in all Spanish dominions.",
            "The decree arrived in the Philippines in 1768 and the Franciscans from the Province of San Gregorio de Magno arrived in the capital town of Catbalogan on the 25th of September of that year to administer the transfer of the keys and properties of churches that were once under the possession of the Jesuits.",
            "The decree was carried only on the 17th of October and finally the Jesuits lefts the island-province on January 10, 1769 aboard the vessel San Francisco de Asis."
        ],
        [
            "The first Franciscan parish priest appointed to the pueblo of Laoáng was Fray Antonio de Toledo, OFM.",
            "At the beginning of his ministry to this town and with his zealous work, he managed to gather and convert several infidels (infieles) who lived on the banks of the river of Pambujan."
        ],
        [
            "In 1781, it was made a pueblo with the appointment of its first elected gobernadorcillo, Don Domingo Catangas who was a native of the town of Laoáng."
        ],
        [
            "Succeeding gobernadorcillos of the town were:"
        ],
        [
            "1821 - Don Francisco Feliciano"
        ],
        [
            "1842 - Don Eleuterio de los Reyes"
        ],
        [
            "1844 - Don Jose Roque"
        ],
        [
            "1851 - Don Francisco Pelino"
        ],
        [
            "1852 - Don Antonio Santo Osurio"
        ],
        [
            "1852 - Don Antonio Santiago Osurio"
        ],
        [
            "1853 - Don Francisco Velinohua"
        ],
        [
            "1855 - Don Lucio Merino"
        ],
        [
            "1860 - Don Solitario Siervo"
        ],
        [
            "1862 - Don Minerate Lutao"
        ],
        [
            "1863 - Don Tacio Ciervo"
        ],
        [
            "1865 - Don Lucio Merino"
        ],
        [
            "1881 - Don Jose Merino"
        ],
        [
            "1884 - Don Basilio de la Cruz"
        ],
        [
            "1886 - Don Ygnacio Atencio"
        ],
        [
            "1890-1893 - Don Basilio de la Cruz"
        ],
        [
            "1894 - Don Restituto Jazmin"
        ],
        [
            "1895-1898 - Don Eustaquio de la Cruz"
        ],
        [
            "The following year 1782, Mindanaoan Moros sacked and devastated the whole settlement which made its inhabitants dispersed and most of them retreated to a place called Ginulgan, about four leagues inland, where they remained until the year 1784."
        ],
        [
            "In 1784, with the advice of Fray Buenaventura Espinosa, OFM, he managed the people to resettle to its former site which later they named Binungtuan and was made a visita of the pueblo of Laoáng until its separation in 1863."
        ],
        [
            "Pambujan had a very small number of inhabitants until the year 1850, which received a great increase, through the initiative of Fray Sebastian Moraleda o de Almonacid, OFM, parish priest of Laoáng made an excursion to the mountains and converted more than seven hundred people and added them to the said pueblo."
        ],
        [
            "On August 4, 1863, it finally separated from its matriz, the pueblo of Laoáng and was made an independent pueblo and parish.",
            "In 1850's to 1860's it had the visitas of Laoángan, Bantayan, Caparanga and Ginulgan."
        ],
        [
            "𝙏𝙝𝙚 𝘾𝙝𝙪𝙧𝙘𝙝 𝙤𝙛 𝙋𝙖𝙢𝙗𝙪𝙟𝙖𝙣"
        ],
        [
            "The church of Pambujan under the patronage of al Precursor San Juan Bautista was built by the Franciscan missionaries.",
            "Its first appointed Franciscan parish priest was Fray Juan Cubria, OFM who took possession of the church on June 4, 1870."
        ],
        [
            "Some of the priests who served the church were Fray Francisco Crespo, OFM, Fray Angel Pulido, OFM, Fray Andres Mariblanca, OFM, Fray Eustaquio Paniagua, OFM, Fray Juan Caballero de Brozas, OFM, and Fray Ulpiano Tendero, OFM."
        ],
        [
            "Prior to its creation as a parish, it had already a church, a parish house, a tribunal, and an escuela primeras letras, all these buildings were built on the initiative and under the direction of Fray Sebastian de Almonacid, OFM starting in the year 1847 and the following."
        ],
        [
            "In 1872, Fray Francisco Crespo, OFM, appointed parish priest that year, began the construction of a masonry church (Iglesia de mampostería).",
            "The construction of the church was completed in 1896 and 97.",
            "It was roofed with galvanized iron (GI) sheets by Fray Ulpiano Tendero, OFM."
        ],
        [
            "In the late 1800s, the town had these buildings, the church, parish house, made of stone on the first floor, a court house, also made of stone on the first floor and the rest of wood, plus two primary schools, all of these buildings have been built through the active and dynamic work of the Franciscan Fathers, Fray Francisco Crespo, OFM (1871-1880), Fray Francisco Méndez, OFM (1887) and Fray Ulpiano Tendero, OFM (1897-1898)."
        ],
        [
            "In 1890, the town had a population of 7,421.",
            "In the poblacion had 1,756 people while and the visitas were Laoangan (580), Bantayan (530) and Ginolgan (430) with 12 barrios and 4 sitios."
        ],
        [
            "Separation of Barrio Lao-angan and Suba"
        ],
        [
            "The years that followed, specifically during the incumbency of Mayor Ramon Siervo (1955-1963) and Atty.",
            "Alfredo dela Cruz (1963-1967), faced the clamor of the inhabitants of Lao-angan and Suba for the conversion of these barrios into towns independent from Pambujan by seeking the assistance of Congressman Eladio T. Balite, then representative of the lone district of Samar.",
            "Thus, years later Barrio Lao-angan became the municipality of San Roque named after the Catholic Martyr Saint Roche; while Barrio Suba became the municipality of Silvino Lubos, named after the donor of its site, former Municipal Councilor and Barrio Teniente of Suba, Mr. Silvino Lubos."
        ],
        [
            "Nalucaban Baseball"
        ],
        [
            "The insurgency of 1970’s confronted Pambujan with losses- innocent lives and livelihoods.",
            "It was believed to be much disastrous as compared to World War II.",
            "However, during this period it gained both nationwide and worldwide recognitions when NALUCABAN KIDS won five national championships trophies in the Little League Baseball National Open Championships (1975, 1976, 1978, 1979 and 1980) which likewise brought it to the International Baseball Arena.",
            "These exploits were credited to the able management of the then Municipal Mayor Manuel T. Balanquit, Sr. and Coach Nestor U. Tingzon."
        ],
        [
            "Geography"
        ],
        [
            "Pambujan has a contiguous territory of 16,390 hectares (40,500 acres), which extends into the hinterlands of Northern Samar across a number of rivers, lakes, brooks and mountains.",
            "The most notable of these physical features is Mount Cagbigajo, which once served as an observation and listening post of the Allied Intelligence Bureau Operative (1934–44) during World War II."
        ],
        [
            "Pambujan town is then situated in what is now Barangay Ginulgan.",
            "Back then, the town consisted of 22 barrios covering an area of 670 square kilometers which stretched out to more than 402 kilometers span towards its western border (Samar Province)."
        ],
        [
            "It is also the northernmost settlement in the entire Samar Island."
        ],
        [
            "Pambujan River is the longest river in Samar island with a total length of 156 km (97 mi)."
        ],
        [
            "Barangays"
        ],
        [
            "Pambujan is politically subdivided into 26 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Cababtoan"
        ],
        [
            "Cabarian"
        ],
        [
            "Cagbigajo"
        ],
        [
            "Canjumadal"
        ],
        [
            "Doña Anecita"
        ],
        [
            "Camparanga"
        ],
        [
            "Geadgawan"
        ],
        [
            "Ginulgan"
        ],
        [
            "Giparayan"
        ],
        [
            "Igot"
        ],
        [
            "Ynaguingayan"
        ],
        [
            "Inanahawan"
        ],
        [
            "Manahao"
        ],
        [
            "Paninirongan"
        ],
        [
            "Poblacion 1"
        ],
        [
            "Poblacion 2"
        ],
        [
            "Poblacion 3"
        ],
        [
            "Poblacion 4"
        ],
        [
            "Poblacion 5"
        ],
        [
            "Poblacion 6"
        ],
        [
            "Poblacion 7"
        ],
        [
            "Poblacion 8"
        ],
        [
            "San Ramon"
        ],
        [
            "Senonogan"
        ],
        [
            "Don Sixto"
        ],
        [
            "Tula"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Pambujan, Northern Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "105(4.1)"
        ],
        [
            "67(2.6)"
        ],
        [
            "65(2.6)"
        ],
        [
            "53(2.1)"
        ],
        [
            "86(3.4)"
        ],
        [
            "129(5.1)"
        ],
        [
            "135(5.3)"
        ],
        [
            "113(4.4)"
        ],
        [
            "131(5.2)"
        ],
        [
            "163(6.4)"
        ],
        [
            "167(6.6)"
        ],
        [
            "162(6.4)"
        ],
        [
            "1,376(54.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.6"
        ],
        [
            "13.2"
        ],
        [
            "15.5"
        ],
        [
            "14.9"
        ],
        [
            "19.6"
        ],
        [
            "24.3"
        ],
        [
            "26.6"
        ],
        [
            "25.4"
        ],
        [
            "24.9"
        ],
        [
            "25.4"
        ],
        [
            "22.9"
        ],
        [
            "20.9"
        ],
        [
            "251.2"
        ],
        [
            "Source: Meteoblue (modelled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PambujanYearPop.±% p.a.1903 6,439—    1918 9,120+2.35%1939 14,864+2.35%1948 21,183+4.01%1960 23,254+0.78%1970 12,803−5.79%1975 14,794+2.94%1980 17,208+3.07%1990 18,389+0.67%1995 22,152+3.55%2000 25,394+2.97%2007 27,837+1.27%2010 31,057+4.06%2015 33,062+1.20%2020 35,532+1.43%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Pambujan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  47.30"
        ],
        [
            "2009  51.55"
        ],
        [
            "2012  55.46"
        ],
        [
            "2015  54.14"
        ],
        [
            "2018  44.68"
        ],
        [
            "2021  32.35"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Pambujan Municipal Council (2022–present):"
        ],
        [
            "Mayor: Felipe A. Sosing"
        ],
        [
            "Vice Mayor: Ronil A. Tan"
        ],
        [
            "Councilors:"
        ],
        [
            "Rodil R. Salazar"
        ],
        [
            "John D. Balanquit"
        ],
        [
            "Narita L. Balanquit"
        ],
        [
            "Juanito Lobos"
        ],
        [
            "Ray B. Galupo"
        ],
        [
            "Gina Ong"
        ],
        [
            "Jenice T. Abobo"
        ],
        [
            "Glenn J. Lucban"
        ],
        [
            "List of former chief executives"
        ],
        [
            "Presidente Municipal:"
        ],
        [
            "Pedro Tan (1909)"
        ],
        [
            "Licerio Sosing (1910)"
        ],
        [
            "Eustaquio Dela Cruz (1910–1911)"
        ],
        [
            "Primitivo Balanquit (1916–1918)"
        ],
        [
            "Fructuoso Lozano (1923–1924)"
        ],
        [
            "Galo Dela Cruz (1925–1927)"
        ],
        [
            "Isidro Morales (1928–1930)"
        ],
        [
            "Hilarion Siervo (1931–1933)"
        ],
        [
            "Municipal Mayors:"
        ],
        [
            "Arsenio Siervo Tan (1934–1941)"
        ],
        [
            "Juan F. Avalon (1945–1946)"
        ],
        [
            "Pedro Dela Cruz (1947–1954)"
        ],
        [
            "Ramon Siervo (1955–1962)"
        ],
        [
            "Alfredo N. Dela Cruz (1963–1967)"
        ],
        [
            "Manuel Tan Balanquit, Sr. (1968–1986)"
        ],
        [
            "Viador D. Tagle (1986–1987)"
        ],
        [
            "Manuel Tan Balanquit, Sr. (1987–1998)"
        ],
        [
            "Lino Lebeco Balanquit, Sr. (1998–2007)"
        ],
        [
            "Rogelio Siervo Tan (2007–2013)"
        ],
        [
            "Lino Lebeco Balanquit, Sr. (2013–2016)"
        ],
        [
            "Felipe A. Sosing, Sr. (2016-present)"
        ],
        [
            "Tourism"
        ],
        [
            "Paninirongan Beach"
        ],
        [
            "Paninirongan Beach is one of the beautiful beaches of Pambujan that has very fine sand, clear and cool water.",
            "This beach boasts a natural swimming pool even during high tides.",
            "Bathers can stay until afternoon and watch the beautiful sunset."
        ],
        [
            "Caohagan Island"
        ],
        [
            "Caohagan Island is the best place for diving, snorkeling, fishing and hunting.",
            "This exotic island is known for its beautiful corals and abundance of century trees and boracay white pebbles that is used as construction materials for exterior and interior design of houses/buildings.",
            "This island is also a haven of giant fruit bats."
        ],
        [
            "Objects are very visible vertically up to 15 meters deep and horizontally up to 10 meters in distance.",
            "Biotic communities that are essential components of marine ecological system such as coral and sea grasses can be observed in the coastal waters of the island.",
            "Caohagan has a bountiful variety of ornamental and commercial fishes."
        ],
        [
            "Oot and Libas Points"
        ],
        [
            "Both areas have pristine beaches, splendid under water corals ideal for snorkeling and diving.",
            "Various species of mangroves trees can also be found in these untouched areas."
        ],
        [
            "Culture"
        ],
        [
            "Kadayaw Festival"
        ],
        [
            "Celebrated every first full moon of the year.",
            "It is Pambujanon's way of celebrating the new year by praising the Almighty for the graces bestowed upon them and wishing more for the ensuing year.",
            "This whole day affair, which consists of local products’ trade fair (manggad trade fair), dance parade and floorshow demonstrations and a masquerade ball at night."
        ],
        [
            "Panarit sa Pasko"
        ],
        [
            "slated at the start of Novena on December 16 until December 24.",
            "It is a group-singing contest featuring original “PANARIT” song presentations."
        ],
        [
            "Lantaka Festival"
        ],
        [
            "Celebrated every December 31 showcasing artistic bamboo canons locally called as \"lantaka\"."
        ],
        [
            "Fiesta Celebration"
        ],
        [
            "Pambujan's town fiesta is celebrated every 24 June in honor of St. John the Baptist, the town's Patron Saint."
        ],
        [
            "Education"
        ],
        [
            "Pambujan I District"
        ],
        [
            "Pambujan I Central Elementary School"
        ],
        [
            "Busak Elementary School"
        ],
        [
            "San Ramon Elementary School"
        ],
        [
            "Canjumadal Elementary School"
        ],
        [
            "Manahaw Elementary School"
        ],
        [
            "Geadgawan Elementary School"
        ],
        [
            "Igot Elementary School"
        ],
        [
            "Pambujan National High School"
        ],
        [
            "Pambujan II District"
        ],
        [
            "Ginulgan Central Elementary School"
        ],
        [
            "Barangay Uno Elementary School School"
        ],
        [
            "Giparayan Elementary School"
        ],
        [
            "Inanahawan Elementary School"
        ],
        [
            "Cagbigajo Elementary School"
        ],
        [
            "Camparanga Elementary School"
        ],
        [
            "Canjumadal National High School"
        ],
        [
            "Cababtoan Elementary School"
        ],
        [
            "Paninirongan Elementary School"
        ],
        [
            "Don Sixto Primary School"
        ],
        [
            "Doña Anecita Primary School"
        ],
        [
            "Senonogan Primary School"
        ],
        [
            "Tula Elementary School"
        ],
        [
            "Tula National High School"
        ],
        [
            "Ynaguingayan Primary School"
        ],
        [
            "San Roque-Pambujan Vocational High School"
        ],
        [
            "Zoilo T. Lobos Memorial High School"
        ],
        [
            "Tertiary Education"
        ],
        [
            "CDLN - Pambujan Cluster"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Pambujan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Pambujan, Northern Samar : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 6 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Northern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Pambujan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "www.pambujan-nsamar.gov.ph"
        ],
        [
            "Places adjacent to Pambujan"
        ],
        [
            "Philippine Sea"
        ],
        [
            "San Roque"
        ],
        [
            "Pambujan"
        ],
        [
            "LaoangCatubig"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Las Navas"
        ],
        [
            "vte Province of Northern SamarCatarman (capital and largest municipality)Municipalities"
        ],
        [
            "Allen"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Capul"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Gamay"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lope de Vega"
        ],
        [
            "Mapanas"
        ],
        [
            "Mondragon"
        ],
        [
            "Palapag"
        ],
        [
            "Pambujan"
        ],
        [
            "Rosario"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Victoria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pambujan&oldid=1164041354\""
        ],
        [
            "Category: Municipalities of Northern SamarHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}