{
    "name": "Pamplona",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pamplona, Negros Oriental"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCatalàCebuanoChavacano de ZamboangaDeutschفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°28′N 123°07′E﻿ / ﻿9.47°N 123.12°E﻿ / 9.47; 123.12"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Negros Oriental, Philippines"
        ],
        [
            "Municipality in Negros Island Region, PhilippinesPamplonaMunicipalityMunicipality of Pamplona"
        ],
        [
            "FlagMap of Negros Oriental with Pamplona highlightedOpenStreetMapPamplonaLocation within the PhilippinesCoordinates: 9°28′N 123°07′E﻿ / ﻿9.47°N 123.12°E﻿ / 9.47; 123.12CountryPhilippinesRegionNegros Island RegionProvinceNegros OrientalDistrict"
        ],
        [
            "2nd districtFoundedJune 16, 1950Barangays16"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJanice V. Degamo (NP) • Vice MayorJoel G. Remolano (NP) • RepresentativeManuel T. Sagarbarria • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Nikko Niño A. RamirezLloyd Ian F. AniñonArcher P. BaldadoArnold A. LabeShari T. VallegaPatricio Leonardo D. Villegas Jr.Ericka Joy Z. FabeBluegen B. Lampajo"
        ],
        [
            " • Electorate29,207 voters (2022)Area • Revenue₱ 153.1 million (2020) • Assets₱ 404 million (2020) • Expenditure₱ 120.8 million (2020) • Liabilities₱ 100.4 million (2020)Service provider • ElectricityNegros Oriental 2 Electric Cooperative (NORECO 2)Time zoneUTC+8 (PST)ZIP code6205PSGC074616000IDD : area code +63 (0)35Native languagesCebuano TagalogNamed afterPamplona, Spain"
        ],
        [
            "Pamplona, officially the Municipality of Pamplona,  is a 3rd class municipality in the province of Negros Oriental, Philippines.",
            "According to the 2020 census, it has a population of 39,805 people."
        ],
        [
            "Etymology"
        ],
        [
            "Originally the place was called “Tampa”, named after a big shady tree located at the heart of the town.",
            "The naming of the place into Pamplona has two versions:"
        ],
        [
            "According to professor Timoteo Oracion, a historian of Silliman University, Pamplona was named after the town in Spain called Pamplona.",
            "According to his version, the first Spanish priest who was assigned to the place was amazed by the beautiful terrain which resembles to that of Pamplona, Spain.",
            "So that Tampa was renamed into Pamplona."
        ],
        [
            "Other history told by the old people of the place is that the place was called after a certain priest named Fr.",
            "Santiago Pamplona, the first Spanish Curate assigned in area."
        ],
        [
            "History"
        ],
        [
            "Pamplona, then a barrio of Tanjay, was created into a municipality by virtue of Republic Act No.",
            "535 enacted on June 16, 1950.",
            "The law was authored by Pedro Bandoquillio, elected congressman in 1947.",
            "Since its creation, it has been administered by six municipal mayors.",
            "They were the late Juan Cañaveral, Sergio Aniñon, and late Apolinario P. Arnaiz, Sr., who managed to hold the reign for more than 22 years.",
            "After the EDSA Revolution in 1986, Douglas T. Diago was appointed as Officer In Charge, ran and won in the 1987 election and took the reign for twelve years, managing to complete his three term of mayorship from 1986 to 1998."
        ],
        [
            "The late Wenceslao E. Duran, the undefeated politician, took hold of the administration for a brief period, after winning the 1998 election.",
            "He died of cardiac arrest while delivering his address during training in the municipality on December 18, 1999.",
            "Atty.",
            "Ricarte R. Valencia, who was then the vice mayor took office up to June 30, 2001.",
            "He ran for the post and lost in the election.",
            "Winning in the three elections in 2001.",
            "2004 and 2007, the young, and energetic Apolinario P. Arnaiz, Jr. now reigns in his three terms of office.",
            "In the May 2010 election, the brother of Apolinario P. Arnais, Jr., Apollo P. Arnaiz who won the election and reigns in his two terms of office.",
            "In the May 2016 election, Janice Vallega Degamo won as the first lady mayor of the municipality."
        ],
        [
            "On March 4, 2023, politician Roel Degamo, who was then serving as Negros Oriental governor, was fatally shot along with eight others by unidentified gunmen at his residence while he was distributing aid to beneficiaries of a conditional cash transfer program."
        ],
        [
            "Geography"
        ],
        [
            "Pamplona is located 37 kilometres (23 mi) north-west of the provincial capital of Dumaguete and 6 kilometres (3.7 mi) west from Tanjay."
        ],
        [
            "Tanjay bounds it on the north, on the east by Amlan and Tanjay, on the south by Sibulan and on the west by Santa Catalina."
        ],
        [
            "Barangays"
        ],
        [
            "Pamplona is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 074616001   Abante"
        ],
        [
            " 2.3%"
        ],
        [
            " 922"
        ],
        [
            " 781"
        ],
        [
            "  ▴"
        ],
        [
            " 1.67%"
        ],
        [
            " 074616002   Balayong"
        ],
        [
            " 5.7%"
        ],
        [
            " 2,260"
        ],
        [
            " 2,219"
        ],
        [
            "  ▴"
        ],
        [
            " 0.18%"
        ],
        [
            " 074616003   Banawe"
        ],
        [
            " 4.2%"
        ],
        [
            " 1,656"
        ],
        [
            " 1,515"
        ],
        [
            "  ▴"
        ],
        [
            " 0.89%"
        ],
        [
            " 074616017   Calicanan"
        ],
        [
            " 7.2%"
        ],
        [
            " 2,862"
        ],
        [
            " 2,445"
        ],
        [
            "  ▴"
        ],
        [
            " 1.59%"
        ],
        [
            " 074616004   Datagon"
        ],
        [
            " 7.8%"
        ],
        [
            " 3,089"
        ],
        [
            " 2,390"
        ],
        [
            "  ▴"
        ],
        [
            " 2.60%"
        ],
        [
            " 074616005   Fatima"
        ],
        [
            " 4.1%"
        ],
        [
            " 1,643"
        ],
        [
            " 1,456"
        ],
        [
            "  ▴"
        ],
        [
            " 1.22%"
        ],
        [
            " 074616007   Inawasan"
        ],
        [
            " 3.4%"
        ],
        [
            " 1,348"
        ],
        [
            " 1,320"
        ],
        [
            "  ▴"
        ],
        [
            " 0.21%"
        ],
        [
            " 074616008   Magsusunog"
        ],
        [
            " 4.1%"
        ],
        [
            " 1,646"
        ],
        [
            " 1,317"
        ],
        [
            "  ▴"
        ],
        [
            " 2.25%"
        ],
        [
            " 074616009   Malalangsi"
        ],
        [
            " 7.8%"
        ],
        [
            " 3,110"
        ],
        [
            " 3,244"
        ],
        [
            "  ▾"
        ],
        [
            " −0.42%"
        ],
        [
            " 074616010   Mamburao"
        ],
        [
            " 5.1%"
        ],
        [
            " 2,014"
        ],
        [
            " 1,929"
        ],
        [
            "  ▴"
        ],
        [
            " 0.43%"
        ],
        [
            " 074616011   Mangoto"
        ],
        [
            " 4.0%"
        ],
        [
            " 1,608"
        ],
        [
            " 1,447"
        ],
        [
            "  ▴"
        ],
        [
            " 1.06%"
        ],
        [
            " 074616012   Poblacion"
        ],
        [
            " 18.0%"
        ],
        [
            " 7,165"
        ],
        [
            " 5,649"
        ],
        [
            "  ▴"
        ],
        [
            " 2.41%"
        ],
        [
            " 074616013   San Isidro"
        ],
        [
            " 8.1%"
        ],
        [
            " 3,217"
        ],
        [
            " 2,997"
        ],
        [
            "  ▴"
        ],
        [
            " 0.71%"
        ],
        [
            " 074616014   Santa Agueda"
        ],
        [
            " 8.1%"
        ],
        [
            " 3,214"
        ],
        [
            " 3,041"
        ],
        [
            "  ▴"
        ],
        [
            " 0.55%"
        ],
        [
            " 074616015   Simborio"
        ],
        [
            " 5.5%"
        ],
        [
            " 2,184"
        ],
        [
            " 1,541"
        ],
        [
            "  ▴"
        ],
        [
            " 3.55%"
        ],
        [
            " 074616016   Yupisan"
        ],
        [
            " 4.7%"
        ],
        [
            " 1,867"
        ],
        [
            " 1,615"
        ],
        [
            "  ▴"
        ],
        [
            " 1.46%"
        ],
        [
            "Total"
        ],
        [
            "39,805"
        ],
        [
            "34,906"
        ],
        [
            " ▴"
        ],
        [
            "1.32%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Pamplona, Negros Oriental"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "26(1.0)"
        ],
        [
            "22(0.9)"
        ],
        [
            "28(1.1)"
        ],
        [
            "41(1.6)"
        ],
        [
            "95(3.7)"
        ],
        [
            "136(5.4)"
        ],
        [
            "147(5.8)"
        ],
        [
            "126(5.0)"
        ],
        [
            "132(5.2)"
        ],
        [
            "150(5.9)"
        ],
        [
            "98(3.9)"
        ],
        [
            "46(1.8)"
        ],
        [
            "1,047(41.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "7.5"
        ],
        [
            "6.7"
        ],
        [
            "8.9"
        ],
        [
            "10.4"
        ],
        [
            "21.6"
        ],
        [
            "25.6"
        ],
        [
            "26.3"
        ],
        [
            "25.0"
        ],
        [
            "24.1"
        ],
        [
            "26.2"
        ],
        [
            "19.2"
        ],
        [
            "12.1"
        ],
        [
            "213.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PamplonaYearPop.±% p.a.1960 18,383—    1970 20,541+1.11%1975 22,076+1.46%1980 23,221+1.02%1990 27,971+1.88%1995 29,235+0.83%2000 32,790+2.49%2007 34,557+0.73%2010 34,906+0.37%2015 37,596+1.42%2020 39,805+1.13%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Pamplona"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  47.30"
        ],
        [
            "2009  35.50"
        ],
        [
            "2012  34.12"
        ],
        [
            "2015  40.33"
        ],
        [
            "2018  25.60"
        ],
        [
            "2021  28.93"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "There are 243 food establishments operating in the municipality, 218 or 90% which have sanitary permits."
        ],
        [
            "There are 10 sand and gravel companies operating in the municipality, 6 Copra Buyer and 5 Hog Buyer."
        ],
        [
            "Agriculture"
        ],
        [
            "Agriculture continues to be the main economic activity in Pamplona as it played an important role in the development of the town.",
            "The main crops raised in the place are sugar, coconuts and bananas.",
            "Other crops such as corn, rice and other root crops grows in areas where accessibility to farm to market roads is rare.",
            "Coconut is the largest crops raised accumulating 3,676 hectares, followed by sugar 3,432 hectares and corn, 1,022 hectares.",
            "Only 107 hectares are irrigated rice land while 643 hectares are upland rice.",
            "Of the total agriculture areas of the municipality, 11,395 is strategic areas for development of Agro-industrial crops, 1,925 hectares for food crops while 925 for High Value Crops.",
            "Other agri-related economic activities which greatly helped in the increase of farmer's income is livestock raising.",
            "Record shows that livestock raised includes large cattle, swine, chicken, goats and many others.",
            "Other information on agricultural support facilities are shown in the following presentation."
        ],
        [
            "Tourism"
        ],
        [
            "The municipality launched the Kasulad Festival on October 1–12, 2005.",
            "This is a yearly festival which will include street dancing and agricultural and industrial fair."
        ],
        [
            "Another potential area which attracts visitors, is the sulfuric water falls known as The Palaypay Falls.",
            "Its water source is nestled by the mountains of Sibulan.",
            "The place is accessible by four wheel drive vehicles and motorcycles, being connected by rough roads.",
            "It is located 12 kilometers from the Poblacion and can be reached within 30-min drive or 2h walk from the Poblacion."
        ],
        [
            "Mountain ridges overlooking the plains of Pamplona, can be an object for viewers of scenic beauties.",
            "Nabalabag ridge, located at an elevation of 800 m above sea level at barangay San Isidro, overlooks on the west at municipalities of Bayawan and Santa Catalina and in the east, with the town of Pamplona, Tanjay and Manjuyod and the city of Bais."
        ],
        [
            "Pasalubong delicacies processed in the municipality include Glazed Banana and Carmelitos.",
            "The famous Bodbod is also processed in the area."
        ],
        [
            "Education"
        ],
        [
            "The municipality has a total of 23 established primary and elementary schools.",
            "Each of the sixteen barangays composing the municipality has at least one primary school."
        ],
        [
            "Performance indicator for the School year 2004-2005 revealed that the literacy rate is 80%, Cohort Survival rate is 40.89%, drop out rate is 2.32%, and participation rate is 85.97.",
            "This mean that out of the total children enrolled in schools 2.32% drop out or stop during the school year and of the total school age population, 85.97% are in schools."
        ],
        [
            "DepEd is undertaking various educational programs.",
            "Among which is the Third Elementary Education Program (TEEP) for School buildings, improvement and Innovation facilities.",
            "To the moment five buildings were improved and repaired."
        ],
        [
            "The Fifth Country Program for Children (CPC V) has identified another two pilot barangays for its child program.",
            "Day care Children, Grades I and II of barangays Magsusunog and Inawasan had availed the program.",
            "They were provided with vitamin supplements, plastic chairs and other materials to meet the child-friendly-school standards.",
            "Barangay Health Centres on the other hand had received equipment and facilities in the delivery of health services."
        ],
        [
            "The Negros Oriental State University Main Campus College of Agriculture, Forestry and Fisheries has an extension campus in Pamplona."
        ],
        [
            "In 2008, Paidos Learning Center (now Paidos Learning And Nurturing Academe+, Incorporated) was established for early childhood ages.",
            "As a private institution, PLAN A+ has been an active partner in community development for Education and Care (EDUCARE).",
            "Paidos complements the EDUCARE services of children in DSWD Daycare centers and the Kindergartners in DepEd schools."
        ],
        [
            "The public schools in the town of Pamplona are administered by two school districts under the Schools Division of Tanjay City."
        ],
        [
            "Elementary schools:"
        ],
        [
            "Abante Elementary School — Abante"
        ],
        [
            "Balayong Elementary School — Balayong"
        ],
        [
            "Banawe Elementary School — Banawe"
        ],
        [
            "Calicanan Elementary School — Calicanan"
        ],
        [
            "Caningay Elementary School — Sitio Caningay, San Isidro"
        ],
        [
            "Cantilo Elementary School — Sitio Cantilo, Mangoto"
        ],
        [
            "Datagon Elementary School — Datagon"
        ],
        [
            "Fatima Elementary School — Fatima"
        ],
        [
            "Hunop Elementary School — Sitio Hunop, San Isidro"
        ],
        [
            "Ilalan Elementary School — Sitio Ilalan, Yupisan"
        ],
        [
            "Inawasan Elementary School — Inawasan"
        ],
        [
            "Magsusunog Elementary School — Magsusunog"
        ],
        [
            "Malalangsi Elementary School — Malalangsi"
        ],
        [
            "Mamburao Elementary School — Mamburao"
        ],
        [
            "Nabalabag Elementary School — Sitio Nabalabag, San Isidro"
        ],
        [
            "Pamplona Central Elementary School — Poblacion"
        ],
        [
            "Samoyao Elementary School — Sitio Samoyao, Yupisan"
        ],
        [
            "San Isidro Elementary School — San Isidro"
        ],
        [
            "Simborio Elementary School — Simborio"
        ],
        [
            "Sta.",
            "Agueda Elementary School — Sta.",
            "Agueda"
        ],
        [
            "Tigbao Elementary School — Sitio Tigbao, Banawe"
        ],
        [
            "Yupisan Elementary School — Yupisan"
        ],
        [
            "High schools:"
        ],
        [
            "Adela Pera Memorial High School — Fatima"
        ],
        [
            "Apolinario Gerarda Arnaiz High School — Magsusunog"
        ],
        [
            "Exequil P. Toroy High School — Banawe"
        ],
        [
            "Hunop Community High School — Sitio Hunop, San Isidro"
        ],
        [
            "Inawasan Provincial Community High School — Inawasan"
        ],
        [
            "Isidoro Salma Memorial High School — Balayong"
        ],
        [
            "Pamplona National High School — Poblacion"
        ],
        [
            "Samoyao High School — Samoyao"
        ],
        [
            "San Isidro High School — San Isidro"
        ],
        [
            "Sta.",
            "Agueda National High School — Sta.",
            "Agueda"
        ],
        [
            "Sta.",
            "Agueda NHS - Calicanan Extension — Calicanan"
        ],
        [
            "Healthcare"
        ],
        [
            "The record of live birth indicates that 20 children are born for every 1,000 population, while death records showed that 4 died for every 1,000.",
            "The data shows, that with the total population of 32,000 the municipality's population will increase to 37,120 by the year 2012.",
            "This indicates the need to strengthen the campaign for birth control or family planning.",
            "According to the report of the MHO with the total death, 99% or 156 had medical attendance.",
            "These proves that medical services is efficient and effective.",
            "Of the seven infant deaths three died of Pneumonia, two died of unknown cause and two on stillbirths.",
            "Cause of one maternal death was due to Postpartum hemorrhage.",
            "The decrease of infant and maternal death rate for the year signified the efficient and effective delivery of health services in the barangays.",
            "Despite the insufficient facilities in the barangays, midwives and health workers efficiently did their jobs.",
            "The top three leading causes of mortality showed that 60 died of Pneumonia, 18 died of Cerebrovascular Accident while 17 died of Congestive Hearth Failure, while the top three leading causes of morbidity showed Influenza, Pneumonia and Diarrhea.",
            "Basing on the report, Pneumonia is the top leading cause of mortality among infants and adults.",
            "The top three leading causes of morbidity are environmentally borne.",
            "All three can be accounted to poor environmental sanitation.",
            "This situation will guide both health workers and stakeholders where to direct its programs.",
            "Malnutrition is still prevalent in the municipality, although incidence of severe malnutrition is 0.7% which is very low, incidence of mild malnutrition is 44% which is still high.",
            "The incidence of severe has to be eradicated and the incidence of mild has to be reduced.",
            "Improving health condition of the people and total eradication of both infant and maternal death incidence are the endeavors of heath workers.",
            "With this, there is a need for substantial support of both the barangay and municipal government units in the form of facilities, supplies and medicines."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Pamplona |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"An act to convert the barrio of Pamplona, municipality of Tanjay, province of Oriental Negros, to a municipality with the same name\".",
            "LawPH.com.",
            "Retrieved April 9, 2011."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Pamplona: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 6, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Pamplona (Negros Oriental)."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Pamplona, Negros Oriental"
        ],
        [
            "Tanjay"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Pamplona"
        ],
        [
            "Tanjay"
        ],
        [
            "Sibulan"
        ],
        [
            "vte Province of Negros OrientalDumaguete (capital and largest city)Municipalities"
        ],
        [
            "Amlan"
        ],
        [
            "Ayungon"
        ],
        [
            "Bacong"
        ],
        [
            "Basay"
        ],
        [
            "Bindoy"
        ],
        [
            "Dauin"
        ],
        [
            "Jimalalud"
        ],
        [
            "La Libertad"
        ],
        [
            "Mabinay"
        ],
        [
            "Manjuyod"
        ],
        [
            "Pamplona"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Siaton"
        ],
        [
            "Sibulan"
        ],
        [
            "Tayasan"
        ],
        [
            "Valencia"
        ],
        [
            "Vallehermoso"
        ],
        [
            "Zamboanguita"
        ],
        [
            "Component cities"
        ],
        [
            "Bais"
        ],
        [
            "Bayawan"
        ],
        [
            "Canlaon"
        ],
        [
            "Dumaguete"
        ],
        [
            "Guihulngan"
        ],
        [
            "Tanjay"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pamplona,_Negros_Oriental&oldid=1229045934\""
        ],
        [
            "Category: Municipalities of Negros OrientalHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using the Kartographer extension"
        ]
    ]
}