{
    "name": "Pandi",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pandi, Bulacan"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°52′N 120°57′E﻿ / ﻿14.87°N 120.95°E﻿ / 14.87; 120.95"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bulacan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Pandi, Bulacan\" – news · newspapers · books · scholar · JSTOR (June 2011) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesPandiMunicipalityMunicipality of PandiPandi Municipal Hall"
        ],
        [
            "FlagSealMap of Bulacan with Pandi highlightedOpenStreetMapPandiLocation within the PhilippinesCoordinates: 14°52′N 120°57′E﻿ / ﻿14.87°N 120.95°E﻿ / 14.87; 120.95CountryPhilippinesRegionCentral LuzonProvinceBulacanDistrict"
        ],
        [
            "5th districtFoundedApril 17, 1946Barangays22"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEnrico A. Roque • Vice MayorLuisa P. Sebastian • RepresentativeAmbrosio C. Cruz Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Reynaldo D. Roxas Jr.Monette L. JimenezJaycel R. SantosDanilo M. del RosarioWilma E. ParaulanKatrina C. MarquezRonald S. Sta.",
            "AnaVictorino D. Concepcion Jr."
        ],
        [
            " • Electorate87,984 voters (2022)Area • Revenue₱ 266.8 million (2020) • Assets₱ 759 million (2020) • Expenditure₱ 294.2 million (2020) • Liabilities₱ 220 million (2020)Utilities • ElectricityMeralcoTime zoneUTC+8 (PST)ZIP code3014PSGC031415000IDD : area code +63 (0)44Native languagesTagalog"
        ],
        [
            "Pandi"
        ],
        [
            "The municipality of Pandi lies 41 kilometres (25 mi) north-east of Manila and is located at the eastern portion of Bulacan Province.",
            "With the continuous expansion of Metro Manila, Pandi is now included in the Greater Manila's built-up area which reaches San Ildefonso, Bulacan at its northernmost part."
        ],
        [
            "Pandi is one of the youngest towns in Bulacan.",
            "During the Spanish Regime, Pandi was a part of the political jurisdiction of the town of Meycauayan City including the towns of San Jose del Monte, Bocaue, Marilao, Valenzuela, Obando, Santa Maria, Balagtas, it also formed part of the vast Hacienda Santa Maria de Pandi, which included the towns of Santa Maria and Balagtas and parts of Angat and Bustos.",
            "Pandi was then a part of the town Balagtas (then Bigaa) until its formal separation and independence on April 17, 1946."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Pandi was originally part of Hacienda of Dominicans named Hacienda which belongs to the Town Santa Maria de Pandi (now Santa Maria, Bulacan); Pandi was derived from pande, Kapampangan word of \"blacksmith,\" cognate of Tagalog word \"panday.\"",
            "In 1874 it was turn over to the town of Bigaa as one of its Barrio and the religious activity belongs to Convento de Bigaa under the auspices of Augustinian order established a chapel under the advocacy of Immaculate Concepcion."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "The Republic of Kakarong de Sili"
        ],
        [
            "Main article: Battle of Kakarong de Sili"
        ],
        [
            "Inang Filipina Shrine"
        ],
        [
            "During the Philippine Revolution, Pandi played a vital and historical role in the fight for Philippine independence, Pandi is historically known for the Real de Kakarong de Sili Shrine - Inang Filipina Shrine, the site where the bloodiest revolution in Bulacan took place, where more than 3,000 Katipunero revolutionaries died.",
            "Likewise, it is on this site where the 'Republic of Real de Kakarong de Sili' of 1896, one of the first Philippine revolutionary republics was established.",
            "It was in Kakarong de Sili, which about 6,000 Katipuneros from various towns of Bulacan headed by Brigadier General Eusebio Roque, a mysticist (albolaryo) better known as \"Maestrong Sebio or Dimabungo\" - List of Filipino Generals in the Philippine Revolution of 1896 and the Filipino-American War of 1899 that the Kakarong Republic was organized shortly after the Cry of Pugad Lawin referred to as 'The Cry of Balintawak' - Andres Bonifacio a Filipino nationalist and revolutionalist who led in 'The Cry of Balintawak'.",
            "The 'Kakarong Republic' was the first revolutionary government established in Bulacan to overthrow the Spaniards.",
            "These significant event shave been included as of one of the attributes in the seal of the province of Bulacan."
        ],
        [
            "According to available records including the biography of General Gregorio del Pilar entitled \"Life and Death of a Boy General\" written by Teodoro Kalaw, former director of the National Library of the Philippines, an improvised fort was constructed at 'Kakarong de Sili'.",
            "It had streets, an independent police force, a band, a factory of falconets, bolos and repair shops for rifles and cartridges.",
            "The 'Kakarong Republic' had a complete set of officials with Canuto Villanueva as Supreme Chief and 'Maestrong Sebio'- Eusebio Roque, who was Brigadier General.",
            "The fort was attacked and totally destroyed on January 1, 1897, by a large Spanish force headed by General Olaguer-Feliu.",
            "Gen. Gregorio del Pilar was only a lieutenant at that time and 'The Battle of Kakarong de Sili' was his first \"baptism of fire\".",
            "This was where he was first wounded and escaped to nearby barangay 'Manatal'.",
            "After the Battle of Kakarong de Sili mysticist Eusebio Roque were arrested and transferred to Bulakan town where the seat of Alcaldia Mayor located and he was sentenced to death."
        ],
        [
            "The Kakarong Lodge No.",
            "168 of the 'Legionarios del Trabajo' in memory of the 1,200 Katipuneros who perished in the battle erected a monument of the Inang Filipina Shrine - Mother Philippines Shrine in 1924 in the barrio of Kakarong.",
            "The actual site of the 'Battle of Kakarong de Sili' belongs to the administrative and geographical jurisdiction of Town of Bigaa and it was given to Pandi in 1946.",
            "The site is now a part of the barangay of 'Real de Kakarong'.",
            "No less than one of the greatest generals in the Philippines' history, General Emilio Aguinaldo who became first Philippine president visited this sacred ground in the late fifties."
        ],
        [
            "The birth of the town of Pandi"
        ],
        [
            "The independence of Pandi as a new town of Bulacan was through the efforts of Mamerto Carpio Bernardo - (The Father of Pandi, Bulacan).",
            "During his term as mayor of Balagtas, he worked for the independence of Pandi as a town.",
            "Matias B. Salvador become the first mayor after the town gained independence in 1946 from its mother town Balagtas formerly named Bigaa, under the Presidential Decree of President Sergio Osmeña the 4th president of the country."
        ],
        [
            "Geography"
        ],
        [
            "Pandi is located at the center of four adjoining towns of Bulacan Province: Santa Maria; Bustos; Angat; and Balagtas.",
            "The land area are mostly rice fields devoted for planting crops and agriculture.",
            "Some barrios of the town are covered by irrigation system coming from Angat Dam on the Angat River.",
            "There are many little rivers that branch out from this river that become estuaries.",
            "Some little rivers provide livelihood by fanning gold.",
            "The biggest river is Bunsuran River that empties itself to the Philippine Sea.",
            "Along the side of the rivers are banana plantations thriving naturally and many taro plants."
        ],
        [
            "Pandi is rich in many natural brooks coming from the mainland itself.",
            "In some remote areas the lands are still covered by bamboo trees that naturally thrive and multiplies.",
            "Some lands privately owned have mango plantations.",
            "In some areas that are privately owned are rock deposits being used for housing materials.",
            "The eastern area of Poblacion is gifted by the natural panoramic beauty of the scenery of Sierra Madre Mountains in Luzon.",
            "Owing to this the morning climate is always cloudy and cool in some areas of the town proper of Pandi, Bulacan.",
            "Some of the natural variations in topography of Pandi land areas have been evened out due to the urbanization of the town.",
            "The town's central area has been altered substantially by commercial establishments."
        ],
        [
            "Pandi was part of 2nd congressional district from 1987 to 2022.",
            "It was moved to 5th district along with Balagtas, Bocaue, and Guiguinto."
        ],
        [
            "Climate"
        ],
        [
            "The prevailing climatic conditions in the municipality is categorized into two types: wet season and dry season."
        ],
        [
            "Wet season (Rainy Season or Monsoon Season)"
        ],
        [
            "Dry season (Summer Season)"
        ],
        [
            "Climate data for Pandi, Bulacan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "6(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "6(0.2)"
        ],
        [
            "17(0.7)"
        ],
        [
            "82(3.2)"
        ],
        [
            "122(4.8)"
        ],
        [
            "151(5.9)"
        ],
        [
            "123(4.8)"
        ],
        [
            "124(4.9)"
        ],
        [
            "99(3.9)"
        ],
        [
            "37(1.5)"
        ],
        [
            "21(0.8)"
        ],
        [
            "792(31.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "2.5"
        ],
        [
            "11.7"
        ],
        [
            "6.6"
        ],
        [
            "17.7"
        ],
        [
            "22.2"
        ],
        [
            "25.2"
        ],
        [
            "23.7"
        ],
        [
            "23.2"
        ],
        [
            "17.9"
        ],
        [
            "9.2"
        ],
        [
            "5.2"
        ],
        [
            "168.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Pandi is subdivided into 22 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 031415001   Bagbaguin"
        ],
        [
            " 1.5%"
        ],
        [
            " 2,327"
        ],
        [
            " 2,264"
        ],
        [
            "  ▴"
        ],
        [
            " 0.27%"
        ],
        [
            " 031415002   Bagong Barrio"
        ],
        [
            " 7.0%"
        ],
        [
            " 10,857"
        ],
        [
            " 5,902"
        ],
        [
            "  ▴"
        ],
        [
            " 6.28%"
        ],
        [
            " 031415003   Bunsuran III"
        ],
        [
            " 1.6%"
        ],
        [
            " 2,416"
        ],
        [
            " 2,570"
        ],
        [
            "  ▾"
        ],
        [
            " −0.62%"
        ],
        [
            " 031415004   Bunsuran I"
        ],
        [
            " 3.0%"
        ],
        [
            " 4,607"
        ],
        [
            " 4,831"
        ],
        [
            "  ▾"
        ],
        [
            " −0.47%"
        ],
        [
            " 031415005   Bunsuran II"
        ],
        [
            " 2.2%"
        ],
        [
            " 3,404"
        ],
        [
            " 3,375"
        ],
        [
            "  ▴"
        ],
        [
            " 0.09%"
        ],
        [
            " 031415006   Cacarong Bata"
        ],
        [
            " 0.9%"
        ],
        [
            " 1,434"
        ],
        [
            " 1,328"
        ],
        [
            "  ▴"
        ],
        [
            " 0.77%"
        ],
        [
            " 031415007   Cacarong Matanda"
        ],
        [
            " 4.0%"
        ],
        [
            " 6,193"
        ],
        [
            " 2,173"
        ],
        [
            "  ▴"
        ],
        [
            " 11.04%"
        ],
        [
            " 031415008   Cupang"
        ],
        [
            " 1.8%"
        ],
        [
            " 2,719"
        ],
        [
            " 1,996"
        ],
        [
            "  ▴"
        ],
        [
            " 3.14%"
        ],
        [
            " 031415009   Malibong Bata"
        ],
        [
            " 1.5%"
        ],
        [
            " 2,387"
        ],
        [
            " 2,271"
        ],
        [
            "  ▴"
        ],
        [
            " 0.50%"
        ],
        [
            " 031415010   Malibong Matanda"
        ],
        [
            " 4.1%"
        ],
        [
            " 6,296"
        ],
        [
            " 5,641"
        ],
        [
            "  ▴"
        ],
        [
            " 1.10%"
        ],
        [
            " 031415011   Manatal"
        ],
        [
            " 2.0%"
        ],
        [
            " 3,047"
        ],
        [
            " 3,095"
        ],
        [
            "  ▾"
        ],
        [
            " −0.16%"
        ],
        [
            " 031415012   Mapulang Lupa"
        ],
        [
            " 5.7%"
        ],
        [
            " 8,775"
        ],
        [
            " 2,491"
        ],
        [
            "  ▴"
        ],
        [
            " 13.42%"
        ],
        [
            " 031415013   Masagana"
        ],
        [
            " 1.6%"
        ],
        [
            " 2,496"
        ],
        [
            " 2,212"
        ],
        [
            "  ▴"
        ],
        [
            " 1.22%"
        ],
        [
            " 031415014   Masuso"
        ],
        [
            " 2.1%"
        ],
        [
            " 3,240"
        ],
        [
            " 3,228"
        ],
        [
            "  ▴"
        ],
        [
            " 0.04%"
        ],
        [
            " 031415015   Pinagkuartelan"
        ],
        [
            " 2.6%"
        ],
        [
            " 4,013"
        ],
        [
            " 3,691"
        ],
        [
            "  ▴"
        ],
        [
            " 0.84%"
        ],
        [
            " 031415016  Poblacion"
        ],
        [
            " 5.0%"
        ],
        [
            " 7,764"
        ],
        [
            " 8,126"
        ],
        [
            "  ▾"
        ],
        [
            " −0.45%"
        ],
        [
            " 031415017   Real de Cacarong"
        ],
        [
            " 2.2%"
        ],
        [
            " 3,421"
        ],
        [
            " 725"
        ],
        [
            "  ▴"
        ],
        [
            " 16.78%"
        ],
        [
            " 031415018   San Roque"
        ],
        [
            " 1.7%"
        ],
        [
            " 2,676"
        ],
        [
            " 2,573"
        ],
        [
            "  ▴"
        ],
        [
            " 0.39%"
        ],
        [
            " 031415019   Siling Bata"
        ],
        [
            " 3.1%"
        ],
        [
            " 4,875"
        ],
        [
            " 2,407"
        ],
        [
            "  ▴"
        ],
        [
            " 7.31%"
        ],
        [
            " 031415020   Siling Matanda"
        ],
        [
            " 2.4%"
        ],
        [
            " 3,679"
        ],
        [
            " 3,378"
        ],
        [
            "  ▴"
        ],
        [
            " 0.86%"
        ],
        [
            " 031415021   Baka‑bakahan"
        ],
        [
            " 0.5%"
        ],
        [
            " 848"
        ],
        [
            " 817"
        ],
        [
            "  ▴"
        ],
        [
            " 0.37%"
        ],
        [
            " 031415022   Santo Niño"
        ],
        [
            " 1.0%"
        ],
        [
            " 1,601"
        ],
        [
            " 1,556"
        ],
        [
            "  ▴"
        ],
        [
            " 0.29%"
        ],
        [
            "Total"
        ],
        [
            "155,115"
        ],
        [
            "66,650"
        ],
        [
            " ▴"
        ],
        [
            "8.81%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PandiYearPop.±% p.a.1948 5,054—    1960 10,283+6.10%1970 15,884+4.44%1975 18,824+3.46%1980 22,679+3.80%1990 32,648+3.71%1995 40,520+4.13%2000 48,088+3.74%2007 60,637+3.25%2010 66,650+3.50%2015 89,075+5.68%2020 155,115+11.52%Source: Philippine Statistics Authority"
        ],
        [
            "Immaculate Concepcion Parish Church"
        ],
        [
            "In the 2020 census, the population of Pandi, Bulacan, was 155,115 people, with a density of 5,000 inhabitants per square kilometre or 13,000 inhabitants per square mile."
        ],
        [
            "Language and ethnicity"
        ],
        [
            "Majority of the population of 'Pandienos' are native to Pandi whose roots can be traced back from the neighboring towns of Balagtas, Bulacan, Bocaue, Bulacan and Santa Maria, Bulacan.",
            "Some families are intermarriage between immigrants from Ilocos Region and as far as Nueva Ecija during earlier periods.",
            "The most recent immigrants are from Luzon and Visayas islands, and Bicol.",
            "The population speaks Tagalog and it is the medium of instruction in schools, as well as Kapampangan and English."
        ],
        [
            "Religion"
        ],
        [
            "The majority of the population are Christians.",
            "Roman Catholicism is the predominant religion in the municipality and has two parishes: Immaculate Conception Parish in Poblacion town proper and Santo Cristo Parish in baranggay 'Siling Bata'.",
            "Other religious groups with strong presence in the municipality are the following: Members Church of God International or Ang Dating Daan, Iglesia ni Cristo, Jehovah's Witness, Jesus Is Lord Church, Iglesia Evangelica Metodista En Las Islas Filipinas (IEMELIF) and other Evangelical or \"Born-Again\" groups, as well as Pentecostals.",
            "Islam is also practiced with the presence of Abu Bakr Mosque as the first Mosque established in the Town of Pandi, located at Barangay Masuso."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Pandi"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  14.10"
        ],
        [
            "2009  7.58"
        ],
        [
            "2012  6.89"
        ],
        [
            "2015  8.75"
        ],
        [
            "2018  7.09"
        ],
        [
            "2021  21.04"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Pandi Wet and Dry Public Market"
        ],
        [
            "Major Industries: Furniture Making, Garments and Embroidery, Metalcraft, Poultry and Hog Raising, Agriculture and Farming.",
            "Local Food Processing.",
            "Commercial Retail Dry Goods Business.",
            "Recreation Facilities for Tourism."
        ],
        [
            "Major Products: Local processed Food and Rice.",
            "Furnitures.",
            "Embroidered clothes, bed linens and kitchen linens."
        ],
        [
            "Minor Products: Orchid plants for retail.",
            "Mangoes for local consumption and other minor agricultural products sold in the local market as well as the markets of the next towns.",
            "Poultry products like table eggs and chicken meat.",
            "Duck raising and salted egg production.",
            "Little fishponds for raising Tilapia fish.",
            "This provides the town folks their livelihood."
        ],
        [
            "Banks"
        ],
        [
            "The town of Pandi has two banks:"
        ],
        [
            "Rural Bank of Pandi Incorporated, which currently has two branches, one in Pandi and another in Santa Maria, Bulacan next town to Pandi in the north-east.",
            "The third branch of the Rural Bank of Pandi will soon open in Guiguinto, Bulacan, 2012, which is north-west of Pandi, next to its mother town Balagtas, Bulacan.",
            "Rural Bank of Pandi is the pioneer bank of the town founded by Julita Cruz Andres, a resident of Pandi who is a native of Angat, Bulacan - baranggay 'Niyugan' and Atty.",
            "Ciriaco C. Santos, a native of Pandi.",
            "The banks primarily serve agricultural businesses and farmers and animal husbandry businesses."
        ],
        [
            "Gateway Rural Bank Incorporated - Gatebank, a chain of banks in Bulacan Province and Luzon island.",
            "The banks provide international money transfer.",
            "They primarily serve agricultural businesses and farmers, and animal husbandry businesses.",
            "The bank was founded 1997 by a native of Pandi, Bulacan - Mercedes G. Santos-Coloma, 2012 president.",
            "The parents of Mercedes are Atty.",
            "Ciriaco C. Santos and Belen Bernardo Galvez-Santos."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Municipal hall of Pandi, entrance arch"
        ],
        [
            "Mayor: Enrico A. Roque (NUP)"
        ],
        [
            "Vice Mayor: Luisa P. Sebastian (NUP)"
        ],
        [
            "Municipal Councilors:"
        ],
        [
            "Reynaldo D. Roxas (NUP)"
        ],
        [
            "Monette L. Jimenez (NUP)"
        ],
        [
            "Jaycel R. Santos (NUP)"
        ],
        [
            "Danilo M. del Rosario (NUP)"
        ],
        [
            "Wilma E. Paraulan (NUP)"
        ],
        [
            "Katrina C. Marquez (NUP)"
        ],
        [
            "Ronald S. Sta.",
            "Ana (NUP)"
        ],
        [
            "Victorino D. Concepcion Jr. (NUP)"
        ],
        [
            "Ex Officio Members:"
        ],
        [
            "Francisco R. Sandil (ABC President)"
        ],
        [
            "Robert Alvin S. Palabrica (SK President)"
        ],
        [
            "List of chief executives"
        ],
        [
            "Mariano Bernardo - 'Cabeza' during Spanish Regime."
        ],
        [
            "Catalino Bernardo - 'Cabeza' during Spanish Regime"
        ],
        [
            "Cornelio Reyes - 'Cabeza' during Spanish Regime"
        ],
        [
            "Matias Salvador - First mayor after the town gained independence, 1946 from Balagtas, Bulacan"
        ],
        [
            "Manuel Guisano Santos Sr. - Former mayor of Balagtas, Bulacan"
        ],
        [
            "Atty.",
            "Jose Espina Bernardo"
        ],
        [
            "Mamerto Carpio Bernardo - Former mayor of Balagtas, Bulacan.",
            "'The Father of Pandi, Bulacan'"
        ],
        [
            "Atty.",
            "Ruben Roque"
        ],
        [
            "Dr. Valeriano Domingo D.M.D."
        ],
        [
            "Atty.",
            "Venustiano Sarenas Roxas Sr."
        ],
        [
            "Arturo Andres"
        ],
        [
            "Leonardo Cruz Andres"
        ],
        [
            "Anastacio Hilario - Appointed mayor"
        ],
        [
            "Oliver Marcelo Andres"
        ],
        [
            "Roberto Magsaysay Oca Jr."
        ],
        [
            "Enrico Agustin Roque"
        ],
        [
            "Celestino Trinidad Marquez"
        ],
        [
            "Tourism"
        ],
        [
            "Battle of Kakarong de Sili Wall Relief"
        ],
        [
            "Amana Waterpark facade"
        ],
        [
            "Real de Kakarong de Sili: The site of revolutionary battle during Spanish Regime.",
            "It is located in barangay of 'Kakarong' where a monumental shrine is erected called Inang Filipina Shrine - Mother Philippines Shrine."
        ],
        [
            "Rizal Park: The mini park is in poblacion area that serves as recreation park where some town programs are held.",
            "The park has big monument of the Philippine National Hero - Dr. Jose P. Rizal Jose P. Rizal.",
            "It is a close replica of Rizal Monument in Luneta.",
            "The mini park was built during the term of Atty.",
            "Jose Espina Bernardo, the 3rd mayor of the town."
        ],
        [
            "Pandi Mineral Spring Resort: The oldest amusement park located in the poblacion area, which as of 2012 is closed.",
            "It was named owing to the nature of soft water that comes from a water well that supplied the whole central area of the town - Mineral Spring, the water well primarily supplied the central poblacion area.",
            "It was famous during earlier times and neighboring towns come to get water for drinking purpose in Pandi.",
            "Mineral Spring was built during the term of the 3rd mayor of the new town, Atty.",
            "Jose Espina Bernardo, there was an area used for washing clothes by the town folks.",
            "The water well as of 2012 no longer supplies water in the area, owing to the depth of the well which must have reached its saturation level."
        ],
        [
            "Residence Private Pool: A private resort best for family bonding and different special occasions located at Sitio Sto.",
            "Rosario, barangay Bagong Barrio."
        ],
        [
            "Dr. Totoy Resort: A mini resort built in the backyard of the residence of Dr. Totoy - Dr. Valeriano Crisostomo D.M.D.",
            "residential lot.",
            "The mini resort is suitable for more private family vacationers and little groups.",
            "It is situated in barangay 'Bunsuran 1'."
        ],
        [
            "Manatal Fresh Water Resort: A mini resort situated in barangay 'Manatal'."
        ],
        [
            "Villa Manaoag Nature Resort and Retreat House: A retreat house situated in poblacion area of the town in Amparo Subdivision.",
            "It has a little chapel and Station of the Cross life size images."
        ],
        [
            "Villa Conception Wet and Wild Waves, Inc.: An amusement park situated in barangay of 'Masuso'."
        ],
        [
            "Amana Water Park Resort: An amusement park situated in barangay of 'Bagong Barrio'.",
            "It is almost a 10-hectare park with lodging facilities and food chain stores.",
            "It is the largest water wave park in the Philippines."
        ],
        [
            "Sitio Antonio: A new amusement resort with large visual attractions and Giant Slides with amenities perfectly fit for Team Building activities.",
            "Also situated in Barangay Bagong Barrio and was named after the family name \"Antonio\"- a business minded family whom resides also at Bagong Barrio."
        ],
        [
            "Society and culture"
        ],
        [
            "Sports and senior center"
        ],
        [
            "The town of Pandi in the central poblacion area along Manuel G. Santos Sr. Street has a sports complex ground - Pandi Sports Complex.",
            "The site is a semi playground for children and equipped with some facilities for sports.",
            "It has a Basketball Court.",
            "The sports complex houses a center for senior town folks where they do senior activities and meetings, election of yearly officials as well.",
            "And the various members that also assist in some outreach domestic programs in the town - Senior Citizen Center.",
            "Within the compound is a water well that supplies the poblacion area of water until the northmost area of the town managed by NAWASA: National Water and Sewerage Authority - Water supply and sanitation in the Philippines."
        ],
        [
            "Pandi Sports Complex aka Leonardo Andres Sports Complex"
        ],
        [
            "Senior Citizen Center"
        ],
        [
            "Office of Senior Citizen, located at \"Masagana\" was the first Senior Citizen office built not in town proper.",
            "It serves as the center of Senior citizen for the residence of Masagana."
        ],
        [
            "Saint Igmedius Sports Complex, newly built covered court located also at \"Masagana\" near at the Saint Igmedius Chapel.",
            "First of it owns (in Pandi) as this complex was equipped with proper sports equipment and also the Courts measurements was based on the standard sized and measure of a basketball/volleyball court.",
            "This was also the center for every celebration and any festivities of the Barangay.",
            "The elegant Chapel and fully equipped Sports Complex was built and sponsored by an influential family living in the Barangay."
        ],
        [
            "Town festivities"
        ],
        [
            "The town celebrates every year before Christmas vacation Lantern Parade that goes around the poblacion area.",
            "It is sponsored by Mamerto C. Bernardo Memorial Central Public School wherein all students of the elementary school have their lantern designs.",
            "There is a lantern design competition and awarding of prizes to the students."
        ],
        [
            "The Town Fiesta of Pandi is celebrated every first week of December for its town patroness - 'Our Lady of Immaculate Conception'.",
            "The town feast day is called Fiesta ng Pandi.",
            "The town celebrates it with band of musicians for 2 days usually Saturday and Sunday.",
            "The band goes around the central poblacion area.",
            "Along the streets are hanging 'Banderitas' - little multicolored flags lined in long ropes, a cultural heritage influenced by Spanish culture - Spain that colonized the country during the 15th century.",
            "During earlier periods the occasion was very festive with visitors of various families from different towns and regions.",
            "It is celebrated like a thanksgiving day of the town."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation facilities"
        ],
        [
            "Pandi town proper is serviced by for hire tricycle - motorcycle with side car, that can go as far as Baliuag, Bulacan in a short cut route through barangay road, as well as the route going to Santa Maria, Bulacan and Bocaue, Bulacan.",
            "Some regular options are the official jeepney schedule of Santa Maria, Bulacan route to Angat, Bulacan which passes by Pandi since the town is centrally situated in between this two towns.",
            "There is a jeepney route from Pandi to Balagtas, Bulacan where there are several commercial buses that passes by Bocaue, Bulacan exiting in baranggay 'Taal' to the Super Highway - formerly named North Diversion, North Luzon Expressway facilitating a short travel to Manila and other Metro Manila areas.",
            "There are several commercial buses as well in central poblacion of Santa Maria, Bulacan passing through the Super Highway."
        ],
        [
            "Medical facilities and hospital"
        ],
        [
            "Pandi being the youngest town and smallest town do not have a government public hospital but mini Health Center that provides outreach medical services and midwifery services.",
            "As of 2012 a government hospital is being constructed in baranggay 'Bunsuran'."
        ],
        [
            "There are several private practitioners of family health care in the town and some barrios.",
            "For more extensive health care programs the town folks are accommodated in the Capital City of Malolos where Bulacan Medical Center formerly Provincial Hospital located."
        ],
        [
            "Education"
        ],
        [
            "Public schools"
        ],
        [
            "Mamerto C. Bernardo Memorial Central School - A public school in the town proper named after Mamerto Carpio Bernardo.",
            "The school has satellite branches in all barrios of the town providing elementary education in the whole town of Pandi.",
            "The main central school is situated in the town proper providing education to the masses in the poblacion central area.",
            "The school is situated along Jose E. Bernardo Street, a major street named after another mayor Atty.",
            "Jose Espina Bernardo.",
            "Atty.",
            "Jose Espina Bernardo is a cousin to Mamerto Carpio Bernardo.",
            "He built the roads of the new town and central water supply.",
            "It was during his term that the new town reached its height of community development.",
            "He also built the 'Rizal Plaza' as a tribute to the Philippine National Hero Dr. José Rizal.",
            "Ponciano Bernardo past mayor of Quezon City is their cousin.",
            "Ponciano A. Bernardo's father migrated to Nueva Ecija with his cousin Francisco Bernardo Oliveros, whose sisters and cousins were left behind in Pandi, Bulacan."
        ],
        [
            "Virginia Ramirez Cruz Memorial School (Siling Bata National High School) - A secondary branch of Mamerto Carpio Bernardo Memorial School in barrio 'Siling Bata' providing secondary education (Bureau of Secondary Education) in different barrios and barangays adjacent to 'Siling Bata'.",
            "The school was named Virginia R. Cruz Memorial School after Virginia Bernardo Ramirez-Cruz, who donated the land where the public high school was erected and established.",
            "She was a past president of Philippine Charity Sweepstakes Office (PCSO), Philippine Lottery Draw.",
            "Her mother is Valentina Bernardo of Pandi, Bulacan who married Ponciano Ramirez of Bocaue, Bulacan.",
            "Virginia was born in Bocaue, Bulacan.",
            "Her husband is past Congressman of Bulacan, Atty.",
            "Erasmo Ramirez Cruz.",
            "Atty.",
            "Matias Bernardo Ramirez is her brother, a past mayor of Bocaue, Bulacan."
        ],
        [
            "Bunsuran National High School - A public high school in barrio 'Bunsuran' 1st providing secondary education to nearby barangays.",
            "The whole town has three public high schools (that includes Masagana High School) and public elementary schools in every barangay - barrio of the municipality."
        ],
        [
            "Masagana National High School - A public secondary school in barrio 'Masagana' (High School Annex of Bunsuran National High School)."
        ],
        [
            "College of Mary Immaculate"
        ],
        [
            "Holy Angels' College of Bulacan Inc. (formerly Holy Angels' Academy) - Founded in 1951."
        ],
        [
            "Immaculate Conception Child Development Center Inc. - ICCDC and College of Mary Immaculate.",
            "Founded in 1981."
        ],
        [
            "Manuel Guisano Santos Sr. Memorial School.",
            "Founded in 1990."
        ],
        [
            "Gentle Shepherd Montessori.",
            "Founded in 1999."
        ],
        [
            "Christian Academy of Pandi"
        ],
        [
            "Montessori Academy of Malibu"
        ],
        [
            "Colleges"
        ],
        [
            "College of Mary Immaculate"
        ],
        [
            "Knox Internationale Technological Institute Inc."
        ],
        [
            "Bulacan Polytechnic College - Pandi Campus"
        ],
        [
            "Pandi Technological Institute"
        ],
        [
            "Gallery"
        ],
        [
            "Nanay Drug and Alcohol Rehabilitation Center"
        ],
        [
            "Mamerto C. Bernardo Memorial School Clock Tower"
        ],
        [
            "Manatal Coop Empowerment Center"
        ],
        [
            "Bulacan Polytechnic College - Pandi Campus"
        ],
        [
            "Notes"
        ],
        [
            "^  Municipality of Pandi |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Halili 2004, p. 145."
        ],
        [
            "^ Halili 2004, p. 145-146."
        ],
        [
            "^"
        ],
        [
            "\"Pandi: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 12 May 2020."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bulacan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "References"
        ],
        [
            "Halili, Maria Christine N. (2004).",
            "Philippine History.",
            "Manila: Rex Book Store.",
            "ISBN 978-971-23-3934-9."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Pandi, Bulacan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "All About Pandi Bulacan"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Pandi, Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Angat"
        ],
        [
            "Plaridel"
        ],
        [
            "Pandi"
        ],
        [
            "Santa Maria"
        ],
        [
            "Balagtas"
        ],
        [
            "Santa Maria"
        ],
        [
            "vte Province of BulacanMalolos (capital)  San Jose del Monte (largest city)Municipalities"
        ],
        [
            "Angat"
        ],
        [
            "Balagtas"
        ],
        [
            "Bocaue"
        ],
        [
            "Bulakan"
        ],
        [
            "Bustos"
        ],
        [
            "Calumpit"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Guiguinto"
        ],
        [
            "Hagonoy"
        ],
        [
            "Marilao"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Pandi"
        ],
        [
            "Paombong"
        ],
        [
            "Plaridel"
        ],
        [
            "Pulilan"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Maria"
        ],
        [
            "Component cities"
        ],
        [
            "Baliwag"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pandi,_Bulacan&oldid=1227897582\""
        ],
        [
            "Categories: Municipalities of BulacanPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2011All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Tagalog IPAArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}