{
    "name": "Paombong",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Paombong"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°49′52″N 120°47′21″E﻿ / ﻿14.83111°N 120.78917°E﻿ / 14.83111; 120.78917"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bulacan, Philippines"
        ],
        [
            "Municipality in Central Luzon, PhilippinesPaombongMunicipalityMunicipality of PaombongSan Jose Fishport located at Sitio Wawa"
        ],
        [
            "FlagSealNickname: Vinegar Capital of the PhilippinesMotto: Abante Bagong Paombong Pantay Pantay na Karapatan sa Pag-asa sa KaunlaranMap of Bulacan with Paombong highlightedOpenStreetMapPaombongLocation within the PhilippinesCoordinates: 14°49′52″N 120°47′21″E﻿ / ﻿14.83111°N 120.78917°E﻿ / 14.83111; 120.78917CountryPhilippinesRegionCentral LuzonProvinceBulacanDistrict"
        ],
        [
            "1st districtFoundedNovember 28, 1650Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMaryanne P. Marcos • Vice MayorEmelita B. Yunson • RepresentativeDanilo A. Domingo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Alfredo B. Castro Jr.John Raymond A. MarcaidaPaulo Mari S. de JesusGian Carlo G. ValenciaJudith Z. BartolomeMarcelo D. Ong IIIPhilip L. EusebioMarcelino R. de Roxas"
        ],
        [
            " • Electorate37,730 voters (2022)Area • Revenue₱ 159.7 million (2020) • Assets₱ 334.8 million (2020) • Expenditure₱ 134.4 million (2020) • Liabilities₱ 134.6 million (2020)Utilities • ElectricityMeralcoTime zoneUTC+8 (PST)ZIP code3001PSGC031416000IDD : area code +63 (0)44Native languagesTagalog"
        ],
        [
            "Paombong ("
        ],
        [
            "Dubbed as the \"Vinegar Capital of the Philippines\", Paombong is famous for its vinegar extracted from the sap of sasa (nipa), thus the term \"Sukang Paombong\" (Paombong vinegar) became known in Luzon and other parts of the Philippines."
        ],
        [
            "Etymology"
        ],
        [
            "Legend has it that the name Paombong was taken from the long bamboo tube called bumbong or tukil which is used for collecting nipa sap.",
            "The practice of extracting nipa sap with bumbongs made the town known as the town with many bumbongs."
        ],
        [
            "The local people claimed that the Spaniards who first visited the place were so amused with the bumbong that, after learning its name from the natives, they named the town after the container, a name which later evolved to Paombong."
        ],
        [
            "History"
        ],
        [
            "Paombong was originally one of the visitas (barrio) of Malolos mentioned in Capitulo XXXVI of Conquistas de Las Islas libro segundo by Fray Gaspar San Agustin.",
            "In a meeting held in Tondo Convent, the Provincial Chapter created the Town of Malolos in June 1580 with Fray Matheo de Mendoza OSA as its first minister, together with Barrios of Mambog under the patronage of San Roque,Matimbo with Santa Cruz and Paombong with Saint James Apostle.",
            "In 1619 Augustinians already established Paombong Convent but the town was administered by the justice of friars from Malolos.",
            "Paombong is not wealthy as its neighbor towns of Malolos and Hagonoy at time and it did not sustain its township and it was degraded again as barrio and being a visita in 1638."
        ],
        [
            "In 1639 Paombong was turned over to the Town of Calumpit from its mother town Malolos and in 1649 it was returned again to Malolos but on November 28, 1650, it was finally given its own civil government establishing Paombong its full township with Don Agustin Mananghaya as its first Gobernadorcillo."
        ],
        [
            "In the middle of the 1750s, Paombong grew into a modest community from what was once a cogon land inhabited by a handful of Tagalogs.",
            "as its first gobernadorcillo."
        ],
        [
            "During the Revolution against Spain, Paombong's coastal area, more specifically, Barangays Masukol and Binakod, played a significant role in Philippine History being known encounter sites between Spanish soldiers and Katipuneros.",
            "Maloleño General Isidoro \"matanglawin\" Torres"
        ],
        [
            "It is from these encounters, in fact, that Barangays Binakod and Masukol earned their present names.",
            "In one encounter, Binakod was where the enemies where \"fenced in\" (binakuran) and it was in Masukol where they were eventually \"cornered\" (nasukol) and defeated."
        ],
        [
            "In 1898, the first civilian in the person of Don Victorio de Leon headed the Municipal Government until 1900.",
            "The seat of the local government was first established at the ground floor of the Paombong Church Convent then popularly called \"zaguan\".",
            "It was later transferred to the house of Numerino Lindayag located in Poblacion, then was transferred to the location of the present Rural Health Center I.",
            "Eventually it was moved to the place where it is presently located which since has been the seat of the Municipal Government since then.",
            "In 1941, the head of the Municipal Government was later on called Municipal Mayor."
        ],
        [
            "Geography"
        ],
        [
            "Paombong is situated south-west of the province of Bulacan, with a total land area of 46.34 square kilometers.",
            "It is bounded by the municipality of Calumpit on the north, Malolos City on the east, municipality of Hagonoy on the west and Manila Bay on the south.",
            "The municipality is approximately 47 kilometers from Metro Manila, it is a by-pass town and can be accessed via North Luzon Expressway and MacArthur Highway."
        ],
        [
            "Barangays"
        ],
        [
            "Paombong is politically subdivided into 14 barangays (6 urban, 8 rural).",
            "These barangays are headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "All are elected every three years.",
            "Each barangay consist of 7 puroks and some have sitios."
        ],
        [
            "Binakod - This barangay is known for producing rock salt."
        ],
        [
            "Kapitangan - This barangay is a famous pilgrimage site during the Holy Week, particularly Good Friday.",
            "Some devout Catholic worshippers flagellate and/or allow themselves to be crucified to repent and share in the sufferings of Jesus Christ."
        ],
        [
            "Malumot"
        ],
        [
            "Masukol"
        ],
        [
            "Pinalagdan"
        ],
        [
            "Poblacion"
        ],
        [
            "San Isidro I"
        ],
        [
            "San Isidro II"
        ],
        [
            "San Jose - cradle the largest \"sasahan\" in town, subdivided into 7 political sitio or \"purok\" (Sitio Uno, Gitna, Sitio Tres, Sitio Wawa, Sitio Pantay, Sito Gunao and Sitio Kulis ).",
            "It is also a political hot spot every election for National and Local Positions.",
            "The San Jose Fishport located at Sitio Wawa cradles the motor boats or \"bangka\" which serves as the major transportation going to the three barangays near Manila Bay, namely, Santa Cruz, Masukol and Binakod."
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Cruz - There are 2 main resources of this barangay, fishponds and \"asinan\" or salt making.",
            "In this coastal barangay you can see some salt evaporation ponds."
        ],
        [
            "Santo Niño - Formerly known as \"Tulay na Bato\" because it is the only place then that has a concrete bridge.",
            "This is the frontier barangay of Paombong."
        ],
        [
            "Santo Rosario"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Paombong, Bulacan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "7(0.3)"
        ],
        [
            "7(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "21(0.8)"
        ],
        [
            "101(4.0)"
        ],
        [
            "152(6.0)"
        ],
        [
            "188(7.4)"
        ],
        [
            "170(6.7)"
        ],
        [
            "159(6.3)"
        ],
        [
            "115(4.5)"
        ],
        [
            "47(1.9)"
        ],
        [
            "29(1.1)"
        ],
        [
            "1,005(39.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "3.5"
        ],
        [
            "11.1"
        ],
        [
            "8.1"
        ],
        [
            "18.9"
        ],
        [
            "23.5"
        ],
        [
            "26.4"
        ],
        [
            "25.5"
        ],
        [
            "24.5"
        ],
        [
            "19.6"
        ],
        [
            "10.4"
        ],
        [
            "6.4"
        ],
        [
            "181.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PaombongYearPop.±% p.a.1903 8,554—    1918 9,260+0.53%1939 11,269+0.94%1948 13,437+1.97%1960 16,677+1.82%1970 20,636+2.15%1975 24,383+3.40%1980 26,267+1.50%1990 32,052+2.01%1995 33,149+0.63%2000 41,077+4.70%2007 50,798+2.97%2010 50,940+0.10%2015 53,294+0.86%2020 55,696+0.87%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Paombong, Bulacan, was 55,696 people, with a density of 1,200 inhabitants per square kilometre or 3,100 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Paombong"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  7.60"
        ],
        [
            "2009  7.09"
        ],
        [
            "2012  10.43"
        ],
        [
            "2015  8.30"
        ],
        [
            "2018  5.18"
        ],
        [
            "2021  12.59"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Public market"
        ],
        [
            "Major Industries"
        ],
        [
            "Aquaculture                 (Culturing of Milk Fish, Tilapia, Shrimps, Oysters, King Crab & others)"
        ],
        [
            "Ornamental Plants/Flowers   (Used for gardening and landscaping)"
        ],
        [
            "Grass Planting              (Carabao Grass, Bermuda Grass, Blue Grass etc.",
            "- Used for Gardening & Landscaping)"
        ],
        [
            "Garments"
        ],
        [
            "Food Processing             (Smoked Fish and other food products)"
        ],
        [
            "Major Products"
        ],
        [
            "Condiments                  (Vinegar, Fish Sauce, Salts, et al.)"
        ],
        [
            "Nipa                        (Weaving of Nipa Palm Leaves)"
        ],
        [
            "Agricultural Products       (Rice, Poultry, Livestocks, Fisheries, Fruits and Vegetables)"
        ],
        [
            "Tourism"
        ],
        [
            "St. James the Apostle Parish Church: The town church of Paombong originally built as visita of Malolos in 1580, established as parish in 1639 made of light materials.",
            "It suffered a massive fire causing it to lost its ancient architecture.",
            "It was reconstructed in the 1970s and reconstructed again in 2003,"
        ],
        [
            "Ciudad Clementino, the prime resort of the small town was the venue of Sa Sandaling Kailangan Mo Ako miniseries."
        ],
        [
            "Kapitangan Good Friday Crucifixion: International media focuses every Good Friday on the Crucifixion at Barangay Kapitangan.",
            "It is known as a pilgrimage area,  spiritual healers' haven and venue of a reenactment of the Passion of Christ is held by local devotees and penitents."
        ],
        [
            "Transportation"
        ],
        [
            "Public land transport in Paombong is served by provincial buses, Jeepneys, for-hire Tricycles, Pedicabs, and UV Express AUVs.",
            "Maritime transport is served by motorboats.",
            "Both First North Luzon Transit and Baliwag Transit buses passes thru the municipality."
        ],
        [
            "Healthcare"
        ],
        [
            "San Pascual Baylon Hospital"
        ],
        [
            "There is one hospital operating in Paombong and a main rural health care center unit.",
            "The San Pascual Baylon Maternity Hospital, situated at Barangay Santo Niño that offers secondary healthcare services.",
            "And the main rural health care center is one of the district rural health center owned and controlled by the Provincial Government of Bulacan.",
            "It offers primary healthcare services which also includes laboratory and dental and maternity services."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Town hall"
        ],
        [
            "Just as the national government, the municipal government is divided into three branches: executive, legislative and judiciary.",
            "The judicial branch is administered solely by the Supreme Court of the Philippines.",
            "The LGUs have control of the executive and legislative branch."
        ],
        [
            "The executive branch is composed of the mayor and the barangay captain for the barangays.",
            "The legislative branch is composed of the Sangguniang Bayan (town assembly), Sangguniang Barangay (barangay council), and the Sangguniang Kabataan for the youth sector."
        ],
        [
            "The seat of Government is vested upon the Mayor and other elected officers who hold office at the Town hall.",
            "The Sanguniang Bayan is the center of legislation."
        ],
        [
            "Elected officials"
        ],
        [
            "The following officials were elected on May 9, 2022, to serve a three-year term."
        ],
        [
            "Mayor: Maryanne \"Ann\" P. Marcos (PDP-Laban)"
        ],
        [
            "Vice Mayor: Emelita B. Yunson (Independent)"
        ],
        [
            "Councilors"
        ],
        [
            "Alfredo \"JC\" B. Castro Jr. (Independent)"
        ],
        [
            "John Raymond A. Marcaida (NUP)"
        ],
        [
            "Paulo Mari \"Pao\" S. de Jesus (Independent)"
        ],
        [
            "Gian Carlo G. Valencia (PDP-Laban)"
        ],
        [
            "Judith Z. Bartolome (PDP-Laban)"
        ],
        [
            "Marcelo \"Marcy\" D. Ong III (PDP-Laban)"
        ],
        [
            "Philip L. Eusebio (PDP-Laban)"
        ],
        [
            "Marcelino \"Marcing\" R. de Roxas (NUP)"
        ],
        [
            "Education"
        ],
        [
            "Private schools"
        ],
        [
            "Binuya's Kiddie School"
        ],
        [
            "St. Martin de Porres Catholic School"
        ],
        [
            "Paombong High School, Inc."
        ],
        [
            "Holy Rosary School of Paombong"
        ],
        [
            "Public schools"
        ],
        [
            "Elementary Schools"
        ],
        [
            "Paombong Central School"
        ],
        [
            "Kapitangan Elementary School"
        ],
        [
            "Lantad Elementary School"
        ],
        [
            "Masukol Elementary School"
        ],
        [
            "Pinalagdan Elementary School"
        ],
        [
            "Pinagtulayan Elementary School"
        ],
        [
            "Pulo Elementary School"
        ],
        [
            "San Jose Elementary School"
        ],
        [
            "Sta.",
            "Cruz Elementary School"
        ],
        [
            "Santo Niño Elementary School"
        ],
        [
            "Santo Rosario Elementary School"
        ],
        [
            "Binakod Elementary School"
        ],
        [
            "High Schools"
        ],
        [
            "Kapitangan National High School"
        ],
        [
            "Pinalagdan High School"
        ],
        [
            "San Roque National High School"
        ],
        [
            "Sta.",
            "Cruz National High School"
        ],
        [
            "Gallery"
        ],
        [
            "St. James the Apostle Parish Church"
        ],
        [
            "Ciudad Clementino, main pool"
        ],
        [
            " Kapitangan Chapel"
        ],
        [
            "Mang Danny's Organic & Natural Farm, Sitio Sapang Camachile, Santo Rosario"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Paombong |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^  https://elevation.maplogs.com/poi/paombong_bulacan_philippines.373803.html.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Paombong Bulacan Suka Festival\".",
            "Central Luzon.",
            "Retrieved 2009-08-05."
        ],
        [
            "^ \"The Official Website of the Municipality of Paombong, Bulacan\".",
            "Archived from the original on 2012-04-25.",
            "Retrieved 2011-06-22."
        ],
        [
            "^ \"Isidro Torres, Philippines\".",
            "Archived from the original on 2010-12-22.",
            "Retrieved 2011-06-22."
        ],
        [
            "^ \"Isidoro Dayao Torres: Revolutionary Leader\".",
            "Pambansang Suriang Pangkasaysayan.",
            "Retrieved 2009-08-05."
        ],
        [
            "^ \"Flagellants and Lenten Rites\".",
            "Experience Bulacan.",
            "Province of Bulacan.",
            "Retrieved 2009-08-05."
        ],
        [
            "^"
        ],
        [
            "\"Paombong: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 12 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bulacan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ http://www.philstar.com/Article.aspx?articleId=162902"
        ],
        [
            "^ \"The Official Website of the Municipality of Paombong, Bulacan\".",
            "Archived from the original on 2012-12-21.",
            "Retrieved 2012-10-20."
        ],
        [
            "^ Local Government Code of the Philippines, Book III Archived 2009-03-26 at the Wayback Machine, Department of the Interior and Local Government official website"
        ],
        [
            "^ \"Paombong - Certified List of Elected Candidates\".",
            "Commission on Elections.",
            "Retrieved 2009-08-16."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Paombong."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Paombong"
        ],
        [
            "Calumpit"
        ],
        [
            "Hagonoy"
        ],
        [
            "Paombong"
        ],
        [
            "Malolos"
        ],
        [
            "Manila Bay"
        ],
        [
            "vte Province of BulacanMalolos (capital)  San Jose del Monte (largest city)Municipalities"
        ],
        [
            "Angat"
        ],
        [
            "Balagtas"
        ],
        [
            "Bocaue"
        ],
        [
            "Bulakan"
        ],
        [
            "Bustos"
        ],
        [
            "Calumpit"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Guiguinto"
        ],
        [
            "Hagonoy"
        ],
        [
            "Marilao"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Pandi"
        ],
        [
            "Paombong"
        ],
        [
            "Plaridel"
        ],
        [
            "Pulilan"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Maria"
        ],
        [
            "Component cities"
        ],
        [
            "Baliwag"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Paombong&oldid=1231819077\""
        ],
        [
            "Categories: Municipalities of BulacanPopulated places on Manila BayHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 errors: missing titleCS1 errors: bare URLCS1 maint: numeric names: authors listAll articles with dead external linksArticles with dead external links from February 2022Webarchive template wayback linksArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Tagalog IPAArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from February 2016Commons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersPages using the Kartographer extension"
        ]
    ]
}