{
    "name": "Paranas",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Paranas"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°46′24″N 125°01′20″E﻿ / ﻿11.7733°N 125.0222°E﻿ / 11.7733; 125.0222"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Samar, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Paranas\" – news · newspapers · books · scholar · JSTOR (May 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesParanas"
        ],
        [
            "WrightMunicipalityMunicipality of Paranas"
        ],
        [
            "FlagMap of Samar with Paranas highlightedOpenStreetMapParanasLocation within the PhilippinesCoordinates: 11°46′24″N 125°01′20″E﻿ / ﻿11.7733°N 125.0222°E﻿ / 11.7733; 125.0222CountryPhilippinesRegionEastern VisayasProvinceSamarDistrict"
        ],
        [
            "2nd districtBarangays44"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEunice Uy-Babalcon • Vice MayorYolanda T. Tan • RepresentativeReynolds Michael Tan • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Oscar B. Cadiz• Carlos B. Aban• Clarita M. Abawag• Paul Anthony C. Enguerra• Agaton D. Gabon• Ebel E. Obor• Felix A. Cerdeña• Cipriano B. ArazaDILG Masterlist of Officials"
        ],
        [
            " • Electorate23,205 voters (2022)Area • Revenue₱ 226.9 million (2020) • Assets₱ 529.6 million (2020) • Expenditure₱ 189.4 million (2020) • Liabilities₱ 96.55 million (2020)Service provider • ElectricitySamar 2 Electric Cooperative (SAMELCO 2)Time zoneUTC+8 (PST)ZIP code6716PSGC086022000IDD : area code +63 (0)55Native languagesWaray Tagalog"
        ],
        [
            "Paranas, officially the Municipality of Paranas (Waray: Bungto han Paranas; Tagalog: Bayan ng Paranas), is a 2nd class municipality in the province of Samar, Philippines.",
            "According to the 2020 census, it has a population of 32,374 people."
        ],
        [
            "It was formerly known as Wright named after American Governor-General Luke E. Wright."
        ],
        [
            "Many of the townsfolk work or attend school in nearby Catbalogan.",
            "Trade is also prevalent with Calbayog farther north."
        ],
        [
            "A part of Paranas is devoted to a nature reserve watershed designated as such by the Department of Environment and Natural Resources."
        ],
        [
            "History"
        ],
        [
            "A strip of sand bordering along the coast of the Maqueda Bay, nestling at the foot of a hill which shields it from floods and storms was inhibited by a few natives who engaged in fishing and farming.",
            "As time went on, the number of people increased.",
            "More and better houses were built and a village was farming.",
            "So it attracted many people to trade with the natives and to dwell in it."
        ],
        [
            "The trees along the line of sand were cut down and a street was laid.",
            "The increasing inhabitants built nipa houses on both side of the street.",
            "As the village expanded the people opened other streets toward the hill."
        ],
        [
            "Shortly after the occupation of the Spaniards in Catbalogan some of them went to Wright, the newly made village.",
            "When they reached the village, the tide was low and many of the natives were along the stony coast picking and gathering shellfish and crabs.",
            "The banca headed toward the place where the people settled.",
            "One of the Spanish Officials asked for the name of the place or the village in Spanish language.",
            "The ignorant native looked boastfully at the over tall stranger.",
            "Thinking that the Spaniard was asking for the name of slippery rock which the Spaniard was apparently looking at, the native answered “Palanas”, name of the rock.",
            "The Spaniard then pronounced the word “Paranas” instead of palanas and recorded it as the name of the village.",
            "They went ashore and organized the village government and appointed its officials under the banner of Spain."
        ],
        [
            "The Spanish sovereignty over the village had greatly inspired the natives.",
            "The doctrine of Christianity was introduced and the people willingly and readily accepted and believe it.",
            "Through the course of time, the village grew to the end and be one of the progressive towns along the shore of the Maqueda Bay.",
            "A Catholic church and a convent were erected and a thick high wall around the church site was constructed."
        ],
        [
            "When America succeeded in overthrowing Spain during the Spanish–American War, the Philippines was ceded to her.",
            "Paranas was at the height of her glory at that time.",
            "In 1890 during the Philippine–American War the Paranasnon were one of these who showed strong resistance against the American Forces.",
            "American troops headed by General Curry came sudden and subdue the Revolutionist here in Paranas.",
            "Most of the native fled to the mountain.",
            "The revolutionist fought hard and bravely.",
            "Many American people died here.",
            "In one of these encounters General Curry was lost I the midst of the forest where they were the old people of Paranas or Wright."
        ],
        [
            "General Curry had been in the wilderness for three days and the man who saved him was taken to the United States with him.",
            "Due to the hospitality and kindness of the people of Paranas one of General Curry's savior.",
            "General Curry recommended the changed of the name of the town Paranas to Wright in honor of the governor General of the Philippines at that time.",
            "Because of its location the town of Wright engage in two main industries:"
        ],
        [
            "1.",
            "Farming"
        ],
        [
            "2.",
            "Fishing"
        ],
        [
            "They engage in farming because on the eastern part of the areas to town are wide vast of land on the western part in a fertile ground for fishing.",
            "The wide of land are converted into rice fields both for upland and lowland rice.",
            "One unique kind of rice that is so anosmatic and palatable to the town to town to eat is the famous “Kalinayan” an upload rice that is favorable to most of the town folks.",
            "Aside from rice, fruits, vegetables; root cops are so cheap and abundant that people of Wright used to sell to other places.",
            "The biggest and surest market of these products are the capital town of Catbalogan and Bagacay, the set of the copper mine is Samar"
        ],
        [
            "From the Maqueda bay, fish fresh of different kinds are so plentiful that people who engaged in fishing earned enough for the family support.",
            "Aside from the fish sea shells can also be gathered from there.",
            "The famous bahong, sabuad, baliad, ponao, saringa, bocawil, and others so plentiful and more than enough for the town's consumption."
        ],
        [
            "The people of Wright are lovers of socials and they love dance the Curracha.",
            "The Summer time Club is a town organization composed of both the married and single group that usually hold its annual affair very beginning of the summer vacation."
        ],
        [
            "During the American period, Paranas was renamed by the new administrators to Wright, in honour of General Wright.",
            "However, locals retained and still use the name Paranas.",
            "It absorbed the former town of San Sebastian.",
            "In 1950, the barrios of San Sebastian, Jitaasan, Dolores, Camanjagay, Bontod, Campidasa, Campiyak, Maslog, Balogo, Maropangpang, Binongtoan, and Bolwan was re-created as a town."
        ],
        [
            "In 1955 the sitio of Madalanot was converted into a barrio."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Paranas is politically subdivided into 44 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Anagasi"
        ],
        [
            "Apolonia"
        ],
        [
            "Bagsa"
        ],
        [
            "Balbagan"
        ],
        [
            "Bato"
        ],
        [
            "Buray (Binogho)"
        ],
        [
            "Cantaguic"
        ],
        [
            "Cantao-an"
        ],
        [
            "Cantato (Canturab)"
        ],
        [
            "Casandig I"
        ],
        [
            "Concepcion"
        ],
        [
            "Jose Roño"
        ],
        [
            "Cawayan"
        ],
        [
            "Lawaan I"
        ],
        [
            "Lipata"
        ],
        [
            "Lokilokon"
        ],
        [
            "Mangcal"
        ],
        [
            "Maylobe"
        ],
        [
            "Minarog"
        ],
        [
            "Nawi"
        ],
        [
            "Pabanog"
        ],
        [
            "Paco"
        ],
        [
            "Pagsa-ogan"
        ],
        [
            "Pagsanjan (Pagsan-an)"
        ],
        [
            "Patag"
        ],
        [
            "Pequit"
        ],
        [
            "Poblacion 1"
        ],
        [
            "Poblacion 2"
        ],
        [
            "Poblacion 3"
        ],
        [
            "Poblacion 4"
        ],
        [
            "Poblacion 5"
        ],
        [
            "Poblacion 6"
        ],
        [
            "Salay"
        ],
        [
            "San Isidro"
        ],
        [
            "Santo Niño"
        ],
        [
            "Sulopan"
        ],
        [
            "Tabucan"
        ],
        [
            "Tapul"
        ],
        [
            "Tenani"
        ],
        [
            "Tigbawon"
        ],
        [
            "Tula"
        ],
        [
            "Tutubigan"
        ],
        [
            "Casandig II"
        ],
        [
            "Lawaan II"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Paranas, Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "114(4.5)"
        ],
        [
            "81(3.2)"
        ],
        [
            "94(3.7)"
        ],
        [
            "81(3.2)"
        ],
        [
            "119(4.7)"
        ],
        [
            "192(7.6)"
        ],
        [
            "186(7.3)"
        ],
        [
            "158(6.2)"
        ],
        [
            "167(6.6)"
        ],
        [
            "185(7.3)"
        ],
        [
            "202(8.0)"
        ],
        [
            "176(6.9)"
        ],
        [
            "1,755(69.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.6"
        ],
        [
            "14.7"
        ],
        [
            "16.8"
        ],
        [
            "17.8"
        ],
        [
            "22.3"
        ],
        [
            "25.9"
        ],
        [
            "27.5"
        ],
        [
            "26.2"
        ],
        [
            "26.6"
        ],
        [
            "27.0"
        ],
        [
            "24.6"
        ],
        [
            "22.3"
        ],
        [
            "270.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Bruna Fabrigar"
        ],
        [
            "Bruna Fabrigar - (locally known as Bunang) is a local hero in Paranas, Samar and one of the brave and courageous leaders of the famous Pulajanes Movement during the Philippine–American War."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of ParanasYearPop.±% p.a.1918 12,847—    1939 17,716+1.54%1948 16,717−0.64%1960 16,267−0.23%1970 17,352+0.65%1975 19,386+2.25%1980 21,556+2.14%1990 22,702+0.52%1995 24,235+1.23%2000 27,926+3.09%2007 27,820−0.05%2010 29,327+1.94%2015 30,557+0.79%2020 32,374+1.14%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Paranas"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  38.30"
        ],
        [
            "2009  42.53"
        ],
        [
            "2012  31.78"
        ],
        [
            "2015  39.20"
        ],
        [
            "2018  26.44"
        ],
        [
            "2021  26.53"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "List of former chief executives"
        ],
        [
            "Paciano Babarano—1880 - 1882"
        ],
        [
            "Marcelo Gabon ----- 1883 - 1885"
        ],
        [
            "Galo Baclayon ----- 1885 - 1888"
        ],
        [
            "Nepomoceno Pacoli - 1889 - 1892"
        ],
        [
            "Francisco Dabuet—1893 - 1896"
        ],
        [
            "Pablo Sison ------- 1897"
        ],
        [
            "Sixto Pacoli ------ 1898 - 1900"
        ],
        [
            "Simon Davantes ---- 1901 - 1902"
        ],
        [
            "Victorino Tuazon ---1902 - 1903"
        ],
        [
            "Francisco Pacoli—1904 - 1906"
        ],
        [
            "Cipriano Ponferado - 1906 - 1909"
        ],
        [
            "Charles Shauger --- 1909 - 1912"
        ],
        [
            "Simon Davantes ---- 1912 - 1915"
        ],
        [
            "Pedro Dabuet ------"
        ],
        [
            "Cecilio Sison ----- 1915 - 1918"
        ],
        [
            "Angel Rosales ---- 1919 - 1922"
        ],
        [
            "Alejandro Sison --- 1925 - 1992"
        ],
        [
            "Graciano Babali --- 1931 - 1934"
        ],
        [
            "Isidro Tizon ------ 1934 - 1939"
        ],
        [
            "Hilario Abalos ---- 1939 - Japanese occupation"
        ],
        [
            "Cecilio Sison ----- 1946 - 1947"
        ],
        [
            "Jose Tanseco ------ 1948 - 1948"
        ],
        [
            "Culture"
        ],
        [
            "Local beliefs"
        ],
        [
            "Townspeople living off the coast of Paranas believe turtles that come to die ashore are omens of danger, harbingers of typhoons and ocean-related accidents.",
            "The old fisherfolk dare not touch nor disturb these docile creatures because of this superstition.",
            "Green sea turtles and Loggerhead turtles frequent some coves off Samar to lay eggs or wade near the shallow areas to explore.",
            "Gigantic Loggerhead turtles are especially rare visitors even in the yesteryears.",
            "When they come ashore and do not lay eggs, tears flow from their eyes like humans.",
            "They would then die as the blazing sun rises and their bodies are scorched.",
            "Afterwards, fishermen go missing at sea, typhoons arrive, bancas capsize or cargo ships sink.",
            "Residents attest turtles came to die on their shores when M/V Dona Paz sank causing thousands of people to drown to their deaths."
        ],
        [
            "Transportation"
        ],
        [
            "The Pan-Philippine Highway traverses Paranas."
        ],
        [
            "Domestic air travelers prefer to return to Paranas via dominant Tacloban's Daniel Z. Romualdez Airport due to the length of the runway and the accessibility of land transportation.",
            "Other options include the improved Calbayog Airport and the less utilized Catbalogan Airport (which is only ideal for smaller aircraft).",
            "International air travelers may also reach Paranas via Manila, Cebu or Davao en route to Tacloban.",
            "In the next few months, Tacloban's airport is being readied for direct international flights."
        ],
        [
            "Notable personalities"
        ],
        [
            "Paciano Babarano (1880-1882) - the first mayor of the town of Paranas."
        ],
        [
            "Mr. John Miller (1882-1900) - the first American Teacher in Paranas"
        ],
        [
            "Mr. Charles Shougger - the first President in the Poblacion of Paranas during the American time.",
            "He built the Gabaldon Building in Wright South Elementary School and he is also considered the first American teacher in Paranas."
        ],
        [
            "Mauricio Gabon - the first Filipino teacher during the American time in the town.- He reaches up to Grade Three and assigned as the first male teacher in town in the year 1902."
        ],
        [
            "First female teachers who taught in the town and have an educational attainment of grade four."
        ],
        [
            "Judge Angel Rosales - was the first Corporador (Judge) in the town.",
            "He built the public market in the town."
        ],
        [
            "Dr. Norberto Betong Rosales -  the first rural doctor assigned in the town."
        ],
        [
            "Mayor Cecilio Sison - He built the famous Rizal monument of the town."
        ],
        [
            "Mayor Fortunato Gabon - He make his own street which called through his name the Gabon Boulevard."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Paranas |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An act re-creating the municipality of San Sebastian, province of Samar\".",
            "LawPH.com.",
            "Retrieved 2011-04-09."
        ],
        [
            "^ \"An Act Creating the Barrio of Madalanot, in the Municipality of Wright, Province of Samar\".",
            "LawPH.com.",
            "Retrieved 2011-04-11."
        ],
        [
            "^"
        ],
        [
            "\"Paranas: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 February 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Samar (Western Samar)\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Paranas, Samar."
        ],
        [
            "Paranas Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Paranas"
        ],
        [
            "San Jose de Buan"
        ],
        [
            "Maslog, Eastern Samar"
        ],
        [
            "Motiong"
        ],
        [
            "Paranas"
        ],
        [
            "Can-avid, Eastern Samar"
        ],
        [
            "San Sebastian"
        ],
        [
            "Hinabangan"
        ],
        [
            "Taft, Eastern Samar"
        ],
        [
            "vte Province of SamarCatbalogan (capital)  Calbayog (largest city)Municipalities"
        ],
        [
            "Almagro"
        ],
        [
            "Basey"
        ],
        [
            "Calbiga"
        ],
        [
            "Daram"
        ],
        [
            "Gandara"
        ],
        [
            "Hinabangan"
        ],
        [
            "Jiabong"
        ],
        [
            "Marabut"
        ],
        [
            "Matuguinao"
        ],
        [
            "Motiong"
        ],
        [
            "Pagsanghan"
        ],
        [
            "Paranas"
        ],
        [
            "Pinabacdao"
        ],
        [
            "San Jorge"
        ],
        [
            "San Jose de Buan"
        ],
        [
            "San Sebastian"
        ],
        [
            "Santa Margarita"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Tagapul-an"
        ],
        [
            "Talalora"
        ],
        [
            "Tarangnan"
        ],
        [
            "Villareal"
        ],
        [
            "Zumarraga"
        ],
        [
            "Component cities"
        ],
        [
            "Calbayog"
        ],
        [
            "Catbalogan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Paranas&oldid=1170281992\""
        ],
        [
            "Category: Municipalities of Samar (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from May 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}