{
    "name": "Paracelis",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Paracelis"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°10′52″N 121°24′13″E﻿ / ﻿17.1811°N 121.4036°E﻿ / 17.1811; 121.4036"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Mountain Province, Philippines"
        ],
        [
            "Municipality in Cordillera Administrative Region, PhilippinesParacelisMunicipalityMunicipality of Paracelis"
        ],
        [
            "FlagMap of Mountain Province with Paracelis highlightedOpenStreetMapParacelisLocation within the PhilippinesCoordinates: 17°10′52″N 121°24′13″E﻿ / ﻿17.1811°N 121.4036°E﻿ / 17.1811; 121.4036CountryPhilippinesRegionCordillera Administrative RegionProvinceMountain ProvinceDistrict"
        ],
        [
            "Lone districtFounded1962Barangays9"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMarcos G. Ayangwa • Vice MayorLister M. Carlos • RepresentativeMaximo Y. Dalog Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ruben T. VicenteLito B. BasungitMarcelo T. AmbataliVictorino S. BannaueJohn B. BanggolayAteneo B. GusimatGaston G. TodcoMarciano O. Lappao Jr."
        ],
        [
            " • Electorate18,887 voters (2022)Area • Revenue₱ 199.8 million (2020) • Assets₱ 263.8 million (2020) • Expenditure₱ 206.4 million (2020) • Liabilities₱ 68.73 million (2020)Service provider • ElectricityMountain Province Electric Cooperative (MOPRECO)Time zoneUTC+8 (PST)ZIP code2625PSGC144406000IDD : area code +63 (0)74Native languagesGa'dang Balangao Bontoc Ilocano TagalogWebsitewww.paracelis.gov.ph"
        ],
        [
            "Paracelis, officially the Municipality of Paracelis  is a 2nd class municipality in the province of Mountain Province, Philippines.",
            "According to the 2020 census, it has a population of 31,168 people."
        ],
        [
            "Paracelis' population distribution is 37 percent urban and 63 percent rural.",
            "Urban settlement is on the west side of the town, a basin of low-level hilly-to-flat lands surrounded by mountains."
        ],
        [
            "Due to hilly terrain, Paracelis has numerous zigzag roads in most parts, including access roads that connect the municipality to other border towns.",
            "On both sides of its zigzag roads, travelers can view the vast cornfield plantations alongside."
        ],
        [
            "History"
        ],
        [
            "Paracelis was first settled by the Ga'dang (Gaddang) ethnic group, who were migrants from Cagayan Valley.",
            "Through the years, Paracelis has become the main entry point to the rest of Mountain Province."
        ],
        [
            "The name Paracelis came into existence as early as the 1900s as part of the territorial barangays of Natonin within the District of Kalao.",
            "Paracelis became a regular town named Paracales with the enactment of Republic Act 3488 under Republic Act 4738.",
            "The first appointed mayor was Benito Rafael."
        ],
        [
            "The first official site of the civil government was at Natta'longan, now currently within Barangay Bantay.",
            "The pre-World War II government was short-lived and administration lasted under three local managements from 1917 to 1921."
        ],
        [
            "In 1962, the government center at Natta'longan was transferred to Anangka within the Rafael compound.",
            "The site was again transferred to a lot in Marat donated by the Gawwan family.",
            "In 1991, the officials of the municipal government transferred the government center to its current site in Poblacion.",
            "The government used to occupy a one-hectare lot that housed all the units."
        ],
        [
            "On December 25, 2007, the town's mayor, Cesar Rafael, was killed in an ambush in sitio Sinigpit, Barangay Butigue."
        ],
        [
            "Paracelis is currently a melting pot of migrants from different areas, such as the Gaddang, Balangao, Majukayong, Kalinga, and Ifugao tribes, including Ilokanos.",
            "This migration has been instrumental on the fast rising urbanization of Paracelis in the last two decades.",
            "The town's current administration is introducing an urbanization plan for the municipality."
        ],
        [
            "Geography"
        ],
        [
            "Paracelis is a border town of Mountain Province where it shares borders with Kalinga, Isabela and Ifugao provinces.",
            "In the north, its borders with the city of Tabuk and the town of Tanudan.",
            "In the south, it is bordered by Alfonso Lista.",
            "In the north-east, it shares a border with Quezon, in the east with Mallig and Roxas in Isabela.",
            "In the west, it borders with Natonin."
        ],
        [
            "Paracelis is 97 kilometres (60 mi) from Bontoc, 31 kilometres (19 mi) from Tabuk City, and 489 kilometres (304 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Paracelis is politically subdivided into 9 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Anonat"
        ],
        [
            "Bacarni"
        ],
        [
            "Bananao"
        ],
        [
            "Bantay"
        ],
        [
            "Bunot"
        ],
        [
            "Buringal"
        ],
        [
            "Butigue"
        ],
        [
            "Palitod"
        ],
        [
            "Poblacion"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Paracelis, Mountain Province"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "25(77)"
        ],
        [
            "28(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "78(3.1)"
        ],
        [
            "60(2.4)"
        ],
        [
            "49(1.9)"
        ],
        [
            "51(2.0)"
        ],
        [
            "194(7.6)"
        ],
        [
            "197(7.8)"
        ],
        [
            "209(8.2)"
        ],
        [
            "226(8.9)"
        ],
        [
            "185(7.3)"
        ],
        [
            "180(7.1)"
        ],
        [
            "143(5.6)"
        ],
        [
            "183(7.2)"
        ],
        [
            "1,755(69.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "15.6"
        ],
        [
            "12.5"
        ],
        [
            "11.8"
        ],
        [
            "12.5"
        ],
        [
            "21.0"
        ],
        [
            "23.3"
        ],
        [
            "25.2"
        ],
        [
            "26.1"
        ],
        [
            "22.6"
        ],
        [
            "17.1"
        ],
        [
            "16.7"
        ],
        [
            "19.6"
        ],
        [
            "224"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of ParacelisYearPop.±% p.a.1970 5,666—    1975 7,679+6.29%1980 9,729+4.84%1990 13,027+2.96%YearPop.±% p.a.1995 15,882+3.78%2000 18,985+3.90%2007 24,705+3.70%2010 26,476+2.55%YearPop.±% p.a.2015 28,121+1.15%2020 31,168+2.04%Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "The town of Paracelis is home to three indigenous languages, the Balangaw language and the Ga'dang language (similar to the Ga'dang language used in Nueva Vizcaya, Isabela, and Aurora), and the Majukayong.",
            "Ilocano is the lingua franca of the municipality."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Paracelis"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  43.10"
        ],
        [
            "2009  46.72"
        ],
        [
            "2012  40.56"
        ],
        [
            "2015  30.55"
        ],
        [
            "2018  30.63"
        ],
        [
            "2021  9.30"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The municipality of Paracelis depends on agriculture as its main engine of growth with corn as the main product, and bananas coming second.",
            "Livestock farming is also a fast-rising business, and with the NGP and reforestation program of the DENR fruit tree growing is on the rise as is with vegetable growing.",
            "Trade activities include the commerce of basic consumer goods, handicrafts, food business, and others."
        ],
        [
            "The municipal government is planning to pursue real estate development and tourism as its next engines of growth."
        ],
        [
            "Its location at the crossroad makes Paracelis a future trading hub in the Eastern Cordillera Growth Corridor, a primary growth center of the Cordillera Administrative Region."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Paracelis, belonging to the lone congressional district of the province of Mountain Province, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council (2019–2022):"
        ],
        [
            "Congressman: Maximo Y. Dalog Jr."
        ],
        [
            "Mayor: Marcos G. Ayangwa"
        ],
        [
            "Vice-Mayor: Lister M. Carlos"
        ],
        [
            "Councilors:"
        ],
        [
            "Ruben T. Vicente"
        ],
        [
            "Lito B. Basungit"
        ],
        [
            "Marcelo T. Ambatali"
        ],
        [
            "Victorino S. Bannaue"
        ],
        [
            "John B. Banggolay"
        ],
        [
            "Ateneo B. Gusimat"
        ],
        [
            "Gaston G. Todco"
        ],
        [
            "Marciano O. Lappao Jr."
        ],
        [
            "Transportation"
        ],
        [
            "The only mode of transportation to and from Paracelis are buses and jeepneys plying to Santiago, Baguio, Tabuk, Alfonso Lista and Natonin.",
            "Going south, it takes approximately 1.5 hours to reach Alfonso Lista and 3 hours to Santiago from Paracelis.",
            "Going north, it takes approximately 2 hours to reach Tabuk .",
            "Going west to Natonin town proper, it takes less than an hour.",
            "Currently, there is no road access from the town proper going to Mallig in the east but there is road from its border Barangay Buringal to Mallig."
        ],
        [
            "As of 2017, there is concreting of the national highway from Butigue, Palitud, Anonat going to Roxas, Isabela"
        ],
        [
            "Education"
        ],
        [
            "Tertiary"
        ],
        [
            "Despite being mandated to host the College of Agriculture of the Mountain Province State Polytechnic College in the northern Barangay Bacarri, the campus is still unrealized due to funding difficulties from the national government.",
            "The Paracelis campus of the Mountain Province State Polytechnic College was made through the conversion of Bacarri Agricultural High School, a rural high school in Barangay Bacarri."
        ],
        [
            "Secondary education"
        ],
        [
            "8 out of 9 barangays in Paracelis have their respective secondary institution.",
            "Annex campuses of major high schools in different barangays were converted into a regular and independent high schools.",
            "The list of secondary schools are as follows:"
        ],
        [
            "Bacarri National Trade and Agricultural School - Barangay Bacarri"
        ],
        [
            "Paracelis Technical and Vocational High School - Sitio Labay, Barangay Bantay"
        ],
        [
            "Anonat National Agricultural and Vocation High School( Formerly Bacarri National Trade and Agricultural School- Anonat Annex) - Barangay Anonat"
        ],
        [
            "Buringal National High School - Barangay Buringal"
        ],
        [
            "Butigue National High School - Barangay Butigue"
        ],
        [
            "Palitod National High School - Barangay Palitod"
        ],
        [
            "San Rafael National High School - Sitio San Rafael, Barangay Bananao"
        ],
        [
            "Paracelis National High School - Barangay Poblacion"
        ],
        [
            "Bacarri National Trade and Agricultural School - Bunot Extension - Barangay Bunot"
        ],
        [
            "Health"
        ],
        [
            "A district hospital serves the people of Paracelis.",
            "Recently, the municipal mayor, Avelino C. Amangyen signed a memorandum of agreement at the Japanese Embassy in Manila with the Japan International Cooperation Agency (JICA) representatives for the construction of the rural health unit building."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Paracelis |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Philippine Laws, Statutes and Codes - Chan Robles Virtual Law Library\"."
        ],
        [
            "^ \"Philippine Laws, Statutes and Codes - Chan Robles Virtual Law Library\"."
        ],
        [
            "^ \"Police nab suspect in ambush-slay of Mt.",
            "Province mayor\".",
            "The Philippine Star.",
            "February 18, 2011.",
            "Retrieved April 15, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Paracelis: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 8 March 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Cordillera Administrative Region (CAR)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Mountain Province\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"Philippine Laws, Statutes and Codes\".",
            "Chan Robles Virtual Law Library."
        ],
        [
            "^ \"BIS Online Query\".",
            "Archived from the original on 2016-03-04.",
            "Retrieved 2012-01-04."
        ],
        [
            "^ \"R.A. No.",
            "9736\"."
        ],
        [
            "^ \"R.A. No.",
            "9787\"."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Paracelis."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Paracelis"
        ],
        [
            "Tanudan, Kalinga"
        ],
        [
            "Tabuk, Kalinga"
        ],
        [
            "Quezon, Isabela"
        ],
        [
            "Natonin"
        ],
        [
            "Paracelis"
        ],
        [
            "Mallig, IsabelaRoxas, Isabela"
        ],
        [
            "Alfonso Lista, Ifugao"
        ],
        [
            "vte Mountain ProvinceBontoc (capital)  Bauko (largest municipality)Municipalities"
        ],
        [
            "Barlig"
        ],
        [
            "Bauko"
        ],
        [
            "Besao"
        ],
        [
            "Bontoc"
        ],
        [
            "Natonin"
        ],
        [
            "Paracelis"
        ],
        [
            "Sabangan"
        ],
        [
            "Sadanga"
        ],
        [
            "Sagada"
        ],
        [
            "Tadian"
        ],
        [
            "BarangaysSee: List of barangays in Mountain Province"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Paracelis&oldid=1222821983\""
        ],
        [
            "Category: Municipalities of Mountain ProvinceHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataAll articles with vague or ambiguous timeVague or ambiguous time from December 2023Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}