{
    "name": "Pasacao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pasacao"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°30′37″N 123°02′31″E﻿ / ﻿13.5103°N 123.0419°E﻿ / 13.5103; 123.0419"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Camarines Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Pasacao\" – news · newspapers · books · scholar · JSTOR (January 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bicol Region, PhilippinesPasacaoMunicipalityMunicipality of PasacaoAerial shot of Pasacao with its port and oil depot"
        ],
        [
            "FlagSealNickname: Summer Capital of Camarines SurMotto: Matatag • TypeSangguniang Bayan • MayorJorge R. Bengua • Vice MayorMaryol O. Tayco • RepresentativeLuis Raymund F. Villafuerte Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Hercules S. BihagVirginia O. ObordoMelinda T. SambajonEdgardo B. TaycoJunard Joel M. de AldayRandolph Lee O. ReyesMariano R. Parco Jr.Carlo B. BañasJulio L. Remo"
        ],
        [
            " • Electorate31,618 voters (2022)Area • Total53,461 • Density360/km2 (930/sq mi) • Households11,971DemonymPasaqueño (Masculine)"
        ],
        [
            "Pasaqueña (Feminine)Economy • Income class3rd income class municipality • Poverty incidence41.62% (2015) • Revenue₱197,378,822.82 • Assets₱ 528.4 million (2020) • Expenditure₱ 137.2 million (2020) • Liabilities₱ 168.3 million (2020)Service provider • ElectricityCamarines Sur 1 Electric Cooperative  (CASURECO 1) • WaterPasacao Water District (PAWADI)Time zoneUTC+8 (PST)ZIP code4417PSGC051727000IDD : area code +63 (0)54Native languagesCentral Bikol TagalogMajor religionsRoman CatholicismFeast dateAugust 30Catholic dioceseDiocese of LibmananPatron saintSaint Rose of LimaWebsitepasacao.gov.ph"
        ],
        [
            "Pasacao, officially the Municipality of Pasacao (Central Bikol: Banwaan kan Pasacao; Tagalog: Bayan ng Pasacao), is a 1st class municipality in the province of Camarines Sur, Philippines.",
            "According to the 2020 census, it has a population of 53,461 people."
        ],
        [
            "It is famed for its stretch of brownish sand beaches, earning it the title \"Summer Capital of Camarines Sur\".",
            "The municipality's landmarks include the town's symbol, Daruanak Island, and the Port of Pasacao."
        ],
        [
            "During the Spanish colonization in the 16th century, Pasacao was one of the embarkation points in Camarines Sur and was the only sea transportation link to Manila.",
            "It played a vital role in the development of commerce and trade in the province."
        ],
        [
            "The town was formed in 1872, according to records from the Archdiocese of Cáceres."
        ],
        [
            "Etymology"
        ],
        [
            "The town's name is derived from the Spanish-Tagalog portmanteau Pasa-Ikaw (English: Pass it on).",
            "This is because dock guards stationed at the Pasacao Port would regularly issue directions to passengers by shouting \"Pasa ikaw, Pasa ikaw.\"",
            "Passengers mistook the phrase for the town's name, Pasacao."
        ],
        [
            "History"
        ],
        [
            "Spanish colonization"
        ],
        [
            "From 1585 to the 19th century, Pasacao served as a crucial defense port against Moro pirate incursions.",
            "The raid in Caranan on October 4, 1779, is an example.",
            "Pasacao and 9 other towns and two missions were entirely destroyed; ten churches were robbed and torched; 8,000 residents were captured or slain; one priest was killed, two were captured; and Caceres, the capital, was placed on high alert one night."
        ],
        [
            "To defend Pasacao against these raids, Alcalde Jacinto Rodriguez Morales contributed material for a balwark.",
            "He also gave watchmen rations.",
            "The fortification of Pasacao in 1848, which included Cabusao in Camarines Sur, Pantao (now Libon), and Donsol in Sorsogon, was motivated by these attacks."
        ],
        [
            "Between 1609 and 1616, during the governor generalship of Juan de Silva, two galleons, the Nuestra Seora de Guadalupe and Angel dela Guardia, were built in Barangay Dalupaon, as well as the Astillero de Dalupaon (English: Dalupaon Shipyard).",
            "Guadalupe was vital in the galleon commerce between Manila and Acapulco, as well as the defense of the Philippines against the Dutch at the Battle of Playa Honda."
        ],
        [
            "Japanese occupation"
        ],
        [
            "When World War II broke out on December 8, 1941, Juan Q. Miranda and Elias Madrid, both from Canaman and Leon Sa.",
            "Aureus from Libmanan founded the Tangcong Vaca Guerilla Unit"
        ],
        [
            "The Six Daughters of Charity landed on Pasacao's shore to establish Naga City's first regular girls' school, Universidad de Santa Isabel."
        ],
        [
            "Geography"
        ],
        [
            "Daruanak Island"
        ],
        [
            "Pasacao is situated on the northwest coast of the Camarines Sur.",
            "The town is bordered by Mount Bernacci that it shares a border with Libmanan in the northwest, San Fernando in the east, and Pamplona in the north.."
        ],
        [
            "The total land area of Pasacao is approximately 149.54 square kilometres (57.74 sq mi), with much of the terrain consisting of rolling hills and mountains.",
            "The town's topography is characterized by steep slopes, with elevations ranging from sea level to over 400 metres (1,300 ft) above sea level.",
            "The highest point in the town is Mount Bernacci, which stands at 756 metres (2,480 ft) above sea level."
        ],
        [
            "Pasacao is also home to several rivers and creeks, including the Itulan River and Tinalmud River, which flows into Ragay Gulf.",
            "Other rivers and creeks in the town include the Caranan River and Dalupaon River."
        ],
        [
            "Pasacao is also known for its rich natural resources, particularly its abundant fishery and marine life.",
            "The town has a sanctuary and a marine protected area, the Stampa Beach, which are home to a wide variety of marine species including fish, corals, and sea turtles."
        ],
        [
            "The town has a long coastline stretching for about 22 kilometres (14 mi), making it a popular destination for beach lovers.",
            "Pasacao's beaches are known for their fine brown sand and crystal-clear waters, and they offer a variety of water activities such as swimming, snorkeling, and fishing.",
            "The most popular beach in Pasacao is Balogo Beach, where the Daruanak Island is situated, which is a favorite spot for locals and tourists alike."
        ],
        [
            "In summary, Pasacao is a municipality characterized by a rugged terrain, a long coastline, and a tropical climate.",
            "Its natural features make it an attractive destination for tourists seeking outdoor adventures and relaxation by the beach."
        ],
        [
            "Barangays"
        ],
        [
            "Pasacao is politically subdivided into 19 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "  Poblacion"
        ],
        [
            "Barangays"
        ],
        [
            "Population (2020)"
        ],
        [
            "Feast Date"
        ],
        [
            "Political Zones"
        ],
        [
            "Antipolo"
        ],
        [
            "1.78%"
        ],
        [
            "953"
        ],
        [
            "May 24"
        ],
        [
            "6"
        ],
        [
            "Bagong Silang"
        ],
        [
            "1.03%"
        ],
        [
            "550"
        ],
        [
            "April 28"
        ],
        [
            "7"
        ],
        [
            "Bahay"
        ],
        [
            "3.56%"
        ],
        [
            "1,905"
        ],
        [
            "October 25"
        ],
        [
            "6"
        ],
        [
            "Balogo"
        ],
        [
            "10.82%"
        ],
        [
            "5,785"
        ],
        [
            "July 16"
        ],
        [
            "7"
        ],
        [
            "Caranan"
        ],
        [
            "19.57%"
        ],
        [
            "10,460"
        ],
        [
            "June 13"
        ],
        [
            "14"
        ],
        [
            "Cuco"
        ],
        [
            "3.75%"
        ],
        [
            "2,004"
        ],
        [
            "October 15"
        ],
        [
            "7"
        ],
        [
            "Dalupaon"
        ],
        [
            "7.44%"
        ],
        [
            "3,977"
        ],
        [
            "June 24"
        ],
        [
            "14"
        ],
        [
            "Hubo"
        ],
        [
            "1.46%"
        ],
        [
            "780"
        ],
        [
            "May 22"
        ],
        [
            "7"
        ],
        [
            "Itulan"
        ],
        [
            "2.29%"
        ],
        [
            "1,226"
        ],
        [
            "October 4"
        ],
        [
            "5"
        ],
        [
            "Macad"
        ],
        [
            "3.41%"
        ],
        [
            "1,823"
        ],
        [
            "February 11"
        ],
        [
            "7"
        ],
        [
            "Odicon"
        ],
        [
            "5.69%"
        ],
        [
            "3,043"
        ],
        [
            "May 16"
        ],
        [
            "7"
        ],
        [
            "Quitang"
        ],
        [
            "5.59%"
        ],
        [
            "2,991"
        ],
        [
            "July 25"
        ],
        [
            "7"
        ],
        [
            "Salvacion"
        ],
        [
            "1.86%"
        ],
        [
            "995"
        ],
        [
            "April 25"
        ],
        [
            "—"
        ],
        [
            "San Antonio"
        ],
        [
            "1.15%"
        ],
        [
            "613"
        ],
        [
            "May 12"
        ],
        [
            "7"
        ],
        [
            "San Cirilo"
        ],
        [
            "9.97%"
        ],
        [
            "5,53"
        ],
        [
            "May 1"
        ],
        [
            "8"
        ],
        [
            "Santa Rosa Del Norte"
        ],
        [
            "7.74%"
        ],
        [
            "4,136"
        ],
        [
            "October 24"
        ],
        [
            "8"
        ],
        [
            "Santa Rosa Del Sur"
        ],
        [
            "6.60%"
        ],
        [
            "3,527"
        ],
        [
            "January 19"
        ],
        [
            "7"
        ],
        [
            "Tilnac"
        ],
        [
            "1.73%"
        ],
        [
            "927"
        ],
        [
            "January 28"
        ],
        [
            "7"
        ],
        [
            "Tinalmud"
        ],
        [
            "4.55%"
        ],
        [
            "2,435"
        ],
        [
            "—"
        ],
        [
            "—"
        ],
        [
            "Total"
        ],
        [
            "100%"
        ],
        [
            "53,461"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Pasacao"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean maximum °F (°C)"
        ],
        [
            "82(28)"
        ],
        [
            "84(29)"
        ],
        [
            "86(30)"
        ],
        [
            "88(31)"
        ],
        [
            "90(32)"
        ],
        [
            "90(32)"
        ],
        [
            "86(30)"
        ],
        [
            "88(31)"
        ],
        [
            "88(31)"
        ],
        [
            "86(30)"
        ],
        [
            "84(29)"
        ],
        [
            "84(29)"
        ],
        [
            "90(32)"
        ],
        [
            "Mean minimum °F (°C)"
        ],
        [
            "75(24)"
        ],
        [
            "73(23)"
        ],
        [
            "75(24)"
        ],
        [
            "75(24)"
        ],
        [
            "79(26)"
        ],
        [
            "79(26)"
        ],
        [
            "79(26)"
        ],
        [
            "79(26)"
        ],
        [
            "77(25)"
        ],
        [
            "77(25)"
        ],
        [
            "77(25)"
        ],
        [
            "77(25)"
        ],
        [
            "73(23)"
        ],
        [
            "Average precipitation inches (mm)"
        ],
        [
            "5.82(147.9)"
        ],
        [
            "3.56(90.5)"
        ],
        [
            "3.06(77.8)"
        ],
        [
            "3.08(78.2)"
        ],
        [
            "5.66(143.8)"
        ],
        [
            "8.31(211.1)"
        ],
        [
            "12.46(316.4)"
        ],
        [
            "10.05(255.3)"
        ],
        [
            "11.96(303.9)"
        ],
        [
            "10.10(256.6)"
        ],
        [
            "5.81(147.7)"
        ],
        [
            "8.85(224.7)"
        ],
        [
            "88.72(2,253.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "6"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "4"
        ],
        [
            "9"
        ],
        [
            "12"
        ],
        [
            "18"
        ],
        [
            "13"
        ],
        [
            "14"
        ],
        [
            "11"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "111"
        ],
        [
            "Average ultraviolet index"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "7"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "Source: World Weather Online (modeled/calculated data, not measured locally)"
        ],
        [
            "According to the Köppen climate classification system, Pasacao has a tropical rainforest climate.",
            "The north-east monsoon dominates the area; therefore, rainfall is evenly spread throughout the year.",
            "From October to January, the wind blows from north to east, from east to southeast from February to April, and from May to September, it blows from east to southeast.",
            "From December to May, the area is rather dry, and the rest of the year is wet.",
            "The town is occasionally affected by typhoons during the wet season, which can cause flooding and landslides in some areas."
        ],
        [
            "Pasacao experiences a hot and dry season from February to May.",
            "Most visitors and tourists come to Pasacao to relax during these months.",
            "Most resorts and beaches are packed with people on Easter Sunday, especially from local communities and other parts of the country."
        ],
        [
            "Demographics"
        ],
        [
            "Pasacao municipal hall"
        ],
        [
            "In the 2020 census, the population of Pasacao was 53,461 people, with a density of 360 inhabitants per square kilometre or 930 inhabitants per square mile."
        ],
        [
            "Population census of PasacaoYearPop.±% p.a.1903 2,431—    1918 2,308−0.35%1939 5,594+4.31%1948 8,128+4.24%1960 14,327+4.84%YearPop.±% p.a.1970 19,355+3.05%1975 21,809+2.42%1980 25,303+3.02%1990 31,960+2.36%1995 36,070+2.29%YearPop.±% p.a.2000 38,423+1.36%2007 41,533+1.08%2010 45,946+3.74%2015 49,035+1.25%2020 53,461+1.71%Source: Philippine Statistics Authority"
        ],
        [
            "Poverty incidence of Pasacao"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  50.00"
        ],
        [
            "2009  48.74"
        ],
        [
            "2012  44.55"
        ],
        [
            "2015  41.62"
        ],
        [
            "2018  32.75"
        ],
        [
            "2021  44.87"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(September 2021) (Learn how and when to remove this message)"
        ],
        [
            "The primary language spoken in Pasacao is Bikol, specifically the Central Bikol dialect.",
            "However, many residents also speak Tagalog and English, which are the official languages of the Philippines."
        ],
        [
            "Religion"
        ],
        [
            "Despite the presence of a single church, Saint Rose of Lima Parish, and a few chapels, Roman Catholicism is the dominant religion in the municipality.",
            "The Church of Jesus Christ of Latter-day Saints, Iglesia ni Kristo, Born Again denominations, Jehovah's Witnesses, and other Christian denominations are also present across the municipality."
        ],
        [
            "Economy"
        ],
        [
            "The economy of Pasacao is largely based on agriculture and fishing, with rice, corn, and coconut being the main crops grown in the area.",
            "Fishing is also an important industry, with the town's coastal location providing abundant fishing grounds.",
            "Many schools and a growing number of local businesses give additional work opportunities for people.",
            "Other locals work at the oil depots in Barangay Sta.",
            "Rosa Del Sur (the area is also claimed by Barangay Caranan), as well as some labor in Naga and the Metropolitan Manila area.",
            "In recent years, there has been a growing interest in eco-tourism, with the municipality's pristine beaches and scenic spots attracting both local and foreign visitors."
        ],
        [
            "Culture"
        ],
        [
            "Town Fiesta and Pasa-Pasa Ikaw Festival"
        ],
        [
            "August 29-30, the town celebrates its fiesta as well as the Pasa-Pasa Ikaw Festival.",
            "The festival is held in honor of Saint.",
            "Rose of Lima, the town's patroness.",
            "The municipal government organizes an annual calendar of events that includes pageant competitions, civic and military parades, and other activities."
        ],
        [
            "Overall, the town fiesta and Pasa-Pasa Ikaw Festival are significant events in Pasacao's cultural calendar.",
            "These festivals showcase the town's rich cultural heritage and provide a platform for residents to celebrate and express themselves.",
            "They also attract visitors from neighboring towns and cities, boosting the town's tourism industry and promoting local businesses."
        ],
        [
            "Daruanak Summer Festival"
        ],
        [
            "TBE"
        ],
        [
            "Attractions"
        ],
        [
            "Signature Park"
        ],
        [
            "(stylized as SigNATURE Park) is an 1,145 square metres (12,320 sq ft) reclaimed property owned by the Pasacao - Local Government Unit.",
            "It's located along Acacia Drive, Zone 1B, Barangay Sta.",
            "Rose Del Norte-Balogo Junction.",
            "The park serves as both a recreational space and a civic center, which makes it a hub for community activities and events.",
            "One of the buildings in the complex is StrEat Park, which is a food park and an outdoor dining area."
        ],
        [
            "The CBD (Central Business District) Complex is another part of Signature Park, and it houses several important offices and facilities.",
            "The Central Business District Terminal, a transportation hub for the area, providing easy access to Naga City.",
            "The Tourism office could offer information about local attractions and events, while the PSO and PNP substation provide public safety and police services.",
            "The Pasalubong Center is a place where visitors can purchase souvenirs and local products, which can help support the local economy."
        ],
        [
            "The DRRM Complex is another notable feature of Pasacao Signature Park, which includes a covered court and the MDDRMC Office.",
            "The MDDRMC Office is responsible for managing disaster risk reduction and management in the area.",
            "The park also features an Eco-park Complex, which offers green spaces and features such as an eco-park and plaza.",
            "Visitors can relax and unwind in the serene environment of the Eco-park Complex, which also houses the Municipal Police Office Station, serving as a local police station for the area."
        ],
        [
            "Pasacao Boulevard"
        ],
        [
            "is a waterfront road located in barangay San Cirilo.",
            "It is part of the Circumferential Road and Proposed Esplanade that connects San Cirilo to Santa Rosa del Norte and Balogo Road."
        ],
        [
            "Infrastructure"
        ],
        [
            "Pasacao Port"
        ],
        [
            "Ports"
        ],
        [
            "Pasacao Seaport, also known as the Port of Pasacao, locally known as Pier, is a fishing, passenger, and cargo port in Camarines Sur.",
            "It is situated in Barangay Sta.",
            "Rose del Sur.",
            "The port serves passengers traveling from Pasacao to Burias in Masbate Province."
        ],
        [
            "The nearby smaller Pasacao Fishport is primarily utilized for fishing and unloading fish, as well as pump boats and fastcrafts for short trips."
        ],
        [
            "Pasacao-Balatan Tourism Coastal Highway"
        ],
        [
            "The Pasacao-Balatan Tourism Coastal Highway is a 40.69 kilometres (25.28 mi) project of the National Economic and Development Authority (NEDA) and the Build, Build, Build program.",
            "It connects the municipalities of Pasacao, San Fernando, Minalabac, Bula, and Balatan, as well as 15 barangays within the aforementioned towns, with the goal of promoting ecotourism in Camarines Sur.",
            "There are 13 bridges in the network of roads, as well as intersections, service roads, and other infrastructure."
        ],
        [
            "Education"
        ],
        [
            "The town has several schools and educational institutions that offer quality education to its residents."
        ],
        [
            "At the elementary level, there are 16 public elementary schools and 2 private schools that cater to the educational needs of children in Pasacao.",
            "The public elementary schools are operated by the Department of Education (DepEd) and offer the government's K-12 program.",
            "At the secondary level, there are 6 public high schools and 2 private schools in Pasacao.",
            "Students who complete high school can pursue higher education in colleges and universities in nearby cities such as Naga and Legazpi."
        ],
        [
            "One notable educational institution in Pasacao is the Central Bicol State University of Agriculture (CBSUA) - Pasacao Campus.",
            "It was established in 1982 and is one of the satellite campuses of CBSUA in the province.",
            "The Pasacao Campus offers undergraduate course in education."
        ],
        [
            "Aside from formal education, Pasacao also promotes non-formal education through the Alternative Learning System (ALS).",
            "The ALS is a program offered by the DepEd that provides out-of-school youth and adults an opportunity to complete their elementary or high school education through flexible learning modes such as distance learning, modular learning, and face-to-face classes."
        ],
        [
            "In addition, Pasacao also supports technical and vocational education and training (TVET) through the Camarines Sur Institute of Fisheries and Marine Sciences (CASIFMAS).",
            "CASFIMAS offers various vocational courses in fields such as automotive, welding, food and beverage, and electronics, among others.",
            "These courses provide residents of Pasacao with the necessary skills to pursue employment opportunities or start their own businesses"
        ],
        [
            "Below is the list of the tertiary and secondary level existing schools on the municipality."
        ],
        [
            "Tertiary"
        ],
        [
            "Camarines Sur Institute of Fisheries and Marine Sciences"
        ],
        [
            "Camarines Sur Institute of Fisheries and Marine Sciences - Caranan Campus"
        ],
        [
            "Central Bicol State University for Agriculture (CBSUA) - Pasacao Extension Campus"
        ],
        [
            "Secondary"
        ],
        [
            "Antipolo Heights Integrated School"
        ],
        [
            "Arbovitae Plains Montessori Inc. (APMI) - Pasacao Branch"
        ],
        [
            "Balogo Baptist Christian School, Inc."
        ],
        [
            "Dalupaon National High School"
        ],
        [
            "Dr. Lorenzo P. Ziga Memorial High School"
        ],
        [
            "Juan F. Triviño Memorial High School"
        ],
        [
            "La Florianne Institute of Learning, Inc."
        ],
        [
            "Lyceo de Pasacao"
        ],
        [
            "Pasacao Academy, Inc."
        ],
        [
            "Pasacao Municipal High School"
        ],
        [
            "Rolando R. Andaya Memorial High School"
        ],
        [
            "Notes"
        ],
        [
            "^ Malinig (English: Clean)Asensado (English: Prosperous)Trangkilo (English: Peaceful)Areglado (English: Organized)Tarabangan para sa aktibong pag gobernar (English: Cooperated for an active governance)"
        ],
        [
            "^ Formerly Hebrio Lourdes"
        ],
        [
            "^ SeatofInclusive Government"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Pasacao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA releases the 2015 Municipal and City Level Poverty Estimates\".",
            "Quezon City, Philippines.",
            "Retrieved 1 January 2020."
        ],
        [
            "^ Barrameda, Shiena M. (2013-06-12).",
            "\"Saving Pasacao as summer capital\".",
            "INQUIRER.net.",
            "Retrieved 2022-05-15."
        ],
        [
            "^ a b c d e f g h \"History of Pasacao | LGU Pasacao Official Website\".",
            "Retrieved 2022-05-13."
        ],
        [
            "^ Abella, Domingo (1954).",
            "Bikol annals: A Collection of Vignettes of Philippine History. .",
            "Manila.",
            "{{cite book}}:  CS1 maint: location missing publisher (link)"
        ],
        [
            "^ Barrameda.",
            "pp.",
            "43–44."
        ],
        [
            "^ \"Barangays | LGU Pasacao Official Website\".",
            "Retrieved 2022-05-15."
        ],
        [
            "^ \"Pasacao Climate Weather Averages\".",
            "Retrieved May 13, 2022."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Camarines Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Groundworks for Pasacao-Balatan Tourism Coastal Highway now underway\".",
            "ph.news.yahoo.com.",
            "Retrieved 2022-12-27."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Pasacao."
        ],
        [
            "Official Website of Pasacao, Camarines Sur"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Official Site of the Province of Camarines Sur"
        ],
        [
            "Barangays of Pasacao, Camarines Sur"
        ],
        [
            "Places adjacent to Pasacao"
        ],
        [
            "Libmanan / Pamplona"
        ],
        [
            "Ragay Gulf"
        ],
        [
            "Pasacao"
        ],
        [
            "San Fernando"
        ],
        [
            "Ragay Gulf"
        ],
        [
            "vteMetro NagaStatistically grouped with the Province of Camarines SurAdministrative divisionsCity"
        ],
        [
            "Naga"
        ],
        [
            "Municipalities"
        ],
        [
            "Bombon"
        ],
        [
            "Bula"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Gainza"
        ],
        [
            "Libmanan"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "San Fernando"
        ],
        [
            "Geography"
        ],
        [
            "Mount Isarog"
        ],
        [
            "Mount Bernacci (Tangcong Vaca)"
        ],
        [
            "History"
        ],
        [
            "History of Metro Naga"
        ],
        [
            "Religion"
        ],
        [
            "Religion in Naga"
        ],
        [
            "Archdiocese of Caceres"
        ],
        [
            "Our Lady of Peñafrancia"
        ],
        [
            "Public utilities and services"
        ],
        [
            "Metropolitan Naga Water District"
        ],
        [
            "Public Services"
        ],
        [
            "TransportationRailways"
        ],
        [
            "Philippine National Railways"
        ],
        [
            "Road & Highways"
        ],
        [
            "Major Roads"
        ],
        [
            "Pan-Philippine Highway"
        ],
        [
            "South Luzon Expressway (Toll Road 5)"
        ],
        [
            "Airports"
        ],
        [
            "Naga Airport"
        ],
        [
            "Education"
        ],
        [
            "Education in Naga"
        ],
        [
            "Naga Parochial School"
        ],
        [
            "Ateneo de Naga University"
        ],
        [
            "Universidad de Santa Isabel"
        ],
        [
            "University of Nueva Caceres"
        ],
        [
            "Holy Rosary Seminary"
        ],
        [
            "Holy Rosary Minor Seminary"
        ],
        [
            "Holy Rosary Major Seminary"
        ],
        [
            "Naga College Foundation"
        ],
        [
            "Bicol State College of Applied Sciences and Technology"
        ],
        [
            "Naga City Science High School"
        ],
        [
            "AMA Computer University"
        ],
        [
            "Camarines Sur National High School"
        ],
        [
            "STI College"
        ],
        [
            "Landmarks"
        ],
        [
            "Porta Mariae"
        ],
        [
            "Naga Cathedral"
        ],
        [
            "Our Lady of Peñafrancia Shrine"
        ],
        [
            "Peñafrancia Basilica Minore"
        ],
        [
            "San Francisco Church"
        ],
        [
            "St. Anthony of Padua Parish Church"
        ],
        [
            "Highways in Italics are either under construction, not yet operational, or have been closed."
        ],
        [
            "Bicol Region"
        ],
        [
            "Philippines"
        ],
        [
            "vte Province of Camarines SurPili (capital)  Naga (largest city)Municipalities"
        ],
        [
            "Baao"
        ],
        [
            "Balatan"
        ],
        [
            "Bato"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Caramoan"
        ],
        [
            "Del Gallego"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Goa"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Lupi"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Nabua"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "Presentacion"
        ],
        [
            "Ragay"
        ],
        [
            "Sagñay"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Component city"
        ],
        [
            "Iriga"
        ],
        [
            "Independent component city"
        ],
        [
            "Naga (Administratively independent from the province but grouped under Camarines Sur by the Philippine Statistics Authority.)"
        ],
        [
            "vteBicol Region (Region V)Provinces"
        ],
        [
            "Albay"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Catanduanes"
        ],
        [
            "Masbate"
        ],
        [
            "Sorsogon"
        ],
        [
            "Regional center"
        ],
        [
            "Legazpi"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Daet"
        ],
        [
            "Legazpi"
        ],
        [
            "Masbate City"
        ],
        [
            "Pili"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Virac"
        ],
        [
            "Metropolitan areas"
        ],
        [
            "Metro Naga"
        ],
        [
            "Independent component cities"
        ],
        [
            "Naga"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Iriga"
        ],
        [
            "Ligao"
        ],
        [
            "Masbate City"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Tabaco"
        ],
        [
            "Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baao"
        ],
        [
            "Bacacay"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Balatan"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Baras"
        ],
        [
            "Barcelona"
        ],
        [
            "Basud"
        ],
        [
            "Bato (Camarines Sur)"
        ],
        [
            "Bato (Catanduanes)"
        ],
        [
            "Batuan"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camalig"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Capalonga"
        ],
        [
            "Caramoan"
        ],
        [
            "Caramoran"
        ],
        [
            "Casiguran"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Daet"
        ],
        [
            "Daraga"
        ],
        [
            "Del Gallego"
        ],
        [
            "Dimasalang"
        ],
        [
            "Donsol"
        ],
        [
            "Esperanza"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Gigmoto"
        ],
        [
            "Goa"
        ],
        [
            "Gubat"
        ],
        [
            "Guinobatan"
        ],
        [
            "Irosin"
        ],
        [
            "Jose Panganiban"
        ],
        [
            "Jovellar"
        ],
        [
            "Juban"
        ],
        [
            "Labo"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Libon"
        ],
        [
            "Lupi"
        ],
        [
            "Magallanes"
        ],
        [
            "Magarao"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Mandaon"
        ],
        [
            "Manito"
        ],
        [
            "Matnog"
        ],
        [
            "Mercedes"
        ],
        [
            "Milaor"
        ],
        [
            "Milagros"
        ],
        [
            "Minalabac"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Nabua"
        ],
        [
            "Oas"
        ],
        [
            "Ocampo"
        ],
        [
            "Palanas"
        ],
        [
            "Pamplona"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "Paracale"
        ],
        [
            "Pasacao"
        ],
        [
            "Pilar"
        ],
        [
            "Pili"
        ],
        [
            "Pio Duran"
        ],
        [
            "Pio V. Corpuz"
        ],
        [
            "Placer"
        ],
        [
            "Polangui"
        ],
        [
            "Presentacion"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Ragay"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Sagñay"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando (Camarines Sur)"
        ],
        [
            "San Fernando (Masbate)"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Jose"
        ],
        [
            "San Lorenzo Ruiz"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pascual"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Talisay"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Tiwi"
        ],
        [
            "Uson"
        ],
        [
            "Viga"
        ],
        [
            "Vinzons"
        ],
        [
            "Virac"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pasacao&oldid=1218691736\""
        ],
        [
            "Categories: Municipalities of Camarines SurMetro NagaHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: location missing publisherCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Central Bikol-language textArticles containing Tagalog-language textArticles needing additional references from September 2021Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}