{
    "name": "Pasay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pasay"
        ],
        [
            "42 languages"
        ],
        [
            "العربيةAsturianuBikol CentralCebuanoČeštinaChavacano de ZamboangaDeutschΕλληνικάEspañolEsperantoفارسیFrançais한국어IlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuLietuviųBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsScotsSimple EnglishŚlůnskiСрпски / srpskiSuomiSvenskaTagalogТатарча / tatarçaไทยTürkçeاردوTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°33′N 121°00′E﻿ / ﻿14.55°N 121°E﻿ / 14.55; 121"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Highly urbanized city in Metro Manila, Philippines"
        ],
        [
            "Highly urbanized city in National Capital Region, PhilippinesPasayHighly urbanized cityPasay skylinePasay City Mall and MarketPasay City HallWelcome SignBay CityGlobe RotondaPasay RotondaNAIA Terminal 2"
        ],
        [
            "FlagSealNickname: The Travel CityMotto: Aim High Pasay!Anthem: Pasay, Mabuhay Ka!",
            "(English: \"Long live Pasay!",
            "\")Map of Metro Manila with Pasay highlightedOpenStreetMapPasayLocation within the PhilippinesCoordinates: 14°33′N 121°00′E﻿ / ﻿14.55°N 121°E﻿ / 14.55; 121CountryPhilippinesRegionNational Capital RegionProvincenoneDistrict"
        ],
        [
            "Lone districtFoundedDecember 2, 1863RenamedSeptember 6, 1901June 7, 1950Cityhood and renamedJune 21, 1947 (as Rizal City)Highly urbanized cityDecember 22, 1979Barangays201"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorImelda Calixto-Rubiano (PFP) • Vice MayorWaldetrudes Del Rosario (Lakas) • RepresentativeAntonino G. Calixto (Lakas) • Councilors"
        ],
        [
            "1st District"
        ],
        [
            " Mark Anthony Calixto"
        ],
        [
            "  Mary Grace Santos"
        ],
        [
            "  Marlon Pesebre"
        ],
        [
            "  Ma.",
            "Antonia Cuneta"
        ],
        [
            "  Abraham Albert Alvina"
        ],
        [
            "  Ricardo Santos"
        ],
        [
            "2nd District"
        ],
        [
            " Jose Isidro Jr."
        ],
        [
            "  Editha Manguerra"
        ],
        [
            "  Donnabel Vendivel"
        ],
        [
            "  Jennifer Panaligan"
        ],
        [
            "  King Marlon Magat"
        ],
        [
            "  Angelo Nicol Arceo"
        ],
        [
            " • Electorate276,579 voters (2022)Area • Revenue₱ 6,767 million (2020) • Assets₱ 19,343 million (2020) • Expenditure₱ 5,771 million (2020) • Liabilities₱ 10,022 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code1300–1309PSGC137605000IDD : area code +63 (0)2Native languagesTagalogWebsitewww.pasay.gov.ph"
        ],
        [
            "Pasay, officially the City of Pasay (Filipino: Lungsod ng Pasay; IPA:"
        ],
        [
            "Due to its location just south of Manila, Pasay quickly became an urban town during the American colonial period.",
            "It is now best known for being the site of most of Ninoy Aquino International Airport and of complexes such as Newport City and the SM Central Business Park."
        ],
        [
            "Etymology"
        ],
        [
            "There are possible explanations on the origins of the city's name:"
        ],
        [
            "A legend suggested that it may have been named after Dayang-dayang Pasay, a princess of the Kingdom of Namayan and daughter of Kingdom of Maynila ruler Rajah Sulayman.",
            "She inherited half of her father's lands, which encompasses the present-day city, and founded the present-day city."
        ],
        [
            "Another legend suggested that it was named after Pasay, one of the sons of a ruler of Namayan who inherited his territories that also includes the present-day city."
        ],
        [
            "There's also a romantic legend where a man named Jose loudly cried out \"Paz-ay!\"",
            "at the grave of his wealthy love interest, Paz, symbolizing their forbidden love and Paz's eventual death due to loneliness.",
            "In tribute, Paz's parents named their hacienda Paz-ay or Pasay."
        ],
        [
            "Some historians believe that the city is named after the medicinal plant named pasaw (Pseuderanthemum reticulatum) that once grew abundantly there."
        ],
        [
            "According to American historian Austin Craig, Pasay was known as Javan Pasar, a corruption of the Arabic word bazar as the town was a marketplace.",
            ": 117"
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "See also: Namayan and Rajahnate of Maynila"
        ],
        [
            "The map of territory once said to be under the rule of Namayan, which includes Pasay, in modern Metro Manila"
        ],
        [
            "In local folk history about the period before the arrival of Spanish colonizers, Pasay is said to have been part of Namayan (sometimes also called Sapa), a confederation of barangays which supposedly controlled territory stretching from Manila Bay to Laguna de Bay, and which, upon the arrival of the Spanish, eventually became known as Santa Ana de Sapa (modern day Santa Ana, Manila)."
        ],
        [
            "Spanish colonial period"
        ],
        [
            "On May 19, 1571, Miguel López de Legazpi took formal possession of the Rajahnate of Maynila and its surrounding polities in the name of the Spanish crown."
        ],
        [
            "Of the many religious orders that came, it was the Augustinian Order who would figure predominantly in the evangelisation of Pasay.",
            "Having control over Pasay, they converted the area into an extensive agricultural estate known as the Hacienda de Meysapan.",
            "The parish of Pasay was governed from the old Namayan capital, since renamed Santa Ana de Sapa, which was under the jurisdiction of the Franciscans.",
            "The promise of space in Heaven prompted early native converts to donate their possessions to the Church, with folklore recounting how a baptized Pasay on her deathbed donated her vast estate to the Augustinians.",
            "Most of Pasay went to friar's hands either via donation or by purchase; many natives were also forced to divest of their properties to cope with stringent colonial impositions."
        ],
        [
            "In 1727, the Augustinians formally took over Pasay and transferred it from Santa Ana de Sapa to Malate, particularly under the jurisdiction of the Parish of Nuestra Señora de los Remedios."
        ],
        [
            "In 1862, notable residents of Pasay submitted a petition to handle their political and religious matters independently, proposing to rename the town \"Pineda\", in honor of Don Cornelio Pineda, a Spanish horticulturist who was their benefactor.",
            "On December 2, 1863, with the recommendation of Manila Archbishop Gregorio Melitón Martínez Santa Cruz, Pineda was granted its own municipal charter, and this date is celebrated yearly as the city's official foundation day."
        ],
        [
            "Philippine revolutionary period"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(February 2022) (Learn how and when to remove this message)"
        ],
        [
            "Pasay produced numerous heroes during the Philippine Revolution.",
            "The Katipunan, the organization founded by Andrés Bonifacio that spearheaded the revolution, had a chapter in Pineda organized by Pascual Villanueva, Jacinto Ignacio, and Valentin Ignacio.",
            "Several women also fought for the cause of the Katipunan including Marcela Marcelo.",
            "The execution of José Rizal, who authored the novels Noli Me Tangere and El Filibusterismo (considered seditious by the colonial government) on December 30, 1896, fanned the flames of the Revolution."
        ],
        [
            "American colonial period"
        ],
        [
            "General Emilio Aguinaldo meanwhile declared the independence of the First Philippine Republic on June 12, 1898, and issued decrees providing political reorganization in the country.",
            "With this, Don Catalino became Pasay's first Presidente municipal (equivalent to present-day Mayor)."
        ],
        [
            "Pineda was made the command outpost of the Primera Zona de Manila under Gen. Mariano Noriel, but Gen. Wesley Merritt appealed that the Pineda outpost turned over to the Americans so that they could be closer to the Spanish lines.",
            "Thinking Americans were allies, Noriel left Pineda on July 29, allowing American General Greene to transfer.",
            "When Intramuros was finally captured, the Filipinos were denied entry to the walled city.",
            "Since then, tension simmered between Filipino and American troops, with both sides assigned respective zones but neither observed boundary lines.",
            "On the night of February 4, 1899, four Filipinos crossed the American line in Santa Mesa, Manila, and shots were exchanged, triggering the Philippine–American War."
        ],
        [
            "On May 19, 1899, General Noriel was given command again of Pineda.",
            "In June, Noriel together with General Ricarte almost defeated the American forces had they exploited the exhaustion of the enemy in the Battle of Las Piñas.",
            "Instead, their forces were attacked by American reinforcements and bombarded by warships.",
            "The assault forced them to abandon Pineda to occupation by American forces."
        ],
        [
            "Pasay beach, Manila, oil on board by Fabián de la Rosa, 1927"
        ],
        [
            "Aerial view of Pasay, circa 1930s"
        ],
        [
            "On June 11, 1901, Pineda was incorporated into the Province of Rizal.",
            "Pascual Villanueva was appointed as municipal president.",
            "On August 4, 1901, the Pineda municipal council passed a resolution petitioning that the original name of Pasay be returned.",
            "On September 6, 1901, the Philippine Commission, acting on the request of the townsfolk, passed Act No.",
            "227 renaming Pineda back to Pasay.",
            "With a population of 8,100 in 1903, Pasay was placed under the fourth-class category together with 9 other municipalities."
        ],
        [
            "Friar lands, then nationalized, were turned into subdivisions.",
            "Soon, the Pasay Real Estate Company offered friar lands as residential lots for sale or for lease to foreign investors.",
            "Postal, telegraph, and telephone lines were installed, and branches of Philippine Savings Bank were established.",
            "In 1907, a first-class road from Pasay to Camp Nichols was completed.",
            "Others were repaired including the old Avenida Mexico, now called the Taft Avenue extension.",
            "Transportation services improved.",
            "Among the first buses plying routes to Pasay were Pasay Transportation, Raymundo Transportation, Try-tran, and Halili Transit."
        ],
        [
            "By 1908, Meralco tranvia (electric tram car) lines linked Pasay to Intramuros, Escolta, San Miguel, San Sebastian, and San Juan.",
            "Automobiles took to the streets, testing their maximum 20 km/h (12 mph) speed on Taft Avenue.",
            "On April 11, 1914, Cora Wong, a nurse at the Chinese General Hospital, became the first woman in the Philippines to fly as a passenger on a flight with Tom Gunn in a Curtiss seaplane off Pasay Beach."
        ],
        [
            "Much of the bayside area beyond Luneta was swamp but American ex-soldiers were quick to seize the opportunity to develop it for residential purposes.",
            "By 1918, Pasay had a population of 18,697 because of the exodus of prominent Filipino families and government officials to this seaside town including future president Manuel L. Quezon.",
            "By the 1930s, the former rural town had become a suburb of the capital city."
        ],
        [
            "From the 1900s up to the mid-1930s, Philippine National Railway services reached Pasay thru its Cavite Line."
        ],
        [
            "Japanese occupation"
        ],
        [
            "World War II came and on December 26, 1941, General Douglas MacArthur issued a proclamation declaring Manila and its suburbs (Caloocan, Quezon City, San Juan, Mandaluyong, Makati, and Pasay) an open city.",
            "On New Year's Day 1942, Quezon, while in Corregidor, established the City of Greater Manila, wherein Pasay, along with other nearby towns of Rizal, was merged with Manila and Quezon City.",
            "He called his secretary Jorge B. Vargas and appointed him by executive order \"the Mayor of Greater Manila\".",
            "The mayor of Pasay was then Rufino Mateo, who would concurrently serve the vice mayor of the City of Greater Manila for Pasay, governing a town of more than 55,161.",
            "During the WWII, many Pasayeños joined in the fight against the Japanese.",
            "Jose P. Maibag, born and bred in Pasay, laid out underground networking.",
            "Carlos Mendoza, a resident of Barrio San Roque, together with 14 others, formed a mobile broadcasting station called \"The Voice of Juan dela Cruz.\"",
            "On July 11, 1942, Japanese military police captured the group.",
            "Carling Mendoza, alias Juan de la Cruz\" and other members of the group were brought to the old Bilibid Prison and were tortured."
        ],
        [
            "Pasay had to redo the signs all over town, with Filipino was ordered to prevail over English.",
            "The national language became a core subject in the secondary school curriculum, while Japanese was taught as well at all levels of education.",
            "On October 14, 1943, Japan proclaimed the Second Philippine Republic.",
            "In the meantime, food had become so scarce that prices soared.",
            "Pasay residents began to move away from the city to the provinces outside.",
            "The Japanese occupation forces dissolved the City of Greater Manila in 1944 with the establishment of the Philippine Executive Commission to govern occupied regions in the country, thus separating the consolidated cities and towns, with Pasay returning to the province of Rizal.",
            "In the middle of February up to early March 1945, as the combined Allied forces began to converge on the way to the Manila area northwards from the south, Pasay suffered enormous damage during the month-long Battle of Manila, and many residents perished either by the Japanese or friendly fire from the combined Filipino and American forces."
        ],
        [
            "On February 27, 1945, General MacArthur turned over the government to President Sergio Osmeña.",
            "One of Osmeña's first acts was to dissolve the Greater Manila Complex.",
            "He then appointed Juan Salcedo Jr., born in Pasay in 1904, as Director of Philippine Health, and then as executive officer of the Philippine Rehabilitation Administration in charge of national recovery from the devastation wrought by the Japanese occupation.",
            "Osmeña appointed Adolfo Santos as prewar vice mayor of Pasay, in place of incumbent Moises San Juan who died during the war.",
            "He also issued an executive order that would dissolve the City of Greater Manila effective August 1, 1945, thus reinstating Pasay's pre-war status as a municipality of Rizal."
        ],
        [
            "Philippine independence"
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "Ignacio Santos-Diaz, a congressman from the first district of Rizal, pushed for the conversion of the town into a city and it to be named after Rizal.",
            "Republic Act No.",
            "183 was signed into law by President Manuel Roxas on June 21, 1947, officially establishing Rizal City,"
        ],
        [
            "It was also in the 1940s when houses of faith were constructed in different parts of Pasay.",
            "Among them was the Church of Our Lady of Sorrows, the Libreria de San Pablo Catholic Women's League, Caritas, the nutrition center, and the grotto of Our Lady of Lourdes.",
            "In 1951, two parishes were established: the Parish of San Isidro Labrador and the Parish of San Rafael.",
            "By that time, the city was once more the aviation center of the country when what is now Ninoy Aquino International Airport opened its doors in 1948."
        ],
        [
            "On June 14, 1955, Pasay regained its power to choose its leader.",
            "Pablo Cuneta ran against one-time Mayor Adolfo Santos and became the city's first elected mayor.",
            "In 1959, he campaigned again and won against his former vice mayor, Ruperto Galvez.",
            "On December 30, 1965, Ferdinand Marcos was sworn in as President of the Philippines, with Fernando Lopez, a resident of Pasay, as vice president.",
            "From that moment, Imelda Romualdez Marcos, the then First Lady, became involved in national affairs.",
            "On the northern boundary of Pasay, she started filling the waterfront on Manila Bay to build the Cultural Center of the Philippines.",
            "In the later decades she would add three more architectural showpieces on reclaimed land in Pasay: the Folk Arts Theater, Manila Film Center, and the Philippine International Convention Center, and later on the PhilCite Exhibition Hall, the basis of what is now Star City.",
            "The city, though, was also being groomed as a television center for the country, for in 1958, ABS-CBN had opened its brand new television studios on what is now Roxas Boulevard with state-of-the-art equipment, the studios, with color-ready equipment and cameras from Japan plus a number of video recording equipment, were handed over in 1969 to the Radio Philippines Network, which used them until a 1973 fire which ruined the studios, as ABS-CBN had moved northward into Quezon City with the opening of its current studios and offices."
        ],
        [
            "In 1967, Jovito Claudio won the city elections as chief executive against Pablo Cuneta.",
            "In the following year, an assassination attempt occurred in Pasay when a Bolivian surrealist painter lunged at Pope Paul VI, with a knife grazing his chest.",
            "In 1971, Cuneta was re-elected as city mayor of a growing city of almost 90 thousand people."
        ],
        [
            "Martial law era"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(July 2019) (Learn how and when to remove this message)"
        ],
        [
            "On December 7, 1972, almost two months after martial law was declared, an assassin tried to kill Imelda Marcos.",
            "The event took place in Pasay, on live television, while Mrs. Marcos was distributing prizes to the winners of the National Beautification and Cleanliness contest.",
            "She suffered some wounds and broken nails but on the whole, she emerged unscathed from that close encounter.",
            "On the second anniversary of martial law, Marcos issued Presidential Decree No.",
            "557, declaring every barrio in the country as barangays.",
            "Not long after the decree had been put into effect, the Metropolitan Manila Commission and the Department of Local Government instructed Pasay to create its own barangays.",
            "Mayor Cuneta, in response, ordered the creation of 487 barangays.",
            "Upon the firm suggestion of Local Government and Community Development Secretary Jose Roño, the number of barangays was cut down to two hundred, organized into several zones."
        ],
        [
            "On November 7, 1975, Marcos appointed the First Lady, Imelda, as governor of Metro Manila.",
            "The federation consolidated 13 towns and 4 cities including Pasay, which was removed from Rizal province."
        ],
        [
            "Pasay was the host city of Miss Universe 1974, the first time this event had been held in the morning and in the Asia Pacific, and thus was in the international spotlight in the leadup to the pageant day.",
            "Half a decade later, the city's first family would become famous nationally in the music scene: Sharon, the then young daughter of the mayor, broke out into the spotlight as a singer with the release of the LP DJ's Pet."
        ],
        [
            "On December 22, 1979, along with Manila, Quezon City, Caloocan, and other cities in the country, Pasay became a highly urbanized city."
        ],
        [
            "In 1981, LRT Line 1 opened its Pasay stations, including its Baclaran terminal on the Parañaque border, marking a return to rapid urban rail."
        ],
        [
            "EDSA people power"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(July 2019) (Learn how and when to remove this message)"
        ],
        [
            "The situation changed in the city in the immediate aftermath of the People Power Revolution.",
            "Cuneta left his post to be replaced by two acting mayors, Eduardo Calixto and Norman Urbina, only to be reelected in 1988 and serving for three more terms, before handing over to Jovito Claudio in 1998.",
            "Upon the end of his term, he was the city's longest ever city mayor.",
            "Claudio, himself replaced by the then vice mayor Wenceslao \"Peewee\" Trinidad in 2000, saw the building of the MRT Line 3's southern terminus in the city, linked to the LRT Line 1 along Taft Avenue, and the Pasay City General Hospital and Ninoy Aquino International Airport Terminal 2 were both opened to the public.",
            "All these and other projects spurred a new era of growth in the city that continues to this day.",
            "The EDSA Entertainment Complex, located just to the city's west along EDSA, just miles from the Baclaran, Parañaque, for many years now is very well known for adult entertainment, including prostitution."
        ],
        [
            "Contemporary"
        ],
        [
            "Aerial view of Pasay, 2015"
        ],
        [
            "In 2006, the SM Mall of Asia, the largest shopping center overall in the country, was opened, and the area around this mall began to grow into the city's business center in subsequent years that followed, followed by the opening of the city's biggest sports venue, the Mall of Asia Arena.",
            "Two years later, the NAIA Terminal 3 opened its doors in July 2008, and within two years, progress blossomed in the vicinity with the opening of yet another residential and entertainment hub, Newport City, strengthened by the construction of the NAIA Expressway in 2016."
        ],
        [
            "In 2007, then-Acting Mayor Allan Panaligan carried a plan to construct a new city hall located at the Central Business Park-I Island A along Macapagal Avenue."
        ],
        [
            "In 2021, Mayor Imelda Calixto-Rubiano announced that the city government was planning to build a new hospital facility in the city."
        ],
        [
            "Geography"
        ],
        [
            "Zones and barangays of Pasay"
        ],
        [
            "Pasay covers a total land area of 18.64 square kilometers (7.20 sq mi),"
        ],
        [
            "Aerial view of Pasay with land reclamations"
        ],
        [
            "Pasay is composed of two districts, subdivided into 20 zones, with a total of 201 barangays."
        ],
        [
            "Table of Barangays"
        ],
        [
            "Barangay"
        ],
        [
            "Zone"
        ],
        [
            "District"
        ],
        [
            "Other known names"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "3"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "4"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "5"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "7"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "9"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "10"
        ],
        [
            "4"
        ],
        [
            "1"
        ],
        [
            "11"
        ],
        [
            "4"
        ],
        [
            "1"
        ],
        [
            "12"
        ],
        [
            "4"
        ],
        [
            "1"
        ],
        [
            "13"
        ],
        [
            "4"
        ],
        [
            "1"
        ],
        [
            "Department of Foreign Affairs"
        ],
        [
            "14"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "15"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "17"
        ],
        [
            "1"
        ],
        [
            "1"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "19"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "20"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "21"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "22"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "23"
        ],
        [
            "2"
        ],
        [
            "1"
        ],
        [
            "24"
        ],
        [
            "4"
        ],
        [
            "1"
        ],
        [
            "25"
        ],
        [
            "4"
        ],
        [
            "1"
        ],
        [
            "26"
        ],
        [
            "4"
        ],
        [
            "1"
        ],
        [
            "27"
        ],
        [
            "4"
        ],
        [
            "1"
        ],
        [
            "28"
        ],
        [
            "4"
        ],
        [
            "1"
        ],
        [
            "29"
        ],
        [
            "5"
        ],
        [
            "1"
        ],
        [
            "30"
        ],
        [
            "5"
        ],
        [
            "1"
        ],
        [
            "31"
        ],
        [
            "5"
        ],
        [
            "1"
        ],
        [
            "32"
        ],
        [
            "5"
        ],
        [
            "1"
        ],
        [
            "33"
        ],
        [
            "3"
        ],
        [
            "1"
        ],
        [
            "34"
        ],
        [
            "3"
        ],
        [
            "1"
        ],
        [
            "35"
        ],
        [
            "3"
        ],
        [
            "1"
        ],
        [
            "36"
        ],
        [
            "3"
        ],
        [
            "1"
        ],
        [
            "37"
        ],
        [
            "3"
        ],
        [
            "1"
        ],
        [
            "38"
        ],
        [
            "5"
        ],
        [
            "1"
        ],
        [
            "39"
        ],
        [
            "5"
        ],
        [
            "1"
        ],
        [
            "40"
        ],
        [
            "5"
        ],
        [
            "1"
        ],
        [
            "41"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "42"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "43"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "Tramo"
        ],
        [
            "44"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "45"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "46"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "47"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "48"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "49"
        ],
        [
            "6"
        ],
        [
            "2"
        ],
        [
            "50"
        ],
        [
            "7"
        ],
        [
            "2"
        ],
        [
            "51"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "52"
        ],
        [
            "7"
        ],
        [
            "2"
        ],
        [
            "53"
        ],
        [
            "7"
        ],
        [
            "2"
        ],
        [
            "54"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "55"
        ],
        [
            "7"
        ],
        [
            "2"
        ],
        [
            "56"
        ],
        [
            "7"
        ],
        [
            "2"
        ],
        [
            "57"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "58"
        ],
        [
            "7"
        ],
        [
            "2"
        ],
        [
            "59"
        ],
        [
            "7"
        ],
        [
            "2"
        ],
        [
            "60"
        ],
        [
            "7"
        ],
        [
            "2"
        ],
        [
            "61"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "62"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "63"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "64"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "65"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "66"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "67"
        ],
        [
            "8"
        ],
        [
            "2"
        ],
        [
            "68"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "69"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "70"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "71"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "72"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "73"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "74"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "75"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "76"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "Bay City"
        ],
        [
            "77"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "78"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "Baclaran"
        ],
        [
            "79"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "80"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "81"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "82"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "83"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "84"
        ],
        [
            "10"
        ],
        [
            "1"
        ],
        [
            "85"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "86"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "87"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "88"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "89"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "90"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "91"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "92"
        ],
        [
            "9"
        ],
        [
            "1"
        ],
        [
            "Victory Pasay Mall"
        ],
        [
            "93"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "Libertad"
        ],
        [
            "94"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "95"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "96"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "97"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "98"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "99"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "100"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "101"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "102"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "103"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "104"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "105"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "106"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "107"
        ],
        [
            "11"
        ],
        [
            "2"
        ],
        [
            "108"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "109"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "110"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "111"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "112"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "113"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "114"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "115"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "116"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "117"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "118"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "119"
        ],
        [
            "14"
        ],
        [
            "2"
        ],
        [
            "120"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "121"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "122"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "123"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "124"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "125"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "Ventanilla"
        ],
        [
            "126"
        ],
        [
            "12"
        ],
        [
            "2"
        ],
        [
            "127"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "128"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "129"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "130"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "131"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "Magtibay"
        ],
        [
            "132"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "133"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "134"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "135"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "136"
        ],
        [
            "13"
        ],
        [
            "2"
        ],
        [
            "137"
        ],
        [
            "15"
        ],
        [
            "2"
        ],
        [
            "138"
        ],
        [
            "15"
        ],
        [
            "2"
        ],
        [
            "139"
        ],
        [
            "15"
        ],
        [
            "2"
        ],
        [
            "140"
        ],
        [
            "15"
        ],
        [
            "2"
        ],
        [
            "141"
        ],
        [
            "15"
        ],
        [
            "2"
        ],
        [
            "142"
        ],
        [
            "15"
        ],
        [
            "2"
        ],
        [
            "143"
        ],
        [
            "15"
        ],
        [
            "2"
        ],
        [
            "144"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "145"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "Santo Niño"
        ],
        [
            "146"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "147"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "148"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "149"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "150"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "151"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "152"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "153"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "154"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "155"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "156"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "157"
        ],
        [
            "16"
        ],
        [
            "1"
        ],
        [
            "158"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "159"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "160"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "161"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "162"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "163"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "164"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "165"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "166"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "167"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "168"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "169"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "170"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "171"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "172"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "173"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "174"
        ],
        [
            "17"
        ],
        [
            "2"
        ],
        [
            "175"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "176"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "177"
        ],
        [
            "18"
        ],
        [
            "2"
        ],
        [
            "Malibay"
        ],
        [
            "178"
        ],
        [
            "19"
        ],
        [
            "2"
        ],
        [
            "Aurora Boulevard"
        ],
        [
            "179"
        ],
        [
            "19"
        ],
        [
            "2"
        ],
        [
            "Maricaban"
        ],
        [
            "180"
        ],
        [
            "19"
        ],
        [
            "2"
        ],
        [
            "Maricaban"
        ],
        [
            "181"
        ],
        [
            "19"
        ],
        [
            "2"
        ],
        [
            "Bayanihan"
        ],
        [
            "182"
        ],
        [
            "19"
        ],
        [
            "2"
        ],
        [
            "Villamor"
        ],
        [
            "183"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Villamor"
        ],
        [
            "184"
        ],
        [
            "19"
        ],
        [
            "2"
        ],
        [
            "Maricaban"
        ],
        [
            "185"
        ],
        [
            "19"
        ],
        [
            "2"
        ],
        [
            "Maricaban"
        ],
        [
            "186"
        ],
        [
            "19"
        ],
        [
            "2"
        ],
        [
            "Maricaban"
        ],
        [
            "187"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Don Carlos Village"
        ],
        [
            "188"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Don Carlos Village"
        ],
        [
            "189"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Don Carlos Village"
        ],
        [
            "190"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Don Carlos Village"
        ],
        [
            "191"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Domestic Airport"
        ],
        [
            "192"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Pildera Uno"
        ],
        [
            "193"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Pildera Dos"
        ],
        [
            "194"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Pildera Dos"
        ],
        [
            "195"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Sun Valley"
        ],
        [
            "196"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Sun Valley"
        ],
        [
            "197"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Baltao"
        ],
        [
            "198"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Rivera Village"
        ],
        [
            "199"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Rivera Village"
        ],
        [
            "200"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Kalayaan Village"
        ],
        [
            "201"
        ],
        [
            "20"
        ],
        [
            "1"
        ],
        [
            "Kalayaan Village"
        ],
        [
            "Populated places / barangays in Pasay"
        ],
        [
            "Apelo Cruz"
        ],
        [
            "Baclaran"
        ],
        [
            "Baltao"
        ],
        [
            "Bay City"
        ],
        [
            "Cabrera"
        ],
        [
            "Cartimar"
        ],
        [
            "Cuyegkeng"
        ],
        [
            "Don Carlos Village"
        ],
        [
            "Edang"
        ],
        [
            "F. B. Harrison"
        ],
        [
            "Juan Sumulong"
        ],
        [
            "Kalayaan"
        ],
        [
            "Leveriza"
        ],
        [
            "Libertad"
        ],
        [
            "Malibay"
        ],
        [
            "Manila Bay Reclamation"
        ],
        [
            "Marcela Marcelo"
        ],
        [
            "Maricaban"
        ],
        [
            "M. Dela Cruz"
        ],
        [
            "Newport City"
        ],
        [
            "Nichols"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pasay Rotonda"
        ],
        [
            "Philippine International Convention Center"
        ],
        [
            "Pildera I"
        ],
        [
            "Pildera II"
        ],
        [
            "Rivera Village"
        ],
        [
            "San Pablo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Rafael"
        ],
        [
            "San Roque"
        ],
        [
            "Santa Clara"
        ],
        [
            "Santo Niño"
        ],
        [
            "Tramo"
        ],
        [
            "Tripa de Gallina"
        ],
        [
            "Ventanilla"
        ],
        [
            "Villamor"
        ],
        [
            "Climate"
        ],
        [
            "Under the Köppen climate classification system, Pasay features a tropical savanna climate (Köppen climate classification Aw)."
        ],
        [
            "Climate data for Pasay (Ninoy Aquino International Airport) 1991–2024, extremes 1947–2024"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "35.8(96.4)"
        ],
        [
            "35.1(95.2)"
        ],
        [
            "36.5(97.7)"
        ],
        [
            "38.8(101.8)"
        ],
        [
            "38.2(100.8)"
        ],
        [
            "38.0(100.4)"
        ],
        [
            "36.4(97.5)"
        ],
        [
            "36.5(97.7)"
        ],
        [
            "35.6(96.1)"
        ],
        [
            "36.0(96.8)"
        ],
        [
            "35.8(96.4)"
        ],
        [
            "34.4(93.9)"
        ],
        [
            "38.2(100.8)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30.4(86.7)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "34.3(93.7)"
        ],
        [
            "34.2(93.6)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "30.5(86.9)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "28.4(83.1)"
        ],
        [
            "30.0(86.0)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "29.2(84.6)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "28.0(82.4)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "27.9(82.2)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.9(73.2)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "25.7(78.3)"
        ],
        [
            "26.3(79.3)"
        ],
        [
            "25.9(78.6)"
        ],
        [
            "25.2(77.4)"
        ],
        [
            "25.1(77.2)"
        ],
        [
            "25.1(77.2)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "14.8(58.6)"
        ],
        [
            "14.6(58.3)"
        ],
        [
            "16.0(60.8)"
        ],
        [
            "18.7(65.7)"
        ],
        [
            "19.1(66.4)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "18.3(64.9)"
        ],
        [
            "17.4(63.3)"
        ],
        [
            "19.1(66.4)"
        ],
        [
            "18.0(64.4)"
        ],
        [
            "17.2(63.0)"
        ],
        [
            "16.3(61.3)"
        ],
        [
            "14.6(58.3)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "11.5(0.45)"
        ],
        [
            "9.5(0.37)"
        ],
        [
            "10.3(0.41)"
        ],
        [
            "9.0(0.35)"
        ],
        [
            "57.1(2.25)"
        ],
        [
            "100.5(3.96)"
        ],
        [
            "158.7(6.25)"
        ],
        [
            "208.0(8.19)"
        ],
        [
            "159.2(6.27)"
        ],
        [
            "93.5(3.68)"
        ],
        [
            "76.2(3.00)"
        ],
        [
            "54.1(2.13)"
        ],
        [
            "947.6(37.31)"
        ],
        [
            "Average rainy days (≥ 0.1 mm)"
        ],
        [
            "3"
        ],
        [
            "3"
        ],
        [
            "3"
        ],
        [
            "3"
        ],
        [
            "7"
        ],
        [
            "11"
        ],
        [
            "16"
        ],
        [
            "16"
        ],
        [
            "16"
        ],
        [
            "11"
        ],
        [
            "8"
        ],
        [
            "8"
        ],
        [
            "105"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "74"
        ],
        [
            "71"
        ],
        [
            "68"
        ],
        [
            "66"
        ],
        [
            "72"
        ],
        [
            "78"
        ],
        [
            "83"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "81"
        ],
        [
            "78"
        ],
        [
            "77"
        ],
        [
            "77"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PasayYearPop.±% p.a.1903 8,201—    1918 18,697+5.65%1939 55,161+5.29%1948 88,728+5.42%1960 132,673+3.41%1970 206,283+4.51%1975 254,999+4.34%1980 287,770+2.45%1990 368,366+2.50%1995 408,610+1.96%2000 354,908−2.98%2007 403,064+1.77%2010 392,869−0.93%2015 416,522+1.12%2020 440,656+1.11%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Pasay"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "2006  5.30"
        ],
        [
            "2009  1.74"
        ],
        [
            "2012  1.94"
        ],
        [
            "2015  3.04"
        ],
        [
            "2018  2.06"
        ],
        [
            "2021  2.30"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Headquarters of Philippine Airlines"
        ],
        [
            "Philippine Airlines is headquartered in the Philippine National Bank Financial Center beside the World Trade Center Manila in Pasay."
        ],
        [
            "National government offices found in Pasay include: Senate of the Philippines, Department of Foreign Affairs (DFA), Civil Aviation Authority of the Philippines, Civil Aeronautics Board, Manila International Airport Authority, the Philippine Department of Trade and Industry's export promotions agency – the Center for International Trade Expositions and Missions (CITEM) – located in the International Trade Complex's Golden Shell Pavilion, and the Overseas Workers Welfare Administration (OWWA), Office for Transportation Security (OTS).",
            "The main office of the Philippine National Bank is located in the city."
        ],
        [
            "LBC Express headquarters is located at the Star Cruises Centre in the Newport Cybertourism Zone of Pasay."
        ],
        [
            "Government"
        ],
        [
            "This section relies largely or entirely upon a single source.",
            "Relevant discussion may be found on the talk page.",
            "Please help improve this article by introducing citations to additional sources at this section.",
            "(December 2020) (Learn how and when to remove this message)"
        ],
        [
            "Pasay City Hall"
        ],
        [
            "Local government"
        ],
        [
            "See also: Sangguniang Panglungsod"
        ],
        [
            "Pasay is governed primarily by the city mayor, the vice mayor, and the city councilors.",
            "The mayor acts as the chief executive of the city while the city councilors act as its legislative body.",
            "The vice mayor, besides taking on mayoral responsibilities in case of a temporary vacancy, acts as the presiding officer of the city legislature.",
            "The legislative body is composed of 12 regular members (6 per district) and representatives from the barangay and the youth council."
        ],
        [
            "Elected officials"
        ],
        [
            "Pasay city officials (2022-2025)"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "House of Representatives"
        ],
        [
            "Antonino G. Calixto"
        ],
        [
            "Lakas"
        ],
        [
            "City Mayor"
        ],
        [
            "Imelda G. Calixto-Rubiano"
        ],
        [
            "PFP"
        ],
        [
            "City Vice Mayor"
        ],
        [
            "Waldetrudes S. Del Rosario"
        ],
        [
            "Lakas"
        ],
        [
            "1st District"
        ],
        [
            "Mark Anthony A. Calixto"
        ],
        [
            "PDP"
        ],
        [
            "Mary Grace B. Santos"
        ],
        [
            "PDP"
        ],
        [
            "Marlon A. Pesebre"
        ],
        [
            "PDP"
        ],
        [
            "Ma.",
            "Antonia C. Cuneta"
        ],
        [
            "PDP"
        ],
        [
            "Albert Abraham Q. Alvina"
        ],
        [
            "PDP"
        ],
        [
            "Ricardo E. Santos"
        ],
        [
            "PDP"
        ],
        [
            "2nd District"
        ],
        [
            "Jose C. Isidro Jr."
        ],
        [
            "PDP"
        ],
        [
            "Editha Y. Manguerra"
        ],
        [
            "PDP"
        ],
        [
            "Donnabel M. Vendivel"
        ],
        [
            "PDP"
        ],
        [
            "Jennifer D. Panaligan"
        ],
        [
            "PDP"
        ],
        [
            "King Marlon A. Magat"
        ],
        [
            "PFP"
        ],
        [
            "Angelo Nicol P. Arceo"
        ],
        [
            "PDP"
        ],
        [
            "Ex officio City Council members"
        ],
        [
            "ABC President"
        ],
        [
            "Julie G. Gonzales"
        ],
        [
            "SK President"
        ],
        [
            "Jose Miguel A. Mañez"
        ],
        [
            "Sports"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(August 2021)"
        ],
        [
            "Pasay Sports Complex"
        ],
        [
            "Pasay is also home to sports venues such as the Cuneta Astrodome, SM Mall of Asia Arena, and Pasay Sports Complex.",
            "The SM Mall of Asia Arena also hosted some matches in the 2023 FIBA Basketball World Cup.",
            "The city has also been one of the venues of the 1981, 2005 and 2019 Southeast Asian Games."
        ],
        [
            "Some barangays in Pasay have a basketball court (including gymnasiums).",
            "Badminton courts and billiard halls are also built in the city."
        ],
        [
            "Pasay was once home to the Manila Polo Club until it was moved to Forbes Park, Makati in 1949."
        ],
        [
            "The city's only professional sports team is the Pasay Voyagers, which competes in the Maharlika Pilipinas Basketball League since its second season."
        ],
        [
            "Unity Run"
        ],
        [
            "On the list of largest running events in the world, based on the number of participants a record 209,000 registered running enthusiasts participated in 2012 Kahit Isang Araw Lang: Unity Run which started and ended at the SM Mall of Asia grounds."
        ],
        [
            "The second edition of the race surpassed the Guinness World record of 116,086 participants posted in the Run for the Pasig River on October 10, 2010."
        ],
        [
            "Transportation"
        ],
        [
            "Airport"
        ],
        [
            "The majority of Ninoy Aquino International Airport complex, also known as Nichols Field, is situated in Pasay, with the airport's terminals 2, 3, and 4, falling under the city's jurisdiction; Terminal 1, the international cargo terminal, and the offices of airport ground servicing companies, are under the jurisdiction of neighboring Parañaque.",
            "The city is also the home of the Philippine Air Force's headquarters, Villamor Airbase."
        ],
        [
            "Roads"
        ],
        [
            "Highways and main thoroughfares"
        ],
        [
            "View of Roxas Boulevard from the Libertad overpass"
        ],
        [
            "\"Pasay Rotonda\", the intersection of EDSA and Taft Avenue"
        ],
        [
            "Pasay is served by several highways and major thoroughfares.",
            "Epifanio delos Santos Avenue (EDSA/C-4 Road), Gil Puyat Avenue (Buendia Avenue) Roxas Boulevard, and Taft Avenue (R-2 Road) are the city's main thoroughfares.",
            "Secondary thoroughfares include Andrews Avenue, Antonio Arnaiz Avenue (formerly known as Libertad Street), Aurora Boulevard, Diosdado Macapagal Boulevard, Domestic Road, Harrison Street, Jose W. Diokno Boulevard, Ninoy Aquino Avenue, and NAIA Road (MIA Road)."
        ],
        [
            "Expressways"
        ],
        [
            "Four expressways serve Pasay and other parts of Metro Manila and Calabarzon: Skyway, an elevated expressway passing along the Pasay–Taguig boundary; South Luzon Expressway (SLEX), commonly called as SLEX and a component of Asian Highway 26, follows a similar route with Skyway, but runs directly below it, on the ground; NAIA Expressway, an elevated tolled expressway, serves Terminals 1, 2, and 3 of Ninoy Aquino International Airport; and the CAVITEX–C-5 Link, which connects Circumferential Road 5 (C-5) in Taguig to its extension across SLEX and eventually to the Manila–Cavite Expressway (CAVITEX)."
        ],
        [
            "Public transport"
        ],
        [
            "A bus plying Gil Puyat Avenue in Pasay"
        ],
        [
            "Jeepneys"
        ],
        [
            "Jeepneys ply the city's arterial roads, and serve the city's populated areas and nearby cities."
        ],
        [
            "Buses"
        ],
        [
            "Buses provide city (commuter) and provincial (intercity) operation on Pasay.",
            "Provincial bus terminals are mostly found near the Gil Puyat Station."
        ],
        [
            "Rail"
        ],
        [
            "This city is served by two railway lines, the LRT Line 1 and MRT Line 3.",
            "LRT Line 1 has four stations in Pasay, namely Gil Puyat (Buendia), Libertad, EDSA, Baclaran, and has a depot located along Andrews Avenue.",
            "MRT Line 3 has only one station, named Taft Avenue, which serves as an interchange with LRT Line 1."
        ],
        [
            "Other"
        ],
        [
            "Tricycles and pedicabs serve the barangays.",
            "Multicab services connect SM Mall of Asia with Baclaran in Parañaque, Buendia Avenue and Pasay Rotonda.",
            "Vans, especially UV Express, also provide service throughout the city and to other destinations in and around Metro Manila."
        ],
        [
            "Education"
        ],
        [
            "City University of Pasay"
        ],
        [
            "The Schools Division Office (SDO) of Pasay City operates 18 public elementary schools and 8 high schools.",
            "Its operations are divided into four districts: Pasay North, Pasay East, Pasay South, and Pasay West.",
            "Special education is provided by the Philippine School for the Deaf and Philippine National School for the Blind, Pasay SPED Center, and one Alternative Learning System (ALS) center.",
            "Numerous private schools, including Catholic and parochial schools, also operate in the city, like the St. Mary's Academy, operated by nuns of the Religious of the Virgin Mary."
        ],
        [
            "Colleges and universities"
        ],
        [
            "Pamantasan ng Lungsod ng Pasay (City University of Pasay)"
        ],
        [
            "National University - Mall of Asia"
        ],
        [
            "Manila Tytana Colleges"
        ],
        [
            "Asian Institute of Maritime Studies"
        ],
        [
            "Lacson College"
        ],
        [
            "Philippine Law School"
        ],
        [
            "Wesleyan College of Manila"
        ],
        [
            "Arellano University School of Law - Mabini Campus"
        ],
        [
            "Arellano University Jose Abad Santos Campus - Pasay Campus"
        ],
        [
            "Philippine State College of Aeronautics"
        ],
        [
            "Airlink International Aviation College"
        ],
        [
            "Manila Adventist College"
        ],
        [
            "Southeastern College"
        ],
        [
            "STI College Pasay-EDSA"
        ],
        [
            "San Juan de Dios College"
        ],
        [
            "International Electronics and Technical Institute Pasay"
        ],
        [
            "High schools"
        ],
        [
            "High schools in the city."
        ],
        [
            "Pasay City North High School – M. Dela Cruz Campus"
        ],
        [
            "Pasay City South High School"
        ],
        [
            "Pasay City East High School"
        ],
        [
            "Pasay City West High School"
        ],
        [
            "Pasay City National High School (formerly called Pasay City North High School – Tramo Campus)"
        ],
        [
            "Pasay City National Science High School"
        ],
        [
            "Kalayaan National High School"
        ],
        [
            "President Corazon “Cory” C. Aquino National High School"
        ],
        [
            "Diplomatic missions"
        ],
        [
            "Countries that have set up permanent diplomatic offices or embassies in the city include:"
        ],
        [
            " Japan"
        ],
        [
            " Latvia"
        ],
        [
            "Sister cities"
        ],
        [
            "Local"
        ],
        [
            " Las Piñas, Metro Manila"
        ],
        [
            " Parañaque, Metro Manila"
        ],
        [
            " Tacloban, Leyte"
        ],
        [
            "International"
        ],
        [
            " Union City, California, United States"
        ],
        [
            " Sacramento, California, United States"
        ],
        [
            " Jecheon, Chungcheongbuk-do, South Korea"
        ],
        [
            " Tainan, Taiwan"
        ],
        [
            "Notable personalities"
        ],
        [
            "Marcela Marcelo, Filipina Revolutionary General"
        ],
        [
            "Francisco Coching, National Artist of the Philippines for Visual Arts, comic book illustrator and writer"
        ],
        [
            "Juan Salcedo, Jr., National Scientist of the Philippines for Nutrition and Public Health"
        ],
        [
            "Ramon Jacinto, businessman, musician, and previous government official"
        ],
        [
            "Darwin Ramos, Servant of God, Filipino teenager"
        ],
        [
            "Alejandro D. Aclan, Catholic auxiliary bishop for the Archdiocese of Los Angeles"
        ],
        [
            "Eli Soriano, Filipino preacher and televangelist"
        ],
        [
            "Maricel Soriano, actress"
        ],
        [
            "Wilfred Steven Uytengsu, president and CEO of the Alaska Milk Corporation"
        ],
        [
            "Lisa Macuja-Elizalde, Filipino prima ballerina; in 1984, became the first Filipino and the first foreign soloist to join the Kirov Ballet"
        ],
        [
            "Anita Linda, Filipino film actress"
        ],
        [
            "Sharon Cuneta, Filipino singer, actress, and television host"
        ],
        [
            "Pablo Cuneta, Late ex-politician, father of Sharon Cuneta"
        ],
        [
            "John Lloyd Cruz, actor"
        ],
        [
            "Bernard Palanca, actor"
        ],
        [
            "Josephine Roberto, pop singer"
        ],
        [
            "Carl Guevara, actor and model"
        ],
        [
            "Chariz Solomon, Filipina actress and television personality"
        ],
        [
            "Nina Girado, pop/R&B singer, occasional songwriter, record producer, TV and radio personality at ABS-CBN"
        ],
        [
            "Maricel Laxa, Filipino comedian and actress"
        ],
        [
            "Vhong Navarro, comedian, dancer, member of Streetboys"
        ],
        [
            "Wacky Kiray, stand-up comedian and tv host"
        ],
        [
            "Diego Llorico, actor"
        ],
        [
            "Junna Tsukii, Filipino-Japanese karateka"
        ],
        [
            "King Girado, Filipino singer, musician, model, and actor"
        ],
        [
            "Michael DiGregorio, professional basketball player"
        ],
        [
            "Mike Cortez, professional basketball player"
        ],
        [
            "Rodney Brondial, professional basketball player"
        ],
        [
            "Ryan Araña, professional basketball player"
        ],
        [
            "Yousef Taha, professional basketball player"
        ],
        [
            "Silvia Celeste Cortesi, Filipino-Italian model and Miss Universe Philippines 2022"
        ],
        [
            "Jon Lucas, actor"
        ],
        [
            "Bong Tolentino, politician, former 2nd District Councilor"
        ],
        [
            "Fernando Lopez, former 3rd and 7th Vice President of the Philippines"
        ],
        [
            "Jose Feria, 109th Associate Justice of the Supreme Court of the Philippines"
        ],
        [
            "Gallery"
        ],
        [
            "STI College - Pasay"
        ],
        [
            "Pasay City General Hospital"
        ],
        [
            "Pasay City Cockpit"
        ],
        [
            "Sta.",
            "Clara Parish School (Pasay City)"
        ],
        [
            "The Heritage Hotel - Pasay"
        ],
        [
            "Bun Su Temple (文殊寺)"
        ],
        [
            "Chong Fu Temple (巴西巿包王府)"
        ],
        [
            "Pao Ong Kong Temple Pasay City  (巴西巿包王府)"
        ],
        [
            "Manuel Colayco monument in Derham Park"
        ],
        [
            "Roman Catholic Cemetery"
        ],
        [
            "See also"
        ],
        [
            "Philippines portal"
        ],
        [
            "Cuneta Astrodome"
        ],
        [
            "Bay City, Metro Manila"
        ],
        [
            "Parañaque"
        ],
        [
            "Baclaran"
        ],
        [
            "References"
        ],
        [
            "^  City of Pasay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"National Capital Region (NCR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b \"A Short History Behind the Name of Every Metro Manila City\".",
            "Esquire Magazine.",
            "October 21, 2019.",
            "Retrieved April 9, 2019."
        ],
        [
            "^ a b Roces, Alejandro (December 2, 2008).",
            "\"Aim High Pasay\".",
            "The Philippine Star.",
            "Retrieved April 9, 2024."
        ],
        [
            "^ a b c Salonga, Isayas (1934).",
            "Rizal Province directory.",
            "Vol. 1.",
            "Manila: University of Michigan Digital Collections.",
            "Retrieved April 20, 2024."
        ],
        [
            "^ a b Dery, Luis Camara (2001).",
            "A History of the Inarticulate.",
            "Quezon City: New Day Publishers.",
            "ISBN 978-971-10-1069-0."
        ],
        [
            "^ a b c Velasco, Melandrew (June 2019).",
            "Pasay: Rise of the Travel City (PDF).",
            "Media Touchstone Ventures, Inc. ISBN 978-621-8047-16-7.",
            "Retrieved April 12, 2024."
        ],
        [
            "^ Act No.",
            "227 (September 6, 1901), An Act Changing the Name of the Pueblo of Pineda, in the Province of Rizal, to That of Pasay, Lawyerly.ph, archived from the original on December 2, 2017, retrieved December 2, 2017"
        ],
        [
            "^ Act No.",
            "942 (October 12, 1903), An Act Reducing the Thirty-two Municipalities of the Province of Rizal to Fifteen, Lawyerly.ph, archived from the original on December 2, 2017, retrieved December 2, 2017"
        ],
        [
            "^ a b \"Historical Background\".",
            "DENR - Environment Management Bureau - National Capital Region.",
            "Archived from the original on April 2, 2017.",
            "Retrieved May 29, 2022."
        ],
        [
            "^ Executive Order No.",
            "400, s. 1942 (January 1, 1942), Creating the City of Greater Manila, archived from the original on July 1, 2022, retrieved August 24, 2022"
        ],
        [
            "^ Executive Order No.",
            "58, s. 1945 (July 26, 1945), Reducing the Territory of the City of Greater Manila, archived from the original on March 8, 2023, retrieved August 24, 2022"
        ],
        [
            "^ Republic Act No.",
            "183 (June 21, 1947), An Act Creating The Rizal City, archived from the original on October 14, 2018, retrieved April 3, 2018"
        ],
        [
            "^ Republic Act No.",
            "437 (June 7, 1950), An Act Changing the Name of Rizal City to Pasay City, archived from the original on January 28, 2018, retrieved April 3, 2018"
        ],
        [
            "^ Presidential Decree No.",
            "557 (September 21, 1974), \"Declaring All Barrios in The Philippines as Barangays, and For Other Purposes\", The LawPhil Project, Arellano Law Foundation, archived from the original on January 9, 2020, retrieved January 6, 2020"
        ],
        [
            "^ Presidential Decree No.",
            "824 (November 7, 1975), Creating the Metropolitan Manila and the Metropolitan Manila Commission and for Other Purposes, archived from the original on March 12, 2016, retrieved July 10, 2020"
        ],
        [
            "^ Requintina, Robert (August 2, 2016).",
            "\"PH eyes MOA or Philippine Arena as venue for Miss Universe 2016\".",
            "Tempo (in English and Filipino).",
            "Archived from the original on May 12, 2019.",
            "Retrieved August 2, 2016."
        ],
        [
            "^ Coorlim, Leif (May 16, 2013).",
            "\"Undercover journalists trawl Manila's seedy red light district\".",
            "CNN.",
            "Archived from the original on January 16, 2019.",
            "Retrieved January 31, 2019."
        ],
        [
            "^ \"Starter Guide To Manila Red Light District\".",
            "A Farang Abroad.",
            "Archived from the original on August 26, 2022.",
            "Retrieved January 31, 2019."
        ],
        [
            "^ \"Pasay to build new city hall\".",
            "Philstar.com.",
            "Archived from the original on May 26, 2023.",
            "Retrieved May 26, 2023."
        ],
        [
            "^ Fernando, Jean (April 15, 2021).",
            "\"Pasay gov't plans to build new city hospital\".",
            "Manila Bulletin.",
            "Archived from the original on April 15, 2021.",
            "Retrieved May 26, 2023."
        ],
        [
            "^ \"Pasay eyes new public hospital\".",
            "metronewscentral.net.",
            "Archived from the original on May 26, 2023.",
            "Retrieved May 26, 2023."
        ],
        [
            "^ \"Commission on Audit – Cities – NCR – Pasay City\".",
            "Philippine Statistics Authority.",
            "Archived from the original on August 7, 2017.",
            "Retrieved September 22, 2017."
        ],
        [
            "^ \"Enhancing Risk Analysis Capacities for Flood, Tropical Cyclone Severe Wind and Earthquake for the Greater Metro Manila Area Component 5 – Earthquake Risk Analysis\" (PDF).",
            "Philippine Institute of Volcanology and Seismology and Geoscience Australia.",
            "Archived (PDF) from the original on August 6, 2016.",
            "Retrieved May 16, 2016."
        ],
        [
            "^ a b \"City Profile\".",
            "Pasay City Government.",
            "Archived from the original on September 6, 2013.",
            "Retrieved December 5, 2012."
        ],
        [
            "^ \"SM Prime Receives Notice to Proceed for Pasay Reclamation Project\".",
            "SM Prime.",
            "Pasay City, Philippines.",
            "December 6, 2019.",
            "Retrieved April 20, 2024."
        ],
        [
            "^ \"City Government of Pasay - Citizen's Charter 2023 (5th Edition)\" (PDF).",
            "pasay.gov.ph.",
            "p. 11.",
            "Archived from the original on November 13, 2023.",
            "Retrieved November 13, 2023."
        ],
        [
            "^"
        ],
        [
            "\"NAIA Pasay City Climatological Normal Values\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on October 10, 2018.",
            "Retrieved October 10, 2018."
        ],
        [
            "^"
        ],
        [
            "\"NAIA Pasay Climatological Extremes\" (PDF).",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original (PDF) on October 10, 2018.",
            "Retrieved October 10, 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"National Capital Region (NCR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"National Capital Region (NCR)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"National Capital Region (NCR)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Metro Manila, 4th (Not a Province)\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ .",
            "Philippine Statistics Authority.",
            "June 4, 2020 https://psa.gov.ph/sites/default/files/Table%202a.%20Updated%20Annual%20Per%20Capita%20Poverty%20Threshold%2C%20Poverty%20Incidence%20and%20Magnitude%20of%20Poor%20Population%20with%20Measures%20of%20Precision%2C%20%20by%20Region%2C%20Province%20and%20HUC_2018.xlsx.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"About PAL Archived February 7, 2009, at the Wayback Machine.\"",
            "Philippine Airlines.",
            "Retrieved May 19, 2009."
        ],
        [
            "^ \"Call Center / Guest Services / Product Ideas Archived April 1, 2010, at the Wayback Machine.\"",
            "Cebu Pacific.",
            "Retrieved March 31, 2010."
        ],
        [
            "^ \"Contact Information Archived October 14, 2010, at the Wayback Machine.\"",
            "Interisland Airlines.",
            "Retrieved August 11, 2010."
        ],
        [
            "^ \"Privacy Policy Archived April 7, 2014, at the Wayback Machine.\"",
            "Oishi.",
            "Retrieved on April 5, 2014.",
            "\"Liwayway Marketing Corporation 2225 Tolentino St. Barangay 129, Pasay\""
        ],
        [
            "^ Calapre, Frank (January 23, 2012).",
            "\"Unity Run sets record participants\".",
            "The Manila Times.",
            "Archived from the original on April 29, 2012.",
            "Retrieved June 6, 2012."
        ],
        [
            "^ \"School links - Secondary\".",
            "School Division Office  - Pasay City.",
            "Retrieved November 12, 2023."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Pasay."
        ],
        [
            "Wikimedia Commons has media related to Pasay."
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            " Geographic data related to Pasay at OpenStreetMap"
        ],
        [
            "Places adjacent to Pasay"
        ],
        [
            "Manila"
        ],
        [
            "Manila Bay"
        ],
        [
            "Pasay"
        ],
        [
            "MakatiTaguig"
        ],
        [
            "Parañaque"
        ],
        [
            "Articles related to Pasay"
        ],
        [
            "vteMetro ManilaNational Capital Region of the PhilippinesManila (capital city)Administrative divisions"
        ],
        [
            "Caloocan"
        ],
        [
            "Las Piñas"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Pateros"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Barangays"
        ],
        [
            "Legislative districts"
        ],
        [
            "Geography"
        ],
        [
            "Manila Bay"
        ],
        [
            "Pasig River"
        ],
        [
            "Marikina River"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "Sierra Madre"
        ],
        [
            "La Mesa Watershed Reservation"
        ],
        [
            "Marikina Valley Fault System"
        ],
        [
            "Rivers and esteros"
        ],
        [
            "Islands"
        ],
        [
            "Parks"
        ],
        [
            "Beaches"
        ],
        [
            "Slums"
        ],
        [
            "Land reclamation"
        ],
        [
            "Bay City"
        ],
        [
            "Manggahan Floodway"
        ],
        [
            "Greater Manila Area"
        ],
        [
            "Mega Manila"
        ],
        [
            "Government"
        ],
        [
            "Metropolitan Manila Development Authority"
        ],
        [
            "Chairperson"
        ],
        [
            "Mayors"
        ],
        [
            "Governor (defunct)"
        ],
        [
            "History"
        ],
        [
            "Prehistory"
        ],
        [
            "Maynila"
        ],
        [
            "Tondo"
        ],
        [
            "Namayan"
        ],
        [
            "Intramuros"
        ],
        [
            "Province of Manila"
        ],
        [
            "Manila–Acapulco Galleon"
        ],
        [
            "Battles of La Naval de Manila"
        ],
        [
            "British occupation of Manila"
        ],
        [
            "1880 Luzon earthquakes"
        ],
        [
            "Cry of Pugad Lawin"
        ],
        [
            "Battle of Manila Bay"
        ],
        [
            "Battle of Manila (1899)"
        ],
        [
            "Province of Rizal"
        ],
        [
            "City of Greater Manila"
        ],
        [
            "Battle of Manila (1945)"
        ],
        [
            "Manila massacre"
        ],
        [
            "City of Man"
        ],
        [
            "People Power Revolution"
        ],
        [
            "World Youth Day 1995"
        ],
        [
            "Rehabilitation of the Pasig River"
        ],
        [
            "Rizal Day bombings"
        ],
        [
            "Typhoon Ketsana"
        ],
        [
            "COVID-19 pandemic"
        ],
        [
            "Timeline"
        ],
        [
            "Oldest buildings and structures"
        ],
        [
            "Cultural properties"
        ],
        [
            "Historical markers"
        ],
        [
            "Economy"
        ],
        [
            "Makati CBD"
        ],
        [
            "Ayala Avenue"
        ],
        [
            "Ortigas Center"
        ],
        [
            "Bonifacio Global City"
        ],
        [
            "Binondo"
        ],
        [
            "Escolta Street"
        ],
        [
            "Philippine Stock Exchange"
        ],
        [
            "Manila Commodity Exchange"
        ],
        [
            "Bangko Sentral ng Pilipinas"
        ],
        [
            "Manila Mint"
        ],
        [
            "Tourism"
        ],
        [
            "Attractions"
        ],
        [
            "Hotels"
        ],
        [
            "Gambling"
        ],
        [
            "Entertainment City"
        ],
        [
            "Mixed-use developments"
        ],
        [
            "Skyscrapers"
        ],
        [
            "Public services and utilities"
        ],
        [
            "Hospitals"
        ],
        [
            "Police"
        ],
        [
            "Manila Electric Company (Meralco)"
        ],
        [
            "Metropolitan Waterworks and Sewerage System"
        ],
        [
            "Water privatization"
        ],
        [
            "Manila Water Company"
        ],
        [
            "Maynilad Water Services"
        ],
        [
            "Pasig River Rehabilitation Commission"
        ],
        [
            "Laguna Lake Development Authority"
        ],
        [
            "Education"
        ],
        [
            "Colleges and universities"
        ],
        [
            "University Belt"
        ],
        [
            "Primary and secondary schools"
        ],
        [
            "International schools"
        ],
        [
            "Libraries"
        ],
        [
            "Culture"
        ],
        [
            "Annual events"
        ],
        [
            "Cemeteries"
        ],
        [
            "Cinemas"
        ],
        [
            "Museums"
        ],
        [
            "Public art"
        ],
        [
            "Religious buildings"
        ],
        [
            "Roman Catholic churches"
        ],
        [
            "Shopping malls"
        ],
        [
            "Songs about Manila"
        ],
        [
            "Manila sound"
        ],
        [
            "Sporting events"
        ],
        [
            "Sports venues"
        ],
        [
            "Theaters and concert halls"
        ],
        [
            "Art Deco theaters"
        ],
        [
            "Newspapers"
        ],
        [
            "Television stations"
        ],
        [
            "Radio stations"
        ],
        [
            "Transportation"
        ],
        [
            "Government"
        ],
        [
            "Department of Transportation (DOTr)"
        ],
        [
            "MMDA"
        ],
        [
            "LRTA"
        ],
        [
            "PNR"
        ],
        [
            "MIAA"
        ],
        [
            "Road"
        ],
        [
            "Bus routes"
        ],
        [
            "P2P routes"
        ],
        [
            "Intermodal terminals"
        ],
        [
            "Rail"
        ],
        [
            "LRT"
        ],
        [
            "MRT"
        ],
        [
            "Water"
        ],
        [
            "Port of Manila"
        ],
        [
            "Pasig River Ferry Service"
        ],
        [
            "Aviation"
        ],
        [
            "Traffic"
        ],
        [
            "Other topics"
        ],
        [
            "Imperial Manila"
        ],
        [
            "Nicknames of Manila"
        ],
        [
            "Notable Manileños"
        ],
        [
            "Sister cities"
        ],
        [
            "Metro Manila Dream Plan"
        ],
        [
            "Burnham Plan of Manila"
        ],
        [
            "Frost Plan of Quezon City"
        ],
        [
            "Outline"
        ],
        [
            "Index"
        ],
        [
            " Category"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "vte Philippines cities with a 100,000+ population2,000,000 and more"
        ],
        [
            "Quezon City (2,960,048)"
        ],
        [
            "1,000,000–1,999,999"
        ],
        [
            "Manila (1,846,513)"
        ],
        [
            "Davao City (1,776,949)"
        ],
        [
            "Caloocan (1,661,584)"
        ],
        [
            "Taguig (1,223,597)"
        ],
        [
            "500,000–999,999"
        ],
        [
            "Zamboanga City (977,234)"
        ],
        [
            "Cebu City (964,169)"
        ],
        [
            "Antipolo (887,399)"
        ],
        [
            "Pasig (803,159)"
        ],
        [
            "Cagayan de Oro (728,402)"
        ],
        [
            "Valenzuela (714,978)"
        ],
        [
            "Dasmariñas (703,141)"
        ],
        [
            "General Santos (697,315)"
        ],
        [
            "Parañaque (689,992)"
        ],
        [
            "Bacoor (664,625)"
        ],
        [
            "San Jose del Monte (651,813)"
        ],
        [
            "Las Piñas (606,293)"
        ],
        [
            "Bacolod (600,783)"
        ],
        [
            "Muntinlupa (543,445)"
        ],
        [
            "Calamba (539,671)"
        ],
        [
            "200,000–499,999"
        ],
        [
            "Lapu-Lapu City (497,604)"
        ],
        [
            "Imus (496,794)"
        ],
        [
            "Angeles City (462,928)"
        ],
        [
            "Iloilo City (457,626)"
        ],
        [
            "Marikina (456,059)"
        ],
        [
            "General Trias (450,583)"
        ],
        [
            "Pasay (440,656)"
        ],
        [
            "Mandaluyong (425,758)"
        ],
        [
            "Santa Rosa (414,812)"
        ],
        [
            "Biñan (407,437)"
        ],
        [
            "Tarlac City (385,398)"
        ],
        [
            "Malabon (380,522)"
        ],
        [
            "Lipa (372,931)"
        ],
        [
            "Butuan (372,910)"
        ],
        [
            "Baguio (366,358)"
        ],
        [
            "Mandaue (364,116)"
        ],
        [
            "Iligan (363,115)"
        ],
        [
            "Cabuyao (355,330)"
        ],
        [
            "San Fernando (Pampanga) (354,666)"
        ],
        [
            "Batangas City (351,647)"
        ],
        [
            "Cabanatuan (327,325)"
        ],
        [
            "San Pedro (326,001)"
        ],
        [
            "Cotabato City (325,079)"
        ],
        [
            "Puerto Princesa (307,079)"
        ],
        [
            "Tagum (296,202)"
        ],
        [
            "Mabalacat (293,244)"
        ],
        [
            "Makati (292,743)"
        ],
        [
            "San Pablo (285,348)"
        ],
        [
            "Lucena (278,924)"
        ],
        [
            "Talisay (Cebu) (263,048)"
        ],
        [
            "Malolos (261,189)"
        ],
        [
            "Olongapo (260,317)"
        ],
        [
            "Tacloban (251,881)"
        ],
        [
            "Navotas (247,543)"
        ],
        [
            "Ormoc (230,998)"
        ],
        [
            "Meycauayan (225,673)"
        ],
        [
            "Santo Tomas (218,500)"
        ],
        [
            "Valencia (Bukidnon) (216,546)"
        ],
        [
            "Trece Martires (210,503)"
        ],
        [
            "Pagadian (210,542)"
        ],
        [
            "Legazpi (209,533)"
        ],
        [
            "Panabo (209,230)"
        ],
        [
            "Naga (Camarines Sur) (209,170)"
        ],
        [
            "Toledo (207,314)"
        ],
        [
            "Marawi (207,010)"
        ],
        [
            "San Carlos (Pangasinan) (205,424)"
        ],
        [
            "Kabankalan (200,198)"
        ],
        [
            "100,000–199,999"
        ],
        [
            "Koronadal (195,398)"
        ],
        [
            "Bago (191,210)"
        ],
        [
            "Malaybalay (190,712)"
        ],
        [
            "Digos (188,376)"
        ],
        [
            "Calbayog (186,960)"
        ],
        [
            "Sorsogon City (182,237)"
        ],
        [
            "Roxas City (179,292)"
        ],
        [
            "Dagupan (174,302)"
        ],
        [
            "Surigao City (171,107)"
        ],
        [
            "Baliwag (168,470)"
        ],
        [
            "Tuguegarao (166,334)"
        ],
        [
            "Kidapawan (160,791)"
        ],
        [
            "Cadiz (158,544)"
        ],
        [
            "Ilagan (158,258)"
        ],
        [
            "Danao (156,321)"
        ],
        [
            "San Jose (Nueva Ecija) (150,917)"
        ],
        [
            "Sagay (148,894)"
        ],
        [
            "Santiago (148,580)"
        ],
        [
            "Mati (147,547)"
        ],
        [
            "Urdaneta (144,577)"
        ],
        [
            "Cauayan (143,403)"
        ],
        [
            "Calapan (145,786)"
        ],
        [
            "Tabaco (140,961)"
        ],
        [
            "Ozamis (140,443)"
        ],
        [
            "Dipolog (138,141)"
        ],
        [
            "Gingoog (136,698)"
        ],
        [
            "Carcar (136,453)"
        ],
        [
            "Dumaguete (134,103)"
        ],
        [
            "Naga (Cebu) (133,184)"
        ],
        [
            "San Carlos (Negros Occidental) (132,650)"
        ],
        [
            "Silay (130,478)"
        ],
        [
            "Isabela (Basilan) (130,379)"
        ],
        [
            "San Juan (Metro Manila) (126,347)"
        ],
        [
            "San Fernando (La Union) (125,640)"
        ],
        [
            "Gapan (122,968)"
        ],
        [
            "Bayawan (122,747)"
        ],
        [
            "Tabuk (121,033)"
        ],
        [
            "Ligao (118,096)"
        ],
        [
            "Samal (Davao del Norte) (116,771)"
        ],
        [
            "Himamaylan (116,240)"
        ],
        [
            "Iriga (114,457)"
        ],
        [
            "Tayabas (112,658)"
        ],
        [
            "Baybay (111,848)"
        ],
        [
            "Laoag (111,651)"
        ],
        [
            "Tacurong (109,319)"
        ],
        [
            "Talisay (Negros Occidental) (108,909)"
        ],
        [
            "Catbalogan (106,440)"
        ],
        [
            "Carmona (106,256)"
        ],
        [
            "Tagbilaran (104,976)"
        ],
        [
            "Masbate City (104,522)"
        ],
        [
            "Balanga (104,173)"
        ],
        [
            "Guihulngan (102,656)"
        ],
        [
            "Cavite City (100,674)"
        ],
        [
            "Lamitan (100,150)"
        ],
        [
            "vteLargest cities in LuzonPSA Census May 2020"
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            " Pop."
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            " Pop."
        ],
        [
            "Quezon CityManila"
        ],
        [
            "1"
        ],
        [
            "Quezon City"
        ],
        [
            "National Capital Region"
        ],
        [
            "2,960,048"
        ],
        [
            "11"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Central Luzon"
        ],
        [
            "651,813"
        ],
        [
            "CaloocanAntipolo"
        ],
        [
            "2"
        ],
        [
            "Manila"
        ],
        [
            "National Capital Region"
        ],
        [
            "1,846,513"
        ],
        [
            "12"
        ],
        [
            "Makati"
        ],
        [
            "National Capital Region"
        ],
        [
            "629,616"
        ],
        [
            "3"
        ],
        [
            "Caloocan"
        ],
        [
            "National Capital Region"
        ],
        [
            "1,661,584"
        ],
        [
            "13"
        ],
        [
            "Las Piñas"
        ],
        [
            "National Capital Region"
        ],
        [
            "606,293"
        ],
        [
            "4"
        ],
        [
            "Antipolo"
        ],
        [
            "Calabarzon"
        ],
        [
            "887,399"
        ],
        [
            "14"
        ],
        [
            "Muntinlupa"
        ],
        [
            "National Capital Region"
        ],
        [
            "543,445"
        ],
        [
            "5"
        ],
        [
            "Taguig"
        ],
        [
            "National Capital Region"
        ],
        [
            "886,722"
        ],
        [
            "15"
        ],
        [
            "Calamba"
        ],
        [
            "Calabarzon"
        ],
        [
            "539,671"
        ],
        [
            "6"
        ],
        [
            "Pasig"
        ],
        [
            "National Capital Region"
        ],
        [
            "803,159"
        ],
        [
            "16"
        ],
        [
            "Imus"
        ],
        [
            "Calabarzon"
        ],
        [
            "496,794"
        ],
        [
            "7"
        ],
        [
            "Valenzuela"
        ],
        [
            "National Capital Region"
        ],
        [
            "714,978"
        ],
        [
            "17"
        ],
        [
            "Angeles"
        ],
        [
            "Central Luzon"
        ],
        [
            "462,928"
        ],
        [
            "8"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Calabarzon"
        ],
        [
            "703,141"
        ],
        [
            "18"
        ],
        [
            "Marikina"
        ],
        [
            "National Capital Region"
        ],
        [
            "456,059"
        ],
        [
            "9"
        ],
        [
            "Parañaque"
        ],
        [
            "National Capital Region"
        ],
        [
            "689,992"
        ],
        [
            "19"
        ],
        [
            "General Trias"
        ],
        [
            "Calabarzon"
        ],
        [
            "450,583"
        ],
        [
            "10"
        ],
        [
            "Bacoor"
        ],
        [
            "Calabarzon"
        ],
        [
            "664,625"
        ],
        [
            "20"
        ],
        [
            "Pasay"
        ],
        [
            "National Capital Region"
        ],
        [
            "440,656"
        ],
        [
            "Authority control databases National"
        ],
        [
            "Israel"
        ],
        [
            "Czech Republic"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pasay&oldid=1234441530\""
        ],
        [
            "Categories: PasayCities in Metro ManilaPopulated places on Manila BayPopulated places established in 18631863 establishments in the PhilippinesHighly urbanized cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 foreign language sources (ISO 639-2)CS1 maint: numeric names: authors listCS1 errors: missing titleCS1 errors: bare URLWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from May 2012Pages using multiple image with auto scaled imagesCoordinates on WikidataArticles containing Filipino-language textPages with Tagalog IPAAll articles with unsourced statementsArticles with unsourced statements from November 2020Articles needing additional references from February 2022All articles needing additional referencesArticles needing additional references from July 2019Wikipedia articles needing clarification from September 2023Articles needing additional references from December 2020Articles to be expanded from August 2021All articles to be expandedArticles using small message boxesArticles with unsourced statements from January 2017Commons category link from WikidataOfficial website different in Wikidata and WikipediaPages using largest cities with nav classArticles with J9U identifiersArticles with NKC identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}