{
    "name": "Passi",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Passi, Iloilo"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°06′N 122°38′E﻿ / ﻿11.1°N 122.63°E﻿ / 11.1; 122.63"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Component city in Iloilo, Philippines"
        ],
        [
            "This article has multiple issues.",
            "Please help improve it or discuss these issues on the talk page.",
            "(Learn how and when to remove these template messages)"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Passi, Iloilo\" – news · newspapers · books · scholar · JSTOR (February 2013) (Learn how and when to remove this message)"
        ],
        [
            "This article is written like a travel guide.",
            "Please help improve the article by introducing an encyclopedic style or move the content to Wikivoyage.",
            "(January 2020)"
        ],
        [
            "This article contains content that is written like an advertisement.",
            "Please help improve it by removing promotional content and inappropriate external links, and by adding encyclopedic content written from a neutral point of view.",
            "(January 2020) (Learn how and when to remove this message)"
        ],
        [
            " (Learn how and when to remove this message)"
        ],
        [
            "Component city in Western Visayas, PhilippinesPassiComponent cityCity of Passi(From top, left to right): Passi Church, Public Market, Downtown"
        ],
        [
            "FlagSealNickname(s): \"The Sweet City at The Heart of Panay\"Map of Iloilo with Passi highlightedOpenStreetMapPassiLocation within the PhilippinesCoordinates: 11°06′N 122°38′E﻿ / ﻿11.1°N 122.63°E﻿ / 11.1; 122.63CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "4th districtFounded1766CityhoodMarch 14, 1998Barangays51"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorStephen A. Palmares • Vice MayorElyzer C. Chavez • RepresentativeFerjenel G. Biron • City Council"
        ],
        [
            "Members"
        ],
        [
            "Mario A. Hidalgo, IIIBonifacio P. BarberoPaul Girard A. PanesRenz Carlo P. PalmaPhoebe S. PalomoRamon Andrei P. PantinJoe Divin M. PalenciaRamon Julian P. MasnaRobert P. Brown, Jr.Jinky D. Palmares"
        ],
        [
            " • Electorate56,395 voters (2022)Area • Revenue₱ 748.1 million (2020) • Assets₱ 2,516 million (2020) • Expenditure₱ 728.8 million (2020)Service provider • ElectricityIloilo 2 Electric Cooperative (ILECO 2)Time zoneUTC+8 (PST)ZIP code5037PSGC063035000IDD : area code +63 (0)33Native languagesKaray-a Hiligaynon Capisnon Ati TagalogWebsitewww.passicity.gov.ph"
        ],
        [
            "Passi, officially known as the City of Passi (Kinaray-a: Syudad kang Passi/Syudad ka Passi; Hiligaynon: Dakbanwa sang Passi; Filipino: Lungsod ng Passi), is a 4th class component city in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 88,873 people."
        ],
        [
            "Passi covers a total land area of 25,139 hectares (62,120 acres), comprising 5.39% of the provincial land area of Iloilo.",
            "Its terrain is predominantly flat, extending along the Jalaur and Lamunan Rivers, with mountainous regions situated in the northern part of the city.",
            "Known for its agricultural richness, Passi boasts significant yields of rice, pineapple, and sugar, earning it the moniker \"The Sweet City at The Heart of Panay\" due to its annual fruit production.",
            "It holds the distinction of being the only component city in the Province of Iloilo, and ranks as the largest in terms of land area and income, and second only to Oton in population size."
        ],
        [
            "History"
        ],
        [
            "Passi holds historical significance as one of the oldest Spanish settlements in Iloilo.",
            "Established as a pueblo (community settlement of natives) in 1766, it appointed Don Martin Saligumba as its inaugural gobernadorcillo.",
            "Prior to Spanish colonization, the area was inhabited by three Malay brothers named Dig-on, Tokiab, and Umawang."
        ],
        [
            "Popular Legend"
        ],
        [
            "According to local legend, the name \"Passi\" has its roots in an interaction between Spanish conquistadors and an indigenous resident.",
            "As the story goes, while wandering near a riverbank, the conquistadors encountered an elderly woman winnowing pounded rice in a small hut.",
            "Unable to communicate due to the language barrier, one of the conquistadors inquired about their location.",
            "Misinterpreting the question, the woman responded with \"Ah, pasi,\" which in her language meant \"rice,\" assuming they were asking about the contents of her basket.",
            "Following this encounter, the Spanish settlers adopted the name Pasi for the location, which eventually transformed into the present-day name of Passi.",
            "Similar narratives surrounding the origins of place names are prevalent in various towns and cities across the Philippines.",
            "These tales typically involve Spanish explorers seeking the name of a location from non-Spanish speaking natives and adopting their response as the name."
        ],
        [
            "According to historical accounts, the initial Spanish settlement in the area dates back to 1766.",
            "Legend has it that Spanish explorers arrived in Ansig, situated at the mouth of the Lamunan River.",
            "The establishment of the current poblacion (town center) of Passi is credited to Don Martin Saligumba."
        ],
        [
            "Development and Later History"
        ],
        [
            "In 1957, the sitio of Agtabo within Passi was officially recognized as a barrio, formerly part of the barrio (district) of Salngan."
        ],
        [
            "Passi experienced significant development during this period, becoming a center for trade and commerce due to its strategic location.",
            "This growth attracted more investment to the municipality, resulting in increased income, population, and territorial expansion.",
            "As a result, Passi was recognized as the first component city in the Island of Panay.",
            "On January 30, 1998, President Fidel V. Ramos signed R.A. 8469, officially converting Passi into a city."
        ],
        [
            "Historical Notes About Passi"
        ],
        [
            "Passi served as the pre-war capital of Iloilo Province from January 1942 to April 16, 1942, until the arrival of the Japanese Occupation Force."
        ],
        [
            "Passi was designated as the quartermaster depot of United States Army Forces in the Far East (USAFFE) for supplying food to the army that resisted in Bataan through Capiz."
        ],
        [
            "The central school served as the seat of the provincial government offices, including the Agricultural and Industrial Bank and the Philippine National Bank, prior to the Japanese landing in Panay."
        ],
        [
            "Passi housed the initial warehouse of the Compania General de Tabacos de Filipinas in Central Panay, which was later repurposed as the Roman Catholic Church.",
            "Additionally, it served as the warehouse for the United States Army Forces in the Far East (USAFE) for storing food supplies destined for Corregidor and Bataan."
        ],
        [
            "During the war years, Ibajay Cave and the mountain northeast of the poblacion served as the headquarters of the Municipal Resistance Government under the leadership of Mayor Filoteo Palmares and Municipal Treasurer Pedro Oro."
        ],
        [
            "Passi Central Elementary School (now Passi I Central School) had the first clean ground in the province before the war."
        ],
        [
            "One of the earliest regional high schools established in Iloilo was founded in Passi shortly after liberation.",
            "It acquired a vast site of 12 hectares, making it one of the first to do so.",
            "The athletic field, carved from a hill and meticulously prepared by Mayor Palmares, was leveled and enhanced in time for the Unit Athletic Meet held between 1949 and 1959, which was noted for its grandeur."
        ],
        [
            "Passi holds a historical record for hosting the First Provincial Athletic Meet in the interior before the war.",
            "It sustained athletic delegations from various towns in Iloilo generously, with surplus meat and cattle heads sold to support the athletic fund.",
            "This accomplishment remains unmatched in the history of athletic meets in Iloilo."
        ],
        [
            "Passi has a tradition of hospitality deeply rooted in Filipino customs.",
            "The city's efforts in welcoming visitors, including individual guests, visiting teams, and delegations, are noteworthy.",
            "They are known for generously providing abundant food and beverages, symbolizing their warm hospitality."
        ],
        [
            "Before the war, Passi possessed the largest cattle ranch in Panay due to its extensive grazing land."
        ],
        [
            "During the war, Passi served as a significant supplier of meat for the army and a major source of rice and corn for the sustenance of guerrilla forces and the Provincial Guards of the Civil Resistance Movement of Free Panay and Romblon Gov.",
            "Tomas Confesor."
        ],
        [
            "During the Spanish colonial period, Passi was inhabited by affluent families who resided outside of Iloilo City."
        ],
        [
            "In 1998, Passi achieved the status of being the first component city of Iloilo."
        ],
        [
            "Geography"
        ],
        [
            "Downtown Passi City, 2023"
        ],
        [
            "The City of Passi is located in the central region of Panay along the New Iloilo-Capiz Highway.",
            "It is 50 kilometres (31 mi) from Iloilo City and 66 kilometres (41 mi) from Roxas City."
        ],
        [
            "The City of Passi shares borders with Dumarao to the north, San Rafael to the east, San Enrique to the southeast, Dueñas to the south, Calinog to the west, and Bingawan to the northwest."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Passi"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "57(2.2)"
        ],
        [
            "37(1.5)"
        ],
        [
            "41(1.6)"
        ],
        [
            "42(1.7)"
        ],
        [
            "98(3.9)"
        ],
        [
            "155(6.1)"
        ],
        [
            "187(7.4)"
        ],
        [
            "162(6.4)"
        ],
        [
            "179(7.0)"
        ],
        [
            "188(7.4)"
        ],
        [
            "114(4.5)"
        ],
        [
            "78(3.1)"
        ],
        [
            "1,338(52.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.0"
        ],
        [
            "7.7"
        ],
        [
            "9.2"
        ],
        [
            "10.2"
        ],
        [
            "19.5"
        ],
        [
            "24.6"
        ],
        [
            "26.9"
        ],
        [
            "25.1"
        ],
        [
            "25.5"
        ],
        [
            "25.2"
        ],
        [
            "18.0"
        ],
        [
            "13.0"
        ],
        [
            "216.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Passi, akin to many inland areas in Iloilo, lacks a distinct rainy season or pronounced maximum rainfall period.",
            "While it does encounter typhoons occasionally, they are not prevalent phenomena in the region."
        ],
        [
            "Rivers and Mountains"
        ],
        [
            "The city is intersected by five significant rivers: the Jalaur, Lamunan, Hin-ayan, Asisig, and Maliao.",
            "Additionally, it possesses various creeks and tributaries that can be utilized for irrigation needs."
        ],
        [
            "Geographically, Passi is characterized by rolling hills and narrow valley plains.",
            "It is flanked by Mount Cañapasan and Mount Bayoso."
        ],
        [
            "Barangays"
        ],
        [
            "Passi City is divided into 51 barangays, each comprising puroks, with some containing sitios."
        ],
        [
            "Presently, Passi City comprises 11 urban barangays and 38 rural barangays, with 2 located within the city proper barangays.",
            "These are organized into 4 geographical districts."
        ],
        [
            "Barangays Poblacion Ilawod and Ilaya are among the most urbanized areas in Passi City, constituting its city proper.",
            "The downtown area is predominantly located within Poblacion Ilawod.",
            "Dorillo Street acts as the dividing line between the two barangays, with Poblacion Ilaya occupying the western portion and Poblacion Ilawod occupying the eastern part.",
            "Historically, Barangay Poblacion Ilawod served as the political hub of Passi when it was still a municipality.",
            "However, upon Passi's cityhood proclamation in 1998, the new city hall and government center were relocated to Barangay Sablogon."
        ],
        [
            "The City of Passi is part of the 4th District of Iloilo."
        ],
        [
            "Below are the population figures for each barangay as recorded in the 2010 census."
        ],
        [
            "Agdahon - 1,466"
        ],
        [
            "Agdayao - 1,284"
        ],
        [
            "Aglalana - 3,335"
        ],
        [
            "Agtabo - 1,721"
        ],
        [
            "Agtambo - 1,174"
        ],
        [
            "Alimono - 2,738"
        ],
        [
            "Arac - 1,429"
        ],
        [
            "Ayuyan - 634"
        ],
        [
            "Bacuranan - 1,101"
        ],
        [
            "Bagacay - 863"
        ],
        [
            "Batu - 1,328"
        ],
        [
            "Bayan - 687"
        ],
        [
            "Bitaogan - 2,051"
        ],
        [
            "Buenavista - 530"
        ],
        [
            "Buyo - 761"
        ],
        [
            "Cabunga - 1,246"
        ],
        [
            "Cadilang - 929"
        ],
        [
            "Cairojan - 1,210"
        ],
        [
            "Dalicanan - 2,039"
        ],
        [
            "Gemat-y - 1,055"
        ],
        [
            "Gemumua-Agahon - 3,711"
        ],
        [
            "Gegacjac - 526"
        ],
        [
            "Gines Viejo - 1,945"
        ],
        [
            "Imbang Grande - 2,227"
        ],
        [
            "Jaguimitan - 2,653"
        ],
        [
            "Libo-o - 684"
        ],
        [
            "Maasin - 806"
        ],
        [
            "Magdungao - 2,248"
        ],
        [
            "Malag-it Grande - 701"
        ],
        [
            "Malag-it Pequeño - 276"
        ],
        [
            "Mambiranan Grande - 576"
        ],
        [
            "Mambiranan Pequeño - 580"
        ],
        [
            "Man-it - 4,295"
        ],
        [
            "Mantulang - 515"
        ],
        [
            "Mulapula - 1,458"
        ],
        [
            "Nueva Union - 2,265"
        ],
        [
            "Pangi - 767"
        ],
        [
            "Pagaypay - 567"
        ],
        [
            "Poblacion Ilawod - 6,559"
        ],
        [
            "Poblacion Ilaya - 3,473"
        ],
        [
            "Punong - 374"
        ],
        [
            "Quinagaringan Grande - 1,187"
        ],
        [
            "Quinagaringan Pequeño - 1,011"
        ],
        [
            "Sablogon - 1,849"
        ],
        [
            "Salngan - 2,826"
        ],
        [
            "Santo Tomas - 2,061"
        ],
        [
            "Sarapan - 1,048"
        ],
        [
            "Tagubong - 2,048"
        ],
        [
            "Talongonan - 1,440"
        ],
        [
            "Tubod - 862"
        ],
        [
            "Tuburan - 544"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PassiYearPop.±% p.a.1903 7,578—    1918 26,988+8.84%1939 28,060+0.19%1948 30,918+1.08%1960 26,945−1.14%1970 35,288+2.73%1975 43,755+4.41%1980 47,988+1.86%1990 57,701+1.86%1995 59,539+0.59%2000 69,601+3.40%2007 76,045+1.23%2010 79,663+1.71%2015 80,544+0.21%2020 88,873+1.95%Source: Philippine Statistics Authority"
        ],
        [
            "Residents of Passi are commonly referred to as Passinhons.",
            "The predominant language spoken in Passi and its surrounding areas is Kinaray-a.",
            "Additionally, residents are proficient in Hiligaynon, Capiznon, Tagalog, and English as secondary languages."
        ],
        [
            "Language"
        ],
        [
            "Main article: Kinaray-a language"
        ],
        [
            "The primary language spoken in Passi City is Kinaray-a.",
            "English serves as the language of commerce and education.",
            "Additionally, residents use local dialects like Hiligaynon, as well as languages such as Capiznon and Tagalog.",
            "Some older generations and affluent families may incorporate Spanish words into their Kinaray-a conversations.",
            "Moreover, descendants of families with ties to sugar plantations may blend Spanish and Kinaray-a in their speech."
        ],
        [
            "Religion"
        ],
        [
            "The majority of Passinhon people adhere to Roman Catholicism.",
            "Protestant denominations, including the Philippine Independent Church or Aglipayan Church, as well as Baptist, Presbyterian, Methodist, Adventist, and Evangelical Christian churches, are also practiced.",
            "Additionally, other Christian sects present in Passi City include the Iglesia Ni Cristo, Church of Christ of Latter-Day Saints, and Jehovah's Witnesses."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Passi"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  36.50"
        ],
        [
            "2009  24.45"
        ],
        [
            "2012  25.12"
        ],
        [
            "2015  23.25"
        ],
        [
            "2018  21.11"
        ],
        [
            "2021  23.01"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agriculture"
        ],
        [
            "Passi possesses favorable physical resources, including fertile soil along rolling hills and narrow valley plains, abundant surface and groundwater, and a climate without distinct dry and wet seasons.",
            "These conditions are conducive to cultivating various agricultural products such as rice, sugarcane, and pineapple.",
            "In response to fluctuations in the sugar industry, local farmers have diversified into other crops such as corn, pineapple, mongo, root crops, and other farm-based products.",
            "The city also presents investment opportunities for agri-industrial developments."
        ],
        [
            "Passi is classified as a 4th class component city with an annual income for this year consisting of P300,860,719 in General Income, P26,732,922 in Special Educational Fund, and P37,287,853 in Trust Fund, resulting in a total current operating income of P364,881,424."
        ],
        [
            "Passi City has historically served as a significant hub for agricultural and industrial activities, particularly as the District Agri-Industrial Center of Iloilo.",
            "Its strategic location in the province has contributed to its importance, boasting three sugar centrals and abundant agricultural resources.",
            "The city's economy relies heavily on agriculture, with a diverse range of crops including rice, corn, vegetables, coconut, sugarcane, and pineapple.",
            "Notably, Passi City has been a major pineapple producer for years and has also been recognized for its involvement in other industries such as fruit processing, wallboard production, metalworking, and cut-flower propagation.",
            "Locally made products like pineapple wine, jam, and fruit preserves have gained recognition through participation in various trade fairs and exhibitions, including the annual Fiesta in the City celebration in May, TUMANDOK in September, and WOW Philippines: the Best of the Region."
        ],
        [
            "Passi, designated as a component city under Republic Act No.",
            "8469 signed by President Fidel Valdez Ramos on January 30, 1998, is geographically bordered by San Enrique to the north, Dumarao in Capiz to the south, Calinog to the east, and Lemery to the west.",
            "Characterized by predominantly mountainous terrain, it is administratively divided into 51 barangays.",
            "Passi encompasses a land area of 25,139 hectares or 251.39 square kilometers, making it the largest city in the province in terms of land area."
        ],
        [
            "Industrial development is a key focus area for the local government, given Passi's designation as one of the five Agro-Industrial districts in the province.",
            "It serves as the site for the People's Industrial Enterprise (PIE's) District Agro-Industrial Center (DAIC) in the 4th District.",
            "The PIE's / DAIC's play a crucial role in providing intermediate processing of locally sourced raw materials for final processing at the DAIC.",
            "Additionally, they facilitate the manufacturing of finished goods, leveraging cooperative advantages to make manufacturing activities economically viable."
        ],
        [
            "Attractions in Passi City encompass a variety of sites, including extensive pineapple plantations, cock farms, the Baroque Church of Saint William the Hermit, the historic Muscovado Chimney, the Chameleon Butterfly Garden, the Amorotic caves of Barangay Magdungao, scenic highway vistas offering captivating sunset views, and the aging Railway Bridge spanning the Jalaur River, which warrants preservation efforts and attention."
        ],
        [
            "In response to a surge in reported crimes during 2010 to 2011, Passi City recently installed closed-circuit television (CCTV) cameras along city proper roads, national highways, the public market, major establishments, the hospital, the bus terminal, certain political subdivision boundaries, and other strategic areas."
        ],
        [
            "Banking"
        ],
        [
            "Passi City serves as a significant trade and business hub outside Metro Iloilo, hosting several banking institutions that cater to the city and its surrounding municipalities."
        ],
        [
            "Retail"
        ],
        [
            "As a component city of Iloilo Province, Passi serves as a significant shopping destination outside the provincial capital city."
        ],
        [
            "Gaisano Capital Passi is the first shopping mall established in Passi.",
            "It features a comprehensive range of offerings including grocery and department stores, as well as leased spaces for other businesses."
        ],
        [
            "CityMall (Philippines) Commercial Centers Inc. has opened its doors in Passi City, conveniently situated at the front of Passi City Bus Terminal along the Iloilo-Capiz New Route."
        ],
        [
            "Power and Energy"
        ],
        [
            "Power distribution in Passi City and neighboring towns, including Dueñas, San Enrique, and Calinog, is managed by Iloilo Electric Cooperative II (ILECO II)."
        ],
        [
            "In August 2022, MORE Power, a power distributor serving Iloilo City, received official approval to extend its services to Passi City and sixteen other municipalities in the province."
        ],
        [
            "Water Supply"
        ],
        [
            "Water distribution in Passi City proper and neighboring barangays is facilitated by Balibago Waterworks System Inc."
        ],
        [
            "Communications"
        ],
        [
            "Passi City offers a range of communication services, including telephone services for domestic and international direct dialing, mobile communications, internet access, cable television, and postal services."
        ],
        [
            "Passi City is serviced by three telephone service providers, namely the Philippine Long Distance Telephone Company (PLDT), Globe Telecom, and Panay Telephone Corporation (PANTELCO).",
            "These companies offer landline connections to numerous households, offices, and establishments in the area."
        ],
        [
            "Passi City is served by two cellular companies, namely Smart Communications and Globe Telecom, providing cellular telephone facilities to residents and businesses in the area."
        ],
        [
            "Television Stations"
        ],
        [
            "Kalibo Cable TV Inc. (formerly Milkyway Cablevision Services, Inc. or MCSI) provides local cable TV services to Passi, San Enrique, Dueñas, and Dingle.",
            "It offers 74 national and international television channels, along with one local channel (Milkyway Community Channel) featuring local programming and talk shows.",
            "One of its notable programs is Talking Point, where individuals or organizations are interviewed on topics relevant to Passi City.",
            "This program is also broadcast live on Facebook via the page Good Morning Passi."
        ],
        [
            "Cignal HD TV is available in the area, offering wireless, direct-to-satellite signals for viewing both local and international channels."
        ],
        [
            "Local antennas can receive signals from local channels such as GMA7, ABS-CBN, TV5, and PTV4."
        ],
        [
            "Print media"
        ],
        [
            "The Passinhon Times serves as the official publication of the City of Passi."
        ],
        [
            "Culture"
        ],
        [
            "Pintados de Pasi"
        ],
        [
            "Main article: Pintados de Pasi"
        ],
        [
            "The Pintados de Pasi Festival, inaugurated in March 1998 to commemorate Passi City's attainment of cityhood, stands as a significant cultural celebration in the heart of Iloilo province.",
            "Over the years, it has evolved into one of the most renowned festivals in the Visayan region, deeply ingrained in the local community's identity.",
            "The festival draws large crowds, with its highlight being theatrical street dancing performances characterized by vigorous and dynamic movements.",
            "Participants adorned in traditional body tattoos, featuring intricate geometrical designs, depict ancestral narratives that showcase the area's heritage and way of life."
        ],
        [
            "The festival's dances, distinguished by robust and dynamic movements, appear to have originated organically within the local culture, devoid of external influences such as combat dances, folk plays, ritual actions, or specific character types.",
            "Sustaining such a festival relies heavily on historical and cultural sources, which serve as foundational materials preserving the authenticity and significance of the event."
        ],
        [
            "The island's initial inhabitants referred to it as Aninipay, named after the prevalent plant species in the region.",
            "Subsequently, with the arrival of the Malayans, the island was renamed Madia-as, after its highest peak."
        ],
        [
            "Contrary to common knowledge, the initial group of Spaniards who arrived on the island bestowed a different title upon it, naming it \"Isla de Pintados\" upon encountering tattooed individuals whom they referred to as \"pintados\" or \"painted people.\"",
            "Tattooing was a widespread custom across the island, as detailed by chronicler Miguel de Loarca in his account in Historia Pre-Hispanica de Filipinas Sobre la Isla de Panay."
        ],
        [
            "Culturally, the residents of Panay employed tattoos as a means to showcase their combat achievements.",
            "A man's status as a warrior was often determined by the number of tattoo marks adorning his body.",
            "The refinement of the pintado tradition elevated tattooing to an art form, characterized by meticulous order, symmetry, and coordination, eliciting admiration from observers."
        ],
        [
            "In traditional Panay society, while men adorned their bodies with tattoos extensively, there was a customary rule limiting women to wearing tattoos on only one side of their arms."
        ],
        [
            "Christmas events"
        ],
        [
            "The city hosts Christmas events annually from the middle of December until the first Sunday of January at Plaza Paloma.",
            "The festivities typically commence with a grand fireworks display on the opening day, followed by the illumination of lights and the setup of food stalls.",
            "Various structures in the plaza are adorned with colorful lights, while lamp posts feature illuminated designs.",
            "Children can enjoy food stalls offering items like popcorn, cotton candy, and pancakes.",
            "Each night, presentations by different institutions are held at the center of the plaza, sometimes featuring live music and entertainment."
        ],
        [
            "Kapistahan"
        ],
        [
            "Passi City celebrates the feast of its patron saint, San Guillermo de Ermita (St. William the Hermit), on February 10, accompanied by the coronation of the fiesta queen.",
            "Typically, festivities commence about a week prior to the main event.",
            "Street parades are held in the mornings, while nightly programs sponsored by various institutions take place in the plaza, followed by dancing.",
            "Carnivals and rides are set up in the plaza for public enjoyment, and small kiosk stores offer a variety of items such as clothing, jewelry, and home decor.",
            "The festival is eagerly anticipated by residents of the city."
        ],
        [
            "St. William the Hermit of Maleval Parish Church"
        ],
        [
            "Façade of Passi Church"
        ],
        [
            "The church is notable for its militaristic architecture, characterized by massive buttresses supporting the front and back walls, reflecting its design as a 'fortress church'.",
            "It was constructed to replace previous churches demolished by an earthquake in 1612 and subsequent fires."
        ],
        [
            "In 1856, Friar Pedro Ceberio undertook the restoration of the church, which had deteriorated over time.",
            "The current structure is the outcome of his restoration efforts."
        ],
        [
            "Typical of churches from this era, one can observe the Augustinian seal on the archway over one of the side entrances, suggesting their involvement in its construction.",
            "Historical records are ambiguous regarding the placement of entrances, leading historians to speculate about the location of the original main entrance.",
            "Some evidence suggests that it could have been the doorway on the southeast corner of the church, leading to the 'Garden of Saints'."
        ],
        [
            "The church remained intact through the Revolution and the Philippines American War, but in 1932, it suffered damage when its roof was blown away by a typhoon."
        ],
        [
            "The church is encircled by a 'Garden of the Saints,' adorned with 25 to 30 statues of saints, which were contributed by parishioners over time."
        ],
        [
            "Inside the church's lofty belfry are three bells, two of considerable size and one smaller.",
            "To ring the larger bell, a chain connected to the clapper is stepped on to strike the sound rim, with the intensity of the step determining the volume of the sound.",
            "The other two bells are rung manually by striking their clappers against the sound rim, requiring the bell ringer to be in close proximity to the bells during ringing."
        ],
        [
            "Discovery and Foundation"
        ],
        [
            "Passi was discovered and established as a mission parish by Spanish explorers in 1584, under the patronage of St. William of Maleval, whose feast is celebrated annually on February 10.",
            "In 1593, Padre Juan Villamayor, an Augustinian friar, became its first resident priest.",
            "Initially, the mission church was constructed using lightweight materials near the Jalaur River's riverbank.",
            "However, in 1600, it was relocated to its current site and rebuilt using stones, slabs, and lime for its foundation and walls.",
            "Parishioners contributed by transporting necessary materials to the construction site during their visits to the church.",
            "Construction was completed during Padre Pedro Ceberio's tenure, with Salvador “Badong” Panes Perfecto serving as the town's Captain at the time."
        ],
        [
            "Schism and Abaca"
        ],
        [
            "Around 1821, during Padre Apolinario Villanueva's tenure as Parish Priest, a schism occurred between him and the Spanish populace of the town.",
            "As a result, he relocated the seat of the Parish Church to Abaca, where he constructed a chapel.",
            "When Padre Martin succeeded him, the seat of the parish church was returned to Passi."
        ],
        [
            "Aglipayon Revolution"
        ],
        [
            "During the Filipino Revolution against the Spanish government, there was a call from the Filipino Clergy for reforms.",
            "Padre Rafael Murillo, the Parish Priest at that time, was a follower and supporter of the Aglipay movement.",
            "He was later elevated to the rank of an Aglipayan Bishop and brought his family with him.",
            "To support his family, he demanded tributes from the people.",
            "The residents of Passi, under the leadership of Captain Badong Perfecto, strongly objected to this, leading to Padre Joaquin's removal from his position not long after."
        ],
        [
            "Spanish Era to Post-War Years"
        ],
        [
            "Padre Lorenzo Diaz, a Catholic Augustinian Priest, administered the Parish during a certain period.",
            "The year 1891 marked the end of the tenure of the last Spanish Augustinian Parish Priest of Passi, Padre Bravo."
        ],
        [
            "Reverend Father Amado Panes Perfecto"
        ],
        [
            "In 1893, after three centuries of Christianization, Passi produced its first priest, Padre Amado Panes Perfecto.",
            "He studied at the University of Salamanca in Spain, earning a Doctor of Canon Law degree, a rare privilege at the time.",
            "Appointed as the first Filipino Priest of Passi, he constructed a convent furnished with carved furniture and imported chinaware and utensils.",
            "One of his notable creations is the \"Flores de Mayo Salve,\" which has become a tradition in the town."
        ],
        [
            "World War II"
        ],
        [
            "During World War II, Passinhons faced significant challenges as the town experienced widespread destruction.",
            "Spanish-built houses were engulfed in flames, set ablaze by guerrillas, resulting in the town being left vacant for the occupying Japanese forces.",
            "Much of the wooden structures, including the church and convent, were reduced to rubble, leaving only the stones behind.",
            "The church was repurposed as a garrison for the Japanese military and later served as the headquarters for the Residence Civil Government.",
            "Filipino troops, aligned with the Philippine Commonwealth Army and Philippine Constabulary, played a crucial role in the liberation of Passi, collaborating with local guerrilla groups to engage Japanese forces, ultimately contributing to the conclusion of World War II."
        ],
        [
            "Lady Caycay earthquake"
        ],
        [
            "The 1948 Lady Caycay earthquake struck Panay Island, Philippines, on January 25, 1948, at 1:46 AM UTC+08:00.",
            "As a result of the earthquake, the bell tower of Passi suffered significant damage.",
            "The tall tower collapsed entirely, causing the bells to plummet to the ground.",
            "Although most of the bells were undamaged, one of the larger bells sustained a minor crack."
        ],
        [
            "The Church from Then and Now"
        ],
        [
            "Reconstruction"
        ],
        [
            "The reconstruction of the church underwent a gradual process.",
            "Initially, during the tenure of Padre Parreñas, wood and nipa roofing were installed.",
            "Temporary wooden posts were erected on the eastern side of the church to house the bells after the bell tower was damaged in the 1948 earthquake.",
            "Subsequently, Padre Buenaflor replaced the roofing with galvanized iron.",
            "Further enhancements, such as relocating the altar to the main entrance, were carried out during Padre Castaño's tenure.",
            "The present church, featuring steel trusses, washed walls, benches, and a new permanent belfry, was constructed along with the demolition of the old parish convent, Assumption School, and former Social Hall under the direction of Msgr.",
            "Eligio Villavert, the 81st Parish Priest of Passi."
        ],
        [
            "Final Restoration and Renovation"
        ],
        [
            "In 1997, the Parish of St. William of Maleval welcomed another Passinhon Priest, Msgr.",
            "Felipe Dativo Palomo, P.C.",
            "Supported by the Parish Councils and local and international Passinhon Parishioners, ambitious projects were undertaken.",
            "The completion and blessing of the Jubilee Hall, the largest and tallest parish convent in the Diocese, occurred in 2000.",
            "Subsequently, attention turned to the incomplete church behind the convent.",
            "Notably, the main entrance was absent, rendering Passi Church unique.",
            "Landscaping of the Western side and the installation of statues of saints were undertaken.",
            "The altar was relocated to its original position, facilitating the restoration of the original main entrance according to the Augustinian architectural design.",
            "The restoration included ornate granite flooring, an echo-proof ceiling, decorative stained glass, a large steel door at the main entrance, and modern lighting.",
            "Additionally, on the Eastern side, features such as Avenida de la Virgin Maria, the Adoration Chapel, a parking area, and a large relief map of Passi City can be observed."
        ],
        [
            "On October 26, 2010, the Church of St. William of Maleval observed its Solemn Dedication, an annual event commemorated by the Parishioners to reflect on the abundant grace bestowed upon the Christian Community of Passi."
        ],
        [
            "Typhoon Yolanda"
        ],
        [
            "On November 8, 2013, Typhoon Yolanda, also known internationally as Typhoon Haiyan, struck the Visayas Region, causing significant damage to infrastructure, including the church.",
            "Three years after its restoration, the church sustained partial damage, with the ceiling outside the church and part of the altar collapsing.",
            "As a result, the church was temporarily closed, and masses were held at the Jubilee Hall.",
            "However, it reopened to the public on December 16, 2013, following extensive reconstruction and repair efforts."
        ],
        [
            "Infrastructure and tourism"
        ],
        [
            "This article is written like a travel guide.",
            "Please help improve the article by introducing an encyclopedic style or move the content to Wikivoyage.",
            "(January 2020)"
        ],
        [
            "Passi City boasts several landmarks that represent its rich history and culture.",
            "Known for its diverse natural environment, the city features mountain ranges and caves among its notable attractions.",
            "Passi City holds historical significance in the Second World War, contributing to the broader history of Iloilo Province.",
            "It offers various dining options to cater to culinary interests.",
            "Additionally, the city provides leisure spots for relaxation and recreation."
        ],
        [
            "Currently, Passi City is undergoing significant infrastructure developments."
        ],
        [
            "Currently, Passi City is implementing a bypass road project consisting of three stages.",
            "The first stage connects Gines Viejo to Man-it via Gematoy.",
            "The second stage links the main highway in Punong to the main highway in Sablogon via Batu, Man-it, San Roque St, Sara Rd, and a new road to Sablogon.",
            "The third stage extends from the main highway in Sablogon to Arac and Gines via Lamunan Bridge.",
            "Construction of the bridges and roads is still ongoing, with an expected completion date before February 2020.",
            "Once finished, travelers from various directions of Passi City will have direct routes to their destinations without passing through the city proper."
        ],
        [
            "Passi City Esplanade is currently under construction, spanning from the old railway bridge to the bridge of the main highway on both banks of the river.",
            "It is designed to be 5 meters wide, except for the section near the bridge on the Citimall side, where it will be wider and include amenities for recreational activities."
        ],
        [
            "Places To See"
        ],
        [
            "F. Palmares Sr. Street, also referred to as the \"Calle Real\" of Passi, has historically been the bustling commercial center of the city.",
            "Originally part of the national highway leading to the provinces of Capiz or Aklan, it now serves as an alternative route to Iloilo Airport."
        ],
        [
            "It is also known as the \"Calle Real\" of Passi since it was the busiest business hub of the city until now.",
            "This street is an old national highway when going to the Province of Capiz or Aklan.",
            "At present, it is used as an alternative national road going to Iloilo Airport."
        ],
        [
            "The New City Hall of Passi City, initially constructed in 1995 as a municipal hall, underwent redesigning in 1998 to serve as the city hall.",
            "It is situated at the corner of Monfort Avenue and Casamayor Street."
        ],
        [
            "Built in 1995 as a new municipal hall, but in 1998, it is redesigned to become the new city hall.",
            "It is located at Corner Monfort Avenue-Casamayor Street."
        ],
        [
            "The Old Municipal Hall, constructed in 1930, stands as one of the few remaining Pre-war structures in Passi.",
            "It currently accommodates various offices, including the Department of Agrarian Reform (DAR), Commission on Elections (COMELEC), Post Office, and Conference Hall.",
            "colloquially, it is referred to as \"Residencia Passi.\""
        ],
        [
            "The St. William of Maleval Parish Church Convent, recognized as the largest and tallest parish convent within the Archdiocese, features two reception halls—Jubilee Hall and Lamunan Hall—suitable for hosting a variety of events, including wedding receptions."
        ],
        [
            "Plaza Paloma, situated opposite the old municipal hall, boasts a distinctive large pineapple-shaped restroom, adding to its visual appeal.",
            "Additionally, the park offers a multipurpose sporting court where visitors can engage in various recreational activities like badminton, tennis, and more."
        ],
        [
            "Paseo de Passi, located a short distance from Plaza Paloma, features a brick-paved promenade ideal for individuals interested in engaging in fitness activities and exercises."
        ],
        [
            "The Passi City Public Market stands as the largest market in the entirety of Iloilo Province."
        ],
        [
            "The Old Jalaur Railway Bridge, also referred to as the Watanabe Terror Bridge, is among the remaining railroad bridges in Panay.",
            "It stands as a significant landmark in Passi, warranting further preservation efforts."
        ],
        [
            "The Muscovado Chimney at Passi Sugar Central stands as the largest and tallest chimney on Panay Island."
        ],
        [
            "Healthcare"
        ],
        [
            "The City of Passi has enhanced public health services and overall community well-being through governmental initiatives and collaborations with non-governmental organizations."
        ],
        [
            "Don Valerio Palmares Sr. Memorial District Hospital"
        ],
        [
            "Passi City hosts the sole district hospital managed by the provincial government."
        ],
        [
            "Salngan Rural Hospital"
        ],
        [
            "In October 2013, the inauguration of the hospital extension in Barangay Salngan occurred."
        ],
        [
            "Philippine Red Cross"
        ],
        [
            "Passi City serves as the new Regional Operations Center of the Philippine Red Cross, along with its new logistics and disaster management training center.",
            "The center was inaugurated on April 21, 2017, attended by officials from the PRC, including Chairman Richard Gordon, and representatives from the Korea National Red Cross and the International Federation of Red Cross and Red Crescent Societies.",
            "Also present were Arthur D. Defensor Sr., the Governor of the Province of Iloilo; Jesry Palmares, the Mayor of Passi City; Ferjenel Biron, the Representative of the 4th District of Iloilo; and Marlyn Convocar, the Department of Health Regional Director."
        ],
        [
            "Sports"
        ],
        [
            "Passi City athletic field, located beside Passi City College in Barangay Bacuranan, is currently under construction and is expected to be completed by 2020.",
            "The field is anticipated to be sizable and equipped with state-of-the-art facilities, making it capable of hosting provincial and regional sports events."
        ],
        [
            "The Passi City Gymnasium, inaugurated in May 2018, has already hosted exhibition games featuring teams from UAAP and PBA."
        ],
        [
            "Passi City Center Fitness and Wellness, situated in Barangay Sablogon, serves as a gym and fitness center.",
            "Additionally, it hosts cockfighting events."
        ],
        [
            "Annually since 2014, the Mayor Jesry T Palmares Summer Olympics takes place during the summer season.",
            "The event features various sports including basketball, volleyball, table tennis, lawn tennis, badminton, taekwondo, soccer, chess, and fun run."
        ],
        [
            "Education"
        ],
        [
            "College"
        ],
        [
            "Passi City College - courses offered"
        ],
        [
            "Bachelor in Elementary Education(BEED)"
        ],
        [
            "Bachelor in Secondary Education(BSED)"
        ],
        [
            "Bachelor of Science in Information Technology(BSIT)"
        ],
        [
            "Bachelor of Science in Business Administration(BSBA)"
        ],
        [
            "Bachelor of Science in Criminology(BSCRIM)"
        ],
        [
            "Bachelor of Science in Hotel and Restaurant Management(BSHRM)"
        ],
        [
            "Diploma"
        ],
        [
            "Passi Trade School (Tesda)"
        ],
        [
            "Courses"
        ],
        [
            "Nos of Hours"
        ],
        [
            "Automotive Servicing NC II"
        ],
        [
            "660"
        ],
        [
            "Bread and Pastry Production NCI"
        ],
        [
            "141"
        ],
        [
            "Bread and Pastry Production NCII"
        ],
        [
            "692"
        ],
        [
            "Consumer Electronic Servicing NCII"
        ],
        [
            "558"
        ],
        [
            "Electrical Installation and Maintenance NCII"
        ],
        [
            "502"
        ],
        [
            "Shielded Metal Arc Welding (SMAW) NCI"
        ],
        [
            "268"
        ],
        [
            "Shielded Metal Arc Welding (SMAW) NCII"
        ],
        [
            "304"
        ],
        [
            "Primary and secondary education"
        ],
        [
            "The area is also home to several high schools, elementary and prep schools, as well as several kinder schools."
        ],
        [
            "Transportation"
        ],
        [
            "Passi Bus Terminal"
        ],
        [
            "Passi City is accessible by bus, with options available for those traveling from Iloilo City.",
            "Additionally, tricycles and jeepneys serve as the primary modes of transportation within Passi."
        ],
        [
            "Plane"
        ],
        [
            "Travelers from Manila can reach Iloilo through direct flights, with a flight duration of approximately 45 minutes.",
            "For those coming from Cebu, the travel time is even shorter, around 30 minutes.",
            "Upon arriving at the Iloilo International Airport, visitors can opt to take a taxi or rent a van directly to Passi City.",
            "Alternatively, they can head to the bus terminals in Jaro, Iloilo, for a bus ride to Passi City."
        ],
        [
            "Boat, Ship"
        ],
        [
            "Another option for travelers is to take a ferry from the North Harbor in Manila to Iloilo City, which typically takes around 24 hours to reach Iloilo Seaport.",
            "Upon arrival, one can take a taxi to the bus terminal located at Jaro, Iloilo City, and board a bus to Passi City.",
            "If coming from Bacolod, passengers can opt for a fastcraft to Iloilo port, with a travel time of approximately 45 minutes.",
            "From there, they can take a taxi to the bus terminal located at Jaro, Iloilo City."
        ],
        [
            "Roro"
        ],
        [
            "Passi City is accessible from Manila via the New Iloilo-Capiz Highway, with a travel time of approximately 18 hours or more by RORO Bus.",
            "Travelers can board a bus bound for Iloilo and inquire if it passes through Passi City, as some RORO buses may take different routes to Iloilo City."
        ],
        [
            "Bus"
        ],
        [
            "Passi City is accessible via Ceres Bus, both regular and air-conditioned, departing from Ceres Terminal in Jaro, Iloilo City.",
            "These buses have destination labels such as Kalibo, Roxas, Caticlan, and Passi.",
            "For travelers coming from Roxas City, Kalibo, and Caticlan, Ceres Buses labeled Iloilo can be boarded.",
            "These buses typically make a stopover at the Bus Terminal Complex in Passi City.",
            "Additionally, CIBLA (Central Iloilo Bus Line Association) Buses are available, often labeled Passi, and can be found at the tagbak Terminal in Jaro, Iloilo City."
        ],
        [
            "Taxi"
        ],
        [
            "Taxis are not readily available within Passi City itself.",
            "However, travelers can hire taxis from Iloilo City to travel to Passi City."
        ],
        [
            "Jeepney"
        ],
        [
            "Neighboring towns like Calinog and San Rafael offer regular Public Utility Jeepney (PUJ) services to Passi.",
            "Additionally, within Passi City, several barangays rely on jeepneys as their primary mode of transportation."
        ],
        [
            "Tricycle"
        ],
        [
            "Passi City, along with its barangays, and neighboring towns such as San Enrique and Dueñas, utilize tricycles as a common mode of transportation.",
            "These tricycles typically feature an open front, can accommodate four passengers, with rear-facing seats for back passengers and forward-facing seats for front passengers.",
            "Many tricycles operate within the city proper, known as roving tricycles, identifiable by their yellow color.",
            "Additionally, distinct color coding is assigned to tricycles from each barangay for easy identification."
        ],
        [
            "Notable personalities"
        ],
        [
            "Jose S. Palma - The present Archbishop of Cebu and President of Catholic Bishops' Conference of the Philippines"
        ],
        [
            "Aby Marano- Philippine Women's National Volleyball Team Captain"
        ],
        [
            "Sister cities"
        ],
        [
            " Jining, China"
        ],
        [
            "References"
        ],
        [
            "^  City of Passi |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"An Act Converting the Sitio of Agtabo in the Barrio of Salngan, Municipality of Passi, Province of Iloilo, into a Barrio of Said Municipality\".",
            "LawPH.com.",
            "Retrieved April 12, 2011."
        ],
        [
            "^ \"An Act Changing the Name of the Barrio of Santa Rosa, Municipality of Passi, Province of Iloilo, to Santo Tomas\".",
            "LawPH.com.",
            "Retrieved April 12, 2011."
        ],
        [
            "^"
        ],
        [
            "\"Passi: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 3, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"MORE Power prepares to expand services in Iloilo\".",
            "Manila Bulletin.",
            "August 11, 2022.",
            "Retrieved September 8, 2022."
        ],
        [
            "^ \"PHILIPPINE RED CROSS' NEW LOGISTICS AND TRAINING CENTER IN PASSI, ILOILO, TO BE INAUGURATED\".",
            "redcross.org.ph.",
            "Retrieved April 23, 2017."
        ],
        [
            "^ \"Tesda Courses Offered in Passi Trade School\".",
            "Tesda Courses (in Tagalog).",
            "May 23, 2016.",
            "Retrieved July 8, 2017."
        ],
        [
            "^ https://pcc91.wordpress.com/"
        ],
        [
            "^ \"济宁市人民政府外事办公室 印象友城 济宁市国际友好城市分布图\".",
            "jnfao.jining.gov.cn.",
            "Retrieved March 8, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for Passi, Iloilo."
        ],
        [
            "Wikimedia Commons has media related to Passi, Iloilo."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Passi, Iloilo"
        ],
        [
            "Dumarao, Capiz"
        ],
        [
            "BingawanCalinog"
        ],
        [
            "Passi"
        ],
        [
            "San Rafael"
        ],
        [
            "Dueñas"
        ],
        [
            "San Enrique"
        ],
        [
            "Articles Related to Passi, Iloilo"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "vteWestern Visayas (Region VI)Regional center"
        ],
        [
            "Iloilo City"
        ],
        [
            "Provinces"
        ],
        [
            "Aklan"
        ],
        [
            "Antique"
        ],
        [
            "Capiz"
        ],
        [
            "Guimaras"
        ],
        [
            "Iloilo"
        ],
        [
            "Metropolitan Area"
        ],
        [
            "Metro Iloilo–Guimaras"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City"
        ],
        [
            "Component cities"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Iloilo City"
        ],
        [
            "Jordan"
        ],
        [
            "Kalibo"
        ],
        [
            "Roxas"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Altavas"
        ],
        [
            "Anilao"
        ],
        [
            "Anini-y"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Balete"
        ],
        [
            "Banate"
        ],
        [
            "Banga"
        ],
        [
            "Barbaza"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Batan"
        ],
        [
            "Belison"
        ],
        [
            "Bingawan"
        ],
        [
            "Buenavista"
        ],
        [
            "Bugasong"
        ],
        [
            "Buruanga"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Caluya"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuartero"
        ],
        [
            "Culasi"
        ],
        [
            "Dao"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumalag"
        ],
        [
            "Dumangas"
        ],
        [
            "Dumarao"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Hamtic"
        ],
        [
            "Ibajay"
        ],
        [
            "Igbaras"
        ],
        [
            "Ivisan"
        ],
        [
            "Jamindan"
        ],
        [
            "Janiuay"
        ],
        [
            "Jordan"
        ],
        [
            "Kalibo"
        ],
        [
            "Lambunao"
        ],
        [
            "Laua-an"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Lezo"
        ],
        [
            "Libacao"
        ],
        [
            "Libertad"
        ],
        [
            "Maasin"
        ],
        [
            "Ma-ayon"
        ],
        [
            "Madalag"
        ],
        [
            "Makato"
        ],
        [
            "Malay"
        ],
        [
            "Malinao"
        ],
        [
            "Mambusao"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "Nabas"
        ],
        [
            "New Lucena"
        ],
        [
            "New Washington"
        ],
        [
            "Nueva Valencia"
        ],
        [
            "Numancia"
        ],
        [
            "Oton"
        ],
        [
            "Panay"
        ],
        [
            "Pandan"
        ],
        [
            "Panitan"
        ],
        [
            "Patnongon"
        ],
        [
            "Pavia"
        ],
        [
            "Pilar"
        ],
        [
            "Pontevedra"
        ],
        [
            "Pototan"
        ],
        [
            "President Roxas"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "San Lorenzo"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "San Remigio"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sapian"
        ],
        [
            "Sara"
        ],
        [
            "Sebaste"
        ],
        [
            "Sibalom"
        ],
        [
            "Sibunag"
        ],
        [
            "Sigma"
        ],
        [
            "Tangalan"
        ],
        [
            "Tapaz"
        ],
        [
            "Tibiao"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tobias Fornier"
        ],
        [
            "Tubungan"
        ],
        [
            "Valderrama"
        ],
        [
            "Zarraga"
        ],
        [
            "Visayas, Republic of the Philippines"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Passi,_Iloilo&oldid=1232754849\""
        ],
        [
            "Categories: Cities in IloiloPopulated places established in 17661766 establishments in the PhilippinesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listCS1 Tagalog-language sources (tl)Accuracy disputes from August 2022Articles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from July 2022Articles needing additional references from February 2013All articles needing additional referencesWikipedia articles with style issues from January 2020All articles with style issuesArticles with a promotional tone from January 2020All articles with a promotional toneArticles with multiple maintenance issuesPages using multiple image with auto scaled imagesPages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using PH wikidata incorrectlyArticles containing Kinaray-a-language textArticles containing Hiligaynon-language textArticles containing Filipino-language textAll articles with unsourced statementsArticles with unsourced statements from January 2023Wikipedia articles needing clarification from August 2020Articles with unsourced statements from August 2020Articles with unsourced statements from February 2022Wikipedia articles needing clarification from February 2022Articles with unsourced statements from October 2023Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}