{
    "name": "Pasuquin",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pasuquin"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 18°20′03″N 120°37′06″E﻿ / ﻿18.3342°N 120.6183°E﻿ / 18.3342; 120.6183"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Norte, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Pasuquin\" – news · newspapers · books · scholar · JSTOR (October 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesPasuquin"
        ],
        [
            "Santiago de PasuquinMunicipalityMunicipality of PasuquinBarangay Davila coast"
        ],
        [
            "FlagSealMap of Ilocos Norte with Pasuquin highlightedOpenStreetMapPasuquinLocation within the PhilippinesCoordinates: 18°20′03″N 120°37′06″E﻿ / ﻿18.3342°N 120.6183°E﻿ / 18.3342; 120.6183CountryPhilippinesRegionIlocos RegionProvinceIlocos NorteDistrict"
        ],
        [
            "1st districtBarangays33"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRobert Aguinaldo • Vice MayorOscar D. Aguinaldo • RepresentativeFerdinand Alexander Araneta Marcos III • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Dante G. ViernesElsie V. BascaoRachelle Leinaleigh A. FerrerChino Earl V. AguinaldoFerlind L. DancelVirginia S. IbaliArmando M. AguinaldoMaria G. Calija"
        ],
        [
            " • Electorate23,855 voters (2022)Area • Revenue₱ 158.1 million (2020) • Assets₱ 622.5 million (2020) • Expenditure₱ 136.9 million (2020) • Liabilities₱ 86.41 million (2020)Service provider • ElectricityIlocos Norte Electric Cooperative (INEC)Time zoneUTC+8 (PST)ZIP code2917PSGC012817000IDD : area code +63 (0)77Native languagesIlocano Tagalog"
        ],
        [
            "Pasuquin, officially the Municipality of Pasuquin (Ilocano: Ili ti Pasuquin; Tagalog: Bayan ng Pasuquin),  is a 3rd class municipality in the province of Ilocos Norte, Philippines.",
            "According to the 2020 census, it has a population of 29,678 people."
        ],
        [
            "Pasuquin is a farming and fishing area.",
            "As of the mid-1990s, the principal local crops were rice, for home consumption, and garlic, much of which is exported to Taiwan."
        ],
        [
            "Geography"
        ],
        [
            "Pasuquin is 503 kilometres (313 mi) from Metro Manila and 16 kilometres (9.9 mi) from Laoag City, the provincial capital."
        ],
        [
            "Barangays"
        ],
        [
            "Pasuquin is politically subdivided into 33 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Batuli (San Isidro)"
        ],
        [
            "Binsang"
        ],
        [
            "Caruan (Tulnagan)"
        ],
        [
            "Carusikis"
        ],
        [
            "Carusipan"
        ],
        [
            "Dadaeman"
        ],
        [
            "Darupidip"
        ],
        [
            "Davila"
        ],
        [
            "Dilanis"
        ],
        [
            "Dilavo"
        ],
        [
            "Estancia"
        ],
        [
            "Naglicuan"
        ],
        [
            "Nagsanga"
        ],
        [
            "Nalvo (Cababaan/Nalvo)"
        ],
        [
            "Ngabangab"
        ],
        [
            "Pangil"
        ],
        [
            "Poblacion 1"
        ],
        [
            "Poblacion 2"
        ],
        [
            "Poblacion 3"
        ],
        [
            "Poblacion 4"
        ],
        [
            "Pragata (Pragata-Bungro)"
        ],
        [
            "Puyupuyan"
        ],
        [
            "Salpad (Salpad-Calumbuyan)"
        ],
        [
            "San Juan"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Matilde"
        ],
        [
            "Sapat"
        ],
        [
            "Sulbec"
        ],
        [
            "Sulongan"
        ],
        [
            "Surong"
        ],
        [
            "Susugaen (Cababaan-Surgui)"
        ],
        [
            "Tabungao"
        ],
        [
            "Tadao"
        ],
        [
            "Agriculture"
        ],
        [
            "\"Lambaklad\" project"
        ],
        [
            "On May 23, 2023, The Bureau of Fisheries and Aquatic Resources launched the \"lambaklad\" project by virtue of a May 19 memorandum of understanding between the BFAR, Pasuquin LGU, and the Dilavo Fsihermen Association Inc. “Lambaklad” is coined from “lambat” (a stationary huge fish net) and “baklad” (corral), a Japanese-inspired eco-friendly technology using nets and ropes, instead of bamboo poles, laid down about 200 meters from the shore with use of flatboat.",
            "The lambaklad technology diversified target species like barracuda, mackerel, tons of tuna, scads, moonfish and other pelagic species.",
            "PHP2.8 million lambaklads were handed over by BFAR to the Dilavo Fishermen Association per president, Joel Queddeng.",
            "The natives started using “Lambaklad” from March 8.",
            "On April 1, 2024, 216 kilos of tuna were hauled by their \"lambaklad,\" sold at P250 per kilo."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Pasuquin"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "26(79)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "55(2.2)"
        ],
        [
            "41(1.6)"
        ],
        [
            "37(1.5)"
        ],
        [
            "41(1.6)"
        ],
        [
            "184(7.2)"
        ],
        [
            "215(8.5)"
        ],
        [
            "261(10.3)"
        ],
        [
            "256(10.1)"
        ],
        [
            "245(9.6)"
        ],
        [
            "216(8.5)"
        ],
        [
            "142(5.6)"
        ],
        [
            "129(5.1)"
        ],
        [
            "1,822(71.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "14.1"
        ],
        [
            "11.1"
        ],
        [
            "11.8"
        ],
        [
            "12.5"
        ],
        [
            "21.8"
        ],
        [
            "25.2"
        ],
        [
            "25.5"
        ],
        [
            "24.9"
        ],
        [
            "23.8"
        ],
        [
            "18.2"
        ],
        [
            "16.4"
        ],
        [
            "17.0"
        ],
        [
            "222.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PasuquinYearPop.±% p.a.1903 6,785—    1918 9,192+2.04%1939 10,065+0.43%1948 12,407+2.35%1960 12,262−0.10%1970 14,775+1.88%1975 16,258+1.94%1980 17,813+1.84%YearPop.±% p.a.1990 21,410+1.86%1995 23,027+1.37%2000 24,739+1.55%2007 26,307+0.85%2010 27,952+2.23%2015 28,980+0.69%2020 29,678+0.47%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Pasuquin was 29,678 people, with a density of 140 inhabitants per square kilometre or 360 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Pasuquin"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  22.20"
        ],
        [
            "2009  14.09"
        ],
        [
            "2012  10.44"
        ],
        [
            "2015  10.62"
        ],
        [
            "2018  5.46"
        ],
        [
            "2021  6.17"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Pasuquin, belonging to the first congressional district of the province of Ilocos Norte, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Ria Christina G. Fariñas"
        ],
        [
            "Mayor"
        ],
        [
            "Ferdinand D. Aguinaldo"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Oscar D. Aguinaldo"
        ],
        [
            "Councilors"
        ],
        [
            "Dante G. Viernes"
        ],
        [
            "Elsie V. Bascao"
        ],
        [
            "Rachelle Leinaleigh A. Ferrer"
        ],
        [
            "Chino Earl V. Aguinaldo"
        ],
        [
            "Ferlind L. Dancel"
        ],
        [
            "Virginia S. Ibali"
        ],
        [
            "Armando M. Aguinaldo"
        ],
        [
            "Maria G. Calija"
        ],
        [
            "Municipal seal"
        ],
        [
            "Shield, derived from the Provincial Seal of Ilocos Norte"
        ],
        [
            "Rice, Fish and Garlic, represent the major sources of income of the municipality"
        ],
        [
            "Salt Making, during off-season, people resort to salt making thereby increasing the income of the townspeople"
        ],
        [
            "Feldspar Deposit, represent the town's big deposit of feldspar, a non-metallic mineral."
        ],
        [
            "Culture"
        ],
        [
            "Poblacion 2 -  \"Rambac ti Daya\"."
        ],
        [
            "Poblacion 3 - \"Ragragsak ti Laud\""
        ],
        [
            "Barangay 5: Davila - \"Dumadara Festival: Fluvial Parade\""
        ],
        [
            "Semana Santa (Holy Week Celebration)"
        ],
        [
            "May Flower Festival (where the Sunflower Organization started a worldwide known Pageantry)"
        ],
        [
            "Town Fiesta in December from the 26th till the 30th.",
            "One of the highlights for the fiesta is the Inter-Barangay Basketball tournament and Inter-Agency Basketball tournament which include all groups of individual all over the town, also Balikbayan team included."
        ],
        [
            "Panagsana Festival"
        ],
        [
            "Puyupuyan- Actually, the main attraction should be the old Spanish Tower located behind a grotto some fanatic people built.",
            "This fortress was built by the Spaniards as watchtower for some pirates roaming the ocean for their victims.",
            "The grotto they alleged to have some apparitions were never verified by either the government or the Church, yet some people believe that the grotto has healed some illness and brought some luck to fishermen.",
            "This depends on one's belief."
        ],
        [
            "Panagsana Festival"
        ],
        [
            "It is the most known festival in Pasuquin.",
            "“Panagsana” is the Ilocano term used for this old-aged occupation.",
            "It means salt making, customarily done during summer and became the leading industry among the coastal folks in the municipality.",
            "The festival is annually celebrated on December during the town fiesta.",
            "Usually celebrated with street dances during the 29th of December, participated by the 8 clustered Barangays.",
            "Then, after, a showdown is held showcasing the history, legends,  the beautiful Pasuquin, and the Traditional Salt Making."
        ],
        [
            "The Sunflower Festival"
        ],
        [
            "An American film, Sunflowers (1996), directed by Shawn Hainsworth, an Independent U.S. Film Director, has made the Sunflower Festival internationally known.",
            "The film garnered critics recognition in the 1997 Chicago Gay and Lesbian Film Festival and other Film festivals in North America."
        ],
        [
            "Sunflower members are also active in participation of the annual town fiesta in December, the Mayflower festivities and religious celebrations like Holy Week.",
            "Indeed, they may be gay but they are truly and undoubtedly assets to the community."
        ],
        [
            "The Rambac ti Daya Festival"
        ],
        [
            "Poblacion 2 or better known as Dos, with almost 2,000 population annually celebrates the \"RAMBAC ti DAYA\"  as a feast of thanksgiving to the Almighty Creator for bountiful harvests..",
            "The unpredictable weather makes this event very surprising, as May is known to be the first month of the year with heavy rains.."
        ],
        [
            "Started in 1992 through a Municipal Ordinance, Poblacion Dos is known to be the pioneer barangay to come up with a barangay fiesta title-RAMBAC TI DAYA.",
            "This festivity culminates on the first two days of May, but usually preceded by an inter-zonal basketball tournament that runs for two to four weeks sponsored by the Sangguniang Kabataan.."
        ],
        [
            "One of the highlights of the festival is the community night, in which Barangay residents, local and foreign visitors gather together at the barangay plaza known as \"Plaza Murit\", for merry-making through community KTV, beer drinking, exchanging goodies, reuniting with good old folk, and simply enjoying and sharing abundant blessings."
        ],
        [
            "The festival ends on the second day of May.",
            "A thanksgiving mass is offered in the first hour of the morning, followed by a motorists' parade downtown.",
            "After the motorcade, various Palarong Nayon are played by children and adult residents alike, where big prizes are at stake."
        ],
        [
            "At night, the festival ends with a Sagalas/Santa Cruzan, a tribute to Queen Elena on her way to the Holy Cross.",
            "The Flores de Mayo parades young kids as they are dressed in their respective personas."
        ],
        [
            "In the Flores De Mayo program, the Gawad Rambac ti Daya, Most Outstanding Anak ti Dos is awarded to the most deserving resident that made great impact and unsurmounted selfless contributions through civil service, social work, religious, and human rights advocacy, and youth and sports development."
        ],
        [
            "The Dumadara Festival"
        ],
        [
            "An annual fluvial parade festival started by the Davileneos, particularly the Roman Catholic Parish of St. Francis of Assisi.",
            "Davila is a coastal barangay of Pasuquin, and their main harvest is dumadara (a certain fish).",
            "They associated the festival to the Blessed Virgin Mary, whom the Month of May is dedicated, as a thanksgiving for a bountiful fishing.",
            "Fisherfolks from Davila are made to decorate their bangkas (boats) for the fluvial parade.",
            "There are many activities hold also during the festival like boat race, and eating delectable grilled fish (Dumadara)with the guests."
        ],
        [
            "Holy Week Celebration"
        ],
        [
            "The coastal town of Pasuquin celebrates its Holy Week with much religiosity and solemnity.",
            "The celebration starts on Palm Sunday (Domingo de Ramos) and ends on Easter Sunday (Domingo de Pascua).",
            "Each year, townspeople from all walks of life come together to celebrate the Most Holy Passion and Death of our Lord."
        ],
        [
            "There are a total of 3 processions during Holy Week in St. James the Greater Parish, Pasuquin's Roman Catholic Church.",
            "The Holy Tuesday procession, better known as \"Estacion General\", Good Friday (the Holy Burial) and Easter Sunday (the \"Encuentro\" or \"Sabet\" in Ilocano).",
            "The processional images are enthroned in their respective carozzas with floral arrangements and elaborate lighting fixtures."
        ],
        [
            "During Good Fridays, the \"Stabat Mater\" in Latin is sung by a long array of \"cantoras\" (townspeople) following the Santo Entierro (Dead Christ).",
            "Pasuquin is the only remaining town in Ilocos that practices this beautiful tradition/heritage handed by its forebears.",
            "The singing of the \"Stabat Mater\" in Pasuquin has been in existence for more than a century."
        ],
        [
            "Attractions"
        ],
        [
            "Ruins of Pasuquin's old Roman Catholic church"
        ],
        [
            "Davila - Salt Capital;  Also known for its bonsai production & artistry.",
            "Home of the \"Dumadara Festival\" organized by the Roman Catholic Parish of St. Francis of Assisi."
        ],
        [
            "Estancia- Summer Capital of Pasuquin.",
            "Known for its scenic Sexy Beach"
        ],
        [
            "Naglicuan - Botanic Garden of Pasuquin"
        ],
        [
            "Poblacion 2 - Sentinella Hills, Nagrebcan & Magararay Rice Fields, and the existence of the Old Roman Catholic Church Ruins.",
            "Home of the \"Rambac ti Daya Festival\""
        ],
        [
            "Poblacion 3 - Barangay \"Biscocho\", simply for making the best tasting biscochos in the entire province.",
            "Home of the \"Ragragsak ti Laud Festival\""
        ],
        [
            "Puyupuyan - Known for its grotto and the apparition in the late 80s and early 90s, Puyupuyan is one of the best Summer destinations in the town.",
            "With the presence of the ship wrecked believed to have sunk during the Second World War, the seashores just made it perfect for tourists for a great souvenir shots"
        ],
        [
            "San Juan -  Known for its summer getaway falls called \"Calitungan\""
        ],
        [
            "Santa Matilde - hunting; mango tree production"
        ],
        [
            "Sapat - known for the PAF Airbase and the most restricted area in the town"
        ],
        [
            "Sulbec - known for its Put-tot Siraong Picnic Venues"
        ],
        [
            "Surong - known for its Luttuong falls"
        ],
        [
            "Tadao -  Houses the biggest dam in the municipality.",
            "Also good for picnics, trekking and hiking escapades."
        ],
        [
            "Susugaen - known for its own \"Put-tot,\" a small lake, which many people visit because of its fresh, cold and clear water.",
            "Another attraction is the waterfall known as \"Saypon\" which used to serve the villagers with abundance of water along with streams and rivers.",
            "\"Suso Beach\" is also located here.",
            "Furthermore, \"Villa Florentina Beach Resort\" is also situated between Sitio Cababan and Barangay Nalvo at the South-Western part."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Pasuquin |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Ilocos Norte\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ Adriano, Leilanie (May 23, 2023).",
            "\"Ilocos Norte town fishers adopt eco-friendly fish trap technology\".",
            "Philippine News Agency.",
            "Retrieved April 12, 2024."
        ],
        [
            "^ \"Mahigit 200 kilong tuna, nalambat sa Pasuquin, Ilocos Norte\".",
            "GMA Integrated News.",
            "April 1, 2024.",
            "Retrieved April 12, 2024."
        ],
        [
            "^ Adriano, Leilani (April 9, 2024).",
            "\"Opportunities come in waves for 'lambaklad' fisherfolk in Ilocos town\".",
            "Philippine News Agency.",
            "Retrieved April 12, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Pasuquin: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 4 March 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 10, 2022."
        ],
        [
            "External links"
        ],
        [
            " Media related to Pasuquin at Wikimedia Commons"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Pasuquin"
        ],
        [
            "Burgos"
        ],
        [
            "South China Sea"
        ],
        [
            "Pasuquin"
        ],
        [
            "Vintar"
        ],
        [
            "Bacarra"
        ],
        [
            "vte Province of Ilocos NorteLaoag (capital and largest city)Municipalities"
        ],
        [
            "Adams"
        ],
        [
            "Bacarra"
        ],
        [
            "Badoc"
        ],
        [
            "Bangui"
        ],
        [
            "Banna"
        ],
        [
            "Burgos"
        ],
        [
            "Carasi"
        ],
        [
            "Currimao"
        ],
        [
            "Dingras"
        ],
        [
            "Dumalneg"
        ],
        [
            "Marcos"
        ],
        [
            "Nueva Era"
        ],
        [
            "Pagudpud"
        ],
        [
            "Paoay"
        ],
        [
            "Pasuquin"
        ],
        [
            "Piddig"
        ],
        [
            "Pinili"
        ],
        [
            "San Nicolas"
        ],
        [
            "Sarrat"
        ],
        [
            "Solsona"
        ],
        [
            "Vintar"
        ],
        [
            "Component cities"
        ],
        [
            "Batac"
        ],
        [
            "Laoag"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Norte"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pasuquin&oldid=1220212756\""
        ],
        [
            "Category: Municipalities of Ilocos NorteHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from October 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}