{
    "name": "Pavia",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pavia, Iloilo"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralBoarischCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°46′30″N 122°32′30″E﻿ / ﻿10.775°N 122.5417°E﻿ / 10.775; 122.5417"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "Municipality in Western Visayas, PhilippinesPaviaMunicipalityMunicipality of PaviaAerial view of Pavia with Robinsons mall in the foreground"
        ],
        [
            "FlagNickname: Regional Agro-Industrial Center for Western VisayasMap of Iloilo with Pavia highlightedOpenStreetMapPaviaLocation within the PhilippinesCoordinates: 10°46′30″N 122°32′30″E﻿ / ﻿10.775°N 122.5417°E﻿ / 10.775; 122.5417CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "2nd districtFounded1848Barangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorLaurence Anthony G. Gorriceta • Vice MayorEdsel G. Gerochi • RepresentativeMichael B. Gorriceta • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jo Jan Paul J. PeñolAriel B. GeradaJose Maria D. TrimañezLeonardo L. BelasaDaniel S. Fajardo, IIRoy H. Gorriceta, Sr.Rhia B. SotomilJoshua Philippe B. Gumban"
        ],
        [
            " • Electorate39,084 voters (2022)Area • Revenue₱ 282.7 million (2020) • Assets₱ 1,123 million (2020) • Expenditure₱ 211 million (2020) • Liabilities₱ 399.3 million (2020)Service provider • ElectricityIloilo 1 Electric Cooperative (ILECO 1)Time zoneUTC+8 (PST)ZIP code5001PSGC063036000IDD : area code +63 (0)33Native languagesHiligaynon Karay-a TagalogWebsitewww.pavia-iloilo.gov.ph"
        ],
        [
            "Pavia, officially the Municipality of Pavia ("
        ],
        [
            "Pavia is the smallest municipality in terms of area in Iloilo, covering only 2,715 hectares (6,710 acres).",
            "The municipality is the Regional Agro-Industrial Center for Western Visayas and is located 10 kilometres (6.2 mi) north of Iloilo City."
        ],
        [
            "The Catholic church, currently undergoing restoration, is similar to one in Pavia, Italy."
        ],
        [
            "Pavia is a part of the Metro Iloilo–Guimaras area, centered on Iloilo City."
        ],
        [
            "Etymology"
        ],
        [
            "How the town got its name is unclear, and has long been disputed.",
            "One theory has it that the name came from a certain Colonel Pavia of the Spanish garrison in Iloilo who was supposedly responsible for initially establishing a Spanish presence in the area"
        ],
        [
            "The last theory seems to be supported by circumstantial historical evidence: it was also in 1862 that an independent parish dedicated to Saint Monica was established by an Augustinian friar, Policarpio Minayo.",
            "But it was only in 1889 when construction of the famous brick church—as it now stands—began.",
            "It was envisioned and built in the Byzantine style, with Romanesque design elements.",
            "Two Greek crosses dominate the facade, and the transept is round set against the rear wall.",
            "It is unique in the whole of Panay Island, as it is the only church built entirely of red brick, inside and out.",
            "Quite significantly, the church design was apparently inspired by the ancient royal arched basilica of San Michele Maggiore in Pavia, Italy—minus the front columns."
        ],
        [
            "History"
        ],
        [
            "Pavia was initially settled by primitive Malays, followed by the arrival of Chinese immigrants between the 15th and 16th centuries.",
            "Archaeological excavations at a Chinese burial ground in Cabugao Sur have provided evidence of these early settlements, suggesting a population of around 200 to 400."
        ],
        [
            "During the Spanish Colonial Era, Pavia officially separated from the town of Jaro and was established as an independent entity in 1848.",
            "Thirteen landowners came together to transform what was once a \"camping place,\" a \"settlement place,\" or an \"abandoned place\" into a thriving community."
        ],
        [
            "Over time, Pavia experienced changes in its administrative status.",
            "It became part of Santa Barbara in 1901 and then joined Iloilo City in 1904.",
            "However, in 1907, Pavia, along with Leganes and Jaro, seceded from Iloilo City to form the suburb of Jaro.",
            "Petronilo Gumban served as the leader of Pavia from 1916 until his election as Presidente Municipal of Jaro in 1920.",
            "In 1921, under the leadership of Delfin Gumban, Pavia regained its status as an independent municipality."
        ],
        [
            "Today, Pavia has emerged as one of the high-population suburban areas within the Iloilo metropolitan area.",
            "The town quickly transformed from the province's center of the agriculture industry to a center of commerce of its own, influenced by the presence of nearby Iloilo City.",
            "Developers such as Sta.",
            "Lucia Land, Robinsons Land, International Builders Corporation, among others, have established a significant presence in the town, positioning it for rapid development and poised to evolve into one of the central business districts in the province, outside of Iloilo City."
        ],
        [
            "Geography"
        ],
        [
            "Pavia is 10 kilometres (6.2 mi) north of Iloilo City.",
            "It is bordered by the Iloilo City districts of Jaro and Mandurriao to the east and south, respectively; the towns of Leganes to the northeast; Santa Barbara to the north; San Miguel to the west; and Oton to the southwest.",
            "Pavia is a part of Metro Iloilo-Guimaras area.",
            "Due to its close proximity to the urban core of the metropolitan area, it is one of the most urbanized towns in the province."
        ],
        [
            "Barangays"
        ],
        [
            "Pavia is politically subdivided into 18 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aganan"
        ],
        [
            "Amparo"
        ],
        [
            "Anilao"
        ],
        [
            "Balabag"
        ],
        [
            "Purok I (Poblacion)"
        ],
        [
            "Purok II (Poblacion)"
        ],
        [
            "Purok III (Poblacion)"
        ],
        [
            "Purok IV (Poblacion)"
        ],
        [
            "Cabugao Norte"
        ],
        [
            "Cabugao Sur"
        ],
        [
            "Jibao-an"
        ],
        [
            "Mali-ao"
        ],
        [
            "Pagsanga-an"
        ],
        [
            "Pal-agon"
        ],
        [
            "Pandac"
        ],
        [
            "Tigum"
        ],
        [
            "Ungka I"
        ],
        [
            "Ungka II"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Iloilo, Philippines (1961–1990, extremes 1903–2012)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "34.7(94.5)"
        ],
        [
            "35.5(95.9)"
        ],
        [
            "39.0(102.2)"
        ],
        [
            "37.5(99.5)"
        ],
        [
            "37.8(100.0)"
        ],
        [
            "37.5(99.5)"
        ],
        [
            "35.2(95.4)"
        ],
        [
            "34.8(94.6)"
        ],
        [
            "37.8(100.0)"
        ],
        [
            "35.4(95.7)"
        ],
        [
            "34.8(94.6)"
        ],
        [
            "34.5(94.1)"
        ],
        [
            "39.0(102.2)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.7(85.5)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "30.7(87.3)"
        ],
        [
            "30.4(86.7)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "30.9(87.6)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.1(79.0)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "29.1(84.4)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "24.6(76.3)"
        ],
        [
            "25.1(77.2)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "16.5(61.7)"
        ],
        [
            "16.7(62.1)"
        ],
        [
            "18.6(65.5)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "20.2(68.4)"
        ],
        [
            "21.0(69.8)"
        ],
        [
            "19.5(67.1)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "19.8(67.6)"
        ],
        [
            "19.2(66.6)"
        ],
        [
            "19.4(66.9)"
        ],
        [
            "18.3(64.9)"
        ],
        [
            "16.5(61.7)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "39.9(1.57)"
        ],
        [
            "19.1(0.75)"
        ],
        [
            "27.1(1.07)"
        ],
        [
            "47.7(1.88)"
        ],
        [
            "117.9(4.64)"
        ],
        [
            "255.2(10.05)"
        ],
        [
            "313.2(12.33)"
        ],
        [
            "363.7(14.32)"
        ],
        [
            "266.8(10.50)"
        ],
        [
            "264.1(10.40)"
        ],
        [
            "174.8(6.88)"
        ],
        [
            "64.2(2.53)"
        ],
        [
            "1,953.7(76.92)"
        ],
        [
            "Average rainy days (≥ 0.1 mm)"
        ],
        [
            "11"
        ],
        [
            "7"
        ],
        [
            "7"
        ],
        [
            "6"
        ],
        [
            "14"
        ],
        [
            "18"
        ],
        [
            "21"
        ],
        [
            "20"
        ],
        [
            "19"
        ],
        [
            "18"
        ],
        [
            "15"
        ],
        [
            "14"
        ],
        [
            "170"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "82"
        ],
        [
            "80"
        ],
        [
            "75"
        ],
        [
            "73"
        ],
        [
            "77"
        ],
        [
            "82"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "84"
        ],
        [
            "84"
        ],
        [
            "83"
        ],
        [
            "81"
        ],
        [
            "Source 1: Climate Charts"
        ],
        [
            "Source 2: Deutscher Wetterdienst (rainy days),"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PaviaYearPop.±% p.a.1903 5,700—    1939 8,918+1.25%1948 9,637+0.87%1960 11,258+1.30%1970 13,745+2.01%1975 15,180+2.01%1980 17,330+2.68%1990 23,814+3.23%1995 26,756+2.21%2000 32,824+4.48%2007 39,275+2.51%2010 43,614+3.89%2015 55,603+4.73%2020 70,388+4.75%Source: Philippine Statistics Authority"
        ],
        [
            "Pavia is the fastest-growing municipality in the province, both in terms of economy and population.",
            "In the 2020 census, the population of Pavia, Iloilo, was 70,388 people, with a density of 2,600 inhabitants per square kilometre or 6,700 inhabitants per square mile."
        ],
        [
            "Pavia, being a suburb of Iloilo City, Hiligaynon is also the most dominant language used by its residents.",
            "Karay-a is also being spoken, as well as Tagalog and English.",
            "Roman Catholicism is the most dominant religion in this municipality."
        ],
        [
            "Economy"
        ],
        [
            "Old Iloilo-Capiz Road, a national highway that traverses Pavia, where major developments are mostly happening within the town"
        ],
        [
            "Poverty incidence of Pavia"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  10.60"
        ],
        [
            "2009  10.19"
        ],
        [
            "2012  8.61"
        ],
        [
            "2015  10.69"
        ],
        [
            "2018  7.81"
        ],
        [
            "2021  4.32"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Pavia has emerged as one of the fastest-growing economies in Iloilo, with a diverse range of industries and developments.",
            "It serves as an agricultural-industrial center, hosting companies like Vitarich Corporation and New Panay Agri-ventures in Cabugao Sur, Pavia.",
            "The town has transformed into a commuter town with the establishment of suburban neighborhoods such as Green Meadows, Providence, Centro Verde, Parc Regency, Centennial Homes, and Deca Homes."
        ],
        [
            "Pavia has seen the rise of new large establishments, including the newly renovated Mandaue Foam, City Mall, Puregold, GT Town Center, and Robinsons Place Pavia.",
            "The presence of these commercial centers contributes to the town's economic growth and provides convenient shopping options for residents.",
            "Additionally, Pavia is home to Panay News, a prominent news media outlet."
        ],
        [
            "The town features several hotels such as the Gateway Hotel, Sotogrande Hotel, and JECA MJC Hotel & Event Center, catering to visitors and travelers.",
            "The newly opened Holy Mary Women and Children's Hospital offers healthcare services to the community.",
            "Major companies like Robinsons Builders, Coca-Cola Bottling Company, and Taytay sa Kauswagan provide employment opportunities for thousands of individuals in Pavia."
        ],
        [
            "Notably, the development of Mercado Central within the Sta.",
            "Lucia Land, Inc.'s Hacienda Verde township is expected to be a commercial and business hub in Pavia.",
            "Spanning 43 hectares (110 acres), it will house corporate and business process outsourcing (BPO) offices, hotels, residential areas, a mall, and a stadium.",
            "This development along the Iloilo Circumferential Road 1 (C1) will further boost trade and commerce in the town."
        ],
        [
            "Pavia is famous for \"baye baye,\" a sweet delicacy made from scraped young coconut meat, sugar, and pinipig, derived from newly harvested palay."
        ],
        [
            "Government"
        ],
        [
            "Pavia Municipal Hall"
        ],
        [
            "Laurence Anthony G. Gorriceta is the present mayor."
        ],
        [
            "List of former chief executives"
        ],
        [
            "The different Presidente Municipal (equivalent to Municipal Mayor now) who had served Pavia."
        ],
        [
            "Delfin Gumban  (1921–1924) – known to be Pavia's Father of Independence"
        ],
        [
            "Domingo Guillem (1924–1927)"
        ],
        [
            "Simplicio Hechanova (1927–1934)"
        ],
        [
            "Pacifico Jabonillo (1934–1942)"
        ],
        [
            "Buenaventura Gumban (1942–1945) Resistance Civil Government"
        ],
        [
            "Cornelio Gumban (1942–1945) Japanese Government"
        ],
        [
            "Juan de Dios Gonzaga (1945–1946)"
        ],
        [
            "Luzon Gumban (1946–1952)"
        ],
        [
            "Vicente Gerochi (1952–1955)"
        ],
        [
            "Florencio Hisole (1956–1959)"
        ],
        [
            "Gerardo Gorriceta (1960–1971)"
        ],
        [
            "Nelson Gumban (1972–1986)"
        ],
        [
            "Felix Gorriceta, Jr. (1986–1994)"
        ],
        [
            "Rogelio Trimanez (1994–1995) serving the unexpired term of Mayor Gorriceta"
        ],
        [
            "Felix Caronongan, Jr. (March – June 1995)"
        ],
        [
            "Ervin G. Gerochi  (1995–2004)"
        ],
        [
            "Arcadio H. Gorriceta (2004–2013)"
        ],
        [
            "Michael B. Gorriceta (2013–2019)"
        ],
        [
            "Laurence Anthony G. Gorriceta (2019–present)"
        ],
        [
            "Culture"
        ],
        [
            "Carabao-Carroza Race"
        ],
        [
            "Pavia, since 1973, holds the Carabao-Carroza Race Festival every 3 May.",
            "The Carabao is made the \"king\" for a day, and the race features carabaos each pulling a bamboo sled or \"carrosa\" on a 400-meter course.",
            "Carrozas with native designs are also paraded as part of festivities."
        ],
        [
            "Tigkaralag Festival"
        ],
        [
            "The Tigkaralag festival is celebrated in consonance with All Souls' Day.",
            "The term \"Tigkaralag\" comes from the Ilonggo words, \"tig,\" which means \"season of,\" and \"kalag,\" which means \"soul\".",
            "Participants from the municipality's 18 barangays wear costumes and parade themselves from Barangay Aganan to the town's plaza for a dance-drama competition with a storyline reflective of Tigkaralag.",
            "Held every 30th day of October, the festival was conceived by Cecilia H. Capadosa in 1992.",
            "Recently, Baye-baye night was included as a side event of the festival in celebration on one of the town's industry, the Baye-baye."
        ],
        [
            "Sta.",
            "Monica Parish Church"
        ],
        [
            "Pavia Parish Church"
        ],
        [
            "Pavia Parish Church, popularly known as Santa Monica Parish Church is a century-old church built by the Spanish Augustinian Fathers sometime in 1862.",
            "Its interior and exterior walls are made entirely of red-bricks, making it the only existing brick-constructed church in the island of Panay.",
            "This church is similar to the church of the town's namesake, Pavia in Italy."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Pavia |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b"
        ],
        [
            "\"Province: Iloilo\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^ paviachurchrestore : Pavia Church Restoration"
        ],
        [
            "^ \"A Brief History of Pavia, Iloilo\".",
            "The Life & Times Of Encarnacion Janduquile y Gumban vda de Himatay, 1904-2004.",
            "Retrieved April 27, 2021."
        ],
        [
            "^ \"Iloilo History Part 7\".",
            "Research Center for Iloilo."
        ],
        [
            "^ \"Climate (Average Weather) Data\".",
            "Climate Charts.",
            "Archived from the original on May 11, 2011.",
            "Retrieved March 13, 2011."
        ],
        [
            "^ Klimatafel von Iloilo / Insel Panay / Philippinen (PDF) (in German), Deutscher Wetterdienst, retrieved April 5, 2017"
        ],
        [
            "^ Iloilo City Climatological Extremes, Philippine Atmospheric, Geophysical and Astronomical Services Administration, archived from the original on October 14, 2018, retrieved October 14, 2018"
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Today, Iloilo (October 30, 2017).",
            "\"43-hectare Mercado Central commercial dev't to rise in Pavia\".",
            "Iloilo Today.",
            "Retrieved September 8, 2022."
        ],
        [
            "^ \"Pavia's Baye-Baye\".",
            "Municipality of Pavia.",
            "September 15, 2011.",
            "Archived from the original on April 21, 2012.",
            "Retrieved October 3, 2011."
        ],
        [
            "^ \"Pavia's Pottery-Making\".",
            "Municipality of Pavia.",
            "September 15, 2011.",
            "Archived from the original on April 21, 2012.",
            "Retrieved October 3, 2011."
        ],
        [
            "^ \"Iloilo Festivals and Events\".",
            "corporate.mozcom.com/dot/r6/.",
            "Archived from the original on May 9, 2008.",
            "Retrieved November 3, 2008."
        ],
        [
            "^ Marin, Bombette G. (October 25, 2005).",
            "\"Tigkaralag Pavia Style\".",
            "Sun Star Iloilo.",
            "Archived from the original on October 29, 2008.",
            "Retrieved November 3, 2008."
        ],
        [
            "^ \"Official Website\"."
        ],
        [
            "^ \"Iloilo Festivals – The List of Festivals and Fiestas in Iloilo for the Year\".",
            "Philippine Fiestas and Festivals.",
            "Archived from the original on October 16, 2008.",
            "Retrieved November 3, 2008."
        ],
        [
            "External links"
        ],
        [
            "Iloilo Travel Website"
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived May 9, 2012, at the Wayback Machine"
        ],
        [
            "Places adjacent to Pavia, Iloilo"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Leganes"
        ],
        [
            "San Miguel"
        ],
        [
            "Pavia"
        ],
        [
            "Iloilo City"
        ],
        [
            "Oton"
        ],
        [
            "Iloilo City"
        ],
        [
            "vteMetro Iloilo–GuimarasIloilo"
        ],
        [
            "Iloilo"
        ],
        [
            "Cabatuan"
        ],
        [
            "Leganes"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Guimaras"
        ],
        [
            "Buenavista"
        ],
        [
            "Jordan"
        ],
        [
            "Nueva Valencia"
        ],
        [
            "San Lorenzo"
        ],
        [
            "Sibunag"
        ],
        [
            "Metropolitan Iloilo–Guimaras Economic Development Council"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pavia,_Iloilo&oldid=1224742008\""
        ],
        [
            "Categories: Municipalities of Iloilo1848 establishments in the PhilippinesPopulated places established in 1848Hidden categories: Pages using gadget WikiMiniAtlasCS1 German-language sources (de)CS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from April 2021All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2021Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Tagalog IPAArticles containing Hiligaynon-language textArticles containing Tagalog-language textAll articles lacking reliable referencesArticles lacking reliable references from November 2019Articles lacking reliable references from April 2021Official website different in Wikidata and WikipediaWebarchive template wayback linksArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}