{
    "name": "Piagapo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Piagapo"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°00′N 124°12′E﻿ / ﻿8°N 124.2°E﻿ / 8; 124.2"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Lanao del Sur, Philippines"
        ],
        [
            "This article has multiple issues.",
            "Please help improve it or discuss these issues on the talk page.",
            "(Learn how and when to remove these template messages)"
        ],
        [
            "This article's tone or style may not reflect the encyclopedic tone used on Wikipedia.",
            "See Wikipedia's guide to writing better articles for suggestions.",
            "(September 2014) (Learn how and when to remove this message)"
        ],
        [
            "This article may contain an excessive amount of intricate detail that may interest only a particular audience.",
            "Please help by spinning off or relocating any relevant information, and removing excessive detail that may be against Wikipedia's inclusion policy.",
            "(September 2014) (Learn how and when to remove this message)"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Piagapo\" – news · newspapers · books · scholar · JSTOR (September 2014) (Learn how and when to remove this message)"
        ],
        [
            " (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bangsamoro Autonomous Region in Muslim Mindanao, PhilippinesPiagapo"
        ],
        [
            "فياغافوMunicipalityMunicipality of PiagapoMunicipal Hall"
        ],
        [
            "FlagSealMap of Lanao del Sur with Piagapo highlightedOpenStreetMapPiagapoLocation within the PhilippinesCoordinates: 8°00′N 124°12′E﻿ / ﻿8°N 124.2°E﻿ / 8; 124.2CountryPhilippinesRegionBangsamoro Autonomous Region in Muslim MindanaoProvinceLanao del SurDistrict"
        ],
        [
            "1st districtBarangays37"
        ],
        [
            " (see Barangays)Government  • TypeSangguniang Bayan • MayorAli L. Sumandar • Vice MayorNorombae M. Manalocon-Sumandar • RepresentativeZiaur-Rahman A. Adiong • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Abubacar L. SumandarMosatafa D. PangantingMano L. AcoonSuhaylah M. MulokMacacuna M. BanisilSamanuddin M. BazerShamil M. CampongSamsodin M. Mamao"
        ],
        [
            " • Electorate16,767 voters (2022)Area • Revenue₱ 133.7 million (2020) • Assets₱ 88.26 million (2020) • Expenditure₱ 134.5 million (2020) • Liabilities₱ 34.11 million (2020)Service provider • ElectricityLanao del Sur Electric Cooperative (LASURECO)Time zoneUTC+8 (PST)ZIP code9710PSGC153621000IDD : area code +63 (0)63Native languagesMaranao TagalogWebsitewww.piagapo-lds.gov.ph"
        ],
        [
            "Piagapo, officially the Municipality of Piagapo (Maranao: Inged a Piagapo; Tagalog: Bayan ng Piagapo), is a 4th class municipality in the province of Lanao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 30,132 people."
        ],
        [
            "History"
        ],
        [
            "The municipality was named Piagapo as the word relates closely to several royal houses of the Pat A Pangampong a Ranao.",
            "It is believed"
        ],
        [
            "Martial law"
        ],
        [
            "Piagapo is one of the municipalities suffered and receiving evacuees from municipality of Munai and municipality of Tangcal during Martial Law in 1972.",
            "Almost all evacuees living in Munai at the time abandoned their home, livestock, and land, moving to the boundary of Lanao del Sur and Lanao del Norte."
        ],
        [
            "Most of the people stay meanwhile to Barangay Lininding of Munai, a boundary of Municipality of Piagapo, Lanao del Sur.",
            "The only remaining people that time of evacuation process were the Moro (Male and Female including Children) Fighter and one of their Leader Commander was Commander Tagoranao \"AKA James Bond\" Macapaar bin Sabbar, a MNLF Top Commander for Lanao del Norte.",
            "Late Commander James Bond is the sibling of MILF Top Commander Abdullah Macapaar \"Commander Bravo\".",
            "Moro Rebels from Munai had a fight side by side with the Moro Rebels from neighboring Tangkal against Philippines Constabulary (PC) Army."
        ],
        [
            "After peaceful was process in the middle of 1980s, the team of MILF Commander Sultan Saifudin Romandiar Tomawis and MILF Commander Sultan Tagoranao Goldiano Macapaar bin Sabbar along with the MILF Commander Sansarona from Maguindanao had stay and made a temporary \"MILF Camp Bansayan\" in Bansayan, a barangay of Piagapo until end of EDSA Revolution on 1986.",
            "During the stay, there were enormous battle between MILF forces and Government Forces.",
            "Both MILF Commanders had gone to Afghanistan to join the war against Russian on 1984.",
            "The said Camp was abandoned by MILF Soldiers when civilian had given the map and provide with guide the Government Forces when that MILF Camp on early EDSA Revolution.",
            "On the Attack of Government Forces, they come secretly at night in barangay bansayan and they stay at the near of the MILF Camp Bansayan for almost 10hrs until 3:00AM and strike the Camp.",
            "One of the field commander who stayed long and withdrew later to fight is Commander Abiden Dimacuta Umpar because he handled a .30 machine gun."
        ],
        [
            "Contemporary era"
        ],
        [
            "On December 3, 2023, a bombing incident occurred at the Mindanao State University in Marawi City, Lanao del Sur, with the two main suspects later being identified by the Philippine National Police as residents of Barangay Gacap, Piagapo."
        ],
        [
            "Geography"
        ],
        [
            "It is located in the first district of the province of Lanao del Sur, Autonomous Region in Muslim Mindanao (ARMM) and has total land area of 340.09 square kilometers distributed over the 37 barangays that are predominantly populated by Maranao people."
        ],
        [
            "Barangays"
        ],
        [
            "Piagapo is politically subdivided into 37 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "These barangays are further grouped into 3 districts."
        ],
        [
            "Bubonga Marantao"
        ],
        [
            "Aposong"
        ],
        [
            "Bubo"
        ],
        [
            "Bualan"
        ],
        [
            "Bubonga Ilian"
        ],
        [
            "Bubonga Mamaanun"
        ],
        [
            "Bubonga Tawaan"
        ],
        [
            "Ilian Proper"
        ],
        [
            "Ilian Poblacion"
        ],
        [
            "Lumbaca Mamaanun"
        ],
        [
            "Mamaanun"
        ],
        [
            "Mentring"
        ],
        [
            "Palao"
        ],
        [
            "Paling"
        ],
        [
            "Paridi"
        ],
        [
            "Pindolonan"
        ],
        [
            "Rantian"
        ],
        [
            "Sapingit"
        ],
        [
            "Pat A Panoroganan"
        ],
        [
            "Bangco"
        ],
        [
            "Basak"
        ],
        [
            "Gacap"
        ],
        [
            "Katumbacan"
        ],
        [
            "Olango"
        ],
        [
            "Pantaon"
        ],
        [
            "Pantar"
        ],
        [
            "Radapan Poblacion"
        ],
        [
            "Radapan Proper"
        ],
        [
            "Tambo"
        ],
        [
            "Tapocan"
        ],
        [
            "Tawaan"
        ],
        [
            "Sundigan A Piagapo"
        ],
        [
            "Bagoingud"
        ],
        [
            "Bansayan"
        ],
        [
            "Kalungnan"
        ],
        [
            "Lininding"
        ],
        [
            "Palacat"
        ],
        [
            "Talao"
        ],
        [
            "Taporug"
        ],
        [
            "Udalo"
        ],
        [
            "Terrain and natural resources"
        ],
        [
            "The area is hilly and mountainous with scattered plain areas suitable for agricultural activities.",
            "These plain portions are either upland or lowland.",
            "It is rich in natural resources such as wide vast of forest area with varieties of good trees, rivers, springs and streams that have good potentials for further development.",
            "However, the local government unit should pay attention on the issues regarding illegal logging and kainging otherwise the community would be prone to erosion and landslides that will endanger many lives.",
            "The natural resources of the Municipality especially its wide and diverse forest should be protected and preserved."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Piagapo, Lanao de Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "18(64)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "159(6.3)"
        ],
        [
            "143(5.6)"
        ],
        [
            "166(6.5)"
        ],
        [
            "183(7.2)"
        ],
        [
            "357(14.1)"
        ],
        [
            "414(16.3)"
        ],
        [
            "333(13.1)"
        ],
        [
            "309(12.2)"
        ],
        [
            "289(11.4)"
        ],
        [
            "285(11.2)"
        ],
        [
            "253(10.0)"
        ],
        [
            "166(6.5)"
        ],
        [
            "3,057(120.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.4"
        ],
        [
            "17.2"
        ],
        [
            "20.6"
        ],
        [
            "23.4"
        ],
        [
            "29.3"
        ],
        [
            "29.2"
        ],
        [
            "29.9"
        ],
        [
            "29.4"
        ],
        [
            "27.7"
        ],
        [
            "28.7"
        ],
        [
            "25.5"
        ],
        [
            "19.9"
        ],
        [
            "299.2"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Piagapo being part of Lanao del Sur has predominantly cold climate.",
            "The climate observed in the community is very unpredictable where rainfalls are mostly observed during the month of July, August, September and October.",
            "Dry season is observed during summer the month of March, April and May.",
            "The Municipality is hilly and mountainous.",
            "The beautiful mountains with vast trees in the area serve as natural barriers against typhoon and strong wind and other natural calamities."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PiagapoYearPop.±% p.a.1970 7,248—    1975 12,920+12.29%1980 12,108−1.29%1990 16,730+3.29%1995 19,198+2.61%2000 23,903+4.81%2007 34,792+5.31%2010 21,974−15.40%2015 25,440+2.83%2020 30,132+3.38%Source: Philippine Statistics Authority"
        ],
        [
            "The Municipality of Piagapo is a Muslim area that is predominantly populated by Maranao tribe who are culturally bounded people.",
            "Its people, majority of which, do not accept birth control, birth spacing and other methods.",
            "They believe it is against their religious belief.",
            "However, majority of them learned to accept other health intervention particularly to maintain and improve health status.",
            "This belief and value of the people of Piagapo had caused an increase in its population from time to time.",
            "This is revealed by the different census conducted by NSO in different year.",
            "The latest and current population of the municipality as distributed to its 37 barangays is 21,974 as shown in the table below.",
            "The average household size is 3.78 or 4 persons per household.",
            "But based on 2007 census of population, Piagapo has 5,417 household and the average household size is 6.42."
        ],
        [
            "Population growth rate"
        ],
        [
            "The population of Piagapo varies according to the different population census conducted by the NSO, at an increasing trend.",
            "In 1995, its total population was 19,198.",
            "It increased by about 4,705 or 24.50% in a span of five years.",
            "Hence, the annual growth rate between the 1995 and 2000 was 4.5%.",
            "In 2007, another census was conducted by the NSO.",
            "That census that revealed that Piagapo's population was increased to 34,792.",
            "Between 2000 and 2007, the population increased by 10,889 or 45.5% for a span of 7 years.",
            "Hence, the population growth rates is 6.5% annually, which is very high.",
            "However, it was somehow unbelievable and unrealistic, that between 2007 and 2010, The population of Piagapo tremendously declined from 34,792 to 21,974 in just a span of 3 years.",
            "The decrease was unusual and very abrupt.",
            "The constituents of Piagapo could not believe it, even when some of the residents migrated to other areas in the Philippines temporarily after occurrence of the all-out war against the MILF in the previous years."
        ],
        [
            "Economy"
        ],
        [
            "Poverty Incidence of Piagapo"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "80"
        ],
        [
            "90"
        ],
        [
            "2000  79.52"
        ],
        [
            "2003  58.46"
        ],
        [
            "2006  38.60"
        ],
        [
            "2009  36.96"
        ],
        [
            "2012  81.38"
        ],
        [
            "2015  68.07"
        ],
        [
            "2018  83.94"
        ],
        [
            "2021  15.62"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agricultural products"
        ],
        [
            "People of Piagapo are mostly farmers by occupation who generally produce corn, rice as major agricultural products.",
            "However, there are few of them who also plant other agricultural products such as trees like mahogany, acacia, and various fruit trees.",
            "Vegetables, species and root crops particularly cassava, camote and the like are among the secondary products in the municipality.",
            "Due to problem on farm to market road, farmers usually produce mostly for home consumption."
        ],
        [
            "Livestock"
        ],
        [
            "Aside from producing agricultural products as the main source of income, some of the residents in the municipality raised carabaos, and cows as working animals.",
            "Poultry products such as chicken, duck, and goose are also raised but in limited number and for household consumption only.",
            "Raising poultry products is a way of subsidizing the basic needs of the people.",
            "Raising livestock like chicken is becoming very discouraging due to lack of knowledge on controlling disease of this livestock.",
            "Livestock like carabao and cows are in some cases raised in the community by some well off families, farmers and landlord in limited quantity and mainly as work animal or some times for rent."
        ],
        [
            "Market outlet"
        ],
        [
            "Farm-to-Market road has been a problem almost all over the municipality.",
            "Poor road coupled with the absence of Municipal Local Public Market, make it more difficult for the farmers to market their products.",
            "The agricultural products are usually marketed either to Saguiaran, Baloi, Lanao del Norte, Pantaoaragat and Iligan City.",
            "The decision of the farmers where to market their products is usually dependent on the price offered by the different buyers/middlemen available in the above-mentioned market areas.",
            "However, more frequently the price offered is unreasonable.",
            "In addition thereto, the expensive transportation cost of products makes farming a losing, discouraging and undesirable low profile venture to the people.",
            "Hence, the municipality, in cooperation with other agencies, should give careful attention to these issues and should provide, improve and rehabilitate farm to market road and educate farmers on adoptable agricultural technology and provide a centralized Public Market in a strategic area in the locality where the products of the farmers can be marketed at reasonable fair price and less transportation cost."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "The accessibility and availability of farm-to-market roads has been a widely known issue of the people of Piagapo for many years, especially those residents from the far flung and interior areas of the municipality which usually use horses as the primary mode of transportation.",
            "Though some barangays can somehow be reached through land transportation via Saguiaran, through the long winding provincial road that transverse the municipality, and through barangay road extending from Barangay Kabingan, MSU, Marawi City to Barangay Bobo, Piagapo, most areas are still inaccessible.",
            "Not all kinds of vehicle can access the area due to the condition of the provincial road and several barangay roads.",
            "The provincial road is segmented road.",
            "Some parts are cemented while several portions are still earth fill and impassable or inaccessible like TAPORUG, TALAO, KALUNGUNAN, BAGOA INGUD, LININDING, GACAP, BANGCO, and PALACAT especially during rainy season.",
            "They usually use horses as the primary mode of transportation."
        ],
        [
            "Availability of electricity"
        ],
        [
            "Availability of electric power has been one of the major problems in Piagapo for a very long period of time.",
            "While 20 or 50% of the 37 barangays were provided with electricity by LASURECO, it is undeniable that the supply or availability of electricity in the locality is not regular.",
            "In fact, 17 barangays (46%) have been dwelling in darkness for a long period of time and had been longing and very eager to avail to such basic service while the rest are asking for its sustainability.",
            "Just recently, last August 2013, the municipality is totally in darkness, no electricity in the whole area of Piagapo.",
            "The irregularity of electric power in the municipality does not only hamper the development of the area but also slow down and seriously affect the performance and delivery of some services of the LGU.",
            "Moreover, the connection or installation of electric wiring has to be improved to avoid accidents and unwanted events relative to electricity."
        ],
        [
            "Education"
        ],
        [
            "The Department of Education (DepEd) has been exerting effort and great investment to address the needs for quality education and make it available on a vastly wider scale to develop those potentials.",
            "Presently, DepEd has the following number schools of different levels addressing the needs for quality education.",
            "The municipality of Piagapo is among the depressed areas that are confronted with problems on illiteracy.",
            "Illiteracy problem has been obvious in the area which is one among the major factors that hampers development."
        ],
        [
            "Government"
        ],
        [
            "The municipal hall of Piagapo is situated at Barangay Bobo, the first barangay to be reached from Saguiaran, Lanao del Sur, with an area of 11,270 square meter."
        ],
        [
            "Elected officials 2022-2025:"
        ],
        [
            "Municipal Mayor: Ali L. Sumandar"
        ],
        [
            "Vice Mayor: Norombae Manalocon- Sumandar"
        ],
        [
            "Sangguniang Bayan:"
        ],
        [
            "Abubacar L. Sumandar"
        ],
        [
            "Mosatafa D. Panganting"
        ],
        [
            "Mano L. Acoon"
        ],
        [
            "Suhaylah M. Mulok"
        ],
        [
            "Macacuna M. Banisil"
        ],
        [
            "Samanuddin M. Bazer"
        ],
        [
            "Shamil M. Campong"
        ],
        [
            "Samsodin M. Mamao"
        ],
        [
            "ABC President: Camarudin M. Mulok"
        ],
        [
            "SK President : Hafsha Junayya L. Mangompia"
        ],
        [
            "SB Secretary: Nasser B. Lumabao"
        ],
        [
            "List of former chief executives"
        ],
        [
            "Datu Dimapunung Limbo"
        ],
        [
            "Hadji AbdulRahman Masiu Orangot"
        ],
        [
            "Maungangun Macalimbon"
        ],
        [
            "Guimba Mandangan"
        ],
        [
            "Bashier Amairomag"
        ],
        [
            "Manaros Barao"
        ],
        [
            "Sultan Jabber Amairomag"
        ],
        [
            "Mitoon Ampang"
        ],
        [
            "Manso Panganting"
        ],
        [
            "Sultan Pindaton H. Omar"
        ],
        [
            "Sultan Mawiyag Acoon"
        ],
        [
            "Macondara Compa"
        ],
        [
            "Amrossi Macatanong"
        ],
        [
            "Umohanie B. Macatanong"
        ],
        [
            "Ali L. Sumandar"
        ],
        [
            "Mayors under the Fifth Republic"
        ],
        [
            "1986 - 1988 Datu Mitoon M. Ampang"
        ],
        [
            "1988 - 1989 Tago Panganting"
        ],
        [
            "1989 - 1992 Sultan Mawiyag Acoon"
        ],
        [
            "1992 - 1995, Sultan Mawiyag Acoon"
        ],
        [
            "1995 - Jan. 1998 Sultan Mauyag Acoon"
        ],
        [
            "Jan 1998- Jun 1998 Macondara Compa (Succeeded Mauyag Acoon due to untimely death)"
        ],
        [
            "1998 - 2001 Macondara Compa"
        ],
        [
            "2001- 2004 Amrossi A. Macatanong"
        ],
        [
            "2004 - 2007 Amrossi A. Macatanong"
        ],
        [
            "2007 - 2010 Amrossi A. Macatanong"
        ],
        [
            "2010 - 2013 Umohanie Bato-Macatanong"
        ],
        [
            "2013 - 2016 Ali L. Sumandar"
        ],
        [
            "2016 - 2019 Ali L. Sumandar"
        ],
        [
            "2019 - Present Cadidia M. Lininding"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Piagapo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Bangsamoro (BARMM)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Ermac, Bonita (December 7, 2023).",
            "\"Police identify 2 POIs in December 3 Marawi bombing\".",
            "Manila Bulletin.",
            "Marawi City: Manila Bulletin Publishing Corporation.",
            "Retrieved December 9, 2023."
        ],
        [
            "^ \"Piagapo, Lanao del Sur : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved January 27, 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Lanao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Piagapo."
        ],
        [
            "Piagapo Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Piagapo"
        ],
        [
            "Munai, Lanao del Norte"
        ],
        [
            "Balindong"
        ],
        [
            "Piagapo"
        ],
        [
            "Pantao Ragat, Lanao del Norte"
        ],
        [
            "Saguiaran"
        ],
        [
            "vte Province of Lanao del SurMarawi (capital)Municipalities"
        ],
        [
            "Amai Manabilang"
        ],
        [
            "Bacolod-Kalawi"
        ],
        [
            "Balabagan"
        ],
        [
            "Balindong"
        ],
        [
            "Bayang"
        ],
        [
            "Binidayan"
        ],
        [
            "Buadiposo-Buntong"
        ],
        [
            "Bubong"
        ],
        [
            "Butig"
        ],
        [
            "Calanogas"
        ],
        [
            "Ditsaan-Ramain"
        ],
        [
            "Ganassi"
        ],
        [
            "Kapai"
        ],
        [
            "Kapatagan"
        ],
        [
            "Lumba-Bayabao"
        ],
        [
            "Lumbaca-Unayan"
        ],
        [
            "Lumbatan"
        ],
        [
            "Lumbayanague"
        ],
        [
            "Madalum"
        ],
        [
            "Royal Sultanate of Madamba"
        ],
        [
            "Maguing"
        ],
        [
            "Malabang"
        ],
        [
            "Marantao"
        ],
        [
            "Marogong"
        ],
        [
            "Masiu"
        ],
        [
            "Mulondo"
        ],
        [
            "Pagayawan"
        ],
        [
            "Piagapo"
        ],
        [
            "Picong"
        ],
        [
            "Poona Bayabao"
        ],
        [
            "Pualas"
        ],
        [
            "Saguiaran"
        ],
        [
            "Sultan Dumalondong"
        ],
        [
            "Tagoloan"
        ],
        [
            "Tamparan"
        ],
        [
            "Taraka"
        ],
        [
            "Tubaran"
        ],
        [
            "Tugaya"
        ],
        [
            "Wao"
        ],
        [
            "Component city"
        ],
        [
            "Marawi"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Piagapo&oldid=1222311992\""
        ],
        [
            "Categories: Municipalities of Lanao del SurPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataWikipedia articles with style issues from September 2014All articles with style issuesWikipedia articles that are excessively detailed from September 2014All articles that are excessively detailedArticles needing additional references from September 2014All articles needing additional referencesArticles with multiple maintenance issuesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles with specifically marked weasel-worded phrases from January 2017All articles with unsourced statementsArticles with unsourced statements from December 2023Articles with unsourced statements from May 2020Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}