{
    "name": "Pikit",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pikit"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°03′N 124°40′E﻿ / ﻿7.05°N 124.67°E﻿ / 7.05; 124.67"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cotabato, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Pikit\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Soccsksargen, PhilippinesPikitMunicipalityMunicipality of PikitPikit Public Market and Terminal"
        ],
        [
            "FlagSealMap of Cotabato with Pikit highlightedOpenStreetMapPikitLocation within the PhilippinesCoordinates: 7°03′N 124°40′E﻿ / ﻿7.05°N 124.67°E﻿ / 7.05; 124.67CountryPhilippinesRegionSoccsksargenProvinceCotabatoDistrict"
        ],
        [
            "1st districtFoundedJune 17, 1913CharteredSeptember 29, 1949Barangays42"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorSumulong K. Sultan • Vice MayorMuhyryn D. Sultan-Casi • RepresentativeJoselito S. Sacdalan • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Sitty Nursheena D. SultanAl D. MangansakanMelhan T. HamidMama G. KongkongDatu Turno K. SultanAlex A. DalandagJeyrick A. MangansakanPerfecto F. Raagas III"
        ],
        [
            " • Electorate29,794 voters (2022)Area"
        ],
        [
            " • Revenue₱ 450.7 million (2020) • Assets₱ 509.4 million (2020) • Expenditure₱ 389.7 million (2020) • Liabilities₱ 68.01 million (2020)Service provider • ElectricityCotabato Electric Cooperative (COTELCO)Time zoneUTC+8 (PST)ZIP code9409PSGC124712000IDD : area code +63 (0)64Native languagesMaguindanao Hiligaynon Cebuano Ilianen TagalogWebsitewww.pikit-cotabatoprov.gov.ph"
        ],
        [
            "Pikit, officially the Municipality of Pikit (Maguindanaon: Inged nu Pikit, Jawi: ايڠد نو ڤيكت; Hiligaynon: Banwa sang Pikit; Cebuano: Lungsod sa Pikit; Tagalog: Bayan ng Pikit)  is a 1st class municipality in the province of Cotabato, Philippines.",
            "According to the 2020 census, it has a population of 67,024 people."
        ],
        [
            "History"
        ],
        [
            "Aerial view of Pikit, 1935"
        ],
        [
            "Pikit was the oldest settlement ever founded in Cotabato province.",
            "The landmark which eventually became the town's namesake, Fort Pikit, was established in 1893 by the Spaniards who have by then just recently conquered what is now the province of Cotabato from the Sultanate of Maguindanao.",
            "The name \"Pikit\" was given to the place by the Spaniards.",
            "It was formerly called by the natives \"Malasiquit\" because it was situated within the shadows of hills situated to each other.",
            "The fort was built to consolidate their hold in the region."
        ],
        [
            "The Spaniards abandoned Fort Pikit at the end of the 19th century, which paved the way for the eventual American occupation in 1902."
        ],
        [
            "Under the Osmeña Colony Act of 1912, Pikit was founded on June 17, 1913, by the first Christian Filipino colonists from the Province of Cebu.",
            "About one hundred twenty Cebuanos came under the Colony Agent, Vicente Lozada.",
            "The first batch of colonists from Cebu arrived at Fort Pikit after two days of sailing on board a river boat called \"Hall\", followed the Rio Grande de Mindanao."
        ],
        [
            "The Rio Grande where the colonists landed is now a corn field.",
            "It became dry land due to the cut-off river found in Kulanguan, Tunggol, Pagalungan, Maguindanao."
        ],
        [
            "The first batch of colonists were distributed at Ladtingan, Calawag, Ginatilan, Panicupan, Manding and Inug-ug .They belonged to Colony No.",
            "1, while other colonists followed in 1914 up to 1915 and they were assigned in the following colonies, Colony No.",
            "2 (Paidu Pulangi) Colony no.",
            "3 (Silik) Colony No.",
            "4 (Makasendeg) Colony No.",
            "5 (Pagalungan) and Colony No.7 (Talitay)."
        ],
        [
            "Those who came in 1918 from the Visayas and Luzon were called homeseekers, immigrants, and settlers because the government did not give them anymore free transportation and ration in their coming."
        ],
        [
            "During the Colony days the Colonies had a special government under the administration of the Colony Superintendent; Mr. Maximo Abad was then appointed.",
            "Mr. Miguel Jacosalem, Asst.",
            "Supt.",
            "for Colony No.",
            "3, Datu Abdula Piang, Asst.",
            "Supt.",
            "for Colony No.",
            "3, Mr. Tuan Afdal, Asst.",
            "Supt.",
            "for Colony No.",
            "4, Mr. Ruperto Gemarino, Asst.",
            "Supt.",
            "for Colony No.",
            "5 and Mr. Primo Curo, Astt.",
            "Supt.",
            "for Colony No.",
            "7."
        ],
        [
            "Schools were opened in the Colonies.",
            "The first school opened was Ladtingan which James E. McCall was assigned as Supervisor.",
            "The first teachers were Frucosa Lucero and Ponciana Lucero."
        ],
        [
            "In 1924, the colonists began to fight for the townsite and local autonomy, for the creation of Pikit into a regular municipality."
        ],
        [
            "In 1928, the Colony Administration was turned over to the Bureau of Lands.",
            "Pikit was created a Municipal District, including the new municipality of Pagalungan."
        ],
        [
            "In 1935, the construction of the Cotabato-Davao national Highway helped enhance the progress of this town.",
            "This road passes through the heart of Pikit.",
            "It afforded a faster and more convenient means of transportation and shipment of farm products."
        ],
        [
            "In the early part of 1947 this Municipal District was created into a regular municipality, as the Municipality of Pagalungan and Pikit as a barrio, Mr. Gorgonio P. Initan was the first appointed mayor who was also the first elected mayor because this year was also the election of the municipal officials.",
            "The seat of Government was in Pagalungan."
        ],
        [
            "On May 9, 1948, the Barrio Planning Personnel accompanied by Atty.",
            "Sergio F. Tocao, came to Pikit.",
            "This marked the triumph of the colonists for the establishment of Manding as a townsite."
        ],
        [
            "In September 29, 1949, Pikit was created a regular municipality by Executive Proclamation with Manding as the seat of the municipal government.",
            "This ended the struggle of the colonists and marked the fulfillment of their aspirations.",
            "Pikit was created out of the municipality of Pagalungan."
        ],
        [
            "Pikit was proclaimed into a regular municipality thru the efforts of then Congressman Gumbay Piang and Governor Duma Sinsuat by virtue of Executive Order No.",
            "270 with its townsite at Manding."
        ],
        [
            "The territory was reduced when, through Batas Pambansa Blg.",
            "206 of 1982, 19 barangays  were separated to create the municipality of Aleosan."
        ],
        [
            "The so-called Pikit War between Muslim separatists and the Philippines army took place there in early 2003."
        ],
        [
            "Partial inclusion to the Bangsamoro"
        ],
        [
            "In 2019, twenty-two barangays were among the 63 in the province which became part of the Special Geographic Area of the newly-created Bangsamoro,"
        ],
        [
            "In 2023, the Bangsamoro Parliament approved the creation of eight new municipalities in the area."
        ],
        [
            "Geography"
        ],
        [
            "The municipality is bounded on the north by the Municipality of Aleosan, on the south by Pagalungan, Maguindanao, on the west by the Municipality of Midsayap and the Liguasan marsh and on the east by the Municipality of Datu Montawal."
        ],
        [
            "Barangays"
        ],
        [
            "Pikit is politically subdivided into 20 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Balabak"
        ],
        [
            "Balatican"
        ],
        [
            "Bulod"
        ],
        [
            "Calawag"
        ],
        [
            "Dalingaoen (Lalingaon)"
        ],
        [
            "Damalasak"
        ],
        [
            "Ginatilan"
        ],
        [
            "Inug-ug"
        ],
        [
            "Kalacacan"
        ],
        [
            "Katilacan"
        ],
        [
            "Kolambog"
        ],
        [
            "Ladtingan"
        ],
        [
            "Lagunde"
        ],
        [
            "Langayen"
        ],
        [
            "Manaulanan"
        ],
        [
            "Paidu Pulangi"
        ],
        [
            "Poblacion"
        ],
        [
            "Punol"
        ],
        [
            "Silik"
        ],
        [
            "Takepan"
        ],
        [
            "Talitay"
        ],
        [
            "Tinutulan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Pikit, Cotabato"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(89)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "19(0.7)"
        ],
        [
            "14(0.6)"
        ],
        [
            "15(0.6)"
        ],
        [
            "18(0.7)"
        ],
        [
            "33(1.3)"
        ],
        [
            "42(1.7)"
        ],
        [
            "44(1.7)"
        ],
        [
            "42(1.7)"
        ],
        [
            "30(1.2)"
        ],
        [
            "31(1.2)"
        ],
        [
            "28(1.1)"
        ],
        [
            "17(0.7)"
        ],
        [
            "333(13.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "6.9"
        ],
        [
            "5.6"
        ],
        [
            "6.9"
        ],
        [
            "15.2"
        ],
        [
            "15.1"
        ],
        [
            "17.5"
        ],
        [
            "17.8"
        ],
        [
            "18.5"
        ],
        [
            "14.9"
        ],
        [
            "14.9"
        ],
        [
            "12.4"
        ],
        [
            "8.0"
        ],
        [
            "153.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PikitYearPop.±% p.a.1960 34,150—    1970 55,423+4.96%1975 45,220−4.00%1980 53,804+3.54%1990 51,421−0.45%1995 57,909+2.25%2000 68,455+3.65%2007 96,372+4.83%2010 113,014+5.97%2015 154,441+6.13%2020 67,024−15.14%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Pikit, Cotabato, was 67,024 people, with a density of 110 inhabitants per square kilometre or 280 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Pikit"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  51.90"
        ],
        [
            "2009  48.53"
        ],
        [
            "2012  57.83"
        ],
        [
            "2015  58.80"
        ],
        [
            "2018  44.00"
        ],
        [
            "2021  40.58"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "A major producer of corn with area planted of 5,074 hectares and production of 13,310 tons per year.",
            "The municipality is also a major producer of coconut and freshwater fish.",
            "Coconut meat or copra is made from mature coconut nuts.",
            "It is done by splitting the nut and drying the coconut meat by solar drying or by the use of dryers.",
            "Upon reaching a moisture content of about 14 to 16%, it is packed in PE sacks of 50 to 60 kg in weight.",
            "Copra is the major raw material used in production of refined edible cooking oil and other coconut based products."
        ],
        [
            "The Gross Domestic Product of the Municipality (2022) is 17,966,165,354(PHP)."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Pikit |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"PIKIT\".",
            "Archived from the original on May 4, 2011."
        ],
        [
            "^ \"Batas Pambansa Blg.",
            "141\".",
            "Legislative Digital Resources.",
            "Senate of the Philippines.",
            "March 25, 1982.",
            "Retrieved March 6, 2024."
        ],
        [
            "^ Cabrera, Ferdinandh (November 21, 2019).",
            "\"NorthCot turns over 63 barangays to Bangsamoro region\".",
            "MindaNews.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ Fonbuena, Carmela (February 8, 2019).",
            "\"63 out of 67 barangays in Cotabato to join Bangsamoro region\".",
            "Rappler.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ \"Proclamation No.",
            "656, s. 2019\".",
            "Legislative Digital Resources.",
            "Senate of the Philippines.",
            "January 21, 2019.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ Arguillas, Carolyn (January 14, 2019).",
            "\"67 villages in 7 North Cot towns will vote in Feb. 6 Bangsamoro plebiscite\".",
            "MindaNews.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ \"Republic Act No.",
            "11054\".",
            "Legislative Digital Resources.",
            "Senate of the Philippines.",
            "July 27, 2018.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ Rebollido, Rommel; Cabrera, Ferdinandh (August 18, 2023).",
            "\"BARMM parliament approves creation of 8 towns in Cotabato province\".",
            "Rappler.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ Patinio, Ferdinand (March 4, 2024).",
            "\"Nearly 90K voters to join plebiscite on creation of 8 Cotabato towns\".",
            "Philippine News Agency.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ Medenilla, Samuel (April 10, 2024).",
            "\"Plebiscite for SGA in BARMM set April 13\".",
            "BusinessMirror.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ Bolledo, Jairo (April 13, 2024).",
            "\"BARMM residents approve creation of 8 more towns\".",
            "Rappler.",
            "Retrieved April 13, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: North Cotabato\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Pikit: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved January 30, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XII (Soccsksargen)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XII (Soccsksargen)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of North Cotabato\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ Total Population, Household Population, Number of Households, and Average Household Size by Region, Province, and City/Municipality: Philippines, 2020.",
            "PSA.",
            "March 23, 2022."
        ],
        [
            "^ \"PSA Board Resolution No.",
            "13, Series of 2021: Approving and Adopting the Third Quarter 2021 Philippine Standard Geographic Code Updates to Include the Bangsamoro Autonomous Region in Muslim Mindanao (Barmm) and Correct the Names of 37 Barangays\" (PDF).",
            "Philippine Statistics Authority.",
            "2021.",
            "Retrieved April 1, 2022."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Pikit Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Pikit"
        ],
        [
            "Aleosan"
        ],
        [
            "Carmen"
        ],
        [
            "Midsayap"
        ],
        [
            "Pikit"
        ],
        [
            "Datu Montawal, Maguindanao"
        ],
        [
            "Datu Saudi-Ampatuan, Maguindanao"
        ],
        [
            "Rajah Buayan, Maguindanao"
        ],
        [
            "Pagalungan, Maguindanao"
        ],
        [
            "Articles Related to Pikit, Cotabato"
        ],
        [
            "vte Province of CotabatoKidapawan (capital)Municipalities"
        ],
        [
            "Alamada"
        ],
        [
            "Aleosan"
        ],
        [
            "Antipas"
        ],
        [
            "Arakan"
        ],
        [
            "Banisilan"
        ],
        [
            "Carmen"
        ],
        [
            "Kabacan"
        ],
        [
            "Libungan"
        ],
        [
            "Magpet"
        ],
        [
            "Makilala"
        ],
        [
            "Matalam"
        ],
        [
            "Midsayap"
        ],
        [
            "M'lang"
        ],
        [
            "Pigcawayan"
        ],
        [
            "Pikit"
        ],
        [
            "President Roxas"
        ],
        [
            "Tulunan"
        ],
        [
            "Component city"
        ],
        [
            "Kidapawan"
        ],
        [
            "Related"
        ],
        [
            "Symbols"
        ],
        [
            "Special Geographic Area (part of Bangsamoro)"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pikit&oldid=1224953383\""
        ],
        [
            "Categories: Municipalities of CotabatoPopulated places on the Rio Grande de MindanaoHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Articles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles with VIAF identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}