{
    "name": "Plaridel",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Plaridel, Misamis Occidental"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°37′17″N 123°42′36″E﻿ / ﻿8.6214°N 123.7101°E﻿ / 8.6214; 123.7101"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Misamis Occidental, Philippines"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesPlaridelMunicipalityMunicipality of PlaridelPort of Plaridel"
        ],
        [
            "FlagSealMap of Misamis Occidental with Plaridel highlightedOpenStreetMapPlaridelLocation within the PhilippinesCoordinates: 8°37′17″N 123°42′36″E﻿ / ﻿8.6214°N 123.7101°E﻿ / 8.6214; 123.7101CountryPhilippinesRegionNorthern MindanaoProvinceMisamis OccidentalDistrict"
        ],
        [
            "1st districtFounded1907Named forPen name of Marcelo H. del PilarBarangays33"
        ],
        [
            "  (see Barangays)Government  • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jose \"Nonoy\" H. Enguito Jr. (ASPIN)Henry M. Bulawin (ASPIN)Gerald G. Tatad (PDPLBN)Severino \"Jun\" E. Maquiling (PDPLBN)Myra L. Pluma (ASPIN)Recardo P. Magsalay (PDPLBN)Ambrocio \"Am-Am\" D. Cinches (ASPIN)Marilou V. Yap (NUP)"
        ],
        [
            " • Electorate28,834 voters (2022)Area • Revenue₱ 169.2 million (2020) • Assets₱ 371.8 million (2020) • Expenditure₱ 144.7 million (2020) • Liabilities₱ 79.34 million (2020)Service provider • ElectricityMisamis Occidental 1 Electric Cooperative (MOELCI 1)Time zoneUTC+8 (PST)ZIP code7209PSGC104212000IDD : area code +63 (0)88Native languagesSubanon Cebuano TagalogWebsitewww.plaridelmisocc.gov.ph"
        ],
        [
            "Plaridel, officially the Municipality of Plaridel (Cebuano: Lungsod sa Plaridel; Tagalog: Bayan ng Plaridel), is a 3rd class municipality in the province of Misamis Occidental, Philippines.",
            "According to the 2020 census, it has a population of 39,840 people."
        ],
        [
            "History"
        ],
        [
            "The Municipal Government of Plaridel was one of the original towns of the Province of Misamis before it was divided into two (2) provinces (Oriental & Occidental) under Legislative Act.",
            "No.",
            "3537 passed November 2, 1929."
        ],
        [
            "Subanon people, also known as Suban-on, Subanons or Subanens are the original settlers of the town.",
            "The word \"Suba\" means a river, while the suffix -nun or -nen means place of origin, attributing that Subanens were river dwellers.",
            "They cultivated vast lands along Langaran River, from the word “LANGANAN”, the local term for “delay”.",
            "A river so named because of its circuitous, winding route that traverses many kilometers.",
            "This river then was the highway by which people travelled on to reach the different settlements located along the riverbanks.",
            "Tales have it that the first Spaniard who arrived in one of the riverbank settlements asked what the name of the place was.",
            "Thinking that the Spaniard was asking for the name of the river, the settlers answered, “LANGANAN”."
        ],
        [
            "The Spaniard found it hard to pronounce and instead uttered “LANGARAN” .",
            "This became the name of the place which now is the Municipality of Plaridel.",
            "Original settlers of LANGARAN were the Subanens.",
            "Farming, fishing and hunting were their means of livelihood.",
            "With their slash and burn (Kaingin) way of farming, they opened tracts of land for agricultural purposes.",
            "These tracts were later on bartered for axe heads and salt with the migrants."
        ],
        [
            "Langaran retained its territory by 1903 when the number of municipalities in the then-undivided Misamis decreased through Act No.",
            "951, issued on October 21."
        ],
        [
            "The town name \"Langaran\" was changed into “Plaridel” in the year 1914 by the Philippine Legislature Act No.",
            "2390 enacted on February 28, 1914.",
            "From that period the town Langaran disintegrated bringing along a big portion of its territorial area which later on formed into a separate municipality now known as the Municipality of Sapang Dalaga and the district of Concepcion.",
            "Later on, the sitio of Daisug became a town now known as the Municipality of Lopez Jaena.",
            "During the administration of then President Manuel Acuna Roxas, Sitio Solinog now known as Calamba was created into a separate municipality."
        ],
        [
            "Geography"
        ],
        [
            "The Municipality of Plaridel is situated at the northern portion of the Province of Misamis Occidental.",
            "It is bounded by three municipalities: Baliangao to the north, Lopez Jaena to the south and Calamba to the west.",
            "The Mindanao Sea cradles Plaridel to the east.",
            "It is composed of thirty-three (33) barangays with a total area of 8,000 hectares."
        ],
        [
            "It is located between the major cities of Ozamis (67 km) and Dipolog (68 km) of Zamboanga del Norte.",
            "Plaridel can be reached from Manila or Cebu by plane through these cities.",
            "It can also be reached by boat from Manila or Cebu to Ozamis, Dipolog or even direct to Plaridel.",
            "It also has a harbor in Looc that is very well sheltered from strong winds.",
            "A passenger boat (Lite Shipping) travels to Cebu City every Tuesday, Thursday and Sunday, with stops in Siquijor and Tagbilaran, Bohol.",
            "Daily boat service to Cebu is also available in the port of Ozamiz City about 67 kilometres (42 mi) to the south."
        ],
        [
            "It has an average elevation of 23 metres (75 ft) above sea level with undulating terrain.",
            "A creek is located on the western side of the area that flows to Lobog River."
        ],
        [
            "Land use, topography and slope"
        ],
        [
            "Plaridel is suited for intensive agriculture since 51% of the land area is level to gently sloping.",
            "Rolling hills are found at the southern portion extending to the boundaries of the Municipalities of Calamba and Lopez Jaena."
        ],
        [
            "The existing general land use of Plaridel are classified into: Built-up, Agricultural, Timberland,Nipaland, special uses and other uses such as Riparian Zone, Cemeteries, Roads and Streets, Water Bodies.",
            "Of the total land area of the municipality, agricultural area got the biggest chunk; it has 7,385 hectares or about 92% of the municipal land area.",
            "Built up in most barangays are concentrated on 6 urban barangays of No.",
            "Poblacion, Southern Poblacion, Southern Looc, Looc Proper, Eastern Looc and Lao Proper and along major roads and thoroughfares, the total built-up area of the 33 barangays comprises about 4%.",
            "Timberland or Mangrove areas are concentrated at the southern and northern boundaries of the municipality."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Plaridel, Misamis Occidental"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "69(2.7)"
        ],
        [
            "44(1.7)"
        ],
        [
            "37(1.5)"
        ],
        [
            "29(1.1)"
        ],
        [
            "87(3.4)"
        ],
        [
            "137(5.4)"
        ],
        [
            "131(5.2)"
        ],
        [
            "141(5.6)"
        ],
        [
            "143(5.6)"
        ],
        [
            "134(5.3)"
        ],
        [
            "68(2.7)"
        ],
        [
            "53(2.1)"
        ],
        [
            "1,073(42.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "9.9"
        ],
        [
            "7.6"
        ],
        [
            "7.4"
        ],
        [
            "8.1"
        ],
        [
            "21.6"
        ],
        [
            "26.5"
        ],
        [
            "26.4"
        ],
        [
            "26.6"
        ],
        [
            "25.8"
        ],
        [
            "24.3"
        ],
        [
            "15.1"
        ],
        [
            "10.4"
        ],
        [
            "209.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Plaridel is politically subdivided into 33 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Agunod"
        ],
        [
            "Bato"
        ],
        [
            "Buena Voluntad"
        ],
        [
            "Calaca-an"
        ],
        [
            "Cartagena Proper"
        ],
        [
            "Catarman"
        ],
        [
            "Cebulin"
        ],
        [
            "Clarin"
        ],
        [
            "Danao"
        ],
        [
            "Deboloc"
        ],
        [
            "Divisoria"
        ],
        [
            "Eastern Looc"
        ],
        [
            "Ilisan"
        ],
        [
            "Katipunan"
        ],
        [
            "Kauswagan"
        ],
        [
            "Lao Proper"
        ],
        [
            "Lao Santa Cruz"
        ],
        [
            "Looc Proper"
        ],
        [
            "Mamanga Daku"
        ],
        [
            "Mamanga Gamay"
        ],
        [
            "Mangidkid"
        ],
        [
            "New Cartagena"
        ],
        [
            "New Look"
        ],
        [
            "Northern Poblacion"
        ],
        [
            "Panalsalan"
        ],
        [
            "Puntod"
        ],
        [
            "Quirino"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Southern Looc"
        ],
        [
            "Southern Poblacion"
        ],
        [
            "Tipolo"
        ],
        [
            "Unidos"
        ],
        [
            "Usocan"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PlaridelYearPop.±% p.a.1903 11,318—    1918 12,211+0.51%1939 21,905+2.82%1948 15,072−4.07%1960 18,503+1.72%1970 21,627+1.57%1975 22,052+0.39%1980 26,060+3.40%YearPop.±% p.a.1990 28,824+1.01%1995 29,134+0.20%2000 29,279+0.11%2007 33,073+1.69%2010 35,251+2.35%2015 38,900+1.89%2020 39,840+0.47%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Plaridel, Misamis Occidental, was 39,840 people, with a density of 500 inhabitants per square kilometre or 1,300 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Plaridel"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  44.30"
        ],
        [
            "2009  35.17"
        ],
        [
            "2012  37.41"
        ],
        [
            "2015  34.48"
        ],
        [
            "2018  23.75"
        ],
        [
            "2021  27.07"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Just like other municipalities in the province, Plaridel's economy depends on agriculture.",
            "Coconut has the biggest area with more than 6,000 hectares, other crops are planted under coconut such as banana, corn, fruit trees such as mango, pomelo and lanzones.",
            "Rootcrops also are planted under coconut such as sweet potato, cassava and others."
        ],
        [
            "Rice ranked as 2nd in the municipality in terms of area planted and 2nd also in the entire province of Misamis Occidental but ranked 1st, in terms of productivity.",
            "Rice are harvested 5 times in 2 years with a yield of 6-6.5MT/ha."
        ],
        [
            "Unlike other municipalities in the province, Plaridel is a member of the League of Organic Agriculture Municipalities (LOAM) in the Philippines.",
            "It grows organic, and rice is farmed using rice-duck farming technology, balanced fertilization and the use of vermi fertilizers."
        ],
        [
            "The municipality of Plaridel has a poverty incidence of 37.4.",
            "This is due mainly to insufficient income derived from agriculture and fisheries.",
            "Plaridel has an average landholding of 1.5 hectares/household."
        ],
        [
            "Government"
        ],
        [
            "The newly-elected Municipal Mayor of the town is Gadwin Estabas Handumon a businessman/Economist, who won the 2022 election with a lead of 1,270 votes against his opponent; Municipal Vice Mayor Rolando Manuel Ty."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council (2022-2025): Team Asenso Plaridel"
        ],
        [
            "Municipal Mayor: Gadwin E. Handumon"
        ],
        [
            "Municipal Vice Mayor: Neite O. Gornez"
        ],
        [
            "Congressman (1st District): Jason P. Almonte"
        ],
        [
            "SB Members:"
        ],
        [
            "Jose H. Enguito Jr."
        ],
        [
            "Henry M. Bulawin"
        ],
        [
            "Gerald G. Tatad"
        ],
        [
            "Severino E. Maquiling"
        ],
        [
            "Myra L. Pluma"
        ],
        [
            "Recardo P. Magsalay"
        ],
        [
            "Ambrocio D. Cinches"
        ],
        [
            "Marilou V. Yap"
        ],
        [
            "SK Federation President"
        ],
        [
            "Rojim R. Banguis (2020-2023)"
        ],
        [
            "Kenneth Jester P. Haim (2023-2025)"
        ],
        [
            "ABC President"
        ],
        [
            "Lucita M. Aviles, Ed.D (2018-2023)"
        ],
        [
            "Rolito P. Lorejo (2023-2025)"
        ],
        [
            "IPMR"
        ],
        [
            "(Vacant)"
        ],
        [
            "Tourism"
        ],
        [
            "The Municipality has a spot at barangay Panalsalan called Bawbawon Islands, frequently visited by local and foreign guests.",
            "The place is good for picnics or plain sightseeing.",
            "This is a group of islets in the shape of a broken necklace evenly scattered on an area facing the Mindanao Sea.",
            "It has an aggregate land area of 23.00 hectares or only .24% of the total land area embraced by the municipality."
        ],
        [
            "It is accessible by boat via Plaridel Port or at Sitio Baybay in Barangay Panalsalan with minimal fares.",
            "There is also an existing concrete viaduct which visitors may use when entering the island, located at the Bawbawon Entrance at Baybay-Panalsalan."
        ],
        [
            "Plaridel is blessed with natural island beauty, greeneries, and fine white beaches.",
            "This island is a nature's gift for Plaridel, aside from the mangroves and structure of the rocks that you can see upon arriving on the Island.",
            "You will enjoy the white fine sand and the fresh air that this gift offers."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Plaridel has a total road network covers 164 kilometres (102 mi), of which 85% are barangay roads, 42.56 kilometres (26.45 mi) roads are mainly of gravel and earth type.",
            "Meanwhile, 100% of the National Highway is paved with asphalt.",
            "13.57% of the Provincial Roads are paved with concrete, 11.24% of the Municipal Road pave with concrete and 37.43% barangay roads/farm-to-market roads."
        ],
        [
            "The municipality itself has its own seaport with a regular trip to Siquijor, Tagbilaran, Cebu and vice versa, which caters passengers only.",
            "Lite Shipping Lines also plying the same route with regular thrice a week schedule during lean months and 5 times a week during peak months of April, May and June catering passengers and cargo as well.",
            "The Philippine Ports Authority managed the port and it has an ongoing construction project worth more than a Hundred Million Pesos which covers the expansion and raising up of the port area designed to cater larger vessels to dock and a passenger terminal."
        ],
        [
            "Water supply"
        ],
        [
            "The Municipality of Plaridel is served by the Plaridel Waterworks Office, an LGU-run enterprise that caters to Twenty (20) barangays namely: Northern Poblacion, Southern Poblacion, Lao Proper, Looc Proper, Eastern Looc, Southern Looc, Mamanga Daku, Kauswagan, Santa Cruz, Lao Santa Cruz, Usocan, Clarin, Tipolo, Unidos, Mangidkid, New Look, Catarman, Puntod, Danao, and Calacaan.",
            "It has two (2) pumping stations at Barangays Mamanga Daku and one pumping station at Tipolo and Unidos.",
            "It has a total of 3,500 consumers."
        ],
        [
            "Barangays Panalsalan, Katipunan, Cartagena Proper, New Cartagena, Cebulin, Ilisan, Mamanga Gamay, Divisoria, Buena Voluntad, Deboloc, Quirino, Agunod, and Bato has its own Level II and III systems, making the Municipality of Plaridel to be the first municipality in the province of Misamis Occidental to make 100% performance on the provision of potable water to all thirty (33) barangays."
        ],
        [
            "Based on actual survey of households conducted by the Municipal Health Office, the actual number of households served by the different water systems all over the municipality reaches 6,929 or 84% of the total household population."
        ],
        [
            "Power supply"
        ],
        [
            "The municipality of Plaridel set the record as the first municipality who has 100% energization level in terms of barangay.",
            "It has total connections of 4,333 all throughout the municipality, 3,933 of which are residential connections, 111, commercial, 23 industrial, 7 streetlights, 130 for public buildings and 129 connections assigned to Barangay Power Association (BAPA).",
            "It has an average consumption of 215,270 KWH/Month for the year 2000."
        ],
        [
            "Recently, a standby Power Generation Plant is now established at Brgy Map-an, Pana-on by the Kings Energy Group (KEG) in case the supply of energy will dropped due to prevailing circumstances."
        ],
        [
            "Communication"
        ],
        [
            "The Philippine Long Distance Telephone Company was established in the municipality in 1994 and managed by Paglaum Multi-Purpose Cooperative (PMPC).",
            "It covers 12 barangays with a total of 178 consumed including commercial establishments and churches.",
            "It accommodates domestic and international calls."
        ],
        [
            "Cellular Phone Service is also available for Smart, Globe and Sun Cellular Phone subscribers.",
            "There are six repeater towers within the urban and rural area."
        ],
        [
            "The main Internet service provider in the municipality is PLDT through the Paglaum Multi-Purpose Cooperative and Smart and Globe Communications."
        ],
        [
            "The Municipality of Plaridel has a post office.",
            "Telecom, a government-owned telegraphic facility, offers telegram communications."
        ],
        [
            "The PNP has a radio messaging system covering the province with a repeater at Barangay Mamanga Daku.",
            "Municipal officials and members of the Association of Barangay Captains use it with handheld radios."
        ],
        [
            "Medical facilities"
        ],
        [
            "There are two privately owned medical institutions in the municipality, the ten bed Tan Ho Medical Clinic and the 25 bed St. Augustine Hospital."
        ],
        [
            "The Local Government Unit operates the Plaridel Community Hospital, a program authorised by former Mayor Diego Ty."
        ],
        [
            "Education"
        ],
        [
            "The Provincial Manpower Training Center at Barangay Panalsalan, Plaridel provides vocational training for the province and from Zamboanga del Norte."
        ],
        [
            "References"
        ],
        [
            "^ \"Magkugi sa kanunay aron atong mahatagan ang atong pamilya sa saktong panginahanglan\".",
            "Facebook.",
            "Gadwin E. Handumon.",
            "2022-05-02.",
            "Retrieved 2022-06-23."
        ],
        [
            "^ https://web.facebook.com/photo.php?fbid=122395909470021&id=107113494331596&set=a.346905650787676&source=11&_rdc=1&_rdr"
        ],
        [
            "^  Municipality of Plaridel |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Act No.",
            "951\".",
            "jurisprudence.ph.",
            "October 21, 1903.",
            "Retrieved March 11, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Plaridel: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Misamis Occidental\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "2015 Census of Population, Philippine Statistics Authority"
        ],
        [
            "Places adjacent to Plaridel, Misamis Occidental"
        ],
        [
            "Bohol Sea"
        ],
        [
            "Baliangao"
        ],
        [
            "Plaridel"
        ],
        [
            "Iligan Bay"
        ],
        [
            "Calamba"
        ],
        [
            "Lopez Jaena"
        ],
        [
            "vte Province of Misamis OccidentalOroquieta (capital)  Ozamiz (largest city)Municipalities"
        ],
        [
            "Aloran"
        ],
        [
            "Baliangao"
        ],
        [
            "Bonifacio"
        ],
        [
            "Calamba"
        ],
        [
            "Clarin"
        ],
        [
            "Concepcion"
        ],
        [
            "Don Victoriano Chiongbian"
        ],
        [
            "Jimenez"
        ],
        [
            "Lopez Jaena"
        ],
        [
            "Panaon"
        ],
        [
            "Plaridel"
        ],
        [
            "Sapang Dalaga"
        ],
        [
            "Sinacaban"
        ],
        [
            "Tudela"
        ],
        [
            "Component cities"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Tangub"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Plaridel,_Misamis_Occidental&oldid=1213957102\""
        ],
        [
            "Categories: Municipalities of Misamis OccidentalMisamis OccidentalHidden categories: Pages using gadget WikiMiniAtlasAccuracy disputes from June 2022CS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}