{
    "name": "Polangui",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Polangui"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°17′32″N 123°29′08″E﻿ / ﻿13.2922°N 123.4856°E﻿ / 13.2922; 123.4856"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Albay, Philippines"
        ],
        [
            "Not to be confused with Pulangi."
        ],
        [
            "Municipality in Bicol Region, PhilippinesPolanguiMunicipalityMunicipality of Polangui"
        ],
        [
            "FlagMap of Albay with Polangui highlightedOpenStreetMapPolanguiLocation within the PhilippinesCoordinates: 13°17′32″N 123°29′08″E﻿ / ﻿13.2922°N 123.4856°E﻿ / 13.2922; 123.4856CountryPhilippinesRegionBicol RegionProvinceAlbayDistrict"
        ],
        [
            "3rd districtFounded1584Founded byFray Baltazar de la Magdalena, OFMBarangays44"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAdrian Salceda • Vice MayorCherilie Mella Sampal • RepresentativeFernando T. Cabredo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Kristel Louise S. PasiaMark Thet N. SabandoEugene L. ArriveJuan Miguel Ricardo S. SalcedaNoli D. SamleroRemgildo C. Gonzales, Jr.Jose O. Villar Jr.Edna R. Siguenza"
        ],
        [
            " • Electorate60,015 voters (2022)Area • Revenue PHP 334.342 million (2020) • Expenditure PHP 310.599 million (2020) • Assets PHP 955.170 million (2020) • Liabilities PHP 298.517 million (2020)Service provider • ElectricityAlbay Electric Cooperative (ALECO) • WaterPolangui Waterworks Services Administration (POWASA)Time zoneUTC+8 (PST)ZIP code4506PSGC050514000IDD : area code +63 (0)52Native languagesTagalogMajor religionsRoman CatholicismFeast dateJune 29Catholic dioceseLegazpiPatron saintSaints Peter and PaulWebsitewww.polangui.gov.ph"
        ],
        [
            "Polangui, officially the Municipality of Polangui (Central Bikol: Banwaan kan Polangui; Tagalog: Bayan ng Polangui),  is a 1st class municipality in the province of Albay, Philippines.",
            "According to the 2020 census, it has a population of 89,176 people."
        ],
        [
            "Etymology"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(October 2016) (Learn how and when to remove this message)"
        ],
        [
            "The origin of the name Polangui has many versions.",
            "The foremost and seemingly more accepted version is, \"that of a giant robust tree which existed majestically in the early municipal settlement\".",
            "The natives of the settlement called the \"Oyangue\", which also served as the early landmark of the area whereby new settlers looked upon in their wandering.",
            "Similarly, the early Spanish frontier settlers found this tree and it became their famous settlement landmark.",
            "The settlement was then called \"Binanuaan\" but often referred to as \"Oyangue\" by nearby settlers.",
            "As more settlers came to dwell and engage in trade endeavors with the indigenous inhabitants, the more was the settlement known in distant areas by the name \"Oyangue\" (referring to the tree landmark) which was more widely accepted than \"Binanuaan\".",
            "The passing of generations corrupted the word \"Oyangue\" into several acronyms.",
            "Most acceptable and widely used before was \"Polangue\" and later \"Polangui\" which has remained today."
        ],
        [
            "Another legend is about the story of a maiden named \"Pulang Angui\" which means \"Red Maria\" (Angui is the nickname for Maria) who loved red colors for dress and whose beautiful body, face and red lips became the object of affection by the males to the point of adoration.",
            "She was modest in her ways, talented for possessing various skills, with happy disposition, showing love of arts and religion.",
            "She would lead the tribe in festivities.",
            "When the Spaniards came, the soldiers who first set foot in Polangui asked for the name of the place.",
            "The native thought the foreigners was asking for the name of \"Pulang Angui\" and said so.",
            "The Spaniards recorded the name of the place as Pulangui, a concoction of the name which was later on, as years went by, was converted to Polangui."
        ],
        [
            "Sts.",
            "Peter and Paul Parish Church (circa 1966)"
        ],
        [
            "Sts.",
            "Peter and Paul Parish Church (circa 2010)"
        ],
        [
            "History"
        ],
        [
            "Precolonial period"
        ],
        [
            "Pre-colonial Polangui was a fertile valley cradled by the virgin forests of Mount Masaraga.",
            "It was formed out of five settlements ruled by the Datu of Ponso till the late 1583.",
            "The center of the settlements was called Banwang gurang, meaning \"old town\" and is now known as Magurang."
        ],
        [
            "In 1584, Fray Baltazar de la Magdalena, left Ambos Camarines and stumbled upon this place west of Mount Masaraga.",
            "He found that each of the five settlements had about 100 inhabitants.",
            "In the same year, he founded a settlement within the fertile valley and established a ranch, which he called \"Binanuaan\".",
            "Being inland and strategically situated, the town was spared from the frequent raids of sea pirates as well as from the occasional destruction caused by the eruption of Mayon Volcano."
        ],
        [
            "Polangui became a visita, or outreach village under the jurisdiction of the Villa Santiago de Libon, which was established in 1573 by Juan de Salcedo, the grandson of the Spanish conquistador Miguel Lopez de Legazpi.",
            "The villa, which lies south-west of Polangui, would be known as the fourth of its kind in the entire archipelago."
        ],
        [
            "Fray de la Magdalena was credited with the founding of Polangui.",
            "Old manuscripts in the Archives of Manila and in the Franciscan Convent in Manila point to 1584 as the year Polangui was founded, and thus considered as one of the oldest municipalities in the Philippines."
        ],
        [
            "Spanish regime"
        ],
        [
            "By 1654, the original settlement became considerably bigger when Fray Alonzo de San Juan, was assigned in Polangui as \"Encargado\".",
            "The settlement was expanded reaching the present barangay sites in Lanigay, Ponso and Balinad.",
            "The town proper was established in Lanigay where a church made of wood was erected adjacent to about 280 wooden dwellings and more than 1,000 nipa huts.",
            "Unfortunately, this church together with the dwelling units was razed by a fire to the ground."
        ],
        [
            "With the coming of another missionary, Fray Juan Bautista Marza, a new church made of bricks and stones was completed in 1664.",
            "This church stood on a new elevated site and still stands to this day.",
            "Under the leadership of Fray Marza, roads and bridges were also initiated and schools were introduced simultaneously with the Christian Doctrine and Spanish culture."
        ],
        [
            "Growth of the settlement was so fast that it became a Poblacion and finally recognized as a Pueblo in 1674.",
            "Owing to its steady growth, a link with nearby Libon and Oas became a necessity.",
            "Hence, Fr.",
            "Jose Arnao, parish priest and Encargado from 1832 until 1852, directed the construction of roads and bridges that would connect Polangui to neighboring towns, including upland Buhi in Camarines Sur."
        ],
        [
            "During Spanish regime, a significant highlight is the construction of its parish church which took 10 years to be completed starting in 1654 by Fray Alonzo de San Juan and completed in 1664 by Fray Juan Bautista Marza."
        ],
        [
            "Polangueño martyr, Camilo Jacob, who is a photographer, was executed on January 4, 1897, with other Bicolanos.",
            "They are now commemorated as the Quince Martires del Bicolandia.",
            "A year later, the Spanish rule in Bicol ended with the mutiny of Guardia Civil in Naga led by Elias Angeles."
        ],
        [
            "American period"
        ],
        [
            "Sometime during the Philippine–American War, Polangui became the seat of the Provincial Government of Albay for a brief period under Governor Domingo Samson.",
            "When the Americans conquered Polangui in 1890 without firing a single shot, the form of government went through transition from military to civil government then Commonwealth system.",
            "The seat of the municipal government was in Ponso with Clemente Sarte as the acting Chief Executive.",
            "A few months later, the seat of the municipal government was transferred to Centro Occidental and still remains up to this day."
        ],
        [
            "Japanese occupation"
        ],
        [
            "When the Japanese forces occupied Polangui on December 13, 1941, Cipriano Saunar, then vice mayor of the Commonwealth government was appointed mayor by the Japanese military administration.",
            "A secret civil government was established simultaneously headed by Julian Saunar which was supported by the people.",
            "Cipriano Saunar's successor was Manuel Samson Sr. and in turn was succeeded by Jesus Salalima who ruled from 1947 to 1960."
        ],
        [
            "Geography"
        ],
        [
            "Polangui is located at 13°17′32″N 123°29′08″E﻿ / ﻿13.2922°N 123.4856°E﻿ / 13.2922; 123.4856, in the north-eastern quadrant of the third district of Albay."
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 145.30 square kilometres (56.10 sq mi)  constituting 5.64% of the 2,575.77-square-kilometre- (994.51 sq mi) total area of Albay."
        ],
        [
            "Polangui is bounded on the north by Buhi and Iriga City of Camarines Sur province, south by Libon, Oas and City of Ligao; and west by Malinao and the City of Tabaco.",
            "It is 37 kilometres (23 mi) from Legazpi and 490 kilometres (300 mi) from Manila."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Polangui, Albay"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "55(2.2)"
        ],
        [
            "36(1.4)"
        ],
        [
            "45(1.8)"
        ],
        [
            "42(1.7)"
        ],
        [
            "114(4.5)"
        ],
        [
            "184(7.2)"
        ],
        [
            "245(9.6)"
        ],
        [
            "224(8.8)"
        ],
        [
            "238(9.4)"
        ],
        [
            "171(6.7)"
        ],
        [
            "130(5.1)"
        ],
        [
            "94(3.7)"
        ],
        [
            "1,578(62.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.0"
        ],
        [
            "9.5"
        ],
        [
            "11.8"
        ],
        [
            "12.7"
        ],
        [
            "21.3"
        ],
        [
            "25.3"
        ],
        [
            "28.3"
        ],
        [
            "26.5"
        ],
        [
            "26.4"
        ],
        [
            "24.2"
        ],
        [
            "19.9"
        ],
        [
            "16.1"
        ],
        [
            "235"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Polangui has a general climate characterized by dry season with a very pronounced maximum rainfall from November to December.",
            "Prevailing wind is in the general direction from north-east to south-west."
        ],
        [
            "Barangays"
        ],
        [
            "Polangui is politically subdivided into 44 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "It is grouped into three divisions:"
        ],
        [
            "Poblacion Barangays – 13 member barangays"
        ],
        [
            "Rinconada Area Development Council (RADC) – 11 member barangays"
        ],
        [
            "Upland Area Development Council (UADC) – 20 member barangays"
        ],
        [
            "Barangay"
        ],
        [
            "Land area (ha.)"
        ],
        [
            "Class"
        ],
        [
            "District"
        ],
        [
            "Etymology"
        ],
        [
            "Brief history"
        ],
        [
            "Agos"
        ],
        [
            "298.84"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "The old name of this sitio during the early Spanish rule was \"Bato Lis Non\".",
            "On the eastern side of the sitio was Sitio Matakot, or known to be later as Matacon.",
            "Because of the difficulty in remembering its former name, visitors and strangers to the sitio would easily remember the wide river that separates the province of Albay and Camarines Sur, the Agos River.",
            "Thus, as time passed by, the barangay was named Agos."
        ],
        [
            "A certain Angel Servas was the first Teniente del Barrio to lead a group of 24 households in the early years of Spanish rule.",
            "Others to follow were: Antonio Mendoza, Paulino Segui, Vicente Epres, Eustaquio Seda, Pedro General (first to assume the position of Barangay Captain), Felicisimo Cagnayo Sr., and Rogelio Laynes."
        ],
        [
            "Alnay"
        ],
        [
            "214.87"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "Unknown"
        ],
        [
            "A sitio of Barangay Ponso in the early days, it was a verdant place full of ricefields.",
            "In the latter part of the 1960s, Dr. Esteban Ante (deceased), a landowner, developed his ricefields into a subdivision, thus attracting people to reside in the place.",
            "With that development, Councilor Santiago M. Revale passed a resolution creating Alnay as an independent barangay.",
            "It was approved and concurred in by the Sangguniang Panlalawigan of Albay, headed then by Governor Felix Imperial."
        ],
        [
            "Alomon"
        ],
        [
            "154.19"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "As old folks say, the place was inhabited by people who are very industrious, that even in the evening they work at their farms.",
            "There was then a visitor in the barrio, a foreigner, who greeted the workers in the ricefields, and jokingly greeted the bright moon in this way: \"Hello Moon!\".",
            "Thinking that the stranger was naming the place, the residents remembered it as \"Hello Moon\".",
            "As the time passed by, the place was named as Alomon."
        ],
        [
            "During the early years, Alomon was a sitio of Barrio Kinale.",
            "Its first Teniente del Barrio was Domingo Satorre, who was responsible for its establishment as an independent barrio in 1972."
        ],
        [
            "Amoguis"
        ],
        [
            "147.13"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Unknown"
        ],
        [
            "As old folks used to tell, there were only three barangays that comprised Polangui then in the year 1654 when Father Alonzo de San Juan founded the pueblo of Binanuaan.",
            "Amoguis and several other settlements were part of Barangay Layugay (now known as Lanigay).",
            "With the passing of time, these sitios became independent barangays through RA 2370 or the Barrio Charter enacted during the term of President Carlos P. Garcia on June 20, 1959."
        ],
        [
            "Anopol"
        ],
        [
            "200.32"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "The barangay got its name from a vine called \"anopol\", with the leaves that climb on tall trees and are commonly found along river banks, creeks and natural springs."
        ],
        [
            "Anopol was a former sitio of Barrio Lanigay.",
            "It became an independent barrio pursuant to RA 3590 or the Revised Barrio Charter enacted during the term of President Carlos P. Garcia on June 22, 1963.",
            "Its first administrator was Bienvenido Cellona."
        ],
        [
            "Apad"
        ],
        [
            "455.76"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "A sitio of Barrio Lanygay during the early years of Spanish rule, it was the center of convergence of several upland sitios namely: Kinuartelan, La Medalla, Upper Santicon, San Roque and several other sitios.",
            "During that time, the only means of transportation was the \"RailBoss\" of the Ferrocarril de Manila-Dagupan (predececcor of the Philippine National Railways).",
            "The \"railbos\" had its terminal located in Apad, thus becoming known as \"Parada\".",
            "As years passed by, the word was corrupted until it became Apad."
        ],
        [
            "A sitio of Barrio Lanigay during the early years of Spanish rule, it was the center of convergence of several upland sitios namely: Kinuartelan, La Medalla, Upper Santicon, San Roque and several other sitios."
        ],
        [
            "Balaba"
        ],
        [
            "510.40"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Old folks traces the name Balaba from the word \"balabag na dalan\", or the crookedness of its road due to the steepness of its slope leading to the settlement."
        ],
        [
            "Formerly a sitio of Barangay Balinad, it became an independent barrio in 1967.",
            "Councilwoman Benigna Calpe was the sponsor of the resolution creating Balaba.",
            "First appointed Teniente del Barrio was Carlos Sangat, serving from 1948 to 1951."
        ],
        [
            "Balangibang"
        ],
        [
            "269.95"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "'The early residents put the name of these two capital towns Balanga and Iba together to retrieve the name of early Chieftain of their tribe, Balang aNd the princess of Zambales named Ibang.",
            "Thus the name Balangibang came to be."
        ],
        [
            "As with other present barangays of Polangui, Balangibang was a sitio of Lanigay (the mother barangay in the early years of Spanish rule).",
            "It was a vast agricultural land owned by the Alsua/Buenviaje and Catalina vda.",
            "de Gloria families.",
            "With the implementation of the Comprehensive Agrarian Reform Law (CARL) during the term of President Diosdado Macapagal, these ricelands were distributed to the tenants tilling the lands.",
            "With the enactment of the Revised Barrio Charter in 1963, Balangibang became an independent barrio."
        ],
        [
            "Balinad"
        ],
        [
            "727.65"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "The name Balinad originated from the name of a certain tree called \"sorsogon\" (locally known as \"balinad\"), which grew abundantly in the said place."
        ],
        [
            "Barangay Balinad is one of the original mother barangays that was established when Polangui was founded."
        ],
        [
            "Basud"
        ],
        [
            "116.34"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "As old folks narrated the story, Basud got its name when the earlier farmer settlers backfilled the lower portion of the fields with \"basud\" (sand).",
            "This was the area between the boundary of Polangui and Oas.",
            "Large tract of lands were filled with sand in the desire of the farmers to make the area productive.",
            "Due to that development, the place was known as Basud."
        ],
        [
            "It used to be a part of Sitio Ubaliw that belongs to the mother barangay of Lanigay in the early settlement years of Spanish rule.",
            "When the center of Pueblo was transferred from Lanigay to the present poblacion, these two (Basud and Ubaliw) became independent barangays."
        ],
        [
            "Buyo"
        ],
        [
            "220.11"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "The place derived its name from \"buyo\", a native name of a vine which is an ingredient for making \"ikmo\" or \"nganga\", which thrives abundantly in the place."
        ],
        [
            "It was a sitio of mother barangay Lanigay in the early years.",
            "It was established as an independent barangay in the year 1946, under the administration of Mayor Manuel Samson, Sr."
        ],
        [
            "Centro Occidental (seat of church and government)"
        ],
        [
            "191.82"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "Due to increased development in the area, this former sitio of Lanigay became a barangay of its own and was called Centro Occidental, as it is in the western portion of the Poblacion (centro).",
            "It is also popularly called \"Ilaod\".",
            "This is because when people go to the market, they would call it \"Iraya\" (meaning upstream) and when they go home, they would say Ilaod (meaning downstream)."
        ],
        [
            "Barangay Centro Occidental used to be a sitio of Barangay Lanigay.",
            "When the latter's settlement was hit by a conflagration in 1654 including the church, the encargado decided to transfer the church to the present site where it stands (now in present-day Centro Occidental).",
            "The church, municipal building and the market site were all eventually situated here, so the place was considered the centro of the Pueblo (divided into Centro Oriental or the eastern portion and Centro Occidental or the western portion).",
            "It was the center of commerce, seat of government and the center of religious activities."
        ],
        [
            "When the Revised Barrio Charter was enacted in 1963, Centro Oriental and Centro Occidental both became independent barangays.",
            "Years later, the Philippine National Railways (PNR) station was constructed at Barangay Basud.",
            "It was decided that the public market be transferred near the station.",
            "But because the seat of government and the parish church were still in place, Centro Occidental remains the de facto centro of the Municipality of Polangui.",
            "As population grew fast, development in the area grew fast too.",
            "More residential houses were constructed on the vast track of talahib.",
            "Elementary and secondary schools were also established."
        ],
        [
            "Centro Oriental"
        ],
        [
            "29.12"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "Due to increased development in the area, this former sitio of Lanigay became a barangay of its own and was called Centro Oriental, as it is in the eastern portion of the Poblacion (centro)."
        ],
        [
            "When the settlement of Lanigay was hit by a conflagration in 1654 including the church, the encargado decided to transfer the church to the present site where it stands (now in present-day Centro Occidental).",
            "The church, municipal building and the market site were all eventually situated here, so the place was considered the centro of the Pueblo (divided into Centro Oriental or the eastern portion and Centro Occidental or the western portion).",
            "It was the center of commerce, seat of government and the center of religious activities.",
            "When the Revised Barrio Charter was enacted in 1963, Centro Oriental and Centro Occidental both became independent barangays."
        ],
        [
            "Cepres"
        ],
        [
            "263.35"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Old folks narrate that \"two American strangers came and rested for a while, and saw people planting cypress shrubs and remarked that this place is safe to rest\".",
            "The natives thought that the Americans were referring to the shrubs.",
            "From that time on, the place as known as Cepres."
        ],
        [
            "Cepres was originally a sitio of mother barangay Lanigay.",
            "It was known as Cepres during the early years of 1930 during the term of Marciano Rosela as their Teniente del Barrio."
        ],
        [
            "Cotmon"
        ],
        [
            "485.30"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "As the people of this barangay, the name was derived from the name of the tree that once thrived the place.",
            "That tree was called kutmon in the locality.",
            "Later, the form was changed and Hispanicized, thus the form being used today, as was with the naming of most places.",
            "The kutmon is katmon in the Filipino language's orthography."
        ],
        [
            "Cotnogan"
        ],
        [
            "231.13"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "In the early years of Spanish rule, there existed a river teeming with fish and one species is locally known as COTNOG which later became HIRABO.",
            "As the tale says: One day, a Guardia Civil arrived in their place and passed a group of residents fishing on that famous river.",
            "He approached the residents asking for the name of a place, but the natives did not fully understand what the Spaniards wanted.",
            "They answered COTNOG AN, COTNOG"
        ],
        [
            "AN, (in rinconada accent) thinking of the name of the fish from that day the place became known as COTNOGAN."
        ],
        [
            "Danao"
        ],
        [
            "383.50"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "The story about Danao lake can be traced in the year 1800.",
            "As narrated by old folks, there was this family whose daughter will be married that day.",
            "Near to their house was a brook shaped in a circular form and which is the bathing area for water buffalo.",
            "That brook was surrounded by tall trees and shrubs making the place dark.",
            "The mother ignored her, but the old woman approached the cook who gave her food.",
            "After eating, the old woman told the cook to leave the place, because something will happen.",
            "As soon as the cook left, the old woman disappeared.",
            "Then the sky & surroundings became dark & a tornado (buhawi in Tagalog) hit the place causing the formation of the lake now known as Danao lake.",
            "It was told that except for the cook, all the residents of the area perished."
        ],
        [
            "Gabon"
        ],
        [
            "88.67"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "Barangay GABON came about as a settlement area that originated from a place grown with abundant trees.",
            "It was owned by one family only, the Orbon Family.",
            "The name of the barangay was coined after the word \"GARABON\" which means divide or occupy.",
            "After its formal establishment and creation as an independent political unit, Barangay Gabon experienced significant political, social and economic changes under the able administration of successive barangay officials."
        ],
        [
            "Gamot"
        ],
        [
            "345.17"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Barangay Gamot get its name in the times of Japanese regime where people of this barangay used to hide in roots (which is gamot in the Bicol language or dialect) of large trees, to escape slavery or death from the Japanese."
        ],
        [
            "Itaran"
        ],
        [
            "312.09"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "After Japanese war and early 50's the Aeta's were lived in this place, then on mid-50's Spanish Mestizos Tu-anqui's clan came"
        ],
        [
            "over and fired their guns on the air, the aeta's scared ran with fear and fled the place, the Tu-anqui's take over and pre-occupied"
        ],
        [
            "the place and during this time Emili-ano Sabordo was chosen as the Cab-eza de Barangay and he named this “ AETARAN “"
        ],
        [
            "which he derived from Aeta's who live and Ran whom run-ning the place.",
            "On early 60's by the time of Kapitan Alejandro Victoria"
        ],
        [
            "and named it ITARAN."
        ],
        [
            "Kinale"
        ],
        [
            "176.39"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "Kinuartelan"
        ],
        [
            "341.27"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "La Medalla"
        ],
        [
            "368.27"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "According to the history of this barangay, the name “LA MEDALLA” was derived from their patroness saint “STA LA MEDALLA”.",
            "It was"
        ],
        [
            "known during the early times that the barrio has vas and fertile agricultural land, and because of this, settlers from nearby places"
        ],
        [
            "migrated to"
        ],
        [
            "this barrio to venture in agricultural farming.",
            "One of the early settlers who migrated to this barrio came from barrio La Medalla, town of"
        ],
        [
            "Iriga (now a City) of the Province of Camarines Sur; they were so industrious, hardworking and adventurous.",
            "They brought along with"
        ],
        [
            "them their patroness saint, Sta, La Medalla as they settled in this place.",
            "And, as a token of gratitude, they donated their patroness"
        ],
        [
            "saint to the barrio.",
            "And with this, the resident decided that Sta.",
            "La Medalla be their patroness saint in their barrio in the honor of her,"
        ],
        [
            "thus, it became barrio La Medalla.",
            "The 1st Teniente del barrio” (now known as PABLO BALANG, followed in succession, by SANTOS"
        ],
        [
            "LAYNES, SANTOS AMOROSO, NEMESIO RAMBOYONG, MARTIN CERVANTES, RESTITUTO BALANG, AMANDO BARRA &"
        ],
        [
            "presently by OLIVA O. SALCEDO)"
        ],
        [
            "Barangay La Medalla is situated at the North-Western part of Polangui with a distance of approximately 8.5 kilometers far from centro"
        ],
        [
            "Poblacion, located along the North: Barangay Lourdes, South: Barangay Apad, Santicon, West: Barangay La Purisima & East:"
        ],
        [
            "Barangay Kinuartelan.",
            "Its topography was plain, Mountainous (Bulod ) and Hilly.",
            "Its classification was Poblacion, coastals, along the"
        ],
        [
            "highway & Interior."
        ],
        [
            "Barangay La Medalla is divided into (7) Puroks managed by Purok Leaders & Advisers.",
            "It has an exciting complete Elementary"
        ],
        [
            "School established in 1933 and a high school established on 1992.",
            "It has a Barangay Hall, Health Center and a Day Care Center."
        ],
        [
            "Residents buy their daily basic provision in a few sari-sari stores but most of the time they prefer to but in a town proper during market"
        ],
        [
            "day."
        ],
        [
            "Today, like other barangay in Polangui, La Medalla is loving forward for progress.",
            "The only problem which the residents are facing now"
        ],
        [
            "is transportation wherein only motorcycle is the only means because of rough roads connecting the barangay to poblacion."
        ],
        [
            "Lanigay"
        ],
        [
            "313.06"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "Barangay Lanigay located in the Municipality of Polangui, Province of Albay.",
            "According to the old folks, this place was known to be ” Mother Barangay”.",
            "It was once"
        ],
        [
            "known as “Layugay”.",
            "The following barangays namely: Maysua, Lidong, Pintor, Cepres, and other places in the eastern part of Polangui reaching as far as La Purisima"
        ],
        [
            "and some portions of Gabon, Sugcad, Ilaod, Kinale and Balangibang were once part of Lanigay."
        ],
        [
            "The term name Layugay refers to the “take-off portion received from the lowlands and the “landing portion” received from the upland areas.",
            "It was due to the terrain"
        ],
        [
            "place that the name Layugay was derived."
        ],
        [
            "As years gone by, the Mother Barangay was divided and of its sitios was separated and became independent and comprises the Municipality of Polangui.",
            "The Mother"
        ],
        [
            "Barangay became smaller as regards its territorial jurisdiction and area.",
            "What was left of the Mother Barangay renamed Lanigay from it former name Layugay by then"
        ],
        [
            "Teniente Del Barrio, who facilitated said action with the members of Consejo Municipal."
        ],
        [
            "Early in 1654, Father Alonzo de San Juan followed by Magdalena and founded the barrios of Lanigay, Ponso, Balinad with 230 wooden houses and one thousand"
        ],
        [
            "nipa.",
            "Fr.",
            "San Juan erected in Lanigay the town's first Polangui Church edifice which was made of wood and light materials.",
            "With these, Lanigay then became the"
        ],
        [
            "town's center."
        ],
        [
            "The church edifice that Fr.",
            "San Juan built was razed ground by a conflagration that affected also the rest houses surrounding it.",
            "He constructed a new edifice this time"
        ],
        [
            "made of bricks and stones.",
            "But because Lanigay flood-prone area, he relocated the edifice and construct new church edifice."
        ],
        [
            "La Purisima"
        ],
        [
            "493.02"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "Lidong"
        ],
        [
            "121.26"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Lidong was the center of commerce back then.",
            "The 'saūd' or market, where the 'agtâs' bartered their goods with rice from the vast 'uma' or rice farms of 'Langtad' and 'Lidong', as well as with fresh-caught fish from Lake Buhi, was near where the two tributary rivers that meet to form one river.",
            "The water in the area where the rivers meet swirls so that when the traders from one side crosses with their 'balsa' gets 'nauseated' or in local term 'libūng'.",
            "Soon the corruption and Hispanicization of the word arrived to its present form."
        ],
        [
            "Lourdes"
        ],
        [
            "348.71"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Magpanambo"
        ],
        [
            "251.87"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "Magurang"
        ],
        [
            "115.22"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "Literally, Magurang in English translation, means many old residents.",
            "Hence, maybe long before the coming of the Spaniards this"
        ],
        [
            "Barangay was over-polluted by old people, such that the place was called such name.",
            "At least, this is one conception."
        ],
        [
            "I – HOW MAGURANG GOT ITS NAME"
        ],
        [
            "It was in the early part of the year 1854, Rev.",
            "Father Alonzo de San Juan, an encargado, founded three barrios, namely; Lanigay,"
        ],
        [
            "Ponso and Balinad.",
            "These were all planted with coconuts and abaca.",
            "When visiting these barrios from Lanigay to Ponso, he"
        ],
        [
            "passed by a way which was so under develop.",
            "There were two rave wooden houses and a few number of nipa huts which were"
        ],
        [
            "built far from each other, father Alonzo de San Juan called the place sitio."
        ],
        [
            "By the coming of Rev.",
            "Father Bautista Marza in the later part of the 19th century, roads and bridges were constructed.",
            "One day"
        ],
        [
            "Father Marza passed by the under-constructed roads.",
            "H e greeted the people along the way and asked what the name of sitio is in"
        ],
        [
            "Spanish Language.",
            "An old woman answered “kami mga gurang” (we are old already).",
            "Father Marza thought that the response of"
        ],
        [
            "the old people was the real name of the place.",
            "From that time on, he called the Place “MAGURANG”."
        ],
        [
            "The Place MAGURANG was developed by Father Marza.",
            "People were baptized and converted to Christianity.",
            "Since then,"
        ],
        [
            "MAGURANG become the name of the sitio."
        ],
        [
            "Matacon"
        ],
        [
            "317.64"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "According to the legend, Barangay Matacon was used to be a no man's land.",
            "Long time ago, this place as known for its thick forest and people passing by to"
        ],
        [
            "reach Polangui, Poblacion were being harassed by bandits.",
            "As years passed by the word of fear or “ MATAKOT” in Bicol dialect was instilled in the minds of the"
        ],
        [
            "people when referring to this place."
        ],
        [
            "In the years that followed, people soon began to migrate and found out that the place was not “Matakot” anymore.",
            "Most of them soon have land holding means of"
        ],
        [
            "livelihood that is soon became a community."
        ],
        [
            "The people did not find difficult in naming the place, they only had to changed “MATAKOT” to a better sounding word “MATACON”, hence the name was adopted"
        ],
        [
            "by the people from that time on."
        ],
        [
            "Barangay Matacon is bounded on the North East, by Barangay Salvacion, on the South by the Kinale River, East by Barangay Balangibang, on the North-West by"
        ],
        [
            "Barangay Cotnogan."
        ],
        [
            "Maynaga"
        ],
        [
            "262.39"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "During the Spanish rule, this place was thickly forested areas inhabited by aetas.",
            "On how this place got its name, history says that, one day a Spaniard met an aeta and inquired where he got the vine \"buyo\" he was carrying, he told the Spaniard of the place \"Pongol\", a small stream where hundreds of narra trees ( \"naga\" in local dialect) thrives.",
            "With the natives answer \"sa may naga\", instilled in the mind of the Spaniard thus the place being remember and eventually name as sitio \" Maynaga\".",
            "Like other barangays in Polangui, Maynaga was once a sitio of barrio \"layugay\" (now barangay lanigay) in the early years of the Spanish rule.it was only during the implementation of the barrio charter in 1960's when it became an independent barangay through a resolution by then Municipal Councilor Iluminado Relleve, was principal author creating the barangay.",
            "\"Sta.",
            "Del Rosario\"is the patroness of barangay Maynaga.",
            "The chapel stand on the lot donated by the late Ignacio Tuanqui in 1951.",
            "Aside from a Roman Catholic group Maynaga has a (2) other religious sects.",
            "Iglesia Ni Cristo, the born again Christian ministry, but generally, Maynaga is a catholic barangay.",
            "In the late 80's, Maynaga elementary school was established, with the barangay itself purchasing a lot for the school site.",
            "The barangay at present has its own \"barangay center where the barangay hall, barangay pavilion, police outpost, health center, and the day care center proudly stands.",
            "In terms of tourist attraction, barangay Maynaga has now a private owned and well developed resort, the \" highlander watering hole resort, it has a big swimming pool supplied with fresh and cold free flowing water, a lodging house, and canteen.it can also be used as a reception area for various occasions.",
            "It caters not only to local but also to foreign tourist.",
            "Among those leaders who hold position and strived for the development of the barangay, are the following: as \"Teniente Del Barrio\" Pio Alcoy (first Teniente del barrio), Eutiquio Pinon, Estilitocanaria, and Toribio Aplaya.",
            "When the positionof barangay captain, toribio aplaya was the first elected barangay captain, followed by Isaac Esplana, Justino Ranada, Josefina Ranada, And Ruben S. Loyola, and presently by Barangay Captain Joel S. Loyola."
        ],
        [
            "Maysua"
        ],
        [
            "430.15"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Mendez"
        ],
        [
            "165.90"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Napo"
        ],
        [
            "361.85"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Pinagdapugan"
        ],
        [
            "190.91"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Pintor (Binangbangan)"
        ],
        [
            "182.94"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Ponso"
        ],
        [
            "317.91"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "Salvacion"
        ],
        [
            "175.99"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "San Roque"
        ],
        [
            "301.32"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "Barangay San Roque is in Polangui, Albay and it was foundered in the year 1930 by the author Lorenzo Villar and other persons as cofounder namely; Cepriano Seletaria, Cenon Sayson, Julian Villar, Felipe Sayson, Roman Corporal, Cleto Barce all deceased."
        ],
        [
            "The named San Roque originated from the patron Saint San Roque was owned by the couple Mr. and Mrs. Lorenzo Villar.",
            "His wife"
        ],
        [
            "Aurelia Villar bought the image from a peddler out of the money which was intended for their family consumption.",
            "Having no permission"
        ],
        [
            "from her husband got so angry and uttered distasteful words to her about the image.",
            "The following day her husband felt bad and got"
        ],
        [
            "bedridden for so many days.",
            "Such that he could not do his farm works which badly needed his tending and attention.",
            "All the herbal"
        ],
        [
            "Doctors he sought failed to cure his ailment.",
            "His wife Aurelia suggested to him to ask for forgiveness from the image San Roque for the"
        ],
        [
            "things he done and said.",
            "All of a sudden, he got well.",
            "Lorenzo Villar asked an apology to the image and after that his sickness was"
        ],
        [
            "cured.",
            "The couple witnessed several miracles made by the image of San Roque.",
            "The couple decided to construct a chapel for the"
        ],
        [
            "image with the help of the co-founders.",
            "They came to the consensus that the place he named SAN ROQUE, the honour the miraculous"
        ],
        [
            "image."
        ],
        [
            "The land area has approximately 301.3161 hectares.",
            "San Roque has a total population of 1,635 people.",
            "The residents celebrate the"
        ],
        [
            "Barangay Fiesta on the 16th day of August every year."
        ],
        [
            "Most of the people of San Roque depend on farming as their means of livelihood.",
            "They rais copra, palay, banana, root crops, cattle,"
        ],
        [
            "swine, poultry and firewood.",
            "Because the soil of San Roque is no longer so fertile for farming.",
            "Some resident lead to migrate to Metro"
        ],
        [
            "Manila to seek for employment at present there are a few who have the jobs as OFWs."
        ],
        [
            "The residents together with the local Officials requested the school authorities to the Bureau of Public Schools for a classroom and"
        ],
        [
            "teacher to thought the Grade 1 pupils.",
            "In the year 1958 was the first graduation exercises held in this Elementary School.",
            "The school"
        ],
        [
            "site was donated by Mrs. Igleceria Ibo Seletaria in 1941.",
            "At present the school has staff of 9 teacher headed by a head teacher,90"
        ],
        [
            "professional come from Barangay San Roque.",
            "San Roque has a tourist spot said to be KUMAKAWA or rounded hill."
        ],
        [
            "Santicon"
        ],
        [
            "393.38"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "Prior to the establishment of Polangui, the first known “pueblo” was Lanigay.",
            "When the recognized town was named Polangui,"
        ],
        [
            "Lanigay existed as one of its barrios.",
            "It had a wide area of coverage and Santicon was a part of it as a Sitio named after its"
        ],
        [
            "patron saint, San Antonio."
        ],
        [
            "Early residents of the Barrio/Sitio correlated its name to two big places of stone striking each other at night time and because"
        ],
        [
            "of friction it even produced a spark of light.",
            "Local term related by the people to the action of the stones was “santic”.",
            "The"
        ],
        [
            "continuous action of the stones and use of the term by the people, it is changed to “Santicon” and thus the name Santicon"
        ],
        [
            "came to being, as the name of the barrio."
        ],
        [
            "It was in 1928, when Santicon was separated from Lanigay and known to be a duly recognized barrio with 13 households.",
            "At"
        ],
        [
            "the time of its separation, there were only 18 families who pioneered the inhabitants and they were the following; Sabaybay,"
        ],
        [
            "Olicia, Sarion, Casiao, Carullo, Ravago, Seletaria, Salem, Dacara, Nepomuceno, Oliquino, Lacsina, Cao, Recaña, Carillo,"
        ],
        [
            "Bertumen, Penetrante and Resureccion.",
            "Its separation/creation was made possible through the efforts of Vito Cao, the"
        ],
        [
            "appointed Teniente and at the same time donated the lot where the chapel was erected."
        ],
        [
            "Heads of the barrio: (past to present and from Teniente to Captain Vito Cao, Timoteo Dacara, Gregorio Carullo, Francisco"
        ],
        [
            "Resureccion, Enrique Sapiera, Rufino Olicia, Melicio Sanorjo, Vicente Olicia, Teodorico Casiao, Benito Quiquino, Felipe"
        ],
        [
            "Ravago, Justiniano Nepomuceno, Rodrigo Vargas, Jose Lustan, Felicisimo Casiao and Arnulfo B. Penetrante from December 1, 2007(to date).",
            "And the first Barangay Captain Who finished the (3) consecutive terms."
        ],
        [
            "The school its development:"
        ],
        [
            "Part of its development and progress, a public elementary school was opened in 1949.",
            "This took place because of the desire"
        ],
        [
            "of the people to possibly make every resident of the barrio literate.",
            "It took the people much pains and sacrifices in trying to"
        ],
        [
            "start the operation of the school, and out of their painstaking activation the glory is being present by the present generation."
        ],
        [
            "The school site was acquired through donation, June 3, 1949 (5000 sq.",
            "M) and purchase July 13, 1951 (5000 sq.",
            "M.) From"
        ],
        [
            "Leodogario Resanes Sarion.",
            "Since its opening to present, there are the school heads resigned and through/contributed much"
        ],
        [
            "to its improvement and progress.",
            "They are; Lauriano Ronda, Martin Sabio, Silvestre Salalima, Vito Salinel, Humberto"
        ],
        [
            "Gonsales, Luz Vasquez, Juan Briones, Rizalina Bobis, Aludia Rempillo, Alberto S. Sapaula, Jimmy Camba, and Mr. Benjamin"
        ],
        [
            "Rances, Milagros Sanorjo to date."
        ],
        [
            "Its linkage to the poblacion was made easier through the construction of roads and bridges, unlike before that the people had to"
        ],
        [
            "stretch a trail."
        ],
        [
            "Transportation is no longer a problem."
        ],
        [
            "To give credit to all people/residents of Santicon, who made their Barangay as it is now.",
            "People who were ambitious,"
        ],
        [
            "industrious, peace-loving, self-reliant and above all, Progress oriented."
        ],
        [
            "Santa Cruz"
        ],
        [
            "280.51"
        ],
        [
            "Rural"
        ],
        [
            "UADC"
        ],
        [
            "Santa Teresita"
        ],
        [
            "285.13"
        ],
        [
            "Rural"
        ],
        [
            "RADC"
        ],
        [
            "Barangay Sta.",
            "Teresita named of petroness, SAINT THERESE OF THE CHILD JESUS now Sta.",
            "Teresita.",
            "It was founded in 1955 with Davd B. dela"
        ],
        [
            "Cruz serving as its First Teniente del Barrio and was assisted by, Raymundo Garcia, Teofilo Bagacina, Teofilo Borja Sr., Esteban Sanado, Victorino"
        ],
        [
            "Nacario, Salustiano Corporal, Segundino Dacara.",
            "It is formerly a sitio of Magpanambo known as **MALAYAGAN** and become a 42nd Independent"
        ],
        [
            "Barangay of Polangui, Albay in 1955.",
            "The Barangay Site and the School Site was donated by family of Patricio Dela Cruz, Other part of Barangay was"
        ],
        [
            "derived from other neighboring Barangay*s (San Roque, La Medalla & La Purisima .The boundaries areas follows SOUTH Brgy.",
            "San Roque, EAST"
        ],
        [
            "Brgy.",
            "La Purisima and Brgy.",
            "La Medalla and WEST Brgy.",
            "Magpanambo.",
            "The first Teacher was administered by the late Loreta Redada and the first"
        ],
        [
            "Priest was Rev.",
            "Domingo Alberto."
        ],
        [
            "Sugcad"
        ],
        [
            "372.85"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "Ubaliw"
        ],
        [
            "221.44"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion"
        ],
        [
            "The origin of the name UBALIW can be attributed to the presence of a creek that divides the Sitios of Centro Oriental and"
        ],
        [
            "Ubaliw - known for other name during the early days.",
            "Centro then was the center of Poblacion, and Ubaliw then was known"
        ],
        [
            "as BALIU.",
            "As told by older folks, the creek which used to be narrow became wider when Typhoon Jean hit the place in the"
        ],
        [
            "50s."
        ],
        [
            "In the early 1920, the place was still a forested area with about fifteen household.",
            "Wild pigs, carabaos, and other animals"
        ],
        [
            "roamed freely, thus the place was known for its being dirty community.",
            "Ubaliw and Basud used to be a single barrio.",
            "Lupe"
        ],
        [
            "Mirabueno was the First Teniente del Barrio.",
            "Among those who served as Teniente del Barrio were Placio Refelino, Leon"
        ],
        [
            "Salinel, Emilio Refran Sr., and Pedro Sagrit.",
            "Then followed by Barangay Captain Adriana Santayana, Rizalina Sapo,"
        ],
        [
            "Armando Sariba, Jose A. Zamora and Josefina D. Bejer."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PolanguiYearPop.±% p.a.1903 7,960—    1918 13,327+3.50%1939 21,086+2.21%1948 27,623+3.05%1960 38,374+2.78%1970 48,586+2.38%1975 52,541+1.58%1980 55,610+1.14%1990 61,556+1.02%1995 67,314+1.69%2000 70,451+0.98%2007 77,122+1.26%2010 82,307+2.40%2015 88,221+1.33%2020 89,176+0.21%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Polangui had a population of 89,176.",
            "The population density was 610 inhabitants per square kilometre (1,600/sq mi)."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 050514001  \tAgos"
        ],
        [
            " 4.1%"
        ],
        [
            " 3,631"
        ],
        [
            " 3,356"
        ],
        [
            "  ▴"
        ],
        [
            " 0.79%"
        ],
        [
            " 050514002  \tAlnay"
        ],
        [
            " 2.7%"
        ],
        [
            " 2,398"
        ],
        [
            " 2,194"
        ],
        [
            "  ▴"
        ],
        [
            " 0.89%"
        ],
        [
            " 050514003  \tAlomon"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,285"
        ],
        [
            " 1,167"
        ],
        [
            "  ▴"
        ],
        [
            " 0.97%"
        ],
        [
            " 050514004  \tAmoguis"
        ],
        [
            " 0.6%"
        ],
        [
            " 506"
        ],
        [
            " 518"
        ],
        [
            "  ▾"
        ],
        [
            " −0.23%"
        ],
        [
            " 050514005  \tAnopol"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,155"
        ],
        [
            " 1,085"
        ],
        [
            "  ▴"
        ],
        [
            " 0.63%"
        ],
        [
            " 050514006  \tApad"
        ],
        [
            " 1.9%"
        ],
        [
            " 1,665"
        ],
        [
            " 1,323"
        ],
        [
            "  ▴"
        ],
        [
            " 2.33%"
        ],
        [
            " 050514007  \tBalaba"
        ],
        [
            " 1.9%"
        ],
        [
            " 1,697"
        ],
        [
            " 1,355"
        ],
        [
            "  ▴"
        ],
        [
            " 2.28%"
        ],
        [
            " 050514008  \tBalangibang"
        ],
        [
            " 1.9%"
        ],
        [
            " 1,716"
        ],
        [
            " 1,600"
        ],
        [
            "  ▴"
        ],
        [
            " 0.70%"
        ],
        [
            " 050514009  \tBalinad"
        ],
        [
            " 3.7%"
        ],
        [
            " 3,256"
        ],
        [
            " 3,032"
        ],
        [
            "  ▴"
        ],
        [
            " 0.72%"
        ],
        [
            " 050514010  \tBasud"
        ],
        [
            " 4.2%"
        ],
        [
            " 3,752"
        ],
        [
            " 3,408"
        ],
        [
            "  ▴"
        ],
        [
            " 0.97%"
        ],
        [
            " 050514011  \tBinagbangan (Pintor)"
        ],
        [
            " 1.0%"
        ],
        [
            " 922"
        ],
        [
            " 918"
        ],
        [
            "  ▴"
        ],
        [
            " 0.04%"
        ],
        [
            " 050514012  \tBuyo"
        ],
        [
            " 1.2%"
        ],
        [
            " 1,066"
        ],
        [
            " 990"
        ],
        [
            "  ▴"
        ],
        [
            " 0.74%"
        ],
        [
            " 050514013  \tCentro Occidental (Pob.)"
        ],
        [
            " 4.0%"
        ],
        [
            " 3,578"
        ],
        [
            " 3,384"
        ],
        [
            "  ▴"
        ],
        [
            " 0.56%"
        ],
        [
            " 050514014  \tCentro Oriental (Pob.)"
        ],
        [
            " 2.7%"
        ],
        [
            " 2,393"
        ],
        [
            " 2,264"
        ],
        [
            "  ▴"
        ],
        [
            " 0.56%"
        ],
        [
            " 050514015  \tCepres"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,529"
        ],
        [
            " 1,414"
        ],
        [
            "  ▴"
        ],
        [
            " 0.78%"
        ],
        [
            " 050514016  \tCotmon"
        ],
        [
            " 0.7%"
        ],
        [
            " 652"
        ],
        [
            " 529"
        ],
        [
            "  ▴"
        ],
        [
            " 2.11%"
        ],
        [
            " 050514017  \tCotnogan"
        ],
        [
            " 1.9%"
        ],
        [
            " 1,652"
        ],
        [
            " 1,405"
        ],
        [
            "  ▴"
        ],
        [
            " 1.63%"
        ],
        [
            " 050514018  \tDanao"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,131"
        ],
        [
            " 879"
        ],
        [
            "  ▴"
        ],
        [
            " 2.55%"
        ],
        [
            " 050514019  \tGabon"
        ],
        [
            " 3.8%"
        ],
        [
            " 3,381"
        ],
        [
            " 3,223"
        ],
        [
            "  ▴"
        ],
        [
            " 0.48%"
        ],
        [
            " 050514020  \tGamot"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,424"
        ],
        [
            " 1,395"
        ],
        [
            "  ▴"
        ],
        [
            " 0.21%"
        ],
        [
            " 050514022  \tItaran"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,902"
        ],
        [
            " 1,740"
        ],
        [
            "  ▴"
        ],
        [
            " 0.89%"
        ],
        [
            " 050514023  \tKinale"
        ],
        [
            " 2.7%"
        ],
        [
            " 2,402"
        ],
        [
            " 2,204"
        ],
        [
            "  ▴"
        ],
        [
            " 0.86%"
        ],
        [
            " 050514024  \tKinuartilan"
        ],
        [
            " 0.7%"
        ],
        [
            " 594"
        ],
        [
            " 587"
        ],
        [
            "  ▴"
        ],
        [
            " 0.12%"
        ],
        [
            " 050514025  \tLa Medalla"
        ],
        [
            " 1.0%"
        ],
        [
            " 855"
        ],
        [
            " 841"
        ],
        [
            "  ▴"
        ],
        [
            " 0.17%"
        ],
        [
            " 050514026  \tLa Purisima"
        ],
        [
            " 0.6%"
        ],
        [
            " 572"
        ],
        [
            " 613"
        ],
        [
            "  ▾"
        ],
        [
            " −0.69%"
        ],
        [
            " 050514027  \tLanigay"
        ],
        [
            " 4.3%"
        ],
        [
            " 3,830"
        ],
        [
            " 3,592"
        ],
        [
            "  ▴"
        ],
        [
            " 0.64%"
        ],
        [
            " 050514028  \tLidong"
        ],
        [
            " 1.8%"
        ],
        [
            " 1,563"
        ],
        [
            " 1,355"
        ],
        [
            "  ▴"
        ],
        [
            " 1.44%"
        ],
        [
            " 050514029  \tLourdes"
        ],
        [
            " 0.8%"
        ],
        [
            " 733"
        ],
        [
            " 594"
        ],
        [
            "  ▴"
        ],
        [
            " 2.12%"
        ],
        [
            " 050514030  \tMagpanambo"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,342"
        ],
        [
            " 1,361"
        ],
        [
            "  ▾"
        ],
        [
            " −0.14%"
        ],
        [
            " 050514031  \tMagurang"
        ],
        [
            " 4.4%"
        ],
        [
            " 3,884"
        ],
        [
            " 3,846"
        ],
        [
            "  ▴"
        ],
        [
            " 0.10%"
        ],
        [
            " 050514032  \tMatacon"
        ],
        [
            " 4.9%"
        ],
        [
            " 4,398"
        ],
        [
            " 4,148"
        ],
        [
            "  ▴"
        ],
        [
            " 0.59%"
        ],
        [
            " 050514033  \tMaynaga"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,349"
        ],
        [
            " 1,361"
        ],
        [
            "  ▾"
        ],
        [
            " −0.09%"
        ],
        [
            " 050514034  \tMaysua"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,004"
        ],
        [
            " 891"
        ],
        [
            "  ▴"
        ],
        [
            " 1.20%"
        ],
        [
            " 050514035  \tMendez"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,025"
        ],
        [
            " 991"
        ],
        [
            "  ▴"
        ],
        [
            " 0.34%"
        ],
        [
            " 050514036  \tNapo"
        ],
        [
            " 3.9%"
        ],
        [
            " 3,448"
        ],
        [
            " 3,113"
        ],
        [
            "  ▴"
        ],
        [
            " 1.03%"
        ],
        [
            " 050514037  \tPinagdapugan"
        ],
        [
            " 1.1%"
        ],
        [
            " 969"
        ],
        [
            " 888"
        ],
        [
            "  ▴"
        ],
        [
            " 0.88%"
        ],
        [
            " 050514039  \tPonso"
        ],
        [
            " 5.7%"
        ],
        [
            " 5,039"
        ],
        [
            " 4,927"
        ],
        [
            "  ▴"
        ],
        [
            " 0.22%"
        ],
        [
            " 050514040  \tSalvacion"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,208"
        ],
        [
            " 1,088"
        ],
        [
            "  ▴"
        ],
        [
            " 1.05%"
        ],
        [
            " 050514041  \tSan Roque"
        ],
        [
            " 1.9%"
        ],
        [
            " 1,687"
        ],
        [
            " 1,533"
        ],
        [
            "  ▴"
        ],
        [
            " 0.96%"
        ],
        [
            " 050514042  \tSanticon"
        ],
        [
            " 3.2%"
        ],
        [
            " 2,878"
        ],
        [
            " 2,744"
        ],
        [
            "  ▴"
        ],
        [
            " 0.48%"
        ],
        [
            " 050514043  \tSanta Cruz"
        ],
        [
            " 0.7%"
        ],
        [
            " 639"
        ],
        [
            " 652"
        ],
        [
            "  ▾"
        ],
        [
            " −0.20%"
        ],
        [
            " 050514044  \tSanta Teresita"
        ],
        [
            " 1.0%"
        ],
        [
            " 855"
        ],
        [
            " 927"
        ],
        [
            "  ▾"
        ],
        [
            " −0.81%"
        ],
        [
            " 050514045  \tSugcad"
        ],
        [
            " 4.5%"
        ],
        [
            " 3,986"
        ],
        [
            " 3,637"
        ],
        [
            "  ▴"
        ],
        [
            " 0.92%"
        ],
        [
            " 050514046  \tUbaliw"
        ],
        [
            " 3.7%"
        ],
        [
            " 3,270"
        ],
        [
            " 3,235"
        ],
        [
            "  ▴"
        ],
        [
            " 0.11%"
        ],
        [
            "Total"
        ],
        [
            "89,176"
        ],
        [
            "82,307"
        ],
        [
            " ▴"
        ],
        [
            "0.80%"
        ],
        [
            "Poverty incidence of Polangui"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  39.20"
        ],
        [
            "2009  37.83"
        ],
        [
            "2012  26.70"
        ],
        [
            "2015  24.37"
        ],
        [
            "2018  21.34"
        ],
        [
            "2021  22.28"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "Bikol Polangueño is the main dialect in Polangui, classified under Oasnon/West Miraya Bikol language.",
            "The majority of the population speak Tagalog and English.",
            "Other languages/dialects spoken are Bicolano Viejo and Bikol Rinconada (Agos-Matacon Area)."
        ],
        [
            "Religion"
        ],
        [
            "Christianity is the predominant religion with Roman Catholicism having the biggest practitioners.",
            "The four (4) Roman Catholic Parishes of Polangui is grouped as part of the Third Vicariate under the Roman Catholic Diocese of Legazpi.",
            "The Parishes are:"
        ],
        [
            "Sts.",
            "Peter and Paul Parish in Barangay Centro Occidental (main parish)"
        ],
        [
            "St. Dominic Guzman Parish in Barangay Matacon"
        ],
        [
            "St. Anthony of Padua Parish in Barangay Ponso"
        ],
        [
            "Our Lady of Guadalupe Parish in Barangay Lidong"
        ],
        [
            "All of the barangays have their respective patron saints and barangay chapels."
        ],
        [
            "Other Christian denominations present in the municipality include Protestants, Baptist, United Pentecostal Church, and Iglesia ni Cristo.",
            "Islam and Buddhism also have followers in the municipality."
        ],
        [
            "Economy"
        ],
        [
            "Economy of Polangui, Albay"
        ],
        [
            "2020 Financial Highlights"
        ],
        [
            "Comparative Financial Position"
        ],
        [
            "Total Assets:PHP 955.170 million"
        ],
        [
            "Total Liabilities:PHP 298.517 million"
        ],
        [
            "Total Equity:PHP 656.653 million"
        ],
        [
            "Results of Operations"
        ],
        [
            "Total Revenues:PHP 334.342 million"
        ],
        [
            "Total Expenses:PHP 310.599 million"
        ],
        [
            "Excess Income Over Expenses:PHP 23.743 million"
        ],
        [
            "Poverty incidence of Polangui"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  39.20"
        ],
        [
            "2009  37.83"
        ],
        [
            "2012  26.70"
        ],
        [
            "2015  24.37"
        ],
        [
            "2018  21.34"
        ],
        [
            "2021  22.28"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Polangui is classified as a first-class municipality as per DOF Order No.",
            "20-05, dated July 29, 2005."
        ],
        [
            "Agriculture"
        ],
        [
            "Its economy is still heavily dependent on agriculture.",
            "Major crops include rice, corn, cacao, pili, root crops, vegetables, coconuts and abacá.",
            "Poultry and livestock raising are also very much alive."
        ],
        [
            "Shopping centers"
        ],
        [
            "Major business commercial establishments include the Bicol's largest mall chain, Liberty Commercial Center (LCC); and the Novo Asia Jeans and Shirts.",
            "The municipality has also attracted investments from national retail chains such as the recently opened Xentro Mall Polangui and SM Hypermarket.",
            "Other local establishments include Tri-Star Commercial, V5 General Merchandise, Angena Trading, and the recently opened Polangui 168 Enterprises."
        ],
        [
            "Tourism and culture"
        ],
        [
            "Attractions"
        ],
        [
            "Polangui provides a good view of Mount Mayon.",
            "The town hosts various historical and cultural tourism spots and other tourism-oriented recreation centers.",
            "Among these are:"
        ],
        [
            "Spring resorts"
        ],
        [
            "Highlanders Watering Hole Resort is a \"back-to-nature\" vacation spot, located at Barangay Maynaga.",
            "It is 10 kilometres (6.2 mi) away from the business district of Polangui."
        ],
        [
            "Danny's Spring Resort at Barangay Balinad"
        ],
        [
            "Kathleen's Paradise Resort at Barangay Agos"
        ],
        [
            "Villa Sofia Resort (formerly La Oping Swimming Pool and Resort) at Barangay Gabon"
        ],
        [
            "7 Hills Farm and Resort at Barangay Balinad"
        ],
        [
            "Public parks"
        ],
        [
            "Sabido Park"
        ],
        [
            "Parish Patio"
        ],
        [
            "Kiwanis Children's Park"
        ],
        [
            "Nature parks"
        ],
        [
            "Lake Danao Natural Park in Barangay Danao is a small, scenic crater lake, located 15 kilometres (9.3 mi) from the town proper.",
            "It is nestled between Mount Malinao and Mount Masaraga.",
            "The rare tabios or sinarapan (Mystichtys luzonensis), the world's smallest fish, is also cultured here.",
            "The lake is a 30-minute hike through carabao trails and abaca plantations."
        ],
        [
            "Saint Expeditus Eco-Park is part of the Zepeda Leisure Estates, located at Barangay Agos.",
            "Its primary activities such as nature trailing, birdwatching, horseback riding and camping, among others."
        ],
        [
            "Bastian Wildlife Center"
        ],
        [
            "Leisure and sports parks"
        ],
        [
            "Zepeda Leisure Estates situated at Barangay Agos, offers a variety of amenities and facilities such as the Albay's first golf course, a driving range, a spring resort, camping grounds, lodge cabin, a restaurant, picnic area and a nature trail.",
            "Aside from playing golf and throwing in a picnic, available activities also includes pitch and putt, birdwatching and horseback riding."
        ],
        [
            "Polangui Tennis Club at Barangay Centro Occidental"
        ],
        [
            "JGL Gamefarm at Barangay Ubaliw"
        ],
        [
            "Salceda Sports Complex at Barangay Centro Oriental"
        ],
        [
            "Polangui Oval at Barangay Centro Oriental (for renovation)"
        ],
        [
            "Festivals and events"
        ],
        [
            "Polangui Town Fiesta — started as \"Oyangui Festival\" in 2003 and later became \"Pulang Angui Festival\".",
            "It is an annual celebration of Polangueños during the whole month of June."
        ],
        [
            "Semana Santa (Holy Week) — The procession of pasos (Holy images) during Viernes Santo (Good Friday) has attracted devotees and local tourist alike because of the colorful and grandiose life-sized rebultos (statues) depicting the Passion of Christ and His resurrection installed on top of ornately decorated and lighter carrozas or cars.",
            "Many of the images and sculpture are of great antiquity and of magnificent artistry.",
            "Some of them are even centuries-old, like the image of St. Peter which dates back to 1857 as an heirloom piece."
        ],
        [
            "Karangahan sa Polangui — is Polangui's adaptation of the month-long celebration of the province's Karangahan sa Pasko: Albay Green Christmas, usually starting during the last week of November throughout December.",
            "Karangahan originated from the Bicolano term, ranga, which pertains to a higher level of joy and contentment; a term of endearment.",
            "The festival is aimed at the safety of both families and environment by means of an environment-friendly celebration which can be achieved through continued propagation and adherence to its original campaign which is the \"plastic-free, smoke-free and zero casualty\" advocacy and objectives of the province.",
            "Before it was even called Karangahan sa Polangui, Polangueños are already celebrating it as Tia Angui Festival, a concoction of the name of the town's maiden, Angui (Tiya Angui), from which the town derived its name.",
            "Likewise, it may be interpreted as tiangge, a local term for \"bazaar\", which flood the town's public market during Christmas season.",
            "Usually, it is a tight gridwork of crowded stalls peddling Christmas decorations, fireworks, fresh fruits, assorted toys, discounted clothes, jewelry, accessories, electronics, and handicrafts, in the hallways and other empty spaces."
        ],
        [
            "Local products and delicacies"
        ],
        [
            "Calamay (sankaka) – also spelled kalamay which means \"sugar\", is a sticky sweet delicacy that is popular in many regions of the Philippines.",
            "It is locally known in Polangui as sankaka and is made of coconut milk, brown sugar, and ground glutinous rice.",
            "Kalamay can be eaten alone but is usually used as a sweetener for a number of Filipino desserts and beverages.",
            "The town's largest natural producer of sankaka is the Sarilla's Muscovado Milling Facility at Barangay Balaba."
        ],
        [
            "Rice Cakes"
        ],
        [
            "Ibos – is made from glutinous rice cooked in coconut milk, and often steamed wrapped in buli or buri palm (Corypha) leaves.",
            "It is usually eaten sprinkled with sugar."
        ],
        [
            "Balinsuso – is a Bicolano suman made up of ground rice (ordinary or sticky rice), coconut milk, sugar and grated coconut.",
            "In other towns, they call it balisongsong."
        ],
        [
            "Binûtong – is made up of glutinous rice with coconut cream, wrapped in banana leaves.",
            "This is often served as breakfast or merienda, and best paired with hot chocolate or coffee.",
            "The term itself, probably came from  the root word \"butok\" or to \"tie a knot\" as the mouthwatering meal is wrapped and tied in layers of banana leaves in order to confine the flavors inside white it is being cooked.",
            "The banana leaves gives a wonderful flavor to the rice."
        ],
        [
            "Sinapot – is a local term for maruya.",
            "These are sliced bananas dipped in batter, deep fried and dredged in sugar.",
            "All are popular street food and is best eaten during merienda."
        ],
        [
            "Biniribid – is made from grated lukadon (young coconut)/coconut milk, and flour, topped with a mixture of kalamay and brown sugar.",
            "Its name is a Bikol term for twisted, as it is usually curled to form an eight much like twisted bread.",
            "Like the sinapot, it is also best eaten during merienda."
        ],
        [
            "Pili – Of the family Burseraceae, pili (Canarium ovatum) is native to the Philippines and can be found in especially in the Bicol region where it is an important crop and source of income of many families.",
            "Pili is a versatile nut being used for a variety of products.",
            "The nut kernel is the most important product.",
            "It can be eaten raw or roasted where its mild, nutty taste and tender-crispy texture can compare with and even found better than an almond.",
            "Pili kernel is also used in chocolate, ice cream, and baked goods.",
            "The young shoots and the fruit pulp are edible.",
            "The shoots are used in salads, and the pulp is eaten after it is boiled and seasoned.",
            "Boiled pili pulp resembles the sweet potato in texture, it is oily (about 12%) and is considered to have food value similar to that of avocado.",
            "Pulp oil can be extracted and used for cooking or as a substitute for cottonseed oil in the manufacture of soap and edible products.",
            "The stony shells are excellent fuel or growth medium for orchids and ornamental plants."
        ],
        [
            "Cultural properties"
        ],
        [
            "Historical markers"
        ],
        [
            "This list contains an overview of the government-recognized historical markers installed by the National Historical Commission of the Philippines (NHCP) in Polangui that have been commemorated by cast-iron plaques permanently installed in publicly visible locations on buildings, monuments, or in special locations.",
            "While many cultural properties have historical markers installed, not all places marked with historical markers are designated into one of the particular categories of Cultural Properties."
        ],
        [
            "Marker title"
        ],
        [
            "Inscription"
        ],
        [
            "Category"
        ],
        [
            "Type"
        ],
        [
            "Description"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "Language"
        ],
        [
            "Date Issued"
        ],
        [
            "Image"
        ],
        [
            "Camilo Jacob"
        ],
        [
            "                                   CAMILO JACOB"
        ],
        [
            "                                   REBOLUSYONARYO AT ISA SA QUINCE MARTIRES NG BIKOL.",
            "ISINILANG SA POLANGUI, ALBAY, KALAGITNAAN NG IKA-19 NA SIGLO.",
            "NAGING KASAPI NG TRIANGULO, BIKOL, ISANG MASONERIYA SA CAMARINES NA NAGHANGAD NA MAPABUTI ANG KALAGAYAN NG BAYAN.",
            "DINAKIP AT NILITIS NG KORTE MILITAR DAHIL SA BINTANG NA REBELYON, 29 DISYEMBRE 1896.",
            "BINARIL SA BAGUMBAYAN KASAMA ANG IBA PANG MGA BIKOLANONG NAHATULANG REBELDE NG MGA ESPANYOL, 4 ENERO 1897."
        ],
        [
            "Structure"
        ],
        [
            "Monument"
        ],
        [
            "One of the Fifteen Martyrs of Bicol.",
            "A mason from Camarines who sought better conditions for the country."
        ],
        [
            "Centro Occidental, in front of the Sangguniang Bayan building"
        ],
        [
            "13°17′36″N 123°29′02″E﻿ / ﻿13.293314°N 123.483979°E﻿ / 13.293314; 123.483979"
        ],
        [
            "Filipino"
        ],
        [
            "March 7, 2017"
        ],
        [
            "Religious landmarks"
        ],
        [
            "The Saints Peter and Paul Parish Church is located at Barangay Centro Occidental.",
            "It is one of the oldest Catholic churches in the Philippines, which took 10 years to finish.",
            "The church construction was started in 1654 by Fr.",
            "Alonzo de San Juan and was finished in 1664 under the management of Fr.",
            "Juan Bautista Marza."
        ],
        [
            "Santo Entierro Shrine"
        ],
        [
            "Angustia / La Pieta Shrine"
        ],
        [
            "Monuments"
        ],
        [
            "The Pedro Sabido Monument was constructed as a dedication to former Philippine Senator, Pedro Sabido, who was born in Polangui on October 19, 1894, to Don Juan D. Sabido and Doña Maximina Ribaya.",
            "His monument is located at the Sabido Park, beside the Office of the Sangguniang Bayan.",
            "A provincial road, the Pedro Sabido Road, was also dedicated in his honor.",
            "It serves as a major transport road which connects the municipality of Polangui to the municipalities of Oas, the City of Ligao and the First District of Albay."
        ],
        [
            "The Veterans' Memorial was constructed as a dedication to the fallen sons of Polangui who died and shed their blood during the Japanese military occupation in World War II.",
            "The memorial is located in front of the Polangui Tennis Club."
        ],
        [
            "Cristo Rey"
        ],
        [
            "Transportation"
        ],
        [
            "Airport"
        ],
        [
            "The nearest airport is in Legazpi City Legazpi Airport – about 39.1 kilometres (24.3 mi) from Polangui.",
            "Philippine Airlines and Cebu Pacific Air operate in the airport, with daily flights to and from Manila and Cebu.",
            "The construction of the soon Polangui Domestic Airport at Barangay Balangibang is still under negotiation."
        ],
        [
            "Seaport"
        ],
        [
            "Polangui is a landlocked municipality, entirely enclosed by land.",
            "The nearest ports from Polangui are Pantao Port in Libon, Pio Duran Port in Pio Duran, Legazpi Seaport in Legazpi City, and Tabaco International Seaport in Tabaco City."
        ],
        [
            "Railways"
        ],
        [
            "In March 2012, the 10 1/2-hour Mayon Limited started traveling between Manila and Ligao City, but later ceased operations.",
            "In 2016, operation of the PNR Southrail Line resumed with one round trip between Naga City and Legazpi City, and served the town through the Polangui railway station.",
            "However, it was also stopped due to issues on maintenance and public safety."
        ],
        [
            "Roads and bridges"
        ],
        [
            "Road network"
        ],
        [
            "Roads in Polangui are classified into:"
        ],
        [
            "National roads"
        ],
        [
            "Daang Maharlika (LZ/AH26)"
        ],
        [
            "Albay West Coast Rd (N638)"
        ],
        [
            "Matacon-Libon-Polangui Jct Rd"
        ],
        [
            "Polangui Poblacion Rd"
        ],
        [
            "Provincial roads"
        ],
        [
            "Pedro Sabido Rd"
        ],
        [
            "Buhi-Polangui Rd"
        ],
        [
            "Municipal roads"
        ],
        [
            "Barangay roads"
        ],
        [
            "Mode of access"
        ],
        [
            "Polangui can be reached through land transport (by bus) from Manila in about 10 hours, two hours less if the new (Andaya Highway) route is taken.",
            "Main routes can be reached through by aircon buses, Garage to Terminal (GT) Vans and FX (location and access to is underway with the new Polangui Terminal), private cars, trimobiles, padyak and motorcycles.",
            "Some bus companies with stations in Polangui are:"
        ],
        [
            "Alps"
        ],
        [
            "Antonina Lines"
        ],
        [
            "Cagsawa Travel & Tours"
        ],
        [
            "DLTB Co."
        ],
        [
            "Executive Carriers"
        ],
        [
            "Gold Line Tours, Inc."
        ],
        [
            "Peñafrancia Tours"
        ],
        [
            "Philtranco"
        ],
        [
            "Raymond Transportation"
        ],
        [
            "RSL Bus Transport Corporation"
        ],
        [
            "In order to spur development in the municipality, the Toll Regulatory Board declared Toll Road 5 the extension of South Luzon Expressway."
        ],
        [
            "Communication"
        ],
        [
            "Radio stations"
        ],
        [
            "A local FM Station, Hot FM Polangui DWJJ 97.9 MHz, broadcasts live updates, news and entertainment.",
            "The municipality also receives signal from all major radio stations from Legazpi City and even Naga City in Camarines Sur."
        ],
        [
            "TV stations"
        ],
        [
            "There is one TV relay station operating in the municipality (ABS-CBN).",
            "However, local TVs get strong signals from nearby Legazpi City and Naga City relay stations.",
            "Cable services are also offered in the area by two companies:"
        ],
        [
            "Dream Cable Television (DCTV)"
        ],
        [
            "Estevez Cable Television (ESTV)"
        ],
        [
            "Telephone"
        ],
        [
            "There are two existing telephone lines in Polangui:"
        ],
        [
            "Bayan Telecommunications (BayanTel)"
        ],
        [
            "Philippine Long Distance Telephone Company (PLDT)"
        ],
        [
            "Cellular telephone sites"
        ],
        [
            "The municipality is served by the Philippines' three main mobile phone carriers:"
        ],
        [
            "Smart Communications"
        ],
        [
            "Globe Telecom"
        ],
        [
            "Sun Cellular"
        ],
        [
            "Education"
        ],
        [
            "Presently, there are almost 20 Day Care Centers, 3 private pre-schools, 42 public elementary schools, 5 private elementary schools, 7 public high schools, 3 private high schools and 4 tertiary schools in the municipality."
        ],
        [
            "Tertiary / vocational / technical education"
        ],
        [
            "The municipality has four tertiary schools:"
        ],
        [
            "The Bicol University Polangui Campus (BUPC) is located in Barangay Centro Occidental, and used to be known as the School for Philippine Craftsmen and offered vocational courses.",
            "through R.A. 7722, R.A. 8292 & R.A. 8769, on December 14, 2000, and renamed as Bicol University Polangui Campus.",
            "From the five courses offered in 2000, it now offers fifteen courses including BS in Nursing, BS in Computer Engineering and BS in Electronics and Communications Engineering."
        ],
        [
            "The Polangui Community College (PCC) has four major program offerings: Associate in Hotel & Restaurant Management, Associate in Office Administration, Bachelor in Secondary Education and Bachelor of Science in Agribusiness."
        ],
        [
            "The Elite Fashion School, which offers technical and vocational courses.",
            "It is located at Barangay Centro Oriental, in front of the Land Bank of the Philippines- Polangui Branch."
        ],
        [
            "The Computer Arts and Technological (CAT) College, which was opened in 2012.",
            "It is located at the newly constructed commercial building at Barangay Ubaliw, beside the Polangui Terminal."
        ],
        [
            "Secondary education"
        ],
        [
            "Public high schools"
        ],
        [
            "The Polangui General Comprehensive High School is located in Barangay Centro Occidental, and started as Albay High School Polangui (AHSP) with Mr. Sisenando Reantaso as its first Principal (1948–1953).",
            "In 1963, President Diosdado Macapagal signed RA No.",
            "3993 converting the AHSP into a community school, The Polangui General Comprehensive High School (PGCHS), a national secondary school patterned after the comprehensive high school in Detroit, Michigan U.S.A."
        ],
        [
            "Ponso National High School"
        ],
        [
            "Matacon National High School"
        ],
        [
            "Magpanambo National High School"
        ],
        [
            "Itaran National High School"
        ],
        [
            "La Medalla National High School"
        ],
        [
            "Lanigay National High School"
        ],
        [
            "Maysua High School"
        ],
        [
            "Private high schools"
        ],
        [
            "Salle Learning Center at Barangay Centro Occidental"
        ],
        [
            "Saint Peter's Academy at Barangay Centro Occidental"
        ],
        [
            "Colegio de Santa Monica of Polangui, Inc. at Barangay Centro Occidental"
        ],
        [
            "Primary education"
        ],
        [
            "Public elementary schools"
        ],
        [
            "Polangui South Central School at Barangay Centro Oriental, along the National Highway.",
            "It is the flagship school of the Polangui South District.",
            "Its satellite schools are the following:"
        ],
        [
            "Agos Elementary School"
        ],
        [
            "Alomon Elementary School"
        ],
        [
            "Apad Elementary School"
        ],
        [
            "Balangibang Elementary School"
        ],
        [
            "Cotnogan Elementary School"
        ],
        [
            "Kinale Elementary School"
        ],
        [
            "Lanigay Elementary School"
        ],
        [
            "La Medalla Elementary School"
        ],
        [
            "La Purisima Elementary School"
        ],
        [
            "Magpanambo Elementary School"
        ],
        [
            "Magurang Elementary School"
        ],
        [
            "Matacon Elementary School"
        ],
        [
            "Santicon Elementary School"
        ],
        [
            "Salvacion Elementary School"
        ],
        [
            "San Roque Elementary School"
        ],
        [
            "Santa Teresita Elementary School"
        ],
        [
            "Polangui North Central School at Barangay Centro Oriental.",
            "It is the flagship school of the Polangui North District.",
            "Its satellite schools are the following:"
        ],
        [
            "Alnay Elementary School"
        ],
        [
            "Balaba Elementary School"
        ],
        [
            "Balinad Elementary School"
        ],
        [
            "Cepres Elementary School"
        ],
        [
            "Cotmon Elementary School"
        ],
        [
            "Dalogo Elementary School"
        ],
        [
            "Danao Elementary School"
        ],
        [
            "Itaran Elementary School"
        ],
        [
            "Jose S. Duran Elementary School"
        ],
        [
            "Kinuartelan Elementary School"
        ],
        [
            "Lidong Elementary School"
        ],
        [
            "Lourdes Elementary School"
        ],
        [
            "Maynaga Elementary School"
        ],
        [
            "Maysua Elementary School"
        ],
        [
            "Mendez Elementary School"
        ],
        [
            "Napo Elementary School"
        ],
        [
            "Pinagdapugan Elementary School"
        ],
        [
            "Pintor Elementary School"
        ],
        [
            "Ponso North Elementary School"
        ],
        [
            "Ponso South Elementary School"
        ],
        [
            "Santa Cruz Elementary School"
        ],
        [
            "Sugcad Elementary School"
        ],
        [
            "Luis Severa Matza Elementary School"
        ],
        [
            "Private elementary schools"
        ],
        [
            "Salle Learning Center at Barangay Centro Occidental"
        ],
        [
            "Saint Peter's Academy at Barangay Centro Occidental"
        ],
        [
            "Global Vision Excellence School at Barangay Basud"
        ],
        [
            "Polangui SDA Multigrade School at Barangay Basud"
        ],
        [
            "Colegio de Santa Monica of Polangui, Inc. at Barangay Centro Occidental"
        ],
        [
            "Day care and pre-school"
        ],
        [
            "Private Pre-schools"
        ],
        [
            "Salle Learning Center at Barangay Centro Occidental"
        ],
        [
            "Saint Peter's Academy at Barangay Centro Occidental"
        ],
        [
            "Global Vision Excellence School at Barangay Basud"
        ],
        [
            "Saint Noah's Learning Center at Barangay Magurang"
        ],
        [
            "Golden Wisdom Proverbial School at Barangay Gabon"
        ],
        [
            "Public services"
        ],
        [
            "Healthcare"
        ],
        [
            "The present health services of the municipality are administered by 2 Municipal Health Officers, 2 Public Health Nurses, 1 Medical Technologist, 1 Dentist, and 12 Midwives."
        ],
        [
            "Aside from the Municipal Health Office and Barangay Health Stations, there are 2 Private Hospitals (Isip General Hospital in Gabon and Perillo General Hospital in Magurang), and 14 clinics that provide alternative health services to the population of the municipality.",
            "Polangui is equipped with 6 ambulances- 1 in the Rural Health Unit (RHU), 2 in the municipal hall, and 3 in the health station centers in Balinad, Itaran and Matacon."
        ],
        [
            "The Basic Emergency Obstetric and Newborn Care (BEmONC) Birthing Facility at RHU-Polangui specializes in maternal healthcare, along with several lying-in and birthing clinics.",
            "Polangui's BEmONC Birthing Facility is a PhilHealth-accredited institution and offers free services to cardholders."
        ],
        [
            "A new medical establishment recently opened its doors- the Our Lady of Perpetual Help Diagnostic and Dialysis Center at Barangay Centro Oriental, in front of the Polangui South Central Elementary School.",
            "Polangui and Legazpi City are the only ones in Albay who have a dialysis facility."
        ],
        [
            "Waste disposal"
        ],
        [
            "In dealing with solid waste management, the Municipality of Polangui has adopted the usual means of dumping garbage in an open-pit dumpsite.",
            "Garbage is collected from each barangay in the poblacion every Tuesday and Friday.",
            "The municipality has four garbage trucks to ensure that the garbage is collected and disposed in the waste disposal site located at Sitio Barobo, about 4-kilometre (2.5 mi) distance from the central business district."
        ],
        [
            "Fire protection"
        ],
        [
            "The Polangui Fire Station, Bureau of Fire Protection is located at Barangay Centro Occidental, between the Municipal Hall and the Polangui Police Station.",
            "The Polangui BFP is headed by Fire Marshal SINSP MARC ALLAN C CONSUEGRA."
        ],
        [
            "Police and law enforcement"
        ],
        [
            "Polangui PNP is headed by PSI Edgar Azotea"
        ],
        [
            "Penology"
        ],
        [
            "The Polangui District Jail is manned by officers of the Bureau of Jail Management and Penology (BJMP), headed by Jail Warden Sr. Insp.",
            "Alfredo R. Ricaford, Jr."
        ],
        [
            "Utilities"
        ],
        [
            "Power"
        ],
        [
            "The Albay Power and Energy Corporation (APEC) Sub-Station 2 in Barangay Centro Occidental provides electricity to the majority of the town's barangays."
        ],
        [
            "Water"
        ],
        [
            "Water supply is managed by the Polangui Waterworks Services Administration (POWASA), inaugurated by President Gloria Macapagal Arroyo, located at Barangay Balinad.",
            "Its present service area encompasses the poblacion and some of the other barangays.",
            "The rest of the residents, most especially those in the upland and rural areas are still dependent on shallow wells, deep wells or springwater."
        ],
        [
            "Burial grounds"
        ],
        [
            "There are 7 cemeteries in the municipality:"
        ],
        [
            "Polangui Catholic Cemetery in Barangay Sugcad"
        ],
        [
            "Our Garden of Faith Memorial Park in Barangay Sugcad"
        ],
        [
            "Polangui Chinese Cemetery in Barangay Sugcad"
        ],
        [
            "Parish Ossuary in Barangay Centro Occidental"
        ],
        [
            "Parish Cemetery in Barangay Lidong"
        ],
        [
            "Parish Cemetery in Barangay Matacon"
        ],
        [
            "Parish Cemetery in Barangay Ponso"
        ],
        [
            "Government"
        ],
        [
            "Elected officials"
        ],
        [
            "2022–2025 Polangui Municipal Officials"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "Mayor"
        ],
        [
            "Raymond Adrian E. Salceda ♯"
        ],
        [
            "NUP"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Cherilie L. Mella-Sampal +"
        ],
        [
            "NUP"
        ],
        [
            "Councilors"
        ],
        [
            "Kristel Louise S. Pasia +"
        ],
        [
            "PROMDI"
        ],
        [
            "Mark Thet N. Sabando +"
        ],
        [
            "NUP"
        ],
        [
            "Eugene L. Arrive ‹›"
        ],
        [
            "PROMDI"
        ],
        [
            "Juan Miguel Ricardo S. Salceda +"
        ],
        [
            "NUP"
        ],
        [
            "Noli D. Samlero ‹›"
        ],
        [
            "NUP"
        ],
        [
            "Remgildo C. Gonzales, Jr. ‹›"
        ],
        [
            "PROMDI"
        ],
        [
            "Jose O. Villar, Jr. ‹›"
        ],
        [
            "NUP"
        ],
        [
            "Edna R. Siguenza +"
        ],
        [
            "PROMDI"
        ],
        [
            "Ex Officio Municipal Council Members"
        ],
        [
            "ABC President"
        ],
        [
            "Bernie S. Broncano (Gamot)"
        ],
        [
            "Nonpartisan"
        ],
        [
            "SK Federation President"
        ],
        [
            "John Joseph G. Villar (Matacon)"
        ],
        [
            "Nonpartisan"
        ],
        [
            "Legend"
        ],
        [
            "A + indicates that the official is elected for the first term"
        ],
        [
            "A ♯ indicates that the official is re-elected to a higher position"
        ],
        [
            "A ‹› indicates that the official is re-elected to the same position"
        ],
        [
            "Past municipal administrators"
        ],
        [
            "Spanish regime (1750–1899)"
        ],
        [
            "Inclusive years"
        ],
        [
            "Capitan municipal"
        ],
        [
            "1750–1752"
        ],
        [
            "Domingo dela Sarsa"
        ],
        [
            "1752–1753"
        ],
        [
            "Diego Langcauon"
        ],
        [
            "1753–1754"
        ],
        [
            "Antonio Santa Maria"
        ],
        [
            "1754–1755"
        ],
        [
            "Diego Bananakaw"
        ],
        [
            "1755–1756"
        ],
        [
            "Pantaleon dela Vinbria"
        ],
        [
            "1756–1757"
        ],
        [
            "Laureano Pangpaguon"
        ],
        [
            "1757–1758"
        ],
        [
            "Manuel Pimentel"
        ],
        [
            "1758–1760"
        ],
        [
            "Santiago Florencio"
        ],
        [
            "1760–1761"
        ],
        [
            "Jose Eusebio"
        ],
        [
            "1761–1762"
        ],
        [
            "Narciso delos Martires"
        ],
        [
            "1762–1763"
        ],
        [
            "Mariano Josorio"
        ],
        [
            "1763–1764"
        ],
        [
            "Diego San Agustin"
        ],
        [
            "1764–1765"
        ],
        [
            "Francisco Pasion"
        ],
        [
            "1765–1766"
        ],
        [
            "Narciso delos Martires"
        ],
        [
            "1766–1767"
        ],
        [
            "Agustin Dayauon"
        ],
        [
            "1767–1768"
        ],
        [
            "Pedro Magatas"
        ],
        [
            "1768–1769"
        ],
        [
            "Ignacio Duran"
        ],
        [
            "1769–1770"
        ],
        [
            "Miguel Josorio"
        ],
        [
            "1770–1771"
        ],
        [
            "Pedro Pasion"
        ],
        [
            "1771–1772"
        ],
        [
            "Agustin Dayauon"
        ],
        [
            "1772–1773"
        ],
        [
            "Pedro Magatas"
        ],
        [
            "1773–1775"
        ],
        [
            "Santiago Damas"
        ],
        [
            "1775–1802"
        ],
        [
            "None"
        ],
        [
            "1802–1803"
        ],
        [
            "Vicente Santo Domingo"
        ],
        [
            "1803–1804"
        ],
        [
            "Agustin San Pascual"
        ],
        [
            "1804–1805"
        ],
        [
            "Antonio San Pascual"
        ],
        [
            "1805–1806"
        ],
        [
            "Bernabe S. Buenaventura"
        ],
        [
            "1806–1807"
        ],
        [
            "Tomas Eleazar"
        ],
        [
            "1807–1808"
        ],
        [
            "Damaso de Valencia"
        ],
        [
            "1808-1808"
        ],
        [
            "Agustin San Pascual"
        ],
        [
            "1809–1810"
        ],
        [
            "Fernando Almazan"
        ],
        [
            "1810–1811"
        ],
        [
            "Fernando dela Cruz"
        ],
        [
            "1811–1812"
        ],
        [
            "Agustin San Pascual"
        ],
        [
            "1812–1813"
        ],
        [
            "Francisco S. Agustin"
        ],
        [
            "1813–1814"
        ],
        [
            "Rosendo dela Cruz"
        ],
        [
            "1814–1815"
        ],
        [
            "Remegio San Agustin"
        ],
        [
            "1815–1816"
        ],
        [
            "Estanislao Perez"
        ],
        [
            "1816–1817"
        ],
        [
            "Antonio Duran"
        ],
        [
            "1817–1818"
        ],
        [
            "Nicolas Bibiano"
        ],
        [
            "1818–1819"
        ],
        [
            "Jose Duran"
        ],
        [
            "1819–1820"
        ],
        [
            "Estanislao Perez"
        ],
        [
            "1820–1821"
        ],
        [
            "Manuel San Antonio"
        ],
        [
            "1821–1822"
        ],
        [
            "Pablo delos Angeles"
        ],
        [
            "1822–1823"
        ],
        [
            "Nicolas Perez"
        ],
        [
            "1823–1824"
        ],
        [
            "Salvador dela Soledad"
        ],
        [
            "1824–1825"
        ],
        [
            "Antonio Duran"
        ],
        [
            "1825–1826"
        ],
        [
            "Margarito Buenaventura"
        ],
        [
            "1826–1827"
        ],
        [
            "Agustin San Pascual"
        ],
        [
            "1827–1828"
        ],
        [
            "Pascual Mariano"
        ],
        [
            "1828–1829"
        ],
        [
            "Jose Pasion"
        ],
        [
            "1829–1830"
        ],
        [
            "Antonio Marcelo"
        ],
        [
            "1830–1831"
        ],
        [
            "Margarito Buenaventura"
        ],
        [
            "1831–1832"
        ],
        [
            "Francisco S. Nicolas"
        ],
        [
            "1832–1833"
        ],
        [
            "Austero Tadio"
        ],
        [
            "1833–1834"
        ],
        [
            "Gregorio del Castillo"
        ],
        [
            "1834–1835"
        ],
        [
            "Manuel S. Agustin"
        ],
        [
            "1835–1836"
        ],
        [
            "Miguel San Mateo"
        ],
        [
            "1836–1837"
        ],
        [
            "Miguel Santa Isabel"
        ],
        [
            "1837–1838"
        ],
        [
            "Miguel Santa Ana"
        ],
        [
            "1838–1839"
        ],
        [
            "Martin Victoria"
        ],
        [
            "1839–1840"
        ],
        [
            "Manuel Acasio"
        ],
        [
            "1840–1841"
        ],
        [
            "Jose Torres"
        ],
        [
            "1841–1842"
        ],
        [
            "Margarito Buenaventura"
        ],
        [
            "1842–1843"
        ],
        [
            "Pedro Nolasco"
        ],
        [
            "1843–1844"
        ],
        [
            "Pascual Borromeo"
        ],
        [
            "1844–1845"
        ],
        [
            "Juan dela Cruz"
        ],
        [
            "1845–1846"
        ],
        [
            "Lorenzo Roque"
        ],
        [
            "1846–1847"
        ],
        [
            "Jose Espinas"
        ],
        [
            "1847–1848"
        ],
        [
            "Juan Eusebio"
        ],
        [
            "1848–1849"
        ],
        [
            "Felizardo Florin"
        ],
        [
            "1849–1850"
        ],
        [
            "Vicente dela Cruz"
        ],
        [
            "1850–1851"
        ],
        [
            "Camilo Mella Silva"
        ],
        [
            "1851–1852"
        ],
        [
            "Jose Sale Duran"
        ],
        [
            "1852–1853"
        ],
        [
            "Francisco Florin Padie"
        ],
        [
            "1853–1854"
        ],
        [
            "Antonio Sabido Abad"
        ],
        [
            "1854–1855"
        ],
        [
            "Vicente Perez Santanez"
        ],
        [
            "1855–1856"
        ],
        [
            "Juan Duran"
        ],
        [
            "1856–1857"
        ],
        [
            "Gregorio Imperial"
        ],
        [
            "1857–1858"
        ],
        [
            "Sacramento Salvo"
        ],
        [
            "1858–1859"
        ],
        [
            "Tranquilino Hernandez"
        ],
        [
            "1859–1860"
        ],
        [
            "Bartolome Sarte"
        ],
        [
            "1860–1861"
        ],
        [
            "Gabriel Salaber"
        ],
        [
            "1861–1862"
        ],
        [
            "Pedro Sadia"
        ],
        [
            "1862–1863"
        ],
        [
            "Pedro Sabater"
        ],
        [
            "1863–1865"
        ],
        [
            "Teodoro Salvo"
        ],
        [
            "1865–1866"
        ],
        [
            "Antonio Lluc"
        ],
        [
            "1866–1867"
        ],
        [
            "Anastacio Lluc"
        ],
        [
            "1867–1869"
        ],
        [
            "Abraham Isaac"
        ],
        [
            "1869–1871"
        ],
        [
            "Valeriano Sarte Duran"
        ],
        [
            "1871–1873"
        ],
        [
            "Pablo Santor"
        ],
        [
            "1873–1877"
        ],
        [
            "Policarpio Del Valle"
        ],
        [
            "1877–1879"
        ],
        [
            "Nicomedes Sale Duran"
        ],
        [
            "1879–1881"
        ],
        [
            "Austero Sapalicio"
        ],
        [
            "1881–1885"
        ],
        [
            "Luis Duran"
        ],
        [
            "1885–1887"
        ],
        [
            "Pascual Salegumba"
        ],
        [
            "1887–1890"
        ],
        [
            "Margarito Sadueste"
        ],
        [
            "1890–1892"
        ],
        [
            "Valentin Saba"
        ],
        [
            "1892–1895"
        ],
        [
            "Juan Sadueste"
        ],
        [
            "1895–1899"
        ],
        [
            "Agaton Saba"
        ],
        [
            "1899–1901"
        ],
        [
            "Macario Samson"
        ],
        [
            "American rule (1901–1941)"
        ],
        [
            "Inclusive years"
        ],
        [
            "Municipal president"
        ],
        [
            "1901–1902"
        ],
        [
            "Clemente Sarte (Acting Chief Executive)"
        ],
        [
            "Lorenzo Duran (1st Municipal President)"
        ],
        [
            "1902–1904"
        ],
        [
            "Procopio Arbo"
        ],
        [
            "1904–1906"
        ],
        [
            "Clemente Sarte"
        ],
        [
            "1906–1908"
        ],
        [
            "Juan Florin"
        ],
        [
            "1908–1911"
        ],
        [
            "Ruperto Carreon"
        ],
        [
            "1911–1913"
        ],
        [
            "Juan Sarte"
        ],
        [
            "1913–1916"
        ],
        [
            "Rufino Tuanqui"
        ],
        [
            "1916–1919"
        ],
        [
            "Quirico Duran"
        ],
        [
            "1919–1928"
        ],
        [
            "Juan Florin"
        ],
        [
            "1928–1931"
        ],
        [
            "Ruperto Carreon"
        ],
        [
            "1931–1933"
        ],
        [
            "Gregorio Ante"
        ],
        [
            "1934–1935"
        ],
        [
            "Ruperto Carreon"
        ],
        [
            "1935–1941"
        ],
        [
            "Crisostomo Silo"
        ],
        [
            "Japanese occupation (1941–1947)"
        ],
        [
            "Inclusive years"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "1941–1944"
        ],
        [
            "Cipriano L. Saunar (Vice Mayor of the defunct Commonwealth government, was appointed mayor by the Japanese government)"
        ],
        [
            "1944–1947"
        ],
        [
            "Manuel A. Samson, Sr."
        ],
        [
            "Post-war period (1947-date)"
        ],
        [
            "Inclusive years"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Municipal Vice Mayor"
        ],
        [
            "SK Federation President"
        ],
        [
            "ABC President"
        ],
        [
            "Remarks"
        ],
        [
            "1947–1960"
        ],
        [
            "Jesus S. Salalima"
        ],
        [
            "1960–1964"
        ],
        [
            "Conrado A. Sabater"
        ],
        [
            "1964–1968"
        ],
        [
            "Mariano Sapalicio"
        ],
        [
            "1968–1981"
        ],
        [
            "Conrado A. Sabater"
        ],
        [
            "Conrado A. Sabater was only Presiding Officer from 1976 to 1981"
        ],
        [
            "1981–1986"
        ],
        [
            "Irineo T. Sales, Jr."
        ],
        [
            "1986–1987"
        ],
        [
            "Romeo Gonzales"
        ],
        [
            "Honesto S. Borja"
        ],
        [
            "1987–1988"
        ],
        [
            "Honesto S. Borja"
        ],
        [
            "Honesto S. Borja took the place as Municipal Mayor after the death of then incumbent Mayor Romeo Gonzales."
        ],
        [
            "1988–1998"
        ],
        [
            "Rafael A.",
            "Lo"
        ],
        [
            "Jesus S. Salceda, Sr."
        ],
        [
            "1998–2001"
        ],
        [
            "Brett Joseph B. Salalima"
        ],
        [
            "Norberto S. Sabaybay"
        ],
        [
            "2001–2010"
        ],
        [
            "Jesus S. Salceda, Sr."
        ],
        [
            "Brando M. Sael (2001–2004)"
        ],
        [
            "Renato S. Borja (2004–2010)"
        ],
        [
            "Shayne T. Samaniego (2002–2007)"
        ],
        [
            "Josue L. Del Villar (2007–2010)"
        ],
        [
            "Jose A. Zamora (2004–2007)"
        ],
        [
            "Lito S. Ret (2007–2010)"
        ],
        [
            "2010–2019"
        ],
        [
            "Cherilie M. Sampal"
        ],
        [
            "Jesus S. Salceda, Jr. (2010–2013)"
        ],
        [
            "Raul G. Lim (2013–2016)"
        ],
        [
            "Herbert S. Borja (2016–2019)"
        ],
        [
            "Patricia Anne R. Magistrado (2010–2013)"
        ],
        [
            "William H. Buendia, Sr. (2010–2013)"
        ],
        [
            "Lito S. Ret (2013–2014)"
        ],
        [
            "Raymond Adrian F. Salceda (2014–2016)"
        ],
        [
            "Cherilie M. Sampal was the first female municipal mayor and sixth in Albay (next to Agnes P. Dycoco of Libon, Cielo Krisel L. Luistro of Tabaco City, Linda P. Gonzales of Ligao City, Imelda C. Roces and Carmen Geraldine B. Rosal of Legazpi City)"
        ],
        [
            "2019–2022"
        ],
        [
            "Andy A. Mariscotes"
        ],
        [
            "Restituto S. Fernandez, Jr. (2019–2022)"
        ],
        [
            "John Joseph G. Villar (2018–present)"
        ],
        [
            "Raymond Adrian F. Salceda (2016–2022)"
        ],
        [
            "Awards and recognitions"
        ],
        [
            "Year"
        ],
        [
            "Award"
        ],
        [
            "Level"
        ],
        [
            "Award-giving body"
        ],
        [
            "2021"
        ],
        [
            "Albay for Beautification, Clean and Green Program (AFBCGP) Most Outstanding LGU"
        ],
        [
            "Provincial"
        ],
        [
            "Provincial Government of Albay"
        ],
        [
            "2021"
        ],
        [
            "Albay for Beautification, Clean and Green Program (AFBCGP) 2nd Most Outstanding Barangay (Brgy.",
            "Maysua)"
        ],
        [
            "Provincial"
        ],
        [
            "Provincial Government of Albay"
        ],
        [
            "2021"
        ],
        [
            "Albay for Beautification, Clean and Green Program (AFBCGP) Most Outstanding Municipal Agricultural Officer (Alfredo Mariscotes Jr.)"
        ],
        [
            "Provincial"
        ],
        [
            "Provincial Government of Albay"
        ],
        [
            "2019"
        ],
        [
            "2019 Seal of Good Local Governance"
        ],
        [
            "National"
        ],
        [
            "Department of the Interior and Local Government"
        ],
        [
            "2019"
        ],
        [
            "2019 Seal of Good Financial Housekeeping"
        ],
        [
            "National"
        ],
        [
            "Department of the Interior and Local Government"
        ],
        [
            "2018"
        ],
        [
            "2018 Seal of Good Financial Housekeeping"
        ],
        [
            "National"
        ],
        [
            "Department of the Interior and Local Government"
        ],
        [
            "2017"
        ],
        [
            "2017 Seal of Good Financial Housekeeping"
        ],
        [
            "National"
        ],
        [
            "Department of the Interior and Local Government"
        ],
        [
            "2016"
        ],
        [
            "Best LGU Rabies Program Implementer"
        ],
        [
            "National"
        ],
        [
            "Department of Agriculture - Bureau of Animal Industry"
        ],
        [
            "2014"
        ],
        [
            "Agri-Pinoy Rice Achievers Award (APRAA) Hall of Fame"
        ],
        [
            "National"
        ],
        [
            "Department of Agriculture"
        ],
        [
            "2012"
        ],
        [
            "Most Outstanding Kadunong Award for Best Practices in Education"
        ],
        [
            "Provincial"
        ],
        [
            "Provincial Government of Albay"
        ],
        [
            "Notable personalities"
        ],
        [
            "Pedro R. Sabido — Former Philippine Senator, Former Philippine Ambassador to Spain and the Vatican, Former Albay 3rd District Representative (1922–1925, 1925–1928, 1928–1931, 1931–1934, 1935–1938, 1938–1941)"
        ],
        [
            "Jose Ma.",
            "Clemente \"Joey\" S. Salceda — Albay 2nd District Representative (2016–present), Former Albay Provincial Governor (2007–2016),"
        ],
        [
            "Reno G. Lim — Former Albay 3rd District Representative (2007–2010)"
        ],
        [
            "Dianne Elaine S. Necio — Binibining Pilipinas International 2011, Binibining Pilipinas 2010 First Runner-up, Miss Tabak 2009, Mutya ng Bicolandia"
        ],
        [
            "Rodolfo \"Rudy\" Agapay Salalima — First Secretary of the Department of Information and Communications Technology (DICT), Former Chief Legal Counsel and Senior Advisor of Globe Telecom, Former Senior Vice President for Corporate and Regulatory Affairs and Managing Director of Ayala Corporation, Former President of the Philippine Chamber of Telecommunications Operators (PCTO) and International Telecommunication Union Council Working Group for the Amendment of ITU Constitution and Convention Vice Chairman for Asia-Pacific Region"
        ],
        [
            "Sister cities"
        ],
        [
            "Local"
        ],
        [
            " General Santos - signed on May 19, 2021"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Polangui |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Albay\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Polangui, Albay : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved December 29, 2018."
        ],
        [
            "^ \"Municipal: Polangui\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ \"Barangay Demographic Profile - Balangibang, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Cotnogan, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Danao, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Gabon, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Gamot, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Itaran, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - La Medalla, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Lanigay, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Magurang, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Matacon, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Maynaga, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - San Roque, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Santicon, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Santa Teresita, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Barangay Demographic Profile - Ubaliw, Polangui, Albay\".",
            "bdp.bgas-phil.net.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Albay\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Learn Bicol Polangui\".",
            "learnbicol.blogspot.com.",
            "Retrieved August 26, 2020."
        ],
        [
            "^ \"Commission on Audit Financial Report 2020-Polangui\".",
            "Quezon City, Philippines: Commission on Audit (COA).",
            "Retrieved October 4, 2021."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Holy Wednesday Procession (Polangui, Albay) | Random Thoughts of a Middle Child\".",
            "Archived from the original on January 10, 2014.",
            "Retrieved May 10, 2013."
        ],
        [
            "^ \"Good Friday: When the Saints Go Marching in (Polangui, Albay) | Random Thoughts of a Middle Child\".",
            "Archived from the original on January 10, 2014.",
            "Retrieved May 10, 2013."
        ],
        [
            "^ \"Insights from within and Out: I Miss Binutong, I miss My Lola as I Miss My Childhood\".",
            "September 14, 2011."
        ],
        [
            "^ \"Pili Nut\"."
        ],
        [
            "^ \"NHCP unveils the \"Camilo Jacob\" historical marker - National Historical Commission of the Philippines\".",
            "March 7, 2017.",
            "Retrieved March 9, 2017."
        ],
        [
            "^ \"SLEX Toll Road 5 to connect Quezon province to Sorsogon\".",
            "YugaTech.",
            "August 18, 2020.",
            "Retrieved January 9, 2021."
        ],
        [
            "^ \"San Miguel investing P122B for SLEX Toll Road 5, Pasig River Expressway projects\".",
            "GMA News Online.",
            "August 25, 2020.",
            "Retrieved January 9, 2021."
        ],
        [
            "^ https://www.facebook.com/Dwjj979RadyoPolangui"
        ],
        [
            "^ a b \"Bicol University – Polangui Campus – Courses in the Philippines: College, TESDA, Online, Short Courses\"."
        ],
        [
            "^ \"DA Bicol, Albay to beautify streets with ornamental, edible plants | DA Regional Field Office 5\"."
        ],
        [
            "^ a b c \"Gov.",
            "Al Francis C. Bichara on Facebook\".",
            "Facebook.",
            "Archived from the original on April 30, 2022."
        ],
        [
            "^ https://dilg.gov.ph/PDF_File/reports_resources/dilg-reports-resources-20191017_6110403d59.pdf"
        ],
        [
            "^ https://dilg.gov.ph/PDF_File/reports_resources/dilg-reports-resources-2020218_39cfc3ffc9.pdf"
        ],
        [
            "^ \"Official List of 2018 Good Financial Housekeeping Passers.pdf\".",
            "Google Docs."
        ],
        [
            "^ Nor, Mohammad.",
            "\"Official List of 2017 Good Financial Housekeeping as of October 31, 2017\".",
            "mlg.bangsamoro.gov.ph."
        ],
        [
            "^ \"Archived copy\".",
            "Archived from the original on January 10, 2021.",
            "Retrieved January 8, 2021.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ \"Albay leads Bicol in agri performance\".",
            "Philstar.com."
        ],
        [
            "^ \"Salceda honors Gawad Albay sa Edukasyon awardees\" – via PressReader."
        ],
        [
            "^ a b Legislative districts of Albay#3rd District"
        ],
        [
            "^ \"Past Governors of Bicol – Albay\".",
            "June 16, 2008."
        ],
        [
            "^ Joey Salceda"
        ],
        [
            "^ Chief of Staff (Philippines)"
        ],
        [
            "^ https://web.facebook.com/permalink.php?story_fbid=297815181946014&id=100198858374315&__cft__"
        ],
        [
            "External links"
        ],
        [
            " Media related to Polangui at Wikimedia Commons"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Polangui"
        ],
        [
            "Iriga / Buhi, Camarines Sur"
        ],
        [
            "Malinao"
        ],
        [
            "Bato, Camarines Sur"
        ],
        [
            "Polangui"
        ],
        [
            "Tabaco"
        ],
        [
            "Libon"
        ],
        [
            "Oas"
        ],
        [
            "vte Province of AlbayLegazpi (capital and largest city)Municipalities"
        ],
        [
            "Bacacay"
        ],
        [
            "Camalig"
        ],
        [
            "Daraga"
        ],
        [
            "Guinobatan"
        ],
        [
            "Jovellar"
        ],
        [
            "Libon"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Manito"
        ],
        [
            "Oas"
        ],
        [
            "Pio Duran"
        ],
        [
            "Polangui"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Tiwi"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Tabaco"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Polangui&oldid=1220165316\""
        ],
        [
            "Category: Municipalities of AlbayHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listAll articles with dead external linksArticles with dead external links from August 2020Accuracy disputes from March 2022All articles with bare URLs for citationsArticles with bare URLs for citations from March 2022Articles with PDF format bare URLs for citationsCS1 maint: archived copy as titleAccuracy disputes from August 2022Articles with short descriptionShort description is different from WikidataUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Coordinates on WikidataPages using infobox settlement with possible demonym listArticles containing Central Bikol-language textArticles containing Tagalog-language textArticles needing additional references from October 2016All articles needing additional referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}