{
    "name": "Polillo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Polillo, Quezon"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°43′N 121°57′E﻿ / ﻿14.72°N 121.95°E﻿ / 14.72; 121.95"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Quezon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Polillo, Quezon\" – news · newspapers · books · scholar · JSTOR (November 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesPolilloMunicipalityMunicipality of PolilloBeach on Balesin Island"
        ],
        [
            "FlagSealMap of Quezon with Polillo highlightedOpenStreetMapPolilloLocation within the PhilippinesCoordinates: 14°43′N 121°57′E﻿ / ﻿14.72°N 121.95°E﻿ / 14.72; 121.95CountryPhilippinesRegionCalabarzonProvinceQuezonDistrict"
        ],
        [
            "1st districtFoundedMarch 18, 1587Barangays20"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAngelique E. Bosque • Vice MayorLoel F. Santoalla • RepresentativeWilfrido Mark M. Enverga • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ginalyn O. FloresArnold Reagan G. SandovalJoel V. AsisClaro A. MarasiganJudy Rev V. VerzosaHubert Bismarck A. EspirituRainier A. DejorasCipriano A. Susa Jr."
        ],
        [
            " • Electorate20,692 voters (2022)Area • Revenue₱ 158.4 million (2020) • Assets₱ 463.9 million (2020) • Expenditure₱ 122.7 million (2020) • Liabilities₱ 104.4 million (2020)Service provider • ElectricityQuezon 2 Electric Cooperative (QUEZELCO 2)Time zoneUTC+8 (PST)ZIP code4339PSGC045636000IDD : area code +63 (0)42Native languagesTagalogWebsitewww.polilloquezon.com"
        ],
        [
            "Polillo, officially the Municipality of Polillo (Tagalog: Bayan ng Polillo),  is a 3rd class municipality in the province of Quezon, Philippines.",
            "According to the 2020 census, it has a population of 31,908 people."
        ],
        [
            "It is located on the southern part of the eponymous Polillo Island fronting the Philippine Sea and its jurisdiction also includes Balesin Island in Lamon Bay (14°25′30″N 122°02′15″E﻿ / ﻿14.42500°N 122.03750°E﻿ / 14.42500; 122.03750)."
        ],
        [
            "History"
        ],
        [
            "Aerial view of Polillo, 1933"
        ],
        [
            "Trade relations between the natives of the Polillo Islands and Chinese merchants existed long before the Spanish conquerors came to the archipelago.",
            "Trade was a conglomeration of Malay-Hindu-Chinese-Tagalog."
        ],
        [
            "Padre Morga wrote that Polillo originated from the Chinese word \"Pulilu\", which means beautiful island with plenty of food, it was home to native a barangay-state which was also known as Pulilu and recorded as such in Chinese chronicles, it was mentioned as politically connected to the nation of Sandao, itself a vassal state to the nation of Ma-i.",
            "When Juan de Salcedo, a Spanish conqueror came to Polillo in 1567, he saw a central government fully organized through the Balangay, with a datu who had a direct supervision and control over all the natives.",
            "The inhabitants lived in nipa huts."
        ],
        [
            "In 1571 the Spaniards took hold of the islands of Pu Li Lu.",
            "Through the leadership of Padre Domingo, a Spanish friar, a chapel was built, where the old Spanish church was later constructed.",
            "After one and a half years, the people, through forced labor built a concrete wall to protect the \"pueblo\" of Pu Li Lu from moro pirate invaders.",
            "Watchtowers called \"castillos\" were erected in the four corners of the pueblo."
        ],
        [
            "The church was constructed in 1577 .",
            "Boulders, gravel and sand were mixed with lime produced out of seashells and coral stones.",
            "Padre Domingo instigated the planting of sugar cane in San Isidro, San Antonio and San Francisco.",
            "Production of molasses was put into full swing."
        ],
        [
            "Spanish conquistadores were assigned to the \"pueblo\" of Pu Li Lu to promote church construction.",
            "The church tower was constructed with priority, so that in 1587, in the early summer of May, two huge bronze bells rang atop.",
            "Due to language problems, Padre Domingo changed Pu Li Lu to Polillo."
        ],
        [
            "In 1942, the occupied by the Japanese Imperial forces landed in Polillo."
        ],
        [
            "In 1945, the liberation by the Philippine Commonwealth troops of the 5th and 52nd Infantry Division of the Philippine Commonwealth Army landed in Polillo we fought the battles against the Japanese forces in the Battle of Polillo Island during World War II."
        ],
        [
            "On June 18, 1961, the barrios such as Bucal, Casuguran, Gango, and Talisoy on Jomalig Island were separated from Polillo to become a separate municipal district named Jumalig (Jomalig) by virtue of Republic Act No.",
            "3372."
        ],
        [
            "In 1987, three weeks before the April 18 coup attempt against the national government, cadres of the New People's Army attacked the Philippine Constabulary detachment in Polillo Island."
        ],
        [
            "In recent years, government-funded infrastructures were built and private investments in hotel, resorts, services and utilities increased."
        ],
        [
            "On March 26, 2021, two New People's Army (NPA) members surrendered to government forces in Barangay Salipsip."
        ],
        [
            "Geography"
        ],
        [
            "Polillo is located about 29 kilometers (18 mi) off the eastern coast of Luzon.",
            "It is bounded by municipality of Panukulan in the northwest and the municipality of Burdeos in the northeastern side of the island.",
            "Lamon Bay bounds it at the south, east and west.",
            "It is 24 kilometers (15 mi) east of the municipality of Infanta and 27 kilometers (17 mi) east of the municipality of Real.",
            "It can be reached by motorboats more or less three hours via Real-Polillo in the Ungos Port and a little bit shorter via, Infanta-Polillo through Infanta Municipal Fish Port."
        ],
        [
            "Barangays"
        ],
        [
            "Polillo is politically subdivided into 20 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Anawan"
        ],
        [
            "Atulayan"
        ],
        [
            "Balesin"
        ],
        [
            "Bañadero"
        ],
        [
            "Binibitinan"
        ],
        [
            "Bislian"
        ],
        [
            "Bucao"
        ],
        [
            "Canicanian"
        ],
        [
            "Kalubakis"
        ],
        [
            "Languyin"
        ],
        [
            "Libjo"
        ],
        [
            "Pamatdan"
        ],
        [
            "Pilion"
        ],
        [
            "Pinaglubayan"
        ],
        [
            "Poblacion"
        ],
        [
            "Sabang"
        ],
        [
            "Salipsip"
        ],
        [
            "Sibulan"
        ],
        [
            "Taluong"
        ],
        [
            "Tamulaya-Anibong"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Polillo, Quezon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "26(79)"
        ],
        [
            "29(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "40(1.6)"
        ],
        [
            "33(1.3)"
        ],
        [
            "35(1.4)"
        ],
        [
            "38(1.5)"
        ],
        [
            "138(5.4)"
        ],
        [
            "190(7.5)"
        ],
        [
            "242(9.5)"
        ],
        [
            "216(8.5)"
        ],
        [
            "224(8.8)"
        ],
        [
            "200(7.9)"
        ],
        [
            "114(4.5)"
        ],
        [
            "94(3.7)"
        ],
        [
            "1,564(61.6)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.2"
        ],
        [
            "9.0"
        ],
        [
            "11.0"
        ],
        [
            "11.7"
        ],
        [
            "21.5"
        ],
        [
            "24.0"
        ],
        [
            "27.2"
        ],
        [
            "26.1"
        ],
        [
            "26.8"
        ],
        [
            "22.3"
        ],
        [
            "16.3"
        ],
        [
            "15.1"
        ],
        [
            "223.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PolilloYearPop.±% p.a.1903 2,164—    1918 4,245+4.59%1939 8,084+3.11%1948 7,576−0.72%1960 11,978+3.89%1970 16,721+3.39%1975 20,058+3.72%1980 20,565+0.50%1990 23,183+1.21%1995 24,626+1.14%2000 24,105−0.46%2007 27,912+2.04%2010 28,125+0.28%2015 30,582+1.61%2020 31,908+0.84%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Polillo"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  36.50"
        ],
        [
            "2009  26.97"
        ],
        [
            "2012  30.79"
        ],
        [
            "2015  24.54"
        ],
        [
            "2018  10.74"
        ],
        [
            "2021  21.09"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Festivities"
        ],
        [
            "The town of Polillo is celebrating its founding anniversary every March 18 more than 400 years ago.",
            "The celebration last for at least three days.",
            "Starting from March 17, there are different celebrations held in the town proper including the \"Gabi ng Parangal\" (Coronation Night) of the Town's Beauty, Binibining Polillo and all the ladies representing different barangays."
        ],
        [
            "March 18 is the most awaited day of the celebration where a big parade can be seen by all the natives and guest.",
            "The \"Parada\" includes all the schools, non-government organizations, local government units, all the barangay participants and more.",
            "The most awaited groups in the parade are the \"Banda\" - School Bands - from different schools and school levels.",
            "Celebration will continue until night fall with the \"Sayawan\" at the town plaza."
        ],
        [
            "March 19 is the Feast of St. Joseph, the Patron Saint of the town.",
            "The celebration starts from a procession together with all the patron saints of all the sitios and barangays and all devotees of Saint Joseph.",
            "Including all the sitio's and barangay's patron saints in the procession is known as \"dapit\".",
            "Many believes that this celebration of the Feast of Saint Joseph plays big part from the town's safety against nature disaster specially typhoons.",
            "It has something to do with the church history where those saints served as protector along the region.",
            "Devotees of St. Joseph now turns the old \"St. Joseph Parish\" into \"Prelature Shrine of St. Joseph\" as ordered by Infanta Bishop Rolando Tria Tirona in 2010."
        ],
        [
            "Travel"
        ],
        [
            "Getting to Polillo from Manila takes around six hours of travel by land and by sea.",
            "The first segment of the trip involves travelling to Ungos Port in Real, Quezon via the Pililla-Famy-Real Road.",
            "Marikina-Infanta Highway is also another route to Ungos Port.",
            "Raymond Bus, with its terminal located along Legarda Street, Manila, has regular scheduled trips to Real, Quezon."
        ],
        [
            "There are two regular boat trips from Real to Polillo.",
            "The first trip usually leaves at 7:30 AM PHT as the bus passengers coming from Lucena and Manila try to catch it up.",
            "The next boat leaves at 10:00 AM.",
            "The boats are outrigger types powered with a surplus truck engine.",
            "The return trips from Polillo are at 5:00 AM and 1:00 PM.",
            "The trip from Ungos Port to Polillo usually takes three hours."
        ],
        [
            "There are passenger ferries that depart from Dinahican Port in Infanta to Barangay Macnit in Polillo."
        ],
        [
            "There are also boat trips to Balesin Island and Polillo from Atimonan's port."
        ],
        [
            "There are also passenger ferries from Real, Quezon.",
            "These ferries are divided into two categories by the locals: “Roros” and “fastcrafts”"
        ],
        [
            "See also"
        ],
        [
            "Polillo Islands"
        ],
        [
            "References"
        ],
        [
            "^ \"Lenie Portucela\".",
            "Facebook."
        ],
        [
            "^  Municipality of Polillo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on 25 May 2021.",
            "Retrieved 16 July 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Republic Act No.",
            "3372 (18 June 1961), An Act Creating the Municipal District of Jumalig in the Province of Quezon, Supreme Court E-Library, retrieved 17 May 2024"
        ],
        [
            "^ \"The Final Report of the Fact-Finding Commission: IV: Military Intervention in the Philippines: 1986 – 1987 | GOVPH\".",
            "Official Gazette of the Republic of the Philippines.",
            "3 October 1990.",
            "Retrieved 3 March 2023."
        ],
        [
            "^ Jr, Delfin T. Mallari (27 March 2021).",
            "\"5 alleged NPA rebels surrender in Laguna, Rizal, Quezon\".",
            "INQUIRER.net.",
            "Retrieved 3 March 2023."
        ],
        [
            "^ Jr, Delfin T. Mallari (22 February 2022).",
            "\"Alleged NPA slain in Quezon clash\".",
            "INQUIRER.net.",
            "Retrieved 3 March 2023."
        ],
        [
            "^"
        ],
        [
            "\"Polillo: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 27 January 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Quezon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved 28 December 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Tourist Destinations\".",
            "Official Website of Polillo, Quezon.",
            "Archived from the original on 12 October 2011.",
            "Retrieved 20 August 2014."
        ],
        [
            "^ \"Camping in Polillo Island\".",
            "Bahay Campina.",
            "Retrieved 20 August 2014."
        ],
        [
            "External links"
        ],
        [
            "Polillo Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Quezon Province Community and Web Portal"
        ],
        [
            "Places adjacent to Polillo, Quezon"
        ],
        [
            "Panukulan / Burdeos"
        ],
        [
            "Patnanungan"
        ],
        [
            "Infanta / Polillo Strait"
        ],
        [
            "Polillo"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Lamon Bay"
        ],
        [
            "vte Province of QuezonLucena (capital and largest city)Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Alabat"
        ],
        [
            "Atimonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Calauag"
        ],
        [
            "Candelaria"
        ],
        [
            "Catanauan"
        ],
        [
            "Dolores"
        ],
        [
            "General Luna"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Infanta"
        ],
        [
            "Jomalig"
        ],
        [
            "Lopez"
        ],
        [
            "Lucban"
        ],
        [
            "Macalelon"
        ],
        [
            "Mauban"
        ],
        [
            "Mulanay"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagbilao"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Narciso"
        ],
        [
            "Sariaya"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Tiaong"
        ],
        [
            "Unisan"
        ],
        [
            "Component city"
        ],
        [
            "Tayabas"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Lucena (Administratively independent from the province but grouped under Quezon by the Philippine Statistics Authority.",
            "However, qualified voters of this city are still allowed to participate in the election of provincial officials as part of Quezon’s 2nd Sangguniang Panlalawigan district.)"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Polillo,_Quezon&oldid=1224290909\""
        ],
        [
            "Category: Municipalities of QuezonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listUse dmy dates from September 2023Articles with short descriptionShort description is different from WikidataArticles needing additional references from November 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}