{
    "name": "Polomolok",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Polomolok"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 6°13′N 125°04′E﻿ / ﻿6.22°N 125.07°E﻿ / 6.22; 125.07"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in South Cotabato, Philippines"
        ],
        [
            "Municipality in Soccsksargen, PhilippinesPolomolokMunicipalityMunicipality of PolomolokOther transcription(s) • JawiڤولومولوکPolomolok Public Market"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "Agroindustrial Center of South Cotabato"
        ],
        [
            "Land of Pineapple Shore"
        ],
        [
            "Little Brazil of the Philippines"
        ],
        [
            "Motto: Bagong PolomolokMap of South Cotabato with Polomolok highlightedOpenStreetMapPolomolokLocation within the PhilippinesCoordinates: 6°13′N 125°04′E﻿ / ﻿6.22°N 125.07°E﻿ / 6.22; 125.07CountryPhilippinesRegionSoccsksargenProvinceSouth CotabatoDistrict"
        ],
        [
            "1st districtFoundedAugust 21, 1957Inauguration dateSeptember 10, 1957Barangays23"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorBernie D. Palencia • Vice MayorMelchor J. Jutar • RepresentativeIsidro D. Lumayag • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Florence S. Bansuelo-CarlosEliazar G. JoveroLigaya R. OrbesidoCalixto B. SaladaLeo J. CordovaAntonio B. OctavioPaul Jordan P. ReyesJohn Edward L. Lumayag"
        ],
        [
            " • Electorate116,767 voters (2022)Area • Revenue₱ 603.7 million (2020) • Assets₱ 1,847 million (2020) • Expenditure₱ 520.7 million (2020) • Liabilities₱ 550.7 million (2020)Service provider • ElectricitySouth Cotabato 2 Electric Cooperative (SOCOTECO 2) • WaterPolomolok Water District • Wireless TelecommunicationsSmart (with TNT, Sun Cellular), Globe (with TM, GOMO), DITO • Wired TelecommunicationsPLDT, Globe, MarbelTel • Internet Service Providers (ISPs)PLDT, Globe, MarbelTel, Converge, DCTech • Cable TVCignal, SkyCable, GSAT, SatLiteTime zoneUTC+8 (PST)ZIP code9504PSGC126312000IDD : area code +63 (0)83Native languagesHiligaynon Cebuano Maguindanao Blaan TagalogWebsitepolomolok.gov.ph"
        ],
        [
            "Polomolok, officially the Municipality of Polomolok (Hiligaynon: Banwa sang Polomolok; Cebuano: Lungsod sa Polomolok; Tagalog: Bayan ng Polomolok; Maguindanaon: Inged nu Pulumuluk, Jawi: ايڠد نو ڤولومولوک), is a 1st class municipality in the province of South Cotabato, Philippines.",
            "As of May 2020, it has a population of 172,605 people making it the most populated municipality in Mindanao."
        ],
        [
            "It is located between General Santos and Tupi.",
            "Polomolok is seated about 41 kilometres (25 mi) south-east of the provincial capital city of Koronadal, 17 kilometres (11 mi) north of the port city of General Santos and 1,030 kilometres (640 mi) south-east of the national capital Manila.",
            "As of 2019, it is the second wealthiest Municipality in Mindanao with PHP 1.77 Billion worth of assets and in 2021, Polomolok is the 2nd Most Competitive Municipality in Mindanao (9th Nationwide).",
            "Polomolok also serves as the chief town in the 1st District of South Cotabato."
        ],
        [
            "On March 2, 2020, former South Cotabato First District Representative Shirlyn Bañas-Nograles filed House Bill No.",
            "6432 for the conversion of the Municipality of Polomolok into a component city of South Cotabato."
        ],
        [
            "History"
        ],
        [
            "The name Polomolok was derived from the Blaan term flomlok, which means hunting ground.",
            "In the early years, the place where the Poblacion is presently situated was known for its abundance of wild life.",
            "There were no roads and the lowlanders befriended the Blaan highlanders and utilized them as guides.",
            "Aside from a rich hunting ground, Polomolok had so many creeks with free flowing water coming from the hillsides.",
            "Those cold and clear flowing water encouraged foreigners to settle in this place.",
            "One of them was a Japanese trader Zenjiro Takahashi and his Blaan wife.",
            "He began clearing the area and planted agricultural crops.",
            "Not long after, some of the Christians came to settle and started to clear the area."
        ],
        [
            "In 1940, the Philippines Commonwealth government embarked on a very bold program of social amelioration.",
            "One of the projects was the distribution of lands to interested people who wanted to settle in Mindanao.",
            "Settlers were brought by boat to Dadiangas (General Santos) from Luzon and Visayas.",
            "On November 2, 1940, Polomolok was officially opened for settlement and known as Polomok Settlement District.",
            "Atty.",
            "Ernesto Jimenez was appointed as its first overseer.",
            "He was responsible for the allocation of farm lots.",
            "Then came the creation of some barrios of the settlers.",
            "These were Palkan, Lemblisong, Polo, Polomolok Central (now Poblacion), Polomolok Creek (now Magsaysay), Sulit, Lamcaliaf, Kinilis, Glamang, Bentung, Koronadal Proper, Leve, and Silway.",
            "The first settlers, after a crop or two, started to invite their friends and relatives to settle in this place, because the soil was so fertile that any crop can survive due to favorable climate conditions."
        ],
        [
            "The settlement program was interrupted for four years by the Second World War.",
            "Don Francisco Natividad was appointed Military Mayor with Datu Badung Nilong as Vice Mayor and Sgt.",
            "Nuevarez as Chief of Police.",
            "In 1948, Perfecto Balili was designated NLSA Administrator with Rosendo Sarte as Officer-In-Charge.",
            "In 1954, the NLSA was abolished in the course of government reorganization.",
            "All records of NLSA were taken over by the Board of Liquidators.",
            "The Municipality of General Santos (formerly Buayan) was incorporated."
        ],
        [
            "On August 21, 1957, the Municipality of Polomolok was created by virtue of a Presidential Executive Order No.",
            "264 signed by President Carlos P. Garcia.",
            "It started functioning as a regular and independent municipality on September 10, 1957, as a 6th class municipality.",
            "The local officials were appointed by the President.",
            "Its first appointed Mayor was Datu Badong Nilong."
        ],
        [
            "From 1957 to 1963, the progress of this town was still very slow.",
            "Fields have always been green, harvest bountiful but farm products had low market value and circulation of cash was rather slow.",
            "Then came a breakthrough, when the largest pineapple company, the Dole Philippines Inc., was planted and inaugurated on December 7, 1963."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "House Bill No.",
            "6432 was filed by former South Cotabato First District Representative Shirlyn Bañas-Nograles on March 2, 2020 for the conversion of the municipality of Polomolok into a component city in the province of South Cotabato.",
            "However, the Bureau of Local Government Finance (BLGF)’s Average Annual Income (AAI) Certification No.",
            "2021-008 indicates that Polomolok still fell short of the required income thus stalling the proposed conversion.",
            "A municipality needs P100M as its Annual Average Income (AAI) to qualify for the conversion into a city.",
            "Polomolok's AAI was only P76.9 for FY 2018 and 2019.",
            "The bill is currently pending with the committee on local government since March 4, 2020."
        ],
        [
            "Geography"
        ],
        [
            "Located at the southern part of South Cotabato, Polomolok is nestled at the base of the prominent Mount Matutum.",
            "It is cone-shaped volcano and looms over the provinces at 2,286 metres (7,500 ft) high, a unique challenge to mountaineers.",
            "It is perhaps the provinces most imposing landmark."
        ],
        [
            "Natural hot and cold spring abound at its foot.",
            "Natural springs are abundant within this area and provide free flowing water.",
            "Two of these springs have developed into natural resorts."
        ],
        [
            "Barangays"
        ],
        [
            "Polomolok is politically subdivided into 23 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Barangay Poblacion is also known as Polomolok itself.",
            "There are 4 urban barangays and 19 rural barangays."
        ],
        [
            "Political map of Polomolok."
        ],
        [
            "Barangay/s"
        ],
        [
            "Population(2020)"
        ],
        [
            "Classification"
        ],
        [
            "Poblacion (Polomolok)"
        ],
        [
            "51,490"
        ],
        [
            "Urban"
        ],
        [
            "Cannery Site"
        ],
        [
            "23,310"
        ],
        [
            "Urban"
        ],
        [
            "Magsaysay"
        ],
        [
            "13,953"
        ],
        [
            "Urban"
        ],
        [
            "Bentung"
        ],
        [
            "1,532"
        ],
        [
            "Rural"
        ],
        [
            "Crossing Palkan"
        ],
        [
            "2,467"
        ],
        [
            "Rural"
        ],
        [
            "Glamang"
        ],
        [
            "8,404"
        ],
        [
            "Rural"
        ],
        [
            "Kinilis"
        ],
        [
            "2,086"
        ],
        [
            "Rural"
        ],
        [
            "Klinan 6"
        ],
        [
            "4,245"
        ],
        [
            "Rural"
        ],
        [
            "Koronadal Proper"
        ],
        [
            "3,953"
        ],
        [
            "Rural"
        ],
        [
            "Lam Caliaf"
        ],
        [
            "1,718"
        ],
        [
            "Rural"
        ],
        [
            "Landan"
        ],
        [
            "6,829"
        ],
        [
            "Rural"
        ],
        [
            "Lapu"
        ],
        [
            "2,083"
        ],
        [
            "Rural"
        ],
        [
            "Lumakil"
        ],
        [
            "3,796"
        ],
        [
            "Rural"
        ],
        [
            "Maligo"
        ],
        [
            "3,498"
        ],
        [
            "Rural"
        ],
        [
            "Pagalungan"
        ],
        [
            "3,295"
        ],
        [
            "Rural"
        ],
        [
            "Palkan"
        ],
        [
            "3,810"
        ],
        [
            "Rural"
        ],
        [
            "Polo"
        ],
        [
            "2,793"
        ],
        [
            "Rural"
        ],
        [
            "Rubber"
        ],
        [
            "3,648"
        ],
        [
            "Rural"
        ],
        [
            "Silway 7"
        ],
        [
            "2,937"
        ],
        [
            "Rural"
        ],
        [
            "Silway 8"
        ],
        [
            "12,814"
        ],
        [
            "Urban"
        ],
        [
            "Sulit"
        ],
        [
            "5,972"
        ],
        [
            "Rural"
        ],
        [
            "Sumbakil"
        ],
        [
            "1,723"
        ],
        [
            "Rural"
        ],
        [
            "Upper Klinan"
        ],
        [
            "5,096"
        ],
        [
            "Rural"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Polomolok, South Cotabato"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "54(2.1)"
        ],
        [
            "41(1.6)"
        ],
        [
            "56(2.2)"
        ],
        [
            "81(3.2)"
        ],
        [
            "154(6.1)"
        ],
        [
            "212(8.3)"
        ],
        [
            "223(8.8)"
        ],
        [
            "218(8.6)"
        ],
        [
            "192(7.6)"
        ],
        [
            "184(7.2)"
        ],
        [
            "135(5.3)"
        ],
        [
            "73(2.9)"
        ],
        [
            "1,623(63.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.4"
        ],
        [
            "9.1"
        ],
        [
            "11.2"
        ],
        [
            "14.4"
        ],
        [
            "24.6"
        ],
        [
            "27.0"
        ],
        [
            "26.7"
        ],
        [
            "26.1"
        ],
        [
            "25.6"
        ],
        [
            "26.9"
        ],
        [
            "22.6"
        ],
        [
            "15.1"
        ],
        [
            "239.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Polomolok features a tropical rainforest climate (Af), according to the Köppen-Geiger climate classification, with significant rainfall year-round and constantly hot temperatures.",
            "Since this tropical rainforest climate is more subject to the Intertropical Convergence Zone than the trade winds and experiences very few cyclones, it is subequatorial.",
            "The city experiences considerable rainfall during the year, even during the driest month.",
            "The average annual temperature is 25.7 °C in Polomolok.",
            "In a year, the average rainfall is 1410 mm.",
            "March is the driest month, and June is the wettest month in the city."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PolomolokYearPop.±% p.a.1960 15,536—    1970 32,570+7.67%1975 40,544+4.49%1980 59,312+7.90%1990 89,372+4.19%1995 96,274+1.40%2000 110,709+3.04%2007 131,436+2.40%2010 138,273+1.86%2015 152,589+1.89%2020 172,605+2.45%Source: Philippine Statistics Authority"
        ],
        [
            "Polomolok has a population of 172,605 people as per census data of 2020, thus making it the most populated municipality (next to Koronadal City) in the province."
        ],
        [
            "Based on its latest population, it is the most populous municipality in Mindanao, the largest municipality in the Soccsksargen Region and 12th most populous municipality"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Polomolok"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  21.20"
        ],
        [
            "2009  22.80"
        ],
        [
            "2012  22.83"
        ],
        [
            "2015  24.60"
        ],
        [
            "2018  15.00"
        ],
        [
            "2021  14.49"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The Municipality of Polomolok prides its successful implementation of its Revenue Generation Program as an exemplary practice.",
            "The purpose of the program is to increase local revenues from collection of real property taxes and other fees and charges; update Municipal Tax Ordinance; Conduct Business Tax Mapping; and system automation.",
            "Rank 2nd on the rich municipalities and cities in Mindanao with less percentage of poverty incidence."
        ],
        [
            "Income classification"
        ],
        [
            "As of 2019, Polomolok has a total assets of PhP 1,773,573,000 and a total revenue of PhP 577,267,000 as certified by the Commission on Audit.",
            "It is a 1st class municipality."
        ],
        [
            "Polomolok is considered as the wealthiest and richest municipality in South Cotabato and the second richest municipality in Mindanao.",
            "Also, the town is the 2nd Most Competitive Municipality in Mindanao for the year 2020."
        ],
        [
            "Agriculture"
        ],
        [
            "Pineapple harvesting near Dole Station 3 at barangay Palkan"
        ],
        [
            "It is splendidly gifted with pineapple products and processing, livestock resources (cattle, swine production, meat packaging) furniture, asparagus and cut flowers, cotton ginnery, corn, vegetable and fruits."
        ],
        [
            "Dole Philippines Incorporated is the largest industrial firm involved in growing, processing and exporting of fresh and canned pineapple.",
            "As of 2004, the area planted to pineapple is 15,507.872 hectares with an average production volume of 31.94 metric tons per hectare.",
            "This industry, which is situated at Barangay Cannery Site, generates about 6,000 jobs at present.",
            "It is considered as the biggest taxpayer in the municipality."
        ],
        [
            "Corn is the second most grown crop in the municipality.",
            "Data from the Agriculture Office revealed that for the year 2003 there are 3,931 hectares or 13.46% of the total cultivated land agricultural lands were devoted to corn.",
            "About 1,236 hectares of which are planted to traditional corn seeds at average production of 3.20 MT/hectare and 2,695 hectares are planted to hybrid corn at average production of 4.0 MT/ hectare.",
            "The major producers are Barangay Klinan 6, Glamang, Landan, Silway 8 and Upper Klinan.",
            "About 30% of populace adopt corn as their staple food."
        ],
        [
            "Rice is also one of the major crops.",
            "99% of the total population has rice as their staple food.",
            "Office of the Agriculturist reported that for the year 2006, 445 hectares were utilized for rice production, of which only 300 hectares are irrigated, 45 are lowland, and 100 are upland.",
            "Irrigated areas are planted 2.5 time a year while rainfed and upland are planted only once.",
            "\"Gintoang Masaganang Ani Program\" Program targets for the average production of rice at about 4.5 MT, for irrigated, 3 MT for lowland and 1.5 MT for upland.",
            "This target was met by the farmers this year because of rice diseases and pest infestation."
        ],
        [
            "The record of the Department of Agriculture shows that as of 2006, the total area planted with asparagus is 1,435.52 hectares.",
            "Plantations of this crop are in Barangay Sulit, Sumbakil, Crossing Palkan, Bentung, Lapu, Pagalungan, Lumakil, Rubber and Magsaysay.",
            "Farmer growers have access to the export market due to contract agreement with Marsman-Drysdale Agri-Ventures and Tropifresh.",
            "The surplus are sold in the local market and diversifically used as supplements for cattle fattening."
        ],
        [
            "Pineapple fields at Polomolok"
        ],
        [
            "Vegetables grow well in Barangay Palkan, Kinilis, Maligo, Sumbakil and Koronadal Proper where the climate is cool and the soil is fertile.",
            "However, the farmers cannot really produce in large volume due to financial constraints and unstable prevailing market prices of vegetables."
        ],
        [
            "Livestock and poultry production has increased tremendously in the past years.",
            "This is partly due to the municipality's climate and terrain which is ideal for livestock and poultry production.",
            "The land area devoted for agri-livestock production is 80 hectares or 0.27 percent of the total agricultural land."
        ],
        [
            "For the year 2006, the Office of the Municipal Agriculturist reported that there are 322,628 heads of livestocks and poultry raised in the municipality.",
            "Poultry has the most number of heads at 271,420 where 3,639 are layers, 17,852 are backyard, and 249,929 are commercial under contract growers scheme with different Agri-business firms such as RFM, Vitarich, and Swift followed by swine with 23,719 heads which 10,970 are backyard and a total of 15,113 are raised commercially, and cattle with 24,491 heads where 2,065 are backyard and a total of 22,426 heads fattened in the cattle farms of Montery and DEALCO."
        ],
        [
            "Supply of livestock in the municipality is insufficient due to shipment of livestock which are raised commercially to other parts of the country leaving the backyard raisers to support the local market.",
            "The municipality still depend on supplies coming from other areas in the province."
        ],
        [
            "Civet beans-defecated poops"
        ],
        [
            "Wild civet coffee production improves the livelihood of the Blaan people who live at the foot of Mount Matutum Protected Landscape.",
            "The tribe scours, for half a century its forest slopes to collect the nocturnal revered Paradoxurus, \"Philippine palm civet\"'s defecated poops.",
            "The people's conservation promotes their livelihood from the prized wild civet coffee, called \"balos\" where a cup costs $80 in United States markets.",
            "Sitio 8 village, Barangay Kinilis, Polomolok is famous as a civet coffee-producing settlement."
        ],
        [
            "Healthcare"
        ],
        [
            "Among the notable hospitals in Polomolok are:"
        ],
        [
            "Polomolok General Hospital (PGH)"
        ],
        [
            "Howard Hubbard Memorial Hospital (HHMH)"
        ],
        [
            "Heramil Hospital"
        ],
        [
            "Bontuyan Medical Hospital (BMHI)"
        ],
        [
            "Polomolok Municipal Hospital (PMH)"
        ],
        [
            "Polomolok General Hospital (PGH) is owned and managed by the Municipal Government of Polomolok and is not related in any way to Polomolok Municipal Hospital (PMH) which is owned and managed by the Provincial Government of South Cotabato."
        ],
        [
            "Radio Station"
        ],
        [
            "Polomolok is now the emerging broadcast hub for South Cotabato as there are radio stations established in the town, reaching as far as Sarangani Province and Cotabato Province.",
            "Among those are the following:"
        ],
        [
            "88.3 Radyo ng Masa Polomolok"
        ],
        [
            "99.5 Bondingan FM Polomolok (Polomolok's first radio station)"
        ],
        [
            "100.7 D' Wonder Feel FM Polomolok (IPHILMA Community Radio)"
        ],
        [
            "Education"
        ],
        [
            "Institutions with High School and Senior High School"
        ],
        [
            "Dole Philippines School"
        ],
        [
            "Polomolok National High School"
        ],
        [
            "Poblacion Polomolok National High School"
        ],
        [
            "San Lorenzo Ruiz Academy"
        ],
        [
            "Institutions with Vocational and College Programs"
        ],
        [
            "Notre Dame — Siena College of Polomolok"
        ],
        [
            "General Santos Academy"
        ],
        [
            "BEST College of Polomolok"
        ],
        [
            "Schola De San Jose"
        ],
        [
            "Philippine Millennium Colleges"
        ],
        [
            "St. Therese Blue Collar Institute"
        ],
        [
            "Notre Dame of Dadiangas University - Glamang Campus"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Polomolok |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Most Competitive Municipality in Mindanao\".",
            "Cities and Municipalities Competitive Index."
        ],
        [
            "^ \"House Bill No.",
            "6432, 18th Congress of the Republic AN ACT CONVERTING THE MUNICIPALITY OF POLOMOLOK IN THE PROVINCE OF SOUTH COTABATO INTO A COMPONENT CITY TO BE KNOWN AS THE CITY OF POLOMOLOK\".",
            "Senate of the Philippines Legislative Digital Resources.",
            "Retrieved 2020-04-20."
        ],
        [
            "^ Nograles, Shirlyn.",
            "\"AN ACT CONVERTING THE MUNICIPALITY OF POLOMOLOK IN THE PROVINCE OF SOUTH COTABATO INTO A COMPONENT CITY TO BE KNOWN AS THE CITY OF POLOMOLOK\" (PDF).",
            "House of Representatives.",
            "Archived (PDF) from the original on April 20, 2021.",
            "Retrieved April 20, 2021."
        ],
        [
            "^"
        ],
        [
            "\"Polomonok: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 23 May 2020."
        ],
        [
            "^ \"Polomolok, South Cotabato\".",
            "www.accuweather.com.",
            "Archived from the original on 2013-11-12.",
            "Retrieved 2014-10-22."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XII (Soccsksargen)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XII (Soccsksargen)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of South Cotabato\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ Philippine Statistics Authority 2020 Census: Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities Archived 2012-07-07 at archive.today"
        ],
        [
            "^ List of Philippine cities and municipalities by population"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Kidapawan is Mindanao's richest city\".",
            "Department of Trade and Industry.",
            "Archived from the original on 2012-03-24.",
            "Retrieved 2021-01-16."
        ],
        [
            "^ Sarmiento, Bong (18 April 2023).",
            "\"Philippine tribe boosts livelihoods and conservation with civet poop coffee\".",
            "Mongabay.",
            "Retrieved May 20, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Polomolok."
        ],
        [
            "Polomolok Profile at PhilAtlas.com"
        ],
        [
            "Polomolok Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Polomolok"
        ],
        [
            "Tupi"
        ],
        [
            "Malungon, Sarangani"
        ],
        [
            "Polomolok"
        ],
        [
            "General Santos"
        ],
        [
            "T'Boli"
        ],
        [
            "General Santos"
        ],
        [
            "Articles Related to Polomolok, South Cotabato"
        ],
        [
            "vte Province of South CotabatoKoronadal (capital)  General Santos (largest city)Municipalities"
        ],
        [
            "Banga"
        ],
        [
            "Lake Sebu"
        ],
        [
            "Norala"
        ],
        [
            "Polomolok"
        ],
        [
            "Santo Niño"
        ],
        [
            "Surallah"
        ],
        [
            "Tampakan"
        ],
        [
            "Tantangan"
        ],
        [
            "T'Boli"
        ],
        [
            "Tupi"
        ],
        [
            "Component City"
        ],
        [
            "Koronadal"
        ],
        [
            "Highly Urbanized City"
        ],
        [
            "General Santos (Administratively independent from the province but grouped under South Cotabato by the Philippine Statistics Authority.)"
        ],
        [
            "vteSoccsksargen (Region XII)SOuth Cotabato, Cotabato, Sultan Kudarat, SARangani, GENeral SantosRegional center"
        ],
        [
            "Koronadal"
        ],
        [
            "Provinces"
        ],
        [
            "Cotabato"
        ],
        [
            "Sarangani"
        ],
        [
            "South Cotabato"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "General Santos"
        ],
        [
            "Component cities"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "Tacurong"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Alabel"
        ],
        [
            "Isulan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "Component Municipalities"
        ],
        [
            "Alabel"
        ],
        [
            "Alamada"
        ],
        [
            "Aleosan"
        ],
        [
            "Antipas"
        ],
        [
            "Arakan"
        ],
        [
            "Bagumbayan"
        ],
        [
            "Banga"
        ],
        [
            "Banisilan"
        ],
        [
            "Carmen"
        ],
        [
            "Columbio"
        ],
        [
            "Esperanza"
        ],
        [
            "Glan"
        ],
        [
            "Isulan"
        ],
        [
            "Kabacan"
        ],
        [
            "Kalamansig"
        ],
        [
            "Kiamba"
        ],
        [
            "Lake Sebu"
        ],
        [
            "Lambayong"
        ],
        [
            "Lebak"
        ],
        [
            "Libungan"
        ],
        [
            "Lutayan"
        ],
        [
            "M'lang"
        ],
        [
            "Maasim"
        ],
        [
            "Magpet"
        ],
        [
            "Maitum"
        ],
        [
            "Makilala"
        ],
        [
            "Malapatan"
        ],
        [
            "Malungon"
        ],
        [
            "Matalam"
        ],
        [
            "Midsayap"
        ],
        [
            "Norala"
        ],
        [
            "Palimbang"
        ],
        [
            "Pigcawayan"
        ],
        [
            "Pikit"
        ],
        [
            "Polomolok"
        ],
        [
            "President Quirino"
        ],
        [
            "President Roxas"
        ],
        [
            "Santo Niño"
        ],
        [
            "Senator Ninoy Aquino"
        ],
        [
            "Surallah"
        ],
        [
            "T'boli"
        ],
        [
            "Tampakan"
        ],
        [
            "Tantangan"
        ],
        [
            "Tulunan"
        ],
        [
            "Tupi"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vteLargest cities and municipalities in MindanaoPSA Census May 2020"
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            "Pop."
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            "Pop."
        ],
        [
            "Davao CityZamboanga City"
        ],
        [
            "1"
        ],
        [
            "Davao City"
        ],
        [
            "Davao Region"
        ],
        [
            "1,776,949"
        ],
        [
            "11"
        ],
        [
            "Panabo"
        ],
        [
            "Davao Region"
        ],
        [
            "209,230"
        ],
        [
            "Cagayan de OroGeneral Santos"
        ],
        [
            "2"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Zamboanga Peninsula"
        ],
        [
            "977,234"
        ],
        [
            "12"
        ],
        [
            "Marawi"
        ],
        [
            "Bangsamoro"
        ],
        [
            "207,010"
        ],
        [
            "3"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "728,402"
        ],
        [
            "13"
        ],
        [
            "Koronadal"
        ],
        [
            "Soccsksargen"
        ],
        [
            "195,398"
        ],
        [
            "4"
        ],
        [
            "General Santos"
        ],
        [
            "Soccsksargen"
        ],
        [
            "697,315"
        ],
        [
            "14"
        ],
        [
            "Malaybalay"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "190,712"
        ],
        [
            "5"
        ],
        [
            "Butuan"
        ],
        [
            "Caraga Region"
        ],
        [
            "372,910"
        ],
        [
            "15"
        ],
        [
            "Digos"
        ],
        [
            "Davao Region"
        ],
        [
            "188,376"
        ],
        [
            "6"
        ],
        [
            "Iligan"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "363,115"
        ],
        [
            "16"
        ],
        [
            "Polomolok"
        ],
        [
            "Soccsksargen"
        ],
        [
            "172,605"
        ],
        [
            "7"
        ],
        [
            "Cotabato City"
        ],
        [
            "Bangsamoro"
        ],
        [
            "325,079"
        ],
        [
            "17"
        ],
        [
            "Surigao City"
        ],
        [
            "Caraga Region"
        ],
        [
            "171,107"
        ],
        [
            "8"
        ],
        [
            "Tagum"
        ],
        [
            "Davao Region"
        ],
        [
            "296,202"
        ],
        [
            "18"
        ],
        [
            "Kidapawan"
        ],
        [
            "Soccsksargen"
        ],
        [
            "160,791"
        ],
        [
            "9"
        ],
        [
            "Valencia"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "216,546"
        ],
        [
            "19"
        ],
        [
            "Mati"
        ],
        [
            "Davao Region"
        ],
        [
            "147,547"
        ],
        [
            "10"
        ],
        [
            "Pagadian"
        ],
        [
            "Zamboanga Peninsula"
        ],
        [
            "210,452"
        ],
        [
            "20"
        ],
        [
            "Ozamiz"
        ],
        [
            "Northern Mindanao"
        ],
        [
            "140,334"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Polomolok&oldid=1232113600\""
        ],
        [
            "Categories: Municipalities of South CotabatoPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listWebarchive template archiveis linksArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Cebuano-language textArticles containing Tagalog-language textArticles containing Maguindanaon-language textAll articles with unsourced statementsArticles with unsourced statements from October 2023Commons category link is on WikidataPages using largest cities with nav classPages using the Kartographer extension"
        ]
    ]
}