{
    "name": "Pugo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pugo, La Union"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°17′N 120°29′E﻿ / ﻿16.28°N 120.48°E﻿ / 16.28; 120.48"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in La Union, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Pugo, La Union\" – news · newspapers · books · scholar · JSTOR (August 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesPugoMunicipalityMunicipality of PugoOverlooking Pugo town center and welcome arch from the National Highway"
        ],
        [
            "FlagSealMap of La Union with Pugo highlightedOpenStreetMapPugoLocation within the PhilippinesCoordinates: 16°17′N 120°29′E﻿ / ﻿16.28°N 120.48°E﻿ / 16.28; 120.48CountryPhilippinesRegionIlocos RegionProvinceLa UnionDistrict"
        ],
        [
            "2nd districtFounded1912Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPriscilla M. Martin • Vice MayorJose B. Basallo • RepresentativeSandra Y. Eriguel • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Mixico V. DulayMichelle R. Boadilla-LalesWinston C. BoadoRex A. FernandezJuvenal R. BasalloBryan T. BalloguingArmand H. MalamionRogelio E. Labayo"
        ],
        [
            " • Electorate12,786 voters (2022)Area • Revenue₱ 110.2 million (2020) • Assets₱ 449.1 million (2020) • Expenditure₱ 74.32 million (2020) • Liabilities₱ 56.23 million (2020)Service provider • ElectricityLa Union Electric Cooperative (LUELCO)Time zoneUTC+8 (PST)ZIP code2508PSGC013312000IDD : area code +63 (0)72Native languagesIlocano Pangasinan TagalogWebsitewww.pugo.gov.ph"
        ],
        [
            "Pugo ("
        ],
        [
            "Pugo is located at the foot of the Santo Tomas mountain range, just 36 kilometres (22 mi) west from Baguio via the Marcos Highway.",
            "Pugo is 16 kilometres (9.9 mi) from Agoo, 50 kilometres (31 mi) from the provincial capital San Fernando, and 251 kilometres (156 mi) from Manila.",
            "It is primarily an agricultural town."
        ],
        [
            "History"
        ],
        [
            "The name of Pugo has its origin from Pangasinan, a language used in Pangasinan, a province south of La Union.",
            "Pugo as well as other parts of southern La Union was once part of the ethno-linguistic territory of Pangasinan-speaking people prior to political subdivision during the Spanish regime.",
            "Now, only a minority speaks Pangasinan in La Union mainly in the towns of Rosario and Santo Tomas.",
            "The term \"Pugo\" means \"islet\"; while Pugo itself is not an island, the term describes the huge rock beds in the Tapuacan River.",
            "The river also features rock walls and huge rocks which are now known as the Tapuakan Resort in Barangay Cares."
        ],
        [
            "By virtue of Executive Order No.",
            "72 signed by President Manuel Roxas on July 30, 1947, the municipal district of Pugo, along with Sudipen and San Gabriel, was organized into a regular municipality.",
            "As a result, the fourteen municipalities of La Union, all established under the Revised Administrative Code, were increased to seventeen."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Pugo is politically subdivided into 14"
        ],
        [
            "barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Ambalite"
        ],
        [
            "Ambangonan"
        ],
        [
            "Cares"
        ],
        [
            "Cuenca"
        ],
        [
            "Duplas"
        ],
        [
            "Maoasoas Norte"
        ],
        [
            "Maoasoas Sur"
        ],
        [
            "Palina"
        ],
        [
            "Poblacion East"
        ],
        [
            "San Luis"
        ],
        [
            "Saytan"
        ],
        [
            "Tavora East"
        ],
        [
            "Tavora Proper"
        ],
        [
            "Poblacion West"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Pugo, La Union"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "15(0.6)"
        ],
        [
            "16(0.6)"
        ],
        [
            "24(0.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "102(4.0)"
        ],
        [
            "121(4.8)"
        ],
        [
            "177(7.0)"
        ],
        [
            "165(6.5)"
        ],
        [
            "144(5.7)"
        ],
        [
            "170(6.7)"
        ],
        [
            "56(2.2)"
        ],
        [
            "23(0.9)"
        ],
        [
            "1,046(41.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "6.3"
        ],
        [
            "6.6"
        ],
        [
            "9.5"
        ],
        [
            "12.8"
        ],
        [
            "20.6"
        ],
        [
            "23.5"
        ],
        [
            "25.4"
        ],
        [
            "23.4"
        ],
        [
            "23.2"
        ],
        [
            "21.4"
        ],
        [
            "14.0"
        ],
        [
            "8.2"
        ],
        [
            "194.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PugoYearPop.±% p.a.1918 2,545—    1939 4,733+3.00%1948 3,952−1.98%1960 5,484+2.77%1970 6,483+1.69%1975 7,180+2.07%1980 7,780+1.62%1990 10,939+3.47%1995 12,180+2.03%2000 13,442+2.14%2007 18,265+4.32%2010 16,518−3.59%2015 19,690+3.40%2020 19,337−0.36%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Pugo, La Union, was 19,337 people, with a density of 310 inhabitants per square kilometre or 800 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Pugo"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  27.60"
        ],
        [
            "2009  27.38"
        ],
        [
            "2012  7.54"
        ],
        [
            "2015  5.83"
        ],
        [
            "2018  3.16"
        ],
        [
            "2021  10.03"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Just as the national government, the municipal government of Pugo is divided into three branches: executive, legislative, and judiciary.",
            "The judicial branch is administered solely by the Supreme Court of the Philippines.",
            "The LGUs have control of the executive and legislative branches."
        ],
        [
            "The executive branch is composed of the mayor and the barangay captain for the barangays.Local Government Code of the Philippines, Book III, Department of the Interior and Local Government official website."
        ],
        [
            "The legislative branch is composed of the Sangguniang Bayan (town assembly), Sangguniang Barangay (barangay council), and the Sangguniang Kabataan for the youth sector."
        ],
        [
            "The seat of Government is vested upon the Mayor and other elected officers who hold office at the Pugo Town Hall.",
            "The Sangguniang Bayan is the center of legislation, stationed in Pugo Legislative Building."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Sandra Y. Eriguel"
        ],
        [
            "Mayor"
        ],
        [
            "Priscilla M. Martin"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Jose B. Basallo"
        ],
        [
            "Councilors"
        ],
        [
            "Mixico V. Dulay"
        ],
        [
            "Michelle R. Boadilla-Lales"
        ],
        [
            "Winston C. Boado"
        ],
        [
            "Rex A. Fernandez"
        ],
        [
            "Juvenal R. Basallo"
        ],
        [
            "Bryan T. Balloguing"
        ],
        [
            "Armand H. Malamion"
        ],
        [
            "Rogelio E. Labayo"
        ],
        [
            "Tourism"
        ],
        [
            "Tapuakan River"
        ],
        [
            "Kultura Splash Wave"
        ],
        [
            "Holy Family Parish Church"
        ],
        [
            "Nature and Man Made Adventure"
        ],
        [
            "With the opening of the PUGAD Pugo Adventure Park in Sitio Kagaling of Barangay Palina, the town now offers extreme adventure.",
            "It offers 3 Zip Lines with its famous 380 meters long 200 feet high Super Man Zip Line 1.",
            "It also has Swimming Pools, Cottages, Conference Halls, Hanging Bridge, Clean River, Rappeling Area, Wall Climbing, Ropping, ATV Rides, Paint Ball Area, Trekking, and view of the Water Falls."
        ],
        [
            "10 minutes away from Pugad Pugo Adventure is the \"Travellers Inn\".",
            "It offers villas, rooms, and even water adventure parks."
        ],
        [
            "Scenic spots in Pugo include Tapuakan Resort, the Nagbukel, and the hot springs of Cares.",
            "Tapuakan Resort features rest areas where the people can enjoy the natural slides of the river.",
            "It was recently awarded as the clearest inland body of water for 2008 making it for 2 consecutive years.",
            "It also has a hot spring where tourists and the Pugonians go often as they believe that the spring can heal certain skin and pulmonary diseases.",
            "Nagbukel is found at Barangay Ambangonan, and many people also go there despite its remote location."
        ],
        [
            "PUGAD"
        ],
        [
            "PUGAD (bird's nest) is one of the recreation and adventure landmarks in Pugo.",
            "It is a picturesque site with 3 hectares of green forests, lush mountains, and a clean river.",
            "It is 300 meters away from Marcos Highway."
        ],
        [
            "Zip Line Adventure - Pugo's Pugad has the longest zip line (380 meters) in Luzon, the second in the Philippines."
        ],
        [
            "Tapuacan River"
        ],
        [
            "Tapuacan River (also known as Pugo - Cleanest Inland River of the North, Region I) is located in Barangay Cares (the smallest/inlet town which is situated at the foot of the Santo Tomas mountains range and about an hour away from Baguio passing through the Aspiras, formerly Marcos Highway leading to the Ilocandia Region).",
            "The natural scenery is also a 1-hour ride from San Fernando City and around 4–5 hours drive from Manila."
        ],
        [
            "Kultura Splash Wave"
        ],
        [
            "Pugo's Kultura Splash Wave is a prime resort (Km.",
            "21 Marcos Highway, Barangay Cares).",
            "It has attractions: Lap pool, Pool Kiddie, Dolphin pools, 4 Giant Slides with Dropzone, Water Factory, Aerial Zip Lines, Wall Climbing, Sky Walker."
        ],
        [
            "Marcos bust"
        ],
        [
            "A 30 m (98 ft) concrete Bust of Ferdinand Marcos built from 1978 to 1980 using government funds.",
            "The monument was controversial as the land used were grabbed from the indigenous Ibaloi people, who were against the Marcos conjugal dictatorship.",
            "The monument was built upon the orders of then incumbent President Ferdinand Marcos in a park that he named after himself.",
            "The park's land was also land-grabbed from the Ibaloi people.",
            "The monument was destroyed in December 2002 by treasure hunters."
        ],
        [
            "Holy Family Parish Church"
        ],
        [
            "As of 2012, the 1909 Holy Family Parish Church of Pugo (canonically erected in 1909), celebrates its fiesta every Last Sunday of December.",
            "It is under the jurisdiction of the Roman Catholic Diocese of San Fernando de La Union (Dioecesis Ferdinandopolitana ab Unione, Suffragan of Lingayen – Dagupan, which was created on January 19, 1970, and erected on April 11, 1970, comprising the Civil Province of La Union, under the Titular, St. William the Hermit, February 10).",
            "The heritage church is under a diocese of the Latin Church of the Roman Catholic Church in the Philippines from the Archdiocese of Nueva Segovia.",
            "Its Parish Priest is Fr.",
            "Crispin N. Reyes."
        ],
        [
            "The Pugo Church is under the Vicariate of St. Francis Xavier with Vicar Forane, Fr.",
            "Joel Angelo Licos.",
            "The Holy Family Parish was built in the year 1909-1911 by the Belgian Missionary for the people of Pugo, La Union."
        ],
        [
            "Gallery"
        ],
        [
            "Town center and welcome arch"
        ],
        [
            "Municipal hall"
        ],
        [
            "Town plaza"
        ],
        [
            "Pugo rural landscape"
        ],
        [
            " Panorama of the Crossing and Welcome arch"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Pugo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "72, s. 1947\".",
            "Official Gazette (Philippines).",
            "Government of the Philippines.",
            "July 30, 1947.",
            "Retrieved March 20, 2023."
        ],
        [
            "^"
        ],
        [
            "\"Province: La Union\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Pugo: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of La Union\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 6, 2022."
        ],
        [
            "^ \"PUGAD: A nest of recreation and adventure in Pugo La Union\".",
            "Tarabitab.",
            "2 October 2010.",
            "Archived from the original on 26 June 2012.",
            "Retrieved 28 September 2014."
        ],
        [
            "^ \"Home\".",
            "kulturasplashwave.com."
        ],
        [
            "^ Dumlao, Artemio (2002-12-30).",
            "\"Marcos bust blasted\".",
            "The Philippine Star.",
            "Retrieved 2019-02-05."
        ],
        [
            "^ \"Archbishop decries Marcos bust bombing, Communists take credit\".",
            "UCA News.",
            "31 December 2002.",
            "Retrieved 27 February 2015."
        ],
        [
            "^ \"Holy Family Parish Church - Pugo\"."
        ],
        [
            "^ \"Claretian Communications Foundation, Inc\"."
        ],
        [
            "^ Catholic-Hierarchy"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Pugo, La Union."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Pugo, La Union"
        ],
        [
            "Tubao"
        ],
        [
            "TubaoRosario"
        ],
        [
            "Pugo"
        ],
        [
            "Tuba, Benguet"
        ],
        [
            "Rosario"
        ],
        [
            "vteProvince of La UnionSan Fernando (capital and largest city)Municipalities"
        ],
        [
            "Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Bacnotan"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Bangar"
        ],
        [
            "Bauang"
        ],
        [
            "Burgos"
        ],
        [
            "Caba"
        ],
        [
            "Luna"
        ],
        [
            "Naguilian"
        ],
        [
            "Pugo"
        ],
        [
            "Rosario"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santol"
        ],
        [
            "Sudipen"
        ],
        [
            "Tubao"
        ],
        [
            "Component city"
        ],
        [
            "San Fernando"
        ],
        [
            "BarangaysSee: List of barangays in La Union"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pugo,_La_Union&oldid=1218687836\""
        ],
        [
            "Category: Municipalities of La UnionHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from August 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Tagalog IPAArticles containing Ilocano-language textArticles containing Filipino-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}