{
    "name": "Pulilan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pulilan"
        ],
        [
            "24 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSimple EnglishSvenskaTagalogاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°54′07″N 120°50′56″E﻿ / ﻿14.902°N 120.849°E﻿ / 14.902; 120.849"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bulacan, Philippines"
        ],
        [
            "Not to be confused with Pullulan."
        ],
        [
            "Municipality in Central Luzon, PhilippinesPulilanMunicipalityMunicipality of Pulilan"
        ],
        [
            "From top, left to right: Skyline of Pulilan from Barangay Paltao; Pulilan Municipal Hall; San Isidro Labrador Parish Church; kneeling carabaos and church decorations at the annual Carabao festival"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "Pulo ng Ilan"
        ],
        [
            "Center of Commerce and Industry in Northern Bulacan"
        ],
        [
            "Home of the Kneeling Carabao Festival"
        ],
        [
            "Motto: Celebrate Pulilan Power!Anthem: Ako ang PulileñoEnglish: (I am a Pulileño)Map of Bulacan with Pulilan highlightedOpenStreetMapPulilanLocation within the PhilippinesCoordinates: 14°54′07″N 120°50′56″E﻿ / ﻿14.902°N 120.849°E﻿ / 14.902; 120.849CountryPhilippinesRegionCentral LuzonProvinceBulacanDistrict"
        ],
        [
            "1st districtFoundedJanuary 20, 1796Barangays19"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMaria Rosario O. Montejo • Vice MayorRolando S. Peralta Jr. • RepresentativeDanilo A. Domingo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Gilbert S. MunozZandro C. HipolitoPeter John T. DionisioFrancisco D. Cruz Jr.Rodolfo E. ArceoRolando G. PayumoJohn J. NethercottReynaldo J. Clemente Jr."
        ],
        [
            " • Electorate66,128 voters (2022)Area • Revenue₱ 498.5 million (2020) • Assets₱ 656.8 million (2020) • Expenditure₱ 505.5 million (2020) • Liabilities₱ 153.1 million (2020)Utilities • ElectricityMeralcoTime zoneUTC+8 (PST)ZIP code3005PSGC031418000IDD : area code +63 (0)44Native languagesTagalog KapampanganWebsitewww.pulilan.gov.ph"
        ],
        [
            "Pulilan, officially the Municipality of Pulilan (Tagalog: Bayan ng Pulilan), is a 1st class municipality in the province of Bulacan, Philippines.",
            "According to the 2020 census, it has a population of 108,836 people."
        ],
        [
            "The town is famous for its Carabao Festival where carabaos are paraded and kneel as they pass through San Isidro Labrador Parish Church, in honor to the town's patron saint, San Isidro Labrador."
        ],
        [
            "Many years ago, Pulilan was primarily a little-known rural town in the northern part of Bulacan where its economy heavily dependent on farming and poultry raising.",
            "Most of the population committed their entire lives on farming as their livelihood.",
            "Today, the town is moving towards commercialization and industrialization as it is becoming one of the major growth-rate area and center of commerce and industry in the province."
        ],
        [
            "Because of the major economic growth, due to presence of commercial establishments, real estates, industrial plants and major road projects.",
            "Pulilan has experienced increased in the total gross income in the past few years.",
            "The town's income in year 2016 was P323.86 million, an increase of P69.27 million from its previous income in 2014.",
            "It surpass the income of fifteen municipalities in"
        ],
        [
            "Bulacan such as San Miguel, Bocaue, Plaridel, Hagonoy and Calumpit."
        ],
        [
            "With the continuous expansion of Metro Manila, Pulilan is part of Manila's built-up area which reaches San Ildefonso, Bulacan at its northernmost part."
        ],
        [
            "Etymology"
        ],
        [
            "In the beginning, Pulilan is neither its name nor a town.",
            "History has it that the place is a marshy or swampland which forms part of Pampanga, along the Candaba Bay.",
            "Because of the vastness of its area, Pulilan was created out of the districts of Baliuag and Quingua (now Plaridel) and coming from the Pampango word \"Kengwa\", meaning on the other side of the shore or kabilang ibayo.",
            "In 1794, the place was named San Isidro by the missionary Augustinian friars in honor of San Isidro Labrador, the patron saint of the farmers.",
            "On January 20, 1796, it was called Pulilan.",
            "There are no written records how the place is named Pulilan.",
            "But legend has it that is derived from Pulo ng Ilan, literally, clusters of small communities or isles.",
            "According to Antoon Postma in his \"The Laguna Copperplate Inscription (LCI) – A Valuable Philippine Document\" this copperplate with inscription discovered at Lumbang River near the Laguna Lake area in Laguna dates back to 900 A.D.",
            "In this inscription was mentioned the name Puliran, as the old name for southeastern lake area.",
            "The toponyms or place names Puliran is Pulilan, Bulacan and Pulilan is in Laguna de Bay.",
            "However, Mr. Postma is convinced in his studies that Pulilan in the LCI is the Pulilan along the Angat River, in the Province of Bulacan, north of Manila."
        ],
        [
            "History"
        ],
        [
            "See also: Laguna Copperplate Inscription, Greater India, and Indosphere"
        ],
        [
            "The first time Pulilan was settled was unknown but if existing records of the towns of Calumpit and Baliuag, between which the town lies, be made a basis, it could be deduced that in the early part of the 17th century it could have had a sprinkling of settlers.",
            "However, the ancient town of Pulilan was first documented as Puliran in the Laguna Copperplate Inscription, a pre-colonial oldest document of Philippines written in 900 A.D in Indianized script.",
            "The native population at the time of the document were ruled by the sovereign Lord Ka-Sumuran (see Laguna Copperplate Inscription)."
        ],
        [
            "During Spanish regime, an Augustian fray, Fray Vicente Villamanzaro, was made to declare the settlement of a town on January 20, 1796.",
            "It was assigned a patron saint, San Isidro Labrador, after whose name he wanted the town identified.",
            "On this time, the head of the town was called Kapitan.",
            "It was only in 1819 that Pulilan has as its first Kapitan, Kapitan Francisco Paltao.",
            "In 1898, the first Presidente Municipal was Froilan Cahiwat.",
            "In 1904, when Anacleto Batongbacal was the Presidente Municipal, Pulilan was annexed to Quingua and became its sitio.",
            "In 1908, as the Pulilenos rallied behind the candidacy of their son Adriano Salvador, he was elected Presidente Municipal of Quinqua.",
            "Then in 1909, representations were made by Eugenio Tiangco, Hilario Esguerra, Adriano Salvador and others with Governor Teodoro Sandico to separate Pulilan from Quingua.",
            "It was granted.",
            "Pulilan then became a town, with Eugenio Tiangco as its Presidente.",
            "In 1946, Catalino Flores was appointed as the first Mayor of Pulilan."
        ],
        [
            "From the Spanish time to American occupation and lately the Japanese era, many sons of the town of Pulilan shed their blood.",
            "After long march to freedom, Pulilenos started to build from its small beginnings and from then on made a great stride in politics, economy, social standing and in other fields.",
            "The influence of the Spanish, American and Japanese occupations, have in a measure, contributed to the promotion of their welfare, but the Pulileños, as they are known, treasure their great heritage.",
            "San Isidro Labrador or Saint Isidore the Laborer, the patron saint of the farmers, is the patron saint of the town as well.",
            "The traditional date of his liturgical feast, which through not included in the General Roman Calendar has been celebrated for centuries in several countries and diocese is May 15.",
            "However, it is in the 14th day of May that Pulileños (people of Pulilan) celebrate the feast in honor of their saint by parading carabaos and making them kneel in front of the church as a sign of respect for their patron saint of farmers.",
            "Also included in the parade are cows, horses, street folk dancers, marching bands and floats of commercial establishments of the town."
        ],
        [
            "Geography"
        ],
        [
            "Topography"
        ],
        [
            "Pulilan is one of the 21 towns of Bulacan province, located in about its center—from north to south.",
            "It lies 43 kilometres (27 mi) north-west of Manila, the national capital, and 20 kilometres (12 mi) away from Malolos, the provincial capital.",
            "It has an area of about 4,073 hectares (40.73 sq.",
            "kilometers).",
            "It is bounded on the north by Apalit in Pampanga; on the east by Baliwag; on the south by Plaridel; and on the west by Calumpit.",
            "The Angat River cutting its way through the eastern edge of Baliwag, and the southern fringes of Pulilan down to the tributary of Manila Bay south-west of Calumpit, serves as the boundary with Plaridel."
        ],
        [
            "The municipality is generally of flat topography.",
            "Eleven (11) of its barangays are bounded by the Angat River.",
            "The rest are flat irrigated rice lands.",
            "Soil types vary from sandy loam to clay loam which makes the municipality suitable to a wide range of agricultural products."
        ],
        [
            "Most of the barangays in Pulilan have low susceptibility to flooding.",
            "Those portion with moderate to high susceptibility to flooding are barangays that are near or adjacent to creeks that are tributaries of the Angat River and barangays that are low-lying such as Dulong Malabon and Inaon."
        ],
        [
            "Land use"
        ],
        [
            "Most of the existing municipal land use area is for agricultural purposes, about 27.92 square kilometres (10.78 sq mi) or 68.55% of the town's land area is primarily for crop production.",
            "While the 12.8076 square kilometres (4.95 sq.",
            "mi) or 31.45% of available land is dedicated for residential, commercial, industrial and institutional purposes."
        ],
        [
            "Climate"
        ],
        [
            "Based on the Köppen climate classification system, the climate is tropical in Pulilan.",
            "During most months of the year, there is significant rainfall in Pulilan.",
            "There is only a short dry season.",
            "According to Köppen and Geiger, this climate is classified as Am.",
            "The temperature here averages 27.2 °C.",
            "The average annual rainfall is 792 mm.",
            "The driest month is February.",
            "There is 4 mm of precipitation in February.",
            "Most precipitation occurs in July, with an average of 151 mm.",
            "With an average of 29.2 °C, May is the warmest month.",
            "In January, the average temperature is 25.5 °C.",
            "It"
        ],
        [
            "is the lowest average temperature of the whole year.",
            "The precipitation varies 147 mm between the driest month and the wettest month.",
            "The average temperatures vary during the year by 3.7 °C."
        ],
        [
            "Climate data for Pulilan, Bulacan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "6(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "6(0.2)"
        ],
        [
            "17(0.7)"
        ],
        [
            "82(3.2)"
        ],
        [
            "122(4.8)"
        ],
        [
            "151(5.9)"
        ],
        [
            "123(4.8)"
        ],
        [
            "124(4.9)"
        ],
        [
            "99(3.9)"
        ],
        [
            "37(1.5)"
        ],
        [
            "21(0.8)"
        ],
        [
            "792(31.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "2.5"
        ],
        [
            "11.7"
        ],
        [
            "6.6"
        ],
        [
            "17.7"
        ],
        [
            "22.2"
        ],
        [
            "25.2"
        ],
        [
            "23.7"
        ],
        [
            "23.2"
        ],
        [
            "17.9"
        ],
        [
            "9.2"
        ],
        [
            "5.2"
        ],
        [
            "168.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Pulilan Map"
        ],
        [
            "Pulilan is politically subdivided into 19 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "The biggest barangay in terms of land area is Dulong Malabon while the most populated barangay is Poblacion and the least populated barangay is Santa Peregrina."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 031418001   Balatong A"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,877"
        ],
        [
            " 1,553"
        ],
        [
            "  ▴"
        ],
        [
            " 1.91%"
        ],
        [
            " 031418002   Balatong B"
        ],
        [
            " 3.8%"
        ],
        [
            " 4,100"
        ],
        [
            " 3,402"
        ],
        [
            "  ▴"
        ],
        [
            " 1.88%"
        ],
        [
            " 031418003   Cutcot"
        ],
        [
            " 7.6%"
        ],
        [
            " 8,320"
        ],
        [
            " 4,844"
        ],
        [
            "  ▴"
        ],
        [
            " 5.56%"
        ],
        [
            " 031418005   Dampol 1st"
        ],
        [
            " 6.2%"
        ],
        [
            " 6,770"
        ],
        [
            " 5,602"
        ],
        [
            "  ▴"
        ],
        [
            " 1.91%"
        ],
        [
            " 031418006   Dampol 2nd A"
        ],
        [
            " 4.5%"
        ],
        [
            " 4,896"
        ],
        [
            " 3,001"
        ],
        [
            "  ▴"
        ],
        [
            " 5.02%"
        ],
        [
            " 031418007   Dampol 2nd B"
        ],
        [
            " 4.9%"
        ],
        [
            " 5,317"
        ],
        [
            " 3,958"
        ],
        [
            "  ▴"
        ],
        [
            " 3.00%"
        ],
        [
            " 031418008   Dulong Malabon"
        ],
        [
            " 3.8%"
        ],
        [
            " 4,114"
        ],
        [
            " 4,180"
        ],
        [
            "  ▾"
        ],
        [
            " −0.16%"
        ],
        [
            " 031418009   Inaon"
        ],
        [
            " 8.7%"
        ],
        [
            " 9,453"
        ],
        [
            " 7,530"
        ],
        [
            "  ▴"
        ],
        [
            " 2.30%"
        ],
        [
            " 031418010   Longos"
        ],
        [
            " 5.3%"
        ],
        [
            " 5,817"
        ],
        [
            " 5,105"
        ],
        [
            "  ▴"
        ],
        [
            " 1.31%"
        ],
        [
            " 031418011   Lumbac"
        ],
        [
            " 4.4%"
        ],
        [
            " 4,766"
        ],
        [
            " 3,958"
        ],
        [
            "  ▴"
        ],
        [
            " 1.87%"
        ],
        [
            " 031418018   Paltao"
        ],
        [
            " 5.9%"
        ],
        [
            " 6,457"
        ],
        [
            " 5,705"
        ],
        [
            "  ▴"
        ],
        [
            " 1.25%"
        ],
        [
            " 031418020   Peñabatan"
        ],
        [
            " 2.2%"
        ],
        [
            " 2,377"
        ],
        [
            " 1,925"
        ],
        [
            "  ▴"
        ],
        [
            " 2.13%"
        ],
        [
            " 031418022   Poblacion"
        ],
        [
            " 12.3%"
        ],
        [
            " 13,353"
        ],
        [
            " 11,858"
        ],
        [
            "  ▴"
        ],
        [
            " 1.19%"
        ],
        [
            " 031418025   Sta Peregrina"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,666"
        ],
        [
            " 1,335"
        ],
        [
            "  ▴"
        ],
        [
            " 2.24%"
        ],
        [
            " 031418026   Sto Cristo"
        ],
        [
            " 7.1%"
        ],
        [
            " 7,700"
        ],
        [
            " 6,405"
        ],
        [
            "  ▴"
        ],
        [
            " 1.86%"
        ],
        [
            " 031418033   Taal"
        ],
        [
            " 7.3%"
        ],
        [
            " 7,912"
        ],
        [
            " 5,711"
        ],
        [
            "  ▴"
        ],
        [
            " 3.31%"
        ],
        [
            " 031418034   Tabon"
        ],
        [
            " 4.5%"
        ],
        [
            " 4,931"
        ],
        [
            " 3,649"
        ],
        [
            "  ▴"
        ],
        [
            " 3.06%"
        ],
        [
            " 031418035   Tibag"
        ],
        [
            " 4.5%"
        ],
        [
            " 4,857"
        ],
        [
            " 2,845"
        ],
        [
            "  ▴"
        ],
        [
            " 5.49%"
        ],
        [
            " 031418037   Tinejero"
        ],
        [
            " 3.8%"
        ],
        [
            " 4,153"
        ],
        [
            " 2,845"
        ],
        [
            "  ▴"
        ],
        [
            " 3.85%"
        ],
        [
            "Total"
        ],
        [
            "108,836"
        ],
        [
            "85,844"
        ],
        [
            " ▴"
        ],
        [
            "2.40%"
        ],
        [
            "Land area"
        ],
        [
            "Overview of Pulilan and Angat River"
        ],
        [
            "Barangays"
        ],
        [
            "Land Area(km2)"
        ],
        [
            "Classification"
        ],
        [
            "Density(/km2)"
        ],
        [
            "Balatong A"
        ],
        [
            "1.19"
        ],
        [
            "Urban"
        ],
        [
            "1,392"
        ],
        [
            "Balatong B"
        ],
        [
            "1.91"
        ],
        [
            "Urban"
        ],
        [
            "1,932"
        ],
        [
            "Cutcot"
        ],
        [
            "3.22"
        ],
        [
            "Urban"
        ],
        [
            "2,221"
        ],
        [
            "Dampol 1st"
        ],
        [
            "1.46"
        ],
        [
            "Urban"
        ],
        [
            "4,129"
        ],
        [
            "Dampol 2nd A"
        ],
        [
            "1.16"
        ],
        [
            "Urban"
        ],
        [
            "3,642"
        ],
        [
            "Dampol 2nd B"
        ],
        [
            "1.48"
        ],
        [
            "Urban"
        ],
        [
            "3,180"
        ],
        [
            "Dulong Malabon"
        ],
        [
            "5.46"
        ],
        [
            "Rural"
        ],
        [
            "720"
        ],
        [
            "Inaon"
        ],
        [
            "3.50"
        ],
        [
            "Urban"
        ],
        [
            "2,295"
        ],
        [
            "Longos"
        ],
        [
            "1.19"
        ],
        [
            "Urban"
        ],
        [
            "4,560"
        ],
        [
            "Lumbac"
        ],
        [
            "1.24"
        ],
        [
            "Rural"
        ],
        [
            "3,247"
        ],
        [
            "Paltao"
        ],
        [
            "2.18"
        ],
        [
            "Urban"
        ],
        [
            "3,001"
        ],
        [
            "Peñabatan"
        ],
        [
            "3.10"
        ],
        [
            "Rural"
        ],
        [
            "644"
        ],
        [
            "Poblacion"
        ],
        [
            "2.27"
        ],
        [
            "Urban"
        ],
        [
            "5,326"
        ],
        [
            "Sta Peregrina"
        ],
        [
            "1.51"
        ],
        [
            "Urban"
        ],
        [
            "1,028"
        ],
        [
            "Sto Cristo"
        ],
        [
            "1.54"
        ],
        [
            "Urban"
        ],
        [
            "4,436"
        ],
        [
            "Taal"
        ],
        [
            "3.42"
        ],
        [
            "Urban"
        ],
        [
            "2,779"
        ],
        [
            "Tabon"
        ],
        [
            "2.37"
        ],
        [
            "Rural"
        ],
        [
            "1,839"
        ],
        [
            "Tinejero"
        ],
        [
            "1.29"
        ],
        [
            "Urban"
        ],
        [
            "3,283"
        ],
        [
            "Tibag"
        ],
        [
            "1.26"
        ],
        [
            "Urban"
        ],
        [
            "3,087"
        ],
        [
            "Total"
        ],
        [
            "39.89"
        ],
        [
            "2,440"
        ],
        [
            "  ^"
        ],
        [
            "industrial barangays (included in TDTIA and DIA Area)  ^ commercial barangays  ^"
        ],
        [
            "agricultural/residential barangays"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PulilanYearPop.±% p.a.1903 9,665—    1918 10,160+0.33%1939 12,693+1.07%1948 16,843+3.19%1960 20,436+1.62%1970 28,923+3.53%1975 34,234+3.44%1980 38,110+2.17%1990 48,199+2.38%1995 59,682+4.09%2000 68,188+2.90%2007 85,008+3.09%2010 85,844+0.36%2015 97,323+2.42%2020 108,836+2.22%Source: Philippine Statistics Authority"
        ],
        [
            "The municipality's population grew twice by 49,124 from 48,199 in 1990 to 97,323 in 2015.",
            "The continuous increase in the population of Pulilan may not only be attributed to growing population of the natives but also to the influx of migrants from nearby places."
        ],
        [
            "In the 2020 census, the population of Pulilan, Bulacan, was 108,836 people, with a density of 2,700 inhabitants per square kilometre or 7,000 inhabitants per square mile."
        ],
        [
            "10,000"
        ],
        [
            "20,000"
        ],
        [
            "30,000"
        ],
        [
            "40,000"
        ],
        [
            "50,000"
        ],
        [
            "60,000"
        ],
        [
            "70,000"
        ],
        [
            "80,000"
        ],
        [
            "90,000"
        ],
        [
            "100,000"
        ],
        [
            "19901,210/km2"
        ],
        [
            "19951,500/km2"
        ],
        [
            "20001,700/km2"
        ],
        [
            "20072,100/km2"
        ],
        [
            "20102,200/km2"
        ],
        [
            "20152,400/km2"
        ],
        [
            "Ethnic groups"
        ],
        [
            "The original settlers and natives in Pulilan are primarily Tagalog people, one of the most widespread groups of people in the Philippines.",
            "Several Kapampangans also started settling here before.",
            "The municipality is currently experiencing influx of migrants by being a part of the Greater Manila Area (GMA) so there is also a considerably minor population of Bicolano, Ilocano, Ilonggo, Pangasinense and Visayans."
        ],
        [
            "Languages"
        ],
        [
            "Like other places in Luzon, the most spoken language in Pulilan is Tagalog.",
            "Some of its residents speak and use Kapampangan language due to its proximity to the province of Pampanga.",
            "However, in schools and other institutions, English and Tagalog are alternately use as medium of instruction."
        ],
        [
            "Literacy"
        ],
        [
            "In 2008, the total number of households are 17,002.",
            "Ninety-nine percent of the total number of household members are literate.",
            "They are able to read and write a simple message in any language or dialect."
        ],
        [
            "Religion"
        ],
        [
            " Mahal na Señor Jesus Nazareno Chapel in Lumbac"
        ],
        [
            "Like other municipalities in the Philippines, majority of the inhabitants of Pulilan are adherents of the Catholic Church.",
            "This is evident by their strong faith and devotion to the town's patron saint, San Isidro Labrador.",
            "Each barangay and sitio has their own respective chapel where they perform their mass and other liturgical services.",
            "The San Isidro Parish Church and Our Lady of Miraculous Medal are the parish churches in the municipality and it is under the jurisdiction of the Roman Catholic Diocese of Malolos."
        ],
        [
            "Iglesia ni Cristo chapel- Paltao"
        ],
        [
            "Iglesia ni Cristo also holds a strong presence in the municipality by establishing worship centers in barangay Cutcot, Dampol 2nd-A, Inaon and Santo Cristo.",
            "These locales are included in the Ecclesiastical District of Bulacan North."
        ],
        [
            "Other religious groups represented include the following: Members Church of God International (Ang Dating Daan), Jesus Is Lord Church, Baptist, Jehovah's Witness, Methodist and other evangelical groups."
        ],
        [
            "Economy"
        ],
        [
            "Pulilan Public Market"
        ],
        [
            "Poverty incidence of Pulilan"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  10.60"
        ],
        [
            "2009  6.92"
        ],
        [
            "2012  4.80"
        ],
        [
            "2015  7.43"
        ],
        [
            "2018  4.59"
        ],
        [
            "2021  14.35"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The municipality of Pulilan has basically an agri-based economy.",
            "Farming, fishing, swine and poultry raising were the dominant economic industries and livelihood of the natives of the town.",
            "Structural changes in the economy become evident due to the rapid rate of urbanization characterized by increasing encroachment of industries and manufacturing establishments on productive agricultural land of the municipality.",
            "Now, the municipality is known as one of the emerging centers of trade and commerce in the province of Bulacan and continuously outshining its neighboring municipalities.",
            "According to the 2017 COA Annual Financial Report, the municipality has an annual income of 383.60 million, 59.74 million or 18% higher than its previous income.",
            "Making it one of the richest municipalities in Bulacan and Central Luzon."
        ],
        [
            "2015–2020 Municipality of Pulilan Financial Highlights (Amounts in Thousand Pesos)"
        ],
        [
            "2020"
        ],
        [
            "2019"
        ],
        [
            "2018"
        ],
        [
            "2017"
        ],
        [
            "2016"
        ],
        [
            "2015"
        ],
        [
            "Assets"
        ],
        [
            "656,753"
        ],
        [
            "659,863"
        ],
        [
            "593,462"
        ],
        [
            "524,218"
        ],
        [
            "464,106"
        ],
        [
            "392,596"
        ],
        [
            "Liabilities"
        ],
        [
            "153,104"
        ],
        [
            "127,294"
        ],
        [
            "165,753"
        ],
        [
            "162,440"
        ],
        [
            "141,525"
        ],
        [
            "112,340"
        ],
        [
            "Equity"
        ],
        [
            "503,649"
        ],
        [
            "532,570"
        ],
        [
            "427,709"
        ],
        [
            "361,778"
        ],
        [
            "322,581"
        ],
        [
            "280,256"
        ],
        [
            "Revenue"
        ],
        [
            "498,486"
        ],
        [
            "494,989"
        ],
        [
            "428,960"
        ],
        [
            "383,602"
        ],
        [
            "323,861"
        ],
        [
            "294,211"
        ],
        [
            "Expenses"
        ],
        [
            "505,504"
        ],
        [
            "394,765"
        ],
        [
            "365,286"
        ],
        [
            "315,337"
        ],
        [
            "282,300"
        ],
        [
            "225,064"
        ],
        [
            "The major income sources in the municipality come from flowers/ornamental plants, food/food processing, garments and embroidery, gifts/house decors, marble/marble processing, poultry and hog raising, furniture, crop production, and services."
        ],
        [
            "Agriculture"
        ],
        [
            "Rice production and livestock/poultry raising are the most common agribusiness in Pulilan.",
            "In 2,226.75 hectares or 5,502.42 acres of irrigated area planted, 10,660.25 metric tons of rice are produced.",
            "While 65,470 swine and chickens are produced in 12 commercial farms/poultries and 638 swine are raised in 86 backyard farms."
        ],
        [
            "Banking"
        ],
        [
            "There are 12 major and local commercial banks that provide financial services in the municipality.",
            "Some of these are the following: Banco de Oro"
        ],
        [
            "(BDO), Metrobank, Landbank, Philippine National Bank, Philippine Savings Bank (PSBank), Rizal Commercial Banking Corporation (RCBC) and Bank of Florida (BoF).",
            "As of December 2017, Pulilan recorded a total deposits of 4.048 billion pesos by adding the demand/now deposits, savings deposits, time deposits and FCDU deposits.",
            "The municipality also has 30,785 registered accounts from its 12 banks."
        ],
        [
            "Industry and Trade"
        ],
        [
            "Manufacturing is a dominant business and source of income and employment in the municipality.",
            "In 2010, there are 26 registered manufacturing businesses in Pulilan with 4,136 employees.",
            "The biggest manufacturers include the following: Nestle Philippines (Tibag), New Hope Agriculture Inc.(Tibag), Anderson Asphalt Philippines (Tibag), Feedmix Specialist Inc. II (Dampol 2nd A), Foster Foods Inc. (Dampol 2nd A), Leighton Contractors Asia (Tibag), Marquee Mills Manufacturing Corp. (Dampol 2nd B), Tyson Agro-Ventures (Tinejero), Jockers Food Industry (Santo Cristo), TJN Pasalubong (Paltao), Cargill Philippines, Inc. (Dampol 1st), R.M Foods (Dampol 2nd B) and Rombe (Dampol 1st)."
        ],
        [
            "Shopping malls"
        ],
        [
            "Robinsons Townville Pulilan"
        ],
        [
            "In 2010, Robinsons Supermarket, later renamed as Robinsons Townville, started to operate in Barangay Cutcot, in front of Pulilan Public Market.",
            "Massway Supermarket also established its branch in Barangay Santo Cristo and in 2017 SM Center was inaugurated in a 27,000 sq.m.",
            "lot in Barangay Santo Cristo along Pulilan-Plaridel Diversion Road, making it the very first full-service shopping mall in the municipality."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Façade of Pulilan Municipal Hall"
        ],
        [
            "Just like the national government, the municipal government of Pulilan is divided into three branches which are the executive, legislative, and judiciary.",
            "The Local Government Units (LGUs) have control of the executive and legislative branches.",
            "While the judicial branch is administrated solely by the Supreme Court (SC)."
        ],
        [
            "The executive branch is composed of the mayor and barangay captain for the barangay.",
            "The legislative branch is composed of the Sanguniang Bayan (town council) and Sanguniang Barangay (Barangay council).",
            "The council is in charge of creating the municipality's policies in the form of ordinances and resolutions.",
            "The Mayor is the executive head and leads the municipal department in executing ordinances and improving public services.",
            "The Vice Mayor heads a council consisting of 10 members, 8 councilors, and 2 ex-officio members (ABC President and SK Federation President)."
        ],
        [
            "All of the barangays in the municipality is administrated by its duly-elected barangay captain.",
            "The barangay captain is aided by the Sangguniang Barangay (Barangay Council) whose members, seven Barangay Kagawad (Councilors), are also elected.",
            "On the other hand, Sangguniang Kabataan (SK) council represent the youth in each barangay."
        ],
        [
            "Elected officials"
        ],
        [
            "Below is the list of the elected officials of the Municipality of Pulilan:"
        ],
        [
            "Municipal Government of Pulilan Officials (2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Term"
        ],
        [
            "Votesreceived"
        ],
        [
            "Party"
        ],
        [
            "Other alliance"
        ],
        [
            "Mayor"
        ],
        [
            "Maritz Ochoa-Montejo"
        ],
        [
            "3rd term"
        ],
        [
            "29,273"
        ],
        [
            "Nacionalista"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Rolando \"RJ\" Peralta, Jr."
        ],
        [
            "1st term"
        ],
        [
            "28,700"
        ],
        [
            "Aksyon"
        ],
        [
            "Councilors"
        ],
        [
            "Gilbert \"Atorni\" S. Munoz"
        ],
        [
            "1st term"
        ],
        [
            "28,545"
        ],
        [
            "Nacionalista"
        ],
        [
            "Zandro C. Hipolito"
        ],
        [
            "1st term"
        ],
        [
            "28,163"
        ],
        [
            "Nacionalista"
        ],
        [
            "Peter John T. Dionisio"
        ],
        [
            "1st term"
        ],
        [
            "27,664"
        ],
        [
            "Nacionalista"
        ],
        [
            "Francisco \"Ogie\" D.J.",
            "Cruz, Jr."
        ],
        [
            "1st term"
        ],
        [
            "27,350"
        ],
        [
            "Aksyon"
        ],
        [
            "Rodolfo \"Rudy\" E. Arceo"
        ],
        [
            "3rd term"
        ],
        [
            "26,232"
        ],
        [
            "Nacionalista"
        ],
        [
            "Rolando \"Rolie\" G. Payumo"
        ],
        [
            "2nd term"
        ],
        [
            "23,031"
        ],
        [
            "Nacionalista"
        ],
        [
            "John J. Nethercott"
        ],
        [
            "2nd term"
        ],
        [
            "22,797"
        ],
        [
            "Nacionalista"
        ],
        [
            "Reynaldo \"Jr\" Clemente, Jr."
        ],
        [
            "3rd term"
        ],
        [
            "21,500"
        ],
        [
            "Nacionalista"
        ],
        [
            "Ex Officio"
        ],
        [
            "ABC President"
        ],
        [
            " Dennis M. Cruz"
        ],
        [
            "Santo Cristo"
        ],
        [
            "Nonpartisan"
        ],
        [
            " SK Federation President"
        ],
        [
            "Paolo Aldrin Agno"
        ],
        [
            "Poblacion"
        ],
        [
            "Nonpartisan"
        ],
        [
            "Incumbent mayor Maritz Ochoa-Montejo won her third and final term after she defeated vice mayor Ricardo Candido and former councilor Lauro Valenzuela."
        ],
        [
            "Meanwhile, councilor Rolando Peralta, Jr. was named as the new municipal vice mayor.",
            "His opponent was Bgy.",
            "Santo Cristo Chairman and municipal ABC President Dennis Cruz."
        ],
        [
            "Seven of the current councilors of Pulilan are from Nacionalista Party while the other one ran under the Aksyon Demokratiko party."
        ],
        [
            "List of local chief executives"
        ],
        [
            " Maritz Ochoa-Montejo"
        ],
        [
            "2019–2022 Municipal Officials"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "Mayor"
        ],
        [
            "Maritz Ochoa-Montejo"
        ],
        [
            "Nacionalista"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Ricardo Candido"
        ],
        [
            "Lakas"
        ],
        [
            "Councilors"
        ],
        [
            "Lovy Leslie Valenzuela"
        ],
        [
            "Nacionalista"
        ],
        [
            "Rolando \"RJ\" Peralta Jr."
        ],
        [
            "Nacionalista"
        ],
        [
            "John Nethercott"
        ],
        [
            "Nacionalista"
        ],
        [
            "Atty.",
            "Renan Castillo"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Rodolfo \"Rudy\" Arceo"
        ],
        [
            "Nacionalista"
        ],
        [
            "Rolando Payumo"
        ],
        [
            "Independent"
        ],
        [
            "Bernardino Santos"
        ],
        [
            "Nacionalista"
        ],
        [
            "Reynaldo \"Jr\" Clemente Jr."
        ],
        [
            "Nacionalista"
        ],
        [
            "2016–2019 Municipal Officials"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "Mayor"
        ],
        [
            "Maritz Ochoa- Montejo"
        ],
        [
            "Liberal"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Ricardo Candido"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Councilors"
        ],
        [
            "Enoc L. Santos, Jr."
        ],
        [
            "PDP–Laban"
        ],
        [
            "Rolando S. Peralta, Jr."
        ],
        [
            "Liberal"
        ],
        [
            "Renan B. Castillo"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Rodolfo E. Arceo"
        ],
        [
            "Liberal"
        ],
        [
            "Bernardino L. Santos"
        ],
        [
            "Liberal"
        ],
        [
            "Reynaldo J. Clemente, Jr."
        ],
        [
            "Liberal"
        ],
        [
            "Restituto T. Esguerra"
        ],
        [
            "Independent"
        ],
        [
            "Lauro A. Valenzuela"
        ],
        [
            "Liberal"
        ],
        [
            "Barangay officials"
        ],
        [
            "Association of Barangay Captains"
        ],
        [
            "Barangay"
        ],
        [
            "Name"
        ],
        [
            "Balatong A"
        ],
        [
            "Laureano Sicat"
        ],
        [
            "Balatong B"
        ],
        [
            "Edgardo Hipolito"
        ],
        [
            "Cutcot"
        ],
        [
            "Reynaldo San Pedro"
        ],
        [
            "Dampol 1st"
        ],
        [
            "Gerardo Arellano"
        ],
        [
            "Dampol 2nd A"
        ],
        [
            "Maria Felicidad Ylagan"
        ],
        [
            "Dampol 2nd B"
        ],
        [
            "Marcelo Tayao"
        ],
        [
            "Dulong Malabon"
        ],
        [
            "Rolando Tayao"
        ],
        [
            "Inaon"
        ],
        [
            "Alfredo Arceo"
        ],
        [
            "Longos"
        ],
        [
            "Armando Tandoy"
        ],
        [
            "Lumbac"
        ],
        [
            "Leonila Flores"
        ],
        [
            "Paltao"
        ],
        [
            "Servy Deo Manapat"
        ],
        [
            "Peñabatan"
        ],
        [
            "Bernardino Santos"
        ],
        [
            "Poblacion"
        ],
        [
            "Ryan Espiritu"
        ],
        [
            "Sta Peregrina"
        ],
        [
            "Jorge Santos, Jr."
        ],
        [
            "Sto Cristo"
        ],
        [
            "Dennis Cruz"
        ],
        [
            "Taal"
        ],
        [
            "Noel Bondoc"
        ],
        [
            "Tabon"
        ],
        [
            "Felino Cruz"
        ],
        [
            "Tibag"
        ],
        [
            "Renz Bryan Esguerra"
        ],
        [
            "Tinejero"
        ],
        [
            "Vicenta Leonardo"
        ],
        [
            "Sangguniang Kabataan Federation"
        ],
        [
            "Barangay"
        ],
        [
            "Name"
        ],
        [
            "Balatong A"
        ],
        [
            "Ken Jairus Geronimo"
        ],
        [
            "Balatong B"
        ],
        [
            "Jordan Opiaza"
        ],
        [
            "Cutcot"
        ],
        [
            "Mark Joseph Tolentino"
        ],
        [
            "Dampol 1st"
        ],
        [
            "RM Cipriano"
        ],
        [
            "Dampol 2nd A"
        ],
        [
            "Meann Cruz"
        ],
        [
            "Dampol 2nd B"
        ],
        [
            "Diane Claire Dela Cruz"
        ],
        [
            "Dulong Malabon"
        ],
        [
            "Arnel Resurreccion"
        ],
        [
            "Inaon"
        ],
        [
            "Angela Cruz"
        ],
        [
            "Longos"
        ],
        [
            "Joshua Mercado"
        ],
        [
            "Lumbac"
        ],
        [
            "Neil Anthony Paguia"
        ],
        [
            "Paltao"
        ],
        [
            "Nikko Ramos"
        ],
        [
            "Peñabatan"
        ],
        [
            "Justine Jay Tinjoco"
        ],
        [
            "Poblacion"
        ],
        [
            "Paolo Aldrin Agno"
        ],
        [
            "Sta Peregrina"
        ],
        [
            "Roselyn Joy Cabarles"
        ],
        [
            "Sto Cristo"
        ],
        [
            "Dan Kenneth Sato"
        ],
        [
            "Taal"
        ],
        [
            "Marc Hernest Castro"
        ],
        [
            "Tabon"
        ],
        [
            "Hannah Mae Manuel"
        ],
        [
            "Tibag"
        ],
        [
            "Christian Tovera"
        ],
        [
            "Tinejero"
        ],
        [
            "Hannah Raccell Driza"
        ],
        [
            "After multiple postponements, the Barangay and Sangguniang Kabataan elections (BSKE) finally took place on October 30, 2023.",
            "As per the ruling by the Supreme Court of the Philippines, the elected barangay officials are slated to serve a term of just two (2) years.",
            "The next BSKE election is set to happen on the first Monday of December 2025, with subsequent elections taking place every three years thereafter."
        ],
        [
            "Municipal seal"
        ],
        [
            "The official seal of the municipality of Pulilan serves as the towns identity for many years.",
            "Each of the symbols incorporated into this emblem represents the glorious past of the town and its culture and traditions."
        ],
        [
            "It includes the following:"
        ],
        [
            "The Kneeling Carabao – is where the town is famous of.",
            "Every 14 May, the feast of the Kneeling Carabao is celebrated as a festival and at the same time a thanksgiving for their ever guiding patron saint San Isidro Labrador."
        ],
        [
            "San Isidro Labrador Parish Church – the home of the town's patron saint.",
            "This is the religious center of the town where religious activities, particularly worship services are held."
        ],
        [
            "Rice Fields – one of the major source of income in the municipality."
        ],
        [
            "Nipa hut – the ancient house or residence of most of the Pulileños."
        ],
        [
            "Mango tree – are abundant in the town and one of the major industry here."
        ],
        [
            "Bamboo pieces – it serve as the border of the emblem.",
            "It also represents how Pulileños are resilient and optimistic in their life."
        ],
        [
            "Tourism"
        ],
        [
            "Tourism is one of the emerging industry in the municipality of Pulilan.",
            "Every year, thousands of tourists visited this magnificent town.",
            "Most of the tourists come to witness the Kneeling Carabao Festival wherein the town is prominent.",
            "It is a bountiful occasion where different kinds of buffalos such as carabaos led the parade in the streets of the town together with the street dancers, marching bands and colorful floats.",
            "When they reach the church, they kneel in front of it as giving respect to their saint."
        ],
        [
            "This spectacular yet remarkable festivity is held every 14 May, one day before the feast of San Isidro Labrador, the town's patron saint.",
            "This is not only a tribute on their patron saint but also to the carabaos for their hard work during farming season.",
            "This festival is also a celebration for a year-long bountiful harvest.",
            "Pulilan is not only well known for its festival but also famous because of numerous tourist attractions located in the vicinity of the town."
        ],
        [
            "Historical and religious edifices"
        ],
        [
            "San Isidro Labrador Parish Church"
        ],
        [
            "Main article: San Isidro Labrador Church"
        ],
        [
            "San Isidro Labrador Parish Church"
        ],
        [
            "San Isidro Labrador Parish Church is where the carabaos during the feast are made kneel as tribute to their patron saint.",
            "This is a 19th-century baroque church located at the Kabayanan or the town's administrative center (Poblacion).",
            "It is also a famous pilgrimage site in Bulacan during the Holy Week or \"Kuaresma\".",
            "Aside from the St Augustine Parish church located in the nearby town of Baliwag, it is the only church that features more than 110 floats or Carozas in its Holy Week Processions.",
            "The Museo San Ysidro Labrador is also situated here."
        ],
        [
            "Pulilan Municipal Trial Court"
        ],
        [
            "Museo de Pulilan is the new name of Pulilan Municipal Trial Court after it was restored in 2013.",
            "It is also known by the locals as the former Gabaldon Building located in Barangay Poblacion near the Municipal Hall Compound.",
            "Now, it is one of the famous tourist destinations not only in the municipality but in the whole province of Bulacan because of its cultural and historical features.",
            "Inside this museum are different sculptures, paintings and old documents about the flourishing history of the town."
        ],
        [
            "Adriano Salvador Heritage House"
        ],
        [
            "Adriano Salvador Heritage House"
        ],
        [
            "It is dubbed as the \"Malacañang of Pulilan\", in 1908 this historical house served as the joint municipal of two ancient towns of Quingua (Plaridel) and San Isidro (Pulilan)."
        ],
        [
            "Casanova-Aguirre Ancestral House"
        ],
        [
            "Casanova-Aguirre Ancestral House"
        ],
        [
            "This ancestral house is one of the most well-preserved old house in Bulacan.",
            "It is situated near the boundaries of barangay Poblacion and Lumbac.",
            "This is a famous tourist spot in the entire town because of its preserved beauty and scenic view.",
            "It is also known as the site of the 2006 Filipino romantic film, Moments of Love, starring Iza Calzado and Dingdong Dantes."
        ],
        [
            "Aguirre Centennial House"
        ],
        [
            "This Centennial House is located inside the Butterfly Haven Resort and one of the main tourist attraction inside the resort because of its unique and distinct architecture.",
            "This 100-year-old house is owned by the family of Revenue Deputy Commissioner Lita Aguirre."
        ],
        [
            "Mandalá Art Festival"
        ],
        [
            "Mandalá Art Festival is an annual gathering of visual artists and cultural workers from various parts of the country every month of May as part of Pulilan town fiesta.",
            "This cultural event showcases the best artistic skills and traditions of Central Luzon.",
            "During this occasion, several exhibitions are open to the public and mural painting activities (Kalye Art) in different locations around municipality are held.",
            "This has been led by Jefarca Arts and Historical Society Inc., National Commission for Culture and the Arts (NCCA), Museo de Pulilan and the Municipality of Pulilan since its inception in 2012.",
            "The word Mandalá is based on a local term meaning \"the best of the harvest\"."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Pulilan Junction"
        ],
        [
            "Pulilan can be accessed through private vehicles, jeepneys, tricycles, and even buses."
        ],
        [
            "Public Utility Jeepneys (PUJs) are stationed at Robinsons Townville terminal which have routes passing through Pulilan Regional Road (or N115 of the Philippine highway network) and several barangays to Lumbac, Dampol 2nd-B (Camachile) and to its neighboring town of Calumpit.",
            "Tricycles, on the other hand, serve the interiors of barangays and residential areas."
        ],
        [
            "Bus and UV Express are also common mode of transportation in the municipality.",
            "Buses and UV Express transport passengers in Pulilan to and from Grace Park, Divisoria, Monumento, and Cubao in Metro Manila.",
            "They commonly picked commuters along Pulilan junction and in SM Center Pulilan terminal.",
            "Several taxis also transport passengers from Metro Manila to Pulilan."
        ],
        [
            "Road networks"
        ],
        [
            "North Luzon Expressway (NLEX) is the only expressway in Pulilan which passes through the municipality with 2 entrances and exits in Barangays Dampol II-A and Tibag."
        ],
        [
            "Main national highways include the Pan-Philippine Highway or commonly called as Maharlika Highway (part of AH26, Pulilan to Baliwag), which passes through barangay Santo Cristo, Cutcot and Longos.",
            "Other arterial roads include Pulilan Regional Road (N115, Pulilan to Calumpit), Pulilan–Plaridel Diversion Road which is connected to Plaridel Bypass Road, Old Cagayan Valley Road and Pulilan-Apalit Road."
        ],
        [
            "In May 2019, the Pulilan-Baliwag Diversion Road or commonly referred to as Pulilan Bypass Road was formally opened to motorists.",
            "The project is expected to alleviate the humongous traffic congestion in Pan-Philippine Highway and Pulilan Regional Road and spur further developments in the municipality.",
            "This 9.62-kilometer diversion road transvers the barangays of Tibag, Dulong Malabon, Tabon, Peñabatan, Santa Peregrina, and Balatong B and ends in Barangay Tarcan in Baliwag."
        ],
        [
            "The project had a multi-year funding from the Department of Public Works and Highways (DPWH) infrastructure program amounting to PHP 582 million for civil works and PHP 150 million for road right of way acquisition."
        ],
        [
            "Utilities"
        ],
        [
            "Power and Water Supply"
        ],
        [
            "The Manila Electric Company (Meralco) is the sole company that provides electric services in Pulilan.",
            "All the 19 barangays have supply of electricity already.",
            "In 2003, 63.65 million kWh of power is being consumed by the municipality.",
            "The water system and services of Pulilan is provided by LWUA (Local Water Utilities Administration) through the Pulilan Water District in which its office is situated in Barangay Cutcot.",
            "The municipality will also be a beneficiary of P24.4-billion Bulacan Bulk Water Supply Project (BBWSP) as it will soon provide additional water supply to its water district."
        ],
        [
            "Communication Services"
        ],
        [
            "Philippine Long Distance Telephone Company (PLDT), Digital Telecommunications Philippines (DIGITEL), Smart Communications and DATELCOM are the main landline telephone service provider in Pulilan while the three major cellular companies here are Smart Communications, Globe Telecom and Dito Telecommunity.",
            "Telegraph and express mail services are being provided by the municipal post office in Barangay Poblacion and private companies like LBC, Western Union, etc."
        ],
        [
            "Social services"
        ],
        [
            "Education"
        ],
        [
            " Bulacan State University campus"
        ],
        [
            "Education had been a priority in Pulilan.",
            "It is evidently shown in having a literacy rate of 99%.",
            "The number of households that are literate is 16,832 out of 17,002, which are able to read and write a simple message in any language or dialect."
        ],
        [
            "Pulilan also had become an educational hub within the province.",
            "As it hosts numerous public and private-owned school where many of its constituents and neighboring locals went to study.",
            "As of 2016, there are 16 public schools in Pulilan.",
            "Several private schools can also be found in the municipality.",
            "Most of which offers primary and secondary education.",
            "There are also 5 tertiary institutions in the municipality."
        ],
        [
            "In 2013, Bulacan State University (BulSU) was established in Barangay Paltao where it started to operate an extension program aligned in education courses.",
            "While, Polytechnic University of the Philippines (PUP) resides in the former municipal hall building in Barangay Poblacion.",
            "There are also technical / vocational schools and training centers here."
        ],
        [
            "The private schools in Pulilan are members of Bulacan Private Schools Association (BULPRISA).",
            "On the other hand, all primary and secondary schools in the municipality are under the supervision of Department of Education (DepEd) Schools Division of Bulacan."
        ],
        [
            "Health"
        ],
        [
            "As of 2010, there are 25 medical facilities as well as 2 government operated rural health units that provide healthcare services in the municipality.",
            "Three of which are hospitals and that include the following: Our Lady of Mercy General Hospital (OLMGH) in Longos, The Good Shepherd Hospital in Poblacion and F.M.",
            "Cruz Orthopedic & Gen. Hospital in Santo Cristo.",
            "Several clinics can also be found in the municipality."
        ],
        [
            "Peace and Order"
        ],
        [
            "In the area of peace and order, Pulilan is one of the more peaceful towns in the province.",
            "The crime rate is very minimal.",
            "Pulilan has a crime solution efficiency of 90.90% and an average crime rate of 1.8.",
            "It ranks third in the crime solution and in peace and order in Bulacan.",
            "As of 2010, the municipality is being served by 30 policemen and 9 firemen."
        ],
        [
            "Notable personalities"
        ],
        [
            "Mika Reyes is a Filipino volleyball player.",
            "She is a middle hitter/blocker and is currently playing in the semi-professional league in the Philippines."
        ],
        [
            "Aurelio Plamenco is a politician and then Mayor of Pulilan since 1988 to 1995 He became the Vice Governor of Bulacan in 1998 to 2007 under the leadership of then governor, Josie dela Cruz."
        ],
        [
            "Sharlene San Pedro, is a Filipino actress and VJ.",
            "She made her first television appearance at the age of four when she joined ABS-CBN's talent search Star Circle Quest: Kids Edition in 2004."
        ],
        [
            "Jamie Rivera, is a pop singer from the Philippines and also known as the Inspirational Diva."
        ],
        [
            "Florentino Collantes, was a Filipino poet who was among the writers who spearheaded a revival of interest in Tagalog literature in the Philippines in the 20th century.",
            "He was also called as the King of Balagtasan."
        ],
        [
            "Gloria Dizon-Coronel, is one of the country's premier sopranos.",
            "She is also a voice mentor at the University of Santo Tomas Conservatory."
        ],
        [
            "Brigido Batungbakal is a Filipino writer.",
            "He received the Gawad Dangal ni Balagtas, the highest recognition for a writer, from the Komisyon sa Wikang Filipino (KWF) in 1989 because of his contributions in Philippine literature."
        ],
        [
            "Sister cities"
        ],
        [
            "Dingalan, Aurora"
        ],
        [
            "See also"
        ],
        [
            "Philippines portal"
        ],
        [
            "San Isidro Labrador Church"
        ],
        [
            "Laguna Copperplate Inscription"
        ],
        [
            "Angat River"
        ],
        [
            "Gallery"
        ],
        [
            "Overview of La Pulilan Resort and Angat River from Pulilan-Plaridel Bridge"
        ],
        [
            "Pulilan Municipal Trial Court"
        ],
        [
            "Kneeling Carabao Statue in Longos"
        ],
        [
            "View of Angat River"
        ],
        [
            "Gat.Jose P. Rizal Statue at Pulilan Plaza"
        ],
        [
            "Pulilan Gymnasium"
        ],
        [
            "Pulilan Kneeling Carabaos Festival 2023"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Pulilan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^  https://elevation.maplogs.com/poi/pulilan_bulacan_philippines.237490.html.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Pulilan Kneeling Carabao Festival\".",
            "Philippine Primer.",
            "Retrieved July 12, 2018."
        ],
        [
            "^ Antoon Postma.",
            "\"The Laguna Copperplate Inscription\" (PDF).",
            "Retrieved July 13, 2018."
        ],
        [
            "^ \"History of Pulilan Police Station\".",
            "Retrieved July 13, 2018."
        ],
        [
            "^ \"Pulilan History\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 13, 2018."
        ],
        [
            "^ \"Pulilan Physical and Geographical Profile-Topographical and Hydrogeological Features\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 9, 2018."
        ],
        [
            "^ \"Pulilan Physical and Geographical Profile-Existing Municipality Land Use\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 9, 2018."
        ],
        [
            "^"
        ],
        [
            "\"Pulilan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 12, 2020."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Municipality of Pulilan\".",
            "Manila City, Philippines: Philippine Statistics Authority.",
            "Retrieved February 12, 2024."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bulacan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Pulilan Demographic Profile\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 6, 2018."
        ],
        [
            "^ \"Diocese of Malolos\".",
            "Claretian Communications Foundation, Inc. May 26, 2017.",
            "Retrieved July 5, 2018."
        ],
        [
            "^ \"INC Directory Ecclesiastical District Bulacan North\".",
            "INC Official Website.",
            "Retrieved July 5, 2018."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Pulilan Business\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 5, 2018."
        ],
        [
            "^ \"Commission on Audit 2020 Report-Pulilan\".",
            "Quezon City, Philippines: Commission on Audit (COA).",
            "Retrieved April 3, 2022."
        ],
        [
            "^ \"Commission on Audit 2019 Report-Pulilan\".",
            "Quezon City, Philippines: Commission on Audit (COA).",
            "Retrieved April 3, 2022."
        ],
        [
            "^ \"Commission on Audit 2018 Report-Pulilan\".",
            "Quezon City, Philippines: Commission on Audit (COA).",
            "Retrieved April 3, 2022."
        ],
        [
            "^ \"Commission on Audit 2017 Report-Pulilan\".",
            "Quezon City, Philippines: Commission on Audit (COA).",
            "Retrieved June 29, 2018."
        ],
        [
            "^ \"Commission on Audit 2016 Report-Pulilan\".",
            "Quezon City, Philippines: Commission on Audit (COA).",
            "Retrieved June 29, 2018."
        ],
        [
            "^ \"Commission on Audit 2015 Report-Pulilan\".",
            "Quezon City, Philippines: Commission on Audit (COA).",
            "Retrieved June 29, 2018."
        ],
        [
            "^ \"Pulilan Business 2\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 5, 2018."
        ],
        [
            "^ \"Pulilan Socioeconomic Background-Agriculture\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 5, 2018."
        ],
        [
            "^ \"Philippine Banking System- Distribution of Domestic Deposits 2017\".",
            "Philippine Deposit Insurance Corporation.",
            "Retrieved July 5, 2018."
        ],
        [
            "^ \"Pulilan Socioeconomic Background-Trade and Industry\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 5, 2018."
        ],
        [
            "^ \"SM Center Pulilan opens December 1\".",
            "Press Reader.",
            "Retrieved July 31, 2018."
        ],
        [
            "^ \"MEMBER, SANGGUNIANG BAYAN BULACAN - PULILAN - LONE DIST\".",
            "GMA.",
            "Retrieved May 10, 2022."
        ],
        [
            "^ \"Running for Councilor in Lone District of Pulilan\".",
            "Rappler.",
            "Retrieved June 30, 2018."
        ],
        [
            "^ \"Pulilan - Bulacan City/Municipality Results\".",
            "GMA News Online."
        ],
        [
            "^ \"2010–2013 Pulilan Municipal Officials\".",
            "Malolos, Bulacan: Province of Bulacan Official Website."
        ],
        [
            "^ \"LNB Member-District 1 (Pulilan)\".",
            "Liga ng mga Barangay Bulacan Chapter.",
            "Retrieved July 23, 2018."
        ],
        [
            "^ ABS-CBN News.",
            "\"2-year term awaits 2023 BSKE winners\".",
            "ABS-CBN News.",
            "Retrieved November 1, 2023."
        ],
        [
            "^ Victoria Tulad.",
            "\"Comelec to seek postponement of Dec. 2025 barangay, SK polls\".",
            "ABS-CBN News.",
            "Retrieved November 1, 2023."
        ],
        [
            "^ \"The Mandalá Art Festival explores the theme \"Lupang Pamana\"\".",
            "Press Reader.",
            "Retrieved July 9, 2018."
        ],
        [
            "^ \"Pulilan-Baliuag Diversion Road\".",
            "Department of Public Works and Highways (DPWH).",
            "Retrieved July 5, 2018."
        ],
        [
            "^ Jordeene Sheex Lagare.",
            "\"Bulacan Water project 'ahead of time'\".",
            "The Manila Times."
        ],
        [
            "^ \"Pulilan Socioeconomic Profile-Infrastructure\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 6, 2018."
        ],
        [
            "^ \"Socio-Economic Profile of Pulilan-Education\".",
            "Pulilan, Bulacan: Municipality of Pulilan Official Website.",
            "Retrieved July 4, 2018."
        ],
        [
            "^ \"BulSU sets up education site in Pulilan\".",
            "Pacesetter:The Official Website of Bulacan State University.",
            "Retrieved July 4, 2018."
        ],
        [
            "^ \"Pulilan Socioeconomic Profile-Heath and Nutrition\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 6, 2018."
        ],
        [
            "^ \"Pulilan Protective Services\".",
            "Municipality of Pulilan Official Website.",
            "Retrieved July 14, 2018."
        ],
        [
            "^ \"Gloria Coronel marks 50 years as glorious coloratura\".",
            "The Varsitarian(U.S.T).",
            "September 14, 2011.",
            "Retrieved July 14, 2018."
        ],
        [
            "^ \"Brigido C. Batungbakal\".",
            "Open Library.",
            "Retrieved July 14, 2018."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Pulilan."
        ],
        [
            "Wikivoyage has a travel guide for Bulacan."
        ],
        [
            " Media related to Pulilan at Wikimedia Commons"
        ],
        [
            "www.pulilan.gov.ph"
        ],
        [
            "Pulilan Bulacan"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Pulilan"
        ],
        [
            "Apalit, Pampanga"
        ],
        [
            "Calumpit"
        ],
        [
            "Pulilan"
        ],
        [
            "Baliwag"
        ],
        [
            "Plaridel"
        ],
        [
            "vte Province of BulacanMalolos (capital)  San Jose del Monte (largest city)Municipalities"
        ],
        [
            "Angat"
        ],
        [
            "Balagtas"
        ],
        [
            "Bocaue"
        ],
        [
            "Bulakan"
        ],
        [
            "Bustos"
        ],
        [
            "Calumpit"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Guiguinto"
        ],
        [
            "Hagonoy"
        ],
        [
            "Marilao"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Pandi"
        ],
        [
            "Paombong"
        ],
        [
            "Plaridel"
        ],
        [
            "Pulilan"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Maria"
        ],
        [
            "Component cities"
        ],
        [
            "Baliwag"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pulilan&oldid=1234567633\""
        ],
        [
            "Category: Municipalities of BulacanHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: missing titleCS1 errors: bare URLCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2020Coordinates on WikidataPages using infobox settlement with possible demonym listArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from July 2024Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}