{
    "name": "Quezon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Quezon, Isabela"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°18′43″N 121°36′18″E﻿ / ﻿17.3119°N 121.605°E﻿ / 17.3119; 121.605"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Quezon, Isabela\" – news · newspapers · books · scholar · JSTOR (January 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesQuezonMunicipalityMunicipality of QuezonSt.",
            "John Bosco Church"
        ],
        [
            "FlagSealMap of Isabela with Quezon highlightedOpenStreetMapQuezonLocation within the PhilippinesCoordinates: 17°18′43″N 121°36′18″E﻿ / ﻿17.3119°N 121.605°E﻿ / 17.3119; 121.605CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "5th districtFoundedJune 21, 1959Named forManuel Luis QuezonBarangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJimmy S. Gamazon Jr. • Vice MayorDaryl G. Gascon • RepresentativeFaustino Michael Carlos T. Dy III • Councilor"
        ],
        [
            "Members"
        ],
        [
            "Jheroine D. GanteAnnaliza M. DioquinoArmando L. LacambraAngel B. KillipJimmy G. Gamazon Sr.Candido S. AndumangJesus D. PoquizDaisy V. Infante"
        ],
        [
            " • Electorate16,594 voters (2022)Area • Revenue₱ 192.8 million (2020) • Assets₱ 303.9 million (2020) • Expenditure₱ 148 million (2020) • Liabilities₱ 30.14 million (2020)Service provider • ElectricityIsabela 2 Electric Cooperative (ISELCO 2) • WaterQuezon (Isabela) Water DistrictTime zoneUTC+8 (PST)ZIP code3324PSGC023122000IDD : area code +63 (0)78Native languagesIbanag Ilocano TagalogWebsitequezonisabela.gov.ph"
        ],
        [
            "Quezon, officially the Municipality of Quezon (Ibanag: Ili nat Quezon; Ilocano: Ili ti Quezon; Tagalog: Bayan ng Quezon), is a 4th class municipality in the province of Isabela, Philippines.",
            "According to the 2020 census, it has a population of 27,037 people."
        ],
        [
            "Quezon is a border town of Isabela with the province of Kalinga through the Quezon-Tabuk Road.",
            "It is bordered in the west by the city of Tabuk."
        ],
        [
            "Etymology"
        ],
        [
            "The town was named in honor of President Manuel L. Quezon, under the Republic Act No.",
            "2418 which was approved on June 21, 1959."
        ],
        [
            "History"
        ],
        [
            "Prior to its creation, Quezon was once part of a vast track of agricultural land called the Mallig Plains and was sparsely populated.",
            "Historians believe that its earliest inhabitants were the Igorots and the Kalingas of the Cordilleras as well as the Irrayas.",
            "Although the Igorots and the Kalingas are primarily upland dwellers, historians have observed that these natives come down from the highlands from time to time to hunt for low-landers especially the Kanyaw rituals.",
            "The site of Quezon the location of a Spanish mission called Nalabangan which was established on 24 May 1598 but vanished from historical records not long afterwards."
        ],
        [
            "When Manuel L. Quezon was elected as the President of the Philippine Commonwealth, one of his administration's main programs was to promote development in the other areas in the country aside from Manila.",
            "In order to achieve this objective, President Quezon opened up vast uninhabited areas for settlement hoping that these would be developed by those who will decide to settle in those areas.",
            "Aside from Mindanao, other parts of Luzon were similarly offered for settlement and development including the province of Isabela, particularly the north-western portion of the province which was later called Mallig Plains."
        ],
        [
            "Citing for the potential of the area for settlement and agricultural development, President Quezon declared the entire Mallig Plains as project site for his program on rural development.",
            "In support of this declaration, he created the Office of National Land Settlement Administration which was renamed to Land Settlement Development Corporation (LaSeDeCo).",
            "Subsequently, this corporation was reorganized.",
            "At that time, the primary objective of LaSeDeCo was basically to oversee and facilitate the distribution of lands to qualified settlers.",
            "With the development of this opportunity for rural and agricultural development and with the completion of the Balete Pass Road in the 1920s that runs through the hinterlands of the Caraballo Mountains, hundreds of inhabitants from the Ilocos and Central Luzon regions opted to settle and avail of the program of the government in the Mallig Plains area."
        ],
        [
            "A few years after the declaration of the area as site for settlement and agricultural development, World War II broke out and the region was later placed under Japanese control.",
            "Early settlers had difficulty rebuilding afterwards due to attacks by Kalinga tribes from the north."
        ],
        [
            "One of those who fought the Kalinga was Jesus Estrada for whom a barangay was named after him.",
            "It was only after the government and leaders of the tribes negotiated and agreed to end hostilities that the threat to settlers was eventually dispelled."
        ],
        [
            "With the attainment of peace and security in the area, the exodus of settlers to the area increased particularly in the area of Barrio Narra where the future site of Quezon is located.",
            "But the continued influx of settlers into the area increased the demand for basic requirements of residents.",
            "Provincial officials, particularly Representative Delfin Albano of the lone district of Isabela saw the urgency and the need to create a new municipality out of Mallig.",
            "House Bill No.",
            "736 authored by Albano was later approved by the Philippine Senate and President Carlos P. Garcia in 1959 through Republic Act No.",
            "2418.",
            "The name of the municipality was in honor of the President Quezon who was instrumental in the development of the municipality."
        ],
        [
            "Hildebrando Pécson was appointed as the first mayor of the municipality from 1960 until 1967 when after his term limit allowed by law then, he was succeeded by Hermogenes Padilla in the 1967 local elections.",
            "In 1971, Gavino Gascon challenged Padilla and was elected.",
            "In 1976, he was replaced by William Corpuz and was in turn unseated in 1978.",
            "Oniate Tabangcura, a former military officer replaced Corpuz.",
            "When President Ferdinand Marcos was overthrown on 1986 through the 1986 EDSA Revolution, President Corazon Aquino issued and executive order replacing all local executives all throughout the Philippines.",
            "Corpuz was appointed as Officer-In-Charge Mayor.",
            "In 1988 local elections, Gavino Gascon regained his seat as mayor.",
            "He was reelected in 1992 and 1995.",
            "Due to term limit as stated on the 1987 Philippine Constitution and the Local Government Code of 1991, the position of mayor was left as an open race in the 1998 elections.",
            "Lawyer Eduardo Cabantac won as mayor.",
            "He was reelected in 2001 local elections Cabantac was again reelected in 2004 leaving the 2007 elections as an open race again.",
            "Gascon's son Daryl won as mayor in the said election.",
            "Daryl G. Gascon was re-elected in 2010 and again in 2013 for his third and last term.",
            "In 2016, incumbent Vice Mayor Jimmy S. Gamazon Jr. won as Mayor against incumbent Councilor Eduardo R. Cabantac who wanted to reclaim his former post.",
            "In May 2019, Gamazon won unopposed while his running mate lawyer Jesus V. Poquiz, a three-term Councilor, easily won via landslide as Vice Mayor against Councilor Glenn A. Dulig."
        ],
        [
            "Geography"
        ],
        [
            "Quezon is one of the 34 municipalities which comprise the province of Isabela.",
            "Situated in the north-western portion of the province, it is bounded on the north by the municipalities of Santa Maria and Cabagan, on the south by the municipality of Mallig on the east by the municipalities of Delfin Albano and Santo Tomas all within the province of Isabela; and on the west by the Tabuk City in the province of Kalinga.",
            "A landlocked municipality, its absolute location is between 121°32’ to 121°41’ longitude East and 17°14’ to 17°26’ latitude north.",
            "Its municipal center is located 17°18'42.90\"N and 121°36'19.59\"E."
        ],
        [
            "Its main access is the Cagayan Valley National Highway that traverses in a general north–south direction virtually slicing the municipality lengthwise and connects it with other municipalities in Isabela.",
            "To the east lies a provincial road which links Quezon to the municipality of Santo Tomas, Isabela.",
            "Quezon is 58 kilometres (36 mi) from Ilagan, 404 kilometres (251 mi) from Manila, 49 kilometres (30 mi) from Tuguegarao, and 33 kilometres (21 mi) from Tabuk."
        ],
        [
            "Based from the data from the Municipal Accessors Office, Quezon occupies an area of 268.26 km2 or about 2.52% of the total land area of Isabela which is placed at 10,664.4 km2.",
            "The figure was based on the actual tax mapping conducted by the said office.",
            "The same figure was also used in the old town plan of Quezon and was validated by using a digital planimeter.",
            "With this figure, Quezon is the 13th largest of the 34 municipalities of Isabela and the 3rd largest out of the 11 municipalities of District 2 (San Mariano being the largest at 1,469.50 km2, followed by Aurora at 300.56 km2).",
            "It is larger than its neighbors Mallig (133.4 km2) and Roxas (184.8 km2)."
        ],
        [
            "Barangays"
        ],
        [
            "Barangays of Quezon, Isabela"
        ],
        [
            "Quezon is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Poblacion Centro (Settlement 1) consists of Alunan (Southeast Poblacion), Arellano (Northwest Poblacion), Santos (Northeast Poblacion), and Samonte (Southwest Poblacion).",
            "The rest of the barangays are rural barangays."
        ],
        [
            "Barangay"
        ],
        [
            "PSGC"
        ],
        [
            "Urban/Rural"
        ],
        [
            "Abut"
        ],
        [
            "23122001"
        ],
        [
            "Rural"
        ],
        [
            "Alunan (Poblacion)"
        ],
        [
            "23122002"
        ],
        [
            "Urban"
        ],
        [
            "Arellano (Poblacion)"
        ],
        [
            "23122003"
        ],
        [
            "Urban"
        ],
        [
            "Aurora"
        ],
        [
            "23122004"
        ],
        [
            "Rural"
        ],
        [
            "Barucboc Norte"
        ],
        [
            "23122005"
        ],
        [
            "Rural"
        ],
        [
            "Calangigan (Calamagui)"
        ],
        [
            "23122014"
        ],
        [
            "Rural"
        ],
        [
            "Dunmon"
        ],
        [
            "23122013"
        ],
        [
            "Rural"
        ],
        [
            "Estrada"
        ],
        [
            "23122006"
        ],
        [
            "Rural"
        ],
        [
            "Lepanto"
        ],
        [
            "23122008"
        ],
        [
            "Rural"
        ],
        [
            "Mangga"
        ],
        [
            "23122009"
        ],
        [
            "Rural"
        ],
        [
            "Minagbag"
        ],
        [
            "23122010"
        ],
        [
            "Rural"
        ],
        [
            "Samonte (Poblacion)"
        ],
        [
            "23122011"
        ],
        [
            "Urban"
        ],
        [
            "San Juan"
        ],
        [
            "23122015"
        ],
        [
            "Rural"
        ],
        [
            "Santos (Poblacion)"
        ],
        [
            "23122007"
        ],
        [
            "Urban"
        ],
        [
            "Turod"
        ],
        [
            "23122012"
        ],
        [
            "Rural"
        ],
        [
            "Topography and Geomorphology"
        ],
        [
            "The municipal landscape of Quezon is characterized by a mixture of relatively flatlands punctuated at certain points by undulating and rolling terrain, with mountain ranges flanking its eastern and western sides.",
            "The low-lying hills ad surrounding mountains ranges are slightly dissected by intermittent creeks and waterways, which act as natural drainage avenues of accumulated run off water coming from the uplands."
        ],
        [
            "The physiography of the municipality falls into two basic categories: an alluvial plain and a mountainous terrain.",
            "The central plain, where the Poblacion is located, has an elevation of about 100 meters above mean sea level, and is predominantly characterized by low relief and moderately sloping areas.",
            "Three fourths of the town is covered by these flatland which may be considered as a broad alluvial plain with recent depositions and residual soils.",
            "These areas are found sandwiched between the eastern and western uplands as well as on the other side of the Sierra Madre foothills."
        ],
        [
            "The south-western portion is characterized by the low-lying hills with undulating and rolling terrain, having elevations ranging from 90 to 120 meters above mean sea level.",
            "These are basically shale and sandstone materials which dominate the Isabela-Kalinga boundary.",
            "The eastern edge, meanwhile forms part of the foothills of the major mountain range in the area and dominates the eastern flank of Quezon.",
            "This high relief area has peak elevations of up to 200 meters above mean sea level and is composed primarily of volcanic rocks."
        ],
        [
            "Soil system"
        ],
        [
            "Quezon is a predominantly agricultural area."
        ],
        [
            "Pedologic surveys conducted by the Bureau of Soils Management of the Philippine Department of Agriculture have identified two major soil series or categories in Quezon.",
            "These road categories are the Bago Sandy Clay Loam and the San Juan Clay.",
            "The San Juan Clay is extensively distributed covering about 113.94 km2 or about 60 percent of the municipality.",
            "It offers excellent potential for such agricultural land use like onchards, commercial forest, woodland and pasture/ grazing lands.",
            "The Bago Sandy Clay Loam on the other hand, covers about 75.96 square kilometres (29.33 sq mi) or bout 40% of the municipality.",
            "This particular type of soil is devoted to lowland rice farming."
        ],
        [
            "Ground water and geologic formations"
        ],
        [
            "The assessment of the ground water resources by the Philippine National Water Resources Board in the entire province of Isabela was based on existing data on geologic formations, topography, ground surface elevations, precipitation and groundwater levels, all of which are available from the files of various agencies."
        ],
        [
            "Based on the study, Quezon is classified into two categories namely: deep and shallow well areas.",
            "Shallow well areas generally consist of recent formations with slopes ranging from zero to three percent.",
            "Most of these areas are located at elevations within 50 meters above mean sea level, like alluvial and coastal plains and river valleys.",
            "Shallow wells may also have deep-water aquifer and are less susceptible to salt water intrusion.",
            "Deep well areas generally consist of sedimentary formations, 90 percent of which are water carriers, These are usually located in slopes reaching up to 10%, usually at elevations of more than 50 meters above sea level.",
            "The waters from deep wells are in general, of good quality."
        ],
        [
            "Almost the entire portion of Quezon is classified as deep well area with a small portion of barangay Barucboc, having the lowest point of elevation in the entire municipality, belonging in the shallow area.",
            "Quezon s underlain with sedimentary rock formations the dominant being recent depositions of alluvium.",
            "This covers much of the municipality except in the Barucboc-Estrada area which is underlain with sandstone.",
            "The unconsolidated nature of the sandstone layers in these areas could account for the relatively shallow depth to the water data, since in general sandstones’ permeability allow good infiltration of water."
        ],
        [
            "Existing general land use pattern"
        ],
        [
            "Clustered development influenced considerably by a grid-iron pattern of road network characterizes the existing land use pattern.",
            "Built up areas, which include residential, commercial, institutional areas, parks and open spaces are sporadically located in the 15 barangays including the Poblacion, namely Arellano, Samonte, Santos and Alunan, which comprise the town proper.",
            "The total built up areas has an aggregate area of 8.79 km2 or 5% of the total land area of the municipality."
        ],
        [
            "Agricultural land cover approximately 175.52 square kilometres (67.77 sq mi) or 65% of the total land area.",
            "Included are rice, corn, tobacco lands, lands devoted to vegetables, peanuts, fruit trees and other crops."
        ],
        [
            "Open grasslands cover approximately 76.13 square kilometres (29.39 sq mi) or 28% of the total; however, only a small portion of these are actually being utilized as grazing/ pasture lands while a major portion is left idle."
        ],
        [
            "Forest lands cover approximately 6.71 square kilometres (2.59 sq mi) or 2.5% of the total area and these are located on the eastern portion of the municipality.",
            "While the land classification indicates a vast timberland areas of more than 36 square kilometres, these do not appear to be based on the actual land use but rather on tenurial status.",
            "That is, public lands are generally termed timberland areas.",
            "Water bodies like rivers and creeks occupy an aggregate area of approximately 2.54 square kilometres (0.98 sq mi) or about 1% of the total land area of the municipality."
        ],
        [
            "Land resources in Quezon could be described as somewhat underutilized given its vast potential for agro-industrial development."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Quezon, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31.2(1.23)"
        ],
        [
            "23.0(0.91)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "28.1(1.11)"
        ],
        [
            "113.5(4.47)"
        ],
        [
            "141.4(5.57)"
        ],
        [
            "176.4(6.94)"
        ],
        [
            "236.6(9.31)"
        ],
        [
            "224.9(8.85)"
        ],
        [
            "247.7(9.75)"
        ],
        [
            "222.9(8.78)"
        ],
        [
            "178.0(7.01)"
        ],
        [
            "1,651.4(65.02)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "144"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Using the corona classification scheme, the Philippine Atmospheric, Geophysical and Astronomical Services Administration (PAGASA) has classified the climatic type of Quezon belonging to Type III category.",
            "Type III climate is characterized by two seasons which are not very pronounced; a relatively dry season which lasts for an average of five months from December to April, and a wet season from May to November with maximum rain periods towards the last quarter (September to November).",
            "This classification system is based on precipitation levels rather than on temperature ranges because the tropical location of the Philippines prevents any significant fluctuation in temperature readings."
        ],
        [
            "Although the Sierra Madre flanks boundaries of Quezon, the predominance of relatively flat to moderately sloped area and the absence of imposing peaks prevent orographic precipitation.",
            "Quezon, however, is exposed to the monsoonal wind systems and periodic typhoons is a permanent feature."
        ],
        [
            "Rainfall"
        ],
        [
            "As observed and recorded at the Agro-Meteorological station located in Minanga, Iguig, Cagayan, the town received an annual rainfall of 1,572.4 millimetres (61.91 in), 92.3 percent of which occurs from May to November.",
            "Maximum rainfall of 309.2 millimetres (12.17 in) occurs in October, while minimum rainfall of 3.4 millimetres (0.13 in) occurs in February."
        ],
        [
            "Temperature"
        ],
        [
            "Diurnal variations in temperature readings are minimal, with an annual average of 26.9 °C (80.4 °F).",
            "The hottest month of the year is April with an average of 29.9 °C (85.8 °F).",
            "Temperature extremes however, may dip as low as 13.6 °C (56.5 °F) in January, and may climb to as high as 38.4 °C (101.1 °F) in April."
        ],
        [
            "Relative humidity"
        ],
        [
            "The constantly high temperature promotes evaporation in the area which in turn results in humid conditions.",
            "Sparingly does the humidity level drop below 69.4 percent which is the minimum level during the month of October, even as it peaks to 94.3 percent during the month of December.",
            "The annual average is a high 85.9 percent."
        ],
        [
            "Demographics"
        ],
        [
            "Population"
        ],
        [
            "Population Census of QuezonYearPop.±% p.a.1960 5,797—    1970 7,271+2.29%1975 8,225+2.50%1980 9,820+3.61%1990 16,280+5.19%1995 17,617+1.49%2000 20,090+2.86%2007 22,050+1.29%2010 24,522+3.94%2015 25,860+1.02%2020 27,037+0.88%Source: Philippine Statistics Authority"
        ],
        [
            "The population grows tremendously.",
            "During the census of 1960, one year after its creation as a municipality, Quezon had a population of only 5,797.",
            "Its population increased to 7,271 in 1970 and 8,225 in 1975 with an annual growth of 2.25% and 2.49% respectively.",
            "The tremendous increase of population began in 1975 to 1980 where population grows to 9,820 or 3.61% growth rate.",
            "Between the 1980s and 1990s, its population grew by 16,280 with an annual growth of 5.18%.",
            "Such an increase may be attributed to natural increase and influx of migrants particularly land seekers coming from various provinces (mainly from nearby Kalinga) with the operation of Chico River Irrigation System in 1983 that propelled the agricultural boom of Quezon.",
            "Population growth between 1990 and 1995 slowed down to 1.59% with 17,617 on record.",
            "The growth rate between 1995 and 2000 regained an increase of 2.66% when the local economy improved due to the concreting of the national highway and the increased remittances of its Overseas Filipino Workers (OFWs) working as either professionals or skilled workers in various fields in the Middle East, USA, Canada, London (UK), Hong Kong or Singapore."
        ],
        [
            "In the 2000 census of population by the Philippine Philippine Statistics Authority, the municipality has a population of 20,090.",
            "This was about 1.56% of the total population of Isabela which were 1,287,575 for the same year.",
            "In 2004, the municipal population office recorded a total population of 21,669 composed of 4,437 households.",
            "The average household size of Quezon is 4.98 while the province of Isabela has an average household size of 5.05."
        ],
        [
            "As of 2004, gross population density for the entire municipality was placed at 81 people/km2.",
            "Urban gross density was 144 people/km2 while rural gross density was 65 people/km2.",
            "Comparing with provincial density, the province of Isabela with its area of 10,408.9 km2 and population of 1,287,575 as of 2000 census, has a gross density of 124 people/km2."
        ],
        [
            "Urbanity"
        ],
        [
            "The level of urbanization of Quezon is relatively low.",
            "About 36% of its total population in the year 2004 was found in the urban barangays.",
            "The rest of the municipality's population resides in the rural barangays."
        ],
        [
            "In Quezon, the Poblacion area was a major settlement area.",
            "Poblacion area was subdivided into four barangays namely Alunan, Arellano, Samonte and Santos.",
            "There are also other major settlement areas located the Poblacion namely Abut, Minagbag and Barucboc, all traversed by the national highway."
        ],
        [
            "Age and sex structure"
        ],
        [
            "The municipal sex ratio is 1.06.",
            "This indicated that there were 106 males to 100 females.",
            "Majority of the population of Quezon is at the working age.",
            "As of 2000, Quezon had 56.73% or 11,398 persons belonging to the productive age group, 40% or 8,034 belong to the young age group and 3.27% or 658 belong to the retirement age of 65 years and above."
        ],
        [
            "Ethnicity"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Quezon, Isabela\" – news · newspapers · books · scholar · JSTOR (May 2007) (Learn how and when to remove this message)"
        ],
        [
            "The overwhelming majority of the residents of Quezon belong to the Malay race.",
            "The Han Chinese race compose a tiny minority of the population, most of whom are migrants from north of the Philippines.",
            "The municipality is peopled by a conglomeration of groups that speak several local languages and dialects.",
            "The majority of the population speak Ilocano followed by Pangasinan.",
            "This can be attributed to the fact that most of their forefathers came from Ilocos region and Pangasinan.",
            "In fact, Barangay Samonte in Poblacion is sometimes referred to as \"Little Pangasinan\" of Quezon, Isabela.",
            "Recent data reveal that 87.58% of the total population speaks Ilocano.",
            "Kankanaey and Igorot dialect represent 10.85% of the total population.",
            "This was attributed to the proximity of Quezon to the Mountain Province area and with the opening of Chico dam that made this downstream municipality as its irrigation's beneficiary.",
            "The rest of the household speaks other dialects such as Itawanes, Ibanag and others.",
            "As required in the field of commerce and education.",
            "Most residents are multi-lingual with Tagalog and English as their secondary and tertiary mode of communication."
        ],
        [
            "Religion"
        ],
        [
            "An estimated 61.22 percent of the municipal population were Roman Catholics.",
            "This was followed by the Philippine Episcopal Church, Philippine Independent Church and Iglesia ni Cristo.",
            "Other religious sects in the municipality were Lutherans, Methodist, Baptist, Jehovah's Witnesses, and Crusados.",
            "Small portion belong to the indigenous tribal religions."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Quezon"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  21.40"
        ],
        [
            "2009  23.81"
        ],
        [
            "2012  24.20"
        ],
        [
            "2015  18.03"
        ],
        [
            "2018  22.73"
        ],
        [
            "2021  17.38"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The economy of Quezon is made up of agriculture (primary), industry (secondary) and services (tertiary) sector.",
            "These sectors represent the different groups of economic activity.",
            "In most cases, these sectors are interlinked.",
            "One sector supports one or more sectors and vice versa.",
            "The performance of one sector depends greatly on its linkages with other sectors besides its own viability.",
            "This has a significant bearing on the sustainability of employment, an important indicator to measure the performance of a specific sector in particular and the economic status of the municipality in general."
        ],
        [
            "Local trade and industry"
        ],
        [
            "Trade and commerce"
        ],
        [
            "Carinderias are one of the major business establishments in Quezon."
        ],
        [
            "The commercial activity in Quezon is concentrated within and around the perimeter of the Public Market.",
            "It is the primary source of staple and convenience goods and services for the Poblacion and neighboring barangays.",
            "In the public market and around the commercial district are retail and wholesale trade, small-scale restaurants (carinderias), videoke bars, mini-stores (sari-sari stores) and a number of other businesses of trading establishments."
        ],
        [
            "The public market in the Poblacion area is considered as the economic center of Quezon.",
            "A well-paved Cagayan Valley Highway connects it to Santiago City in Isabela and Tuguegarao City in the Cagayan province.",
            "Moreover, it is connected to other barangays of the municipality by municipal and barangay roads."
        ],
        [
            "The majority of the mini-stores (sari-sari stores) are established near the roads sporadically spread in many barangays of Quezon.",
            "Most stores are characteristically just an extension of the main house.",
            "Many of the small booths of wood are galvanized with nipa roofing.",
            "They are situated near the house of the owner.",
            "In many cases, these stores are attached to residential structures."
        ],
        [
            "According to the records of the mayor's office, there are about 290 business establishments operating in the municipality.",
            "Of this number, 198 or approximately 68.2% are sari-sari stores.",
            "The rest are small-scale restaurants (carinderia), bakeshops, grocery shops and other service-oriented business establishments,"
        ],
        [
            "The municipality is basically a goods-consuming community wherein most of business enterprises sell a variety of products for daily consumption of local residents.",
            "Practically all barangays have varying numbers of sari-sari stores with Arellano, Barucboc, Minagbag, Abut, Lepanto, Alunan, and Santos having the most."
        ],
        [
            "Aside from the ambiguity of mini-stores (sari-sari stores), Quezon is also known for its thriving balut industry, Out of a total of 290 establishments, 15 are into balut production.",
            "There are only two barangays where this particular activity is found and these are Minagbag in the north and Alunan in the south.",
            "Since the most dominant economic activity in the area is rice farming it would do the farmers well if they could venture into this type of enterprise since this will provide additional income for them."
        ],
        [
            "Industry"
        ],
        [
            "There are also industries, which transform raw materials into final goods.",
            "These industries include a vinegar factory and a wood, and bamboo furniture and hut processing plant in barangay Santos, as well as rattan shop in Barucboc.",
            "Another major observation that can be obtained from the distribution of business enterprises in the municipality is the presence of activities that caters to the needs of the agricultural sector or the personal needs and requirements of residents.",
            "For instance, there are four business activities concentrated in barangay Arellano, which supply agricultural equipment from nearby municipalities such as Mallig and Roxas.",
            "This condition is brought about by the fact that some farmers especially in barangays quite distant from the Poblacion such as Turod and Barucboc have accessibility problems.",
            "It was learned also that some business establishments in nearby municipalities provide financial assistance to these farmers, which make farmers gravitate toward these other centers.",
            "To cater to the personal needs of the local residents, there are a number of business activities, which provide such services as photo supplies, beauty parlors and video rentals."
        ],
        [
            "There are 31 industrial establishments in operation within the municipality.",
            "These are categorized as agro-industries, manufacturing or service-oriented industries.",
            "The concentration of industrial activities is in grains processing.",
            "There are 10 rice mills (kiskisan) operating within the municipality.",
            "These projects are categorized as agro-industries."
        ],
        [
            "In manufacturing, the significant activities include furniture making, ironworks and hollow blocks making.",
            "Furniture making however is very much affected by the imposition of log ban in the Philippines.",
            "Other activities include vulcanizing shops, welding shops and bakeries."
        ],
        [
            "Financial institutions"
        ],
        [
            "Agriculture-based lending institution of the municipality includes the Mallig Plains Rural Bank, PRBank and Rural Bank of Benito Soliven located at the Poblacion as well as Epiphany MPCI located at Barangay Abut.",
            "Residents also access the financial facility of nearby Roxas, Isabela such as the Land Bank of the Philippines, Philippine National Bank, Banco de Oro and Ficobank.",
            "Palay-buying stations also provide financial support to farmers and individual household."
        ],
        [
            "Agriculture"
        ],
        [
            "Crop production"
        ],
        [
            "The municipality of Quezon is primarily an agricultural community.",
            "Majority of the population depends upon agriculture for their livelihood and income.",
            "The office of the municipal agriculturist reveals that there was a total of 58.17 km2 of agricultural lands.",
            "Of this area, 50.75 km2 are devoted to rice production with 45.84 km2 being irrigated and 4.91 km2 unirrigated.",
            "Other crops grown include corn and vegetables as well as commercial crops like mango, citrus, coconut and banana."
        ],
        [
            "Rice production"
        ],
        [
            "Production records reveal that the palay production of the municipality reached an aggregate total of 27,176 metric tons or 543,520 cavans.",
            "The bulk of the palay produced came from the irrigated rice lands with a total population of 25,212 metric tons or 504,240 cavans.",
            "Average yield was 5.5 metric tons or 110 cavans per hectare for irrigated lands and 4.0 metric tons or 80 cavans per hectare for rain fed areas.",
            "Value wise, the total palay production with a farm gate price of 10 pesos per kilogram amount to not less than 252.12 million.",
            "The average yield has been computed in dry weight basis of 14% moisture content and the weight per cavan of 50 kilograms."
        ],
        [
            "Corn production"
        ],
        [
            "Corn is the secondary source of cereal requirement of the municipality.",
            "The aggregate area planted to corn according to the data supplied by the municipal agricultural office is 7.16 km2 or 12.3% of the total agricultural area of the municipality.",
            "For 2004, the total production of corn reached 3,222 metric tons or 64,440 cavans with an average yield of 4.5 metric tons per hectare or 90 cavans per hectare.",
            "This is valued at around 22.5 million with a farm gate price of 7.50 per kilogram.",
            "The average yield has been computed in dry weight basis of 14% moisture content."
        ],
        [
            "Vegetables"
        ],
        [
            "The agricultural data also revealed that vegetables are also grown in farms and the household backyard.",
            "The total area planted is 10.5 hectares.",
            "Vegetables include eggplant, ampalaya, tomato, sweet potato, upo, beans, gabi, and pechay, okra, kalabasa, and mongo."
        ],
        [
            "Fruit trees"
        ],
        [
            "There are around 20.5 hectares occupied by fruit trees in the whole municipality of Quezon.",
            "These are commonly planted at the household backyards such as banana, caimito, tamarind, papaya, avocado, guava, and other common fruit trees."
        ],
        [
            "Livestock and poultry"
        ],
        [
            "Residents catch fish within the rice fields during the pre-harvest season."
        ],
        [
            "The types of livestock raised in the 15 barangays of Quezon include carabao, cattle, hog, goat, and horse.",
            "Except for some cattle at Abut, Callanguigan and Minagbag as well as carabaos at Minagbag where animals are raised for sale, these animals are used more as work animals in tilling the land for agricultural and hauling farm products.",
            "These big animals (3,812 heads for cattle and 2,627 heads for Carabao) are grown/ maintained more as farm-helps rather than for commercial purposes.",
            "Some cattle however are good source of fresh milk and meat for local consumption.",
            "The work animals play an important role in land preparation for planting crops and hauling products especially those families who can't afford to buy hand tractors."
        ],
        [
            "The hogs and goats numbering 7,664 and 977 respectively serve as part of the livelihood for additional income and supplementary source of protein for local residents.",
            "It is seldom that hogs and goats are sold in commercial scale outside the municipality.",
            "Only few barangays keep horses.",
            "These animals are mostly found in barangays Abut and Lepanto.",
            "They are used for transporting farm produce and as a means of transporting some residents.",
            "All barangays kept dogs as house pets.",
            "In the 15 barangays, there are a total of 4,615 dogs."
        ],
        [
            "On the other hand, poultry which is composed mostly of native chicken and duck species, are not grown in commercial quantity.",
            "Except for barangay Estrada and Minagbag where some ducks are branded in the farm as layers, the poultry products are intended for local consumption only.",
            "While a number of household sell some of the birds to their neighbors and the local town market to supplement family income, most are limited to family consumption."
        ],
        [
            "Fishery"
        ],
        [
            "Some farms in almost all barangays are engaged in tilapia culture through backyard fish pen as their supplementary source of food and income.",
            "There are around 15 hectares of backyard fish pens and 28.5 hectares of commercial fishing grounds along the river, dam and creeks."
        ],
        [
            "A good potential source of food protein and supplementary income, fish culture, not only tilapia species must be encouraged, Fish are grown together with palay on rice fields with sustained irrigation water through rice-fish culture schemes.",
            "Some species such as mudfish and catfish can be raised even without any input or feeding as long as there is adequate water."
        ],
        [
            "Facilities and services"
        ],
        [
            "Irrigation"
        ],
        [
            "The National Irrigation Administration serves the irrigated rice land of the municipality.",
            "About 86% of the 45.3 km2 are being covered by the agency while local community irrigation system, improvised water pumps serves the remaining 14%.",
            "Of this total irrigated rice lands, around 47 km2 are planted twice a year while the remaining area are only planted once a year."
        ],
        [
            "Farm mechanization"
        ],
        [
            "Most of the farmers in Quezon are using hand tractors in the process of land preparation.",
            "There are 4 four-wheel tractors and 1,417 hand tractors (kuliglig) in the municipality making a ratio of 1 hand tractor for every 3.5 hectares.",
            "The hand tractors, when attached to a trailer, is being used as means of transporting goods and people within the municipality."
        ],
        [
            "Post-harvest facilities"
        ],
        [
            "The distribution of post harvest facilities shows that barangays Abut and Barucboc has more rice mills than the other barangays.",
            "In addition, the existence of more threshers in Barangay Barucboc reveals that most primary processing is done in these areas and produces more palay than the other barangays.",
            "There are 164 threshers and 16 rice mills in the municipality.",
            "Most of the barangays utilize the barangay paved basketball court as multi-purpose dryer.",
            "There are 50 solar dryers in the municipality.",
            "Mechanized reapers were introduced and proved to be beneficial to farmers and tenants specially when it is rainy during harvest season or when there are many rats and birds."
        ],
        [
            "Marketing and storage facilities"
        ],
        [
            "The municipality has attained sufficiency in rice and producing more than the food requirement of its total population.",
            "In excess of the palay reserved for consumption, the farmers usually sell their palay to private buyers and the state National Food Authority in the municipality and other neighboring municipalities.",
            "Most of these buyers are businessmen who own warehouses to store these purchased products as well as milling facilities’ for processing."
        ],
        [
            "Cooperatives and other services"
        ],
        [
            "Aside from the agriculture reform and modernization program of the Department of Agriculture other agencies such as the National Irrigation Administration, Department of Agrarian Reform and cooperatives extend to farmers other services to develop and harness to the maximum the agricultural potentials of the municipality.",
            "The agricultural technologists of the municipal agricultural office provide extension and other related services in order to boost farm production in the municipality."
        ],
        [
            "Forestry"
        ],
        [
            "Based from the record of the Department of Environment and Natural Resources, the municipality of Quezon has a forest zone of 36 km2.",
            "Quezon had 153.9 km2 of alienable and disposable lands.",
            "However, most of these areas are actually open grasslands and denuded.",
            "Only a few areas are planted with trees as a result of reforestation projects in the past."
        ],
        [
            "In response to these concerns the DENR as implemented the Integrated Social Forestry Project, covering around 7.1 km2.",
            "These projects are located at the barangays Santos, Abut, Minagbag where there a number of families living in the uplands.",
            "Aside from reforestation projects, which involved the rejuvenation of forestlands, Quezon is also host to a number of Forest Land Grazing Lease Agreement.",
            "Records show that there are four FLGLA entered into by the DENR with private individuals to around 9.12 km2."
        ],
        [
            "Infrastructure"
        ],
        [
            "Roads"
        ],
        [
            "Santiago–Tuguegarao Road 22 km.",
            "of which is straight, with no left or right turns."
        ],
        [
            "An earth filled barangay road."
        ],
        [
            "Roads in Quezon are classified into four: national, provincial, municipal and barangay roads.",
            "The total road network is 146.56 kilometers.",
            "Out of the total length, about 25 kilometers are classified as national roads, 10.89 kilometers as provincial roads, 60.75 kilometers as municipal roads and 49.92 kilometers as barangay roads.",
            "The inventory of existing road showed that of the total length of road, only about 38.64 kilometers or 17.06% is made of concrete, 74.79 kilometers or 51.03% is gravel and 33.13 kilometers or 22.61% is made of earth filled roads."
        ],
        [
            "The Santiago–Tuguegarao Road, also known as the Cagayan Valley National Highway, spans a contiguous length of 25 kilometers, which traverses through the center of Quezon and bisects the town.",
            "This is the main artery of Quezon and demonstrates a linear pattern.",
            "The southern end connects Quezon with adjacent municipality of Mallig, while the northern extension provides the link to the municipalities of Cabagan and Santa Maria.",
            "The Isabela-Kalinga Road links the municipality west to the province of Kalinga through its capital Tabuk City.",
            "A provincial road is being constructed and it will link the municipality east to the municipality of Santo Tomas.",
            "All access roads to all the 15 barangays in Quezon connects to this national highway making it a most vital component in the development of the municipality.",
            "The municipal roads are characterized by a grid pattern.",
            "The barangay roads exhibit a combination of linear and grid pattern."
        ],
        [
            "Transportation routes"
        ],
        [
            "The transportation routes and nodes attend to the need of commuters plying the major routes such as regular mini-buses plying Tuguegarao City to Santiago City and vice versa through the Santiago-Tuguegarao Road almost in every hour frequency.",
            "There are also air conditioned buses which plies the Appari – Tuguegarao – Manila and Tabuk – Manila route.",
            "These include G.V.",
            "Florida Liner, Victory Liner, AutoBus Lines, and Ballesteros Transit.",
            "Regular or ordinary buses ply the route from Tabuk to Baguio such as GL Trans and Emmanuel Trans.",
            "Asian Utility Vans (AUV) and jeepney are also available.",
            "From Manila, one can take commercial flight to Tuguegarao City, Cagayan or to Cauayan, Isabela.",
            "Flying time is about an hour then take the land transportation either by bus or mini-bus that will bring you to this municipality.",
            "Cebu Pacific and Air Philippines fly daily in the Manila-Tuguegarao route; Cebu Pacific flies three times a week (Monday, Wednesday, Friday) in the Manila-Cauayan route."
        ],
        [
            "Communication"
        ],
        [
            "The municipal hall and a cellular relay station."
        ],
        [
            "Internet Connection"
        ],
        [
            "Although there is no internet connection in this municipality yet, people resort to Smart Broadbands and Globe Tattoos.",
            "DG Computer Net Cafe, located at Alunan, Quezon, Isabela, serves as the primary source of the town's social connectivity."
        ],
        [
            "Cellular mobile phones"
        ],
        [
            "The construction of cell site towers of Globe Telecom and Smart Communications in the municipality has made communication in Quezon at par with global standards.",
            "Quezon is now linked with the rest of the Philippines and throughout the globe through their mobile phones.",
            "The cell site of Globe Telecom are found at Samonte and Minagbag, while the Smart cell site tower is found at Arellano."
        ],
        [
            "Postal services"
        ],
        [
            "The Philippine Postal Corporation has a postal office in the municipal hall, which also serve as their mail distribution center.",
            "Letters received in the municipality are delivered through the letter carrier.",
            "Some residents take mails to and from the municipal hall.",
            "The post office has an annual average of 15,000 letters incoming and 10,000 letters outgoing.",
            "Aside from processing letters, the post office also renders money orders and selling of postage stamps as part of its service."
        ],
        [
            "TELOF"
        ],
        [
            "The Telecommunications Office of the Department of Information and Communications Technology (DICT) in Quezon extends telephone, telegraph and telegraphic transfer services.",
            "They have one telephone unit intended for commercial use through an operator either for domestic or overseas calls."
        ],
        [
            "Multimedia services"
        ],
        [
            "Quezon can receive regular broadcasting both from AM and FM radio stations from Tuguegarao City, Cauayan and even Manila (through relay stations).",
            "Several AM stations such as Bombo Radyo, DZCV, and DZRH are heard in Quezon.",
            "On visual media, the Poblacion is served by local cable television.",
            "Clear reception of major television networks is only made through Cable TV while ABS-CBN Isabela and GMA-7 are the only TV network accessed through a regular TV antenna.",
            "Print media such as broadsheet newspapers and tabloids are available through some suppliers from Roxas, Tuguegarao City and Manila.",
            "As of today Quezon does not have an available internet connection.",
            "Residents either commute to Roxas or Tuguegarao City to get internet access.",
            "Talks are ongoing with Smart Communications on enable wireless broadband internet in the area."
        ],
        [
            "Power"
        ],
        [
            "The Isabela Electric Cooperative (District II) and the Kalinga Electric Cooperative serve the power supply demand of the municipality.",
            "The barangays of Callanguigan and Lepanto are being served by Kalinga Electric Cooperative since these two barangays are near the boundary of Kalinga and more accessible to their power lines.",
            "Out of 15 barangays of Quezon and around 28% of the total households are not yet served by electricity.",
            "Out of the total 4,347 households, around 3,119 or 71.75% have actual electrical connections.",
            "The remaining household still uses kerosene and oil lamps as their type of lighting in their dwelling units."
        ],
        [
            "Social services"
        ],
        [
            "Various social services extended to the population of a municipality are criteria towards sustainable development.",
            "Sufficient social services and higher productivity lead to a higher quality of living."
        ],
        [
            "Water"
        ],
        [
            "The existing water supply facilities of Quezon are a crude mix of deep and shallow wells with some areas having developed spring catchments as reservoirs.",
            "The Poblacion area is being served by a Level III water system (areas with large water towers).",
            "It covers around the built-up areas of Alunan, Arellano, Samonte and San Juan.",
            "The Level III water system at the Poblacion was made possible through a development loan from the Development Bank of the Philippines and the World Bank.",
            "In the rural areas, there are manually installed shallow wells (pitcher, jetmatic, baby artesian) and deep wells.",
            "There are also four barangays that benefit from the development of spring catchments reservoir sourced at natural springs."
        ],
        [
            "The depth of ground water in Quezon ranges from 80 to 120 feet (24 to 37 m) for most of the barangays with the exemption of Barangay Barucboc where contact may be made within 40 to 60 feet (12 to 18 m).",
            "Based from the survey conducted by the municipal government, there are 406 pitcher type wells, 100 jetmatic pump wells, 30 baby artesian wells, 1,305 individual faucet (level III), 235 deep wells and 7 natural spring reservoirs."
        ],
        [
            "The main irrigation system on which the farmlands of Quezon are dependent upon is the Chico River Irrigation System managed by the National Irrigation Administration.",
            "Of the total coverage, only around 40 km2 (15 sq mi) are irrigated during the dry season.",
            "The un-irrigated areas depend on rainwater and pumped wells for its water supply."
        ],
        [
            "Waste disposal system"
        ],
        [
            "The waste disposal system for domestic waste is either water sealed or pit privy.",
            "According to the municipal health office, there are 3,523 water sealed toilet and 649 pit privy.",
            "There is no municipal wide solid waste disposal system in the municipality.",
            "Domestic solid waste are usually disposed at the designated waste disposal area or burned at the backyard or at an open pit prepared for that purpose.",
            "Considering however that Quezon is a rural municipality, pollution in the community is not a serious problem."
        ],
        [
            "Cemetery"
        ],
        [
            "The municipality has four cemeteries located at Santos, Minagbag and Barucboc.",
            "The two cemeteries located at Santos are owned and maintained by the municipal government while the rest are maintained by the respective barangays where they are located."
        ],
        [
            "Police services and crime rate"
        ],
        [
            "Peace and order situation in the municipality is primarily maintained by the members of the Philippine National Police (PNP).",
            "There is one police station in the municipality which is located at the Poblacion with 19 personnel.",
            "The PNP Quezon is headed by the chief of police with a rank of Police Inspector (equivalent to lieutenant in the military).",
            "The PNP members have specific jobs like investigator, warrant server, finance officer, supply officer, intelligence officer, administrative, radio operator, and other related functions of the office."
        ],
        [
            "Complementing the police force based in the population is the Regional Mobile Group with detachment located at Barangay Abut with 8 personnel.",
            "Also assisting the PNP in the maintenance of peace and order are the local brigades (barangay tanods) in every barangay.",
            "Although lacking in training and experience, the tanods are great help in maintaining peace and order situation in the municipality.",
            "Minor offenses are handled and solved at the barangay level.",
            "Police to population ratio was 1:1140."
        ],
        [
            "Quezon is relatively a peaceful municipality.",
            "The records for the past five years revealed that crimes committed annually are not very alarming.",
            "Total crimes committed were 21 registering a monthly crime rate of 2.3 per 25,000 population.",
            "Almost half of the index crimes committed was homicide and murder."
        ],
        [
            "The recent commissioning of Security Surveillance System - CCTV (Installed and commissioned by CYBERTECH Santiago ) installed in public places plays a key role in crime investigation and disaster management."
        ],
        [
            "Fire protection"
        ],
        [
            "To protect the municipality from fire hazards, there are nine firemen assigned at the Fire Station in Quezon.",
            "The current ratio of firemen to population ratio is 1:2407.",
            "For the past eight years, there have been 10 fire incidents recorded in the municipality.",
            "The types of incidence according to origin were mostly due to negligence.",
            "The total fire fighting force also extends assistance and responds immediately to other units in the province upon request during emergencies."
        ],
        [
            "Housing"
        ],
        [
            "There were 3,851 occupied housing units in Quezon with a total number of 3,887 households, this translated to a ratio of 1.01 households per occupied housing unit or a ratio of 5.22 persons per occupied housing unit.",
            "Most of the occupied housing units were single houses (98.22%).",
            "Duplex and commercial units accounted or 0.96% and 0.13% respectively.",
            "The rest were either agricultural, multi-unit residential, institutional living quarters, or other types of housing units."
        ],
        [
            "Around 47.05% of the occupied housing units had roofs made of galvanized iron/ aluminum.",
            "On the other hand, cogon / nipa / anahaw for the roofs accounted to 49.93%.",
            "Hence, almost half majority of the housing units in Quezon had roofs made up on light materials.",
            "As to the construction materials of the outer walls, 34.45% percent of the occupied housing units 47.59% have bamboo / sawali / cogon / nipa and 7.6 had concrete / brick / stone and wood."
        ],
        [
            "Majority of the housing units needed minor repair or no repair at all.",
            "73.30% of the occupied housing units needed no repair of it needed, with minor repair only.",
            "19.39% need major repair and 3.6% had unfinished construction.",
            "Majority of the occupied housing units were newly built.",
            "40.69% were built in the 2000s (decade), 25.26% from the 1990s and 21.50% before the 1990s."
        ],
        [
            "About three in every five housing units had a floor area of less than 30 square meters.",
            "About 53.9 percent occupied housing units had a floor area of less than 30 square meters, 22.2% had 20 to 29 square meters and 19.73% had 10 to 19 square meters.",
            "The smallest proportion were those with 90 to 199 square meters accounting only to 3.63%.",
            "About nine in every ten households owned/ amortized their housing units.",
            "About 7.33% occupy their housing units for free without consent of the owner, 0.77% rent their housing units and 91.20% own their housing units."
        ],
        [
            "Sports and recreation"
        ],
        [
            "Sports are recreational facilities support integral activities to the social fiber of the municipality.",
            "There are 23 basketball units in the whole municipality.",
            "Basketball is a popular sport in the Philippines and occupy the majority of all sports facilities in the municipality.",
            "It is also observed that there were also 13 videoke bars, 5 video arcades / computer rental shops, 2 resorts and 7 billiard halls."
        ],
        [
            "Additional recreation for children and youths is the computer gaming, where anyone in the town can participate in various games organized by PC rental shops."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipal government of Quezon is headed by the Mayor who exercises general supervision and control over all programs, projects, services and activities of the municipal government.",
            "The Municipal Council (Sanggunian Bayan) serves as the legislative arm of the municipality.",
            "The council is mandated by law to enact ordinances, approve resolutions and appropriate funds for the welfare of inhabitants of the municipality.",
            "The council has 11 members composed of the Vice Mayor as Presiding Officer, eight councilors (Sangguniang Bayan Members) as regular members, the head of the association of barangay captains and the head of Youth Council (Sanggunian Kabataan Federation) as ex-officio members.",
            "The term of office of all local elective officials (except barangay and youth council) elected is three (3) years, starting from noon of June 30 of an election year.",
            "No local elective official shall serve for more than three (3) consecutive terms in the same position."
        ],
        [
            "A barangay is headed by a barangay captain who also serves a common arbiter to judge or decide a dispute among residents.",
            "The barangay council is composed of the barangay captain, who is also the presiding officer and councilors known as kagawads.",
            "The municipality had an association of barangay captains.",
            "The head of the association is known as ABC President and is elected amongst barangay captains in the municipality through a concession or majority vote.",
            "The ABC President automatically earns the rank of municipal councilor as an ex-officio member."
        ],
        [
            "A barangay also has a similar council called Sanggunian Kabataan (Youth Council) composed of members called SK members and one presiding officer called an SK Chairperson.",
            "The municipality has an association of youth councils called the Sangguniang Kabataan Federation.",
            "The head of the association is known as SK Federation President and is elected amongst youth council leaders in the municipality through a concession or majority vote.",
            "The SK Federation President automatically earns the rank of municipal councilor as an ex-officio member."
        ],
        [
            "The municipal hall of Quezon, Isabela."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Quezon Municipal Council(2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative"
        ],
        [
            "Faustino Michael Carlos T. Dy III"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Jimmy S. Gamazon, Jr."
        ],
        [
            "Municipal Vice-Mayor"
        ],
        [
            "Daryl G. Gascon"
        ],
        [
            "Municipal Councilors"
        ],
        [
            "Jheroine D. Gante"
        ],
        [
            "Annaliza M. Dioquino"
        ],
        [
            "Armando L. Lacambra"
        ],
        [
            "Angel B. Killip"
        ],
        [
            "Jimmy S. Gamazon, Sr."
        ],
        [
            "Candido Andumang, Sr."
        ],
        [
            "Jesus D. Poquiz"
        ],
        [
            "Daisy V. Infante"
        ],
        [
            "Congress representation"
        ],
        [
            "Quezon, belonging to the fifth legislative district of the province of Isabela, currently represented by Faustino Michael Carlos T. Dy III."
        ],
        [
            "Healthcare"
        ],
        [
            "The Quezon Infirmary Hospital, Municipal Health Centers 1 and 2 and four barangay health stations basically provide the health and medical needs of the population of Quezon.",
            "The Quezon Infirmary Hospital located at the Poblacion serves the 15 barangays of the municipality and nearby barangays of Tabuk and Rizal in Kalinga Province and Paracelis in the Mountain Province.",
            "The hospital is solely funded by the local government of Quezon.",
            "It has 10 personnel complement which include 1 doctor, 3 nurses, 3 midwives, 2 utility workers and 1 clerk.",
            "The facility accommodates 10 beds for in-patients and offer/delivers health services which fall under primary level."
        ],
        [
            "With total live births of 467 viz-a-viz the total population of 21,669, the crude birth rate is 21.55 or around 22 live births per 1000 population.",
            "The number of medical consultation in Quezon is 2,716 or a consultation rate of 1.253 or 125 per 1000 population seek medical advice."
        ],
        [
            "Crude death rate is 3.18 or 3 deaths per 1000 population."
        ],
        [
            "Education"
        ],
        [
            "Quezon Central School, Quezon, Isabela, Philippines."
        ],
        [
            "The Philippines is one of the countries with high literacy rate.",
            "The literacy rate of the Philippines is 92.31% while literacy rate of Quezon is 91.58%.",
            "Most people in this municipality invest their hard-earned income for the education of their children through farming, employment, small businesses or through the remittances of a family member working abroad.",
            "Due to strong family ties, there is also a practice among children of bigger families on supporting each other to get college education."
        ],
        [
            "The educational needs of Quezon are provided by 12 public schools and one private school.",
            "Public schools are composed of 12 primary and elementary schools and one high school.",
            "The only private school is La Salette of Quezon, which offers pre-school, elementary and high school.",
            "There are no tertiary educational institutions available in Quezon.",
            "However, there is now Mallig Plains Colleges at its southern neighbor Mallig while University of La Salette and Isabela State University both opened their campuses at Roxas, Isabela.",
            "Most High school graduates either take their collegiate and other post-secondary education in Tuguegarao City, Santiago City, Baguio or Manila."
        ],
        [
            "The school going-age population for elementary and secondary and tertiary schools in Quezon totaled is 8,704.",
            "This is further broken down as follows: elementary at 3,799, secondary at 2,372 and tertiary at 2,533.",
            "The school going age population is around 39.5% of the total population.",
            "Enrollment data on elementary and secondary levels reported a total of 5,316.",
            "The total enrollment in the elementary level was 3,589 while the school going age participation rate is 94.47%.",
            "For the secondary level, the total enrollment was 1,727 while the total participation rate was at 72.80%."
        ],
        [
            "Recent development in the Educational System of Quezon, Isabela includes the birth and implementation of ALS (Alternative Learning System).",
            "It is a project of the Department of Education that aims to help Out of School Youths and others to finish their educational endeavor outside the formal institutions of the government.",
            "ALS in Quezon, Isabela was started through the initiative of DALSC Mrs. Ma.",
            "Theresa S. Domingo."
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Primary and elementary schools"
        ],
        [
            "Public"
        ],
        [
            "Quezon Central School"
        ],
        [
            "Abut Elementary School"
        ],
        [
            "Barucboc Elementary School"
        ],
        [
            "Callanguigan Elementary School"
        ],
        [
            "Estrada Elementary School"
        ],
        [
            "Lepanto Elementary School"
        ],
        [
            "Mangga Elementary School"
        ],
        [
            "Minagbag Elementary School"
        ],
        [
            "San Juan Elementary School"
        ],
        [
            "Turod Elementary School"
        ],
        [
            "Aurora Primary School"
        ],
        [
            "Dummon Primary School"
        ],
        [
            "Private"
        ],
        [
            "La Salette of Quezon (Grade School)"
        ],
        [
            "Cavite Bible Baptist Church and Schools- Isabela Branch"
        ],
        [
            "Secondary schools"
        ],
        [
            "La Salette of Quezon, High School (Private)"
        ],
        [
            "Quezon National High School (Public)"
        ],
        [
            "Barucboc National High School (Public)"
        ],
        [
            "San Juan Integrated High School (Public)"
        ],
        [
            "Minagbag High School (Public)"
        ],
        [
            "Notes"
        ],
        [
            "Local Government Report of the Municipality of Quezon 2004-2006, Office of the Municipal Mayor, Quezon, Isabela"
        ],
        [
            "Comprehensive Land Use Plan of the Municipality of Quezon, Municipal Council of Quezon, Isabela"
        ],
        [
            "References"
        ],
        [
            "^ a b \"Republic Acto No.",
            "2418, June 21, 1959 - An Act Creating the Municipality of Quezon in the Province of Isabela\".",
            "Supreme Court E-Library.",
            "Retrieved June 25, 2024."
        ],
        [
            "^  Municipality of Quezon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Salgado, Pedro.",
            "\"The Irraya Missions in Northern and Mid Isabela\".",
            "Cagayan Valley and Easter Cordillera: 1581-1898, Volume I. Rex Publishing.",
            "p. 381."
        ],
        [
            "^ \"Republic Act No.",
            "2418 - An Act Creating the Municipality of Quezon in the Province of Isabela\".",
            "Chan Robles Virtual Law Library.",
            "June 21, 1959.",
            "Retrieved March 2, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Province: Isabela\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Quezon, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved September 14, 2014."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Quezon, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved May 15, 2022."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Quezon, Isabela."
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Quezon at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Republic Act No.",
            "2418: An Act creating the Municipality of Quezon in the Province of Isabela"
        ],
        [
            "Municipality of Quezon"
        ],
        [
            "Places adjacent to Quezon, Isabela"
        ],
        [
            "Rizal, Kalinga"
        ],
        [
            "Cabagan"
        ],
        [
            "Tabuk, Kalinga"
        ],
        [
            "Quezon"
        ],
        [
            "Santo TomasDelfin Albano"
        ],
        [
            "Paracelis, Mountain Province"
        ],
        [
            "Mallig"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Quezon,_Isabela&oldid=1230791389\""
        ],
        [
            "Category: Municipalities of Isabela (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Articles needing additional references from January 2014All articles needing additional referencesCoordinates on WikidataArticles containing Ibanag-language textArticles containing Ilocano-language textArticles containing Tagalog-language textArticles needing additional references from May 2007All articles with vague or ambiguous timeVague or ambiguous time from July 2014Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}