{
    "name": "Quezon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Quezon, Bukidnon"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°43′50″N 125°06′00″E﻿ / ﻿7.7306°N 125.1°E﻿ / 7.7306; 125.1"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Quezon, Bukidnon\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesQuezonMunicipalityMunicipality of QuezonPoblacion, Quezon"
        ],
        [
            "FlagSealNickname: Sugar Capital of BukidnonMap of Bukidnon with Quezon highlightedOpenStreetMapQuezonLocation within the PhilippinesCoordinates: 7°43′50″N 125°06′00″E﻿ / ﻿7.7306°N 125.1°E﻿ / 7.7306; 125.1CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "3rd districtFoundedJune 18, 1966Named forManuel L. QuezonBarangays31"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPablo M. Lorenzo III • Vice MayorJoseph T. Durotan Sr. • RepresentativeJose Ma.",
            "R. Zubiri Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Robert T. GueJerly L. ArejaRestituto R. BaguioJose Miguel S. FortichTeresita B. LeonardoRodrigo N. Neri Jr.Nilo P. BardonMyrna D. Repalda"
        ],
        [
            " • Electorate68,376 voters (2022)Area • Revenue₱ 425.3 million (2020) • Assets₱ 1,018 million (2020) • Expenditure₱ 355.7 million (2020) • Liabilities₱ 304.7 million (2020)Service provider • ElectricityFirst Bukidnon Electric Cooperative (FIBECO)Time zoneUTC+8 (PST)ZIP code8715PSGC101317000IDD : area code +63 (0)88Native languagesBinukid Cebuano Ata Manobo TagalogWebsitequezonbukidnon.gov.ph"
        ],
        [
            "Quezon, officially the Municipality of Quezon (Cebuano: Lungsod sa Quezon; Tagalog: Bayan ng Quezon), is a 1st class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 109,624 people."
        ],
        [
            "History"
        ],
        [
            "Early 1900s"
        ],
        [
            "Back in the days, this bucolic land that we now know as Quezon in the Province of Bukidnon was a vast ocean of grassy fields gently rising to verdant mountains.",
            "The nomadic Manobo tribe sparsely populated the area and lived mostly along riverbanks, around the edges of thickly-forested hills or near lush watersheds which Quezon is abundantly blessed with.",
            "Blissfully, the tribesmen foraged for most of their needs and relied mainly on the abundance of nature.",
            "For all their other needs such as salt and clothing, they traded abaca, preserved meat, and beeswax with neighboring communities within the province."
        ],
        [
            "In the early 1900s, the ranching settlers arrived and raised cattle in the sprawling grasslands that stretched across the western part of Quezon."
        ],
        [
            "After the Second World War, an influx of migrants from other parts of the country such as the neighboring province of Misamis Oriental and the islands of Bohol, Cebu, and Ilocos from up north began arriving in Quezon.",
            "Both Manobos and settlers lived harmoniously with each other.",
            "There was an abundance of food and the residents had everything they needed to make a living from – rice, corn, coffee, vegetables, meat, rubber, coconut, and even fiber.",
            "Whatever surplus they had they would haul in rafts across the Pulangui River in Opalon and trade them with neighboring communities.",
            "Migrants entered Quezon through the same route as there were neither roads nor bridges back then."
        ],
        [
            "The Middle of the Century"
        ],
        [
            "Quezon, then called Barangay Kiokong of the Municipality of Maramag, saw its first major economic breakthrough in the middle of the 20th century.",
            "Don Jose Fortich, one of the first ranching settlers to set up home in the area, put up the biggest rice and corn mill right in the center of Quezon’s would-be commercial district.",
            "In 1957, a bailey bridge was built over the Pulangui River, connecting Barangay Kiokong to its mother Municipality to the west and increasing the inflow of migrants even more.",
            "Foreign investors entered Quezon and pioneered the logging industry, which cleared a majority of the arable plains that became available for the expansion of farmlands.",
            "Bida Timber Corporation established the timber industry in what is now known as Barangay Dumalama."
        ],
        [
            "Shortly thereafter, another logging company, NAREDICO, opened up for business.",
            "The latter is known to have had the biggest saw mill in the history of Quezon, harvesting forest resources from Salawagan, San Roque, Linabo, and Gamot, all the way to the boundary between Quezon and the Municipality of San Fernando.",
            "Logging operations lasted for so many years, until it dwindled and made way for the construction of the Bukidnon-Davao Road that opened for better economic opportunities for the residents of Quezon."
        ],
        [
            "The Birth of the Municipality"
        ],
        [
            "Through the efforts of community leaders who aspired for self-sustainability and develop their own natural resources, Quezon became a Municipality in 1966.",
            "From Barangay Kiokong of the Municipality of Maramag, it was officially recognized as the Municipality of Quezon by virtue of R.A. 4802."
        ],
        [
            "The 1970s"
        ],
        [
            "With the construction of the Bukdinon-Davao (BuDa) Road underway, public transportation from the Municipality of Maramag to Calinan in Davao became available and migrants from Davao Region started coming in.",
            "The population reached new heights due also to the deluge of settlers from Lanao Region.",
            "The conflict between Christians and Muslims in the area forced Christians to seek safety in other places and Quezon was one of their safe havens."
        ],
        [
            "In 1974, the sugar industry took root in Quezon with the construction of the first sugar mill in the province.",
            "Bukidnon Sugar Milling Company or BUSCO had its first milling season in 1976 and received sugar cane from small farmers all over the province.",
            "Its operations gave rise to other industries and provided local employment to many.",
            "The developing economy also brought forth the growth of banking and financial institutions.",
            "Traders Royal Bank (TRB) was the very first bank to have been built in Quezon and it served both big and small farmers in the locality."
        ],
        [
            "The 1980s"
        ],
        [
            "If the 1960s through the 1970s were the golden days of Quezon, when both locals and settlers lived harmoniously with each other and people had everything they ever needed, the 1980s were its twilight; when economic progress and the peace situation was at a low ebb.",
            "About the same time that the 1987 Philippine Constitution was proclaimed in force, the locals that lived then and are still alive today look back to days of disquietude.",
            "Some disgruntled groups of individuals disturbed the status quo and spread malice in the streets.",
            "Their activities decelerated economic progress and imperiled the peace and order in the municipality."
        ],
        [
            "The Turn of the Century"
        ],
        [
            "Sugarcane was the most important crop that shaped Quezon’s modern economy.",
            "For more than four decades since its inception, the sugar industry dominated Quezon’s economy and provided employment to locals, until the advent of the pineapple industry in the early 21st century.",
            "Davao Agri-Ventures Corporation, Inc. or DAVCO is the first private corporation to grow pineapples in the Municipality, followed by Del Monte Philippines, Inc. which built its fresh fruit packing house in barangay San Jose sometime in 2008."
        ],
        [
            "The turn of the century brought about significant changes to the community.",
            "Advances in information and communications technology, the modernization of agricultural practices, and improved local governance dramatically changed the way the locals lived.",
            "From the increase in the number of cellular sites, the arrival of multi-national corporations to the automation of the electoral process, the citizens of the once laidback town of Quezon gradually learned to keep up with the rest of their peers in the region."
        ],
        [
            "Despite its being a first-class municipality, Quezon took some time to move forward with its development goals on account of the precarious peace situation in the area.",
            "Due in part to its mountainous topography, Quezon had been an ideal hotbed of communist movements that infiltrated the local government since the mid-1980s.",
            "The latter’s presence hampered progress and threatened the lives and properties of both local and foreign investors."
        ],
        [
            "Moving Forward"
        ],
        [
            "In 2016, the passage of several national laws drastically improved the country’s peace process and addressed long-standing social issues, allowing the town to surge onward.",
            "By virtue of Executive Order No.",
            "70 s. of 2018, “Institutionalizing the Whole-of-Nation Approach in Attaining Inclusive and Sustainable Peace…” more popularly known as the End Local Communist Armed Conflict (ELCAC) Program of the national government, the Municipal Government of Quezon, under the administration of Hon.",
            "Mayor Pablo Lorenzo III tenaciously pushed for the efficient delivery of basic government services to far-flung areas and intensified its efforts to end the local communist armed conflict."
        ],
        [
            "Through effective governance, a thriving economy, and the cooperation of its resilient and highly-adaptable citizens, the Municipality of Quezon is well on its way to achieving sustainable peace and a brighter, prosperous future for all."
        ],
        [
            "Town Profile"
        ],
        [
            "Socio-economic Profile"
        ],
        [
            "The Municipality of Quezon has a total land area of 71,128 hectares, 33.35% of which is devoted to agricultural use.",
            "Aptly named the Sugar Capital of Bukidnon, the sugar milling industry powers the town’s local economy.",
            "Quezon is also home to Busco Sugar Milling Co., one of the country’s largest sugar mills in terms of milling capacity and sugar milling district.",
            "Busco has helped boost the local economy and has generated thousands of jobs since the 1970s."
        ],
        [
            "While being relatively new in Quezon, the pineapple industry has also flourished.",
            "Del Monte Philippines, Inc., for instance, started its first pineapple operations in the municipality in 2008 and established a fresh fruit packing house in Barangay San Jose shortly thereafter.",
            "Davao Agri-Ventures Corporation, Inc., or DAVCO, also engages in pineapple production within the municipality."
        ],
        [
            "Corn and lowland rice plantations also take up the majority of the total agricultural land area.",
            "The remaining parcels of land dedicated to agricultural use are utilized for growing seasonal crops and vegetables, as well as permanent crops such as coconut and rubber."
        ],
        [
            "Utilizing 3.76% of Quezon’s total land area, cattle production is another local economic driver.",
            "Among the pioneers in this industry are Ozamis Agricultural Development, Inc. (OADI), Kiantig/Fortich Farm (now Kiantig Development Corporation or KDC), Rancho Montalvan Inc. (RMI), in Brgy.",
            "San Jose, and Circle T Farms.",
            "These ranches breed cattle and supply live animals for local consumption and meat retailers in neighboring urban communities and cities.",
            "Small-time cattle and swine farmers also contribute to the local meat industry."
        ],
        [
            "As per the 2014 data, the labor force participation rate is at 73.92%, of which 85.39% are farmers, forestry workers, and fisherfolk; 12.92% are laborers and unskilled workers; 1.29% are employed in government agencies and private corporations; and the remainder of the working group is in the service and sales industry."
        ],
        [
            "Geography and Terrain"
        ],
        [
            "The municipality of Quezon is located at the southern portion of the province of Bukidnon.",
            "It is 55 kilometres (34 mi) from the City of Malaybalay, 149 kilometres (93 mi) from Cagayan de Oro (both via the BUSCO road, bypassing the municipality of Maramag) and 108 kilometres (67 mi) from Davao City."
        ],
        [
            "Quezon with its large chunks of fertile plains, inland valleys and virgin forest, rolling hills and mountain ranges, is bounded in the south by the municipality of Kitaotao; north by the city of Valencia; west by the municipality of Maramag and Don Carlos and east by the municipality of San Fernando."
        ],
        [
            "The municipality of Quezon has a total land area of 71,128.00 hectares per CAD 895-D with 31 barangays.",
            "It represents 6.78% of the total land area of the province of Bukidnon."
        ],
        [
            "Barangays"
        ],
        [
            "Political map of Quezon, showing its 31 barangays"
        ],
        [
            "Former flag of Quezon, unknown date of use"
        ],
        [
            "Former flag of Quezon until 2020"
        ],
        [
            "Former seal of Quezon until 2020"
        ],
        [
            "Quezon is politically subdivided into 31 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101317001   Butong"
        ],
        [
            " 12.1%"
        ],
        [
            " 13,258"
        ],
        [
            " 12,455"
        ],
        [
            "  ▴"
        ],
        [
            " 0.63%"
        ],
        [
            " 101317002   Cebole"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,749"
        ],
        [
            " 1,386"
        ],
        [
            "  ▴"
        ],
        [
            " 2.35%"
        ],
        [
            " 101317003   Delapa"
        ],
        [
            " 2.9%"
        ],
        [
            " 3,191"
        ],
        [
            " 2,904"
        ],
        [
            "  ▴"
        ],
        [
            " 0.95%"
        ],
        [
            " 101317004   Dumalama"
        ],
        [
            " 0.8%"
        ],
        [
            " 925"
        ],
        [
            " 974"
        ],
        [
            "  ▾"
        ],
        [
            " −0.51%"
        ],
        [
            " 101317006   C‑Handumanan"
        ],
        [
            " 0.9%"
        ],
        [
            " 1,002"
        ],
        [
            " 893"
        ],
        [
            "  ▴"
        ],
        [
            " 1.16%"
        ],
        [
            " 101317007   Cawayan"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,184"
        ],
        [
            " 1,108"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 101317008   Kiburiao"
        ],
        [
            " 4.1%"
        ],
        [
            " 4,531"
        ],
        [
            " 4,560"
        ],
        [
            "  ▾"
        ],
        [
            " −0.06%"
        ],
        [
            " 101317009   Kipaypayon"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,726"
        ],
        [
            " 1,308"
        ],
        [
            "  ▴"
        ],
        [
            " 2.81%"
        ],
        [
            " 101317010   Libertad"
        ],
        [
            " 3.1%"
        ],
        [
            " 3,371"
        ],
        [
            " 2,725"
        ],
        [
            "  ▴"
        ],
        [
            " 2.15%"
        ],
        [
            " 101317012   Linabo"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,860"
        ],
        [
            " 1,845"
        ],
        [
            "  ▴"
        ],
        [
            " 0.08%"
        ],
        [
            " 101317013   Lipa"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,158"
        ],
        [
            " 1,106"
        ],
        [
            "  ▴"
        ],
        [
            " 0.46%"
        ],
        [
            " 101317014   Lumintao"
        ],
        [
            " 3.5%"
        ],
        [
            " 3,793"
        ],
        [
            " 3,584"
        ],
        [
            "  ▴"
        ],
        [
            " 0.57%"
        ],
        [
            " 101317016   Magsaysay"
        ],
        [
            " 1.9%"
        ],
        [
            " 2,084"
        ],
        [
            " 1,857"
        ],
        [
            "  ▴"
        ],
        [
            " 1.16%"
        ],
        [
            " 101317017   Mahayag"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,594"
        ],
        [
            " 1,352"
        ],
        [
            "  ▴"
        ],
        [
            " 1.66%"
        ],
        [
            " 101317018   Manuto"
        ],
        [
            " 2.2%"
        ],
        [
            " 2,371"
        ],
        [
            " 2,271"
        ],
        [
            "  ▴"
        ],
        [
            " 0.43%"
        ],
        [
            " 101317019   Merangeran"
        ],
        [
            " 3.7%"
        ],
        [
            " 4,102"
        ],
        [
            " 3,902"
        ],
        [
            "  ▴"
        ],
        [
            " 0.50%"
        ],
        [
            " 101317020   Mibantang"
        ],
        [
            " 2.3%"
        ],
        [
            " 2,475"
        ],
        [
            " 2,178"
        ],
        [
            "  ▴"
        ],
        [
            " 1.29%"
        ],
        [
            " 101317021   Minongan"
        ],
        [
            " 1.8%"
        ],
        [
            " 1,985"
        ],
        [
            " 1,822"
        ],
        [
            "  ▴"
        ],
        [
            " 0.86%"
        ],
        [
            " 101317022   Minsamongan"
        ],
        [
            " 1.0%"
        ],
        [
            " 1,069"
        ],
        [
            " 804"
        ],
        [
            "  ▴"
        ],
        [
            " 2.89%"
        ],
        [
            " 101317025   Paitan"
        ],
        [
            " 3.8%"
        ],
        [
            " 4,177"
        ],
        [
            " 4,050"
        ],
        [
            "  ▴"
        ],
        [
            " 0.31%"
        ],
        [
            " 101317026   Palacapao"
        ],
        [
            " 2.6%"
        ],
        [
            " 2,899"
        ],
        [
            " 2,982"
        ],
        [
            "  ▾"
        ],
        [
            " −0.28%"
        ],
        [
            " 101317027   Pinilayan"
        ],
        [
            " 1.0%"
        ],
        [
            " 1,110"
        ],
        [
            " 987"
        ],
        [
            "  ▴"
        ],
        [
            " 1.18%"
        ],
        [
            " 101317028  Poblacion"
        ],
        [
            " 13.9%"
        ],
        [
            " 15,247"
        ],
        [
            " 13,284"
        ],
        [
            "  ▴"
        ],
        [
            " 1.39%"
        ],
        [
            " 101317029   Puntian"
        ],
        [
            " 2.4%"
        ],
        [
            " 2,653"
        ],
        [
            " 2,542"
        ],
        [
            "  ▴"
        ],
        [
            " 0.43%"
        ],
        [
            " 101317030   Salawagan"
        ],
        [
            " 7.2%"
        ],
        [
            " 7,945"
        ],
        [
            " 7,105"
        ],
        [
            "  ▴"
        ],
        [
            " 1.12%"
        ],
        [
            " 101317031   San Isidro"
        ],
        [
            " 0.7%"
        ],
        [
            " 810"
        ],
        [
            " 779"
        ],
        [
            "  ▴"
        ],
        [
            " 0.39%"
        ],
        [
            " 101317032   San Jose"
        ],
        [
            " 7.0%"
        ],
        [
            " 7,691"
        ],
        [
            " 6,881"
        ],
        [
            "  ▴"
        ],
        [
            " 1.12%"
        ],
        [
            " 101317033   San Roque"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,658"
        ],
        [
            " 1,370"
        ],
        [
            "  ▴"
        ],
        [
            " 1.93%"
        ],
        [
            " 101317034   Santa Cruz"
        ],
        [
            " 2.2%"
        ],
        [
            " 2,442"
        ],
        [
            " 2,159"
        ],
        [
            "  ▴"
        ],
        [
            " 1.24%"
        ],
        [
            " 101317035   Santa Filomena"
        ],
        [
            " 2.3%"
        ],
        [
            " 2,481"
        ],
        [
            " 1,947"
        ],
        [
            "  ▴"
        ],
        [
            " 2.45%"
        ],
        [
            " 101317036   Minsalirac"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,575"
        ],
        [
            " 1,464"
        ],
        [
            "  ▴"
        ],
        [
            " 0.73%"
        ],
        [
            "Total"
        ],
        [
            "109,624"
        ],
        [
            "94,584"
        ],
        [
            " ▴"
        ],
        [
            "1.49%"
        ],
        [
            "Drainage/Water Systems"
        ],
        [
            "The biggest body of water found in the municipality is the Pulangui River.",
            "This is one of the exit paths of drainage systems in urban areas to prevent stagnation of waters during heavy rain."
        ],
        [
            "Boxed Culverts, ripraps and other structures are constructed over and around river crossings in so that the people can safely traverse places around bodies of water and communities are kept safe from flashfloods even when the river levels rise due to natural weather phenomena.",
            "These solutions contribute to a fairly dry and safe municipality."
        ],
        [
            "Climate"
        ],
        [
            "The Philippine Atmospheric Geographical and Astronomical Service Administration (PAGASA) classified the climate of Quezon into the category of the first type.",
            "The dry and wet seasons are pronounced throughout the year.",
            "The warmest months are February, March and April.",
            "The rainy months are June, July, August and September.",
            "It is in the month of January that Quezon populace experience the coldest nights."
        ],
        [
            "Climate data for Quezon, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "21(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "44(1.7)"
        ],
        [
            "27(1.1)"
        ],
        [
            "32(1.3)"
        ],
        [
            "35(1.4)"
        ],
        [
            "76(3.0)"
        ],
        [
            "117(4.6)"
        ],
        [
            "108(4.3)"
        ],
        [
            "108(4.3)"
        ],
        [
            "94(3.7)"
        ],
        [
            "100(3.9)"
        ],
        [
            "76(3.0)"
        ],
        [
            "46(1.8)"
        ],
        [
            "863(34.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.3"
        ],
        [
            "8.1"
        ],
        [
            "8.5"
        ],
        [
            "9.6"
        ],
        [
            "21.0"
        ],
        [
            "24.9"
        ],
        [
            "25.0"
        ],
        [
            "24.2"
        ],
        [
            "22.5"
        ],
        [
            "23.4"
        ],
        [
            "17.7"
        ],
        [
            "11.4"
        ],
        [
            "206.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of QuezonYearPop.±% p.a.1970 38,084—    1975 52,324+6.58%1980 59,819+2.71%1990 70,566+1.67%1995 74,141+0.93%2000 82,567+2.33%2007 91,119+1.37%2010 94,584+1.37%2015 104,116+1.85%2020 109,624+1.02%Source: Philippine Statistics Authority"
        ],
        [
            "The demographic profile of Quezon reveals a total population of 109,624 as of the censal year 2020, with 56.5% concentrated in the urban barangays of Poblacion, Butong, Salawagan, San Jose, Kiburiao, Puntian, Mibantang, and Libertad.",
            "The town has a youthful population, with 62% below the age of 30, indicating a fast-growing community.",
            "Children aged 0 to 14 constitute 35% of the population, while senior citizens make up the smallest share."
        ],
        [
            "Examining the demographic history, Quezon experienced significant growth from 38,084 in 1970 to 52,324 in 1975, driven by migration to the municipality’s fertile lands and industrial firms like Bukidnon Sugar Company and Naredico Logging Company.",
            "However, growth slowed from 1975 to 1980 (2.64%) due to outmigration caused by internal conflicts.",
            "The subsequent decade, 1980–1990, witnessed a further decline in the growth rate to 1.60%, attributed to disturbances in peace and order.Quezon Municipal Hall"
        ],
        [
            "Population by mother tongue"
        ],
        [
            "Tagalog - 471"
        ],
        [
            "Binukid (Higaonon) - 69,008"
        ],
        [
            "Hiligaynon/Ilonggo - 6,498"
        ],
        [
            "Ilocano - 1,338"
        ],
        [
            "Pangasinan - 8"
        ],
        [
            "Waray - 537"
        ],
        [
            "Maranao - 1,050"
        ],
        [
            "Tausog - 289"
        ],
        [
            "Batak - 58"
        ],
        [
            "Binisaya (other) - 8"
        ],
        [
            "Cebuano - 248"
        ],
        [
            "Bilaan - 8"
        ],
        [
            "Bukidnon (local) - 124"
        ],
        [
            "Butuanon - 58"
        ],
        [
            "Inibaloi - 8"
        ],
        [
            "Isinai - 8"
        ],
        [
            "Manubo (Manobo) - 735"
        ],
        [
            "Masbateño - 8"
        ],
        [
            "Surigaonon - 8"
        ],
        [
            "Tboli (Tagaboli) - 8"
        ],
        [
            "English - 8"
        ],
        [
            "Boholano - 100"
        ],
        [
            "Other local dialects - 264"
        ],
        [
            "Not stated - 817"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Quezon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  41.10"
        ],
        [
            "2009  51.97"
        ],
        [
            "2012  49.17"
        ],
        [
            "2015  55.28"
        ],
        [
            "2018  29.83"
        ],
        [
            "2021  31.96"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Industries (and/or companies) presently operating in the municipality includes:"
        ],
        [
            "BUSCO Sugar Milling Company"
        ],
        [
            "BUSCO Refinery"
        ],
        [
            "BUSCO Organic Fertilizer Processing"
        ],
        [
            "Small Scale Grains Processing"
        ],
        [
            "Loom Band Factory"
        ],
        [
            "Cattle Raising"
        ],
        [
            "Hog Raising"
        ],
        [
            "Poultry Raising"
        ],
        [
            "Banking & Finance"
        ],
        [
            "There are three commercial banks in the municipality serving the needs of the people.",
            "These are the Dumaguete City Development Bank at BUSCO, Butong, Quezon, Bukidnon Cooperative Bank and One Network Bank at Poblacion.",
            "The banks accept deposits and extend loans particularly to sugarcane planters for agricultural and business purposes."
        ],
        [
            "Tourism"
        ],
        [
            "Blue Water Cave"
        ],
        [
            "Lowan-lowan Spring Resort"
        ],
        [
            "Kiokong White Rock Wall"
        ],
        [
            "The municipality has the following scenic spots that can attract and visited by the local and international tourist:"
        ],
        [
            "The Lowan-lowan Spring Resort has an abundant flow of water that can be best enjoyed at any time.",
            "Located in the heart of the municipality."
        ],
        [
            "The Blue Water Cave, in the side of the mouth of Pulangi River."
        ],
        [
            "The Overview Nature and Culture Park, located in Palacapao, is one of the \"must see\" spot in the municipality.",
            "With an overlooking view that views all the land area of Quezon and its neighboring municipalities."
        ],
        [
            "The Kiokong White Rock Wall, the centerpiece of Kiokong Tourism Park, is the site of the first vertical bivouac adventure in the Philippines.",
            "With the assistance of a local outfitter, guests climb the 550-foot rock wall using Single Rope Technique until they reach a ledge 500 feet off the ground.",
            "After spending the night on the ledge, they abseil back to the ground."
        ],
        [
            "The Kiokong Tourism Park also has a bolted crag for sport climbing."
        ],
        [
            "Infrastructure"
        ],
        [
            "An overlooking view at a peak from a bridge in Quezon"
        ],
        [
            "Transportation"
        ],
        [
            "Kiokong White Rock Wall"
        ],
        [
            "Quezon is a land-locked municipality wherein the only means of transportation is by land.",
            "It is accessible in two routes from Cagayan de Oro to Davao City.",
            "The first one is taking the route via BUSCO and the second one is taking the route via Maramag.",
            "The bus company plying the route Cagayan de Oro to Davao City and vice versa is only Bachelor Express/RTMI."
        ],
        [
            "Utilities"
        ],
        [
            "Water Supply"
        ],
        [
            "The waterworks system of the municipality was constructed and operated by the municipal government through the Municipal Mayor's Office - Economic Enterprise Division.",
            "It serves the barangay of Poblacion, Libertad, Salawagan, Mibantang, Cebole, Manuto, Pinilayan and Kiburiao with more or less 2,000 individual household connections (Level III).",
            "While the other barangays with tappable spring were also developed and have provided them potable water supply."
        ],
        [
            "Power / Electricity"
        ],
        [
            "Quezon is part of the service area of First Bukidnon Electric Cooperative, Inc. (FIBECO, INC.) since 1978.",
            "Out of the 51 barangays, 49 were energized at present.",
            "The rest were provided by the Local Government Unit with generator sets."
        ],
        [
            "Communication"
        ],
        [
            "There are five existing communication system linking the municipality to the parts of the country.",
            "These are the SOTELCO, PLDT, GLOBE, SMART and DOTC-Telof.",
            "Several fiber-optic internet service providers are also thriving in the Poblacion to cater the digital needs of the constituents and these are the GLOBE Telecom, PLDT, Converge ICT Solution and Haturiko Network and Data Solution."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Quezon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Quezon, Bukidnon Municipal Comprehensive Land Use Plan 2013-2022"
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^"
        ],
        [
            "\"Quezon: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved April 29, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Vertical Bivouac at Kiokong White Rock Wall: An Extremely High Adventure (Part 1)\".",
            "June 19, 2015."
        ],
        [
            "^ \"Vertical Bivouac at Kiokong White Rock Wall: An Extremely High Adventure (Part 2)\".",
            "June 24, 2015."
        ],
        [
            "^ \"Kiokong Crag: A Great Rock Climbing Destination in the Land of Promise\".",
            "June 27, 2015."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Quezon, Bukidnon."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Quezon:Sugarlandia of Bukidnon"
        ],
        [
            "Places adjacent to Quezon, Bukidnon"
        ],
        [
            "Valencia"
        ],
        [
            "MaramagDon Carlos"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Kitaotao / Arakan, Cotabato"
        ],
        [
            "Talaingod, Davao del Norte"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Quezon,_Bukidnon&oldid=1222763153\""
        ],
        [
            "Categories: Municipalities of BukidnonPopulated places on the Rio Grande de MindanaoHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesUse Philippine English from December 2022All Wikipedia articles written in Philippine EnglishUse mdy dates from December 2022Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}