{
    "name": "Roxas",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Roxas, Isabela"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°07′N 121°37′E﻿ / ﻿17.12°N 121.62°E﻿ / 17.12; 121.62"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesRoxasMunicipalityMunicipality of RoxasMunicipal Hall and planetary"
        ],
        [
            "FlagSealNickname: Commercial Center of the Mallig Plains RegionMotto: RoxasMap of Isabela with Roxas highlightedRoxasLocation within the PhilippinesCoordinates: 17°07′N 121°37′E﻿ / ﻿17.12°N 121.62°E﻿ / 17.12; 121.62CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "5th districtFoundedJuly 1, 1948Named forManuel RoxasBarangays26"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 284.5 million (2020) • Assets₱ 498.3 million (2020) • Expenditure₱ 265.9 million (2020) • Liabilities₱ 185.4 million (2020)Service provider • ElectricityIsabela 2 Electric Cooperative (ISELCO 2)Time zoneUTC+8 (PST)ZIP code3320PSGC023126000IDD : area code +63 (0)78Native languagesIbanag Ilocano TagalogWebsiteroxasisabela.gov.ph"
        ],
        [
            "Roxas, officially the Municipality of Roxas (Ilocano: Ili ti Roxas; Tagalog: Bayan ng Roxas), is a 1st class municipality in the province of Isabela, Philippines.",
            "According to the 2020 census, it has a population of 65,839 people."
        ],
        [
            "The municipality is the center of business and commerce in the Mallig Plains Region.",
            "In 1839, two new provinces were created by the Spanish conquistadors dividing the La Provincia del Valle de Cagayan into two.",
            "One retained the name Cagayan, while a new province of Nueva Vizcaya was created.",
            "Bindang was dissolved as Barrio Vira under the municipality of Gamu, Isabela."
        ],
        [
            "Etymology"
        ],
        [
            "The place used to be called Bindang (Bayani), and was part of La Provincia del Valle de Cagayan (the present-day area of Cagayan to Nueva Vizcaya).",
            "On July 1, 1948, President Elpidio Quirino issued Executive Order 136, which established Barrio Vira as an independent municipality named Roxas in honor of his predecessor, Manuel Roxas."
        ],
        [
            "History"
        ],
        [
            "Early settlers were the Kalingas who originated from adjacent places in Mountain Province and parts of Kalinga.",
            "Despite occasional clashes with Kalingas, Ilocano people settled in the area, and increased their number with an influx from Ilocanos from Central Plains of Luzon and Ilocos."
        ],
        [
            "In 1839, two new provinces were created by the Spanish conquistadors dividing the La Provincia del Valle de Cagayan into two.",
            "One retained the name Cagayan, while a new province of Nueva Vizcaya was created.",
            "Bindang was dissolved as Barrio Vira under the municipality of Gamu, Isabela."
        ],
        [
            "In 1938, the Mallig Plains was set aside by the National Land Settlement Administration (NLSA) under Settlement No.",
            "2 due to the construction of another National Highway project of President Manuel L. Quezon that passed through the area.",
            "But World War II interrupted the implementation of the highway, leaving it uncemented for many years.",
            "After the war, provincial leaders saw the potential of Barrio Vira as an independent town."
        ],
        [
            "On July 1, 1948, President Elpidio Quirino established Executive Order 136 creating Barrio Vira as an independent municipality named \"Roxas\" to honor his predecessor Manuel A. Roxas who just died a few months back.",
            "It was then inaugurated on July 4, 1948, and Rafael Lintao became its first mayor."
        ],
        [
            "In 1952, the barrios of Holy Friday, San Jose (East), and San Jose (West) were transferred to the newly created town of Mallig."
        ],
        [
            "Geography"
        ],
        [
            "The municipality of Roxas is one of the 34 municipalities comprising the wide province of Isabela.",
            "It is exactly located on the central-western part of the province, bounded in the north by the municipality of Mallig, on the north-east by the municipality of Quirino, on the east by the municipality of Burgos, on the south by the municipality of San Manuel all within the province of Isabela and on the west by the municipality of Paracelis in the province of Mountain Province."
        ],
        [
            "The road traversing the municipality of Roxas is the Maharlika Highway or better known as Cagayan Valley Road, connecting to other towns in Isabela particularly the adjacent towns of Gamu, Quirino, Mallig, and San Manuel.",
            "Roxas is 36 kilometres (22 mi) from Ilagan and 382 kilometres (237 mi) from Manila."
        ],
        [
            "Roxas lie on a flat fertile land between the two valleys of Cagayan.",
            "It occupies an area of 184.80 square kilometres (71.35 sq mi) or 2.01% of the total land area of Isabela.",
            "The town is partly urban, and partly rural.",
            "The urban area is expanding rapidly throughout the years making it a future city.",
            "The rural part of the town compose mainly of rice fields."
        ],
        [
            "Barangays"
        ],
        [
            "Barangays of Roxas, Isabela"
        ],
        [
            "Roxas is politically subdivided into 26"
        ],
        [
            "barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Barangay"
        ],
        [
            "PSGC"
        ],
        [
            "Urban/Rural"
        ],
        [
            "Anao"
        ],
        [
            "23126001"
        ],
        [
            "Rural"
        ],
        [
            "Bantug (Poblacion)"
        ],
        [
            "23126013"
        ],
        [
            "Urban"
        ],
        [
            "Doña Concha"
        ],
        [
            "23126031"
        ],
        [
            "Rural"
        ],
        [
            "Imbiao"
        ],
        [
            "23126004"
        ],
        [
            "Rural"
        ],
        [
            "Lanting"
        ],
        [
            "23126005"
        ],
        [
            "Rural"
        ],
        [
            "Lucban"
        ],
        [
            "23126006"
        ],
        [
            "Rural"
        ],
        [
            "Luna (Poblacion)"
        ],
        [
            "23126014"
        ],
        [
            "Urban"
        ],
        [
            "Marcos"
        ],
        [
            "23126007"
        ],
        [
            "Rural"
        ],
        [
            "Masigun"
        ],
        [
            "23126008"
        ],
        [
            "Rural"
        ],
        [
            "Matusalem"
        ],
        [
            "23126028"
        ],
        [
            "Rural"
        ],
        [
            "Muñoz East"
        ],
        [
            "23126029"
        ],
        [
            "Rural"
        ],
        [
            "Muñoz West"
        ],
        [
            "23126030"
        ],
        [
            "Rural"
        ],
        [
            "Quiling"
        ],
        [
            "23126015"
        ],
        [
            "Rural"
        ],
        [
            "Rang-ayan"
        ],
        [
            "23126016"
        ],
        [
            "Rural"
        ],
        [
            "Rizal (Poblacion)"
        ],
        [
            "23126011"
        ],
        [
            "Urban"
        ],
        [
            "San Antonio"
        ],
        [
            "23126017"
        ],
        [
            "Rural"
        ],
        [
            "San Jose"
        ],
        [
            "23126018"
        ],
        [
            "Rural"
        ],
        [
            "San Luis"
        ],
        [
            "23126032"
        ],
        [
            "Rural"
        ],
        [
            "San Pedro"
        ],
        [
            "23126019"
        ],
        [
            "Rural"
        ],
        [
            "San Placido"
        ],
        [
            "23126020"
        ],
        [
            "Rural"
        ],
        [
            "San Rafael"
        ],
        [
            "23126021"
        ],
        [
            "Rural"
        ],
        [
            "Simimbaan"
        ],
        [
            "23126023"
        ],
        [
            "Rural"
        ],
        [
            "Sinamar"
        ],
        [
            "23126024"
        ],
        [
            "Rural"
        ],
        [
            "Sotero Nuesa"
        ],
        [
            "23126025"
        ],
        [
            "Urban"
        ],
        [
            "Villa Concepcion"
        ],
        [
            "23126026"
        ],
        [
            "Rural"
        ],
        [
            "Vira (Poblacion)"
        ],
        [
            "23126012"
        ],
        [
            "Urban"
        ],
        [
            "Topography"
        ],
        [
            "The landscape of Roxas is relatively compose of flatlands with minimal rise at certain point with base mountain elevations on the eastern part, on the parts of Sinamar, Simimbaan and San Placido.",
            "It is approximately 90% of the land area comprising the town can be described as low-lying hills with rolling terrain and an elevation of 200 feet or 61 meters above sea level.",
            "The town is dissected by creeks, river and waterways acting as natural drainage from waters coming from the uplands.",
            "The Siffu River, a connection from Ilog ng Cagayan(Cagayan River) traverse west ward from its diversion from Paracelis to Tuguegarao City supplying the rice fields with irrigation."
        ],
        [
            "The center of the town is relatively low relief of flatlands, while the south-western and north-western part having moderately sloping areas comprising the foothills of Mountain Province."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Roxas, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31.2(1.23)"
        ],
        [
            "23(0.9)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "28.1(1.11)"
        ],
        [
            "113.5(4.47)"
        ],
        [
            "141.4(5.57)"
        ],
        [
            "176.4(6.94)"
        ],
        [
            "236.6(9.31)"
        ],
        [
            "224.9(8.85)"
        ],
        [
            "247.7(9.75)"
        ],
        [
            "222.9(8.78)"
        ],
        [
            "178(7.0)"
        ],
        [
            "1,651.4(65)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "144"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Using the corona classification scheme, the Philippine Atmospheric, Geophysical and Astronomical Services Administration (PAGASA)  classified Roxas' climatic type as to Type III category.",
            "Type III Climate is characterized by no pronounced seasons, but often drier from November to April and wet season from May to October like any other parts of the country.",
            "Roxas is described as Cloudy especially during summer time with an average wind of 1 mph to 3 mph."
        ],
        [
            "The temperature of Roxas is very rare to change but it varies minimally with an average temperature ranging from 23.4 °C to 23.9 °C.",
            "The hottest months of the year are April and May with an average of 27 °C, but it can reach as low as 17 °C in January.",
            "People can describe the temperature as hot weather, due to its close proximity to the hottest points of the Philippines, like Quezon in Isabela and Tuguegarao City in Cagayan.",
            "The data was gathered using weather station RPLC, 310 feet (94 m) above Roxas, Isabela."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of RoxasYearPop.±% p.a.1948 14,864—    1960 17,959+1.59%1970 22,997+2.50%1975 28,696+4.54%1980 33,045+2.86%1990 40,230+1.99%1995 45,187+2.20%2000 48,929+1.72%2007 53,461+1.23%2010 57,699+2.82%2015 61,773+1.31%2020 65,839+1.26%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Roxas, Isabela, was 65,839 people, with a density of 360 inhabitants per square kilometre or 930 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Roxas"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  16.10"
        ],
        [
            "2009  15.82"
        ],
        [
            "2012  15.62"
        ],
        [
            "2015  13.54"
        ],
        [
            "2018  13.47"
        ],
        [
            "2021  13.24"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agriculture"
        ],
        [
            "Rice field in Barangay San Rafael, depicts the municipalities agricultural abundance."
        ],
        [
            "The existence of the National Irrigation Administration (NIA) System in the municipality that provides water supply services in irrigating farmlands makes the locality a prime agricultural community.",
            "The presence of these services makes the agricultural workers the highest in number.",
            "The agricultural productivity of Roxas is high, reaching as much as 95 percent cultivation rates in rice and corn.",
            "Surplus production of rice and corn are being exported to other places.",
            "Other crops are vegetables, tobacco and root crops in which production is just sufficient for local consumption.",
            "Likewise, the production of meat including pork and poultry is just sufficient but the supply of fish of other kinds aside from the harvest of inland fishpond owners within the locality is dependent on the arrival of supply coming from other places."
        ],
        [
            "In the area, rice is the predominant crop, planted twice a year.",
            "The livelihood opportunity is very limited thus,a year-round planting of vegetables is practiced to sustain additional income for the settlers.",
            "Farm labor is highly utilized and low productivity was experienced because of manual farming.",
            "As such, during peak of drying, farmers are compelled to sell their produce freshly threshed which commands lower price.",
            "In 2009, the government provided P3 million financial assistance for the Mestizo 1 hybrid seeds planting and for the establishment of needed agricultural components for Farming improvements.",
            "With the Local Government Unit's strong support, cooperative members embarked on hybrid rice production starting as early as 2007-2008 wet season cropping and followed through the next dry season using 40-percent organic fertilizer."
        ],
        [
            "Roxas municipality prides itself as the \"pioneer\" in hybrid rice production in the province of Isabela with the farmers now producing their own M1 hybrid seeds.",
            "The farmers who belong to three irrigators associations in barangays Simimbaan, Casilbagan and Tanap Progreso, have organized themselves into a cooperative called Simca Model Cluster MPC under the auspices of the Department of Agriculture.",
            "The rice cluster operation is an extension strategy in reaching farmers and extending assistance to achieve increased productivity, food sufficiency and job generation.",
            "This is initiated in support to the Ginintuang Masaganang Ani (GMA) Rice Program of then President Gloria Macapagal Arroyo."
        ],
        [
            "Aside from hybrid rice enterprise, they also venture on fishery.",
            "Through the Bureau of Fishery and Aquatic Resources (BFAR), the cluster coop had dispersed fingerlings to initial 23 fishery cooperators who have backyard fishpond and rice-fish integrated farming."
        ],
        [
            "Trades and business"
        ],
        [
            "The construction of Roxas Public Market-1987"
        ],
        [
            "Bethany Garden Hotel in downtown Roxas, 2012."
        ],
        [
            "Since 2007, Roxas is notable for being most progressive town in Mallig Plains Region.",
            "It has the most number of banks such as BDO, Metrobank, Landbank, BPI, PNB, Chinabank, EastWest Bank, Producers Bank, FICO Bank, Rural Bank of Cauayan, Banco Agricola, Inc., Mallig Plains Rural Bank and other non-major banks."
        ],
        [
            "Roxas has the largest market in the Mallig Plains Region due to its continuous expansion after its 1987 construction.",
            "The market place is an organized area by which dry goods, wet market, toy stores and commercial stores are separated from each other.",
            "It offers a variety of products that is enough to provide the needs of the residents.",
            "Also, settlers from nearby municipalities of San Manuel, Quirino, Burgos, Mallig, Quezon and as far as Paracelis in Mountain Province are able to purchase their commodities from Roxas."
        ],
        [
            "Multinational retail companies like Puregold Fast food chains like Jollibee, Chowking and Chic Boy have opened their respective stand-alone stores in the town."
        ],
        [
            "Culture"
        ],
        [
            "A yearly celebration of Pagay Festival(Palay Festival) held every July 4.",
            "The festival features a Parade comprises mostly by Politicians and participating schools from different parts of Roxas, kuliglig contest and cooking of the biggest rice cake that was also featured in the national television.",
            "Major events include a Street Dance Competition from different schools and Palarong Bayan."
        ],
        [
            "Due to a conflict in the name of the festival, by which the town of Alicia, Isabela, celebrates the same.",
            "It was changed to Binnadangan Festival by former Mayor Harry Soller.",
            "The Binnadangan comes from an Ilocano word meaning Bayanihan and was also derived from the former name of the town during the 1600s.",
            "The festival ends with a long Pyromusical."
        ],
        [
            "Tourism"
        ],
        [
            "Roxas Children's Park at night, 2012."
        ],
        [
            "Destination"
        ],
        [
            "Location"
        ],
        [
            "Year of Completion"
        ],
        [
            "Description"
        ],
        [
            "Roxas Freedom Park"
        ],
        [
            "Centro, Roxas, Isabela"
        ],
        [
            "2010"
        ],
        [
            "Memorial Park of Manuel A. Roxas, Freedom Stage, Pasalubong Center and Fountain"
        ],
        [
            "Children's Park"
        ],
        [
            "Vira, Roxas, Isabela"
        ],
        [
            "2000"
        ],
        [
            "Themed Park"
        ],
        [
            "Borubor Falls"
        ],
        [
            "Sinamar, Roxas, Isabela"
        ],
        [
            "Nature"
        ],
        [
            "Falls"
        ],
        [
            "Our Lady of La Salette Church"
        ],
        [
            "Vira, Roxas, Isabela"
        ],
        [
            "1970(Renovated 2011)"
        ],
        [
            "Church"
        ],
        [
            "Hadassah Resort"
        ],
        [
            "Munoz, Roxas, Isabela"
        ],
        [
            "2001"
        ],
        [
            "Resort"
        ],
        [
            "Lado Del Rio Resort"
        ],
        [
            "Riverside, San Placido, Roxas, Isabela"
        ],
        [
            "2011"
        ],
        [
            "Resort"
        ],
        [
            "Bambusa Farm"
        ],
        [
            "Simimbaan, Roxas, Isabela"
        ],
        [
            "2011"
        ],
        [
            "Bamboo Farm"
        ],
        [
            "Mountain Province-Isabela Boundary"
        ],
        [
            "Simimbaan, Roxas, Isabela"
        ],
        [
            "2017"
        ],
        [
            "Shared viewdeck in Simmacbot, part of Paracelis, Mountain Province"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            " Roxas Municipal Hall with a view of Roxas Astrodome at the back."
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipality of Roxas is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Municipal seal"
        ],
        [
            "The seal, a symbolic devise in the form of circle which symbolizes cohesive interactions of the town's people.",
            "United as one group professing common tie and pursuing a common goal.",
            "This circular figure is circumscribed by a gear-like figure in bright green with black shadings which symbolizes the twenty-six (26) barangays and the unprecedented economic advancement of the municipality; a vital factor in the attainment of its economic status as the trading center of the Mallig Plains Region.",
            "Inscribed on the upper half of the narrow space formed by the outer and the inner circles in red are words \"BAYAN NG ROXAS\" punctuated by a period on the left and other period on the right; and the lower portion of the narrow space are inscribed the words \"LALAWIGAN NG ISABELA\" all in words red, this narrow space has a green as background.",
            "Inscribed in the smaller circle is the shield derived from the provincial seal of Isabela, where the municipality is located and in the middle of the shield is a bold letter \"R\" in white with black shadings for Roxas, the name of the municipality.",
            "Other inscriptions are on the upper most portions and on halfway below represents the irrigation canal, which are represented by a bold wave lines in sky blue.",
            "On the left side of the bold letter \"R\"  is rice plant and on the right is a tobacco plant bold in green, the primary product of the municipality; and on the lower portion, a Vira plant in green after which the former barrio of the municipality of Gamu, now \"ROXAS\"  got its name."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Roxas Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative"
        ],
        [
            "Faustino Michael Carlos T. Dy III"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Jonathan Jose C. Calderon"
        ],
        [
            "Municipal Vice-Mayor"
        ],
        [
            "Nick M. Sebastian"
        ],
        [
            "Municipal Councilors"
        ],
        [
            "Jonathan D. Navalta"
        ],
        [
            "Gretelmar R. Paguyo"
        ],
        [
            "Antonio Hui"
        ],
        [
            "Jose Aristoherson L. Deray"
        ],
        [
            "Clint C. Lanuza"
        ],
        [
            "Cristopher P. Castillo"
        ],
        [
            "Peter Jude B. Soriano"
        ],
        [
            "Winnie A. Domingo"
        ],
        [
            "Politics has been one of the local prominent issues.",
            "Benedict C. Calderon became the mayor of Roxas, defeating Dr. Harry G. Soller who had been the mayor of Roxas for three years.",
            "In the 2010 election, first automated election in Philippine History, incumbent Mayor Harry Soller lost to former Mayor Benedict Calderon with about 2000 votes.",
            "The incumbent Mayor of the town is Dok Totep Calderon who ran unopposed during the 2016 Philippine National Election."
        ],
        [
            "List of Mayors:"
        ],
        [
            "Rafael Lintao (1948-1955)"
        ],
        [
            "David Matusalem (1956-1967)"
        ],
        [
            "Teofilo Bailon (1968-1970)"
        ],
        [
            "Epifanio Abad (1970-1971)"
        ],
        [
            "Inocencio Uy (1972-1986)"
        ],
        [
            "Benito Calderon (1986-1998)"
        ],
        [
            "Harry Soller (2007-2010)"
        ],
        [
            "Benedict Calderon (1998-2007 and 2011–2016)"
        ],
        [
            "Jonathan Jose Calderon (2016–present)"
        ],
        [
            "Congress representation"
        ],
        [
            "Roxas, belonging to the fifth legislative district of the province of Isabela, currently represented by Hon.",
            "Faustino Michael Carlos T. Dy III."
        ],
        [
            "Infrastructure"
        ],
        [
            "Manuel A. Roxas statue at Roxas Municipal Park"
        ],
        [
            "The town of Roxas flourished by infrastructure developments during the term of former Mayor Benito Calderon particularly from 1996 wherein the roads were cemented from Barangay Bantug to San Antonio connecting the municipality to next town of San Manuel.",
            "The construction of the Roxas Public Market lead the local government to divert the national highway from Bantug-Luna-Rang Ayan to Barangays Bantug-San Rafael-San Antonio area.",
            "When Dr. Harry G. Soller took the helms of government as its Municipal Mayor, Roxas has seen an unprecedented pace in its infrastructure development too.",
            "The local government, in cooperation with then Governor Grace Padaca and Congressman Edwin Uy, has concreted 20 kilometers of roads, more or less, in the town proper as well as in the barangays.",
            "At least 10 kilometers of roads were programmed to be concreted.",
            "Moreover, Roxas' public places, and parks have been greatly improved.",
            "New parks include the Barangay Park, which features 26 nipa huts put up by each of the barangays of Roxas which was later on closed and reopened as Al Fresco Food Court in 2016; the Roxas Freedom Park, which features a public comfort room, a Pasalubong Center, a Center Gazeebo with a fountain, and the statue of former President Manuel A. Roxas;  the Forest Park in front of the municipal hall which was later on closed and re-opened as Roxas Children's Park; the now-closed Binibining Roxas Park and the Rizal Park."
        ],
        [
            "Other infrastructure projects include the renovation of the municipal hall, the construction of a new module in the public market, the new vegetable trading post (Bagsakan Center), numerous flood control projects, road widening projects, and many others.",
            "Also, a Grand Terminal for jeepneys and public utility vans opened alongside Xentro Mall Roxas."
        ],
        [
            "In January 2011, Department of Social Welfare and Development (DSWD) Field Office 02 Regional Director Arnel B. Garcia personally handed a check amounting to P7 million pesos on January 4, 2011, to the LGU-Roxas for the construction of 100 core shelter units."
        ],
        [
            "Core Shelter Development Program area in Sitio Benito, San Placido"
        ],
        [
            "Roxas Astrodome"
        ],
        [
            "For over six years of construction, the Sports and Entertainment Recreation building of Roxas has been completed but is still subject for future furnishing and renovation.",
            "The Roxas Astrodome is located at the back of Roxas Municipal Hall.",
            "It consists of three-level seating with capacity of 5,000 to 6,000 people.",
            "This houses different entertainment and local events."
        ],
        [
            "Road"
        ],
        [
            "Roxas is composed of mainly municipal and barangay roads.",
            "A 22 kilometer National Road known as the Maharlika Road(Cagayan Valley Road) extends northward to the adjacent municipality of Mallig and to the province of Cagayan.",
            "The southern par extends to the adjacent municipality of San Manuel and provides the link to the cities of Santiago City and Manila.",
            "Roxas also has one provincial road from the center of the town extending eastward to the adjacent municipalities of Burgos, Gamu and Ilagan City.",
            "Municipal road extend to westward linking the town to Paracelis in Mountain Province."
        ],
        [
            "The national road of Roxas is characterized by four columns of concrete asphalt road.",
            "The Municipal roads are characterized by two columns of road with Side roads made up from bricks colored in maroon.",
            "It also has street lights specially on the part of the Poblacion, while the National Road have orange-colored street lights.",
            "Access roads to all the 26 barangays connects to the national highway."
        ],
        [
            "Protective Services"
        ],
        [
            "The Philippine National Police (PNP), 2nd District Mobile Force Company, and the Bureau of Jail Management and Penology (BJMP) maintain the peace and order situation in the municipality.",
            "They are being augmented by the barangay tanods of the 26 barangays.",
            "The Roxas Philippine National Police (PNP) is composed of 30 policemen.",
            "The ratio is one policeman is to 1,381 persons, which is better than the national standard of 1:1,000.",
            "In terms of facilities and equipment, the police station is equipped with 14 radio transceivers and three service vehicles.",
            "The municipality has two fire trucks with complete accessories being staffed by fifteen fire fighters."
        ],
        [
            "Water and electricity"
        ],
        [
            "The municipality of Roxas is powered by the Isabela Electric Cooperative (ISELCO) District II.",
            "There are two separate power lines that divide the town.",
            "The other one connected to Aurora comprises the Barangays of San Rafael and San Antonio, while the remaining Barangays are connected to the central power facility of Roxas or the so-called Ilagan Connection.",
            "ISELCO II has its office at the center of the town.",
            "Out of the total 9,896 households, there are around 8,392 households or 84.05% have actual electrical connections.",
            "The remaining households uses kerosene, oil lamps and battery to light houses."
        ],
        [
            "On the water supply, Roxas has one of the richest.",
            "Residents mostly use shallow and deep wells for reservoir, and usually pumps water through a pump-well system.",
            "Some also use electrical-power faucets and Level III water systems (large towers).",
            "The main irrigation system for the farmlands are dependent to the Siffu River and other Irrigation System managed by the National Irrigation Administration.",
            "The un-irrigated areas greatly depend on rainwater and pumped wells for its water supply."
        ],
        [
            "Telephone and multimedia services"
        ],
        [
            "The telephone communication system of Roxas is located in Barangay Vira.",
            "There are telephone units intends for commercial use offering domestic and international services.",
            "The leading telephone line of the municipality is PLDT.",
            "Roxas receives regular broadcasting from AM and FM radio stations from other towns like Tuguegarao City and Cauayan (through relay stations).",
            "Several AM stations such as DZCV, Bombo Radyo, and DZRH are being aired in the town.",
            "Roxas has two FM Stations named WIN FM 107.5 \"Nagimas sen\" located in Rizal and WER 104.10 FM \"Radyo104\", located in the uppermost floor of Forrest Hotel.",
            "Several cellphone receptors and towers can also be located within the vicinity of the town.",
            "Smart Communications Tower is located in Barangay Vira, same as to Globe Telecom while the Sun Cellular Tower is located in Barangay Munoz.",
            "Internet services is also prominent in the town with wireless broadband internet now servicing 4G and LTE in the area."
        ],
        [
            "Transportation"
        ],
        [
            "In terms of transportation, Roxas has the most number of bus and jeepney terminals compared to any other town in the region.",
            "Bus companies such as Victory Liner, Northern Luzon Bus Line (formerly NELBUSCO), AJA Transport, & GV Florida Transport have services bound to other parts of the provinces, Ilocos, Cagayan, Nueva Vizcaya, Pangasinan and Manila.",
            "Transportation within the town is mainly by \"tricycles\", a type of auto rickshaw that uses a motorcycle with an attached cab.",
            "There are also many vans which are used as a means of transportation from Roxas to other parts of the province.",
            "Many buses also pass through via Roxas routing from Cagayan to Manila and Baguio.",
            "Some of these buses are Victory Liner, Ballesteros Bus Line Corporation (BBLC), DALIN, Lizardo Trans (GL), GMW Trans (a sister company of GV Florida Transport), Maribel (a sister company of BBLC), Rosalinda and DOLBO Transportation."
        ],
        [
            "Means of Transportation"
        ],
        [
            "Route"
        ],
        [
            "Bus"
        ],
        [
            "Victory Liner"
        ],
        [
            "Roxas to ManilaTuguegarao City to Manila via RoxasRoxas to Dagupan"
        ],
        [
            "AJA Transport"
        ],
        [
            "Roxas to Manila"
        ],
        [
            "GV Florida Transport"
        ],
        [
            "Roxas to ManilaTuguegarao City to Manila via RoxasRoxas to Santiago City"
        ],
        [
            "Ballesteros Bus Lines"
        ],
        [
            "Tuguegarao City to Manila via Roxas"
        ],
        [
            "Nelbusco (Northern Luzon Bus Line)"
        ],
        [
            "Roxas to ManilaRoxas to Santiago City"
        ],
        [
            "Public Utility Jeepney"
        ],
        [
            "Roxas to Ilagan City via Gamu,Roxas to QuezonRoxas to CauayanRoxas to Santiago CityRoxas to Tabuk City"
        ],
        [
            "Passenger Van"
        ],
        [
            "Roxas to Tuguegarao CityRoxas to Santiago City"
        ],
        [
            "Healthcare"
        ],
        [
            "Roxas is primarily considered as the center of health services in Mallig Region.",
            "It has numerous primary, secondary, and tertiary hospitals.",
            "Major hospitals are usually located inside the town proper while the Manuel A. Roxas District Hospital, the only government hospital is located in Barangay San Antonio.",
            "It also houses some specialization clinics like dental clinics and skin clinics.",
            "Moreover, health centers are also available in each barangays outside the town proper."
        ],
        [
            "Hospital/clinic"
        ],
        [
            "Major Hospitals"
        ],
        [
            "Manuel A. Roxas District Hospital (MARDH)"
        ],
        [
            "Soller General Hospital Incorporated"
        ],
        [
            "Dumlao Hospital"
        ],
        [
            "A.M. Yumena General Hospital"
        ],
        [
            "Dayos Medical Center"
        ],
        [
            "Health City Medical Center of Isabela, Inc (Under construction)"
        ],
        [
            "Specialized Clinics"
        ],
        [
            "Sambilay Maternity Surgical and Medical Clinic"
        ],
        [
            "Purugganan Children's Clinic"
        ],
        [
            "Capuccino EENT Clinic"
        ],
        [
            "Garcia Dental Clinic"
        ],
        [
            "Antonio-Miranda CLinic"
        ],
        [
            "Rillon-Tabil Specialists Clinic"
        ],
        [
            "Dr. Karen Alibutod Pediatrics Clinic"
        ],
        [
            "Sumajit-Salamida Clinic"
        ],
        [
            "Balles Children's Clinic"
        ],
        [
            "Ronquillo Medical Clinic"
        ],
        [
            "Skin Concepts Clinic"
        ],
        [
            "Education"
        ],
        [
            "Oldest building inside the La Salette of Roxas"
        ],
        [
            "Public and private schools serve the people of Roxas and other neighboring towns.",
            "It has a number of public elementary schools, three public high schools, namely Roxas National High School, Lanting National High School and Munoz National High School,the same through with the Monico Rarama National High School.",
            "A Marian institution, La Salette of Roxas, provide the private school education.",
            "It has a primary school, a high school, and a college.",
            "La Salette of Roxas is considered as the highest standard of Education in the municipality.",
            "Roxas East Central School is the largest elementary school in the town.",
            "There are also Day Care Centers each barangay and various specialized learning centers namely Roxas United Methodist Church Kindergarten School and Isabela Christian Learning Center for nursery education.",
            "There are four private elementary schools, the Casa Del Niño Montessori School, Marlbury Bush Montessori School, Shalom Learning and La Salette of Roxas-Elementary Department.",
            "There are also Colleges and Universities in the town namely University of La Salette - Roxas Campus a branch of University of La Salette - Santiago City and Isabela State University."
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Here are the complete list of schools within the vicinity of Roxas."
        ],
        [
            "Elementary Schools"
        ],
        [
            "School"
        ],
        [
            "Location"
        ],
        [
            "Type"
        ],
        [
            "Roxas East Central School"
        ],
        [
            "Rizal"
        ],
        [
            "Public"
        ],
        [
            "Roxas West Central School"
        ],
        [
            "Muñoz West"
        ],
        [
            "Marcos Elementary School"
        ],
        [
            "Marcos"
        ],
        [
            "Sinamar Elementary School"
        ],
        [
            "Sinamar"
        ],
        [
            "San Francisco Elementary School"
        ],
        [
            "San Placido"
        ],
        [
            "Nuesa Elementary School"
        ],
        [
            "Sotero Nuesa"
        ],
        [
            "Bantug-Lintao Elementary School"
        ],
        [
            "Bantug"
        ],
        [
            "Simimbaan Elementary School"
        ],
        [
            "Simimbaan"
        ],
        [
            "San Rafael Elementary School"
        ],
        [
            "San Rafael"
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "San Antonio"
        ],
        [
            "Matusalem Elementary School"
        ],
        [
            "Matusalem"
        ],
        [
            "San Pedro-Villa Concepcion Elementary School"
        ],
        [
            "Villa Concepcion"
        ],
        [
            "Doña Concha Elementary School"
        ],
        [
            "Doña Concha"
        ],
        [
            "Imbiao Elementary School"
        ],
        [
            "Imbiao"
        ],
        [
            "Anao Elementary School"
        ],
        [
            "Anao"
        ],
        [
            "Quiling Elementary School"
        ],
        [
            "Quiling"
        ],
        [
            "Luna-Rang-Ayan Elementary School"
        ],
        [
            "Luna"
        ],
        [
            "San Jose Elementary School"
        ],
        [
            "San Jose"
        ],
        [
            "Lanting Elementary School"
        ],
        [
            "Lanting"
        ],
        [
            "Lucban Elementary School"
        ],
        [
            "Lucban"
        ],
        [
            "Marlbury Bush Montessori School"
        ],
        [
            "Rizal"
        ],
        [
            "Private"
        ],
        [
            "La Salette of Roxas"
        ],
        [
            "Vira"
        ],
        [
            "Casa Del Nino Montessori School"
        ],
        [
            "San Rafael"
        ],
        [
            "Shalom Learning Center"
        ],
        [
            "Munoz"
        ],
        [
            "Little Angels Learning Center Inc."
        ],
        [
            "Munoz"
        ],
        [
            "Image Maker Learning Center"
        ],
        [
            "Bantug"
        ],
        [
            "High schools"
        ],
        [
            "School"
        ],
        [
            "Location"
        ],
        [
            "Type"
        ],
        [
            "ISU Laboratory High School"
        ],
        [
            "Rang-Ayan"
        ],
        [
            "Public (University)"
        ],
        [
            "Roxas National High School"
        ],
        [
            "Bantug"
        ],
        [
            "Public"
        ],
        [
            "Matusalem"
        ],
        [
            "Lanting Region National High School"
        ],
        [
            "Lanting"
        ],
        [
            "Monico Rarama National High School"
        ],
        [
            "San Pedro"
        ],
        [
            "Muñoz National High School"
        ],
        [
            "Muñoz"
        ],
        [
            "Casa del Niño Montessori School"
        ],
        [
            "San Rafael"
        ],
        [
            "Private"
        ],
        [
            "La Salette of Roxas"
        ],
        [
            "Vira"
        ],
        [
            "Colleges and Universities"
        ],
        [
            "School"
        ],
        [
            "Location"
        ],
        [
            "Type"
        ],
        [
            "Isabela Colleges of Science & Technology"
        ],
        [
            "Rizal"
        ],
        [
            "College"
        ],
        [
            "Isabela State University"
        ],
        [
            "Rang-Ayan"
        ],
        [
            "Public University"
        ],
        [
            "Matusalem"
        ],
        [
            "University of La Salette-Roxas Campus"
        ],
        [
            "Vira"
        ],
        [
            "Private University"
        ],
        [
            "Notable personalities"
        ],
        [
            "Ryan Alvin Acosta - Commissioner, Civil Service Commission (2022-2027)"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Roxas |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b \"Isabela Travel Information\".",
            "flyphillipines.com.",
            "Archived from the original on March 4, 2016.",
            "Retrieved October 5, 2023."
        ],
        [
            "^ \"R.A. 678 An Act Creating the Municipality of Mallig in the Province of Isabela\".",
            "LawPH.com.",
            "Retrieved April 9, 2011."
        ],
        [
            "^ \"R.A. No.",
            "2048, An Act Creating the Municipality of Callang, Province of Isabela\".",
            "LawPH.com.",
            "Retrieved April 13, 2011."
        ],
        [
            "^ \"R.A. No.",
            "2097, An Act Changing the Name of the Barrio of Basilio in the Municipality of Roxas, Province of Isabela, to San Jose\".",
            "LawPH.com.",
            "Retrieved April 13, 2011."
        ],
        [
            "^ \"Roxas elevation - Wolfram|Alpha\"."
        ],
        [
            "^"
        ],
        [
            "\"Roxas, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved October 31, 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Puregold Roxas, Isabela Puregold.com.ph.",
            "Retrieved March 9, 2012"
        ],
        [
            "^ Roxas to have Puregold and Savemore Roxas Isabela Official Website.",
            "Retrieved June 2, 2012."
        ],
        [
            "^ Malls boost economic growth \"Manila Standard Today\".",
            "Retrieved July 14, 2015"
        ],
        [
            "^ \"Palay festival\".",
            "Asia Africa Intelligence Wire.",
            "June 28, 2005."
        ],
        [
            "^ \"Rice Festival in Roxas Isabela\".",
            "Local Philippines.",
            "Archived from the original on June 30, 2013.",
            "Retrieved March 16, 2013."
        ],
        [
            "^ \"Archived copy\".",
            "Archived from the original on September 28, 2011.",
            "Retrieved May 21, 2011.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ \"Isabelino Ako on Facebook\".",
            "Facebook.",
            "Archived from the original on April 30, 2022."
        ],
        [
            "^ Roxas, Isabela Official Seal Roxas, Isabela Official Website.",
            "Retrieved June 14, 2012."
        ],
        [
            "^ \"Roxas, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved May 15, 2022."
        ],
        [
            "^ a b c d Lubo, Angely.",
            "\"DSWD FO 02 provides 100 core shelters to homeless families in Roxas, Isabela\".",
            "Department of Social Welfare and Development.",
            "Retrieved April 19, 2013."
        ],
        [
            "^ \"Social Services\".",
            "Roxas, Isabela LGU.",
            "Archived from the original on July 5, 2013.",
            "Retrieved April 19, 2013."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "^ \"CA panel OKs nomination of CSC commissioner Acosta\".",
            "Philippine Daily Inquirer.",
            "February 2, 2022.",
            "Retrieved February 2, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Roxas, Isabela."
        ],
        [
            "Official website"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Roxas at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Roxas, Isabela"
        ],
        [
            "Places adjacent to Roxas, Isabela"
        ],
        [
            "Mallig"
        ],
        [
            "Paracelis, Mountain Province"
        ],
        [
            "Roxas"
        ],
        [
            "Quirino"
        ],
        [
            "Alfonso Lista, Ifugao"
        ],
        [
            "San Manuel"
        ],
        [
            "Burgos"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Roxas,_Isabela&oldid=1230797780\""
        ],
        [
            "Categories: Municipalities of Isabela (province)Political divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listCS1 maint: archived copy as titleAccuracy disputes from March 2022Articles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Coordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textCommons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiers"
        ]
    ]
}