{
    "name": "Sagada",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sagada"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°05′03″N 120°54′03″E﻿ / ﻿17.0842°N 120.9008°E﻿ / 17.0842; 120.9008"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Mountain Province, Philippines"
        ],
        [
            "For other uses, see Sagada (disambiguation)."
        ],
        [
            "This article uses bare URLs, which are uninformative and vulnerable to link rot.",
            "Please consider converting them to full citations to ensure the article remains verifiable and maintains a consistent citation style.",
            "Several templates and tools are available to assist in formatting, such as reFill (documentation) and Citation bot (documentation).",
            "(September 2022) (Learn how and when to remove this message)"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Sagada\" – news · newspapers · books · scholar · JSTOR (December 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Cordillera Administrative Region, PhilippinesSagada"
        ],
        [
            "GanduyanMunicipalityMunicipality of SagadaSagada in 2022"
        ],
        [
            "FlagSealMotto: Ipey as Nan GawisAnthem: Sagada HymnMap of Mountain Province with Sagada highlightedOpenStreetMapSagadaLocation within the PhilippinesCoordinates: 17°05′03″N 120°54′03″E﻿ / ﻿17.0842°N 120.9008°E﻿ / 17.0842; 120.9008CountryPhilippinesRegionCordillera Administrative RegionProvinceMountain ProvinceDistrict"
        ],
        [
            "Lone districtBarangays19"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 85.91 million (2020) • Assets₱ 152.7 million (2020) • Expenditure₱ 81.94 million (2020) • Liabilities₱ 35.42 million (2020)Service provider • ElectricityMountain Province Electric Cooperative (MOPRECO)Time zoneUTC+8 (PST)ZIP code2619PSGC144409000IDD : area code +63 (0)74Native languagesBontoc Balangao Ilocano Tagalog Northern KankanayMajor religionsEpiscopal Church of the PhilippinesWebsitesagada.gov.ph"
        ],
        [
            "Sagada, officially the Municipality of Sagada is a 5th class municipality in the province of Mountain Province, Philippines.",
            "According to the 2020 census, it has a population of 11,510 people."
        ],
        [
            "Sagada is 20 kilometres (12 mi) from the provincial capital Bontoc, 396 kilometres (246 mi) from Manila via Halsema Highway, and 146 kilometres (91 mi) from Baguio."
        ],
        [
            "Sagada is famous for its hanging coffins.",
            "This is a traditional way of burying people that is still utilized.",
            "The elderly carve their own coffins out of hollowed logs.",
            "If they are too weak or ill, their families prepare their coffins instead.",
            "The dead are placed inside their coffins (sometimes breaking their bones in the process of fitting them in), and the coffins are brought to a cave for burial.",
            "The Sagada people have been practicing such burials for over 2,000 years, however, not everyone is qualified to be buried this way; among other things, one had to have been married and had grandchildren."
        ],
        [
            "Popular activities include trekking, exploring both caves and waterfalls, spelunking, bonfires, picnics, rappelling, visiting historical sites, nature hikes, and participating in tribal celebrations.",
            "Guides can be found upon registration at the tourist-office in Sagada Proper (the main town) for a small fee.",
            "Most of the guides are natives, also known as Kankanaey."
        ],
        [
            "History"
        ],
        [
            "Sagada in 1980"
        ],
        [
            "Origin legend"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(March 2021) (Learn how and when to remove this message)"
        ],
        [
            "According to legend, Sagada was founded as an ili or village by Biag, a man from Bika in eastern Abra.",
            "The people from Bika were forced out of their ili by raiding headhunters.",
            "Biag's family resettled in Candon, Ilocos but when baptism or the giving of names was enforced, Biag's family chose to move back toward the mountains in search for a settlement.",
            "Along the way, he and his siblings decided to part ways.",
            "A brother, Balay, chose to return to Candon, a sister to Abra.",
            "Another brother settled along the upper Abra River.",
            "Biag pushed further to the east until he came to what is now Sagada."
        ],
        [
            "Arrival of Anglican missionaries"
        ],
        [
            "Perhaps for lack of transportation and willing guides, few conquistadors set foot in Sagada during the Spanish Era, and a Spanish Mission was not founded until 1882.",
            "As a result, it is one of a few places in the Philippines that has preserved its indigenous culture with little Spanish influence."
        ],
        [
            "Anglican missionaries led by Rev.",
            "Fr.",
            "John Staunton built the Church of Saint Mary the Virgin and founded St. Mary's School, Sagada in 1904."
        ],
        [
            "Chico River Dam Project"
        ],
        [
            "Sagada was one of several municipalities in Mountain Province which would have been flooded by the Chico River Dam Project during the Marcos dictatorship, alongside Bauko, Bontoc, Sabangan, Sadanga, and parts of Barlig."
        ],
        [
            "In 1983, refugees fleeing the Beew massacre (in which the 623rd  Philippine Constabulary burned down Sitio Beew in Tuba, Abra, claiming that they were \"rebel sympathizers\") were forced to take refuge in the Church of the St. Mary, where they were given succor by Fr.",
            "Paul Sagayo Jr. until they could finally be aided by Atty Pablo Sanidad of the Free Legal Assistance Group and journalist Isidoro Chammag of the Bulletin Today.",
            ": 197–198"
        ],
        [
            "Geography"
        ],
        [
            "Sagada is nestled in a valley at the upper end of the Malitep tributary of the Chico River some one and a half kilometers above sea level in the Central Cordillera Mountains, enveloped between the main Cordillera Ranges and the Ilocos Range.",
            "Mount Data in the south and Mount Kalawitan in the southeast pierce the horizon.",
            "Mount Polis, Bessang and Mount Tirad in the east, and Mount Sisipitan in the north mark the Mountain Province–Abra boundary.",
            "There are limestone mountains throughout Sagada.",
            "This part of Luzon used to be submerged in the ocean tens of millions of years ago, and fossilized seashells can be found in the walls of Sumaguing Cave."
        ],
        [
            "Barangays"
        ],
        [
            "Sagada is politically subdivided into 19 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aguid"
        ],
        [
            "Ambasing"
        ],
        [
            "Angkeling"
        ],
        [
            "Antadao"
        ],
        [
            "Balugan"
        ],
        [
            "Bangaan"
        ],
        [
            "Dagdag"
        ],
        [
            "Demang"
        ],
        [
            "Fidelisan"
        ],
        [
            "Kilong"
        ],
        [
            "Madongo"
        ],
        [
            "Nacagang"
        ],
        [
            "Pide"
        ],
        [
            "Poblacion"
        ],
        [
            "Suyo"
        ],
        [
            "Taccong"
        ],
        [
            "Tanulong"
        ],
        [
            "Tetepan Norte"
        ],
        [
            "Tetepan Sur"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sagada, Mountain Province"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "28(82)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "22(72)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "11(52)"
        ],
        [
            "9(48)"
        ],
        [
            "11(52)"
        ],
        [
            "12(54)"
        ],
        [
            "14(57)"
        ],
        [
            "16(61)"
        ],
        [
            "16(61)"
        ],
        [
            "15(59)"
        ],
        [
            "14(57)"
        ],
        [
            "13(55)"
        ],
        [
            "12(54)"
        ],
        [
            "11(52)"
        ],
        [
            "13(55)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "35(1.4)"
        ],
        [
            "46(1.8)"
        ],
        [
            "63(2.5)"
        ],
        [
            "117(4.6)"
        ],
        [
            "402(15.8)"
        ],
        [
            "400(15.7)"
        ],
        [
            "441(17.4)"
        ],
        [
            "471(18.5)"
        ],
        [
            "440(17.3)"
        ],
        [
            "258(10.2)"
        ],
        [
            "94(3.7)"
        ],
        [
            "68(2.7)"
        ],
        [
            "2,835(111.6)"
        ],
        [
            "Average rainy days"
        ],
        [
            "9.9"
        ],
        [
            "19.5"
        ],
        [
            "13.9"
        ],
        [
            "18.9"
        ],
        [
            "26.0"
        ],
        [
            "27.3"
        ],
        [
            "28.9"
        ],
        [
            "28.5"
        ],
        [
            "26.1"
        ],
        [
            "19.7"
        ],
        [
            "14.5"
        ],
        [
            "12.8"
        ],
        [
            "246"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Under the Köppen climate classification, Sagada features a subtropical highland climate (‘’Cwb’’).",
            "The area averages 2,835 mm of precipitation annually, the bulk of which falls between the months of May and October.",
            "Temperatures are relatively consistent throughout the course with average daily temperatures ranging from around 17 to 20 degrees Celsius."
        ],
        [
            "Demographics"
        ],
        [
            "Children in Sagada"
        ],
        [
            "Population census of SagadaYearPop.±% p.a.1918 6,189—    1939 7,851+1.14%1948 8,472+0.85%1960 11,548+2.61%1970 12,947+1.15%YearPop.±% p.a.1975 8,968−7.10%1980 9,460+1.07%1990 10,353+0.91%1995 10,354+0.00%2000 10,575+0.45%YearPop.±% p.a.2007 10,930+0.46%2010 11,244+1.04%2015 11,127−0.20%2020 11,510+0.67%Source: Philippine Statistics Authority"
        ],
        [
            "Religion"
        ],
        [
            "Church of St. Mary the Virgin"
        ],
        [
            "Seeing that the Roman Catholicism in the Philippines has long been established, missionary Charles Henry Brent mentioned that \"we are not building an altar over and against another altar,\" thus focusing Episcopal missionary activity among the Filipino-Chinese in Manila, the tribes in Mindanao and the tribes of northern Luzon.",
            "Since the coming of missionaries from the Protestant Episcopal Church in the United States, the municipality of Sagada has become the only Philippine town that is predominantly Anglican with almost 95% baptised into the Episcopal Church of the Philippines (ECP).",
            "A known landmark at the centre of town is the Church of St. Mary the Virgin, a vibrant Episcopal parish.",
            "In 2004, the ECP celebrated its centennial with much of the festivities centered on the town of Sagada."
        ],
        [
            "Economy"
        ],
        [
            "Oranges cultivated in Sagada, being sold at a market in La Trinidad, Benguet"
        ],
        [
            "Poverty incidence of Sagada"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  11.20"
        ],
        [
            "2009  35.39"
        ],
        [
            "2012  10.20"
        ],
        [
            "2015  25.38"
        ],
        [
            "2018  12.62"
        ],
        [
            "2021  19.75"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Since the climate is similar to those of Benguet, its crops are likewise temperate products such as cabbage, tomatoes, green pepper, potatoes, carrots, beans, and others.",
            "Between 1882 and 1896, the Spanish colonizers introduced Arabica coffee: a source of income since the American occupation.",
            "Citrus, mainly lemon, lime and Valencia oranges were introduced from Spain by Jaime Masferre to provide the needs of American missionaries and employees of the Mission of Saint Mary the Virgin.",
            "During the American Period, the Americans introduced products like strawberries, and peaches due to its cooler, highland rainforest climate."
        ],
        [
            "In recent years, tourism has also grown to contribute significantly to the local economy.",
            "Inns, restaurants, tour guide services, and other tourism-related industries have also grown rapidly.",
            "The municipal government also collects significant amounts through the environmental fee it charges each tourist, as well as through the taxes levied on local businesses."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Sagada, belonging to the lone congressional district of the province of Mountain Province, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council (2022–2025):"
        ],
        [
            "Congressman: Maximo Y. Dalog Jr."
        ],
        [
            "Mayor: Felicito O. Dula"
        ],
        [
            "Vice-Mayor: David T. Buyagan"
        ],
        [
            "Councilors:"
        ],
        [
            "Andrea Taltala"
        ],
        [
            "Kapon Gomgom-o"
        ],
        [
            "Mokyat Aclayan"
        ],
        [
            "Raynold Davis Dapliyan"
        ],
        [
            "Tambol Padawil"
        ],
        [
            "Fermin Lumbaya"
        ],
        [
            "Benjamin Capuyan"
        ],
        [
            "Felicito Kibayan Jr."
        ],
        [
            "Places of interest"
        ],
        [
            "Sagada has many natural wonders, including:"
        ],
        [
            "Sumaguing and Lumiang Caves"
        ],
        [
            "Bomod-ok and Bokong Falls"
        ],
        [
            "Rice terraces"
        ],
        [
            "Echo Valley"
        ],
        [
            "Kiltepan Tower"
        ],
        [
            "Underground River"
        ],
        [
            "Lake Danum"
        ],
        [
            "Hanging Coffins"
        ],
        [
            "Pongas Falls"
        ],
        [
            "Blue Soil Hills"
        ],
        [
            "Mount Ampacao"
        ],
        [
            "Marlboro Hill"
        ],
        [
            "Fortune Express"
        ],
        [
            "Latang and Matang Caves"
        ],
        [
            "Other notable places include:"
        ],
        [
            "The Church of St. Mary the Virgin"
        ],
        [
            "The gravesite of Philippine history scholar William Henry Scott"
        ],
        [
            "Notable personalities"
        ],
        [
            "Eduardo Masferré -  Filipino-Catalan photographer regarded as the Father of Philippine photography."
        ],
        [
            "William Henry Scott - Historian and Episcopalian missionary best known for numerous books on the Cordilleran peoples and on Precolonial Philippines."
        ],
        [
            "Trivia"
        ],
        [
            "Sagada was featured in the Filipino film, Don't Give Up on Us, and That Thing Called Tadhana."
        ],
        [
            "Sagada was featured in an episode of Locked Up Abroad."
        ],
        [
            "In the \"Death\" episode of The Moaning of Life, Karl Pilkington visits Sagada to see a local community's cliffside burial techniques."
        ],
        [
            "Gallery"
        ],
        [
            "Rice terraces in Sagada"
        ],
        [
            "Varieties of Sagada coffee"
        ],
        [
            "Hanging coffins in Echo Valley"
        ],
        [
            "Hanging coffins in Echo Valley"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sagada |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Scott, William Henry (1964).",
            "\"The Legend of Biag, an Igorot Culture Hero\".",
            "Asian Folklore Studies.",
            "23 (1): 93–110.",
            "doi:10.2307/1177639.",
            "ISSN 0385-2342.",
            "JSTOR 1177639."
        ],
        [
            "^ Palangchao, Harley.",
            "\"From 'warriors' to educators and missionaries\".",
            "Baguio Midland Courier.",
            "Retrieved 2020-09-20."
        ],
        [
            "^ Scott, William Henry.",
            "\"Brief History of Saint Mary's School\".",
            "sagada.org.",
            "Retrieved 2020-09-20."
        ],
        [
            "^ \"Valley of Sorrow\".",
            "Asiaweek.",
            "1980-09-05."
        ],
        [
            "^ Doyo, Ma.",
            "Ceres P. (2015).",
            "Macli-ing Dulag: Kalinga Chief, Defender of the Cordillera.",
            "Diliman, Quezon City: University of the Philippines Press.",
            "ISBN 978971542772-2."
        ],
        [
            "^ Panaglagip: The North Remembers – Martial Law Stories of Struggle and Survival Edited by Joanna K. Cariño and Luchie B. Maranan."
        ],
        [
            "^"
        ],
        [
            "\"Sagada: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 8 March 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Cordillera Administrative Region (CAR)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Cordillera Administrative Region (CAR)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Mountain Province\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Halalan 2022 SAGADA, Mountain Province Election Results\".",
            "ABS-CBN Halalan Results.",
            "Retrieved 10 August 2023."
        ],
        [
            "^ \"Bomod-Ok Falls in Sagada is the Mother of All Falls\".",
            "25 April 2022."
        ],
        [
            "^ http://www.unofficialguide.ph/hiking-rice-terraces-in-sagada/"
        ],
        [
            "^ de Villa, Gill Gale (July 2, 1995).",
            "\"Beyond the Mountains\".",
            "Philippine Star.",
            "Retrieved April 14, 2012."
        ],
        [
            "^ Jesus T. Peralta; William Henry Scott; Harold C. Conklin (contributor) (2001).",
            "\"William Henry Scott: A Biographical Note and Bibliography\".",
            "Reflections on Philippine culture and society: festschrift in honor of William Henry Scott.",
            "Ateneo de Manila University Press.",
            "ISBN 978-971-550-368-6.",
            "{{cite book}}: |author3= has generic name (help)"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Sagada."
        ],
        [
            "Wikivoyage has a travel guide for Sagada."
        ],
        [
            "Official website"
        ],
        [
            "Sagada at Curlie"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Philippine Center for Investigative Journalism on Sagada"
        ],
        [
            "Places adjacent to Sagada"
        ],
        [
            "Tubo, Abra"
        ],
        [
            "Besao"
        ],
        [
            "Sagada"
        ],
        [
            "Bontoc"
        ],
        [
            "Bauko"
        ],
        [
            "Sabangan"
        ],
        [
            "vte Mountain ProvinceBontoc (capital)  Bauko (largest municipality)Municipalities"
        ],
        [
            "Barlig"
        ],
        [
            "Bauko"
        ],
        [
            "Besao"
        ],
        [
            "Bontoc"
        ],
        [
            "Natonin"
        ],
        [
            "Paracelis"
        ],
        [
            "Sabangan"
        ],
        [
            "Sadanga"
        ],
        [
            "Sagada"
        ],
        [
            "Tadian"
        ],
        [
            "BarangaysSee: List of barangays in Mountain Province"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Other"
        ],
        [
            "IdRef"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sagada&oldid=1223936376\""
        ],
        [
            "Categories: Mountain resorts in the PhilippinesMunicipalities of Mountain ProvinceHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listCS1 errors: generic nameArticles with short descriptionShort description is different from WikidataArticles needing cleanup from September 2022Articles with bare URLs for citations from September 2022All articles with bare URLs for citationsArticles covered by WikiProject Wikify from September 2022All articles covered by WikiProject WikifyArticles needing additional references from December 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles needing additional references from March 2021All articles with unsourced statementsArticles with unsourced statements from March 2021Commons category link from WikidataOfficial website different in Wikidata and WikipediaArticles with Curlie linksArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with SUDOC identifiersPages using the Kartographer extension"
        ]
    ]
}