{
    "name": "Samboan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Samboan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°31′44″N 123°18′23″E﻿ / ﻿9.528753°N 123.306431°E﻿ / 9.528753; 123.306431"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cebu, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Samboan\" – news · newspapers · books · scholar · JSTOR (April 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Visayas, PhilippinesSamboan"
        ],
        [
            "CanamucanMunicipalityMunicipality of SamboanRotunda, Samboan"
        ],
        [
            "SealEtymology: SinamboanganMap of Cebu with Samboan highlightedOpenStreetMapSamboanLocation within the PhilippinesCoordinates: 9°31′44″N 123°18′23″E﻿ / ﻿9.528753°N 123.306431°E﻿ / 9.528753; 123.306431CountryPhilippinesRegionCentral VisayasProvinceCebuDistrict"
        ],
        [
            "2nd districtFounded1784Barangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEmerito Emmanuel D. Calderon Jr. (1Cebu) • Vice MayorIrving P. Gamallo (1Cebu) • RepresentativeEdsel A. Galeos • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Marissa Jude Calderon-AlazasManolito D. ApelanioRomulito D. PielagoJosephine C. BalbuenaRemedios T. TanoElmer A. TocaoRosalina D. BilocuraVenancio F. Gerzon Jr."
        ],
        [
            " • Electorate13,984 voters (2022)Area"
        ],
        [
            " • Revenue₱ 119.8 million (2020) • Assets₱ 374.4 million (2020) • Expenditure₱ 83.19 million (2020) • Liabilities₱ 42.61 million (2020)Service provider • ElectricityCebu 1 Electric Cooperative (CEBECO 1)Time zoneUTC+8 (PST)ZIP code6027PSGC072240000IDD : area code +63 (0)32Native languagesCebuano Tagalog"
        ],
        [
            "Samboan, officially the Municipality of Samboan (Cebuano: Lungsod sa Samboan; Tagalog: Bayan ng Samboan),  is a 5th class municipality in the province of Cebu, Philippines.",
            "According to the 2020 census, it has a population of 20,373 people."
        ],
        [
            "It is located 150 kilometres (93 mi) south of Cebu City."
        ],
        [
            "Samboan is bordered to the north by the town of Ginatilan, to the west is the Tañon Strait, to the east is the town of Oslob, and to the south is the town of Santander."
        ],
        [
            "History"
        ],
        [
            "Samboan is popularly known as an abbreviation of the word sinamboang as a form of fishing during the Spanish time."
        ],
        [
            "However, Samboan in our historical papers is probably known to be Canamucan which is a territory under the Spanish encomienda system of the Spanish administration during their tenure and conquest.",
            "As time goes by, Canamucan becomes Samboan in the current usage."
        ],
        [
            "Samboan is a small town on a hill.",
            "But it used to be a much bigger town, with Alegria under its territorial jurisdiction.",
            "In fact, the people of Alegria were made to render forced labor for the construction of the Samboan church.",
            "It was only sometime during the middle of the 1880s that those two towns were separated from Samboan (the towns of Ginatilan and Malabuyoc, which now lie in between, were created after the separation)."
        ],
        [
            "The municipality of Samboan is one of the emerging towns in the island of Cebu.",
            "It is one of the most resilient towns of the whole Philippines ranking 6th in the whole country per ranking under the competitive index of LGUs as of the year 2017.",
            "It is also a two-time awardee for the National Seal of Good Local Governance from year 2016 and 2017.",
            "It is also a known awardee for the Child-Friendly municipality in 2016 and continues to be so at present."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Samboan is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 072240001   Basak"
        ],
        [
            " 5.6%"
        ],
        [
            " 1,141"
        ],
        [
            " 1,027"
        ],
        [
            "  ▴"
        ],
        [
            " 1.06%"
        ],
        [
            " 072240002   Bonbon"
        ],
        [
            " 3.0%"
        ],
        [
            " 613"
        ],
        [
            " 540"
        ],
        [
            "  ▴"
        ],
        [
            " 1.28%"
        ],
        [
            " 072240003   Bulangsuran"
        ],
        [
            " 5.2%"
        ],
        [
            " 1,054"
        ],
        [
            " 1,099"
        ],
        [
            "  ▾"
        ],
        [
            " −0.42%"
        ],
        [
            " 072240004   Calatagan"
        ],
        [
            " 6.3%"
        ],
        [
            " 1,284"
        ],
        [
            " 1,126"
        ],
        [
            "  ▴"
        ],
        [
            " 1.32%"
        ],
        [
            " 072240005   Cambigong"
        ],
        [
            " 4.3%"
        ],
        [
            " 884"
        ],
        [
            " 670"
        ],
        [
            "  ▴"
        ],
        [
            " 2.81%"
        ],
        [
            " 072240010   Camburoy"
        ],
        [
            " 4.6%"
        ],
        [
            " 941"
        ],
        [
            " 870"
        ],
        [
            "  ▴"
        ],
        [
            " 0.79%"
        ],
        [
            " 072240006   Cañorong"
        ],
        [
            " 4.7%"
        ],
        [
            " 964"
        ],
        [
            " 926"
        ],
        [
            "  ▴"
        ],
        [
            " 0.40%"
        ],
        [
            " 072240007   Colase"
        ],
        [
            " 5.4%"
        ],
        [
            " 1,103"
        ],
        [
            " 968"
        ],
        [
            "  ▴"
        ],
        [
            " 1.31%"
        ],
        [
            " 072240008   Dalahikan"
        ],
        [
            " 6.7%"
        ],
        [
            " 1,360"
        ],
        [
            " 1,185"
        ],
        [
            "  ▴"
        ],
        [
            " 1.39%"
        ],
        [
            " 072240009   Jumangpas"
        ],
        [
            " 6.3%"
        ],
        [
            " 1,290"
        ],
        [
            " 1,400"
        ],
        [
            "  ▾"
        ],
        [
            " −0.81%"
        ],
        [
            " 072240015   Monteverde"
        ],
        [
            " 3.6%"
        ],
        [
            " 742"
        ],
        [
            " 702"
        ],
        [
            "  ▴"
        ],
        [
            " 0.56%"
        ],
        [
            " 072240011   Poblacion"
        ],
        [
            " 19.1%"
        ],
        [
            " 3,887"
        ],
        [
            " 3,901"
        ],
        [
            "  ▾"
        ],
        [
            " −0.04%"
        ],
        [
            " 072240012   San Sebastian (Bato)"
        ],
        [
            " 10.1%"
        ],
        [
            " 2,058"
        ],
        [
            " 2,167"
        ],
        [
            "  ▾"
        ],
        [
            " −0.51%"
        ],
        [
            " 072240013   Suba"
        ],
        [
            " 9.5%"
        ],
        [
            " 1,931"
        ],
        [
            " 952"
        ],
        [
            "  ▴"
        ],
        [
            " 7.33%"
        ],
        [
            " 072240014   Tangbo"
        ],
        [
            " 5.5%"
        ],
        [
            " 1,121"
        ],
        [
            " 1,080"
        ],
        [
            "  ▴"
        ],
        [
            " 0.37%"
        ],
        [
            "Total"
        ],
        [
            "20,373"
        ],
        [
            "18,613"
        ],
        [
            " ▴"
        ],
        [
            "0.91%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Samboan, Cebu"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "35(1.4)"
        ],
        [
            "28(1.1)"
        ],
        [
            "38(1.5)"
        ],
        [
            "51(2.0)"
        ],
        [
            "125(4.9)"
        ],
        [
            "195(7.7)"
        ],
        [
            "194(7.6)"
        ],
        [
            "173(6.8)"
        ],
        [
            "180(7.1)"
        ],
        [
            "192(7.6)"
        ],
        [
            "121(4.8)"
        ],
        [
            "64(2.5)"
        ],
        [
            "1,396(55)"
        ],
        [
            "Average rainy days"
        ],
        [
            "9.2"
        ],
        [
            "8.2"
        ],
        [
            "9.9"
        ],
        [
            "11.3"
        ],
        [
            "22.5"
        ],
        [
            "27.3"
        ],
        [
            "28.0"
        ],
        [
            "27.2"
        ],
        [
            "27.1"
        ],
        [
            "26.9"
        ],
        [
            "19.7"
        ],
        [
            "12.7"
        ],
        [
            "230"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Paddle forward expedition in June, 2021 visiting Samboan.",
            "Photo: Budots Media.",
            "Outrigger canoe moored in front of Samboan Plaza."
        ],
        [
            "Population census of SamboanYearPop.±% p.a.1903 9,870—    1918 12,039+1.33%1939 11,062−0.40%1948 11,050−0.01%1960 11,065+0.01%1970 11,804+0.65%1975 13,586+2.86%1980 14,798+1.72%1990 15,005+0.14%1995 15,770+0.94%2000 16,659+1.18%2007 18,140+1.18%2010 18,613+0.94%2015 20,884+2.22%2020 20,373−0.49%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Samboan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  49.50"
        ],
        [
            "2009  53.06"
        ],
        [
            "2012  31.74"
        ],
        [
            "2015  35.90"
        ],
        [
            "2018  21.60"
        ],
        [
            "2021  44.35"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "Heritage buildings"
        ],
        [
            "One aspect of interest is that of Samboan's cultural heritage left by the Spanish conquerors."
        ],
        [
            "St. Michael Archangel Church is one of the oldest Spanish-built churches in Cebu, made of coral stones.",
            "Today, it is a national protected heritage structure by the National Historical Commission.",
            "It has now a NHC permanent marker."
        ],
        [
            "The Watch Tower is another Spanish structure, also made up of blocks of coral stones.",
            "It was built on the side of the hill to watch out for Moro invaders approaching the island.",
            "It is the tallest watch tower in the entire island of Cebu, and best preserved."
        ],
        [
            "Connecting the beach area with the Spanish Watch Tower is St. Jacob's Ladder (Escala de Jacobe).",
            "It is a flight of 147 stone steps built in 1878, which leads to the old watchtower on a plateau 65 metres (213 ft) above the town.",
            "From here, one can get a view of the Tañon Strait."
        ],
        [
            "The Museo de Samboan is the old municipal building of Samboan which now housed items of Samboan's way of life during our history up to the present.",
            "It was converted into a museum when the New Samboan Municipal Hall was erected."
        ],
        [
            "The Samboan WWII Volunteers Monument, at the center of Poblacion on the National Highway, was built in honor of the many volunteers who fought for the freedom of the Philippines."
        ],
        [
            "The San Sebastian Stone Walls are old stone structures near San Sebastian Parish Church.",
            "This may be why this barangay is popularly known as 'Bato' (meaning \"stone\")."
        ],
        [
            "The Spanish Boundary Post.",
            "It stands along the highway in Tangbo beside the Tangbo—Bonbon River Bridge.",
            "It was believed that it used to mark the boundary limit of old Poblacion but now merely serves to mark the boundary between Bonbon and Tangbo barangays."
        ],
        [
            "Tourism"
        ],
        [
            "Natural attractions"
        ],
        [
            "Samboan.",
            "Panorama.",
            "Aerial Photo: Budots Media"
        ],
        [
            "Samboan is known for its beautiful crystal clear waters with a rich marine ecosystem along its coastal barangays."
        ],
        [
            "Colase Marine Sanctuary is managed by the municipality together with a fisherfolks organization.",
            "Here one can visit the fish sanctuary or dive for a fee to experience the most preserved marine ecosystem where sharks, dolphins and whales in the shallowest part of the foreshore.",
            "Aside from Colase, other coastal barangays including San Sebastian (Bato), Dalahikan, Tangbo, Bonbon, Suba and Poblacion offer the same experience generally."
        ],
        [
            "Aguinid Waterfalls in Tangbo comprises five different tiers along Tangbo river.",
            "Each tier has a unique waterfall.",
            "One can never reach the peak or last waterfall without climbing the limestone walls of each waterfall from the lowest to highest."
        ],
        [
            "Bonbon Binalayan Hidden Falls to the immediate south of Poblacion which some visitors call the Triple Drop Falls."
        ],
        [
            "Ponong Hidden Lake is a small enclosed lagoon with a brackish water.",
            "It is unique in the sense that here is where a certain kind of bird – the \"manolong\" – dives into its salty waters and stays under for a long time in order to escape hunters.",
            "Today, it is perfect for relaxation, bird watching, fish feeding and firefly watching."
        ],
        [
            "Balay'g Sawa Falls has a waterfall located in the heart of Samboan covered with lush forest greens.",
            "It is along the river shared by Poblacion and Bonbon.",
            "It is home to protected species including bats and siloys not to mention some local plants and trees."
        ],
        [
            "Mt.",
            "Bartolina situated in between Bulangsuran and Canang (Oslob) is where one can climb the peak and see both sides of Cebu, facing Bohol Strait to the east and Tañon Strait to the west.",
            "Bartolina is the highest peak in the south of Cebu where the panoramic view of north and south Bais Bay and the rest of Negros, Siquijor, and Bohol islands can be seen."
        ],
        [
            "Dau Falls is the highest waterfall in Samboan.",
            "It is located in Barangay Suba."
        ],
        [
            "Tabon Falls is a recently developed natural spot found between Tangbo and Bonbon."
        ],
        [
            "Town Fiesta"
        ],
        [
            "The town fiesta is celebrated each 29–30 September in honor of the patron saint, Michael (San Miguel, ang Arkanghel)."
        ],
        [
            "Delicacies"
        ],
        [
            "Torta Especial (with or without coco wine) and Samboan cookies, which usually come out best during fiesta for visitors to try."
        ],
        [
            "Torta de Tangbo is said to be among the best in the locality."
        ],
        [
            "Manokhang is a native chicken cooked under coconut milk with hot pepper and \"ulang\" (Freshwater Shrimp)."
        ],
        [
            "Linubihang Kagang is a common specialty in town from \"kagang\" (Land Crab) cooked with \"tuno\" (coconut milk)."
        ],
        [
            "Tabanglang is a native dish made from sauteed \"tabangka\" (Snail) and \"Ulang\" (Freshwater Shrimp).",
            "It is a good appetizer."
        ],
        [
            "Coco Maize Pudding is locally known as \"kalo-kalo\" with coconut meat and corn flour (tiktik).",
            "It is a dessert served hot & cold."
        ],
        [
            "Education"
        ],
        [
            "The public schools in the town of Samboan are administered by one school district under the Schools Division of Cebu Province."
        ],
        [
            "Elementary schools:"
        ],
        [
            "Basak Elementary School — Basak"
        ],
        [
            "Cambigong Elementary School — Cambigong"
        ],
        [
            "Cañorong Elementary School — Cañorong"
        ],
        [
            "Colase Elementary School — Colase"
        ],
        [
            "Dalahikan Elementary School — Dalahikan"
        ],
        [
            "Jumangpas Elementary School — Jumangpas"
        ],
        [
            "Kalatagan Elementary School — Calatagan"
        ],
        [
            "Kamburoy Elementary School — Camburoy"
        ],
        [
            "Manuel L. Quezon Elementary School — Poblacion"
        ],
        [
            "Monteverde Elementary School — Monteverde"
        ],
        [
            "Samboan Central Elementary School — Poblacion"
        ],
        [
            "San Sebastian Elementary School — San Sebastian"
        ],
        [
            "Suba Elementary School — Suba"
        ],
        [
            "Tangbo Elementary School — Tangbo"
        ],
        [
            "High schools:"
        ],
        [
            "Pedro B. Uy Calderon Memorial National High School — Jumangpas"
        ],
        [
            "Samboan National High School — Poblacion"
        ],
        [
            "San Sebastian National High School — San Sebastian"
        ],
        [
            "Integrated schools:"
        ],
        [
            "Bulangsuran Integrated School — Bulangsuran"
        ],
        [
            "Private schools:"
        ],
        [
            "St. Pius X School of Samboan, Inc. — Poblacion"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Samboan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Samboan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 10 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cebu\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Balais 2012."
        ],
        [
            "Sources"
        ],
        [
            "Balais, Harry (2012).",
            "\"Chasing Waterfalls: Dau Falls\".",
            "Archived from the original on 31 December 2014.",
            "Retrieved 26 August 2016."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Samboan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Samboan"
        ],
        [
            "Ginatilan"
        ],
        [
            "Tañon Strait"
        ],
        [
            "Samboan"
        ],
        [
            "Oslob"
        ],
        [
            "Santander"
        ],
        [
            "vte Province of CebuCebu City (capital and largest city)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Alcoy"
        ],
        [
            "Alegria"
        ],
        [
            "Aloguinsan"
        ],
        [
            "Argao"
        ],
        [
            "Asturias"
        ],
        [
            "Badian"
        ],
        [
            "Balamban"
        ],
        [
            "Bantayan"
        ],
        [
            "Barili"
        ],
        [
            "Boljoon"
        ],
        [
            "Borbon"
        ],
        [
            "Carmen"
        ],
        [
            "Catmon"
        ],
        [
            "Compostela"
        ],
        [
            "Consolacion"
        ],
        [
            "Cordova"
        ],
        [
            "Daanbantayan"
        ],
        [
            "Dalaguete"
        ],
        [
            "Dumanjug"
        ],
        [
            "Ginatilan"
        ],
        [
            "Liloan"
        ],
        [
            "Madridejos"
        ],
        [
            "Malabuyoc"
        ],
        [
            "Medellin"
        ],
        [
            "Minglanilla"
        ],
        [
            "Moalboal"
        ],
        [
            "Oslob"
        ],
        [
            "Pilar"
        ],
        [
            "Pinamungajan"
        ],
        [
            "Poro"
        ],
        [
            "Ronda"
        ],
        [
            "Samboan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Francisco"
        ],
        [
            "San Remigio"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santander"
        ],
        [
            "Sibonga"
        ],
        [
            "Sogod"
        ],
        [
            "Tabogon"
        ],
        [
            "Tabuelan"
        ],
        [
            "Tuburan"
        ],
        [
            "Tudela"
        ],
        [
            "Component cities"
        ],
        [
            "Bogo"
        ],
        [
            "Carcar"
        ],
        [
            "Danao"
        ],
        [
            "Naga"
        ],
        [
            "Talisay"
        ],
        [
            "Toledo"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Cebu City"
        ],
        [
            "Lapu-Lapu"
        ],
        [
            "Mandaue"
        ],
        [
            "(Administratively independent from the province but grouped under Cebu by the Philippine Statistics Authority.",
            "However, qualified voters in Mandaue are allowed to vote in elections for Cebu provincial officials by virtue of Republic Act No.",
            "6641, in accordance with Section 452-c of the Local Government Code of 1991.)"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Samboan&oldid=1197815364\""
        ],
        [
            "Category: Municipalities of CebuHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}