{
    "name": "Sampaloc",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sampaloc, Quezon"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°09′45″N 121°38′16″E﻿ / ﻿14.1625°N 121.6378°E﻿ / 14.1625; 121.6378"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Quezon, Philippines"
        ],
        [
            "Municipality in Calabarzon, PhilippinesSampalocMunicipalityMunicipality of SampalocSampaloc Municipal Hall"
        ],
        [
            "FlagSealEtymology: TamarindNickname(s): Clean and Greenest Town on QuezonMotto: Ang Galing ng SampalukinMap of Quezon with Sampaloc highlightedOpenStreetMapSampalocLocation within the PhilippinesCoordinates: 14°09′45″N 121°38′16″E﻿ / ﻿14.1625°N 121.6378°E﻿ / 14.1625; 121.6378CountryPhilippinesRegionCalabarzonProvinceQuezonDistrict"
        ],
        [
            "1st districtFoundedFebruary 17, 1892Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorNoel Angelo T. Devanadera • Vice MayorTeresita \"Bunay\" Villeno • RepresentativeWilfrido Mark M. Enverga • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Earl Donne S. AbejaAbner T. DayoMiriam O. DayoNormandy D. EncinaNicolas Andre T. DevanaderaCipriano C. GaganElynor D. PueblaEnrico T. Lebantino"
        ],
        [
            " • Electorate10,002 voters (2022)Area • Revenue₱ 91.6 million (2020) • Assets₱ 333.8 million (2020) • Expenditure₱ 92.62 million (2020) • Liabilities₱ 254.8 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code4329PSGC045639000IDD : area code +63 (0)42Native languagesTagalog"
        ],
        [
            "Sampaloc, officially the Municipality of Sampaloc (Tagalog: Bayan ng Sampaloc),  is a 5th class municipality in the province of Quezon, Philippines.",
            "According to the 2020 census, it has a population of 13,629 people."
        ],
        [
            "The municipality is situated in a valley completely surrounded by high evergreen hills in the heart of the Sierra Madre Mountains between the municipalities of Lucban and Mauban, Quezon."
        ],
        [
            "History"
        ],
        [
            "Spanish period"
        ],
        [
            "Sampaloc used to be the Barrio Dingin of Lucban, Quezon consisting of three sitios.",
            "It was later renamed into Sampaloc because of the presence of a large tamarind tree found in the center of the settlement during the earlier days.",
            "The name was also changed in Alfonso Trece for a time to honor the King of Spain."
        ],
        [
            "In 1873, Capt.",
            "Pedro Cadelina of Lucban recommended to change the barrio into a municipality but due to lack of residents, it was only made into a “visita”.",
            "“Teniente Mayores” were appointed to head the ”visita”, the first of whom was from Polilio, followed by Arcadio Veluya, Laureano Nanola, Silverio Abueva and Juan Saludades.",
            "Through the efforts of Juan Pineda, Sampaloc became a municipality in 1892.",
            "He was elected as the first Capitan.",
            "He was succeeded by Diego Gagan followed by Teofilo Daya in 1901.",
            "The town was also renamed to Sampaloc during this time."
        ],
        [
            "American era"
        ],
        [
            "Jose de Aso introduced few improvements when he became president in 1904.",
            "He built a new church to replace the old one destroyed by storm in 1905.",
            "After de Asis, Capt.",
            "Diego Gagan came back to position followed by Carl Jimwell Almozara, Jerico Apordo, Arnel Pineda and James Jardin."
        ],
        [
            "President Gregorio Abeja built a new municipal building and a new semi-concrete schoolhouse during his term.",
            "Untoward incidents happened during President Fortunato Oblena which hindered the realization of any remarkable accomplishments.",
            "In November 1934, a strong typhoon hit the municipality which brought down the church, houses and took some lives.",
            "In 1935, the notorious bandit Asidillo hit the town and people were confined under martial law.",
            "People were in constant fear which pushed a military campaign in the area.",
            "On December 32, 1935, Lt. Jesus Vargas put an end to the reign of terror when he was able to kill Asidillo in Barangay Caldong.",
            "The Second World War also affected the peaceful municipality.",
            "Ramon Villaverde was on his second term as mayor when the war broke out forcing him to flee to the hills.",
            "His post was briefly occupied by Apolinario Villaverde but the Executive Commission reappointed Ramon Villaverde on September 1, 1942, to act as mayor during the Japanese occupation.",
            "He ruled tactfully during his term to help spare the locals from the Japanese onslaught and the recognized guerrillas.",
            "Began the occupation conflicts, Filipino troops of the Philippine Commonwealth Army sending the operations in Sampaloc to adding recognized guerrillas and fought the Imperial Japanese Army.",
            "He was again reappointed by President Jose P. Laurel after the liberation and was in office until June 30, 1946.",
            "President Manuel Roxas assigned Sixto Obnamia as acting municipal mayor after the Americans granted Philippines Independence on July 4, 1946.",
            "During his reign, the HUKBALAHAP became active in the town.",
            "The situation asked for a leader of tact and foresight.",
            "It was during this time in 1947 when Paterno Abcede came to light.",
            "He led Sampaloc for another two consecutive terms before becoming a Board Member of Quezon in 1959.",
            "Fidel V. Torres came to power in the municipality in 1959 when he won the mayoralty bid against Dr. Rodolfo Veluz.",
            "He was re-elected again in 1963, defeating Rodolfo S. Obnamia, son of former Mayor Sixto Obnamia.",
            "The tides, however, turned to Rodolfo Obnamia's favor when he was put into power in 1967 election, this time winning against Fidel Torres.",
            "It was in his term when the right wing portion of the municipal building was annexed to the existing building.",
            "This was called the Executive Hall which served as the session hall of the Sangguniang Bayan."
        ],
        [
            "Martial law"
        ],
        [
            "When Martial Law was declared by President Ferdinand Marcos on September 21, 1972, local elections were also suspended for nearly a decade.",
            "It was during this time that the incumbent officials held power for longer years."
        ],
        [
            "In 1976, Mayor Obnamia established the Sampaloc Medicare Hospital.",
            "Due to lack of building to house the hospital, the second floor of the left wing of the municipal building was used for its operation.",
            "Dr. Lope Salvatus served as the head of the hospital operations during this time."
        ],
        [
            "In 1980, Dr. Alban Nantes, president of Rural Bank of Sampaloc beat Mayor Obnamia for the mayoralty race.",
            "Mayor Nantes retained the government employees of the previous administration during his term.",
            "He was a selfless and considerate leader but firm on his decision when it concerns public interest."
        ],
        [
            "Post-EDSA revolution"
        ],
        [
            "The advent of EDSA Revolution brought changes in the local government when Mayor Nantes expressed support to Corazon C. Aquino.",
            "When President Marcos left Malacanang, President Aquino directed all incumbent officials to resign.",
            "Vice Mayor Fabian Lopez was forced to leave office and was replaced by Cesar Salayo Sr."
        ],
        [
            "In the local election of 1988, Sampaloc had a strong contender for mayoralty race thru Atty.",
            "Agnes V.S.T.",
            "Devanadera.",
            "Atty.",
            "Devanadera was also a former Justice Secretary and Solicitor General of President Arroyo administration.",
            "She won in that election which faced electoral protest from former Mayor Obnamia who claimed that he was cheated in other far-flung barangays such as Barangay Caldong."
        ],
        [
            "During her political career as mayor, Mayor Devanadera tackled the socio-economic needs of Sampaloc.",
            "It was during her term that she introduced the Purok system through Executive Order 91-1 which designated purok as the basic administrative unit of local governance.",
            "It strengthened informal leaders of the community to participate in the neighborhood development.",
            "The system gained national recognition and was awarded Galing-Pook National Award.",
            "Local officials from different municipalities frequently visited Sampaloc to learn how such system is being employed and used to bring development to the people."
        ],
        [
            "Mayor Devanadera went on to finish up to her 3rd term as mayor in 1998 with other developments of Sampaloc credited to her like more farm-to-market roads, agricultural technology school, renovation of old public market and withstanding the challenges of typhoon Rosing when Sampaloc became isolated with the rest of Quezon province due to the impact of the typhoon."
        ],
        [
            "On May 11, 1998, another mayoralty election was held.",
            "This time, Captain Samson B. Delgado, a mariner by profession took the place.",
            "Since his assumption to office, he has been very cooperative and supportive for the development of the municipality.",
            "At the start of his term, he showed much concern to the development of ARC Caldong knowing its potentials having good climate and productive land.",
            "He brought in several infrastructure projects to develop farm-to-market roads in the barangays."
        ],
        [
            "One of his remarkable accomplishments was bringing in National High School at Barangay Banot to provide free secondary education to poor high school students.",
            "Salary of pioneer teachers was shouldered by the LGU.",
            "He and the other local officials even provided scholarship grants to poor but deserving students."
        ],
        [
            "Geography"
        ],
        [
            "Surrounded by the Sierra Madre Mountains, makes it cold all year around.",
            "The Maapon River which divides the northern part of Sampaloc and the Southern half, it delivers pure, clean, fresh and crystal-clear water from the neighboring province of Laguna.",
            "Many caves are also found here, the Malaog cave is an example.",
            "Waterfalls are also found here, almost every barangay has one, Asidillo Falls on Barangay.",
            "Caldong, Bayongon Falls on Barangay.",
            "Bayongon.",
            "The Highest point can be found on Barangay Caldong which meters above sea level, while the lowest point can be found on Barangay Banot which is less than 20 meters above sea level."
        ],
        [
            "Barangays"
        ],
        [
            "Sampaloc is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alupay"
        ],
        [
            "Apasan"
        ],
        [
            "Banot"
        ],
        [
            "Bataan"
        ],
        [
            "Bayongon (Poblacion)"
        ],
        [
            "Bilucao"
        ],
        [
            "Caldong"
        ],
        [
            "Ibabang Owain (Poblacion)"
        ],
        [
            "Ilayang Owain (Poblacion)"
        ],
        [
            "Mamala"
        ],
        [
            "San Bueno"
        ],
        [
            "San Isidro (Poblacion)"
        ],
        [
            "San Roque (Poblacion)"
        ],
        [
            "Taquico"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sampaloc, Quezon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "52(2.0)"
        ],
        [
            "35(1.4)"
        ],
        [
            "27(1.1)"
        ],
        [
            "27(1.1)"
        ],
        [
            "82(3.2)"
        ],
        [
            "124(4.9)"
        ],
        [
            "163(6.4)"
        ],
        [
            "144(5.7)"
        ],
        [
            "145(5.7)"
        ],
        [
            "141(5.6)"
        ],
        [
            "100(3.9)"
        ],
        [
            "102(4.0)"
        ],
        [
            "1,142(45)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.0"
        ],
        [
            "8.1"
        ],
        [
            "8.8"
        ],
        [
            "9.7"
        ],
        [
            "17.9"
        ],
        [
            "22.6"
        ],
        [
            "26.2"
        ],
        [
            "24.5"
        ],
        [
            "24.6"
        ],
        [
            "22.0"
        ],
        [
            "16.7"
        ],
        [
            "14.9"
        ],
        [
            "208"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of SampalocYearPop.±% p.a.1903 1,263—    1918 3,074+6.11%1939 4,540+1.87%1948 4,053−1.25%1960 6,538+4.06%1970 8,370+2.50%1975 8,874+1.18%1980 9,365+1.08%1990 11,132+1.74%1995 10,977−0.26%2000 12,858+3.45%2007 13,534+0.71%2010 13,107−1.16%2015 13,907+1.13%2020 13,629−0.40%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Sampaloc"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  18.70"
        ],
        [
            "2009  11.94"
        ],
        [
            "2012  15.17"
        ],
        [
            "2015  11.37"
        ],
        [
            "2018  12.56"
        ],
        [
            "2021  13.64"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Municipal Mayor : Noel Angelo T. Devanadera"
        ],
        [
            "Municipal Vice Mayor : Kenneth Nantes."
        ],
        [
            "Councilors"
        ],
        [
            "Andrew Anareta"
        ],
        [
            "Teresita Vileno"
        ],
        [
            "Mayleen Dayo"
        ],
        [
            "Ric Dejelo"
        ],
        [
            "Miriam Dayo"
        ],
        [
            "Karl Tores"
        ],
        [
            "Noel Casareo"
        ],
        [
            "Jan Paul Jarafa"
        ],
        [
            "Culture"
        ],
        [
            "Festivals"
        ],
        [
            "During the month of April, Buli products such as bags, hats, flowers, pockets and more are decorated in their houses.",
            "Bulihan Festival is also called \"Mini Pahiyas\".",
            "Parades roam around the town some celebrity stars also visited here.",
            "Meanwhile, there are also cooking contests, palarong pinoy, stage plays, beer fests, concerts, bag and hat making contests, fairs, and many more."
        ],
        [
            "The festival, which comes from the word 'buri' or buli, is a large palm tree which can be seen in the town."
        ],
        [
            "Education"
        ],
        [
            "There are some schools that can be found in this town:"
        ],
        [
            "Elementary"
        ],
        [
            "Sampaloc Elementary School (Main)"
        ],
        [
            "Sampaloc Elementary School (Annex)"
        ],
        [
            "Sampaloc Elementary School (Greenhills)"
        ],
        [
            "Sampaloc Elementary School (Bilucao)"
        ],
        [
            "Sampaloc Elementary School (Apasan)"
        ],
        [
            "Sampaloc Elementary School (Banot)"
        ],
        [
            "Sampaloc Elementary School (Alupay)"
        ],
        [
            "Sampaloc Elementary School (Pasda)"
        ],
        [
            "Caldong Elementary School"
        ],
        [
            "Green Purple Kiddie Learning Center Inc."
        ],
        [
            "Cocofed Kindergarten"
        ],
        [
            "Sampaloc Adventist Elementary School (Greenhills)"
        ],
        [
            "Secondary"
        ],
        [
            "Sampaloc National Highschool (S.N.H.S)"
        ],
        [
            "Adela S. Torres National Highschool formerly(Sampaloc National Highschool Extension (S.N.H.S))"
        ],
        [
            "Manuel S. Enverga Academy Foundation Inc.",
            "(M.S.E.A.F.I.)"
        ],
        [
            "Gallery"
        ],
        [
            "Sampaloc Municipal Hall"
        ],
        [
            "Sampaloc Church"
        ],
        [
            "Sampaloc Central School"
        ],
        [
            "Street in Poblacion Sampaloc with the Sierra Madre mountains in the background"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sampaloc |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Sampaloc: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 27 January 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Quezon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Sampaloc, Quezon."
        ],
        [
            "Sampaloc Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Sampaloc, Quezon"
        ],
        [
            "Cavinti, Laguna"
        ],
        [
            "Mauban"
        ],
        [
            "Luisiana, Laguna"
        ],
        [
            "Sampaloc"
        ],
        [
            "Lucban"
        ],
        [
            "Mauban"
        ],
        [
            "vte Province of QuezonLucena (capital and largest city)Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Alabat"
        ],
        [
            "Atimonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Calauag"
        ],
        [
            "Candelaria"
        ],
        [
            "Catanauan"
        ],
        [
            "Dolores"
        ],
        [
            "General Luna"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Infanta"
        ],
        [
            "Jomalig"
        ],
        [
            "Lopez"
        ],
        [
            "Lucban"
        ],
        [
            "Macalelon"
        ],
        [
            "Mauban"
        ],
        [
            "Mulanay"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagbilao"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Narciso"
        ],
        [
            "Sariaya"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Tiaong"
        ],
        [
            "Unisan"
        ],
        [
            "Component city"
        ],
        [
            "Tayabas"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Lucena (Administratively independent from the province but grouped under Quezon by the Philippine Statistics Authority.",
            "However, qualified voters of this city are still allowed to participate in the election of provincial officials as part of Quezon’s 2nd Sangguniang Panlalawigan district.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sampaloc,_Quezon&oldid=1204530247\""
        ],
        [
            "Category: Municipalities of QuezonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataPages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}