{
    "name": "San Marcelino",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Marcelino"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°58′27″N 120°09′26″E﻿ / ﻿14.97418°N 120.15733°E﻿ / 14.97418; 120.15733"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Zambales, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"San Marcelino\" – news · newspapers · books · scholar · JSTOR (May 2011) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesSan MarcelinoMunicipalityMunicipality of San MarcelinoNew San Marcelino Town Hall"
        ],
        [
            "SealNickname(s): Singkamas Capital of the PhilippinesMap of Zambales with San Marcelino highlightedOpenStreetMapSan MarcelinoLocation within the PhilippinesCoordinates: 14°58′27″N 120°09′26″E﻿ / ﻿14.97418°N 120.15733°E﻿ / 14.97418; 120.15733CountryPhilippinesRegionCentral LuzonProvinceZambalesDistrict"
        ],
        [
            "1st districtFounded1843Named forMarcelino de Oraá LecumberriBarangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorElmer Ragadio Soria • Vice MayorApolinario A. Abelon • RepresentativeJeffrey D. Khonghun • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Nestor A. IgnacioCirilo I. Pimentel Jr.Jan Maru C. CabbabManuel P. Arquero Jr.Irene D. CanlasArnel P. BuenoJesus U. Lunario"
        ],
        [
            " • Electorate24,927 voters (2022)Area • Revenue₱ 229.6 million (2020) • Assets₱ 581.8 million (2020) • Expenditure₱ 223.2 million (2020)Service provider • ElectricityZambales 2 Electric Cooperative (ZAMECO 2)Time zoneUTC+8 (PST)ZIP code2207PSGC037111000IDD : area code +63 (0)47Native languagesIlocano Tagalog Sambal Ambala Mag-antsi Mag-indi"
        ],
        [
            "San Marcelino, officially the Municipality of San Marcelino  (Ilocano: Ili ti San Marcelino; Tagalog: Bayan ng San Marcelino), is a 1st class municipality in the province of Zambales, Philippines.",
            "According to the 2020 census, it has a population of 37,719 people."
        ],
        [
            "The municipality is home to Mapanuepe Lake that formed after the 1991 eruption of Mount Pinatubo."
        ],
        [
            "Etymology"
        ],
        [
            "The town got its name after the first Capitan Municipal whose name was Marcelino de Oraá Lecumberri.",
            "The people of this municipality during that time were fond of saints, so they added \"San\" to the name Marcelino, thus making it San Marcelino.",
            "The first election was held on January 14, 1906, and Matias Apostol was the first elected president.",
            "San Marcelino was Christianized after the arrival of Father Guillermo and after his departure, the people rightfully chose San Guillermo as their town's patron saint."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "The area that is now known as San Marcelino was originally owned by Sambal-speaking peoples, but over time was purchased and became entirely owned by Ilocano-speaking peoples, hence the barangay name Laoag, named after one of their origins, Laoag, Ilocos Norte."
        ],
        [
            "Marcelinian civilization, according to old municipal documents, started at the peak of Vega Hill in the heart of an idyllic Zambales jungle.",
            "The pre-Hispanic settlers from the Ilocos Region were led by the ancestors of the Corpuses, Udans, Ragadios, Raguinis, Rabanes and Fabunans."
        ],
        [
            "Vega Hill reportedly measured 440.94 square kilometers.",
            "It used to be one of the three communities that comprised a town.",
            "The two others were what are now known as Castillejos and San Antonio"
        ],
        [
            "Naturally adventurous and united by their common struggles, the Ilocano settlers eventually left Vega Hill and stayed in Magaring, a place now known as Barangay Linasin.",
            "This area was, and still is, part of the town.",
            "Eventually, the Ilocanos decided to settle at the Poblacion.",
            "However, they refused to be integrated into the communities of the local residents.",
            "They lived according to their own traditions.",
            "They were governed by their obedience to their community elders."
        ],
        [
            "Spanish colonization era"
        ],
        [
            "When the Spaniards came, a Spanish friar, Father Guillermo, stayed at the Poblacion with the Marcelinian forefathers.",
            "In the succeeding years, more Spanish friars came, strengthening the stronghold of Christianity among the Ilocano settlers.",
            "The need for formalizing a political/administrative structure of the town also became evident as the population increased and the socio-economic life of the town became complex."
        ],
        [
            "Consequently, a government structure was set up under the leadership of the friars whose power, at this point in time, had become entrenched, and deeply anchored in religion.",
            "The friars appointed local or district leaders, a cabeza de barangay for every barangay, among which were Consuelo, Nagbunga and Sinnerrekan (now known as Linusungan).",
            "The number of barangays has expanded to 18 since then."
        ],
        [
            "In the settlers' barangay of barrio, a middle-aged Teniente del Barrio, Marcelino Ora, was appointed."
        ],
        [
            "When the barangay needed to choose a patron saint, the leaders chose the priest who Christianized the town, Father Guillermo.",
            "Ath the time the priest had already left San Marcelino.",
            "Like Marcelino Ora, the title of Saint was apparently just attached to his name."
        ],
        [
            "San Marcelino was originally founded by the Ilocano settlers in Castillejos, as it was under the jurisdiction of Castillejos from 1843 to 1846, a barrio of San Narciso from 1846 to 1849, and a barrio of San Antonio from May 1849 to March 1852.",
            "Castillejos was reportedly the hub of leadership because when the Ilocanos arrived in the area, the Tagalog-speaking native residents were already organized there.",
            "While it was under Castillejos, conflict broke out between the Ilocano and Tagalog settlers due to the refusal of the Ilocanos to obey the town officials who were mostly Tagalog.",
            "To ease the enmity between the two groups, the Alcalde Mayor decided to separate San Marcelino from Castillejos."
        ],
        [
            "In 1843, the Marcelinians filed a petition for San Marcelino's elevation to Pueblo through the Teniente Primero, Antonio Ladrido Juliano.",
            "In 1846, the petition was approved."
        ],
        [
            "The elation over the appointment of a local leader did not last long.",
            "The Marcelinian elders became discontented over the fact that their appointed leaders turned out to be just nominal leaders.",
            "The friars still made decisions in relation to important matters.",
            "In addition, the friars reportedly became shockingly abusive."
        ],
        [
            "In anger, many of the leaders and pockets of townspeople joined the insurrectos - rebel groups.",
            "On the forefront were Jorge Udan, Francisco Corpus and Alipio Corpus.",
            "Relenting to the demands of the majority of the people, the friars later agreed to give the leaders more participation in running their respective districts."
        ],
        [
            "On March 10, 1852, San Marcelino held its first municipal election for a Teniente Absoluto.",
            "At this point, historical records became confusing.",
            "The next account has dated January 14, 1906 when Matias Apostol was reportedly installed as the first elected President of San Marcelino.",
            "From then on, the progressive development of San Marcelino continued under duly elected leaders."
        ],
        [
            "American invasion era"
        ],
        [
            "From late 1900 to March 1902, the 25th Infantry Regiment, operated in Zambales, including San Marcelino, during the Philippine–American War, with elements in San Marcelino in December 1900 and March 1902."
        ],
        [
            "In 1904, due to Act Number 945 of the Philippine Commission, San Marcelino's municipal oversight was extended to neighboring Castillejos and San Antonio."
        ],
        [
            "Geography"
        ],
        [
            "San Marcelino is 51 kilometres (32 mi) from Iba, 27 kilometres (17 mi) from Olongapo, and 153 kilometres (95 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "San Marcelino is politically subdivided into 18 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aglao"
        ],
        [
            "Buhawen"
        ],
        [
            "Burgos (Poblacion)"
        ],
        [
            "Central (Poblacion)"
        ],
        [
            "Consuelo Norte"
        ],
        [
            "Consuelo Sur (Poblacion)"
        ],
        [
            "La Paz (Poblacion)"
        ],
        [
            "Laoag"
        ],
        [
            "Linasin"
        ],
        [
            "Linusungan"
        ],
        [
            "Lucero (Poblacion)"
        ],
        [
            "Nagbunga"
        ],
        [
            "Rabanes"
        ],
        [
            "Rizal (Poblacion)"
        ],
        [
            "San Guillermo (Poblacion)"
        ],
        [
            "San Isidro (Poblacion)"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Fe"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Marcelino, Zambales"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "8(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "15(0.6)"
        ],
        [
            "34(1.3)"
        ],
        [
            "138(5.4)"
        ],
        [
            "203(8.0)"
        ],
        [
            "242(9.5)"
        ],
        [
            "233(9.2)"
        ],
        [
            "201(7.9)"
        ],
        [
            "126(5.0)"
        ],
        [
            "50(2.0)"
        ],
        [
            "21(0.8)"
        ],
        [
            "1,280(50.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.7"
        ],
        [
            "4.1"
        ],
        [
            "6.5"
        ],
        [
            "11.2"
        ],
        [
            "21.2"
        ],
        [
            "24.9"
        ],
        [
            "27.7"
        ],
        [
            "26.5"
        ],
        [
            "25.5"
        ],
        [
            "21.8"
        ],
        [
            "12.6"
        ],
        [
            "5.6"
        ],
        [
            "191.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San MarcelinoYearPop.±% p.a.1903 5,041—    1918 6,346+1.55%1939 8,409+1.35%1948 10,316+2.30%1960 13,914+2.52%1970 17,801+2.49%1975 20,735+3.11%1980 24,964+3.78%1990 36,598+3.90%1995 24,425−7.30%2000 25,440+0.88%2007 29,052+1.85%2010 31,879+3.44%2015 33,665+1.04%2020 37,719+2.26%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Marcelino was 37,719 people, with a density of 90 inhabitants per square kilometre or 230 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Marcelino"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  12.50"
        ],
        [
            "2009  14.79"
        ],
        [
            "2012  14.10"
        ],
        [
            "2015  15.24"
        ],
        [
            "2018  9.06"
        ],
        [
            "2021  21.15"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "San Marcelino Airfield"
        ],
        [
            "San Marcelino Airfield was built before the war by the Americans.",
            "On the morning of 29 January 1945 nearly 35,000 U.S. troops landed just north-west of San Marcelino.",
            "Elements of the US 38th Division immediately dashed inland to take the airstrip, but found that Filipino soldiers of the 3rd, 32nd, 33rd, 35th and 36th Infantry Division of the Philippine Commonwealth Army and the recognized guerrillas under the command of Capt.",
            "Ramon Magsaysay, later President of the Republic of the Philippines, had secured the field three days earlier."
        ],
        [
            "After the liberation by combined Filipino-American troops in Zambales in 1945, it was developed into a Fifth Air Force command facility as well as an operational airfield.",
            "With the end of the war, the airfield was closed and is now part of the town of San Marcelino."
        ],
        [
            "President Ramon Magsaysay State University"
        ],
        [
            "President Ramon Magsaysay State University - San Marcelino Campus, formerly known as Western Luzon Agricultural College (WLAC) and as Ramon Magsaysay Technological University - San Marcelino Campus is a government funded higher education institution in Zambales established in 1910 and converted into a state university in 1998 thus changing its name from Western Luzon Agricultural College to President Ramon Magsaysay State University - San Marcelino Campus under the university system.",
            "The main campus of PRMSU is located in the Municipality of Iba, Zambales.",
            "The university is named after the province's greatest son and former President of the Republic of the Philippines, President Ramon Magsaysay.",
            "Aside from the San Marcelino Campus, it also has satellite campuses in the municipalities of Santa Cruz, Candelaria, Masinloc, Botolan and Castillejos - all in the province of Zambales.",
            "The university also offers nursing courses at the Mondriaan Aura College in SBMA under a consortium program."
        ],
        [
            "PRMSU is one of the fastest growing state universities in the country.",
            "This was proven when the Department of Budget and Management in 2007 classified RMTU as a Level III-A university, thus leveling with established universities in Metro Manila like the University of the Philippines and the Polytechnic University of the Philippines."
        ],
        [
            "On February 12, 1998, President Fidel Ramos signed Republic Act 8498 authored by Zambales 2nd District Representative Antonio Magsaysay Diaz.",
            "The law integrated the Ramon Magsaysay Polytechnic College in Iba, the Western Luzon Agricultural College in San Marcelino (with campus in the Municipality of Botolan), and the Candelaria School of Fisheries in Candelaria into a university system known as Ramon Magsaysay Technological University.",
            "A three- year transition period transpired before the formal operation of the university in 2001.",
            "In the same year, Dr. Feliciano S. Rosete was invested as the first president of the university."
        ],
        [
            "Festivals"
        ],
        [
            "Singkamas Festival"
        ],
        [
            "Mango Festival"
        ],
        [
            "References"
        ],
        [
            "^ \"San Marcelino Hymn - San Marcelino Zambales\".",
            "San Marcelino Zambales Official Website."
        ],
        [
            "^  Municipality of San Marcelino |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Reed, William Allan (1904).",
            "Negritos of Zambales, Volume 2, Parts 1-3.",
            "Bureau of Public Printing.",
            "p. 218.",
            "Retrieved 7 September 2014."
        ],
        [
            "^ Tina (29 June 2006).",
            "\"Facts & Figures\".",
            "www.classof1974sws.org/.",
            "wordpress.org.",
            "Retrieved 5 September 2014."
        ],
        [
            "^ a b Brief History of Castillejos"
        ],
        [
            "^ Who We Are: Zambales"
        ],
        [
            "^ Nankivell, John Henry (1927).",
            "Buffalo Soldier Regiment: History of the Twenty-fifth United States Infantry, 1869-1926.",
            "U of Nebraska Press.",
            "pp. 94–97.",
            "ISBN 9780803283794.",
            "Retrieved 7 September 2014."
        ],
        [
            "^ Barry, Brigadier General Thomas H. (6 June 1901).",
            "\"General Orders, No.",
            "114\".",
            "Hearings Before the Committee on the Philippines of the United States Senate in Relation to Affairs in the Philippine Islands , Volume 2.",
            "U.S. Government Printing Office.",
            "pp. 1174–1175.",
            "Retrieved 7 September 2014."
        ],
        [
            "^ Root, Elihu (1905).",
            "Elihu Root collection of United States documents relating to the Philippine Islands, Volume 123.",
            "Government Printing Office.",
            "p. 100.",
            "Retrieved 6 September 2014."
        ],
        [
            "^ Reed, William Allan (1904).",
            "Negritos of Zambales, Volume 2, Parts 1-3.",
            "Bureau of Public Printing.",
            "p. 30.",
            "Retrieved 7 September 2014."
        ],
        [
            "^ Annual Reports of the War Department, Volume 12.",
            "U.S. Government Printing Office.",
            "1905. p. 341.",
            "Retrieved 7 September 2014."
        ],
        [
            "^"
        ],
        [
            "\"Province: Zambales\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Marcelino: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Zambales\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Smith, Robert Ross (29 May 2011).",
            "Triumph in the Philippines (PDF).",
            "Washington, D.C.: United States Army.",
            "pp. 67–68.",
            "ISBN 978-1-4102-2495-8."
        ],
        [
            "^ Cate, James Lea; Craven, Wesley Frank, eds.",
            "(1948).",
            "The Army Air Forces in World War II.",
            "DIANE Publishing.",
            "p. 424.",
            "ISBN 9781428915909.",
            "Retrieved 20 March 2013."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Marcelino, Zambales."
        ],
        [
            "San Marcelino Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "\"US Amphibious Assault on Zambales: 29 January 1945\" (PDF).",
            "The Reports of General MacArthur.",
            "United States Army.",
            "1995."
        ],
        [
            "Places adjacent to San Marcelino"
        ],
        [
            "Botolan"
        ],
        [
            "Porac, Pampanga"
        ],
        [
            "San FelipeSan Narciso"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Antonio"
        ],
        [
            "Castillejos / Subic"
        ],
        [
            "Floridablanca, Pampanga"
        ],
        [
            "vte Province of ZambalesIba (capital)  Olongapo (largest city)Municipalities"
        ],
        [
            "Botolan"
        ],
        [
            "Cabangan"
        ],
        [
            "Candelaria"
        ],
        [
            "Castillejos"
        ],
        [
            "Iba"
        ],
        [
            "Masinloc"
        ],
        [
            "Palauig"
        ],
        [
            "San Antonio"
        ],
        [
            "San Felipe"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Narciso"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Subic"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Olongapo (Administratively independent from the province but grouped under Zambales by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Zambales"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Marcelino&oldid=1223953118\""
        ],
        [
            "Category: Municipalities of ZambalesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from May 2011All articles needing additional referencesAll articles with unsourced statementsArticles with unsourced statements from March 2018Pages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textArticles with unsourced statements from August 2022All articles with vague or ambiguous timeVague or ambiguous time from August 2022Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}