{
    "name": "San Jose",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Jose, Nueva Ecija"
        ],
        [
            "22 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogТатарча / tatarçaWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°48′13.32″N 120°59′56.76″E﻿ / ﻿15.8037000°N 120.9991000°E﻿ / 15.8037000; 120.9991000"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Component city in Nueva Ecija, Philippines"
        ],
        [
            "For the other places named \"San Jose\" in the Philippines, see San Jose (disambiguation)."
        ],
        [
            "Component city in Central Luzon, PhilippinesSan JoseComponent cityCity of San Jose"
        ],
        [
            "(From top, left to right : Saint Joseph the Worker Cathedral Parish • Old Philippine National Railway station • Poblacion • San Jose City Hall • Tayabo Nature Park • San Jose City Clock Tower )"
        ],
        [
            "SealNickname(s): Christmas Capital of Nueva Ecija  Rice Granary of Nueva EcijaAnthem: San Jose Hymn (Filipino: Himno ng San Jose)Map of Nueva Ecija with San Jose highlightedSan JoseLocation within the PhilippinesCoordinates: 15°48′13.32″N 120°59′56.76″E﻿ / ﻿15.8037000°N 120.9991000°E﻿ / 15.8037000; 120.9991000CountryPhilippinesRegionCentral LuzonProvinceNueva EcijaDistrict"
        ],
        [
            "2nd districtFoundedMarch 19, 1894CityhoodAugust 4, 1969Named forSt.",
            "JosephBarangays38"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Panlungsod • MayorMario O. Salvador • Vice MayorAlexis G. Salvador • RepresentativeJoseph Gilbert F. Violago • City Council"
        ],
        [
            "Members"
        ],
        [
            "Evangel Shalom S. ManugueCarina Clarizz M. Dela CruzPatrixie DP.",
            "Salvador-GarciaEdgardo F. AgliamBanjo Z. MunarManuel G. Chua, JrRoy D. AndresVictoria V. AdawagGlenda F. MacadangdangSusan B. Corpuz"
        ],
        [
            " • Electorate99,276 voters (2022)Area • Revenue₱ 926.9 million (2020) • Assets₱ 2,713 million (2020) • Expenditure₱ 867.8 million (2020) • Liabilities₱ 384.8 million (2020)Service provider • ElectricitySan Jose City Electric Cooperative (SAJELCO)Time zoneUTC+8 (PST)ZIP code3121PSGC034926000IDD : area code +63 (0)44Native languagesIlocano TagalogWebsitewww.sjc.gov.ph"
        ],
        [
            "San Jose, officially the City of San Jose (Filipino: Lungsod ng San Jose; Ilocano: Siudad ti San Jose), is a 3rd class component city in the province of Nueva Ecija, Philippines.",
            "According to the 2020 census, it has a population of 150,917 people."
        ],
        [
            "Etymology"
        ],
        [
            "The town got its name after Saint Joseph, the patron saint of the place."
        ],
        [
            "Before the city was founded by the Spanish colonizers, it is known as Kabaritan, named for the plant commonly seen in the area."
        ],
        [
            "History"
        ],
        [
            "San Jose, years before it became a town was a wilderness, a veritable hunting ground for wild animals by the inhabitants of its neighboring towns.",
            "The earliest inhabitants were known as Negritos (Baluga) headed by Kapitan Danding, a Negrito convert residing in Pinagcuartelan.",
            "These early inhabitants depended mostly on hunting and fishing for their livelihood.",
            "Some hunters from the neighboring towns found San Jose as a good place for settlers due to its wide and uncleared agricultural land.",
            "The first group of settlers made some clearings (kaingin) in the outskirts of the present town."
        ],
        [
            "Originally, San Jose was a part of the town of Puncan, but later on, because of its nearness to Lupao, it was made a barrio of the latter.",
            "The early history of this town was coupled with the early history of Puncan and Lupao.",
            "Formerly, San Jose was known as the barrio of “Kabaritan” derived from barit, an Ilocano word for a plant that belongs to the rattan family.",
            "“Kabaritan” means the place where “barit” grows in abundance."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "On March 19, 1894, San Jose became a full-fledged town, with an interim government headed by a Capitan Municipal.",
            "“Kabaritan” (now known as San Jose) was made an independent town from Lupao and was named after Saint Joseph, the patron saint of the place."
        ],
        [
            "During the Spanish Regime, the barrio of Kabaritan was a municipal district of Lupao, headed by a Teniente Absoluto.",
            "Later, when Kabaritan was declared a town in 1894, the head was changed to a Capitan Municipal.",
            "The first appointed Capitan Municipal was Canuto Ramos, who served from 1894 to 1898.",
            "One of his remarkable achievements was the construction of an irrigation system which was later taken over and enlarged by the government (now the Talavera River Irrigation System) which irrigates vast ricefields as far as the towns of Muñoz and Talavera."
        ],
        [
            "Several years before the Philippine Revolution, the Ilocanos from Ilocos Region and some parts of Nueva Ecija, especially the towns of Santo Domingo, Muñoz and Lupao, as well as Pangasinenses of Pangasinan and northern Tarlac, Tagalogs (including Batangueños) and Kapampangans, settled into the forest of Kabaritan, and cleared its wilderness.",
            "It was from this time then that the growth of the town really started."
        ],
        [
            "American era"
        ],
        [
            "When the revolution broke out and upon the surrender of the Spaniards in 1898, a revolutionary government was set up in San Jose.",
            "The town remained as such until the establishment of a civil government under the Americans in 1901."
        ],
        [
            "San Jose, under the American Regime, became a progressive town.",
            "Its inhabitants enjoyed more rights and privileges- political, economic, intellectual and religious than before.",
            "This was due to the establishment of various schools, churches, public buildings and the construction of roads and bridges, which made possible the fast progress of the town."
        ],
        [
            "From 1898 to 1900, a military government under the American Regime was established.",
            "Jose Cardenas was appointed Capitan Municipal.",
            "During his term, the appointment of town officials, town planning, and the opening of new settlements were among his achievements."
        ],
        [
            "The second appointed Capitan Municipal during the military government (1900–1901) was Celestino Javalde who continued the opening of new settlements and the construction of roads in the poblacion."
        ],
        [
            "When the civil government under the American Regime was established, Cornelio Ramos was appointed Capitan Municipal.",
            "He continued the construction of roads in the poblacion and he also took a hand in the construction of irrigation canals leading to the different barrios of San Jose."
        ],
        [
            "In 1904, the Filipinos were given more rights and freedom in choosing the right man to take the reins of the government.",
            "An election was held.",
            "The first elected Municipal President was Crisanto Sanchez (1904–1906).",
            "Among his achievements were the construction of roads, the naming of the streets in the poblacion and the appointments of municipal officials."
        ],
        [
            "Again, (1906–1908) Celestino Javalde was elected Municipal President.",
            "With the help of his vice-president and other municipal officials, he stressed land reforms, which paved the way for equal distribution of lands."
        ],
        [
            "The President-elect of 1908–1910, Valerio Escobar concentrated on the construction of roads from Sibut to San Agustin.",
            "He also founded the barrios of Santa Barbara and Kapisungan (now Bagong Sikat)."
        ],
        [
            "Desiderio De Guzman was elected in 1910 and served up to 1912.",
            "He had many achievements but among all these, he paid more attention to the improvements of records in the Poblacion."
        ],
        [
            "During the incumbency of Municipal President Agapito Kurameng, (1912–1916), he initiated the construction of a concrete elementary school building (Gabaldon building) which now comprised one of the central school buildings of the San Jose West Elementary School.",
            "The improvement of roads, expropriation of lots for the Municipal Hall and the Public Market were among his other achievements."
        ],
        [
            "The construction of the Municipal building and the construction of more roads leading to the barrios were launched by Gregorio Cadhit (1916–1919).",
            "He was re-elected to office from 1919 to 1922.",
            "During his second term, he initiated the construction of one of the buildings of the public market."
        ],
        [
            "As years went by, the town developed such that there was a need for more public improvements and building constructions for the welfare of the populace.",
            "To meet these demands, the newly elected President Rafael Rueda and Vice-president Estanislao Arquero with the help of other municipal officials put up a Puericulture Center and a Municipal Nursery from 1922 to 1925.",
            "A second building for the public market was also constructed.",
            "Telephone lines connecting the poblacion with all the barrios were installed.",
            "A road to Kalbarito (now Palestina) was constructed and more improvement of roads was done."
        ],
        [
            "Raymundo Eugenio was elected Municipal President of San Jose for the period from 1925 to 1928.",
            "A third building for the public market was constructed and more construction of roads, especially those leading to Andres Bonifacio, were put underway."
        ],
        [
            "In 1928–1931, Apolonio Pascual and Vice-president Victorino Villar were instrumental in putting up the fourth building for the public market and the municipal dispensary.",
            "More improvement of roads leading to the barrios was also done."
        ],
        [
            "Raymundo Eugenio was re-elected to the office.",
            "He served from 1931 to 1934 with Vice-president Ladislao Bunag.",
            "Eugenio was called the road-building President of San Jose because of his efforts in the construction of many roads especially leading to the barrios of Bagong Bayan, Porais, Tondod, and Andres Bonifacio."
        ],
        [
            "Apolonio Pascual was re-elected for the 1934–1937 term.",
            "Dimas Tomas was his vice president.",
            "Changes in the set-up in 1935 upon the establishment of the Philippine Commonwealth marked the transition of the heads of the municipal government to be known as the Alcalde and Vice-Alcalde.",
            "Aside from the construction of more roads, the barrios of Patacla (now San Francisco) and A. Pascual were founded.",
            "The waterworks that provide the people of San Jose with drinking water was constructed and installed.",
            "The home economics building of San Jose Central School was also constructed."
        ],
        [
            "Alcalde Pedro Del Pilar and Vice-Alcalde Severino Bautista, under the Commonwealth government, established NARIC (National Rice and Corn) buying stations in the town.",
            "This was during their term of office from 1937 to 1940.",
            "They were re-elected for the 1940–1942 term.",
            "As a continuation of their policies, the improvement of roads was continued."
        ],
        [
            "Japanese occupation"
        ],
        [
            "Upon the outbreak of World War II on December 8, 1941, San Jose became an evacuation center for refugees from neighboring provinces especially those from Manila and its suburbs.",
            "The town was bombed by two Japanese planes on December 23, 1941.",
            "The terror-stricken populace, who suffered heavy casualties, fled to the remotest barrios of San Jose.",
            "An emergency government was established in the barrio of Porais with Basilio Duran as Mayor, appointed by the military forces of the Commonwealth Government.",
            "The emergency government existed for a short time, due to the arrival of the Japanese Imperial Forces on January 26, 1942."
        ],
        [
            "An emergency government, under the control of the Japanese Imperial Forces, was likewise established in Porais with Matias Bautista as Mayor.",
            "Due to the non-cooperation of Bautista, the Japanese army replaced him with Anastacio Bascos.",
            "Engr.",
            "Casimiro Panajon succeeded him, but was later murdered by the Japanese for his non-collaboration with them and his guerilla activities."
        ],
        [
            "During the liberation, Anselmo Patacsil, Pedro Del Pilar and Basilio Duran were appointed in succession as Mayors  by the PCAU (Philippine Civil Affairs Unit).",
            "Each served for a short period of time in 1945–1946.",
            "They strived once more for the re-organization of the Municipal Government in cooperation with officials to coordinate the work of the PCAU.",
            "These persons helped in the establishment of emergency hospitals, the North Provincial High School and the re-opening of elementary schools."
        ],
        [
            "Philippine independence"
        ],
        [
            "After Philippine independence in 1946, Alfonso Villamar was elected Mayor with Paulino Margarejo as his Vice Mayor, (1947–1951).",
            "Among their achievements were the maintenance of evacuees, pacification campaign, rehabilitation of devastated government building, the establishment of a fire department and a municipal library and the improvement of roads."
        ],
        [
            "Creation of Llanera"
        ],
        [
            "In 1954, the barrios of Bagumbayan (townsite), Andres Bonifacio, Caridad, San Mauricio (portion), Parang Manga (portion), Santa Barbara, Floridablanca, Gomez, San Francisco, and Victoria were separated to form the town of Llanera along with some territory from Talavera and Rizal."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "On August 4, 1969, by virtue of Republic Act 6051, San Jose was converted into a city, making it as the third city in Nueva Ecija after Cabanatuan and Palayan."
        ],
        [
            "Geography"
        ],
        [
            "San Jose has a tropical wet and dry climate  (Köppen-Geiger system: Aw),The average annual temperature is 26.7 °C in San Jose.",
            "Precipitation here averages 1869 mm.",
            "The city of San Jose lies at 15° 47' North, 120° 59' East in Central Luzon.",
            "The estimated elevation at these coordinates is approximately 109.9 meters"
        ],
        [
            "San Jose City is 43 kilometres (27 mi) from Cabanatuan, 57 kilometres (35 mi) from Palayan, 159 kilometres (99 mi) from Manila, and 106 kilometres (66 mi) from Bayombong."
        ],
        [
            "Barangays"
        ],
        [
            "San Jose City Hall"
        ],
        [
            "San Jose City is politically subdivided into 38 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Barangay"
        ],
        [
            "PSGC"
        ],
        [
            "Urban/Rural"
        ],
        [
            "A. Pascual"
        ],
        [
            "34926001"
        ],
        [
            "Rural"
        ],
        [
            "Abar 2nd"
        ],
        [
            "34926003"
        ],
        [
            "Rural"
        ],
        [
            "Abar Ist"
        ],
        [
            "34926002"
        ],
        [
            "Urban"
        ],
        [
            "Bagong Sikat"
        ],
        [
            "34926004"
        ],
        [
            "Rural"
        ],
        [
            "Caanawan"
        ],
        [
            "34926005"
        ],
        [
            "Rural"
        ],
        [
            "Calaocan"
        ],
        [
            "34926006"
        ],
        [
            "Urban"
        ],
        [
            "Camanacsacan"
        ],
        [
            "34926007"
        ],
        [
            "Rural"
        ],
        [
            "Canuto Ramos Poblacion (District III)"
        ],
        [
            "34926021"
        ],
        [
            "Rural"
        ],
        [
            "Crisanto Sanchez Poblacion (District V)"
        ],
        [
            "34926023"
        ],
        [
            "Rural"
        ],
        [
            "Culaylay"
        ],
        [
            "34926008"
        ],
        [
            "Rural"
        ],
        [
            "Dizol"
        ],
        [
            "34926009"
        ],
        [
            "Rural"
        ],
        [
            "Ferdinand E. Marcos Poblacion (District II)"
        ],
        [
            "34926020"
        ],
        [
            "Rural"
        ],
        [
            "Kaliwanagan"
        ],
        [
            "34926010"
        ],
        [
            "Rural"
        ],
        [
            "Kita-Kita"
        ],
        [
            "34926011"
        ],
        [
            "Rural"
        ],
        [
            "Malasin"
        ],
        [
            "34926012"
        ],
        [
            "Urban"
        ],
        [
            "Manicla"
        ],
        [
            "34926013"
        ],
        [
            "Rural"
        ],
        [
            "Palestina"
        ],
        [
            "34926014"
        ],
        [
            "Rural"
        ],
        [
            "Parang Mangga"
        ],
        [
            "34926015"
        ],
        [
            "Rural"
        ],
        [
            "Pinili"
        ],
        [
            "34926017"
        ],
        [
            "Rural"
        ],
        [
            "Porais"
        ],
        [
            "34926024"
        ],
        [
            "Rural"
        ],
        [
            "Rafael Rueda Sr. Poblacion (District I)"
        ],
        [
            "34926019"
        ],
        [
            "Urban"
        ],
        [
            "Raymundo Eugenio Poblacion (District IV)"
        ],
        [
            "34926022"
        ],
        [
            "Urban"
        ],
        [
            "San Agustin"
        ],
        [
            "34926027"
        ],
        [
            "Rural"
        ],
        [
            "San Juan"
        ],
        [
            "34926028"
        ],
        [
            "Rural"
        ],
        [
            "San Mauricio"
        ],
        [
            "34926029"
        ],
        [
            "Rural"
        ],
        [
            "Santo Niño 1st"
        ],
        [
            "34926030"
        ],
        [
            "Urban"
        ],
        [
            "Santo Niño 2nd"
        ],
        [
            "34926031"
        ],
        [
            "Urban"
        ],
        [
            "Santo Niño 3rd"
        ],
        [
            "34926035"
        ],
        [
            "Urban"
        ],
        [
            "Santo Tomas"
        ],
        [
            "34926032"
        ],
        [
            "Rural"
        ],
        [
            "Sibut"
        ],
        [
            "34926033"
        ],
        [
            "Urban"
        ],
        [
            "Sinipit Bubon"
        ],
        [
            "34926034"
        ],
        [
            "Rural"
        ],
        [
            "Tabulac"
        ],
        [
            "34926036"
        ],
        [
            "Rural"
        ],
        [
            "Tayabo"
        ],
        [
            "34926037"
        ],
        [
            "Rural"
        ],
        [
            "Tondod"
        ],
        [
            "34926038"
        ],
        [
            "Rural"
        ],
        [
            "Tulat"
        ],
        [
            "34926039"
        ],
        [
            "Rural"
        ],
        [
            "Villa Floresca"
        ],
        [
            "34926040"
        ],
        [
            "Rural"
        ],
        [
            "Villa Joson (Parilla)"
        ],
        [
            "34926016"
        ],
        [
            "Rural"
        ],
        [
            "Villa Marina"
        ],
        [
            "34926042"
        ],
        [
            "Rural"
        ],
        [
            "Climate"
        ],
        [
            "The city has two pronounced seasons, rainy season from the months of May to November and the dry season in the remaining months."
        ],
        [
            "Climate data for San Jose, Nueva Ecija"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.7(85.5)"
        ],
        [
            "30.6(87.1)"
        ],
        [
            "32.1(89.8)"
        ],
        [
            "33.4(92.1)"
        ],
        [
            "33.8(92.8)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "31.0(87.8)"
        ],
        [
            "31.2(88.2)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "30.5(86.9)"
        ],
        [
            "30.0(86.0)"
        ],
        [
            "33.8(92.8)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "25.2(77.4)"
        ],
        [
            "26.6(79.9)"
        ],
        [
            "27.9(82.2)"
        ],
        [
            "28.5(83.3)"
        ],
        [
            "27.9(82.2)"
        ],
        [
            "27.3(81.1)"
        ],
        [
            "27.0(80.6)"
        ],
        [
            "27.1(80.8)"
        ],
        [
            "26.9(80.4)"
        ],
        [
            "26.0(78.8)"
        ],
        [
            "25.4(77.7)"
        ],
        [
            "28.5(83.3)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19.8(67.6)"
        ],
        [
            "19.9(67.8)"
        ],
        [
            "21.1(70.0)"
        ],
        [
            "22.5(72.5)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "23.0(73.4)"
        ],
        [
            "23.1(73.6)"
        ],
        [
            "23.0(73.4)"
        ],
        [
            "22.5(72.5)"
        ],
        [
            "21.6(70.9)"
        ],
        [
            "20.8(69.4)"
        ],
        [
            "19.8(67.6)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "14.0(0.55)"
        ],
        [
            "19.0(0.75)"
        ],
        [
            "36.0(1.42)"
        ],
        [
            "54.0(2.13)"
        ],
        [
            "201.0(7.91)"
        ],
        [
            "214.0(8.43)"
        ],
        [
            "332.0(13.07)"
        ],
        [
            "350.0(13.78)"
        ],
        [
            "271.0(10.67)"
        ],
        [
            "201.0(7.91)"
        ],
        [
            "128.0(5.04)"
        ],
        [
            "49.0(1.93)"
        ],
        [
            "1,869(73.58)"
        ],
        [
            "Average rainy days (≥ 0.1 mm)"
        ],
        [
            "1"
        ],
        [
            "3"
        ],
        [
            "3"
        ],
        [
            "3"
        ],
        [
            "13"
        ],
        [
            "13"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "9"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "103"
        ],
        [
            "Source 1: Climate-Data"
        ],
        [
            "Source 2: Storm247"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San JoseYearPop.±% p.a.1903 3,744—    1918 15,592+9.98%1939 28,666+2.94%1948 33,017+1.58%1960 38,078+1.20%1970 70,314+6.32%1975 58,387−3.66%1980 64,254+1.93%1990 82,836+2.57%1995 96,860+2.97%2000 108,254+2.41%2007 122,353+1.70%2010 129,424+2.07%2015 139,738+1.47%2020 150,917+1.52%Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "Spoken languages in San Jose City"
        ],
        [
            "Languages"
        ],
        [
            "percentage"
        ],
        [
            "Tagalog"
        ],
        [
            "72.1%"
        ],
        [
            "Pangasinense"
        ],
        [
            "10.2%"
        ],
        [
            "Ilocano"
        ],
        [
            "9.2%"
        ],
        [
            "Others"
        ],
        [
            "8%"
        ],
        [
            "The current population of San Jose City is 129,424 people in 23,191 households as of May 2010.",
            "The majority language used is Tagalog, more than 72 percent of the population speak it as their native tongue, followed by Ilocano, Kapampangan, and Pangasinense."
        ],
        [
            "Religion"
        ],
        [
            "Cathedral of Saint Joseph the Worker"
        ],
        [
            "On February 16, 1984, the Diocese of San Jose was created by Pope John Paul II.",
            "The creation of the new diocese bisected the province horizontally into the Diocese of Cabanatuan in the south, and the Diocese of San Jose in the north, both the suffragans of the Archdiocese of Lingayen-Dagupan.",
            "80% of the city residents are Catholics and the patron saint is Saint Joseph.",
            "The feast is celebrated every March 19 annually.",
            "The diocese now has 17 parishes administered by 22 priests working under one bishop.",
            "Among its Catholic institutions are 9 high schools, 4 elementary schools, 6 kindergarten schools, 1 diocesan catechetical center, and the Don Bosco Training Center."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Jose"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  14.60"
        ],
        [
            "2009  19.12"
        ],
        [
            "2012  14.16"
        ],
        [
            "2015  13.18"
        ],
        [
            "2018  4.61"
        ],
        [
            "2021  12.23"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agriculture is the prime revenue of San Jose City since it is a part of the rice granary of the Philippines.",
            "However other agri-based produce are vegetables, fruits and onions.",
            "The city is now a leading producer of onions in the country."
        ],
        [
            "The city's local crops range from rice, corn, and onion; thus the city is also referred to as the \"City of the Golden Harvests\" and “Rice Bowl of the Philippines.” Other crops are mango, banana, eggplant, and garlic."
        ],
        [
            "Industries"
        ],
        [
            "San Jose City is home to various renewable energy firms including the 24-megawatt San Jose City iPower Corporation.",
            "Considered the first of its kind in the country, the San Jose biomass project is using 100% rice husk.",
            "The biomass facility was put up by 21 rice millers of the city in a joint venture with the Union Energy Corp. owned by businessman Lucio Co, to set up a P1.2-billion rice husk-powered system that is now generating 12 megawatts of electricity, 10.8 MW of which feed the Luzon grid.",
            "Another 12 MW expansion was commissioned in 2017."
        ],
        [
            "In 2017, the Board of Investments (BOI) has approved the P777-million biomass power plant project of VS Gripal Power Corp. which involved the development, construction and operation of another 6 MW biomass power plant.",
            "Similarly, the plant generates power using rice husk as feedstock.",
            "Commercial operations started in December 2019."
        ],
        [
            "Meanwhile, several other solar energy projects was put up in the city including the 10 MW SJC SolarPower Corporation project and another 10 MW solar power project by V-Mars Solar Energy Corporation which was recently acquired by Yuchengco group's PetroGreen Energy Corp."
        ],
        [
            "Shopping centers"
        ],
        [
            "San Jose City serves as another shopping hub, besides Cabanatuan, in the province and other nearby localities and provinces like Pangasinan and Nueva Viscaya.",
            "Malls like Waltermart and Magic Mall have already established their presence in the city."
        ],
        [
            "In terms of future developments, the Philippines' major mall chains SM, Robinsons, and CityMall all have expressed plans to build branches in the city."
        ],
        [
            "Tourism"
        ],
        [
            "Tayabo Nature Park"
        ],
        [
            "Tayabo Nature Park"
        ],
        [
            "The park is situated at the gateway to the Cagayan Valley, at the foot of Mount Caraballo.",
            "It has a hundred step stairs leading to lamp-lit pagodas in the hilltop, and from the park can be seen Nueva Ecija."
        ],
        [
            "Palasapas Falls"
        ],
        [
            "This waterfall is located in the outskirts of the city, in the barrio Manicla, seven kilometers away from the Poblacion."
        ],
        [
            "Christmas Capital"
        ],
        [
            "In 2018, the city has been named as the Christmas Capital of Nueva Ecija for its grand Christmas lights."
        ],
        [
            "Festivals"
        ],
        [
            "Tanduyong Festival in 2013"
        ],
        [
            "Tanduyong Festival: San Jose City prides itself as the \"Onion Capital of the Philippines\" and is a leading producer of onion, garlic, rice and vegetables.",
            "Tanduyong is a variety of onion grown in the area.",
            "Every year, on the fourth Sunday of April, the people of San Jose celebrate the Tanduyong Festival.",
            "On festival day, the streets are filled with contingents of dancers outfitted in striking, multi-hued native costumes.",
            "Special activities included are a beauty contest, tourism, and trade fair, awarding ceremony and cultural shows."
        ],
        [
            "Pagibang Damara: Hundreds of years ago in Central Luzon, landlords in the haciendas made the farmers build the “damara”, just before planting time of palay.",
            "A “damara” is a makeshift shelter made from kawayan (bamboo) and nipa, built at the center of ricefields as a protection from the sun's heat or from rain.",
            "Over the years, it has been a tradition that after all the harvests were safely brought home, the “damaras” are demolished (“ginigiba”).",
            "People then start celebrating together for the bountiful harvest."
        ],
        [
            "In 2008, with rice as its primary produce, San Jose City conducted its First Rice Festival, adopting the century – old festive tradition.",
            "However, unlike in older days, wherein people celebrate separately in their barangays, San Jose City now celebrates together.",
            "The after-harvest celebration has become a multi-sectoral effort, collectively prepared, funded out of contributions (from the public and private sector), and participated in by all sections of the city."
        ],
        [
            "Since 2015, Pagibang Damara festival features the best Pancit Kanin contest.",
            "Pansit Kanin is one of the most common menus among carinderias in San Jose City."
        ],
        [
            "Transportation"
        ],
        [
            "San Jose City Central Terminal"
        ],
        [
            "Major bus companies from Metro Manila ply the route going to San Jose City along the Pan-Philippine Highway.",
            "Baliwag Transit, Inc. has terminal in Pasay and Cubao, Quezon City has buses that travel specifically to and from Nueva Ecija."
        ],
        [
            "Bus companies going to San Jose City:"
        ],
        [
            "Baliwag Transit Inc. From Cubao/Caloocan"
        ],
        [
            "Saulog Transit from Olongapo City"
        ],
        [
            "Arayat Express from Olongapo City"
        ],
        [
            "Genesis Transport from Mariveles, Bataan/San Fernando City, Pampanga"
        ],
        [
            "Golden Bee Transport and Logistics Corporation from Cubao/Pasay"
        ],
        [
            "Viron Transit from Narvacan, Ilocos Sur"
        ],
        [
            "Former PNR Station in San Jose"
        ],
        [
            "Ruins of the old PNR station in San Jose City"
        ],
        [
            "The Philippine National Railways (then Manila Railroad Company) used to have a branch line northwards from Tutuban station in Manila and branches out from the mainline in Tarlac City going to San Jose City.",
            "The Tarlac-San Jose line, which served the towns of Guimba, Muñoz and San Jose, was initially constructed in the 1920's and was completed in 1939.",
            "However, in 1988, the North Main Line was closed (see Philippine National Railways) and subsequently dismantled.",
            "The concrete ruins of the old MRR station of San Jose are located along San Roque Street in Barangay Abar 1st."
        ],
        [
            "Expressways and Bypass Roads"
        ],
        [
            "San Jose City shall also be serviced by a future expressway, which is the partially completed Central Luzon Link Expressway (SCTEX-TPLEX to San Jose City), when finished.",
            "The expressway will shorten the usual travel time between the neighboring provinces and San Jose City also stimulating the economy of the towns that the carriageway will pass through as a direct consequence."
        ],
        [
            "To decongest the Pan-Philippine Highway, San Jose City Bypass Road was constructed.",
            "It passes through barangays Caanawan, Abar 2nd, Sto.",
            "Niño 1st and 2nd, Malasin, Manicla and Kita-kita; and ends at San Jose-Lupao Road, serving as an easier access going to Tarlac and Umingan, Pangasinan."
        ],
        [
            "Education"
        ],
        [
            "San Jose Christian Colleges"
        ],
        [
            "San Jose City has many private and public schools."
        ],
        [
            "Private schools:"
        ],
        [
            "Bethany Christian Academy"
        ],
        [
            "Bettbien Montessori"
        ],
        [
            "Bascos San Jose School"
        ],
        [
            "Bettbien High School"
        ],
        [
            "College for Research & Technology- San Jose City Campus"
        ],
        [
            "Core Gateway College"
        ],
        [
            "Hope Of Manitoba Essential Academy (HOME Academy)"
        ],
        [
            "Mount Carmel Montessori Center"
        ],
        [
            "Nieves Center for Education, Inc. -San Jose City"
        ],
        [
            "San Jose Christian Colleges"
        ],
        [
            "School of the Sacred Heart of San Jose City"
        ],
        [
            "St. Joseph School"
        ],
        [
            "Gracious Shepherd Christian Academy"
        ],
        [
            "Keanney-Diaz Educational Institute"
        ],
        [
            "Elim School for Values and Excellence"
        ],
        [
            "Evangelical Christian Academy"
        ],
        [
            "St. John's Academy"
        ],
        [
            "STI College San Jose City"
        ],
        [
            "St. Augustine Foundation Colleges of Nueva Ecija Inc. San Jose City"
        ],
        [
            "Araullo University San Jose Campus"
        ],
        [
            "Public schools:"
        ],
        [
            "San Jose East Central School"
        ],
        [
            "San Jose West Central School"
        ],
        [
            "Abar Elementary School"
        ],
        [
            "Bagong Sikat Integrated School"
        ],
        [
            "Caanawan National High School"
        ],
        [
            "Caanawan Elementary School"
        ],
        [
            "Calaocan Elementary School"
        ],
        [
            "CLSU Laboratory High School-Pinili"
        ],
        [
            "San Jose City National High School (Formerly CPNHS)"
        ],
        [
            "Constancio Padilla National High School Kita-kita Annex"
        ],
        [
            "Porais National High School"
        ],
        [
            "Porais Elementary School"
        ],
        [
            "Pinili Elementary School"
        ],
        [
            "San Agustin Integrated School"
        ],
        [
            "Santo Tomas Elementary School"
        ],
        [
            "Santo Niño 3rd High School"
        ],
        [
            "Tayabo Elementary School"
        ],
        [
            "Tayabo High School - CPNHS Annex"
        ],
        [
            "Tondod High School"
        ],
        [
            "References"
        ],
        [
            "^  City of San Jose |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b \"San Jose City\".",
            "1stPhilippines.com.",
            "Archived from the original on May 25, 2013.",
            "Retrieved May 30, 2012."
        ],
        [
            "^ a b c Central Luzon Yearbook.",
            "s.n.",
            "1974. p. 206.",
            "Retrieved September 12, 2019."
        ],
        [
            "^ a b c d e f g h i Central Luzon Yearbook.",
            "s.n.",
            "1974. p. 207.",
            "Retrieved September 12, 2019."
        ],
        [
            "^ History of Nueva Ecija"
        ],
        [
            "^ a b \"Philippine History-American Period\".",
            "philippinecountry.com."
        ],
        [
            "^ \"An Act to Create the Municipality of Llanera in the Province of Nueva Ecija\".",
            "LawPH.com.",
            "Retrieved April 11, 2011."
        ],
        [
            "^ \"San Jose topographic map, relief map, elevations map\".",
            "topographic-map.com.",
            "Archived from the original on August 31, 2019.",
            "Retrieved August 31, 2019."
        ],
        [
            "^ a b c d \"San Jose City at a Glance\".",
            "sanjosecity-ne.gov.ph.",
            "Archived from the original on June 9, 2012."
        ],
        [
            "^ \"San Jose City climate: Average Temperature, weather by month, San Jose City weather averages - Climate-Data.org\".",
            "en.climate-data.org.",
            "Retrieved August 31, 2019."
        ],
        [
            "^ \"Weather for San Jose City, Philippines - Climate - Storm247.com\".",
            "uk.storm247.com.",
            "Retrieved August 31, 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Nueva Ecija\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"San Jose City Demographics\".",
            "SanJoseCity.gov.ph.",
            "Archived from the original on February 3, 2019.",
            "Retrieved June 1, 2019."
        ],
        [
            "^ \"Diocese of San Jose, Nueva Ecija\".",
            "Catholic Bishops Conference of the Philippines.",
            "Archived from the original on May 16, 2012.",
            "Retrieved June 25, 2012."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ SM Prime.",
            "\"SM PRIME HOLDINGS, INC. : OFFER SUPPLEMENT\" (PDF).",
            "SM Prime.",
            "Archived from the original (PDF) on January 30, 2022.",
            "Retrieved June 24, 2022."
        ],
        [
            "^ \"Nueva Ecija Tourist Attractions\".",
            "Department of Tourism."
        ],
        [
            "^ \"Nueva Ecija Tourist Attractions\".",
            "Department of Tourism."
        ],
        [
            "^ \"Mga display sa tinaguriang 'Christmas Capital of Nueva Ecija,' pinailawan | Videos\".",
            "www.gmanetwork.com.",
            "Retrieved December 19, 2021."
        ],
        [
            "^ Galang, Marilyn (November 11, 2018).",
            "\"Rice grain-shaped lanterns light up Nueva Ecija's Xmas capital\".",
            "Philippine Canadian Inquirer.",
            "Retrieved December 19, 2021."
        ],
        [
            "^ \"Recipe: Nueva Ecija's Pancit-Kanin\".",
            "ABS-CBN News.",
            "Archived from the original on June 9, 2016.",
            "Retrieved June 23, 2016."
        ],
        [
            "^ Corpuz, Arturo G. (1999).",
            "The Colonial Iron Horse: Railroads and Regional Development in the Philippines, 1875-1935.",
            "Quezon City: University of the Philippines Press.",
            "ISBN 9789715422208."
        ],
        [
            "^ News, TED CORDERO, GMA.",
            "\"DPWH: Central Luzon Link Expressway now 96% complete\".",
            "GMA News Online.",
            "Retrieved July 24, 2022.",
            "{{cite web}}: |last= has generic name (help)CS1 maint: multiple names: authors list (link)"
        ],
        [
            "^ Bettbien High School Archived February 27, 2012, at the Wayback Machine"
        ],
        [
            "^ San Jose Christian Colleges"
        ],
        [
            "External links"
        ],
        [
            "Wikivoyage has a travel guide for San Jose, Nueva Ecija."
        ],
        [
            "Wikimedia Commons has media related to San Jose, Nueva Ecija."
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived October 20, 2012, at the Wayback Machine"
        ],
        [
            "Places adjacent to San Jose, Nueva Ecija"
        ],
        [
            "Carranglan"
        ],
        [
            "LupaoScience City of Muñoz"
        ],
        [
            "San Jose"
        ],
        [
            "Pantabangan"
        ],
        [
            "Talavera"
        ],
        [
            "Llanera"
        ],
        [
            "Rizal"
        ],
        [
            "Articles Related to San Jose, Nueva Ecija"
        ],
        [
            "vte Province of Nueva EcijaPalayan (capital)  Cabanatuan (largest city)Municipalities"
        ],
        [
            "Aliaga"
        ],
        [
            "Bongabon"
        ],
        [
            "Cabiao"
        ],
        [
            "Carranglan"
        ],
        [
            "Cuyapo"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Guimba"
        ],
        [
            "Jaen"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Llanera"
        ],
        [
            "Lupao"
        ],
        [
            "Nampicuan"
        ],
        [
            "Pantabangan"
        ],
        [
            "Peñaranda"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Leonardo"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Zaragoza"
        ],
        [
            "Component cities"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Jose"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Germany"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Jose,_Nueva_Ecija&oldid=1227338631\""
        ],
        [
            "Categories: San Jose, Nueva EcijaCities in Nueva EcijaPopulated places established in 18941894 establishments in the PhilippinesComponent cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listCS1 errors: generic nameCS1 maint: multiple names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataUse mdy dates from July 2022Pages using infobox settlement with possible nickname listArticles containing Filipino-language textCoordinates on WikidataArticles containing Ilocano-language textAll articles with unsourced statementsArticles with unsourced statements from June 2021Commons category link from WikidataOfficial website different in Wikidata and WikipediaArticles with VIAF identifiersArticles with GND identifiers"
        ]
    ]
}