{
    "name": "San Pablo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Pablo, Isabela"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°26′52″N 121°47′42″E﻿ / ﻿17.4478°N 121.795°E﻿ / 17.4478; 121.795"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesSan Pablo"
        ],
        [
            "Cabagan ViejoMunicipalityMunicipality of San PabloSan Pablo de Cabagan Church Ruin"
        ],
        [
            "FlagSealMap of Isabela with San Pablo highlightedOpenStreetMapSan PabloLocation within the PhilippinesCoordinates: 17°26′52″N 121°47′42″E﻿ / ﻿17.4478°N 121.795°E﻿ / 17.4478; 121.795CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "1st districtEstablishedJanuary 1, 1910 (as San Pablo)Barangays17"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 203.9 million (2020) • Assets₱ 494.9 million (2020) • Expenditure₱ 144.3 million (2020) • Liabilities₱ 88.74 million (2020)Service provider • ElectricityIsabela 2 Electric Cooperative (ISELCO 2)Time zoneUTC+8 (PST)ZIP code3329PSGC023133000IDD : area code +63 (0)78Native languagesIbanag Ilocano TagalogWebsitewww.sanpablo-isabela.gov.ph"
        ],
        [
            "San Pablo, officially the Municipality of San Pablo (Ibanag: Ili nat San Pablo; Ilocano: Ili ti San Pablo; Tagalog: Bayan ng San Pablo), is a 2nd class municipality in the province of Isabela, Philippines.",
            "According to the 2020 census, it has a population of 26,320 people."
        ],
        [
            "San Pablo is 52 kilometres (32 mi) from Ilagan and 450 kilometres (280 mi) from Manila."
        ],
        [
            "An editor has launched a copyright investigation involving this section.",
            "The text under investigation is currently hidden from public view, but is accessible in the page history.",
            "Please do not remove this notice or restore blanked content until the issue is resolved by an administrator, copyright clerk, or volunteer response agent."
        ],
        [
            "The purported copyright violation copies text from https://provinceofisabela.ph/images/2018/History_of_Isabela/5-History%20of%20San%20Pablo%20Isabela.pdf (Copyvios report); as such, this page has been listed on the copyright problems page."
        ],
        [
            "Unless the copyright status of the text of this page or section is clarified and determined to be compatible with Wikipedia's content license, the problematic text and revisions or the entire page may be deleted one week after the time of its listing (i.e.",
            "after 13:32, 2 July 2024 (UTC))."
        ],
        [
            "What can I do to resolve the issue?"
        ],
        [
            "If you hold the copyright to this text, you can license it in a manner that allows its use on Wikipedia."
        ],
        [
            "You must permit the use of your material under the terms of the Creative Commons Attribution-Sharealike 3.0 Unported License (CC BY-SA 3.0) and the GNU Free Documentation License (GFDL) (unversioned, with no invariant sections, front-cover texts, or back-cover texts)."
        ],
        [
            "Explain your intent to license the content on this article's discussion page."
        ],
        [
            "To confirm your permission, you can either display a notice to this effect at the site of original publication or send an e-mail from an address associated with the original publication to permissions-enwikimedia.org or a postal letter to the Wikimedia Foundation.",
            "These messages must explicitly permit use under CC BY-SA and the GFDL.",
            "See Wikipedia:Donating copyrighted materials."
        ],
        [
            "Note that articles on Wikipedia must be written from a neutral point of view and must be verifiable in published third-party sources; consider whether, copyright issues aside, your text is appropriate for inclusion in Wikipedia."
        ],
        [
            "You can demonstrate that this text is in the public domain or is already under a license suitable for Wikipedia.",
            "Explain this on this article's discussion page, with reference to evidence.",
            "Wikipedia:Public domain and Wikipedia:Compatibly licensed may assist in determining the status."
        ],
        [
            "Otherwise, you may rewrite this page without copyright-infringing material.",
            "Your rewrite should be placed on this page, where it will be available for an administrator or clerk to review it at the end of the listing period.",
            "Follow this link to create the temporary subpage.",
            "Please mention the rewrite upon completion on this article's discussion page."
        ],
        [
            "Simply modifying copyrighted text is not sufficient to avoid copyright infringement—if the original copyright violation cannot be cleanly removed or the article reverted to a prior version, it is best to write the article from scratch.",
            "(See Wikipedia:Close paraphrasing.)"
        ],
        [
            "For license compliance, any content used from the original article must be properly attributed; if you use content from the original, please leave a note at the top of your rewrite saying as much.",
            "You may duplicate non-infringing text that you had contributed yourself."
        ],
        [
            "It is always a good idea, if rewriting, to identify the point where the copyrighted content was imported to Wikipedia and to check to make sure that the contributor did not add content imported from other sources.",
            "When closing investigations, clerks and administrators may find other copyright problems than the one identified.",
            "If this material is in the proposed rewrite and cannot be easily removed, the rewrite may not be usable."
        ],
        [
            "Steps to list an article at Wikipedia:Copyright problems:"
        ],
        [
            "Add the following to the bottom of Wikipedia:Copyright problems/2024 June 25: * {{subst:article-cv|San Pablo, Isabela}} from https://provinceofisabela.ph/images/2018/History_of_Isabela/5-History%20of%20San%20Pablo%20Isabela.pdf.",
            "~~~~"
        ],
        [
            "Add the following template to the talk page of the contributor of the material: {{subst:Nothanks-web|pg=San Pablo, Isabela|url=https://provinceofisabela.ph/images/2018/History_of_Isabela/5-History%20of%20San%20Pablo%20Isabela.pdf}} ~~~~"
        ],
        [
            "Place {{copyvio/bottom}} at the end of the portion you want to blank.",
            "If nominating the entire page, please place this template at the top of the page, set the \"fullpage\" parameter to \"yes\", and place {{copyvio/bottom}} at the very end or the article."
        ],
        [
            "History"
        ],
        [
            "San Pablo is the oldest pueblo in the Province of Isabela, dating back to its founding and continuing to this day.",
            "The land that is now the Municipality of San Pablo, Isabela, was historically part of the territory known as La Irraya.",
            "The Irraya territory (Addaya and Yrraya in other manuscripts) stretched from Tuguegarao in Cagayan province to the present-day Gamu town in Isabela province.",
            "Irraya was also used to refer to the natives' names and dialect.",
            "Irraya, an Ibanag word, means \"upriver\".",
            "In the Gaddang language, \"dirraya\" also means \"upriver\"."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "In 1607, the provincial chapter of the Holy Rosary Province (or Dominicans) directed Frays Luis Flores and Francisco Minaio to the Irraya-speaking Pilitan (now a barangay of Tumauini town) and its surrounding communities to make every effort to teach the natives Ibanag and minister to them in that language.",
            "In short, Ibanag (Ybanag) was declared the official language of the valley.",
            "The separate Irraya territory, its inhabitants, and the dialect eventually became extinct, and the entire area, its occupants, and language are now recognized in the modern world as Ibanag.",
            "Only a few people in Cabagan town's barangays Tallag and San Bernardo recall some Irraya phrases."
        ],
        [
            "Following the historic Irraya Revolt on November 8, 1621, Dominican missionary Fray Pedro de Santo Tomas organized a new town called Maquila at the junction of the Cagayan and Pinacanauan Rivers of Tuguegarao, bringing together Irrayas from the former Christian missions of Pilitan, Abbuatan, Bolo, and Batavag.",
            "The name Maquila comes from the Ibanag word \"quilat,\" which means \"clear,\" alluding to the clear water of the Pinacanauan River.",
            "Due to its proximity to Tuguegarao, the population of Maquila were relocated to a new site upstream southwards at the mouth of the Cagayan and Pinacanauan Rivers of Cabagan, which is now the poblasyon (town center) of San Pablo.",
            "The new site was dubbed Cabagan.",
            "The name Cabagan is derived from the native word \"bag\" or \"bajaque,\" which refers to stores that sell g-strings.",
            "Another version claimed that the name was derived from the term \"cabbagang,\" which means \"pilgrim\" or \"stranger,\" because the community was in regular touch with the other tribes in the area."
        ],
        [
            "The town was founded on 1646 as Maquila by Fr.",
            "Pedro de Santo Tomas, making it the oldest town in Isabela and existing before the province's creation.",
            "The original name literally means sparkling.",
            "It was then renamed to Cabagan, loosely interpreted as the place where people wear \"ba-ag\" or \"G-strings\" when the Spaniards arrived at the Philippine Islands."
        ],
        [
            "On May 15, 1647, the Dominican Order in Manila recognized \"San Pablo Apostol de Cabagan\" as an ecclesiastical mission under the patronage of Saint Paul the Apostle.",
            "Cabagan's church was built with a six-layer bell tower, containing the tallest adobe round pinnacle in the Cagayan Valley."
        ],
        [
            "Mengal Baladdon and his troops, disturbed by Fray Pedro Jimenez's success in establishing Christian communities in the Irraya, devastated Cabagan in 1683, killing twelve of its Christian inhabitants and forcing the locals to escape to the mountains.",
            "The hamlet was on the point of collapse when the alcalde-mayor of Cagayan rescued it by killing some accomplices and capturing seventy.",
            "Their property was confiscated and given to the army."
        ],
        [
            "In 1709, a massive fire destroyed the Cabagan Church and the large convent.",
            "Don Pablo Orduna defeated a Cabagan revolt in 1718, and many Cabagan and Tuguegarao locals sought refuge in the mountains.",
            "In 1738, the military fort of Cabagan (located in what is now San Pablo town), a triangular two-bulwarked stone fortification, was demolished (also by earthquakes) and relocated to Cabicungan (now Claveria town in Cagayan province) because it was no longer required.",
            "On March 20, 1758, Dominican missionary Fray Jose Marin of Cabagan reported that a cholera epidemic had broken out, killing around 500 people in Cabagan and 800 in Tuguegarao.",
            "He also informed them about the construction of a wine and sugar factory, which would be extremely useful to the town's residents.",
            "Dominican Fray Antonio Garcia built Cabagan's Casa Real in 1841.",
            "During Spanish administration in the province, the house was an important government hub.",
            "It was a two-story stone building of 20 by 30 square meters.",
            "The Casa Real was destroyed in 1857 but later reconstructed.",
            "The inscription on one of its walls reads, \"Esta Casa Tribunal se con Cluio en año de 1846, Siendo Governad d' Juan de Guzman.\""
        ],
        [
            "By royal order in 1761, a burgeoning village across the Pinacanauan River was formally detached from the mother-town of Cabagan (now San Pablo town) and given the same name.",
            "Only in 1861 was a royal order issued to separate the new hamlet of Cabagan (now Cabagan town) from the mothertown of Cabagan (now San Pablo).",
            "On January 25, 1877, Dominican Fray Pedro Ricart relocated the old town of Cabagan (now San Pablo) to a new site (the current area of Cabagan town) due to the unhealthiness of the former site, and it appeared that progress was bypassing the town in favor of the towns to the south.",
            "The new site was just about three kilometers from the old, and it was located between the current barangays of Ugad and Luquilu."
        ],
        [
            "The Spaniards restored the abandoned site of Cabagan (now San Pablo) in 1888, naming it \"Cabagan Viejo\" and appointing Fray Segundo Rodriguez as cura parroco.",
            "He renovated part of the church and convent and named the Virgin of the Rosary as the town's patroness.",
            "Later, the patron was changed to Saint Paul the Apostle.",
            "The other Cabagan was dubbed \"Cabagan Nuevo\" to avoid misunderstanding between the two.",
            "In Spanish, \"Viejo\" means \"old\" and \"Nuevo\" means \"new\".",
            "When the Americans arrived, they renamed Cabagan Nuevo simply \"Cabagan\" and Cabagan Viejo \"San Pablo\"."
        ],
        [
            "American colonial era"
        ],
        [
            "In the 1900s, Cabagan was subdivided into three divisions, namely: Cabagan Viejo, Cabagan Nuevo, and Santa Maria.",
            "Cabagan Viejo was then renamed to San Pablo, after its patron saint Paul the Apostle whose feast day is celebrated every January 15.",
            "Meanwhile, Cabagan Nuevo became the modern-day Cabagan, while Santa Maria retained its name."
        ],
        [
            "During the early stages of the American occupation, the Philippine Commission, led by Governor-General William Howard Taft (later President of the United States and Chief Justice), held a public hearing on province reorganization.",
            "The three towns of Cabagan Nuevo, Cabagan Viejo, and Santa Maria attended the hearing in Tuguegarao, Cagayan, and requested that the towns be merged into the newly established province of Cagayan.",
            "However, in a public hearing held in Ilagan, Isabela on August 23, 1901, Municipal President Rafael Maramag of Ilagan stated that the exclusion of the three towns would significantly limit the province's size.",
            "\"The population of Isabela was around 54,000, and these three towns had a total population of roughly 20,000.",
            "The proposed adjustment would therefore take away almost a third of the province.\"",
            "The Commission declared the next day that they were not amenable to the move \"since it would too substantially lower the population and tax-paying power of the province of Isabela.\""
        ],
        [
            "The seat of administration for San Pablo town was moved to Barrio Auitan in 1944, then to Barrio Minanga at the request of the Japanese.",
            "According to Robern Osterlund, the seat of administration shifted due to factional conflicts between the Centro people (Southern group) and the Auitans (Northern group)."
        ],
        [
            "Philippine independence"
        ],
        [
            "In 1959, Mayor Calixtro B. Cauan returned the government center to its former location, which is now the current location."
        ],
        [
            "Geography"
        ],
        [
            "San Pablo, located at 17°28′N 121°59′E, is bounded by Tuguegarao City to the north, the Municipality of Maconacon to the east, the Municipality of Cabagan to the south, and the Cagayan River and the Municipality of Santa Maria to the west.",
            "It is organized into 17 barangays and covers a land area of 637.9 square kilometers, with a population of 25,384 in 2015.",
            "The highest peak in the province lies at the boundary with Cagayan, Mount Dos Cuernos, located in San Pablo near the Maconacon border, has an elevation of 1,785 metres (5,856 feet)."
        ],
        [
            "Barangays"
        ],
        [
            "San Pablo is politically subdivided into 17 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Annanuman"
        ],
        [
            "Auitan"
        ],
        [
            "Ballacayu"
        ],
        [
            "Binguang (Baculud)"
        ],
        [
            "Bungad"
        ],
        [
            "Dalena"
        ],
        [
            "Caddangan (Limbauan)"
        ],
        [
            "Calamagui"
        ],
        [
            "Caralucud"
        ],
        [
            "Guminga"
        ],
        [
            "Minanga Norte"
        ],
        [
            "Minanga Sur"
        ],
        [
            "San Jose"
        ],
        [
            "Poblacion"
        ],
        [
            "Simanu Norte"
        ],
        [
            "Simanu Sur"
        ],
        [
            "Tupa (San Vicente)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Pablo, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31.2(1.23)"
        ],
        [
            "23(0.9)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "28.1(1.11)"
        ],
        [
            "113.5(4.47)"
        ],
        [
            "141.4(5.57)"
        ],
        [
            "176.4(6.94)"
        ],
        [
            "236.6(9.31)"
        ],
        [
            "224.9(8.85)"
        ],
        [
            "247.7(9.75)"
        ],
        [
            "222.9(8.78)"
        ],
        [
            "178(7.0)"
        ],
        [
            "1,651.4(65)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "144"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San PabloYearPop.±% p.a.1903 3,899—    1918 4,994+1.66%1939 6,241+1.07%1948 5,700−1.00%1960 8,349+3.23%1970 11,539+3.28%1975 12,402+1.46%1980 13,764+2.11%YearPop.±% p.a.1990 16,680+1.94%1995 17,122+0.49%2000 19,090+2.36%2007 20,561+1.03%2010 22,040+2.56%2015 25,384+2.73%2020 26,320+0.71%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Pablo, Isabela, was 26,320 people, with a density of 41 inhabitants per square kilometre or 110 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Pablo"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  24.90"
        ],
        [
            "2009  19.69"
        ],
        [
            "2012  24.38"
        ],
        [
            "2015  20.73"
        ],
        [
            "2018  18.78"
        ],
        [
            "2021  19.47"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Culture"
        ],
        [
            "The Baka (Cow) Festival, inaugurated in 2004, under the time of Mayor Antonio N. Miro, is observed yearly on January 15 during the patronal town fiesta to promote the culture and tradition of the town."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipality of San Pablo is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the San Pablo Municipal Council(2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative"
        ],
        [
            "Antonio T. Albano"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Antonio N. Miro Jr."
        ],
        [
            "Municipal Vice-Mayor"
        ],
        [
            "Antonio Jose T. Miro III"
        ],
        [
            "Municipal Councilors"
        ],
        [
            "Jannina P. Rance"
        ],
        [
            "Roman Sebastian S. Lim-Gollayan"
        ],
        [
            "Cherry S. Cureg"
        ],
        [
            "William Carl C. Valdepeñas"
        ],
        [
            "Samson B. Cammayo"
        ],
        [
            "Mark Joseff Serrano"
        ],
        [
            "Allan C. Malayao"
        ],
        [
            "Leo Yule C. Balabbo"
        ],
        [
            "Past chief executives"
        ],
        [
            "According to accessible documents, the three Capitan Municipals of San Pablo served in the latter half of Spanish administration when Cabagan Viejo was re-established.",
            "These were the Municipal Presidents during the American period."
        ],
        [
            "Don Juan S. Gollayan (1884-1889)"
        ],
        [
            "Don Salvador Cauan (1890-1895)"
        ],
        [
            "Don Agripino Cammayo (1896-1899)"
        ],
        [
            "Don Antonio Pagulayan (1900-1903)"
        ],
        [
            "Don Thomas Gollayan (19041907)"
        ],
        [
            "Don Ventura Santos Guzman (1908-1910)"
        ],
        [
            "Don Salvador Tumaliuan (19111914)"
        ],
        [
            "Don Agustin Miro (1915-1918)"
        ],
        [
            "Don Angel Cammayo (1919-1922)"
        ],
        [
            "Don Valeriano Palattao (1923-1925)"
        ],
        [
            "Don Anacleto Pagulayan (1926-1931)"
        ],
        [
            "Don Antonio Cauan (1932-1936)"
        ],
        [
            "Don Agustin Mesa (1937-1938)"
        ],
        [
            "San Pablo's municipal mayors during the Commonwealth period, Japanese occupation, and the Third Republic include"
        ],
        [
            "Hon.",
            "Manuel Masigan (1938–1940)"
        ],
        [
            "Hon.",
            "Marciano Nolasco Castañeda (1941-1942 and 1945-1946)"
        ],
        [
            "Hon.",
            "Melecio Antonio (1942–1943 appointed)"
        ],
        [
            "Hon.",
            "Jose Guzman (1943–1944 appointed)"
        ],
        [
            "Hon.",
            "Jesus Gollayan (1946–1947 appointed)"
        ],
        [
            "Hon.",
            "Jose L. Tumaliuan (1948–1950)"
        ],
        [
            "Hon.",
            "Hon.",
            "Aniceto Palattao (born 1951)"
        ],
        [
            "Calixtro B. Cauan (1952-1955, 1956-1959 and 1960-1963)"
        ],
        [
            "Hon.",
            "Cayetano N. Cauan (1964-1967, 1968-1971, 1972-1980, and 1980–1986)"
        ],
        [
            "These were the municipal mayors during the Fifth Republic, under the 1987 constitution:"
        ],
        [
            "Hon.",
            "Antonio N. Miro, Jr. (1986-1987 OIC, 2004-2007, 2007-2010, 2010-2013, and 2016–present)"
        ],
        [
            "Hon.",
            "Roy Umayam (1987–1988)"
        ],
        [
            "Hon.",
            "Cayetano A. Cauan, Jr. (1988-1992; 1992-1995)"
        ],
        [
            "Hon.",
            "Edwardson B. Tumaliuan (1995-1998, 1998-2001)"
        ],
        [
            "Hon.",
            "Celia M. Aragon (2001–2004)"
        ],
        [
            "Hon.",
            "Antonio Jose T. Miro III (2013–2016)."
        ],
        [
            "Congress representation"
        ],
        [
            "San Pablo, belonging to the first legislative district of the province of Isabela, currently represented by Hon.",
            "Antonio T. Albano."
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "References"
        ],
        [
            "^ \"Executive Order No.",
            "68, series of 1909\".",
            "Executive Orders and Proclamations Issued by the Governor-General During the Year 1909: 168–169.",
            "12 August 1909.",
            "Retrieved 18 May 2023."
        ],
        [
            "^ a b \"Executive Summary\" (PDF).",
            "Commission on Audit.",
            "Retrieved November 5, 2021."
        ],
        [
            "^  Municipality of San Pablo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c d e f g h i j k l m n o \"Historical Development of the Municipality of San Pablo, Isabela\" (PDF).",
            "Province of Isabela - provinceofisabela.ph.",
            "15 January 2018.",
            "Retrieved June 25, 2024."
        ],
        [
            "^ \"Republic Act No.",
            "2117 - San Pablo, Isabela Seat of Government Transferred to Centro\".",
            "Jur.ph - Philippine Jurisprudence and Laws.",
            "Apr 5, 1959.",
            "Retrieved June 25, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Isabela\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Pablo, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 3 November 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"San Pablo, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved May 15, 2022."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "San Pablo at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Municipality of San Pablo"
        ],
        [
            "Places adjacent to San Pablo, Isabela"
        ],
        [
            "Tuguegarao / Peñablanca, Cagayan"
        ],
        [
            "Santa Maria"
        ],
        [
            "San Pablo"
        ],
        [
            "Maconacon"
        ],
        [
            "Cabagan"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Pablo,_Isabela&oldid=1230927936\""
        ],
        [
            "Categories: Municipalities of Isabela (province)Populated places on the Rio Grande de CagayanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Ibanag-language textArticles containing Ilocano-language textArticles containing Tagalog-language textWikipedia pages tagged for copyright problemsArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}