{
    "name": "San Felipe",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Felipe, Zambales"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°03′43″N 120°04′12″E﻿ / ﻿15.0619°N 120.07°E﻿ / 15.0619; 120.07"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Zambales, Philippines"
        ],
        [
            "Municipality in Central Luzon, PhilippinesSan FelipeMunicipalityMunicipality of San FelipeWelcome Arch"
        ],
        [
            "SealMotto: Care for San Felipe... Unite for San Felipe... Be Loyal to San Felipe...Map of Zambales with San Felipe highlightedOpenStreetMapSan FelipeLocation within the PhilippinesCoordinates: 15°03′43″N 120°04′12″E﻿ / ﻿15.0619°N 120.07°E﻿ / 15.0619; 120.07CountryPhilippinesRegionCentral LuzonProvinceZambalesDistrict"
        ],
        [
            "2nd districtFounded1795Barangays11"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorREINHARD E. JERESANO • Vice MayorMary Ann R. Quiba • RepresentativeCheryl Deloso-Montalla • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Alden A. LadringanAnthony Ian O. MiclatRay A. FrondarinaFerdinand A. FamulerasNapoleon C. DomingoLyndon D. RoseteSir Alfred A. AbilleBonifacio A. Fortin"
        ],
        [
            " • Electorate16,774 voters (2022)Area • Revenue₱ 119.8 million (2020) • Assets₱ 289.6 million (2020) • Expenditure₱ 93.35 million (2020) • Liabilities₱ 87.72 million (2020)Service provider • ElectricityZambales 2 Electric Cooperative (ZAMECO 2)Time zoneUTC+8 (PST)ZIP code2204PSGC037110000IDD : area code +63 (0)47Native languagesIlocano Tagalog Sambal"
        ],
        [
            "San Felipe, officially the Municipality of San Felipe (Filipino: Bayan ng San Felipe), is a 4th class municipality in the province of Zambales, Philippines.",
            "According to the 2020 census, it has a population of 25,033 people, making it the least populated municipality in the province."
        ],
        [
            "Etymology"
        ],
        [
            "The name Bobulon was changed to San Felipe when it was founded in 1853.",
            "As to how the town of San Felipe got its present name, the most reliable fact learned so far was that four “saintly” brothers from Ilocandia, namely Marcelino, Antonio, Narciso and Felipe settled in the about to be organized pueblos which were later named San Marcelino, San Antonio, San Narciso and San Felipe.",
            "As a matter of fact, most of the inhabitants of these four towns were Ilocanos from the Ilocos region."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(April 2021) (Learn how and when to remove this message)"
        ],
        [
            "San Felipe was one of the little villages along the coastal region of Zambales during the pre-Spanish period.",
            "The first inhabitants were the Malay Zambals who lived in lowland which they themselves called Hindol.",
            "There were also Negritoes, but most of them lived in the mountains."
        ],
        [
            "A few years after the Spanish discovery of the Philippines, all places in the country had been explored by the Spanish authorities.",
            "The exploration of Zambales began in 1572 by Juan de Salcedo, grandson of Miguel Lopez de Legaspi, first Spanish Governor General of the Philippines.",
            "Juan de Salcedo and Spanish followers made a survey of its coastal region, and organized communities which were first called encomiendas but later called pueblos.",
            "Around the early and mid-19th century, as the population of the villages increased due to the steady immigration of Ilocanos from the Ilocandia region, more pueblos were organized."
        ],
        [
            "The first waves of Ilocanos found their way to Hindol, which was later called Sindol, and less than the kilometers south of Sindol was the place called Bobulon.",
            "Hindol was a Zambal Aeta name of a tree than abundant in the place.",
            "Bobulon was also a kind tree then abundant at the Public Plaza.",
            "However, there was another version why it was called Bobulon.",
            "It was said that the first voyage of Ilocano settlers had all the favorable wind (bulon) from Paoay, Ilocos Norte to this village.",
            "The other waves of Ilocano settlers, who were mostly merchants and fishermen, came from Vigan and San Vincente, Ilocos Sur."
        ],
        [
            "The first seat of the pueblo government was in Sindol and the head of the pueblo was called Capitan Municipal who as head of the pueblo was responsible in paying the taxes which could not be collected from his barangays which were headed by Cabezas de barangay.",
            "As gathered from reliable sources, one of the town executives when the seat of the government was still here in Sindol was Capitan Municipal Pedro Farañal, father of the late Municipal President Juan Farañal.",
            "The pueblo was later transferred from Sindol to Bobulon because the latter was already more populated, had a wider area for residential purposes, and it was farther from the mountains were the aetas, still wild lived."
        ],
        [
            "Mount Pinatubo eruption"
        ],
        [
            "The town was affected by the 1991 Mount Pinatubo eruption, being buried in about a meter in volcanic ash but damage was comparatively light."
        ],
        [
            "Geography"
        ],
        [
            "San Felipe is 36 kilometres (22 mi) from Iba, 42 kilometres (26 mi) from Olongapo, and 168 kilometres (104 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "San Felipe is subdivided into 11 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Amagna (Poblacion)"
        ],
        [
            "Apostol (Poblacion)"
        ],
        [
            "Balincaguing"
        ],
        [
            "Farañal (Poblacion)"
        ],
        [
            "Feria (Poblacion)"
        ],
        [
            "Maloma"
        ],
        [
            "Manglicmot (Poblacion)"
        ],
        [
            "Rosete (Poblacion)"
        ],
        [
            "San Rafael"
        ],
        [
            "Santo Niño"
        ],
        [
            "Sindol"
        ],
        [
            "Barangays (district) in the poblacion and barangays (barrios) outside the town proper."
        ],
        [
            "Barangays in the poblacion and their names :"
        ],
        [
            "Barangay Apostol has been named in honor of the late Capitan Municipal Juan Apostol, Barangay Manglicmot has been named in honor of the late Capitanes Municipal – Julian Manglicmot, Casimiro Manglicmot and Lope Manglicmot.",
            "Barangay Feria has been named in honor of the late Capitan Municipal Ambrosio Feria, Barangay Amagna has been named in honor of Municipal President Nicolas Amagna.",
            "Barangay Rosete has been named in honor of the late Capitan Municipal Pedro Rosete.",
            "Barangay Farañal has been named in honor of the late Capitan Municipal Pedro Farañal when the seat of the government was still in Sindol."
        ],
        [
            "Barangays outside the poblacion and their names :"
        ],
        [
            "Barangay Balincaguing's name was derived from the Zambal word balin which means house or home and caguing which means wild bats."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Felipe, Zambales"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "16(0.6)"
        ],
        [
            "18(0.7)"
        ],
        [
            "28(1.1)"
        ],
        [
            "51(2.0)"
        ],
        [
            "200(7.9)"
        ],
        [
            "253(10.0)"
        ],
        [
            "301(11.9)"
        ],
        [
            "293(11.5)"
        ],
        [
            "246(9.7)"
        ],
        [
            "171(6.7)"
        ],
        [
            "70(2.8)"
        ],
        [
            "28(1.1)"
        ],
        [
            "1,675(66)"
        ],
        [
            "Average rainy days"
        ],
        [
            "6.2"
        ],
        [
            "7.1"
        ],
        [
            "10.4"
        ],
        [
            "15.5"
        ],
        [
            "24.4"
        ],
        [
            "26.4"
        ],
        [
            "28.2"
        ],
        [
            "27.5"
        ],
        [
            "26.2"
        ],
        [
            "23.6"
        ],
        [
            "15.9"
        ],
        [
            "8.7"
        ],
        [
            "220.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San FelipeYearPop.±% p.a.1903 4,326—    1918 5,151+1.17%1939 6,551+1.15%1948 7,781+1.93%1960 9,861+1.99%1970 13,283+3.02%1975 13,905+0.92%1980 13,834−0.10%1990 15,624+1.22%1995 16,837+1.41%2000 17,702+1.08%2007 21,322+2.60%2010 22,020+1.18%2015 23,183+0.99%2020 25,033+1.52%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Felipe, Zambales, was 25,033 people, with a density of 220 inhabitants per square kilometre or 570 inhabitants per square mile."
        ],
        [
            "Much of the population are Ilocanos, descendants of migrants from Ilocos."
        ],
        [
            "Religion"
        ],
        [
            "Cathedral Church of San Roque of the Philippine Independent Church in San Felipe"
        ],
        [
            "There are local branches of the Christian denominations of Methodist, Philippine Independent Church, International Assemblies of the First Born, Jesus is Lord and Roman Catholic Church."
        ],
        [
            "The Cathedral of San Roque (Saint Roch in English), the episcopal see of the Zambales diocese of the Philippine Independent Church is located next to the plaza."
        ],
        [
            "The local parish of the Catholic Church is also dedicated to San Roque and was staffed by the Columban Fathers until recent years."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Felipe"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  7.70"
        ],
        [
            "2009  14.46"
        ],
        [
            "2012  13.66"
        ],
        [
            "2015  16.66"
        ],
        [
            "2018  9.27"
        ],
        [
            "2021  21.00"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Under the Spanish regime and during the early part of American regime, San Felipe was a separate town.",
            "Its first Municipal President was Don Saturnino Pastor who was the town executive from January 1, 1901, to December 31, 1902.",
            "For the purpose of governmental administration, San Felipe was incorporated with San Narciso, The Municipal President of the combined towns of San Felipe and San Narciso was Don Simeon Maranon and Nicolas Amagna was the Municipal Vice-president.",
            "Being a smaller town, San Felipe was only entitled to four Councilors while San Narciso had five.",
            "The councilors for San Felipe were – Don Juan Farañal, Don Victorino Amancio, Don Alejo Apostol and Don Macario Manglicmot.",
            "These officials, together with some others in San Felipe, later worked for the separation of San Felipe from San Narciso through Don Alberto Barretto, who was then a member of the first Philippine Assembly.",
            "Meanwhile, before the separation Don Angel Dumlao y Farrales, from San Narciso, took over as Municipal President for San Felipe – San Narciso covering the period from January 1, 1905, to February 28, 1908."
        ],
        [
            "Under the combined leadership of Nicolas Amagna, Flaviano Dumlao, Severo Amagna, Nemesio Farrales, Isidoro Fuenticilla and Joaquin Feria a resolution was adopted to effect the final separation of San Felipe from San Narciso.",
            "On March 1, 1908, San Felipe was formally separated from San Narciso and the first Municipal officials after separation were;"
        ],
        [
            "Nicolas Amagna - Municipal President"
        ],
        [
            "Isidoro Fuenticilla - Mun.",
            "Vice-president"
        ],
        [
            "Santiago Labrador - Councilor"
        ],
        [
            "Flaviano Dumlao - Councilor"
        ],
        [
            "Jose Abille - Councilor"
        ],
        [
            "Leoncio Borja - Councilor"
        ],
        [
            "Bartolome Mendaros - Councilor"
        ],
        [
            "Nemesio Farrales - Councilor"
        ],
        [
            "Joaquin Feria - Councilor"
        ],
        [
            "Macario Rico - Councilor"
        ],
        [
            "Education"
        ],
        [
            "There are private, public and parochial elementary, high schools and technological college in San Felipe."
        ],
        [
            "Elementary"
        ],
        [
            "Public"
        ],
        [
            "San Felipe Central Elementary School (East)"
        ],
        [
            "San Felipe Central Elementary School (West)"
        ],
        [
            "Santo Nino Elementary School"
        ],
        [
            "Maloma Community Elementary School"
        ],
        [
            "Santo Tomas Elementary School"
        ],
        [
            "Bobulon Elementary School"
        ],
        [
            "Sindol Elementary School"
        ],
        [
            "San Rafael Elementary School"
        ],
        [
            "Balincaguing Elementary School"
        ],
        [
            "Laoag Elementary School"
        ],
        [
            "Sagpat Elementary School"
        ],
        [
            "Private"
        ],
        [
            "Pedro M. Arce Ecumenical School, Inc."
        ],
        [
            "Luke 19:4 Child Development Center, Inc"
        ],
        [
            "Saint Columban's Montessori School"
        ],
        [
            "High schools"
        ],
        [
            "Public"
        ],
        [
            "Governor Manuel D. Barretto National High School"
        ],
        [
            "San Rafael Technical Vocational High School"
        ],
        [
            "Sagpat High School"
        ],
        [
            "Don Getulio Feria Arindaeng High School"
        ],
        [
            "Paite- Balincaguing National High School"
        ],
        [
            "Private"
        ],
        [
            "Zambales Central Institute"
        ],
        [
            "St. Columban's Montessori School"
        ],
        [
            "Technological College of San Felipe, Inc."
        ],
        [
            "Colleges"
        ],
        [
            "Technological College of San Felipe"
        ],
        [
            "Tourism"
        ],
        [
            "Century Old Tree: Situated in Barangay Maloma, San Felipe, Zambales."
        ],
        [
            "Coastal Beach Area: Barangay Santo Nino, San Felipe, Zambales."
        ],
        [
            "Barrio Liwliwa: Liwliwa is a prime surfing spot three hours away from Manila.",
            "Resorts includes Kapitan's Liwa Surf Resort, Kuya Bot's, Board Culture Liw-Liwa (BCL), La Sarina, Aragoza Beach Resort, The Circle Hostel and Camp Rofelio Surfing Beach Resort in San Felipe."
        ],
        [
            "Lubong-Nangoloan Waterfalls: Situated in Barangay Feria, San Felipe, Zambales."
        ],
        [
            "Grotto Falls: Situated in Barangay Feria, San Felipe, Zambales."
        ],
        [
            "Benedictine Retreat House: This retreat house is run by the Benedictine sisters and was constructed on land donated by the Sebastian family.",
            "The late Sister Henrietta Sebastian was a nun of the Benedictine order.",
            "A number of schools and religious groups, even as far away from Manila, conduct their retreats in this facility.",
            "The compound also houses relocated groups that were displaced by Mt.",
            "Pinatubo.",
            "You can also buy religious articles from them (for pasalubongs)."
        ],
        [
            "Sabangan of the North: A picnic and/or scenic site.",
            "From Sindol cars, jeeps, SUVs and tricycles can easily navigate the road which is part concrete and dirt road to take you to there."
        ],
        [
            "Brandenburg Resort: Located at Barangay Sindol, San Felipe, Zambales."
        ],
        [
            "Montecruz Beach Resort: Located at Barangay Santo Nino, San Felipe."
        ],
        [
            "Greenspace Artist Village: Located at Liwliwa, San Felipe, Zambales."
        ],
        [
            "Gallery"
        ],
        [
            "San Felipe Beach"
        ],
        [
            "San Roque Catholic Church"
        ],
        [
            "San Felipe Zambales Public Market and Mall"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Felipe |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Who We Are: Zambales"
        ],
        [
            "^ Robert Gonzaga, Tonette Orejas (June 16, 2011).",
            "\"Zambales bore brunt of Mt.",
            "Pinatubo's fury\".",
            "Philippine Daily Inquirer.",
            "Retrieved 26 March 2013."
        ],
        [
            "^"
        ],
        [
            "\"Province: Zambales\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Felipe: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Zambales\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Private SHS | Schools Division of Zambales\"."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Felipe, Zambales."
        ],
        [
            "San Felipe Profile at PhilAtlas.com"
        ],
        [
            "Website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to San Felipe, Zambales"
        ],
        [
            "Cabangan"
        ],
        [
            "Botolan"
        ],
        [
            "South China Sea"
        ],
        [
            "San Felipe"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Narciso"
        ],
        [
            "vte Province of ZambalesIba (capital)  Olongapo (largest city)Municipalities"
        ],
        [
            "Botolan"
        ],
        [
            "Cabangan"
        ],
        [
            "Candelaria"
        ],
        [
            "Castillejos"
        ],
        [
            "Iba"
        ],
        [
            "Masinloc"
        ],
        [
            "Palauig"
        ],
        [
            "San Antonio"
        ],
        [
            "San Felipe"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Narciso"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Subic"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Olongapo (Administratively independent from the province but grouped under Zambales by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Zambales"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Felipe,_Zambales&oldid=1221286872\""
        ],
        [
            "Category: Municipalities of ZambalesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles needing additional references from April 2021All articles needing additional referencesAll articles with unsourced statementsArticles with unsourced statements from February 2011Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}