{
    "name": "San Vicente",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Vicente, Palawan"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°31′41″N 119°15′15″E﻿ / ﻿10.5281°N 119.2542°E﻿ / 10.5281; 119.2542"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Palawan, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesSan Vicente"
        ],
        [
            "MalagnangMunicipalityMunicipality of San VicenteAlimanguan Beach"
        ],
        [
            "FlagSealNickname(s): First and Premier Flagship Tourism Enterprise ZoneMotto(s): Ang Tao Una sa Lahat, Ang Bayan Higit sa Lahat, Kaunlaran para sa LahatMap of Palawan with San Vicente highlightedOpenStreetMapSan VicenteLocation within the PhilippinesCoordinates: 10°31′41″N 119°15′15″E﻿ / ﻿10.5281°N 119.2542°E﻿ / 10.5281; 119.2542CountryPhilippinesRegionMimaropaProvincePalawanDistrict"
        ],
        [
            "1st districtFoundedJanuary 2, 1972Named forSt.",
            "Vincent FerrerBarangays10"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAmy R. Alvarez • Vice MayorRamir R. Pablico • RepresentativeEdgardo L. Salvame • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Maria Carmem L. SilaganMelvin C. BallesterosPhilip Jenrie S. AcostaEvangeline G. MaagadCesar M. Caballero, Sr.Honorio M. AlejanoRonnie N. Hikilan, Sr.Teodulo A. Varquez"
        ],
        [
            " • Electorate22,799 voters (2022)Area • Revenue₱ 395 million (2020) • Assets₱ 1,019 million (2020) • Expenditure₱ 295.9 million (2020)Service provider • ElectricityPalawan Electric Cooperative (PALECO)Time zoneUTC+8 (PST)ZIP code5309PSGC175319000IDD : area code +63 (0)48Native languagesPalawano Central Tagbanwa Ibatag TagalogWebsitesanvicentepalawan.gov.ph"
        ],
        [
            "San Vicente, officially the Municipality of San Vicente (Tagalog: Bayan ng San Vicente),  is a 1st class municipality in the province of Palawan, Philippines.",
            "According to the 2020 census, it has a population of 33,507 people."
        ],
        [
            "It is located in the north-western side of the main island of Palawan and is 186 kilometres (116 mi) from Puerto Princesa City.",
            "It occupies a total land area of 146,294 hectares (361,500 acres)."
        ],
        [
            "San Vicente's 14.7 kilometres (9.1 mi) of beachfront, popularly called the Long Beach, is being converted into an emerging tourist destination that will be the beneficiary of government spending on infrastructure."
        ],
        [
            "History"
        ],
        [
            "In 1952, migrants from Manamoc, an island of the Cuyo Archipelago, arrived in a place called Malagnang ( muddy/ maputik) a sitio of Kemdeng, formerly part of Puerto Princesa.",
            "The first to arrive were the Dandal brothers Anastacio and Lauro Dandal."
        ],
        [
            "Alberto Radam, and Marcelino Gadiano with their families.",
            "After sometime their relatives followed forming a small community which gave rise to the election of Anastascio Dandal as the first Barrio Lieutenant."
        ],
        [
            "The small ethnic group of Agutaynon and Cuyunon increased in number and with the increase disputes emerged particularly in the choice of the town's Patron Saint.",
            "The Cuyunon wanted Saint Vincent Ferrer while the choice of Agutaynon was Saint Isidro Labrador.",
            "The group decided to resolve the issue by drawing a lot.",
            "The name of Saint Vincent Ferrer was drawn thus the name Malagnang was changed to San Vicente."
        ],
        [
            "The Municipality of San Vicente was created on June 21, 1969, by virtue of Republic Act 5821.",
            "It officially functioned as distinct municipality on January 1, 1972."
        ],
        [
            "The present Municipality was created out of several barrios from the Municipalities of Taytay and Puerto Princesa (now a highly urbanized city).",
            "The barrio of New Agutaya up to the northernmost barrio of Binga used to be part of Taytay while the barrio of San Vicente (Poblacion) down to the southernmost barrio of Caruray were part of Puerto Princesa.",
            "The barrio of San Vicente used to be a sitio named Malagnang until it was upgraded into a barrio and renamed by a law in 1959."
        ],
        [
            "Geography"
        ],
        [
            "San Vicente is nestled in the north-west of Palawan's mainland, bounded by the Philippine West Sea in the West, the municipality of Taytay in the north, Roxas in the East and City of Puerto Princesa in the Southwest.",
            "With a forest area of 82,080.09 hectares and 22 identified islands and islets within its municipal boundaries.",
            "San Vicente is located in the north-western side of the main island of Palawan and is 186 kilometers from Puerto Princesa City.",
            "It occupies a total land area of 165,797.6525 hectares."
        ],
        [
            "Barangays"
        ],
        [
            "San Vicente is politically subdivided into 10 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alimanguan"
        ],
        [
            "Binga"
        ],
        [
            "Caruray"
        ],
        [
            "New Villa Fria (Kemdeng)"
        ],
        [
            "New Agutaya"
        ],
        [
            "New Canipo"
        ],
        [
            "Port Barton"
        ],
        [
            "Poblacion (San Vicente)"
        ],
        [
            "San Isidro"
        ],
        [
            "Santo Niño"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Vicente, Palawan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "56(2.2)"
        ],
        [
            "38(1.5)"
        ],
        [
            "68(2.7)"
        ],
        [
            "71(2.8)"
        ],
        [
            "157(6.2)"
        ],
        [
            "208(8.2)"
        ],
        [
            "212(8.3)"
        ],
        [
            "194(7.6)"
        ],
        [
            "216(8.5)"
        ],
        [
            "218(8.6)"
        ],
        [
            "189(7.4)"
        ],
        [
            "107(4.2)"
        ],
        [
            "1,734(68.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.9"
        ],
        [
            "10.5"
        ],
        [
            "14.3"
        ],
        [
            "15.9"
        ],
        [
            "24.6"
        ],
        [
            "27.6"
        ],
        [
            "28.6"
        ],
        [
            "27.4"
        ],
        [
            "27.8"
        ],
        [
            "27.5"
        ],
        [
            "23.5"
        ],
        [
            "18.6"
        ],
        [
            "259.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "As with the general climate of the Philippine Archipelago, San Vicente's dry season begins in December, lasting until the month of May while the onset of the wet or rainy season is in June, usually drying up again in November.",
            "Northestern winds, the amihan prevail from November to May.",
            "Rough coastal waters characterize the season of habagat, or the south-western winds."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San VicenteYearPop.±% p.a.1970 5,388—    1975 7,420+6.63%1980 10,097+6.35%1990 17,795+5.83%1995 19,449+1.68%YearPop.±% p.a.2000 21,654+2.33%2007 25,218+2.12%2010 30,919+7.70%2015 31,232+0.19%2020 33,507+1.39%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Vicente, Palawan, was 33,507 people, with a density of 23 inhabitants per square kilometre or 60 inhabitants per square mile."
        ],
        [
            "In the 2010 NSO Census, San Vicente had a total population of 30,919 at a growth rate of 6%.",
            "Population increased by 3,500 from 27,065 in 2008 based on CBMS survey within a 2-year gap.",
            "The total number of households was 6,460 with average household size of 5 members."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Vicente"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  38.40"
        ],
        [
            "2009  25.60"
        ],
        [
            "2012  30.12"
        ],
        [
            "2015  21.58"
        ],
        [
            "2018  18.91"
        ],
        [
            "2021  17.79"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Sunset in Port Barton"
        ],
        [
            "Fishing and farming are the major economic activities in San Vicente wherein 29.50% and 25.77% respectively are engaged in it.",
            "Rice and coconut are the major agricultural crops and fish products are adequate in the municipality."
        ],
        [
            "San Vicente is predominantly fishing and a farming municipality and now gaining recognition as a center of interest for Tourism.",
            "San Vicente can offer a diverse range of attractions for adventure and nature enthusiasts.",
            "Roads and other infrastructure support facilities are now on its implementation process through the help of the National Government."
        ],
        [
            "As San Vicente Palawan slowly emerges to become one of the tourism hot spot in the Philippines, the real industry sector becomes dramatically stronger."
        ],
        [
            "Many millionaires have ventured into land banking in San Vicente Palawan with its robust potential, earning exponentially from re-selling their acquired properties.",
            "Historically, rice field properties were sold at P300,000 per hectare in 2014.",
            "Three years later, an hectare big usually costs P3,000,000, with another increase after the San Vicente Airport started servicing small commercial planes."
        ],
        [
            "Flagship Tourism Enterprise Zone (Flagship TEZ)"
        ],
        [
            "The introduction of the San Vicente Flagship TEZ was initiated with the marking of a Memorandum of Agreement (MOA) between the TIEZA and the nearby government unit (LGU) of San Vicente in 2013 – a fearless advance of the neighborhood organization to uphold association and set the course into tourism improvement."
        ],
        [
            "To meet the vision proclamation as the Flagship TEZ and to be a model goal, a Tourism Master Plan was defined to coordinate, control and accomplish adjusted formative pushes and methodologies of the LGU towards an independent, socially capable and naturally stable group.",
            "The Tourism Master Plan expects to advance and encourage feasible and reasonable improvement in the region."
        ],
        [
            "In light of the Integrated Tourism Master Plan for the Long Beach range, the Flagship TEZ should be zoned by its attributes and into topics to create tourism items, for example, however not restricted to sun and shoreline, relaxation and stimulation, recreational and sports tourism, eco-tourism and agri-tourism."
        ],
        [
            "San Vicente Palawan Master Plan contains significant information about San Vicente, tourism projections based on other famous tourist destinations, proposed developments and proposed restrictions.",
            "The Master Plan also identifies key areas and divided San Vicente Palawan into 4 clusters, based on development and tourism potentials."
        ],
        [
            "Culture"
        ],
        [
            "The diversity of San Vicente derives from its 24 ethno-linguistic resident groups, each with their own distinct dialects, and culture heritage.",
            "Filipino (Tagalog), however, remains the dominant lingua franca these diverse people that comprise San Vicente populace.",
            "In homage to its patron saint, San Vicente Ferrer, the municipality celebrates its town fiesta from April 1–5, Foundation Day on June 21 and Malagnang Festival on June 17–21 of every year."
        ],
        [
            "Infrastructure"
        ],
        [
            "Aviation"
        ],
        [
            "The municipality as well as the northern municipalities of Palawan is served by the San Vicente Airport."
        ],
        [
            "Energy"
        ],
        [
            "There are five barangays which are partly served by electricity.",
            "The present source of electricity are a 1 unit 500 KW, 1 unit 250 KW and 1 unit 160 KW generating sets operated by National Power Corporation (NAPOCOR) which is sold to consumers through Palawan Electric Cooperative (PALECO).",
            "Serving 24 hours since December 2014."
        ],
        [
            "Water supply"
        ],
        [
            "The town has a water system which comes from the surface water of Little Baguio Falls."
        ],
        [
            "Communication"
        ],
        [
            "There are two telecommunication companies, SMART and GLOBE which have installed cell site facilities in Sitio Pinagmangalucan in Barangay Poblacion, Barangay Alimanguan, Barangay Binga, Barangay Port Barton and Barangay Caruray.",
            "These modern facilities have made communication much easier, faster and convenient.",
            "Likewise cable and internet connection is already available in Barangays Poblacion, Alimanguan and Port Barton."
        ],
        [
            "Environment"
        ],
        [
            "Endowed with white sand beaches, coral reefs, islands and islets, waterfalls, vast forest cover, mangroves, and varied endemic flora, San Vicente serves as habitat for 23 of the 25 wildlife species found in the island of Palawan."
        ],
        [
            "Gallery"
        ],
        [
            "Imuruan Bay"
        ],
        [
            "Long Beach"
        ],
        [
            "Port Barton Beach"
        ],
        [
            "Port Barton Bay"
        ],
        [
            "Bokbok Beach"
        ],
        [
            "Streetball in Port Barton"
        ],
        [
            "The coastline"
        ],
        [
            "Carabao"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Vicente |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Calderon, Justin (21 March 2013).",
            "\"Best-kept secret\".",
            "Inside Investor.",
            "Retrieved 25 March 2013."
        ],
        [
            "^ \"Long Beach San Vicente Palawan Philippines\".",
            "Long Beach."
        ],
        [
            "^ \"Long Beach San Vicente\".",
            "San Vicente."
        ],
        [
            "^ \"Long Beach San Vicente Palawan\".",
            "San Vicente Palawan.",
            "Archived from the original on 2017-10-08.",
            "Retrieved 2017-10-08."
        ],
        [
            "^"
        ],
        [
            "\"San Vicente: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 17 November 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Palawan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Real Estate Industry Getting Stronger\".",
            "San Vicente Palawan Beach for Sale.",
            "Retrieved October 17, 2017."
        ],
        [
            "^ \"Land Owners Selling Their Properties\".",
            "San Vicente Palawan Lot for Sale.",
            "Archived from the original on 2017-10-17.",
            "Retrieved October 15, 2017."
        ],
        [
            "^ \"Fast Selling Beach Front Properties\".",
            "San Vicente Palawan Property for Sale.",
            "Archived from the original on 2017-10-17.",
            "Retrieved October 9, 2017."
        ],
        [
            "^ \"Profitable Land Banking\".",
            "San Vicente Palawan Properties for Sale.",
            "Retrieved October 1, 2017."
        ],
        [
            "^ \"San Vicente Palawan Master Plan\".",
            "San Vicente Master Plan.",
            "Retrieved 2017-09-26."
        ],
        [
            "^ \"San Vicente Palawan\".",
            "San Vicente Palawan.",
            "Archived from the original on 2013-04-23."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Vicente, Palawan."
        ],
        [
            "Wikivoyage has a travel guide for San Vicente."
        ],
        [
            "Wikivoyage has a travel guide for Port Barton."
        ],
        [
            "San Vicente Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2016-03-04 at the Wayback Machine"
        ],
        [
            "San Vicente, Palawan"
        ],
        [
            "Places adjacent to San Vicente, Palawan"
        ],
        [
            "South China Sea"
        ],
        [
            "Taytay"
        ],
        [
            "San Vicente"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Roxas"
        ],
        [
            "vte Province of PalawanPuerto Princesa (capital and largest city)Municipalities"
        ],
        [
            "Aborlan"
        ],
        [
            "Agutaya"
        ],
        [
            "Araceli"
        ],
        [
            "Balabac"
        ],
        [
            "Bataraza"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Busuanga"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Coron"
        ],
        [
            "Culion"
        ],
        [
            "Cuyo"
        ],
        [
            "Dumaran"
        ],
        [
            "El Nido"
        ],
        [
            "Kalayaan"
        ],
        [
            "Linapacan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Narra"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "San Vicente"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Taytay"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Puerto Princesa (Administratively independent from the province but grouped under Palawan by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Vicente,_Palawan&oldid=1224184320\""
        ],
        [
            "Categories: Municipalities of PalawanBeaches of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataPages using infobox settlement with possible nickname listPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textWikipedia articles needing clarification from August 2015Commons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}