{
    "name": "San Rafael",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Rafael, Bulacan"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoČeštinaChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°57′N 120°58′E﻿ / ﻿14.95°N 120.97°E﻿ / 14.95; 120.97"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bulacan, Philippines"
        ],
        [
            "Municipality in Central Luzon, PhilippinesSan RafaelMunicipalityMunicipality of San RafaelMunicipal Hall"
        ],
        [
            "FlagSealMap of Bulacan with San Rafael highlightedOpenStreetMapSan RafaelLocation within the PhilippinesCoordinates: 14°57′N 120°58′E﻿ / ﻿14.95°N 120.97°E﻿ / 14.95; 120.97CountryPhilippinesRegionCentral LuzonProvinceBulacanDistrict"
        ],
        [
            "3rd districtFoundedSeptember 29, 1750Annexation to BaliuagOctober 8, 1903CharteredMarch 21, 1907Barangays34"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMark Cholo I. Violago • Vice MayorMarilyn S. Veneracion • RepresentativeLorna C. Silverio • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Joel M. VeneracionGerardo C. TorresJaime I. Viceo VApriliza C. Sta.",
            "MariaEdlin M. IndonNestor V. VichoAnna Maria S. SantosFrancisco G. Viola Jr."
        ],
        [
            " • Electorate65,353 voters (2022)Area • Revenue₱ 404.7 million (2020) • Assets₱ 1,078 million (2020) • Expenditure₱ 300.5 million (2020) • Liabilities₱ 274.5 million (2020)Utilities • ElectricityMeralcoTime zoneUTC+8 (PST)ZIP code3008, 3025 (Cruz Na Daan)PSGC031422000IDD : area code +63 (0)44Native languagesTagalogWebsitewww.sanrafael.gov.ph"
        ],
        [
            "San Rafael, officially the Municipality of San Rafael (Tagalog: Bayan ng San Rafael, Kapampangan: Balen ning San Rafael),  is a 1st class municipality in the province of Bulacan, Philippines.",
            "According to the 2020 census, it has a population of 103,097 people."
        ],
        [
            "With the continuous expansion of Metro Manila, San Rafael is part of Manila's built-up area which reaches San Ildefonso, Bulacan at its northernmost part."
        ],
        [
            "San Rafael is 37 kilometers (23 mi) from Malolos, the provincial capital, and 60 kilometers (37 mi) from Manila, the country's capital."
        ],
        [
            "Etymology"
        ],
        [
            "According to a legend, the origin of town's present name San Rafael traces to a local fisherman.",
            "A few days after he had dreamed that he could heal, he successfully treated an ill neighbor using a fish's liver.",
            "Because of this, the news spread that he was indeed able to heal.",
            "When the Spanish missionaries arrived, they visited his house that was flocked by many people.",
            "Because of this, they named the place after Saint Raphael the Archangel, the patron saint of healing whose name is in turn derived from a Hebrew word meaning \"God has healed.\""
        ],
        [
            "History"
        ],
        [
            "Spanish era"
        ],
        [
            "San Rafael was established as a pueblo in 1750.",
            "The combatants fought heavily inside the church to a point that blood was spilled all over the church floor.",
            "The patio in front of the church was littered by dead bodies of Filipino insurgents.",
            "The gobernadorcillo ordered people to dig a common grave near the church for the bodies of the insurgents."
        ],
        [
            "American influence"
        ],
        [
            "The Americans succeeded the Spaniards with their policy of benevolent assimilation.",
            "Schools were established as a potent factor for pacification.",
            "In 1903, schools were opened in San Rafael.",
            "The municipal building was used as a school house.",
            "Since then, with the supervision of the American administrators, San Rafael has enjoyed the education and the progress which was denied to them during the three–century rule of the Spaniards."
        ],
        [
            "In 1899, the Americans incorporated the town to Baliuag when the latter was intended to be the new provincial capital of Bulacan.",
            "However, due to a number of petitions of the people of San Rafael, especially when the plan to make Baliuag the capital of Bulacan did not materialize, the Americans where convinced to separate San Rafael as an independent town from Baliwag.",
            "Julian V. Valte was appointed to be the first Presidente Municipal of San Rafael, and Emilio Reyes was the last.",
            "However, its incorporation to Baliuag pushed through, alongside Bustos, on October 8, 1903, by virtue of Act No.",
            "932."
        ],
        [
            "In the year 1924 and 1927, with the help of some influential men, the Spaniards were able to get the signatures of the land owners of San Rafael and San Ildefonso to an agreement purporting to show their willingness to donate their lands to the Hospital of San Juan de Dios."
        ],
        [
            "Thus the town of San Rafael and San Ildefonso became properties of the hospital and started to be called Hacienda de Buenavista until 1944, when it got back its original name."
        ],
        [
            "Japanese occupation"
        ],
        [
            "The Commonwealth of the Philippines was invaded by the Empire of Japan in December 1941 shortly after Japan's declaration of war upon the United States of America, which controlled the Philippines at the time and possessed important military bases there.",
            "The combined American-Filipino army was defeated by April 1942."
        ],
        [
            "In May, 1942, the Japanese government opened schools and introduced the teaching of Nippon-go.",
            "As part of its war drive, Japanese propaganda included phrases like \"Asia for the Asians!\"",
            "and talked about the perceived need to liberate Asian countries from imperialist powers.",
            "Similarly, the Philippines were propagandized about \"American exploitation,\" \"American Imperialism,\" and \"American tyranny,\" and blame was laid on the United States for starting the war.",
            "They were assured that the American forces would not return and that they were not Japan's enemies.",
            "The effect of this was considerably undermined by the actions of the Japanese Army, and the Filipinos soon waited for the return of the Americans to free them from the Japanese.",
            "Japanese education condemned anything American, tried to infuse Japanese culture and to teach Filipinos the concept of the Greater East Asia Co-Prosperity Sphere under the Japanese influence."
        ],
        [
            "Socio–economic, educational and religious programs were largely non-existent.",
            "The people were deprived of property, food, supplies and shelter.",
            "They were forced or resorted to eat camote, wore jute sacks and tattered clothes.",
            "The people of San Rafael evacuated to Upig, Licheria, Coral na Bato and Camachile.",
            "Schools were closed and the church was ordered to stop performing its religious duties."
        ],
        [
            "Guerrilla resistance against the Japanese continued throughout the war.",
            "Uncaptured Filipino army units, a communist insurgency and supporting American agents all played a role in the resistance.",
            "The people of San Rafael refused to be subjected to Japanese authority and they organized and joined small guerrilla bands and harassed the units of the Japanese army stationed in the town whenever there was a chance to do so.",
            "These small, organized guerrillas in San Rafael later became members of BMA (Bulacan Military Area)."
        ],
        [
            "The liberation of San Rafael"
        ],
        [
            "When the American forces landed in Leyte in October 1944, the Japanese became more brutal.",
            "Hundreds met their death in the hands of the enemy.",
            "One cruel incident occurred at Barrio Pulo.",
            "Men and women who were assembled where tied together, dynamites were strapped to many of them and these were later detonated by the Japanese captors.",
            "A lone survivor, Marcelo Mangahas, told the world of the gory incident.",
            "Other atrocities followed.",
            "However, the unity of the people of San Rafael and the heroism of the Filipino soldiers and guerrillas prevented further casualties and destruction.",
            "When the Americans arrived, they found San Rafael liberated by the courageous guerrillas with the Filipino troops of the Philippine Commonwealth Army 32nd, 35th and 36th Infantry Division and the Philippine Constabulary 3rd Constabulary Regiment that were mostly from San Rafael."
        ],
        [
            "Local Filipino troops of the 32nd, 35th and 36th Infantry Division of the Philippine Commonwealth Army and 3rd Constabulary Regiment of the Philippine Constabulary liberated the town in San Rafael, Bulacan and aided the guerrillas of the Bulacan Military Area (BMA) and defeated Japanese soldiers and aftermath in World War II."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "San Rafael is politically subdivided into 34 barangays.",
            "Each barangay consist of 7 puroks and some have sitios."
        ],
        [
            "There are 5 urban and 29 rural barangays."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 031422001   BMA‑Balagtas"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,515"
        ],
        [
            " 1,512"
        ],
        [
            "  ▴"
        ],
        [
            " 0.02%"
        ],
        [
            " 031422002   Banca‑banca"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,174"
        ],
        [
            " 1,122"
        ],
        [
            "  ▴"
        ],
        [
            " 0.45%"
        ],
        [
            " 031422003   Caingin"
        ],
        [
            " 10.0%"
        ],
        [
            " 10,262"
        ],
        [
            " 9,723"
        ],
        [
            "  ▴"
        ],
        [
            " 0.54%"
        ],
        [
            " 031422004   Coral na Bato"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,500"
        ],
        [
            " 1,808"
        ],
        [
            "  ▾"
        ],
        [
            " −1.85%"
        ],
        [
            " 031422005   Cruz na Daan"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,372"
        ],
        [
            " 1,255"
        ],
        [
            "  ▴"
        ],
        [
            " 0.90%"
        ],
        [
            " 031422006   Dagat‑dagatan"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,347"
        ],
        [
            " 1,307"
        ],
        [
            "  ▴"
        ],
        [
            " 0.30%"
        ],
        [
            " 031422007   Diliman I"
        ],
        [
            " 3.2%"
        ],
        [
            " 3,340"
        ],
        [
            " 3,333"
        ],
        [
            "  ▴"
        ],
        [
            " 0.02%"
        ],
        [
            " 031422008   Diliman II"
        ],
        [
            " 0.8%"
        ],
        [
            " 850"
        ],
        [
            " 773"
        ],
        [
            "  ▴"
        ],
        [
            " 0.95%"
        ],
        [
            " 031422009   Capihan"
        ],
        [
            " 6.2%"
        ],
        [
            " 6,423"
        ],
        [
            " 5,083"
        ],
        [
            "  ▴"
        ],
        [
            " 2.37%"
        ],
        [
            " 031422010   Libis"
        ],
        [
            " 2.2%"
        ],
        [
            " 2,228"
        ],
        [
            " 2,077"
        ],
        [
            "  ▴"
        ],
        [
            " 0.70%"
        ],
        [
            " 031422011   Lico"
        ],
        [
            " 2.0%"
        ],
        [
            " 2,023"
        ],
        [
            " 1,941"
        ],
        [
            "  ▴"
        ],
        [
            " 0.41%"
        ],
        [
            " 031422012   Maasim"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,346"
        ],
        [
            " 1,302"
        ],
        [
            "  ▴"
        ],
        [
            " 0.33%"
        ],
        [
            " 031422013   Mabalas‑balas"
        ],
        [
            " 3.6%"
        ],
        [
            " 3,667"
        ],
        [
            " 3,196"
        ],
        [
            "  ▴"
        ],
        [
            " 1.38%"
        ],
        [
            " 031422014   Maguinao"
        ],
        [
            " 4.0%"
        ],
        [
            " 4,123"
        ],
        [
            " 3,659"
        ],
        [
            "  ▴"
        ],
        [
            " 1.20%"
        ],
        [
            " 031422015   Maronquillo"
        ],
        [
            " 3.2%"
        ],
        [
            " 3,284"
        ],
        [
            " 2,514"
        ],
        [
            "  ▴"
        ],
        [
            " 2.71%"
        ],
        [
            " 031422016   Paco"
        ],
        [
            " 1.1%"
        ],
        [
            " 1,101"
        ],
        [
            " 926"
        ],
        [
            "  ▴"
        ],
        [
            " 1.75%"
        ],
        [
            " 031422017   Pansumaloc"
        ],
        [
            " 1.0%"
        ],
        [
            " 997"
        ],
        [
            " 873"
        ],
        [
            "  ▴"
        ],
        [
            " 1.34%"
        ],
        [
            " 031422018   Pantubig"
        ],
        [
            " 3.6%"
        ],
        [
            " 3,750"
        ],
        [
            " 3,508"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 031422019   Pasong Bangkal"
        ],
        [
            " 0.9%"
        ],
        [
            " 955"
        ],
        [
            " 717"
        ],
        [
            "  ▴"
        ],
        [
            " 2.91%"
        ],
        [
            " 031422020   Pasong Callos"
        ],
        [
            " 0.8%"
        ],
        [
            " 818"
        ],
        [
            " 738"
        ],
        [
            "  ▴"
        ],
        [
            " 1.03%"
        ],
        [
            " 031422021   Pasong Intsik"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,459"
        ],
        [
            " 1,317"
        ],
        [
            "  ▴"
        ],
        [
            " 1.03%"
        ],
        [
            " 031422022   Pinacpinacan"
        ],
        [
            " 1.8%"
        ],
        [
            " 1,815"
        ],
        [
            " 1,538"
        ],
        [
            "  ▴"
        ],
        [
            " 1.67%"
        ],
        [
            " 031422023  Poblacion"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,636"
        ],
        [
            " 1,678"
        ],
        [
            "  ▾"
        ],
        [
            " −0.25%"
        ],
        [
            " 031422024   Pulo"
        ],
        [
            " 3.4%"
        ],
        [
            " 3,488"
        ],
        [
            " 3,470"
        ],
        [
            "  ▴"
        ],
        [
            " 0.05%"
        ],
        [
            " 031422025   Pulong Bayabas"
        ],
        [
            " 1.0%"
        ],
        [
            " 1,071"
        ],
        [
            " 926"
        ],
        [
            "  ▴"
        ],
        [
            " 1.47%"
        ],
        [
            " 031422026   Salapungan"
        ],
        [
            " 2.0%"
        ],
        [
            " 2,058"
        ],
        [
            " 1,895"
        ],
        [
            "  ▴"
        ],
        [
            " 0.83%"
        ],
        [
            " 031422027   Sampaloc"
        ],
        [
            " 3.9%"
        ],
        [
            " 4,009"
        ],
        [
            " 3,693"
        ],
        [
            "  ▴"
        ],
        [
            " 0.82%"
        ],
        [
            " 031422028   San Agustin"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,486"
        ],
        [
            " 1,290"
        ],
        [
            "  ▴"
        ],
        [
            " 1.42%"
        ],
        [
            " 031422030   San Roque"
        ],
        [
            " 8.0%"
        ],
        [
            " 8,233"
        ],
        [
            " 6,494"
        ],
        [
            "  ▴"
        ],
        [
            " 2.40%"
        ],
        [
            " 031422031   Talacsan"
        ],
        [
            " 3.5%"
        ],
        [
            " 3,659"
        ],
        [
            " 3,638"
        ],
        [
            "  ▴"
        ],
        [
            " 0.06%"
        ],
        [
            " 031422032   Tambubong"
        ],
        [
            " 7.6%"
        ],
        [
            " 7,810"
        ],
        [
            " 7,432"
        ],
        [
            "  ▴"
        ],
        [
            " 0.50%"
        ],
        [
            " 031422033   Tukod"
        ],
        [
            " 2.3%"
        ],
        [
            " 2,381"
        ],
        [
            " 2,262"
        ],
        [
            "  ▴"
        ],
        [
            " 0.51%"
        ],
        [
            " 031422034   Ulingao"
        ],
        [
            " 2.6%"
        ],
        [
            " 2,653"
        ],
        [
            " 2,198"
        ],
        [
            "  ▴"
        ],
        [
            " 1.90%"
        ],
        [
            " 031422035   Sapang Pahalang"
        ],
        [
            " 0.8%"
        ],
        [
            " 822"
        ],
        [
            " 723"
        ],
        [
            "  ▴"
        ],
        [
            " 1.29%"
        ],
        [
            "Total"
        ],
        [
            "103,097"
        ],
        [
            "85,921"
        ],
        [
            " ▴"
        ],
        [
            "1.84%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Rafael, Bulacan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "6(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "6(0.2)"
        ],
        [
            "17(0.7)"
        ],
        [
            "82(3.2)"
        ],
        [
            "122(4.8)"
        ],
        [
            "151(5.9)"
        ],
        [
            "123(4.8)"
        ],
        [
            "124(4.9)"
        ],
        [
            "99(3.9)"
        ],
        [
            "37(1.5)"
        ],
        [
            "21(0.8)"
        ],
        [
            "792(31.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "2.5"
        ],
        [
            "11.7"
        ],
        [
            "6.6"
        ],
        [
            "17.7"
        ],
        [
            "22.2"
        ],
        [
            "25.2"
        ],
        [
            "23.7"
        ],
        [
            "23.2"
        ],
        [
            "17.9"
        ],
        [
            "9.2"
        ],
        [
            "5.2"
        ],
        [
            "168.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San RafaelYearPop.±% p.a.1903 6,682—    1918 8,537+1.65%1939 12,269+1.74%1948 14,632+1.98%1960 19,772+2.54%1970 28,039+3.55%1975 32,342+2.90%1980 36,803+2.62%1990 49,528+3.01%1995 58,387+3.13%2000 69,770+3.89%2007 85,284+2.81%2010 85,921+0.27%2015 94,655+1.86%2020 103,097+1.69%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Rafael, Bulacan, was 103,097 people, with a density of 680 inhabitants per square kilometre or 1,800 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Rafael"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  11.40"
        ],
        [
            "2009  8.30"
        ],
        [
            "2012  7.29"
        ],
        [
            "2015  7.01"
        ],
        [
            "2018  4.45"
        ],
        [
            "2021  12.72"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            " 8 Waves Waterpark & Hotel, DRT Highway, Ulingao"
        ],
        [
            "The 8 Waves Waterpark & Hotel is the prime resort of the Town, and is one of the biggest in the Philippines.",
            "The Big Rock Farm Resort is another notable resort of the Town which is located in Barangay Coral na Bato.",
            "The first specialty store of the popular Bulacan's Prime - The Home of Garlic Longaniza can also be found in San.",
            "Rafael who is well known for its Garlic and Sweet Longaniza.",
            "The Malangaan Cave and Spring, located in Barangay Tukod is a large cave untouched by quarry operations in San Rafael, Bulacan and according to the locals of the barangay, it was once a hiding place of guerillas during World War II."
        ],
        [
            " Dela Fuente-Villaroman Ancestral House"
        ],
        [
            "The Dela Fuente-Villaroman Ancestral House or Casa dela Fuente (Caingin) was declared a Heritage House per National Historical Commission of the Philippines Resolution No.",
            "7, s. 2022 under RA 10066 at 10086.",
            "The historical marker was unveiled on 17 August 2022 by Carminda R. Arevalo, OIC, NHCP and San Rafael Mayor Mark Cholo Violago with G. Leween V. Castro and G. Alvin R. Alid.",
            "Barangay Caingin Resolution of June 24, 2022 declared it \"Bahay na Malaki\" as Heritage House by Captain Ramilito B. Capistrano and all Councilors.",
            "Built in 1890, this 19th-century architecture in the Philippines with its Azotea built in 1957, is owned by Vicente Trinidad dela Fuente (November 14, 1866-December 16, 1920) a Cabeza de Barangay or Kapitan, husband of Paz Lim Villaroman (February 18, 1875-March 20, 1913) with children Amanda (February 20, 1891-January 14, 1960), Luisa, Luisa, Araceli (November 25 1895-April 7, 1995) and Dolores-Lolita (December 31, 1898-April 18, 1986), all spinsters, who established the \"dela Fuente Lines\".",
            "Their cousins Leticia Trinidad Gonzales and Dalisay Lim Cruz, teacher, built the Caingin chapel."
        ],
        [
            "Festivals"
        ],
        [
            "Every year, the town celebrates its Angel Festival in honor of their 2nd patron saint, Saint Raphael, together their town's pride, the Angel Festival, which attracts many tourists every year.",
            "It is a colorful celebration in honor of the Seven Archangels.",
            "This is held every 29 September."
        ],
        [
            "This is highlighted by a parade participated by children from the public and private schools in San Rafael.",
            "More than a thousand children in angel costumes in the street make it look like heaven has come down to the town of San Rafael.",
            "This is followed by an interpretative dancing competition by all participant schools.",
            "The Angel Festival was started last September 29, 2002 through the initiative of the San Juan de Dios Parish and the San Rafael Tourism Council."
        ],
        [
            "Notable personalities"
        ],
        [
            "Ruperto Cruz Santos (born October 30, 1957), fourth Bishop of Balanga (April 1, 2010–July 22, 2023) and fifth Bishop of Antipolo (July 22, 2023–present)"
        ],
        [
            "Gallery"
        ],
        [
            "San Rafael Fire & PNP Police Stations and Municipal Trial Court, inside the New San Rafael Municipal Hall (Sampaloc)"
        ],
        [
            "Bahay Pagbabago"
        ],
        [
            "St. Paul College San Rafael (Pantubig)"
        ],
        [
            "San Juan de Dios Church, a witness to the bloody 1896 Philippine Revolution (used as military barrack of Filipino insurgents for 3 days)"
        ],
        [
            "MMPCI Ecology Center (Maronquillo)"
        ],
        [
            "San Rafael Welcome Arch"
        ],
        [
            "Baywalk view (Lico, San Rafael) of Angat Dam-River & Sierra Madre (Philippines)"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Rafael |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Historical Glimpse\".",
            "Municipality of San Rafael, Bulacan, Philippines.",
            "Retrieved June 3, 2023."
        ],
        [
            "^ \"Interesting Trivia for Today: Etymology of Bulacan and its 24 Towns and Cities\".",
            "Bulakenyo (in Tagalog).",
            "October 29, 2020.",
            "Retrieved June 3, 2023."
        ],
        [
            "^ \"Spanish Order of Battle - Philippines\".",
            "spanamwar.com."
        ],
        [
            "^ Act No.",
            "932 (October 8, 1903), \"An Act Reducing the Twenty-five Municipalities of the Province of Bulacan to Thirteen\", Senate of the Philippines Legislative Digital Resources, retrieved July 3, 2023"
        ],
        [
            "^ Act No.",
            "1619 (March 21, 1907), \"Full Title an Act Increasing the Number of Municipalities in the Province of Bulacan From Fourteen to Fifteen, by Separating From Baliuag the Former Municipality of San Rafael, Giving the Latter the Territory Which It Comprised Prior to the Passage of Act Numbered Nine Hundred and Thirty-two, and Providing for the Distribution of Funds in the Municipal Treasury of Baliuag Resulting From the Separation From Baliuag of the Former Municipality of San Rafael\", Senate of the Philippines Legislative Digital Resources, retrieved July 3, 2023"
        ],
        [
            "^ \"Japanese PSYOP During WWII\".",
            "psywarrior.com."
        ],
        [
            "^ \"Official Website of San Rafael, Bulacan\".",
            "Retrieved 2011-09-08."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Rafael: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 12 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bulacan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Rafael, Bulacan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "All About San Rafael Bulacan"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to San Rafael, Bulacan"
        ],
        [
            "Candaba, Pampanga"
        ],
        [
            "San Ildefonso"
        ],
        [
            "Baliuag"
        ],
        [
            "San Rafael"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Bustos / Angat"
        ],
        [
            "vte Province of BulacanMalolos (capital)  San Jose del Monte (largest city)Municipalities"
        ],
        [
            "Angat"
        ],
        [
            "Balagtas"
        ],
        [
            "Bocaue"
        ],
        [
            "Bulakan"
        ],
        [
            "Bustos"
        ],
        [
            "Calumpit"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Guiguinto"
        ],
        [
            "Hagonoy"
        ],
        [
            "Marilao"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Pandi"
        ],
        [
            "Paombong"
        ],
        [
            "Plaridel"
        ],
        [
            "Pulilan"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Maria"
        ],
        [
            "Component cities"
        ],
        [
            "Baliwag"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Rafael,_Bulacan&oldid=1214817387\""
        ],
        [
            "Category: Municipalities of BulacanHidden categories: Pages using gadget WikiMiniAtlasCS1 Tagalog-language sources (tl)CS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}