{
    "name": "San Manuel",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Manuel, Pangasinan"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°03′56″N 120°40′00″E﻿ / ﻿16.06556°N 120.66667°E﻿ / 16.06556; 120.66667"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pangasinan, Philippines"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesSan ManuelMunicipalityMunicipality of San ManuelStreet in San Miguel"
        ],
        [
            "FlagSealMap of Pangasinan with San Manuel highlightedOpenStreetMapSan ManuelLocation within the PhilippinesCoordinates: 16°03′56″N 120°40′00″E﻿ / ﻿16.06556°N 120.66667°E﻿ / 16.06556; 120.66667CountryPhilippinesRegionIlocos RegionProvincePangasinanDistrict"
        ],
        [
            "6th districtBarangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorKenneth Marco S. Perez • Vice MayorAlain Jerico S. Perez • RepresentativeTyrone D. Agabas • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Sheila Marie S. PerezMario D. FarroJanet M. CautonMilton M. AbadesElizabeth D. MordenDaisy M. BarramedaDanilo S. SabaterRagsac C. de Leon"
        ],
        [
            " • Electorate31,225 voters (2022)Area • Revenue₱ 238.4 million (2020) • Assets₱ 500.7 million (2020) • Expenditure₱ 205.4 million (2020)Service provider • ElectricityDagupan Electric Corporation (DECORP)Time zoneUTC+8 (PST)ZIP code2438PSGC015535000IDD : area code +63 (0)75Native languagesPangasinan Ilocano Tagalog"
        ],
        [
            "San Manuel, officially the Municipality of San Manuel (Pangasinan: Baley na San Manuel; Ilocano: Ili ti San Manuel; Tagalog: Bayan ng San Manuel), is a 1st class municipality in the province of Pangasinan, Philippines.",
            "According to the 2020 census, it has a population of 54,271 people."
        ],
        [
            "Etymology"
        ],
        [
            "The town's name originated from early settlers' founder, Don Manuel Sequig amid the town's existence in 1614, when Poblacion was in Pau (now Curibetbet) with a population of 2,023."
        ],
        [
            "History"
        ],
        [
            "In 1688 the Convento was erected and in 1720,  both the church and convent were in place at Pau but were burned down due to a bad omen superstition, hence Asingan fused San Manuel was but natives moved Guiset, a name of San Manuel (great bamboo thickets).",
            "In 1860, San Manuel was decreed a town for the second time."
        ],
        [
            "San Manuel became a town, 44 years before Asingan was, but was absorbed by the latter from 1903 to 1907.",
            "(Source:Mr. Crispo Baclit, \"Ti Ababa Nga Pakasaritaan Ti Ili a San Manuel, Pangasinan\")"
        ],
        [
            "Incident"
        ],
        [
            "On September 12, 2012, gun-for-hire suspect Marcelino Cardinas Jr. (alias Jun Fabro, Barangay Botobot Norte, Balaoan, La Union) was arrested on the Case Unclosed twin murders of San Manuel's Vice Mayor Bonifacio Apilado (in Urdaneta City on June 20, 2007,)and Christopher Alfonso (an engineer, on Aug. 21, 2011).",
            "Regional Trial Court Judge Joven Costales of Branch 45, Urdaneta City issued the warrant of arrest for Renato Tarinay Jr. and Cardinas, Jr."
        ],
        [
            "In Barangay Gueset Norte, San Manuel, Pangasinan, Romero Gorospe, 40 Narra Tricycle Driver-Operators Association President and bodyguard of San Manuel mayoral bet and retired Vice Admiral Virgilio Q. Marcelo was ambushed, while Ruth Palip and Rosalinda Calip also died while crossing the street on April 19, 2010."
        ],
        [
            "Geography"
        ],
        [
            "San Manuel, in Eastern Pangasinan has nearby neighbors: Cordillera Mountain, Tuba, Benguet, Pozorrubio, San Nicolas, Asingan, Tayug and Binalonan, all of Pangasinan, with a total land area of 183.39 sq.m."
        ],
        [
            "Barangays"
        ],
        [
            "San Manuel is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "San Antonio-Arzadon"
        ],
        [
            "Cabacaraan"
        ],
        [
            "Cabaritan"
        ],
        [
            "Flores"
        ],
        [
            "Guiset Norte (Poblacion)"
        ],
        [
            "Guiset Sur (Poblacion)"
        ],
        [
            "Lapalo"
        ],
        [
            "Nagsaag"
        ],
        [
            "Narra"
        ],
        [
            "San Bonifacio"
        ],
        [
            "San Juan"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Sto.",
            "Domingo"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Manuel, Pangasinan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "13.6(0.54)"
        ],
        [
            "10.4(0.41)"
        ],
        [
            "18.2(0.72)"
        ],
        [
            "15.7(0.62)"
        ],
        [
            "178.4(7.02)"
        ],
        [
            "227.9(8.97)"
        ],
        [
            "368(14.5)"
        ],
        [
            "306.6(12.07)"
        ],
        [
            "310.6(12.23)"
        ],
        [
            "215.7(8.49)"
        ],
        [
            "70.3(2.77)"
        ],
        [
            "31.1(1.22)"
        ],
        [
            "1,766.5(69.56)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3"
        ],
        [
            "2"
        ],
        [
            "2"
        ],
        [
            "4"
        ],
        [
            "14"
        ],
        [
            "16"
        ],
        [
            "23"
        ],
        [
            "21"
        ],
        [
            "24"
        ],
        [
            "15"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "140"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San ManuelYearPop.±% p.a.1903 7,784—    1918 12,244+3.07%1939 15,622+1.17%1948 15,376−0.18%1960 20,959+2.61%1970 26,357+2.32%1975 27,555+0.90%1980 29,622+1.46%1990 35,490+1.82%1995 36,392+0.47%2000 41,206+2.70%2007 46,769+1.76%2010 46,875+0.08%2015 52,939+2.34%2020 54,271+0.49%Source: Philippine Statistics Authority"
        ],
        [
            "Language"
        ],
        [
            "San Manuel natives speak mostly Ilocano.",
            "English and Filipino are spoken as well."
        ],
        [
            "Religion"
        ],
        [
            "Every barangay has a Catholic Chapel, which are maintained by the Lay Ministers Of St. Bartholomew Parish Church- Located in the town proper of San Manuel."
        ],
        [
            "St. Bartholomew Parish Church"
        ],
        [
            "St. Bartholomew Parish Church"
        ],
        [
            "The 1687 St. Bartholomew Parish Church (Rizal, San Manuel, 2438 Central Pangasinan) is under the jurisdiction of the Roman Catholic Archdiocese of Lingayen-Dagupan,"
        ],
        [
            "Its Feast Day is August 24, with Parish Priest, Father Diomedes S. Laguerta, Guest Priest, Father Rafael T. Cruz and Vicar Forane, Father Elpidio F. Silva Jr."
        ],
        [
            "San Manuel first existed in barrio Pao (now Bato) in 1614, while the first church was built in Pao in 1688, which was burned in 1720, due to superstition.",
            "Hence, the natives heard Mass at Sinapug, name of Asingan."
        ],
        [
            "Accepted in 1860, San Manuel became a House of the Dominican Order in 1878, per Royal Decree of July 6, 1878, an independent parish from Asingan.",
            "The first “ermita” of the town was erected with the help of the faithful by Kura Paroko, Fr.",
            "Bonifacio Provanza built the first \"ermita\" or Bisita in 1882, with a cruciform.",
            "Fr.",
            "Jose Ma.",
            "Puente continued the construction and on October 1, 1894, a great whirlwind destroyed the ermita which was rebuilt by Fr, Fuente adding the convent.",
            "The 1898 revolutionaries destroyed the Church.",
            "Fr.",
            "Probanza built a small convent and the old church was about 100 meter long and 20 meters wide."
        ],
        [
            "The second dominant church is The Iglesia Ni Cristo, in the south of the town proper, and five barangay chapels, accounting for 2-3% of faithfuls in the municipality."
        ],
        [
            "There are other religious groups with fewer members."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Manuel"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  28.20"
        ],
        [
            "2009  21.33"
        ],
        [
            "2012  9.05"
        ],
        [
            "2015  12.44"
        ],
        [
            "2018  8.76"
        ],
        [
            "2021  17.19"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "San Manuel has the following attractions and interesting points:"
        ],
        [
            "NGCP's San Manuel street-lighting project:  the National Grid Corporation of the Philippines (NGCP) electrified San Manuel from Nagsaag Extra-High Voltage (EHV) substation down to Asuncion Street."
        ],
        [
            "Fiesta yearly, March 11–13.",
            "Pista'y Dayat"
        ],
        [
            "Butao Springs : A&E spring resort at Butao."
        ],
        [
            "San Roque Multi-Purpose Power Plant - San Roque Dam (Philippines) is the second largest dam in Asia."
        ],
        [
            "It is Asia's tallest dam and largest private hydropower project, costing US$1.19 billion and generating 345 MW of power."
        ],
        [
            "On May 11, 2012, granite \"Walk of Fame\" Memorial was unveiledd: Names of San Manuel Leaders, Mayors and notable residents were inscribed at the very long Marker in front of the Municipio or Town hall ."
        ],
        [
            "Feast of Saint Bartholomew - month of October."
        ],
        [
            "Historical Marker of 1886 Municipio Municipal (Capitan Toribio Diccion: burned, 1943 WWII; in 1934, Mayor Primitivo S. Perez, Marker and Flag Pole & 1979, Mayor Laureano S. Perez)"
        ],
        [
            "1927 Memorial \"Veteranos de la Revoucion\": Kapitan Juan P. Marquez & Sarhento Cornelio Ines (1898 Fort of Bolangit)"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "San Manuel, belonging to the sixth congressional district of the province of Pangasinan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Kenneth Marco Sison Perez serves as Mayor of San Manuel, while his brother the Honorable Alain Jerico Sison Perez serves as Vice Mayor.",
            "Previously, the Honorable Salvador M. Perez, their father, served as Vice Mayor to Alain Perez when he was Mayor, after the elder Perez served as Mayor himself."
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Tyrone D. Agabas"
        ],
        [
            "Mayor"
        ],
        [
            "Kenneth Marco S. Perez"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Alain Jerico S. Perez"
        ],
        [
            "Councilors"
        ],
        [
            "Sheila Marie S. Perez"
        ],
        [
            "Mario D. Farro"
        ],
        [
            "Janet M. Cauton"
        ],
        [
            "Milton M. Abades"
        ],
        [
            "Elizabeth D. Morden"
        ],
        [
            "Daisy M. Barrameda"
        ],
        [
            "Danilo S. Sabater"
        ],
        [
            "Ragsac C. de Leon"
        ],
        [
            "Political clans"
        ],
        [
            "The Perez family has long held mayoralty post over four generations, including Laureano (Kenneth Marco's grandfather) from 1964–1980 and 1981–1985 and Don Primitivo (Kenneth Marco's great-grandfather) from 1934–1940 and 1956–1963."
        ],
        [
            "Education"
        ],
        [
            "St. Mary's Dominican School is the first and only private Catholic School in the town.",
            "It was established by the late Fr.",
            "Mendoza and handed over to the Dominican Sisters ( O.P.",
            ")."
        ],
        [
            "Mataas na Paaralang Juan C. Laya (MPJCL) is the largest public secondary school of the town.",
            "It was the home to thousand of students coming from different barangays of the town.",
            "It was named after the late Juan C. Laya (1911-1952), a distinguished writer and educator.",
            "Juan Cabreros Laya (Filipino novelist, publisher and awardee of a Commonwealth prize for his English novel \"His Native Land\") is the founder of Inang Lupa publishing and was active in textbook in the 1950s."
        ],
        [
            "blessed angel achieves academy is a new established private school in the area"
        ],
        [
            "On 15 December 2012, For.",
            "Tom Valdez, SRPC vice president of San Roque Power Corp (SRPC), operator of the San Roque Multi-purpose Project including the Dam, opened its Education Governance Programs (with Synergeia Foundation) for San Manuel and San Nicolas in Pangasinan and Itogon in Benguet - the communities housing San Roque Dam.",
            "Main features are the day-care center and the Laklak creek retaining wall in Barangay Camangaan, repair of 5-classroom building in Barangay Bobon and building of one-classroom building each for barangays Bomboaya and Don Cristobal."
        ],
        [
            "Gallery"
        ],
        [
            "Welcome marker"
        ],
        [
            "Municipal Hall of San Manuel"
        ],
        [
            "Public Auditorium"
        ],
        [
            "Park and the Church"
        ],
        [
            "Dona Carmen's Park"
        ],
        [
            "Mayor's Gate"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Manuel |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Private armed group leader nabbed\".",
            "SunStar.",
            "Archived from the original on 2013-03-10.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"Killer of San Manuel VM now in police custody | Sunday Punch\".",
            "Archived from the original on 2012-11-20.",
            "Retrieved 2012-12-21."
        ],
        [
            "^"
        ],
        [
            "^ \"Tension grips Pangasinan town after killing\".",
            "Philippine Daily Inquirer.",
            "2010-04-20.",
            "Archived from the original on 2014-02-19.",
            "Retrieved 2013-09-08."
        ],
        [
            "^"
        ],
        [
            "\"San Manuel, Pangasinan: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 31 October 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Pangasinan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Pangasinan\".",
            "Home.comcast.net.",
            "Archived from the original on 2015-09-30.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ Archdiocese of Lingayen-Dagupan.",
            "\"Archdiocese of Lingayen-Dagupan\".",
            "Rcald.org.",
            "Retrieved 2013-09-08."
        ],
        [
            "^  Archived July 29, 2012, at the Wayback Machine"
        ],
        [
            "^ a b Chester (2008-02-18).",
            "\"Capital of Pangasinan: All Churches in Pangasinan\".",
            "Capitalpangasinan.blogspot.com.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"List of Catholic Dioceses in Asia | Asian Catholic Directory\".",
            "Ucanews.",
            "Archived from the original on 2012-09-04.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"St. Bartholomew Parish Church | catholic church\".",
            "Wikimapia.org.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"Archdiocese of Lingayen-Dagupan\".",
            "Claretianpublications.com.",
            "Archived from the original on 2014-02-02.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ Archdiocese of Lingayen-Dagupan.",
            "\"Archdiocese of Lingayen-Dagupan: Vicariate of Santo Tomas de Aquino\".",
            "Rcald.org.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"Cathedral of Our Lady of the Immaculate Conception, Urdaneta City, Pangasinan, Philippines\".",
            "GCatholic.org.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"Diocese of Urdaneta\".",
            "Cbcponline.net.",
            "Archived from the original on 2004-03-27.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b http://www.ngcp.ph/news_file/2012-12-12_news_release_streetlighting.pdf"
        ],
        [
            "^ \"PIA | Philippine Information Agency | NGCP set San Manuel town road for lighting\".",
            "www.pia.gov.ph.",
            "Archived from the original on 16 April 2013.",
            "Retrieved 3 February 2022."
        ],
        [
            "^ \"Arts and Culture\".",
            "Travel.pangasinan.com.",
            "Archived from the original on 2013-11-02.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"San Manuel, Pangasinan | The Backride Tour | EDMARATION #TownExplorer\".",
            "Edmaration.com.",
            "2011-12-13.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"San Roque dam in Pangasinan releases water\".",
            "SunStar.",
            "2012-08-03.",
            "Archived from the original on 2012-10-08.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"'Walk of Fame' ng mga lider ng bayan ng San Manuel, Pangasinan | Balita Pilipinas\".",
            "GMA News.",
            "2012-05-11.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"BP: Walk of fame ng mga lider ng bayan ng San Manuel\".",
            "YouTube.",
            "Archived from the original on 2021-12-13.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ \"Pangasinan website — San Manuel\".",
            "Retrieved 2020-11-21."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 7, 2022."
        ],
        [
            "^ Visperas, Eva.",
            "\"Pangasinan clan ruling town for 52 years\".",
            "The Philippine STAR.",
            "Retrieved 2020-11-20."
        ],
        [
            "^ \"2013 Candidates in San Manuel | List of Candidates for San Manuel, Pangasinan\".",
            "Know Your Candidates.",
            "Retrieved 2013-09-08."
        ],
        [
            "^ http://www.pangasinan.gov.ph/wp-content/uploads/2011/06/pangasinan-facts-figures-2010.pdf"
        ],
        [
            "^ \"PIA | Philippine Information Agency | San Roque Power Corp eyes education as key to alleviating poverty\".",
            "Philippine Information Agency.",
            "Archived from the original on 2013-04-16.",
            "Retrieved 2012-12-21."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Manuel, Pangasinan."
        ],
        [
            "San Manuel Profile at PhilAtlas.com"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "San Manuel at the Pangasinan Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to San Manuel, Pangasinan"
        ],
        [
            "Itogon, Benguet"
        ],
        [
            "SisonBinalonan"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas"
        ],
        [
            "Asingan"
        ],
        [
            "Tayug"
        ],
        [
            "vte Province of PangasinanLingayen (capital)  San Carlos City (largest city)Municipalities"
        ],
        [
            "Agno"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Anda"
        ],
        [
            "Asingan"
        ],
        [
            "Balungao"
        ],
        [
            "Bani"
        ],
        [
            "Basista"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos"
        ],
        [
            "Calasiao"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lingayen"
        ],
        [
            "Mabini"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Natividad"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Rosales"
        ],
        [
            "San Fabian"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Quintin"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sison"
        ],
        [
            "Sual"
        ],
        [
            "Tayug"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "San Carlos"
        ],
        [
            "Urdaneta"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan (Administratively independent from the province but grouped under Pangasinan by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Pangasinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Manuel,_Pangasinan&oldid=1198671530\""
        ],
        [
            "Categories: Municipalities of PangasinanPopulated places on the Agno RiverHidden categories: Pages using gadget WikiMiniAtlasAll articles with dead external linksArticles with dead external links from September 2013CS1 maint: numeric names: authors listWebarchive template wayback linksArticles with dead external links from November 2016Articles with permanently dead external linksAll articles with bare URLs for citationsArticles with bare URLs for citations from March 2022Articles with PDF format bare URLs for citationsArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from February 2016Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}