{
    "name": "San Jose",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Jose, Romblon"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°04′N 121°56′E﻿ / ﻿12.07°N 121.93°E﻿ / 12.07; 121.93"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Romblon, Philippines"
        ],
        [
            "For the other places named \"San Jose\" in the Philippines, see San Jose (disambiguation)."
        ],
        [
            "Municipality in Mimaropa, PhilippinesSan JoseMunicipalityMunicipality of San Jose"
        ],
        [
            "FlagMap of Romblon with San Jose highlightedOpenStreetMapSan JoseLocation within the PhilippinesCoordinates: 12°04′N 121°56′E﻿ / ﻿12.07°N 121.93°E﻿ / 12.07; 121.93CountryPhilippinesRegionMimaropaProvinceRomblonDistrict"
        ],
        [
            "Lone districtFoundedJuly 1, 1968Barangays5"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRonnie D. Samson • Vice MayorEgdon T. Sombilon • RepresentativeEleandro Jesus F. Madrona • Councilors"
        ],
        [
            "Gina Villanueva"
        ],
        [
            "Milky Maming"
        ],
        [
            "Argel \"Ghel\" Zacarias"
        ],
        [
            "Ulysis Casimero"
        ],
        [
            "Ex Tandog"
        ],
        [
            "Ally Aron"
        ],
        [
            "Edwin Abon"
        ],
        [
            "Vilmo Sombilon, Jr."
        ],
        [
            " • Electorate7,592 voters (2022)Area"
        ],
        [
            " • Revenue₱ 65.43 million (2020) • Assets₱ 181.6 million (2020) • Expenditure₱ 57.46 million (2020) • Liabilities₱ 63.28 million (2020)Service provider • ElectricityTablas Island Electric Cooperative (TIELCO)Time zoneUTC+8 (PST)ZIP code5510PSGC1705914000IDD : area code +63 (0)42Native languagesOnhan Ati Tagalog"
        ],
        [
            "San Jose, officially the Municipality of San Jose,  is a 5th class municipality in the province of Romblon, Philippines.",
            "According to the 2020 census, it has a population of 11,759 people."
        ],
        [
            "It is also known as Carabao Island, or Hambil Island, the southernmost island of the province."
        ],
        [
            "Throughout much of its Spanish and American colonial history, the island repeatedly changed hands between the political jurisdictions of Romblon and Capiz provinces, before becoming a separate municipality of Romblon in 1969.",
            "The majority of the town's inhabitants speak Onhan, a Western Visayan language also spoken in some parts of Aklan in Panay Island.",
            "San Jose is located near the resort island of Boracay."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "The original settlers of the island were the Aetas, locally known as Ati or Ita who were believed to have descended from Orang Asli, the aboriginal people of the Malay Peninsula in mainland Asia.",
            "The aborigines came to the Philippines during the Paleolithic period by way of land bridges that connected the archipelago to mainland Asia.",
            "The Aetas settled in different parts of Panay Island and on the southern portion of Tablas Island, including Carabao Island where San Jose is located."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "According to Spanish explorer Miguel de Loarca's Relacion de las Islas Filipinas, Carabao Island was originally called “Hambil”.",
            "The Spanish arrived at Hambil Island in 1570, led by conquistador and explorer Martin de Goiti on orders from Miguel López de Legazpi.",
            "With an expedition composed of 27 ships, 280 Spaniards and several hundred Visayan followers, Goiti and his team conquered the chief settlement of Agcogon and explored the island.",
            "He noted that there were around 50 natives living in the settlement, who made a living from mining copper in the island."
        ],
        [
            "On 2 November 1571, the islands of Romblon, including Hambil Island were organized into an encomienda and administered from the alcaldia or province of Panay by Don Alvaro de Angulo, who was appointed steward of the encomienda.",
            "In 1582, when Miguel de Loarca visited Hambil Island, he renamed the island to Isla de Carabao or Carabao Island because the island's shape resembles a water buffalo's back when seen from the horizon.",
            "In 1677, the first Spanish missionary, Fray Pedro Cubero Sebastian, arrived at Carabao Island to convert the natives to Roman Catholicism."
        ],
        [
            "Changes in jurisdiction"
        ],
        [
            "In 1716, Capiz was created as a separate province out of the old alcaldia of Arevalo, formerly called Panay.",
            "The new province included the islands of Romblon and the valley of Aklan in north-western Panay.",
            "Carabao Island was placed under the jurisdiction of the visita of Nabas, Capiz (now part of Aklan).",
            "When Looc in Tablas Island was established as a separate pueblo or town from Banton, Romblon in 1844, the administration of Carabao Island and its two existing barrios (villages) of Agcogon and Lanas, was transferred to the new pueblo."
        ],
        [
            "On 19 March 1853, the Spaniards created the Politico-Militar Commandancia del Distrito de Romblon, a new district of Capiz.",
            "It was composed of four pueblos or towns, namely Romblon, Banton, Cajidiocan and Looc, and was placed under the command of petty governor Don Ramon Vieytes.",
            "Thus, Carabao Island, which was under the jurisdiction of Looc pueblo, became part of the newly created District of Romblon."
        ],
        [
            "In 1855, Romblon petty governor Don Joaquin de Prat ordered the creation of 17 new pueblos or town in Romblon, including pueblo de Cabalian (now part of Santa Fe).",
            "The order transferred the administration of Carabao Island and its two villages from Looc to Cabalian.",
            "However, pueblo de Cabalian was abolished in 1861, and following the abolition, residents of Carabao Island chose to be annexed back to Nabas, Capiz.",
            "On 11 January 1868, the District of Romblon was elevated into a province.",
            "A reorganization of the province's towns was conducted upon orders from governor Don Joaquin Corillo, which included restoration of Cabalian in 1892 into a pueblo, now renamed Santa Fe.",
            "In 1897, the residents of Carabao Island voted to rejoin Looc instead of the new pueblo of Santa Fe."
        ],
        [
            "American invasion era"
        ],
        [
            "The Americans arrived and established civilian government in Romblon on 16 March 1901.",
            "The new colonizers decided to attach Carabao and its two barrios to Santa Fe.",
            "However, with the abolishment of Romblon province on 15 July 1907 due to insufficient income, the province, together with Carabao Island, was incorporated back to Capiz province."
        ],
        [
            "Following the restoration of Romblon province on 10 March 1917, Santa Fe was once again abolished and Carabao Island was again re-annexed to Looc.",
            "Another change in Romblon's political boundaries happened on 8 June 1940, when Philippine Congress passed Commonwealth Act No.",
            "581 sponsored by Congressman Leonardo Festin, which created the special municipality of Tablas.",
            "With the creation of the special municipality, all the previous municipalities in Tablas Island were abolished and incorporated into the new municipality."
        ],
        [
            "Philippine independence"
        ],
        [
            "After World War II, when American civil government was restored, the special municipality of Tablas was abolished on 1 October 1946 by virtue of Republic Act No.",
            "38 sponsored by Congressman Modesto Formelleza.",
            "Thus, the Santa Fe municipality was re-established, with Carabao Island under its administration.",
            "On 24 April 1959, two new barrios or villages, Busay and Pinamihagan, were created in Carabao Island by virtue of Republic Act No.",
            "2144 authored by Congressman Jose D. Moreno"
        ],
        [
            "Carabao Island with its four villages was officially converted into a municipal district of Santa Fe on 18 June 1961 by virtue of Republic Act No.",
            "3423, sponsored by Congressman Moreno.",
            "On 18 June 1966, the island municipal district was renamed San Jose by virtue of Republic Act No.",
            "4829.",
            "In 1968, a new barrio, Combot, was added to the island, taken from portions of barrio Poblacion and Lanas."
        ],
        [
            "San Jose was retroactively declared an independent municipality of Romblon on 1 July 1968 by virtue of Executive Order No.",
            "184."
        ],
        [
            "Geography"
        ],
        [
            "San Jose is located at Carabao Island off the southern tip of Tablas Island in Romblon province.",
            "It is separated from the municipality of Santa Fe in Tablas by the Cabalian Channel.",
            "To the south of San Jose are the municipalities of Malay and Nabas in Aklan province, which are on the north-western tip of Panay Island.",
            "It is very close to neighboring Boracay Island, a popular tourist destination for Filipinos and foreigners alike.",
            "San Jose is separated from Boracay by a narrow body of sea called Hambil Channel."
        ],
        [
            "San Jose has a total land area of 22.05 square kilometers (8.51 square miles).",
            "The island municipality has a diverse geographic profile, with an irregular coastline dotted by white sand beaches that are becoming an alternative tourist destination to neighboring Boracay.",
            "Its interior is characterized by undulating hills covered with lush rainforest and coconut trees."
        ],
        [
            "Barangays"
        ],
        [
            "San Jose is politically subdivided into 5 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Busay"
        ],
        [
            "Combot"
        ],
        [
            "Lanas"
        ],
        [
            "Pinamihagan"
        ],
        [
            "Poblacion (Agcogon"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Jose, Romblon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "47(1.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "39(1.5)"
        ],
        [
            "48(1.9)"
        ],
        [
            "98(3.9)"
        ],
        [
            "150(5.9)"
        ],
        [
            "169(6.7)"
        ],
        [
            "147(5.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "172(6.8)"
        ],
        [
            "118(4.6)"
        ],
        [
            "80(3.1)"
        ],
        [
            "1,264(49.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "8.2"
        ],
        [
            "9.3"
        ],
        [
            "9.7"
        ],
        [
            "19.1"
        ],
        [
            "25.6"
        ],
        [
            "27.4"
        ],
        [
            "25.5"
        ],
        [
            "25.5"
        ],
        [
            "25.2"
        ],
        [
            "18.5"
        ],
        [
            "14.5"
        ],
        [
            "219.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San JoseYearPop.±% p.a.1970 4,562—    1975 5,352+3.25%1980 5,797+1.61%1990 7,139+2.10%1995 7,713+1.46%2000 8,226+1.39%2007 9,428+1.90%2010 10,294+3.25%2015 10,881+1.06%2020 11,759+1.54%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2020 census, San Jose has a total population of 11,759.",
            "The municipality has a population density of 534 persons per square kilometer.",
            "In 2013, San Jose had 6,662 registered voters distributed into 38 precincts, according to the COMELEC."
        ],
        [
            "San Jose's population is composed mainly of Aeta natives and migrants from Panay who spoke Onhan, also known as Taga-onhan or Inunhan (Hambilanon style), the native language of the inhabitants and one of three major languages in Romblon.",
            "Onhan is a variant of the Western Visayan language of Kinaray-a and is thus, spoken not only in Romblon but also in some parts of neighboring Aklan."
        ],
        [
            "Majority of the island's population are Roman Catholic and the Assemblies of God, with a small denomination of Protestants, Seventh-day Adventists, Iglesia ni Cristo, and Jehovah's Witnesses."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Jose"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "2006  65.80"
        ],
        [
            "2009  50.48"
        ],
        [
            "2012  41.03"
        ],
        [
            "2015  33.85"
        ],
        [
            "2018  27.94"
        ],
        [
            "2021  40.04"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Fishing and tourism are two of the primary economic activities in San Jose.",
            "The latter became a popular source of income in recent years following the influx of tourists to neighboring Boracay Island.",
            "Several beach resorts were established along the shores of Carabao Island to take advantage of tourist arrivals.",
            "Aside from tourism, San Jose residents also engage in livestock raising, copra farming, vegetable and root crop cultivation, and merchant trading with nearby Santa Fe and Odiongan in Tablas Island, and Boracay in Aklan."
        ],
        [
            "Transportation"
        ],
        [
            "As an island municipality, the only means to reach San Jose is via sea travel.",
            "There are several sea routes going to the island.",
            "From Manila or Batangas City, there are daily RORO trips going to Odiongan, Romblon or Caticlan in Aklan province.",
            "From Odiongan, there are jeepneys that take passengers to Santa Fe, where travellers can take pump boats or bancas going to San Jose.",
            "From Caticlan, there are bancas as well that take passengers to San Jose.",
            "The island is approximately a 45-minute boat ride from either Santa Fe or Caticlan.",
            "San Jose has a municipal port in Barangay Poblacion where passengers and cargo disembark."
        ],
        [
            "Another mode of travel is by air.",
            "AirAsia, Cebu Pacific and Philippine Airlines have daily trips to Caticlan Airport from where passengers can take bancas to San Jose.",
            "Cebu Pacific also has flights four times week to Tugdan Airport in Alcantara, Romblon, where passengers can take a jeepney to Santa Fe and a boat to San Jose."
        ],
        [
            "San Jose's five barangays are connected by a circumferential road, where the common mode of transportation are passenger motorcycles, known elsewhere as habal-habal."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "As a municipality in the Province of Romblon, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "Pursuant to Chapter II, Title II, Book III of Republic Act 7160 or the Local Government Code of 1991, the municipal government is composed of a mayor (alkalde), a vice mayor (bise alkalde) and eight members (kagawad) of the Sangguniang Bayan or town council, alongside a secretary to the said council, all of which are elected to a three-year term and are eligible to run for three consecutive terms.",
            "San Jose's incumbent mayor and vice mayor as of 30 June 2019 are Ronnie Samson and Egdon Sombilon from LAKAS and NPC, respectively."
        ],
        [
            "The barangays or villages, meanwhile, are headed by elected officials, the topmost being the Punong Barangay or the Barangay Chairperson (addressed as Kapitan; also known as the Barangay Captain).",
            "The Kapitan is aided by the Sangguniang Barangay (Barangay Council) whose members, called Barangay Kagawad (Councilors), are also elected.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Jose |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Republic Act No.",
            "38 : REPUBLIC ACTS - PHILIPPINE LAWS STATUTES and CODES - CHANROBLES VIRTUAL LAW LIBRARY\".",
            "laws.chanrobles.com."
        ],
        [
            "^ \"Republic Act No.",
            "4829 : REPUBLIC ACTS - PHILIPPINE LAWS STATUTES and CODES - CHANROBLES VIRTUAL LAW LIBRARY\".",
            "laws.chanrobles.com."
        ],
        [
            "^ gov.ph"
        ],
        [
            "^"
        ],
        [
            "\"San Jose: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 April 2020."
        ],
        [
            "^ Census of Population (2020).",
            "\"MIMAROPA\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "PSA.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Poverty Incidence, 2000\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"Poverty Incidence, 2003\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"Poverty Incidence, 2006\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"Poverty Incidence, 2012\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Poverty Incidence, 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Providing for a Local Government Code of 1991\".",
            "The LawPhil Project.",
            "8th Congress of the Republic of the Philippines.",
            "Retrieved April 21, 2014."
        ],
        [
            "^ \"The Barangay\".",
            "Local Government Code of the Philippines.",
            "Chan Robles Law Library.",
            "{{cite web}}: External link in |work= (help)"
        ],
        [
            "External links"
        ],
        [
            "San Jose Profile at PhilAtlas.com"
        ],
        [
            "San Jose, Romblon Profile - Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to San Jose, Romblon"
        ],
        [
            "Santa FeCabalian Channel"
        ],
        [
            "Tablas Strait"
        ],
        [
            "San Jose"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "Sibuyan SeaMalay, Aklan (Boracay)"
        ],
        [
            "vte Province of RomblonRomblon (capital)  Odiongan (largest municipality)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Banton"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Calatrava"
        ],
        [
            "Concepcion"
        ],
        [
            "Corcuera"
        ],
        [
            "Ferrol"
        ],
        [
            "Looc"
        ],
        [
            "Magdiwang"
        ],
        [
            "Odiongan"
        ],
        [
            "Romblon"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Jose,_Romblon&oldid=1225055581\""
        ],
        [
            "Categories: Municipalities of RomblonIsland municipalities in the Philippines1969 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listCS1 errors: external linksArticles with short descriptionShort description is different from WikidataCoordinates on WikidataPages using the Kartographer extension"
        ]
    ]
}