{
    "name": "San Mateo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Mateo, Isabela"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°53′N 121°35′E﻿ / ﻿16.88°N 121.58°E﻿ / 16.88; 121.58"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesSan MateoMunicipalityMunicipality of San Mateo"
        ],
        [
            "FlagSealNickname(s): Munggo Capital of the Philippines  Agro Ecological Destination in Cagayan ValleyMap of Isabela with San Mateo highlightedOpenStreetMapSan MateoLocation within the PhilippinesCoordinates: 16°53′N 121°35′E﻿ / ﻿16.88°N 121.58°E﻿ / 16.88; 121.58CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "3rd districtFoundedMarch 17, 1946Barangays33"
        ],
        [
            "  (see Barangays)Government  • Revenue PHP 259,867,393.78 million (2.51%) (2020) • Assets PHP 702,284,153.48 million (7.10%) (2020) • Expenditure₱ 265.7 million (2020) • Liabilities PHP 369,072,314.62 million (19.59%) (2020)Service provider • ElectricityIsabela 1 Electric Cooperative (ISELCO 1)Time zoneUTC+8 (PST)ZIP code3318PSGC023132000IDD : area code +63 (0)78Native languagesIlocano TagalogWebsitewww.sanmateo-isabela.gov.ph"
        ],
        [
            "San Mateo  (pronounced locally as /sænˈmäCHō/ not /sæn mə-tay-oh/ , Spanish for St. Matthew), officially the Municipality of San Mateo (Ilocano: Ili ti San Mateo; Tagalog: Bayan ng San Mateo), is a 1st class municipality in the province of Isabela, Philippines.",
            "According to the 2020 census, it has a population of 66,663 people."
        ],
        [
            "San Mateo is one of the cleanest town in the region.",
            "The administrators encourage the people of the municipality to use paper bags instead of plastic bags in line with its claim as an \"Agro-Ecological Town\"."
        ],
        [
            "Etymology"
        ],
        [
            "The town was first named as Marasat.",
            "It was a former barangay of Cauayan, then Santiago.",
            "It was called the Municipality of Yoshisawa under the government of the Japanese Imperial Army during the Second World War.",
            "After the liberation, it was finally created and named San Mateo by virtue of Presidential Executive Order No.",
            "97 on March 17, 1946, by then President Sergio Osmeña.",
            "It was named for its founder, the late Don Mateo A. Cadeliña."
        ],
        [
            "History"
        ],
        [
            "On March 17, 1946, President Sergio Osmeña issued Executive Order No.",
            "97, which established San Mateo as a formal municipality.",
            "According to the provisions of Executive Order No.",
            "249 of the Office of the President of the Philippines, and based on the municipality's annual average income for CY 2004–2007 as certified by the Commission on Audit, and as implemented by Department of Finance Order No.",
            "23–08 dated July 29, 2008, the municipality was reclassified from a second class municipality to first class municipality."
        ],
        [
            "On December 1, 2008, President Gloria Macapagal-Arroyo designated the Municipality as an Agro-Ecological Destination in Cagayan Valley Region as recommended by the Department of Agriculture due to its vast ecological and agricultural production areas, as well as being the recipient of the Galing Pook Award 2007 for the best local governance programs.",
            "On January 27, 2012, Department of Agriculture Secretary Proceso J. Alcala designated the municipality as the Munggo Capital of the Philippines.",
            "This is in acknowledgment of local leaders' valuable efforts to promote munggo production, which is a high-value commercial commodity.'"
        ],
        [
            "According to Republic Act No.",
            "7160, also known as the Local Government Code of 1991, the municipality is responsible for coordinating and providing basic, regular, and direct services to its residents in order to promote social and economic development.",
            "As proof, the municipality of San Mateo received the Seal of Good Local Governance from 2015 to 2019 and again in 2022, the Department of Interior and Local Government's highest accreditation for performing local governments."
        ],
        [
            "Geography"
        ],
        [
            "San Mateo is situated in the southwestern part of Isabela.",
            "It is bounded on the north by Aurora, on the northeast by Cabatuan, on the east by Cauayan, on the east-southeast by Alicia, on the south by Ramon and on the west Alfonso Lista in the Province of Ifugao."
        ],
        [
            "San Mateo is 54 kilometres (34 mi) from Ilagan and 350 kilometres (220 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "San Mateo is politically subdivided into 33 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Bacarreña"
        ],
        [
            "Bagong Sikat"
        ],
        [
            "Bella Luz"
        ],
        [
            "Dagupan"
        ],
        [
            "Daramuangan Norte"
        ],
        [
            "Daramuangan Sur"
        ],
        [
            "Estrella"
        ],
        [
            "Gaddanan"
        ],
        [
            "Malasin"
        ],
        [
            "Mapuroc"
        ],
        [
            "Marasat Grande"
        ],
        [
            "Marasat Pequeño"
        ],
        [
            "Old Centro I"
        ],
        [
            "Old Centro Proper"
        ],
        [
            "Barangay I (Poblacion)"
        ],
        [
            "Barangay II (Poblacion)"
        ],
        [
            "Barangay III (Poblacion)"
        ],
        [
            "Barangay IV (Poblacion)"
        ],
        [
            "Salinungan East"
        ],
        [
            "Salinungan West"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Ignacio"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcos"
        ],
        [
            "San Roque"
        ],
        [
            "Sinamar Norte"
        ],
        [
            "Sinamar Sur"
        ],
        [
            "Victoria"
        ],
        [
            "Villafuerte"
        ],
        [
            "Villa Cruz"
        ],
        [
            "Villa Magat"
        ],
        [
            "Villa Gamiao (Buyon)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Mateo, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "15(59)"
        ],
        [
            "17(63)"
        ],
        [
            "18(64)"
        ],
        [
            "19(66)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "19(66)"
        ],
        [
            "17(63)"
        ],
        [
            "20(68)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31.2(1.23)"
        ],
        [
            "23(0.9)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "28.1(1.11)"
        ],
        [
            "113.5(4.47)"
        ],
        [
            "141.4(5.57)"
        ],
        [
            "176.4(6.94)"
        ],
        [
            "236.6(9.31)"
        ],
        [
            "224.9(8.85)"
        ],
        [
            "247.7(9.75)"
        ],
        [
            "222.9(8.78)"
        ],
        [
            "178(7.0)"
        ],
        [
            "1,651.4(65)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "144"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "The climate of San Mateo falls under third type.",
            "This type of climate is characterized by no pronounced maximum rain period with a short dry season lasting from one to three months.",
            "Rainfall starts in July and continues through December with either October or November as the peak of the rainy season."
        ],
        [
            "As per data gathered from the ISU PAG-ASA PCARRD AGROMET Station, Echague, Isabela, the average monthly rainfall for 2011 was 238.20mm with the highest recorded at 558.20mm in September and at least in March with 32.6mm.",
            "The highest recorded temperature was its peak in May at 34.40C during the summer season and the lowest at 26.10C in January.",
            "However the average temperature for the same period was 30.70C."
        ],
        [
            "Land Classification and Uses"
        ],
        [
            "The soil type of San Mateo is 49.89% Santa Rita Clay Loam which is suited for lowland crops like rice, tobacco and mungo.",
            "Other soil types are Bago Series (26.04%), San Manuel Series (9.87%), Peñaranda (2.31%), Agustin Series (7.95%) and River Wash Gravel (3.95%)."
        ],
        [
            "The existing land uses of the municipality are as follows:"
        ],
        [
            "The long and mighty Magat River, the biggest tributary of the Cagayan River lies in the vast plains devoted to agriculture in the area."
        ],
        [
            "The Tao-Tao River and the four (4) creeks found in the municipality named Porvida, Gaddanan, Macañao and Balaobao are likewise tapped to supply water to elevated portions of agricultural lands through the use of water pumps."
        ],
        [
            "Topography"
        ],
        [
            "The terrain of the municipality is basically plain with 98% of the total land area under 0-2 percent slope category and only 2% of the total area is under the 2.3-5 percent slope category.",
            "The excellent topography of the municipality has made irrigation by gravity method applicable in flooding of rice paddies."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San MateoYearPop.±% p.a.1948 13,622—    1960 24,402+4.98%1970 29,604+1.95%1975 34,546+3.14%1980 41,152+3.56%1990 48,461+1.65%1995 48,861+0.15%2000 55,068+2.60%2007 57,885+0.69%2010 60,792+1.80%2015 64,505+1.14%2020 66,663+0.65%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Mateo, Isabela, was 66,663 people, with a density of 550 inhabitants per square kilometre or 1,400 inhabitants per square mile."
        ],
        [
            "Language"
        ],
        [
            "The population is a combination of different ethnic group dominated by Ilocano speaking people which make Ilocano the common language used in the municipality."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Mateo"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  14.30"
        ],
        [
            "2009  14.63"
        ],
        [
            "2012  12.72"
        ],
        [
            "2015  9.94"
        ],
        [
            "2018  10.66"
        ],
        [
            "2021  11.57"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2020 Cities and Municipalities Competitiveness Index conducted by the National Competitiveness Council, San Mateo took the 141st spot among the first class and second class municipalities in the Philippines."
        ],
        [
            "2015 44th"
        ],
        [
            "2016 99th"
        ],
        [
            "2017 123rd"
        ],
        [
            "2018 92nd"
        ],
        [
            "2019 72nd"
        ],
        [
            "2020 141st"
        ],
        [
            "2021 292nd"
        ],
        [
            "2022 242nd"
        ],
        [
            "2023 160th"
        ],
        [
            "Culture"
        ],
        [
            "March 17 - Town Fiesta"
        ],
        [
            "1st week of May - Munggo Festival"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipality of San Mateo is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected Officials"
        ],
        [
            "Members of the San Mateo Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative"
        ],
        [
            "Ian Paul L. Dy"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Gregorio A. Pua"
        ],
        [
            "Municipal Vice-Mayor"
        ],
        [
            "Arvin M. Barangan"
        ],
        [
            "Municipal Councilors"
        ],
        [
            "Atty.",
            "Louella Marie R. Agcaoili,CPA"
        ],
        [
            "Michael Angelo V. Ramones (Deceased)"
        ],
        [
            "Agosto Gamboa"
        ],
        [
            "Sherwyn Cadeliña"
        ],
        [
            "Lailo Palomares"
        ],
        [
            "Jonabel T. Paranas"
        ],
        [
            "Atty.",
            "Eric P. Subia"
        ],
        [
            "Santos Villamar"
        ],
        [
            "Punong Barangay"
        ],
        [
            "Members of the Liga ng mga Barangay(2022–2025)"
        ],
        [
            "Barangay"
        ],
        [
            "Name"
        ],
        [
            "Bacarreña"
        ],
        [
            "Ronaldo P. Cabacungan, Sr."
        ],
        [
            "Bagong Sikat"
        ],
        [
            "Bagong Kapitan"
        ],
        [
            "Barangay 1"
        ],
        [
            "Aristotle Visaya"
        ],
        [
            "Barangay 2"
        ],
        [
            "Arnelyn Daynos"
        ],
        [
            "Barangay 3"
        ],
        [
            "CMCM"
        ],
        [
            "Barangay 4"
        ],
        [
            "Dating first Kagawad"
        ],
        [
            "Congress representation"
        ],
        [
            "San Mateo, belonging to the third legislative district of the province of Isabela, currently represented by Hon.",
            "Ian Paul L. Dy."
        ],
        [
            "List of mayors"
        ],
        [
            "MAYORS OF SAN MATEO, ISABELA"
        ],
        [
            "1942 Doroteo Barbero"
        ],
        [
            "1943 Estanislao Bueno"
        ],
        [
            "1946 Don Mateo Cadeliña"
        ],
        [
            "1946 - 1951 Cornelio Alipio"
        ],
        [
            "1951 - 1955 Don Mateo Cadeliña"
        ],
        [
            "1955 - 1960 Marcelo Santiago"
        ],
        [
            "1960 - 1962 Hermogenes Ramil"
        ],
        [
            "1962 - 1963 Braulio Lucas"
        ],
        [
            "1963 - 1986 Severo Lachica"
        ],
        [
            "1986 - 1998 Dr. Venancio Villarta"
        ],
        [
            "1998 - 2001 Feliciano Palomares"
        ],
        [
            "2001 - 2010 Roberto Agcaoili"
        ],
        [
            "2010 - 2019 Dra.",
            "Crispina Agcaoili"
        ],
        [
            "Healthcare"
        ],
        [
            "BBCSS Pediatric Medical And Surgical Clinic"
        ],
        [
            "Bumagat Maternity and Medical Clinic"
        ],
        [
            "Juvelo Family Clinic"
        ],
        [
            "New Samaritan Medical And Pediatric Clinic"
        ],
        [
            "Piedad Medical Clinic"
        ],
        [
            "Ricafort's Medical and Surgical Clinic"
        ],
        [
            "San Mateo Integrated Community Hospital"
        ],
        [
            "San Mateo Kidney Care and Dialysis Center"
        ],
        [
            "San Mateo Multicare Hospital"
        ],
        [
            "San Mateo Rural Health Unit"
        ],
        [
            "Sevilleja Medical Clinic"
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Colleges and Universities"
        ],
        [
            "Isabela State University (San Mateo Campus)"
        ],
        [
            "Cagayan Valley Automotive and Technical School Inc."
        ],
        [
            "High school"
        ],
        [
            "Eveland Christian College"
        ],
        [
            "La Salette Of San Mateo, Inc."
        ],
        [
            "Salinungan National High School"
        ],
        [
            "Salinungan Stand Alone Senior High School"
        ],
        [
            "San Mateo General Comprehensive High School"
        ],
        [
            "San Mateo National High School"
        ],
        [
            "San Mateo Vocational Industrial High School"
        ],
        [
            "Elementary"
        ],
        [
            "Bagong Sikat Elementary School"
        ],
        [
            "Bacarreña Adventis Elementary School"
        ],
        [
            "Dagupan Elementary School"
        ],
        [
            "Daramuangan Norte Elementary School"
        ],
        [
            "Daramuangan Sur Elementary School"
        ],
        [
            "Diamond Christian School"
        ],
        [
            "Estrella-Bella Luz Elementary School"
        ],
        [
            "Estrella Elemenatry School"
        ],
        [
            "Eveland Christian College"
        ],
        [
            "Gaddanan Elementary School"
        ],
        [
            "Grace Christian School"
        ],
        [
            "La Salette of San Mateo, Inc."
        ],
        [
            "Malasin Elementary School"
        ],
        [
            "Mapuroc Elementary School"
        ],
        [
            "Marasat Pequeño Elementary School"
        ],
        [
            "Mary Shine of Saint Matthew"
        ],
        [
            "Salinungan East Elementary School"
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "San Ignacio Elementary School"
        ],
        [
            "San Manuel Elementary School"
        ],
        [
            "San Marcos Elementary School"
        ],
        [
            "San Mateo East Central School"
        ],
        [
            "San Mateo North Central School"
        ],
        [
            "San Mateo West Central School"
        ],
        [
            "San Roque Elementary School"
        ],
        [
            "Sinamar Norte Elementary School"
        ],
        [
            "Sinamar Sur Dumag Elementary School"
        ],
        [
            "The Rainbow Learning Center"
        ],
        [
            "Victoria Elementary School"
        ],
        [
            "Villa Cruz Elementary School"
        ],
        [
            "Villa Fuerte Elementary School"
        ],
        [
            "Villa Gamiao Elementary School"
        ],
        [
            "Villa Magat Elementary School"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Mateo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"More than 'munggo': Isabela's San Mateo is an Agro-ecological City in the making\".",
            "BusinessMirror.",
            "Retrieved August 15, 2013."
        ],
        [
            "^ a b c \"San Mateo Executrive Summary 2020\" (PDF).",
            "Commission on Audit - coa.gov.ph.",
            "Retrieved June 25, 2024."
        ],
        [
            "^ \"Area of Coverage\".",
            "ATI in Cagayan Valley.",
            "Retrieved December 23, 2021."
        ],
        [
            "^"
        ],
        [
            "\"Province: Isabela\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Mateo, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved October 31, 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"San Mateo, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"San Mateo, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved May 15, 2022."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Official website"
        ],
        [
            "San Mateo at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Places adjacent to San Mateo, Isabela"
        ],
        [
            "Aurora"
        ],
        [
            "Cabatuan"
        ],
        [
            "Alfonso Lista, Ifugao"
        ],
        [
            "San Mateo"
        ],
        [
            "Cauayan"
        ],
        [
            "Ramon"
        ],
        [
            "Alicia"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Mateo,_Isabela&oldid=1230812802\""
        ],
        [
            "Categories: Municipalities of Isabela (province)Political divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Pages using infobox settlement with possible nickname listCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}