{
    "name": "San Isidro",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Isidro, Northern Samar"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°23′17″N 124°19′52″E﻿ / ﻿12.388°N 124.331°E﻿ / 12.388; 124.331"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Northern Samar, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"San Isidro, Northern Samar\" – news · newspapers · books · scholar · JSTOR (April 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesSan IsidroMunicipalityMunicipality of San Isidro"
        ],
        [
            "FlagMap of Northern Samar with San Isidro highlightedOpenStreetMapSan IsidroLocation within the PhilippinesCoordinates: 12°23′17″N 124°19′52″E﻿ / ﻿12.388°N 124.331°E﻿ / 12.388; 124.331CountryPhilippinesRegionEastern VisayasProvinceNorthern SamarDistrict"
        ],
        [
            "1st districtFounded1954Barangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorFerdinand C. Avila • Vice MayorConrado G. Avila Sr. • RepresentativePaul R. Daza • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Joel C. Sampayan• Zaldy F. Amor• Leila P. Beltran• Natividad A. Francisco• Mervin M. Mondigo• Marlon D. Amor• Norejan S. Elaco• John Carlos D. PalopDILG Masterlist of Officials"
        ],
        [
            " • Electorate21,687 voters (2022)Area • Revenue₱ 165.7 million (2020) • Assets₱ 501.2 million (2020) • Expenditure₱ 147 million (2020) • Liabilities₱ 164.7 million (2020)Service provider • ElectricityNorthern Samar Electric Cooperative (NORSAMELCO)Time zoneUTC+8 (PST)ZIP code6409PSGC084818000IDD : area code +63 (0)55Native languagesWaray Tagalog"
        ],
        [
            "San Isidro, officially the Municipality of San Isidro (Waray: Bungto han San Isidro; Tagalog: Bayan ng San Isidro), is a 4th class municipality in the province of Northern Samar, Philippines.",
            "According to the 2020 census, it has a population of 27,867 people."
        ],
        [
            "The town borders with Victoria to the north."
        ],
        [
            "History"
        ],
        [
            "San Isidro was originally part of the Municipality of Allen, Northern Samar.",
            "Its history dates back during the era of Spanish colonization, when Filipino natives were always on the run-traveling in search of an inhabited and remote place to hide and escape slavery and maltreatments of Spanish governments.",
            "The first human beings that have landed on Calagundian shores around the last quarter of the 19th century were some intrepid Bicolanos, Boholanos, Leyteños and Cebuanos pioneers.",
            "They came to the place by prodigious voyages using only the primitive boat called “velus”."
        ],
        [
            "Later, during this period, other groups of immigrants were lured from the nearby island provinces and Bicol regions to the coastal plains of Calagundian.",
            "These families formed the nucleus of Barrio Calagundian, a part of La Granja town (now Allen).",
            "These people were basically engaged in fishing and farming as their only main sources of livelihood.",
            "Having progressed as the years passed by, more people coming from the islands of san Antonio, Capul, San Vicente, Almagro, Tagapul-an and even as far as Masbate and other far away places inhabited to Calagundian to seek for a more greener pastures.",
            "As a barrio, the Calagundianons, though they came from different places with different views and ideas, customs and traditions, were able to establish among themselves a happy and harmonious community, and they even considered themselves a one family community.",
            "These were the uniqueness of the people of Calagundian - determined, united and organized in their pursuit of becoming a cohesive political unit."
        ],
        [
            "Finally, after years of political struggle for independence from its mother town; Allen, the municipality of San Isidro became one of the twenty-four municipalities now comprised by Province of Northern Samar upon enactment of Republic Act Numbered Eleven Eighty Seven (R.A. 1187) on June 20, 1954.",
            "The Poblacion, the seat of the Municipal Government, was formerly called Barrio Calagundian.",
            "The change of name came with the creation of the Municipality.",
            "The original barrios comprised by the Municipality per Republic Act No.1187 were seven, namely, Calagundian, Erenas, Caaguit-itan, Palanit, San Juan, Veriato and San Roman.",
            "These barrios were separated from the Municipality of Allen and became the nucleus of the new Municipality."
        ],
        [
            "Almost five years later, on May 16, 1959, Republic Act No.",
            "2214 was passed creating seven additional barrios for San Isidro.",
            "These were San Roque, Sabelia, Happy Valley, Acedillo, Alegria, Salvacion and Mabuhay.",
            "However, with the creation of the Municipality of Victoria on April 27, 1968, the barrios of Erenas, Acedillo and San Roman were separated from San Isidro and formed part of Victoria.",
            "Meanwhile, on January 21, 1972, the Municipal Council approved Resolution No.",
            "02 creating Barangay Eladio T. Balite, separating the same from Barangay Alegria.",
            "Later on, the Poblacion was divided in two, thereby creating Barangay Poblacion Norte and Barangay Poblacion Sur.",
            "As of this time, San Isidro has fourteen Barangays.",
            "Yearning a separate parish from that of Allen, Northern Samar, a church decree dated October 31, 1959 made it realized."
        ],
        [
            "Thus, the newly created parish had been given a juridical name as Parish of the Most Sacred Heart of Jesus.",
            "Its Patron Saint is Señor San Isidro de Labrador whose feast is religiously celebrated every 15th day of May.",
            "San Isidro is now 48 years old in its tranquil state as municipality and 40 years as parish with the collective efforts of the seven Municipal Mayors from the start and more than thirty Roman Catholic Priests from both Franciscan and Diocesan Order who extended moral and spiritual support to maintain the laying foundations which embraced the venerability of San Isidro."
        ],
        [
            "Geography"
        ],
        [
            "San Isidro is a coastal a town in the south-western part of the Province of Northern Samar facing the Samar Sea.",
            "It is about 64 kilometres (40 mi) from the capital town of Catarman and approximately 54 kilometres (34 mi) north-west of Calbayog.",
            "Its boundaries are defined by the Municipality of Victoria in the north and north-east, by the City of Calbayog in the south and southeast, the Municipality of Bobon in the east, and by Dalupiri Pass and Samar Sea in the west."
        ],
        [
            "San Isidro has a total land area of 25,590 hectares (63,200 acres), of which 9088 is commercial forest, 418 is non-commercial forest, 10754 is logged cover area and rest are classified into reproduction brush land, cogon open land, mosey forest, cultivation, plantation and marsh swamp land."
        ],
        [
            "The topography of the land is characterized from plains to rolling hills and steep mountain ranges.",
            "The lowlands are along the coast but in a few sections of this area, the mountains rise from 30 meters to 61 meters high above sea level.",
            "The highest elevation is Mount Soomong, which is 522 meters above sea level.",
            "The hinterlands are criss-crossed by logging roads and most of the plateaus are already developed agricultural lands."
        ],
        [
            "Its rivers and creeks intersperse throughout the length and breadth of the municipality.",
            "It has ten (10) small unnavigable rivers.",
            "Majestic Mawo River traverses the eastern portion of the hinterlands finding its way at the town of Victoria before discharging into the Samar Sea.",
            "Among River has its outlet at Barangay Seven Hills, Caaguit-itan River at Barangays Alegria and Balite, San Juan River at Barangay San Juan, Palanit and Maludbalud Rivers at Barangay Palanit, Veriato River at Barangay Veriato and Caglanipao River at Barangay Caglanipao."
        ],
        [
            "The Municipality does not lie along any known fault zones/lines.",
            "As to its bedrock foundations, old sediments and pyroclastics which are more stable than poorly consolidated sediments (e.g.",
            "limestone, shale or alluvial deposits) in terms of compressive strength/load bearing capacity comprise roughly 67.50% of the total municipal land area.",
            "The remaining 32.50% is composed of metamorphosed rocks, volcanic and highly crystallized rocks which are situated in areas of highest relief."
        ],
        [
            "Mineral production consists mainly of non-metallic such as sand, gravel, earth and rocks.",
            "Enormous quantities of these materials were used for the construction of the Philippine-Japan Friendship Highway (Daang Maharlika)."
        ],
        [
            "Approximately 10.35% of the total municipal land area is within the 0.15% slope limits.",
            "The remaining 89.65% belong to 15% and over.",
            "The low level ground classified as “A” comprised a meager 3.06% of the total land area and is located at the eastern and western sections of the municipality.",
            "Classes “B”, “C”, and “D” comprised 1.63%, 3.74% and 1.92%, respectively.",
            "The bulk of the land comprising 27.67% ranges from steeply undulating and rolling lands sloping in many directions and 61.98% classified as very steeply sloping lands."
        ],
        [
            "Approximately, its land uses were distributed as follows:"
        ],
        [
            "Residential Areas - 1,214,903.00 square meters"
        ],
        [
            "Religious Areas - 17,143.00 square meters"
        ],
        [
            "Educational Areas - 365,672.37 square meters"
        ],
        [
            "Government Lot - 13,537.97 square meters"
        ],
        [
            "Commercial Lot - 682,209.66 square meters"
        ],
        [
            "Industrial Lot - 5,610.00 square meters"
        ],
        [
            "Agricultural Lands - 131,870,225.60 square meters"
        ],
        [
            "Roads - 16,845.00 meters"
        ],
        [
            "Timberlands/Open Spaces - 21,042.00 km2."
        ],
        [
            "Barangays"
        ],
        [
            "San Isidro is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alegria"
        ],
        [
            "Balite"
        ],
        [
            "Buenavista"
        ],
        [
            "Caglanipao"
        ],
        [
            "Happy Valley"
        ],
        [
            "Mabuhay"
        ],
        [
            "Palanit"
        ],
        [
            "Poblacion Norte"
        ],
        [
            "Poblacion Sur"
        ],
        [
            "Salvacion"
        ],
        [
            "San Juan"
        ],
        [
            "San Roque"
        ],
        [
            "Seven Hills"
        ],
        [
            "Veriato"
        ],
        [
            "Twelve (12) of the fourteen barangays of San Isidro are coastal barangays and two (2) are hinterland barangays.",
            "The coastal barangays, starting from the south are Caglanipao, Veriato, Mabuhay, Palanit, San Juan, Salvacion, Alegria, Balite, Buenavista, Poblacion Sur, Poblacion Norte, and San Roque while the interior barangays are Seven Hills and Happy Valley."
        ],
        [
            "The Poblacions faces the Samar Sea and comprises the town proper."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Isidro, Northern Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "84(3.3)"
        ],
        [
            "59(2.3)"
        ],
        [
            "58(2.3)"
        ],
        [
            "55(2.2)"
        ],
        [
            "93(3.7)"
        ],
        [
            "133(5.2)"
        ],
        [
            "149(5.9)"
        ],
        [
            "125(4.9)"
        ],
        [
            "155(6.1)"
        ],
        [
            "165(6.5)"
        ],
        [
            "140(5.5)"
        ],
        [
            "136(5.4)"
        ],
        [
            "1,352(53.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.1"
        ],
        [
            "13.6"
        ],
        [
            "15.8"
        ],
        [
            "16.1"
        ],
        [
            "21.7"
        ],
        [
            "25.5"
        ],
        [
            "26.6"
        ],
        [
            "25.1"
        ],
        [
            "24.8"
        ],
        [
            "25.8"
        ],
        [
            "22.7"
        ],
        [
            "20.1"
        ],
        [
            "255.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "The Municipality has no distinct dry and wet seasons.",
            "The number of rainy days ranges from 12 in April and May to 26 in November or an average of 16.6 rainy days a month.",
            "On the other hand, the longest sunshine is in May, 8, 7 days and the shortest is in January, 4, 9 days, an average of 6.8 days a month."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San IsidroYearPop.±% p.a.1960 9,453—    1970 12,697+2.99%1975 15,182+3.65%1980 15,994+1.05%1990 18,353+1.39%1995 22,991+4.31%2000 22,847−0.13%2007 23,573+0.43%2010 24,952+2.09%2015 26,650+1.26%2020 27,867+0.88%Source: Philippine Statistics Authority"
        ],
        [
            "Population size"
        ],
        [
            "Per official NSO Census of Population report, the total population of the municipality, as of May 2000 is 22,847 persons.",
            "This implies a decrease of 144 persons or about 0.63% over the 1995 census count of 22,991.",
            "This population of the municipality comprises more than 4.56% of the province’ total population."
        ],
        [
            "Average growth rate"
        ],
        [
            "The 1970 Census of Population indicated a growth rate of 2.99% for the past ten years.",
            "This was followed by an accelerating rate of 3.64% from 1970 to 1975.",
            "However, during the intercensal periods of 1975 to 1980 and 1980 to 1990, respectively, growth rate markedly dropped to 1.05% and 1.38%, respectively.",
            "During the intercensal period of 1990–1995, the population of the municipality grew at a very high rate of 4.61% annually.",
            "This is 3.23 percentage points higher than the average growth rate between 1980 and 1990.",
            "However, from 1995 to 2000, municipal population markedly dropped registering a growth rate of -0.13.",
            "The first major decline in the census growth rate occurred between 1975 and 1980."
        ],
        [
            "Sex composition"
        ],
        [
            "The male population of the municipality numbered 11,875, as of September 1, 1995, or 759 persons more than female population of 11,116.",
            "However, there was a change in the sex ratio from 1990 to 1995.",
            "The 1995 census indicated a sex ratio of 107 males per 100 females.",
            "In the 1990 census, this was 108."
        ],
        [
            "Density"
        ],
        [
            "Vis-à-vis the municipality's total population of 255.9 square kilometers and total population of 22,847 persons as of May 1, 2000, the municipality gives a population density of 89 persons per square kilometer."
        ],
        [
            "Mortality rate"
        ],
        [
            "Record of the Municipal Health Office shows that as of 1995, total number of deaths rated to 6.8% or a total of 157 persons."
        ],
        [
            "Number of households"
        ],
        [
            "The total number of households in the municipality during the 2000 Census of the Philippine Statistics Authority accounted to 4,184.",
            "Meanwhile, in the 1995 Census, the municipality registered 4,202 households, registering an increase of 611 households (17% increase) over the 1990 census figure of 3,591 households."
        ],
        [
            "Size of households"
        ],
        [
            "The average household size from 1995 to 2000 registered to 5.5 (or 6) persons, which is higher than in 1990 (5.1 persons).",
            "This means that for every 100 households, the reported number of members increased by 40 persons."
        ],
        [
            "Birth rate"
        ],
        [
            "Based on the Municipal Health record, total number of birth as of 1995 registered to 526 or a rate of 2.29%."
        ],
        [
            "Language"
        ],
        [
            "With reference to the records of the Philippine Statistics Authority, majority of the household population of the municipality spoke Waray language (50.59%) mostly during their early childhood.",
            "The remaining 49.41% spoke Cebuano (46.32%), Abaknon (1.43%), and other dialects (1.66%."
        ],
        [
            "Religion"
        ],
        [
            "Religious Affiliation.",
            "Of the total 118,352 household population I 1990, Roman Catholics numbered 5,667.",
            "It comprised a large percentage, or about 85.37%.",
            "United Church of Christ in the Philippines followed with a total o,477 or 8.07%.",
            "The Iglesia ni Cristo registered third with 582 followers or about 3.17% Seventh Day Adventist ranked fourth with 230 or 11.25%.",
            "The remaining 2.16% were affiliated to Jehovah's Witnesses (0.62%), Born Again Christians (0.57%) and other religious sects (0.97%)."
        ],
        [
            "Religious Organizations.",
            "There are quite a number of religious organizations that are active in the locality both from the Roman Catholics and other religious sects.",
            "Among them are the Knight of Columbus, the Parish Pastoral Council, the Couple's for Christ, Women's for Christ, the Franciscan Youth (YOUFRA) and many others."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Isidro"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  35.00"
        ],
        [
            "2009  43.62"
        ],
        [
            "2012  40.91"
        ],
        [
            "2015  37.98"
        ],
        [
            "2018  32.55"
        ],
        [
            "2021  33.11"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Labor force"
        ],
        [
            "Among the 10,911 persons, 15 years old and over, only 5,989 persons or about 54.89% were economically active or in the labor force, which was 1,067 persons higher than those who were not in the labor force (4,922).",
            "The majority (40.57%) of the household population 15 years old and over who were in the labor force were males.",
            "While a largest percentage (34.63%) of those who were not in the labor force were females."
        ],
        [
            "Of the 5,989 economically active populace (in the labor force), 5,400 (49.49%) were employed registering 4,811 higher than the unemployed (589 persons or 5.4%).",
            "The proportion of employed populace in the labor force was higher among males (38.58%) than among females (10.91%).",
            "On the other hand, the proportion of those who were unemployed was higher for females (3.41%) than males."
        ],
        [
            "Transportation"
        ],
        [
            "The municipality is located along the Daang Maharlika Highway and is a jumping board between the island towns of San Antonio and San Vicente, the City of Calbayog, and the capital town of Catarman.",
            "Because of its ferry terminal, located at Barangay Salvacion, it also becomes the gateway to Luzon."
        ],
        [
            "The twelve coastal barangays can be reached by both land and sea transportation.",
            "The Daang Maharlika passes through all these barangays.",
            "While Seven Hills and Happy Valley can be reached by a barangay road passing through the barangays of Balite.",
            "Barangay Happy Valley, the most interior barangay in the whole municipality is connected with Barangay Dawo, Oquendo District, Calbayog, passing through the hinterlands."
        ],
        [
            "Healthcare"
        ],
        [
            "Health Facilities and Number of Health Personnel:"
        ],
        [
            "Rural Health Unit - 1"
        ],
        [
            "Barangay Health Centers - 6"
        ],
        [
            "Private Medical Clinic - 1"
        ],
        [
            "Private Dental Clinic - 1"
        ],
        [
            "Number of Midwives - 10"
        ],
        [
            "Number of Barangay Health Workers - 104"
        ],
        [
            "Public Health Nurse - 1"
        ],
        [
            "Education"
        ],
        [
            "Literacy Rate: Census results of 1990 show that of the 13,217 household population 10 years old and over, 85.4 percent were literate, while only 14.6% or 1,929 illiterate.",
            "The proportion who were literate was slightly higher among males, registering a figure of 6,833 or 51.62% than females which accounted to 6,394 or 48.38%.",
            "Comparatively therefore, the literate rural population numbered 7,376 or 1,535 literates more than the urban population of 5,841."
        ],
        [
            "Highest Grade Completed: The largest percentage (60.81%) of the 14,610 population 7 years old and over attended or completed elementary education only.",
            "Meanwhile, the proportion who reached or completed high school posted a percentage of 22.03% or 3,219 persons.",
            "The proportion, on the other hand, that was academic degree holders accounted to 328 or 2.25% of the total household population 7 years old and over."
        ],
        [
            "Elementary schools"
        ],
        [
            "Presently, there are 13 elementary schools found in the Poblacion and in the different barangays throughout the municipality.",
            "These schools are composed of primary and intermediate grade levels."
        ],
        [
            "Secondary schools"
        ],
        [
            "There are five secondary schools in the municipality.",
            "Three three are national high schools - one in Barangay Alegria, Barangay Veriato and the other one in the Poblacion.",
            "The third is the San Isidro Agro-Industrial School located in Barangay San Roque and has also extension classes at Barangay Salvacion and lastly the private school of Tan Ting Bing Memorial Colleges, Inc."
        ],
        [
            "Vocational schools"
        ],
        [
            "To cater the educational demands of the high school graduates of these secondary schools in the locality, a two-year post secondary courses were once offered at San Isidro Agro-Industrial School, through TESDA in the school year 1998 to 2001.",
            "However, due to the residents' clamor - particularly the parents and the students for a four-year course, bachelor's degree on BS in Agriculture Education was subsequently offered at the same school through the extension program of the University of Eastern Philippines in June 2001.",
            "To date the said course offering is still on-going and obviously, benefited quite a number of students in the area.",
            "Private school, Tan Ting Bing Memorial Colleges, Inc. is also offering various of short courses and bachelor's degree courses."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Isidro |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"San Isidro, Northern Samar : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 6 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Northern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "elgu.ncc.gov.ph"
        ],
        [
            "Places adjacent to San Isidro, Northern Samar"
        ],
        [
            "San Antonio / Dalupiri Pass"
        ],
        [
            "Victoria"
        ],
        [
            "San Isidro"
        ],
        [
            "Victoria"
        ],
        [
            "Samar Sea"
        ],
        [
            "Calbayog, Samar"
        ],
        [
            "vte Province of Northern SamarCatarman (capital and largest municipality)Municipalities"
        ],
        [
            "Allen"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Capul"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Gamay"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lope de Vega"
        ],
        [
            "Mapanas"
        ],
        [
            "Mondragon"
        ],
        [
            "Palapag"
        ],
        [
            "Pambujan"
        ],
        [
            "Rosario"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Victoria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Isidro,_Northern_Samar&oldid=1209426525\""
        ],
        [
            "Category: Municipalities of Northern SamarHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}