{
    "name": "San Antonio",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Antonio, Zambales"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°56′55″N 120°05′11″E﻿ / ﻿14.94861°N 120.08639°E﻿ / 14.94861; 120.08639"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Zambales, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"San Antonio, Zambales\" – news · newspapers · books · scholar · JSTOR (March 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesSan AntonioMunicipalityMunicipality of San AntonioMunicipal Plaza with Redondo Mountains in the background"
        ],
        [
            "SealMap of Zambales with San Antonio highlightedOpenStreetMapSan AntonioLocation within the PhilippinesCoordinates: 14°56′55″N 120°05′11″E﻿ / ﻿14.94861°N 120.08639°E﻿ / 14.94861; 120.08639CountryPhilippinesRegionCentral LuzonProvinceZambalesDistrict"
        ],
        [
            "2nd districtFounded1849Named forSt.",
            "Anthony of PaduaBarangays14"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEdzel L. Lonzanida, MD • Vice MayorAtty.",
            "Joseph Jonathan A. Bactad • RepresentativeDoris \"Nanay Bing\" Maniquiz • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Juanito P. DimaculanganJoseph Jonathan A. BactadArvin Rolly D. AntipoloImelda B. ArateaJovy A. ArlanticoIrwin E. MataNilfredo Q. FabrosElizabeth F. Ablog"
        ],
        [
            " • Electorate23,126 voters (2022)Area • Revenue₱ 189.4 million (2020) • Assets₱ 617.8 million (2020) • Expenditure₱ 184.8 million (2020) • Liabilities₱ 216.2 million (2020)Service provider • ElectricityZambales 2 Electric Cooperative (ZAMECO 2)Time zoneUTC+8 (PST)ZIP code2206PSGC0307109000IDD : area code +63 (0)47Native languagesIlocano Tagalog Sambal"
        ],
        [
            "San Antonio, officially the Municipality of San Antonio (Ilocano: Ili ti San Antonio; Tagalog: Bayan ng San Antonio; Sambal: Babali nin San Antonio), is a 2nd class municipality in the province of Zambales, Philippines.",
            "According to the 2020 census, it has a population of 37,450 people."
        ],
        [
            "San Antonio is 48 kilometres (30 mi) from Iba and 167 kilometres (104 mi) from Manila."
        ],
        [
            "History"
        ],
        [
            "PHC historical marker installed in 1950 at the central elementary school"
        ],
        [
            "San Antonio was a hunting region where indigenous hunters from the northern towns of Zambales would hunt, and gather.",
            "The first settlers from the Paoay area in Ilocos Norte arrived in 1830, and founded the first Spanish settlement that developed into what is now San Antonio."
        ],
        [
            "San Antonio was given the status of district or barrio in 1836.",
            "The town mayor in that period was Don Gregorio Banaga.",
            "He governed the town from 1836 to 1849.",
            "He was succeeded by Don Vicente Lacuesta in 1849, from Teniente Primero to Teniente Absoluto.",
            "The last mayor was Don Santiago Ladrillono.",
            "He was succeeded by Don Dimas Pascasio as governor in 1856.",
            "They selected their leaders every year.",
            "In 1891 to 1898, Don Pablo Corpus was the only Capitan Municipal selected then appointed Don Felix Magsaysay as the first President municipal, and many more followed up to 1931 to 1945."
        ],
        [
            "The town was the site of the United States Navy Base known as the U.S.",
            "Naval Communications Station San Miguel.",
            "After the earthquake and eruption of Mount Pinatubo in 1991, the United States Military decided to abandon its military bases in the Philippines."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "San Antonio is politically subdivided into 14 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Angeles"
        ],
        [
            "Antipolo"
        ],
        [
            "Burgos (Poblacion)"
        ],
        [
            "East Dirita"
        ],
        [
            "Luna (Poblacion)"
        ],
        [
            "Pundaquit"
        ],
        [
            "Rizal (Poblacion) (Sentro Pueblo)"
        ],
        [
            "San Esteban"
        ],
        [
            "San Gregorio (Poblacion)"
        ],
        [
            "San Juan (Poblacion) (Sitio Mabanban)"
        ],
        [
            "San Miguel"
        ],
        [
            "San Nicolas (Poblacion)"
        ],
        [
            "Santiago (Poblacion) (Pamatawan)"
        ],
        [
            "West Dirita"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Antonio, Zambales"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "8(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "15(0.6)"
        ],
        [
            "34(1.3)"
        ],
        [
            "138(5.4)"
        ],
        [
            "203(8.0)"
        ],
        [
            "242(9.5)"
        ],
        [
            "233(9.2)"
        ],
        [
            "201(7.9)"
        ],
        [
            "126(5.0)"
        ],
        [
            "50(2.0)"
        ],
        [
            "21(0.8)"
        ],
        [
            "1,280(50.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.7"
        ],
        [
            "4.1"
        ],
        [
            "6.5"
        ],
        [
            "11.2"
        ],
        [
            "21.2"
        ],
        [
            "24.9"
        ],
        [
            "27.7"
        ],
        [
            "26.5"
        ],
        [
            "25.5"
        ],
        [
            "21.8"
        ],
        [
            "12.6"
        ],
        [
            "5.6"
        ],
        [
            "191.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San AntonioYearPop.±% p.a.1903 4,524—    1918 6,045+1.95%1939 6,637+0.45%1948 8,381+2.63%1960 11,596+2.74%1970 18,048+4.52%1975 21,099+3.18%1980 22,382+1.19%1990 26,944+1.87%1995 25,765−0.83%2000 28,248+1.99%2007 32,494+1.95%2010 34,217+1.90%2015 34,661+0.25%2020 37,450+1.53%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Antonio, Zambales, was 37,450 people, with a density of 200 inhabitants per square kilometre or 520 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Antonio"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  11.40"
        ],
        [
            "2009  11.99"
        ],
        [
            "2012  11.20"
        ],
        [
            "2015  15.92"
        ],
        [
            "2018  7.29"
        ],
        [
            "2021  20.73"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "This section, specifically the area about Anawangin Cove,  contains close paraphrasing of an external source, https://web.archive.org/web/20090330081915/http://www.waypoints.ph/detail_gen.php?wpt=anwngn  (Copyvios report).",
            "Relevant discussion may be found on the talk page.",
            "Please help Wikipedia by rewriting this section, specifically the area about Anawangin Cove,  with your own words.",
            "(April 2024) (Learn how and when to remove this message)"
        ],
        [
            "San Antonio is increasingly known for its beaches, mountains and coves, and is a destination for campers and beach goers."
        ],
        [
            "Anawangin Cove"
        ],
        [
            "Capones Island"
        ],
        [
            "Casa San Miguel: Founded by violinist Coke Bolipata, the community center provides its members the time and space for developing their interest and talent in classical music."
        ],
        [
            "Tiklados Applied Music Center (Tiklados): Located at Barangay Antipolo, it was founded by Dr. Ceferino Cariaso III in 2002, to tutor young pianists and guitarists.",
            "The center caters to the following instruments: piano, violin, guitar, organ, flute, and voice.",
            "Solfege and music theory are also offered in the center.",
            "At present, Tiklados has three piano rooms, one violin/voice room, a spacious faculty and staff lounge, and a 60-seater concert hall."
        ],
        [
            "Pundaquit: Nestled in the navel of the Zambales coastline, a Spanish Light House from the 1800s is found atop the \"Islas de Punta Capones.\"",
            "This is reminiscent of places such as \"Sierra Leone.\"",
            "Zambales is also home to the famous Crystal Beach surf in the town of San Narciso.",
            "This surf spot is known as a \"surfing paradise\" closest to Manila."
        ],
        [
            "Redondo Peninsula: A short mountainous peninsula extending about 15 kilometers (9 miles) to the south of Zambales on western Luzon in the Philippines.",
            "It separates Subic Bay and the coasts around the Subic Bay Metropolitan Area of Subic and Olongapo from the South China Sea.",
            "It is known for its secluded coves, beaches and pine-forested mountains."
        ],
        [
            "Anawangin Cove: It is a crescent shaped cove with a pristine white sand beach.",
            "What makes the place unique is the unusual riddle of tall pine-like trees flourishing round its vicinity.",
            "In fact they are not pine trees; they are agoho trees, a species endemic to the Philippines, some Southeast Asian countries and north-eastern parts of Australia."
        ],
        [
            "Nagsasa Cove"
        ],
        [
            "Talisayin Cove"
        ],
        [
            "Silangen Cove"
        ],
        [
            "Capones Island"
        ],
        [
            "Camara Island"
        ],
        [
            "Education"
        ],
        [
            "Military personnel paint and repair the West Dirita Elementary School in San Antonio during a community service project."
        ],
        [
            "Elementary"
        ],
        [
            "College of Hildegarde Von Bingen (C.H.V.B)"
        ],
        [
            "San Antonio Central Elementary School (S.A.C.E.S)"
        ],
        [
            "West Dirita Elementary School"
        ],
        [
            "Dirita Elementary School"
        ],
        [
            "San Esteban Elementary School"
        ],
        [
            "San Gregorio Elementary School (S.G.E.S)"
        ],
        [
            "San Juan Elementary School"
        ],
        [
            "San Nicolas Elementary School"
        ],
        [
            "San Miguel Elementary School"
        ],
        [
            "Pundakit Elementary School"
        ],
        [
            "Angel Manglicmot Memorial School (formerly Angeles Elementary School)"
        ],
        [
            "Teodoro R. Yangco Elementary School (T.R.Y.M.S)"
        ],
        [
            "Teodoro R. Yangco Catholic Educational Institute (T.R.Y.C.E.I)"
        ],
        [
            "Valiant Educational Institute"
        ],
        [
            "High School"
        ],
        [
            "Angel C. Manglicmot High School (A.C.M.H.S.)"
        ],
        [
            "Pundakit High School"
        ],
        [
            "Luzon Technical Institute, Inc (L.T.I)"
        ],
        [
            "Teodoro R. Yangco Catholic Educational Institute (T.R.Y.C.E.I)"
        ],
        [
            "San Miguel National High School"
        ],
        [
            "San Antonio National High School"
        ],
        [
            "Valiant Educational Institute"
        ],
        [
            "College of Hildegarde Von Bingen (C.H.V.B)"
        ],
        [
            "Montessori"
        ],
        [
            "Precious Child Montessori"
        ],
        [
            "Escuela Royal de Maria Montessori"
        ],
        [
            "St.Anthony Montessori of Zambales Inc."
        ],
        [
            "Sports"
        ],
        [
            "San Antonio, influenced by the presence of the United States Naval Communication Station in the late '50s, is the baseball and softball capital of Zambales.",
            "Mayor Zozimo Pascasio and the Holy Name Society adopted the program in the '60s and '70s.",
            "Their partnership produced players who became athletic scholars in various colleges and universities in Manila.",
            "In the early '80s, JJ Henry & Chuck Jones of FRA Branch 367 (US Navy retirees) living in San Antonio, further enhanced the enthusiasm for the sport through the Shipmates, a team of 10- to 12-year-old boys coming from the different barangays who competed in the PABA  (Philippine Amateur Baseball Association) Invitational.",
            "In 1985, the core of the team intact & playing for TR Yangco Educational Institute, the Shipmates coached by Butch Echiverre, won the baseball gold in the CLRAA (Central Luzon Regional Athletic Association), a first for Zambales.",
            "The San Antonio \"TNT\" Jaycees, most of whom are employees at the US Navy base, continued the program with their annual San Antonio Summer Baseball Cup successfully."
        ],
        [
            "After the eruption of Mt Pinatubo in 1991, due to the destruction of the playing fields and the withdrawal of the US bases, support for the baseball program dwindled.",
            "Eager to find an alternative sports activity, Butch Echiverre and some friends introduced darts to the community.",
            "From its humble beginnings at a place called \"Kubo,\" presently, the Zambales Darters Federation is considered as one of the best dart organizations in the country for having hosted several national competitions.",
            "Its \"no-school, no-play\" policy is now adopted nationwide and the NDFP (National Darts Federation of the Philippines) conferred the President's Award to the group during the Darterong Pinoy 2012."
        ],
        [
            "The community's love for baseball was rekindled in the late '90s after losing the provincial baseball crown to Botolan, Zambales.",
            "The SADTEA (San Antonio District Teachers & Employees Association) took the initiative of organizing an inter-school tournament.",
            "This time, a softball tournament for girls is included.",
            "Supported by some officials of the local government and equipment donated by San Antonians locally & abroad, San Antonio baseball/softball is better than it ever was.",
            "As a member of the Little League Asia Pacific Region, San Antonio has always reached the quarterfinals of the Philippine Series.",
            "Irwin Mata is the Little League President of San Antonio."
        ],
        [
            "Aside from fast becoming a surfing capital of Luzon, San Antonio has an 18-hole golf course at the Naval Education and Training Command of the Philippine Navy (formerly US Naval Communication Station)."
        ],
        [
            "Notable personalities"
        ],
        [
            "Monument to Teodoro Yangco in front of San Antonio municipal hall"
        ],
        [
            "Don Teodoro R. Yangco, noted philanthropist and business magnate, was born in San Antonio, Zambales on November 9, 1861.",
            "He obtained his Bachelor of Arts from the Ateneo de Manila University and studied law at the University of Santo Tomás.",
            "He pursued a commercial course at Ealing College in London from 1882 to 1886.",
            "He served as Resident Commissioner of the Philippine Islands from 1917 to 1920 in Washington D.C.",
            "In 1923, he represented the Philippine Chamber of Commerce at the first Pan-Pacific Commercial Conference held in Honolulu, where he ably defended Philippine Independence.",
            "He generously supported the local YMCA such that he came to be called the “Father of the YMCA in the Philippines.” He died on April 20, 1939, and was buried at the North Cemetery."
        ],
        [
            "Guillermo Pablo, Associate Justice of the Supreme Court of the Philippines from 1945 to 1955, was born on June 25, 1886, in San Antonio, Zambales.",
            "Prior to his appointment to the High Court, he was Justice of the Peace (1911) at Iba, Zambales; Acting Provincial Fiscal (1915) of Zambales, Member of the Philippine Legislature (1916–1922); CFI Auxiliary Judge (1924) at Cebu; and CFI Judge (1930) and CFI District Judge (1934)."
        ],
        [
            "In film"
        ],
        [
            "The Bea Alonzo and Sam Milby movie And I Love You So, was shot at Anawangin Cove in San Antonio, a 30-minute boat ride from Pundaquit."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Antonio |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"History of San Antonio\".",
            "Official Website of San Antonio, Province of Zambales."
        ],
        [
            "^"
        ],
        [
            "\"Province:\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Antonio: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ http://131.230.176.4/cgi-bin/dol/dol_terminal.pl?taxon_name=Casuarina_equisetifolia&rank=binomial"
        ],
        [
            "^ Casuarina equisetifolia"
        ],
        [
            "^ \"Anawangin Cove, Zambales\".",
            "waypoints.ph.",
            "Archived from the original on March 30, 2009.",
            "Retrieved March 25, 2009."
        ],
        [
            "^ \"National Darts Federation of the Philippines\".",
            "Archived from the original on 2012-10-28.",
            "Retrieved 2012-11-12."
        ],
        [
            "^ Tortuya, Lui (October 15, 2012).",
            "\"The First Tagadagat Surfing Competition at San Antonio, Zambales\".",
            "juice.ph.",
            "Archived from the original on November 2, 2012.",
            "Retrieved November 12, 2012."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Antonio, Zambales."
        ],
        [
            "San Antonio Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to San Antonio, Zambales"
        ],
        [
            "San Narciso"
        ],
        [
            "San Marcelino"
        ],
        [
            "South China Sea"
        ],
        [
            "San Antonio"
        ],
        [
            "CastillejosSubic"
        ],
        [
            "South China Sea"
        ],
        [
            "Articles Related to San Antonio, Zambales"
        ],
        [
            "vte Province of ZambalesIba (capital)  Olongapo (largest city)Municipalities"
        ],
        [
            "Botolan"
        ],
        [
            "Cabangan"
        ],
        [
            "Candelaria"
        ],
        [
            "Castillejos"
        ],
        [
            "Iba"
        ],
        [
            "Masinloc"
        ],
        [
            "Palauig"
        ],
        [
            "San Antonio"
        ],
        [
            "San Felipe"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Narciso"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Subic"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Olongapo (Administratively independent from the province but grouped under Zambales by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Zambales"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Antonio,_Zambales&oldid=1227661700\""
        ],
        [
            "Categories: Municipalities of ZambalesBeaches of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listAll articles with dead external linksArticles with dead external links from April 2024Articles with permanently dead external linksArticles with short descriptionShort description is different from WikidataArticles needing additional references from March 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textArticles needing cleanup from April 2024All pages needing cleanupArticles with close paraphrasing of public domain sources from April 2024All articles with close paraphrasingAll articles with unsourced statementsArticles with unsourced statements from October 2018All articles lacking reliable referencesArticles lacking reliable references from April 2024Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}