{
    "name": "San Juan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Juan, La Union"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSimple EnglishSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°40′N 120°20′E﻿ / ﻿16.67°N 120.33°E﻿ / 16.67; 120.33"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in La Union, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"San Juan, La Union\" – news · newspapers · books · scholar · JSTOR (March 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesSan JuanMunicipalityMunicipality of San JuanBeach in San Juan"
        ],
        [
            "FlagSealNickname: Surfing Capital of the NorthMap of La Union with San Juan highlightedOpenStreetMapSan JuanLocation within the PhilippinesCoordinates: 16°40′N 120°20′E﻿ / ﻿16.67°N 120.33°E﻿ / 16.67; 120.33CountryPhilippinesRegionIlocos RegionProvinceLa UnionDistrict"
        ],
        [
            "1st districtNamed forSt.",
            "John the BaptistBarangays41"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorArturo P. Valdriz • Vice MayorManuel Victor R. Ortega Jr. • RepresentativePablo C. Ortega • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Mariquita P. OrtegaReginald M. NangAldreick G. CarilloErnesto M. Bolong Jr.Norma B. LimJoseph Nicolas V. VelillaEarl F. GarciaRomero O. Lim"
        ],
        [
            " • Electorate27,002 voters (2022)Area • Revenue₱ 241.1 million (2020) • Assets₱ 852.5 million (2020) • Expenditure₱ 160.1 million (2020) • Liabilities₱ 115.1 million (2020)Service provider • ElectricityLa Union Electric Cooperative (LUELCO)Time zoneUTC+8 (PST)ZIP code2514PSGC013316000IDD : area code +63 (0)72Native languagesIlocano TagalogWebsitewww.sanjuanlaunion.gov.ph"
        ],
        [
            "San Juan, officially the Municipality of San Juan (Ilocano: Ili ti San Juan; Filipino: Bayan ng San Juan), is a 2nd class municipality in the province of La Union, Philippines.",
            "According to the 2020 census, it has a population of 40,507 people."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Prior to the arrival of the Spanish, San Juan was an Ilocano settlement called Dalandan, which is the name of the fruit Citrus aurantium Linn.",
            "that grew abundantly in the area."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "San Juan Watchtower"
        ],
        [
            "In 1582, San Juan was proclaimed a mission station under the authority of the Augustinian Order, as recorded by the Nueva Segovia Bi-centennial souvenir booklet dated April 25, 1587.",
            "By 1586 the town had become the center of the parish and was renamed San Juan by the Augustinian Fathers after the Catholic Patron Saint of San Juan Bautista.",
            "The town boasted an Augustinian convent and a population of 6,000.",
            "Its first priest was Friar Agustin Niño."
        ],
        [
            "The center of the parish was subsequently transferred to Bauang, with San Juan sometimes being an out-station (visita) of Bauang and sometimes of Bacnotan.",
            "In 1707 the Church of St. John the Baptist was constructed at San Juan.",
            "In 1772, the mission station was placed under the authority of the Dominican Order.",
            "In 1807, San Juan was established as a parish in its own right."
        ],
        [
            "On March 2, 1850, San Juan became part of the province of La Union, when the province was created by Governor-General Antonio Maria Blanco."
        ],
        [
            "In 1898 during the latter days of the Philippine Revolution, the whole of San Juan was razed to the ground by a great fire.",
            "With the demise of the church, convent, and rectory, the church registers were destroyed, although subsequent registers from 1898 to 1917 do survive and have been microfilmed.",
            "Municipal birth registers were begun in 1922."
        ],
        [
            "American invasion era"
        ],
        [
            "After the Spanish–American War, Father Mariano Gaerlan was appointed priest.",
            "He was a native of San Juan, the first Filipino priest for the town, and one of the \"Nine Clerics\" of Nueva Segovia who fought in the revolution.",
            "He also began the reconstruction of the church in 1902, which was completed under his successor, Father Eustaquio Ocampo."
        ],
        [
            "Another local resident, also named Mariano Gaerlan, wrote Biag ti Maysa a Lakay, Wenno Nakaam-ames a Bales (i.e., Life of an Old Man, or a Dreadful Revenge) under the pen-name of Batallador.",
            "The book was in the local Ilokano language and published in 1909.",
            "He was originally from Candon, Ilocos Sur where he also maintained a residence and an aspiring politician who was never elected to public office.",
            "He had several children including Nieves Gaerlan who married Antonio \"Matias\" Aquino, a then Mayor of San Juan, and \"Captain\" Candonino Gaerlan, a guerrilla leader, and Filipino war hero."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "From 1941 to 1945 San Juan was occupied by the invading Japanese forces during World War II."
        ],
        [
            "On January 19, 1942, Gaerlan co-led the first guerrilla ambush against Japanese forces in the Philippines, which was prosecuted on the southern outskirts of Candon.",
            "He was subsequently appointed commander of the Third Battalion of the 121st Infantry Regiment of the United States Armed Forces in the Philippines – Northern Luzon (USAFIP-NL).",
            "This regiment is often referred to as the La Union Infantry Regiment and was commanded by \"Captain\" George M. Barnett.",
            "Gaerlan was killed and subsequently beheaded later that same year at San Juan after he was betrayed by the local chief of police while visiting his sister.",
            "His head was stuffed into a jar of alcohol and displayed in the plazas of the towns en route to Candon.",
            "There the town mayor convinced the Japanese that this was in poor taste, and the container was thrown into a rice paddy west of the town."
        ],
        [
            "As the war progressed, crops and local services were destroyed.",
            "Food was in short supply."
        ],
        [
            "San Juan was liberated in 1945 by the soldiers of the 121st Infantry Regiment, Philippine Commonwealth Army, USAFIP-NL and guerrillas of the La Union Infantry Regiment during the Battle of San Fernando under Major Russell W. Volckmann on their way to meet the liberating forces of General Douglas MacArthur on the beaches of Lingayen Gulf."
        ],
        [
            "Philippine independence"
        ],
        [
            "After the war, inflation led to the financial crisis of 1950 which was followed by the introduction of import controls.",
            "Subsequent government-sponsored irrigation systems and farm technicians led to a slow but assured recovery with increased productivity and profitability."
        ],
        [
            "Geography"
        ],
        [
            "San Juan is located in the west of the province of La Union, along the Manila North Road, between latitudes 16°39'N and 16°43'N and longitudes 120°9'E and 120°15'E."
        ],
        [
            "San Juan is bounded on the north by the municipality of Bacnotan along the Baroro River, and on the east by the municipalities of San Gabriel and Bagulin along the Dasay-Duplas-Nagyubuyuban Creek.",
            "On the south it is bounded by the City of San Fernando and on the west by the South China Sea."
        ],
        [
            "San Juan is 8 kilometres (5.0 mi) north of San Fernando City, the provincial capital and regional center.",
            "It is also 277 kilometres (172 mi) north of Manila."
        ],
        [
            "The total land area of San Juan is 5,712 hectares (14,110 acres),  which is 4% of the province of La Union.",
            "Some 505.08 hectares or 8.46% is claimed by the municipality of Bacnotan and San Fernando City."
        ],
        [
            "Barangays"
        ],
        [
            "San Juan is politically subdivided into 41 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Allangigan"
        ],
        [
            "Aludaid"
        ],
        [
            "Bacsayan"
        ],
        [
            "Balballosa"
        ],
        [
            "Bambanay"
        ],
        [
            "Bugbugcao"
        ],
        [
            "Caarusipan"
        ],
        [
            "Cabaroan"
        ],
        [
            "Cabugnayan"
        ],
        [
            "Cacapian"
        ],
        [
            "Caculangan"
        ],
        [
            "Calincamasan"
        ],
        [
            "Casilagan"
        ],
        [
            "Catdongan"
        ],
        [
            "Dangdangla"
        ],
        [
            "Dasay"
        ],
        [
            "Dinanum"
        ],
        [
            "Duplas"
        ],
        [
            "Guinguinabang"
        ],
        [
            "Ili Norte (Poblacion)"
        ],
        [
            "Ili Sur (Poblacion)"
        ],
        [
            "Legleg"
        ],
        [
            "Lubing"
        ],
        [
            "Nadsaag"
        ],
        [
            "Nagsabaran"
        ],
        [
            "Naguirangan"
        ],
        [
            "Naguituban"
        ],
        [
            "Nagyubuyuban"
        ],
        [
            "Oaquing"
        ],
        [
            "Pacpacac"
        ],
        [
            "Pagdildilan"
        ],
        [
            "Panicsican"
        ],
        [
            "Quidem"
        ],
        [
            "San Felipe"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Rosario"
        ],
        [
            "Saracat"
        ],
        [
            "Sinapangan"
        ],
        [
            "Taboc"
        ],
        [
            "Talogtog"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Climate"
        ],
        [
            "The climate in San Juan is \"dry\" from November to April and \"wet\" from May to October.",
            "The south-west monsoon brings abundant rainfall during the wet season, whereas the north-east monsoon passing over the Cordillera Mountains to the east brings the drier conditions.",
            "The average annual temperature is 27.2 °C (81.0 °F)."
        ],
        [
            "Climate data for San Juan, La Union"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "42(1.7)"
        ],
        [
            "48(1.9)"
        ],
        [
            "74(2.9)"
        ],
        [
            "110(4.3)"
        ],
        [
            "269(10.6)"
        ],
        [
            "275(10.8)"
        ],
        [
            "362(14.3)"
        ],
        [
            "325(12.8)"
        ],
        [
            "330(13.0)"
        ],
        [
            "306(12.0)"
        ],
        [
            "126(5.0)"
        ],
        [
            "61(2.4)"
        ],
        [
            "2,328(91.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.2"
        ],
        [
            "12.0"
        ],
        [
            "17.1"
        ],
        [
            "21.2"
        ],
        [
            "27.1"
        ],
        [
            "26.8"
        ],
        [
            "28.1"
        ],
        [
            "27.0"
        ],
        [
            "26.0"
        ],
        [
            "24.5"
        ],
        [
            "17.7"
        ],
        [
            "12.4"
        ],
        [
            "251.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San JuanYearPop.±% p.a.1903 11,223—    1918 11,912+0.40%1939 10,941−0.40%1948 12,521+1.51%1960 14,516+1.24%1970 17,700+2.00%1975 18,339+0.71%1980 20,362+2.11%1990 25,046+2.09%1995 27,795+1.97%2000 30,393+1.93%2007 32,952+1.12%2010 35,098+2.32%2015 37,188+1.11%2020 40,507+1.70%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Juan, La Union, was 40,507 people, with a density of 710 inhabitants per square kilometre or 1,800 inhabitants per square mile."
        ],
        [
            "According to a local 1896 census, the population of San Juan was 10,510.",
            "At that time, there were twenty-eight barrios inhabited by 9,989 residents, and four rancherias inhabited by 521 \"infieles\" or non-Christians (Igorots).",
            "These barrios were Ili, Barraca, Panicsican, Talogtog, Sabangan, Taboc, Lubing, Sinapangan, Cacapian, Caculangan, Santa Rosa, Caaniyan, Oaquing, Catdongan, Caarusipan, Guinguinabang, Bugbugcao, Pacpacac, Legleg, Nadsaag, Capacuan, Bacnotan, Dasay, Al-langigan, Bombuneg, Balballosa, Duplas and San Felipe.",
            "The rancherias were Rancho de Locutan, Indang, Amontoc and Losoya.",
            "Yli, also known as Poblacion, had a population of 1,134 residents described as 2 \"Españoles peninsulares\", 2 \"Mestizos de español\", 1,122 \"naturales\" and 8 \"Chinos\"."
        ],
        [
            "In the early 1900s cholera was a scourge that took the lives of many people."
        ],
        [
            "As of the census of 2000, San Juan was home to 30,393 indigenous Ilocano people, concentrated in six barangays along the national highway.",
            "This is equivalent to 33.86% of the total population and is growing at the rate of 1.8% per annum.",
            "The average population density was 2,964 persons per square kilometer.",
            "In the two urban barangays where some 15% of the population reside, the population density rose to 3,073 persons per square kilometer, while in the remaining rural barangays the population density was 2,886 persons per square kilometer."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Juan"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  25.60"
        ],
        [
            "2009  22.68"
        ],
        [
            "2012  7.14"
        ],
        [
            "2015  5.51"
        ],
        [
            "2018  1.82"
        ],
        [
            "2021  7.31"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "San Juan is considered to be the Surfing Capital of the Northern Philippines and is known for its consistent intermediate quality surf and two surfing seasons from July to October and November to March."
        ],
        [
            "There is also a local museum, Museo de San Juan."
        ],
        [
            "Cottage Industries"
        ],
        [
            "Pottery, blanket-weaving, basketry, bamboo-craft, and broom-making are produced as a folk-industry.",
            "Hollow concrete blocks are manufactured in rural villages for local building projects."
        ],
        [
            "Agriculture"
        ],
        [
            "Yellow corn is one of the most important crops in San Juan, and is used as a raw material for food and industrial products such as starch, corn oil, beverages, gluten, snacks etc.",
            "It constitutes about 50% of the feed for local livestock and poultry enterprises.",
            "It was nominated as the product for the One Town One Product (OTOP) Philippines program of President Gloria Macapagal Arroyo to promote entrepreneurship and create jobs."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "San Juan, belonging to the first congressional district of the province of La Union, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Pablo C. Ortega"
        ],
        [
            "Mayor"
        ],
        [
            "Arturo P. Valdriz"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Manuel Victor R. Ortega Jr."
        ],
        [
            "Councilors"
        ],
        [
            "Mariquita P. Ortega"
        ],
        [
            "Reginald M. Nang"
        ],
        [
            "Aldreick G. Carillo"
        ],
        [
            "Ernesto Morales Bolong Jr."
        ],
        [
            "Norma B. Lim"
        ],
        [
            "Joseph Nicholas V. Velilla"
        ],
        [
            "Earl F. Garcia"
        ],
        [
            "Romero O. Lim"
        ],
        [
            "Gallery"
        ],
        [
            "Municipal Hall"
        ],
        [
            "People's Park"
        ],
        [
            "Saint John the Baptist Church"
        ],
        [
            "Museo de San Juan"
        ],
        [
            "Beach in San Juan"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Juan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Philippine Resistance in Candon, 1942\" by Donald Chaput, Philippine Studies vol.",
            "47, no.",
            "1 (1999): 100–113."
        ],
        [
            "^ a b"
        ],
        [
            "\"Province: La Union\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Juan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of La Union\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ Estado del numero de habitantes existenses de este pueblo durante el expresion lo año con expresion de razas, año de 1896.",
            "This was an 1896 census conducted under the administration of Capitan Municipal Ygnacio Abad."
        ],
        [
            "^ San Juan Registros Paroquiales, Defunciones (1898-1908)."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 6, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Juan, La Union."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-05-23 at the Wayback Machine"
        ],
        [
            "Places adjacent to San Juan, La Union"
        ],
        [
            "Bacnotan"
        ],
        [
            "South China Sea"
        ],
        [
            "San Juan"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Fernando"
        ],
        [
            "vteProvince of La UnionSan Fernando (capital and largest city)Municipalities"
        ],
        [
            "Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Bacnotan"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Bangar"
        ],
        [
            "Bauang"
        ],
        [
            "Burgos"
        ],
        [
            "Caba"
        ],
        [
            "Luna"
        ],
        [
            "Naguilian"
        ],
        [
            "Pugo"
        ],
        [
            "Rosario"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santol"
        ],
        [
            "Sudipen"
        ],
        [
            "Tubao"
        ],
        [
            "Component city"
        ],
        [
            "San Fernando"
        ],
        [
            "BarangaysSee: List of barangays in La Union"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Juan,_La_Union&oldid=1206493222\""
        ],
        [
            "Categories: Municipalities of La UnionBeaches of the PhilippinesSurfing locations in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from March 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}