{
    "name": "San Teodoro",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Teodoro, Oriental Mindoro"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°26′09″N 121°01′09″E﻿ / ﻿13.4358°N 121.0192°E﻿ / 13.4358; 121.0192"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Oriental Mindoro, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesSan Teodoro"
        ],
        [
            "SubaanMunicipalityMunicipality of San Teodoro"
        ],
        [
            "FlagSealMap of Oriental Mindoro with San Teodoro highlightedOpenStreetMapSan TeodoroLocation within the PhilippinesCoordinates: 13°26′09″N 121°01′09″E﻿ / ﻿13.4358°N 121.0192°E﻿ / 13.4358; 121.0192CountryPhilippinesRegionMimaropaProvinceOriental MindoroDistrict"
        ],
        [
            "1st districtFoundedFebruary 16, 1929Named forTheodore RooseveltBarangays8"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 146.4 million (2020) • Assets₱ 317.9 million (2020) • Expenditure₱ 113.7 million (2020) • Liabilities₱ 64.39 million (2020)Service provider • ElectricityOriental Mindoro Electric Cooperative (ORMECO)Time zoneUTC+8 (PST)ZIP code5202PSGC175213000IDD : area code +63 (0)43Native languagesIraya Tagalog"
        ],
        [
            "San Teodoro, officially the Municipality of San Teodoro (Tagalog: Bayan ng San Teodoro),  is a 4th class municipality in the province of Oriental Mindoro, Philippines.",
            "According to the 2020 census, it has a population of 19,121 people, making it the least populated municipality in the province."
        ],
        [
            "The municipality is classified as partly urban.",
            "It has a total land area of 34,100 hectares (84,000 acres).",
            "Mineral deposits found in the area are gold and iron."
        ],
        [
            "History"
        ],
        [
            "The town of San Teodoro was called \"Subaan\" during the Spanish times however the town center and seat of government was located at what is now Lumangbayan.",
            "Officially, Subaan and its neighboring town Baco, were \"visitas\" of Calapan, the cabecera (capital) of Oriental Mindoro."
        ],
        [
            "In 1828, the visita was headed by Gobernadorcillo Ysidro Crisostomo.",
            "He was succeeded by Gobernadorcillo Juan Sextol in 1830.",
            "When Subaan became a visita del pueblo y cabecera de Puerto Galera in 1840, Candido Fulgencia's position was reduced to \"Cabeza de Barangay\".",
            "This was also the title conferred on Marcelino Crisostomo in 1841."
        ],
        [
            "Subaan and Baco were again annexed to Calapan in 1852.",
            "Melchor Alcones Felix was elected gobernadorcillo with Rufino Arcon and Justo Arandia as cabezas de barangay  of 2 barangays.",
            "In 1856 they were replaced by Domingo Artillero and Bernardo Arenillo.",
            "There were just 3 barangays in 1889 and the cabezas were Faustino Artellero, Telesforo Fernandez and Modesto Alcones.",
            "When Subaan was declared a sovereign municipality (pueblo) in 1892, the new gobernadorcillo was Juan Rojas.",
            "In 1897, it was Ruperto Arce but the title Gobernadorcillo was changed to \"Capitan Municipal\".",
            "When Capitan Juan Rojas won the election again, it made him the only official who had been addressed by 3 different titles in his capacity as mayor of Subaan.",
            "He was the last gobernadorcillo because after his term, it was changed to capitan municipal.",
            "He was the last capitan because when Mindoro fell to the hands of the revolutionaries, he took oath under the emissary of Gen. Miguel Malvar on July 1, 1898, as \"Presidente Municipal\".",
            "Pres.",
            "Rojas was the first and the last leader of Subaan under the Revolutionary Government of General Emilio Aguinaldo."
        ],
        [
            "Before the turn of the century, Subaan had four cabezerias: Ylag, Tacligan, Bigaan and Pauican plus Subaan Proper (Lumangbayan) which in turn had 7 sitios namely Agbiray, Calabugao (both named after adjacent rivers), Bulaso, Calero, Calumpang, Tanak and Tubigan.",
            "During those times only the coastal areas were populated as water boats were the only mode of transportation between barangays.",
            "Bigaan was an exception because it had 10 inhabitants despite being inland."
        ],
        [
            "The coming of the Americans"
        ],
        [
            "In the morning of early February 1902, at the decline of the Philippine–American War, the town people of Subaan proper (now Lumangbayan) were disturbed by the deafening series of horn blasts coming from an American warship escorting a gunboat that anchored off the shores of Subaan Bay.",
            "The people headed by Capitan Juan Rojas preferred to flee to the forest and took refuge in the hills of Tanak and Pawikan."
        ],
        [
            "The people had reasons to be apprehensive.",
            "Six months earlier, 25 Mindoreños were killed during the American assault of Calapan.",
            "Random firing from Calero hilltop felled the priest named Fr.",
            "Vicente Jose and former Gobernadorcillo Pedro Luces Luna.",
            "Several houses were torched and large cache of firearms and ammunitions were captured.",
            "Mindoro is used to be bypassed by the Americans at the height of their campaign against Filipino insurgency.",
            "But after the capture of Gen. Emilio Aguinaldo in March 1901, they turned their attention to Mindoro, one of the islands in Luzon under Filipino control.",
            "The Americans employed many Filipino mercenaries whom they called \"Macabebes\".",
            "These mercenaries were feared more by the Mindoreños because of their ruthlessness.",
            "The hoisting of the Star-Spangled Banner in Calapan town plaza on July 29, 1901 ended the short-lived revolutionary government in Mindoro.",
            "But the insurgency never came to a halt.",
            "Sporadic fighting around the island continued.",
            "Americans employed reign of terror.",
            "Towns were razed to the ground, sources of drinking water poisoned, animals and harvests were confiscated or burned, and prisoners were maltreated.",
            "Houses were demolished for the construction materials needed in building military quarters and stockades and to create spaces for plazas and markets.",
            "War between the Americans and Mindoreños became destructive.",
            "Each camp resorted to atrocities utilizing kidnapping and hostage taking of families to force rebels to surrender as in the case of Governor Juan Morente of Pinamalayan.",
            "The group of Valeriano Gasic of Naujan in turn executed 70 suspected American collaborators."
        ],
        [
            "The sparsely populated Subaan community was defenseless.",
            "The US pacification and exploration force leader Commander Lt. Theodore Hutchins and his soldiers went ashore but were surprised to see that the town was deserted.",
            "Before noontime, when still nobody showed up, Lt. Hutchins ordered the burning of the town.",
            "President Juan Rojas upon seeing what happened from his observation post at Tanak Hills rushed to the shore and approached the Americans.",
            "To appease the returning evacuees.",
            "Lt. Hutchins through the interpretation of Sgt.",
            "Teodoro Viray of Pampanga, offered them a policy of attraction.",
            "It was the objective of Governor William H. Taft to “hold the Philippines (as colony) for the benefit of the Filipinos”.",
            "He replaced Gen. Arthur MacArthur, the father of Douglas MacArthur of World War II fame, because the military governor treated the Filipinos harshly.",
            "Civil Governor-General Taft then launched a sweeping reorganization of central and local government.",
            "He later returned to the United States to become the 27th American president."
        ],
        [
            "Founding of San Teodoro"
        ],
        [
            "Lt. Hutchins saw that the topographic location of Subaan proper was not suitable for future municipal site expansion.",
            "The place was surrounded by nipa swamps and marshland, and the shores were muddy and rocky.",
            "He asked Pres.",
            "Juan Rojas if they could find a broader place for the town site.",
            "The president together with the inhabitants led the Americans to the North crossing Subaan River.",
            "After about a kilometer walk, the commander was delighted to see the broad, level land facing Subaan Bay with the hills of Balucanag at the rear and the flat land extending up to the banks of Subaan River."
        ],
        [
            "During a meeting with the local leaders, Melecio Apolinar, the Cabeza de Barangay, Simplicio Castillo, Jacinto Jurado, Donato Arcon, and Felix Arguelles, Lt. Theodore Hutchins learned that the place was called Ylag.",
            "Sgt.",
            "Teodoro Viray suggested that the new town be named \"San Teodoro\" in honor of U.S. President Theodore Roosevelt, the American President during that time who had the sovereign authority over the colonial Philippines.",
            "Adding the prefix ‘San’ in naming a place was customary during the Spanish period in honor of patron saints thus San Teodoro."
        ],
        [
            "Because the first names of Sgt.",
            "Viray and Lt. Hutchins were also Teodoros, this led others to believe that the town was named after them, too.",
            "Teodoro Viray was a Macabebe and Theodore Hutchins ordered the burning of Subaan.",
            "Being authors of atrocities, the naming of San Teodoro could not be attributed to their infamous deeds."
        ],
        [
            "A temporary town planning was conceived to formalize the future town site.",
            "They fell down some trees and outlined 3 streets parallel to the shore.",
            "The new streets from the shore going inward were named after the owners of the lots: the Castillos, Arenillos and Jurados.",
            "The 3 streets parallel to the shoreline had undergone several name-change due to provincial politicking until they were officially identified as Juan Luna, J.P. Rizal and Mabini Streets.",
            "Some residents of Subaan were advised to move to the new site.",
            "Being related by blood, the leaders did not have a hard time on the distribution of the lots."
        ],
        [
            "Thereafter, Melecio Apolinar was the designated president.",
            "The other officials were Simplicio Castillo, Jacinto Jurado, Aquilino Arenillo, Juan Rojas and Angel Aldaba.",
            "Subaan proper became a barrio of San Teodoro and was called Lumangbayan, meaning “former poblacion”.",
            "Ilag is still used today to refer to a neighboring barangay north of Poblacion but it now extends up to the boundary with Puerto Galera near Bisay-an River."
        ],
        [
            "During that time, San Teodoro extends up to Pulang Tubig in the south (now part of Baco) up to Matala on the north (Km.",
            "37) along the shores of Subaan Bay and Varadero Bay (now part of Puerto Galera), and to a limitless boundary on the west."
        ],
        [
            "The new municipal government of San Teodoro was short lived.",
            "In 1903, together with Baco and Puerto Galera, San Teodoro was absorbed to become a barrio of Calapan as organized by the Philippine Commission headed by Gov.",
            "William H. Taft.",
            "In 1905, the new Philippine Commission Act No.",
            "1280 decreed that the 15 municipalities of the entire island (Mindoro was divided into \"Oriental\" and \"Occidental\" only in 1950 by virtue of Republic Act No.",
            "205) be reduced to eight.",
            "Abra de Ylog, formerly a part of Puerto Galera, was added to Mamburao together with Paluan."
        ],
        [
            "Foundation Day"
        ],
        [
            "In 1921, due to some political maneuvering, San Teodoro was annexed to Baco as its barrio.",
            "Representative M.P.",
            "Leuterio lobbied that San Teodoro be incorporated with the newly reconstituted town of Baco, his hometown, in order to gain patronage from his constituents.",
            "He was supported by his ally, Gov.",
            "Juan Liboro.",
            "When their rivals, Juan Luces Luna and Arturo Ignacio were elected representative and governor respectively, they reversed the works of their predecessors."
        ],
        [
            "Act No.",
            "3498 was passed by congress on December 8, 1928 declaring San Teodoro, Baco and Mansalay as separate municipalities.",
            "Our Lady of Immaculate Conception is the patron saint of San Teodoro whose feast day is celebrated every December 8.",
            "However, the official founding was held two months later on February 16, 1929, with Governor Arturo Ignacio and Congressman Juan Luces Luna officiating the ceremonies.",
            "The official observation and celebration of the founding of San Teodoro started on February 16, 1941, until today."
        ],
        [
            "A street was named after Congressman Juan Luna to show the town's gratitude for his effort to make San Teodoro a sovereign municipality."
        ],
        [
            "People"
        ],
        [
            "In 1903, there were only 302 residents in San Teodoro, the smallest among the settlements in the province and elsewhere in the country.",
            "There was a slight increase in population by 1918 (1,069 residents).",
            "Population doubled by 1939 with 2,911 residents.",
            "The density per sq.",
            "kilometer was less than 5 persons before 1918."
        ],
        [
            "It was the gold rush in San Teodoro of that year that brought the influx of migrants from all over the country majority of which were Bicolanos.",
            "San Teodoro became famous as No.",
            "1 gold producer in the whole of Mindoro and became known as the logging center of the province.",
            "It once had the largest forest reserves supplying the country's need for lumber, the rest being exported to other places of the world.",
            "The \"Valbueco Inc.\" and \"Philippine Matchwood Co.\" employed many workers and planters in response to the reforestation program of the government.",
            "People from adjacent Batangas, Bauan and Isla Verde migrated to San Teodoro."
        ],
        [
            "Religion"
        ],
        [
            "Owing to the long Spanish rule, the people of San Teodoro were mostly Catholics.",
            "After 1920 some changes in religious dominance took place.",
            "The migration of Batangueños, most of whom were Aglipayans, caused the town to be multi-sectarian."
        ],
        [
            "In the morning of December 9, 1920, the Parish Priest from Puerto Galera was not able to come ashore due to sudden change of weather condition and instead proceeded to Calapán.",
            "Pres.",
            "Melecio Apolinar instructed the intrepid sailors from Isla Verde to cross the sea and fetch a priest from Batangas.",
            "They brought with them an Aglipayan priest thus weddings and baptisms were all officiated by him.",
            "For almost three years, many were converted to Aglipayan, Salve, Protestant, Adventist and Iglesia ni Cristo faiths."
        ],
        [
            "The first Aglipayan Priest was Padre Klarín and the last was Padre Belén.",
            "After the Calapán–San Teodoro road was completed, the Catholic priest from Calapán took over and once again Catholicism dominated.",
            "In the 1950s, Mindoro's religious landscape was prevailed over by the German SVDs.",
            "For 3 decades, San Teodoro had Germans for parish priests as in the rest of the province.",
            "The very first resident priest of this town was Fr.",
            "Herman Enninga SVD dubbed by the press as “guerilla priest”."
        ],
        [
            "There was also a time when Mindoro had no parish priest.",
            "In 1898 when the Spaniards surrendered to the revolucionarios, all Spanish nationals including priests were sent to a concentration camp in Luzón.",
            "The sacristán mayor of Calapán then administered the church rites himself."
        ],
        [
            "Government"
        ],
        [
            "After the dissolution of the Philippine Commission and takeover of the senate, San Teodoro regained its township in 1919.",
            "Melecio Apolinar, who headed the town since 1902 as municipal president and as barrio captain from 1903 to 1919 when San Teodoro was under Calapan, was the best choice to take the helm of a municipal government.",
            "The officials during this short period of autonomy were Melecio Apolinar as president, Conrado Aldaba as vice-president, Francisco Arenillo, Simplicio Castillo, Benigno Patulan, and Pedro Bae as Councilors.",
            "Pres.",
            "Apolinar enforced strict rules to the people.",
            "Although he allowed gambling, drinking and social gatherings on Saturdays and Sundays, he obliged the people to clear forest, plant coconuts, abaca, other crops and some fruit bearing trees, and enhanced commerce with other towns and ports."
        ],
        [
            "Blas Apolinar was elected as next president of the new town.",
            "He died within that year.",
            "His vice-president, Emilio Ponce, took over.",
            "During Pres.",
            "Emilio Ponce's term, Saclag Settlement Farm School was established for the benefits of the ethnic minorities of San Teodoro, the Mangyans."
        ],
        [
            "On October 16, 1931, Esperidion Dimaculangan took his oath as president.",
            "He was advised by his Councilor Gregorio Castillo for the establishment of a new municipal building but he declined.",
            "Instead he held his office in the old Municipal Building along Arenillo and Mabini Streets.",
            "The President being wealthy could afford an excellent representation for officials and private visitors so that the popularity of his administration spread far and wide.",
            "For having a daughter teacher and a principal teacher son-in-law, it was easy for him to convince school officials to open new schools and grades.",
            "President Dimaculangan, being a merchant and a farmer, exerted all his efforts to encourage the people to acquire lands, do farming and increase commerce with other ports.",
            "He was so busy in his entire administration, until the last day of his term on October 15, 1934."
        ],
        [
            "Francisco Arenillo Sr. was elected and took control of the Municipal Government from October 16, 1934, to October 15, 1937.",
            "With many years of experience as a legislator, he was an executive with unchanging hatred to vices and laziness.",
            "He suppressed gambling and joblessness and was strict in carrying out the regular sessions of his council which got him hated by his councilors.",
            "He was generous enough to furnish a spacious yard for the Presidencia Building.",
            "He achieved this by procuring the two adjoining lots at the center of the town by exchanging them with his own properties.",
            "He then donated them to the Municipal Government moving the Presidencia Building to the site.",
            "He transferred the Treasurer's Office and the Post Office downstairs and a jail was provided.",
            "The transfer of the Presidencia Building at the head of Mabini Street changed the course of the Calapan–San Teodoro–Puerto Galera Road moving farther south of the town, causing the construction of an additional street at the expense of the Insular Government."
        ],
        [
            "President Francisco Arenillo Sr. was a determined President.",
            "During the joint session of the Municipal Councils of San Teodoro and Baco on matters of boundary dispute, he challenged every opponent to anything should the decision be unfair.",
            "He created disorder when the old boundaries were not followed.",
            "The members of his council were Eulalio Ramos as vice-president, Meliton Aldaba, Ceferino Flores, Antero Paglinawan and Emilio Ponce as Councilors.",
            "Vice-president Eulalio Ramos died on the later part of April, 1936, Councilor Ceferino Flores took his place and Casiano Evangelista was appointed Councilor.",
            "Pres.",
            "Arenillo Sr. purchased the market site with his own money and collected from the government later."
        ],
        [
            "Exequiel Fernandez became president on October 16, 1937, with Emilio Ponce as his vice-president, Meliton Aldaba, Mariano Añonuevo, Ceferino Flores, and Isidro Llave as Councilors.",
            "President Arenillo's project of the construction of the public market was pushed through.",
            "The market was completed but gave no income to the Municipal Treasury.",
            "Young President Exequiel Fernandez took an active part in the organization of the Commonwealth Government against the opinions of his councilors.",
            "When the transitory Commonwealth Government was established, Manuel L. Quezon was elected president.",
            "The title \"Municipal President\" was changed to \"Municipal Mayor\" making Exequiel Fernandez the last municipal president and the first municipal mayor.",
            "His term was extended two and a half months and ended on December 31, 1940."
        ],
        [
            "Japanese occupation"
        ],
        [
            "The most eventful elective term in the history of San Teodoro was that of Tomas Mendoza who assumed office as Municipal Mayor from January 1, 1941, up to December 31, 1947.",
            "His seven-year term of office was without interruption through peace and war: Japanese occupation, guerilla organization, American Liberation, and Philippine reorganization and reconstruction.",
            "He was supported by Vice Mayor Domingo Alisna and councilors Gregorio Cubos, Jose Patulan, Delfin Magpantay, and Epitacio Apolinar."
        ],
        [
            "After the first conference of Municipal and Provincial Officials in January, 1941, Mayor Mendoza got the support of Raul Eleuterio for the construction of Home Economics building for San Teodoro.",
            "An indefinite quantity of asphalt was also granted for asphalting the National Road from Poblacion towards Calapan.",
            "With the home economics building completed and road asphalting started, Mayor Mendoza secured the cooperation of the school authorities under the supervisor teacher Luis Raymundo to conduct and maintain the general cleanliness of the whole town and the vicinities next.",
            "All yards were fenced, heads of the streets were kept open, seashores were raked, and garbage disposed."
        ],
        [
            "The official observation and celebration of the founding of San Teodoro was activated on February 16, 1941, 12 years after its creation.",
            "Different barrios and schools headed by councilors and teachers were represented in the parade.",
            "Academic and athletic contest as well as social programs were held.",
            "Supervising teacher Luis Raymundo and Principal teacher Josefa Casanas were very important factors in every public activities of Mayor Tomas Mendoza as the two of them were an ever rolling spirit in school activities."
        ],
        [
            "The town fiesta of San Teodoro, December 8 that year, fall on Sunday.",
            "Mayor Mendoza advanced it a day and held it on Saturday, December 7, 1941.",
            "While fireworks and firecrackers were setting off that night at the festival's pageant coronation program, Japan was bombing Clark Airbase, Nichols Airbase, Manila, Baguio, Davao, and other places shortly after Pearl Harbor starting the Pacific War.",
            "On Sunday morning, December 8, 1941, the people of San Teodoro were awakened by the news of the war.",
            "Rushing to Calapan to confer with Governor Felipe Abeleda and Major Ramon Ruffi, Mayor Mendoza, Manuel Caeg, and some soldiers were told to organize volunteer guards.",
            "Every Councilor was recognized as Lieutenants heading a company.",
            "Councilors Epitacio Apolinar and Antero Roxas were recalled by the Army.",
            "Delfin Magpantay, murdered by unknown persons, was substituted by Vicente Atienza for Tacligan.",
            "Chief of Police Angel Ramirez, by the order of Major Ruffi was relieved successively by Gregorio Saldaña, Lazaro Amparo, and Emilio Ponce."
        ],
        [
            "The Japanese Imperial Forces landed at Calapan and Puerto Galera on February 27, 1942, after the Fall of Manila.",
            "Mindoro fell into the hands of the Japanese without much resistance.",
            "The Mayor instructed Secretary Jovencio Ponce and Sanitary Inspector Francisco Fernandez to meet the Japanese and get their intentions.",
            "The mayor busied himself visiting the people in different hiding places.",
            "After the meeting at Pagsiiran, at the advice of Ex-Governor Liboro, the root of resistance was organized at Nagpatay.",
            "Benedicto Arias, Emilio Ponce, Eutequio Caeg, Dominador Caeg, Modesto Calinawan, Leoncio Atienza, and Mariano Bañares formed the local guerrilla organization.",
            "Supervising teacher Luis Raymundo was forced to suspend all classes at elementary school."
        ],
        [
            "On March 8, 1942, Mayor Mendoza walked all the way through Calapan with his most trusted lieutenant, A. dela Cruz of Lumangbayan.",
            "He met Governor Abeleda and the Japanese Commander for Mindoro and accepted the designation as Mayor of San Teodoro.",
            "Then, he had a meeting with old Manuel Caeg at Santa Rosa.",
            "The underground movement of San Teodoro was formally organized on March 10, 1942, designating Sgt.",
            "Epitacio Apolinar as head and Old Manuel Caeg as Adviser.",
            "Mayor Mendoza remained Chief Executive and Head of Intelligence and Supply Groups.",
            "Lauriano Aparato, Alvin dela Cruz, and Ramon Bae joined later.",
            "After a meeting with Philippine Constabulary Sgt.",
            "Vicente Garachico and Mauro Magpili at Pakala, Tacligan, the resistant organization was greatly strengthened."
        ],
        [
            "When the Japanese ordered the opening of schools, Mayor Mendoza, with supervising-teacher Luis Raymundo, exerted his efforts and obliged the teachers to open complete elementary grades in Central School and primary grades in all barrios.",
            "Both of them, being guerillas in the intelligence and supply group, convinced the teachers and students that it was a pretext to show peace and order to the Japanese.",
            "The schools run well for two successive years bringing graduates in elementary grades.",
            "Whenever the Japanese officials visited San Teodoro, Mayor Mendoza and Supervisor teacher Luis Raymundo were proud to show them that there was really peace and order in San Teodoro."
        ],
        [
            "Resistance against the Japanese"
        ],
        [
            "On January 2, 1943, some Filipino escorts of the Japanese, including Vidal Ilagan who came from Bauan, Batangas, were killed by the guerillas headed by Sgt.",
            "Vic Evora at San Rafael bridge.",
            "The Japanese soldiers seized Diosdado Peña, Laureano Aparato, Fructuoso Villareal, and Cipriano Guttierez in the old cockpit arena in Lumangbayan together with Leonora Sanchez and the Mayor.",
            "They were imprisoned at the Japanese garrison in Calapan for several days.",
            "They were sentenced to die by firing squad.",
            "Through the intercession of Governor Abeleda, they were set free.",
            "Leonora Sanchez was kept for several months to be set free in the condition of the capture of the guerillas in San Teodoro."
        ],
        [
            "On March 22, 1944, Lt. Fernando Juerto, Antonio Zamora, and San Teodoro guerillas attacked the Japanese soldiers stationed at the house of Cirilo Medina resulting in the killing of 5 Japanese and the wounding of 2 guerillas and Edelwina Cruz, the granddaughter of Capt.",
            "Dodson, by grenade shrapnel.",
            "After two hours of battle, the surviving Japanese soldiers rode their swift boats to Lumangbayan.",
            "The following day, the Japanese soldiers stationed in Lumangbayan scoured the vicinities of Tibag and Capipi.",
            "After a fruitless search for guerillas in Pawikan, the Japanese soldiers returned to Lumangbayan where they were met again by another group of guerillas in the early night.",
            "The encounter enraged the Japanese more and they burned Lumangbayan which last until morning."
        ],
        [
            "The US capture of Mindoro"
        ],
        [
            "American forces led by General Douglas MacArthur with the Filipino soldiers started the invasion of Mindoro on December 15, 1944, in San Jose (the Battle of Mindoro).",
            "After the New Year's Day of 1945, guerillas from San Teodoro and Calapan met in Naujan.",
            "The combined forces headed by Guerilla Ex-Governor Juan Navarro, together with Alfonso Umali Sr., Major Ruffi and Captain William Dodson, attacked the Japanese garrison (now Gov.",
            "Alfonso Umali Memorial High School) liberating Calapan.",
            "Captain Dodson with Lt. Maximo Feraren and his platoon, guerillas and some American soldiers, engaged the enemy in the \"Battle of Longos\" which drove the Japanese to the forest of Baco."
        ],
        [
            "On early March of same year, Mayor Mendoza with about 500 Filipino guerillas from San Teodoro, some of whom were escapees from war camps in Mamburao and Abra de Ilog, reinforced the 300 Americans fresh from Okinawa under the command of Major Brown and Capt.",
            "Dodson.",
            "They were engaged in the final battle in the Valley of Karayrayan, Baco.",
            "After 9 days of fighting, all the Japanese forces were completely crushed."
        ],
        [
            "After World War II"
        ],
        [
            "In July 1946, few days after the signing of the Treaty of Manila, Mayor Mendoza and some of San Teodoro prominent men held a meeting for the establishment of a secondary school in the town.",
            "After so many consultations and preparations, an assembly of interested persons was held at the Municipal Building on the Labor Day of 1947.",
            "\"Northern Mindoro Academy, Inc\" was created.",
            "The mayor was elected president being one of the main stockholders of the newly established secondary school.",
            "The first teachers for Northern Mindoro Academy were the Spouses Severino and Josefa Araullo, Marianito Rivera, Paz Esguerra, Isabel Paradero and the Mayor himself."
        ],
        [
            "Melanio Tuason Sr. was the mayor of this town from 1948 to 1951 with Antero Roxas as his vice mayor.",
            "During his time, fishing and logging were the primary sources of livelihood and revenues for the municipal government.",
            "Small scale mining sometime brought fortunes to the few lucky prospectors.",
            "Melanio Tuason Sr. (2nd from left) at Mindoro Mayors Convention, March 9, 1948"
        ],
        [
            "The deed of exchange and selling of the old Presidencia Building and site were concluded by Ex-Mayor Mendoza and the Municipal Government of San Teodoro.",
            "The Office of the Municipal Government was transferred temporarily to the Public Dispensary building.",
            "Calsapa and Bisay-an were provided elementary schools.",
            "Unfortunately the buildings were blown down by a super typhoon."
        ],
        [
            "Faustino Aldaba succeeded Melanio Tuason Sr. in 1952.",
            "Antero Roxas continued acting as vice mayor.",
            "Mayor Aldaba was named the \"Governor of the Mangyans\".",
            "He initiated the mass titling of most of the lots in San Teodoro to generate more revenues for the government.",
            "Exportation of logs continued but the pestilence of abaca, swine, and other livestocks occurred in his time."
        ],
        [
            "Maximo Feraren was elected in 1956.",
            "He initiated the construction of the new Municipal Building located at its present site.",
            "The arrivals of many families from other towns and provinces increased the agricultural activities locally.",
            "The extensive campaign for payment of tax obligation gave the Municipality a good income through the indefatigable works of Assessor Carlos Mendoza and Treasurer Benjamin Garcia.",
            "Treas.",
            "Garcia was responsible for the construction of the present public market through his appeals in the print media.",
            "The Mayor donated a portion of his own property for the site of Bisay-an Elementary School.",
            "Roads were asphalted and many other infrastructure projects were initiated by Mayor Feraren, until his term of office ends in 1964."
        ],
        [
            "Melanio Tuason Jr. assumed office in 1964 with Tomas Arcon as his vice mayor.",
            "He initiated the release of some forest zones into “alienable and disposable” by the then DANR office.",
            "Proper utilization and conservation of marine resources within the municipal fishing territory was strictly enforced by Police Chief Vicente Garachico Jr. for the great benefit of subsistence fishermen."
        ],
        [
            "In 1968, Primitivo Atayde and Vicente Roxas as his vice took their oath of office.",
            "The Mayor initiated the concrete fencing of the town plaza.",
            "His diligence in asking support funds from higher agencies of the provincial and national government resulted in the installation of the water system and the Sanduguan medical mission of the town.",
            "During a meeting with other mayors over the old boundary dispute, he was overzealous in emphasizing the San Teodoro claim over several territories.",
            "He initiated other infrastructure projects in his term.",
            "He lost to Melanio Tuason Jr. in the 1972 election."
        ],
        [
            "Martial Law"
        ],
        [
            "During Martial Law, after its declaration on September 21, 1972, Mayor Melanio Tuason Jr. continued as the Mayor of San Teodoro.",
            "He had Deogracias Añonuevo as his vice mayor.",
            "Elections were suspended during the early part of martial rule.",
            "The tenure of all public officials were extended."
        ],
        [
            "The first local election ever held during martial law was in 1980.",
            "Claro Patulan won as mayor and his young teammate Antonio Roxas as vice mayor.",
            "Mayor Patulan initiated the construction of the Multi-Purpose Building and the concreting of some municipal streets."
        ],
        [
            "Loss of Barangay Bisay-an"
        ],
        [
            "In 1978, the cadastral surveys of San Teodoro and Puerto Galera for tax mapping purposes was executed resulting to the establishment of new political boundaries.",
            "San Teodoro lost Barangay Bisay-an to Puerto Galera due to Martial Law politics."
        ],
        [
            "Barangay Bisay-an is now Barangay Villaflor, Puerto Galera which is being disputed by San Teodoro."
        ],
        [
            "1986 EDSA Revolution"
        ],
        [
            "The assassination of Senator Benigno Aquino Jr. in 1983 brought nationwide discontentment culminating in EDSA Revolution causing abrupt termination of incumbent government elected officials.",
            "In 1986 the new Philippine president, Corazon Aquino, appointed Officer-In-Charge (OIC) mayors to replace the incumbents.",
            "Antonio Chua was appointed as OIC with Albert Gutierrez as Vice-OIC.",
            "On December 9, 1987, the two officials were replaced by Leonardo Ramos and Isabel Aldaba respectively."
        ],
        [
            "1988 election"
        ],
        [
            "Antonio Chua and Romulo Flores won the election in 1988 and serve until 1994.",
            "Projects they completed are the construction of the Multi-Purpose Building named Claro A. Patulan Memorial Multi-Purpose Center, the construction of the irrigation system of Bigaan, the construction of the Paspasin Elementary School, and the asphalting of the municipal and national road from Poblacion towards Barangay Ilag.",
            "The Municipal Health Center was constructed during their tenure.",
            "An approved resolution by the Chua administration brought about the establishment of San Teodoro National High School."
        ],
        [
            "Oscar Aldaba assassination"
        ],
        [
            "In 1995, retired military Major Oscar Aldaba was elected mayor of San Teodoro.",
            "He renovated the present Municipal Building and transferred the Police Station adjacent to the Multi-Purpose Center.",
            "He initiated the construction of the Bureau of Jail Management and Penology building.",
            "Under his term, he upholds discipline and promotes the clean and green movement.",
            "His diligence to obtain public funds from higher government agencies resulted in the granting of heavy equipment to the municipality and the concreting of municipal and part of national road in San Teodoro during the time of Governor Rodolfo G. Valencia.",
            "It was during his term when the Chief of Police of San Teodoro, Leodegario Torno was murdered along the National Road in Lumangbayan allegedly by members of the communist New People's Army (NPA)."
        ],
        [
            "Oscar Aldaba was re-elected for the second term in the 1998 election.",
            "He was assassinated at the Catholic Church premises on February 6, 2000.",
            "Vice Mayor Manuel Bae succeeded the slain mayor.",
            "Councilor Number one Lourdes Alisna was promoted to Vice Mayor and Francisco Marinduque was appointed Councilor."
        ],
        [
            "2001 election"
        ],
        [
            "During the 2001 election, Manuel Bae and Malvin Diokno won as mayor and vice mayor respectively.",
            "Seven months later Diokno died with Lourdes Alisna taking over.",
            "This administration initiated the construction of some infrastructure projects such as basketball courts, concreting of the national road, and the construction of the perimeter fence around San Teodoro National High School.",
            "Funds were secured from the provincial government for the repairs of existing municipal and barangay roads.",
            "The Municipal Multi-purpose Covered Court and the Pakala Farm-to-Market road were the government projects that were completed by this administration."
        ],
        [
            "Geography"
        ],
        [
            "San Teodoro is 32 kilometres (20 mi) west of the province's capital, Calapan, 19 kilometres (12 mi) east from Puerto Galera, and about 140 kilometres (87 mi) south of Philippine capital Manila.",
            "It is located on the northern part of Oriental Mindoro.",
            "It is bounded to the north by the Verde Island Passage, to the east by Baco, to the west by Puerto Galera, and to the south by Santa Cruz in Occidental Mindoro province."
        ],
        [
            "Barangays"
        ],
        [
            "San Teodoro is politically subdivided into 8 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bigaan"
        ],
        [
            "Calangatan"
        ],
        [
            "Calsapa"
        ],
        [
            "Ilag"
        ],
        [
            "Lumangbayan"
        ],
        [
            "Tacligan"
        ],
        [
            "Poblacion"
        ],
        [
            "Caagutayan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Teodoro, Oriental Mindoro"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "48(1.9)"
        ],
        [
            "32(1.3)"
        ],
        [
            "41(1.6)"
        ],
        [
            "54(2.1)"
        ],
        [
            "257(10.1)"
        ],
        [
            "410(16.1)"
        ],
        [
            "466(18.3)"
        ],
        [
            "422(16.6)"
        ],
        [
            "429(16.9)"
        ],
        [
            "300(11.8)"
        ],
        [
            "137(5.4)"
        ],
        [
            "92(3.6)"
        ],
        [
            "2,688(105.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10.8"
        ],
        [
            "8.0"
        ],
        [
            "9.8"
        ],
        [
            "11.7"
        ],
        [
            "23.1"
        ],
        [
            "27.5"
        ],
        [
            "29.2"
        ],
        [
            "28.7"
        ],
        [
            "28.7"
        ],
        [
            "25.5"
        ],
        [
            "18.2"
        ],
        [
            "12.8"
        ],
        [
            "234"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San TeodoroYearPop.±% p.a.1939 2,911—    1948 3,147+0.87%1960 5,562+4.86%1970 7,721+3.33%1975 7,862+0.36%1980 9,707+4.30%1990 12,223+2.33%1995 12,983+1.14%2000 13,806+1.33%2007 15,039+1.19%2010 15,810+1.84%2015 17,904+2.40%2020 19,121+1.30%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Teodoro"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  40.80"
        ],
        [
            "2009  33.57"
        ],
        [
            "2012  14.82"
        ],
        [
            "2015  22.37"
        ],
        [
            "2018  16.53"
        ],
        [
            "2021  18.78"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "List of former chief executives"
        ],
        [
            "The following presidents and mayors have presided over San Teodoro:"
        ],
        [
            "Melecio Apolinar - 1902–1903"
        ],
        [
            "Blas Apolinar - 1929"
        ],
        [
            "Emilio Ponce - 1928–1931"
        ],
        [
            "Esperidion Dimaculangan - 1931–1934"
        ],
        [
            "Francisco Arenillo Sr. - 1934–1937"
        ],
        [
            "Exequiel Fernandez - 1937–1941"
        ],
        [
            "Tomas Mendoza - 1941–1947"
        ],
        [
            "Melanio Tuason Sr. - 1948–1951"
        ],
        [
            "Faustino Aldaba - 1952–1956"
        ],
        [
            "Maximo Feraren - 1956–1964"
        ],
        [
            "Melanio Tuason Jr. - 1964–1968"
        ],
        [
            "Primitivo Atayde - 1968–1972"
        ],
        [
            "Melanio Tuason Jr. - 1972–1979"
        ],
        [
            "Claro Patulan - 1980–1986"
        ],
        [
            "Antonio Chua (OIC) - 1986–1988"
        ],
        [
            "Antonio Chua - 1988–1992"
        ],
        [
            "Antonio Chua - 1992–1995"
        ],
        [
            "Oscar Aldaba - 1995–1998"
        ],
        [
            "Oscar Aldaba - 1998–February 2000"
        ],
        [
            "Manuel Bae - February 2000–2001"
        ],
        [
            "Manuel Bae - 2001–2004"
        ],
        [
            "Apollo Feraren - 2004–2007"
        ],
        [
            "Apollo Feraren - 2007–2013"
        ],
        [
            "Marvic Feraren - 2013–January 2014"
        ],
        [
            "Salvador Py - January 2014–Present"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Teodoro |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Home\"."
        ],
        [
            "^ \"Macabebes and Moros\"."
        ],
        [
            "^ \"PHNO: Headline News Philippines\"."
        ],
        [
            "^"
        ],
        [
            "\"San Teodoro: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 27 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Oriental Mindoro\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Cincinato C. Mendoza and Henry M. Garcia, Research Authors"
        ],
        [
            "Oriental Mindoro - From the Dawn of Civilization to the Year 2000 AD, by Florante D. Villarica"
        ],
        [
            "The Mindoro Yearbook, by Macario Z. Landicho"
        ],
        [
            "History of the Filipino People, by Teodoro A. Agoncillo"
        ],
        [
            "Spanish documents from National Library and office of MPDC"
        ],
        [
            " History of the Municipality of San Teodoro, by Cincinato Mendoza and Henry Garcia DMD"
        ],
        [
            "External links"
        ],
        [
            "San Teodoro Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to San Teodoro, Oriental Mindoro"
        ],
        [
            "Isla Verde Passage"
        ],
        [
            "Puerto Galera"
        ],
        [
            "San Teodoro"
        ],
        [
            "Baco"
        ],
        [
            "Santa Cruz, Occidental Mindoro"
        ],
        [
            "vte Province of Oriental MindoroCalapan (capital and largest city)Municipalities"
        ],
        [
            "Baco"
        ],
        [
            "Bansud"
        ],
        [
            "Bongabong"
        ],
        [
            "Bulalacao"
        ],
        [
            "Gloria"
        ],
        [
            "Mansalay"
        ],
        [
            "Naujan"
        ],
        [
            "Pinamalayan"
        ],
        [
            "Pola"
        ],
        [
            "Puerto Galera"
        ],
        [
            "Roxas"
        ],
        [
            "San Teodoro"
        ],
        [
            "Socorro"
        ],
        [
            "Victoria"
        ],
        [
            "Component city"
        ],
        [
            "Calapan"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Teodoro,_Oriental_Mindoro&oldid=1232326840\""
        ],
        [
            "Category: Municipalities of Oriental MindoroHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}