{
    "name": "San Fernando",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Fernando, Romblon"
        ],
        [
            "16 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°19′N 122°36′E﻿ / ﻿12.32°N 122.6°E﻿ / 12.32; 122.6"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Romblon, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesSan FernandoMunicipalityMunicipality of San Fernando"
        ],
        [
            "FlagSealMap of Romblon with San Fernando highlightedOpenStreetMapSan FernandoLocation within the PhilippinesCoordinates: 12°19′N 122°36′E﻿ / ﻿12.32°N 122.6°E﻿ / 12.32; 122.6CountryPhilippinesRegionMimaropaProvinceRomblonDistrict"
        ],
        [
            "Lone districtFounded1636IncorporatedJanuary 1, 1947Barangays12"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorNanette B. Tansingco • Vice MayorDomeng Marin • RepresentativeEleandro Jesus F. Madrona • Councilors"
        ],
        [
            "Jezrel Aquino"
        ],
        [
            "Romel Repil"
        ],
        [
            "Cmyt Renion"
        ],
        [
            "Rodelio Relox"
        ],
        [
            "Dante Marin"
        ],
        [
            "Cynthia Rios"
        ],
        [
            "Dax Rios"
        ],
        [
            "Robert Relox"
        ],
        [
            " • Electorate16,674 voters (2022)Area • Revenue₱ 125.8 million (2020) • Assets₱ 348.7 million (2020) • Expenditure₱ 110 million (2020) • Liabilities₱ 79.66 million (2020)Service provider • ElectricityRomblon Electric Cooperative (ROMELCO)ZIP code5504PSGC175913000IDD : area code +63 (0)42Native languagesRomblomanon"
        ],
        [
            "San Fernando, officially the Municipality of San Fernando,  is a 4th class municipality in the province of Romblon, Philippines.",
            "According to the 2020 census, it has a population of 24,171 people."
        ],
        [
            "Etymology"
        ],
        [
            "It was formerly known as Pueblo de Cauit.",
            "In 1882, the town was renamed to Fernando, in honor of Ferdinand Magellan."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "The town of San Fernando was established in 1636 as Visita de Cauit in what is today Barangay Azagra.",
            "It is one of two visitas in Sibuyan Island, the other being Cajidiocan.",
            "In 1744, Cajiodiocan was turned into a pueblo (town) which included Visita de Cauit."
        ],
        [
            "The first villages or barrios of Visita de Cauit were Pag-alad, Cangumba, Mabolo or San Roque, Canjalon, España or Canago, Agtiwa, Cangumon and Otod.",
            "After Romblon was made a separate district in 1853, and the local government reorganization of 1855, 17 new pueblos were created including Visita de Cauit.",
            "On 3 February 1868, Pueblo de Cauit was renamed Pueblo de Azagra.",
            "One of Azagra's villages, Visita de Pag-alad was renamed Visita de San Fernando in 1882, in honor of Ferdinand Magellan."
        ],
        [
            "Modern era"
        ],
        [
            "The bow of the capsized M/V Princess of the Stars."
        ],
        [
            "When civilian government was introduced to the province by the Americans on 16 March 1901, Azagra was one of 11 new municipalities created.",
            "However, by the end of the year, the seat of the municipality was transferred from Azagra to San Fernando village, thereby, changing the town's name."
        ],
        [
            "On 8 June 1940, the passage of Commonwealth Act No.",
            "581, sponsored by Congressman Leonardo Festin, created the special municipality of Sibuyan.",
            "It abolished San Fernando and was annexed to the new town whose seat of government was in Cajidiocan.",
            "The special municipality of Sibuyan was abolished by Republic Act No.",
            "38, authored by Congressman Modesto Formilleza and enacted on 1 October 1946."
        ],
        [
            "In 1958, San Fernando High School, the town's highest institution of learning was converted into a national school for arts and trades known as Romblon National Vocation School under Republic Act No.",
            "2428."
        ],
        [
            "On 21 June 2008, MV Princess of the Stars, the flagship inter-island ferry of Sulpicio Lines sank in the waters of San Fernando after during the onslaught of Typhoon Fengshen (locally known as Typhoon Frank)."
        ],
        [
            "Geography"
        ],
        [
            "San Fernando is a coastal town which lies on the south-western portion of the Sibuyan Island and is the biggest among the three towns comprising the island, the other two being Magdiwang and Cajidiocan.",
            "It has a total land area of 190,608.231 km2 (73,594.249 sq mi).",
            "making it the largest municipality in the province, surpassing Odiongan by more than 11 km2 (4.2 sq mi).",
            "I The municipality has an irregular coastline broken by beautiful, long stretches of sandy beaches."
        ],
        [
            "The municipality has high and steep mountain ranges as it is located at the foot of Romblon's tallest peak, Mount Guiting-Guiting.",
            "Other mountains are Mount Sibuyan and Mount Conico.",
            "Much of its territory is part of Mount Guiting-Guiting Natural Park made up of lush tropical rainforest where unique flora and fauna thrive, giving Sibuyan the nickname, \"The Galapagos of the Philippines\"."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Fernando, Romblon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "47(1.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "39(1.5)"
        ],
        [
            "48(1.9)"
        ],
        [
            "98(3.9)"
        ],
        [
            "150(5.9)"
        ],
        [
            "169(6.7)"
        ],
        [
            "147(5.8)"
        ],
        [
            "163(6.4)"
        ],
        [
            "172(6.8)"
        ],
        [
            "118(4.6)"
        ],
        [
            "80(3.1)"
        ],
        [
            "1,264(49.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.4"
        ],
        [
            "8.2"
        ],
        [
            "9.3"
        ],
        [
            "9.7"
        ],
        [
            "19.1"
        ],
        [
            "25.6"
        ],
        [
            "27.4"
        ],
        [
            "25.5"
        ],
        [
            "25.5"
        ],
        [
            "25.2"
        ],
        [
            "18.5"
        ],
        [
            "14.5"
        ],
        [
            "219.9"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Barangays"
        ],
        [
            "San Fernando is politically subdivided into 12 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Agtiwa"
        ],
        [
            "Azagra"
        ],
        [
            "Campalingo"
        ],
        [
            "Canjalon"
        ],
        [
            "España"
        ],
        [
            "Mabini"
        ],
        [
            "Mabulo"
        ],
        [
            "Otod"
        ],
        [
            "Panangcalan"
        ],
        [
            "Pili"
        ],
        [
            "Poblacion"
        ],
        [
            "Taclobo"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San FernandoYearPop.±% p.a.1903 3,977—    1918 5,602+2.31%1939 7,585+1.45%1948 8,697+1.53%1960 10,659+1.71%YearPop.±% p.a.1970 13,448+2.35%1975 14,008+0.82%1980 14,778+1.08%1990 17,768+1.86%1995 18,551+0.81%YearPop.±% p.a.2000 21,214+2.92%2007 22,325+0.71%2010 22,466+0.23%2015 23,271+0.67%2020 24,171+0.75%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2015 census, San Fernando has a population of 23,271, which makes San Fernando the 3rd most inhabited town in the province of Romblon.",
            "The variant Romblomanon language locally called Sibuyanon dialect (Sibuyanon Magdiwang-España Style) is the native language in 4 eastern barangays of the municipality, while the rest speaks Sibuyanon (Sibujanon Azagra-San Fernando Style).",
            "The town has a Majority of Catholics and a few INC, Born-again Christians, and other religions."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Fernando"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  53.10"
        ],
        [
            "2009  47.38"
        ],
        [
            "2012  35.41"
        ],
        [
            "2015  37.74"
        ],
        [
            "2018  29.28"
        ],
        [
            "2021  37.70"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The municipality has various establishments including general merchandise stores, construction and welding shops, furniture outlets, funeral homes, rice mills, bakeshops, catering services, and one cable TV station.",
            "Fishing and Agriculture provides the main source of livelihood for the residents in San Fernando.",
            "The Sibuyan Sea and Cresta de Gallo serve as a fishing grounds due to its abundant marine animals like mackerel, sea quartz, tuna, dilis, tanguigue, lapu-lapu,  and tropical fish to name a few.The Agriculture sector of San Fernando is Mainly Rice and Corn Planting."
        ],
        [
            "Infrastructure"
        ],
        [
            "Utilities"
        ],
        [
            "National Power Corporation operates a 650-kW plant and 1,025-kW substation in San Fernando.It also have a Mini Hydro Power Plant in Cantingas.ROMELCO, the local electric cooperative, also implements power supply on the households.",
            "For its water supply, the town uses the Cantingas irrigation system, which services some 384 hectares of farmland.",
            "Some households depend on individual potable distribution which comes from jet pumps and springs."
        ],
        [
            "Transportation and communication"
        ],
        [
            "Tricycles are always available to carry passengers to town center or to the other places on the island when a ship is scheduled to arrive.There are also plans to open charter flights in Azagra Airstrip in the Town.There are also pumpboats that docks in the port of the town centre going to Roxas City.There are also pumpboats travel from agtiwa to Romblon Island."
        ],
        [
            "From Azagra jeepneys and tricycles are always available to carry passengers to town center or to the other places on the island when a ship is scheduled to arrive.There are also plans to open charter flights in Azagra Airstrip in the Town.There are also pumpboats that docks in the port of the town centre going to Roxas City.There are also pumpboats travel from agatiwa to Romblon Island"
        ],
        [
            "PLDT offers telecommunication services in San Fernando.",
            "Cellular phone services from Smart and Globe are available as well.",
            "Terrestrial and cable television services have become available too.",
            "The Sibuyan Circumferential Road is the main thoroughfare that traverses the coastline of San Fernando.",
            "This road connects San Fernando with the other Sibuyan Island towns of Cajidiocan and Magdiwang.",
            "Means of transportation include jeepneys, light vehicles, truck, motorcycles, and tricycles.",
            "Globe and Smart cellular also has 3G internet connection in San Fernando."
        ],
        [
            "Education"
        ],
        [
            "The San Fernando branch of Romblon State University offers a number of tertiary education courses for the local residents as well as students coming from all over the island.",
            "There are also 12 public elementary schools and two privately owned schools.",
            "There are also four government-ran secondary schools, and one privately owned school."
        ],
        [
            "Tourism"
        ],
        [
            "Because of its untouched mountainous landscape, several rivers,springs,falls, and freshwater lakes can be found in San Fernando.",
            "These include:"
        ],
        [
            "Cresta de Gallo: A five-hectare kidney-shaped islet with verdant terrain sloping down to the powdery white sand beach and surrounded by beautiful corral reefs.",
            "The beach is rich with different species of marine life and an ideal place for swimming and scuba diving."
        ],
        [
            "Busay Falls: A scenic spot with a natural pool located some 2.5 kilometers from Poblacion at Barangay Panangcalan.",
            "The upper portion is the water reservoir serving the Poblacion."
        ],
        [
            "Cantingas River: The pride of Barangay Taclobo is a natural swimming pool with a crystal water.",
            "The river is odorless, tasteless, and ever-flowing cold where one could quench his thirst while swimming.",
            "It has a cottage with a conference hall.It was also awarded as cleaniest and greeniest river in the Philippines for the year 2003 and 2005."
        ],
        [
            "Lamao Lake: A seven-hectare natural lake in Barangay Azagra."
        ],
        [
            "Lagting Falls: This scenic hideaway with a basin-like natural pool is located in Barangay Taclobo, some 3 kilometers away from Poblacion.",
            "This falls is a refreshing place to immerse during this hot summer.",
            "It has two natural swimming pools with clean water and has several cottages available around the area"
        ],
        [
            "Dagubdob Falls: A falls in Sitio Olango in Barangay Espana that is near in the mountain."
        ],
        [
            "Bila Bila Falls :A Beautiful Falls in Canjalon Named Bila Bila meaning Butterflies."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Philippine municipality"
        ],
        [
            "As a municipality in the Province of Romblon, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "Pursuant to Chapter II, Title II, Book III of Republic Act 7160 or the Local Government Code of 1991, the municipal government is composed of a mayor (alkalde), a vice mayor (bise alkalde) and members (kagawad) of the legislative branch Sangguniang Bayan alongside a secretary to the said legislature, all of which are elected to a three-year term and are eligible to run for three consecutive terms."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "The incumbent mayor of San Fernando, Romblon, is Salem R. Tansingco and the incumbent vice mayor is Arben Rosas."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Fernando |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c d e f g h Fabula, Milex (2001).",
            "\"Profile: San Fernando, Romblon\".",
            "Romblon Travel Guide.",
            "Retrieved 13 August 2014."
        ],
        [
            "^ a b c d e f \"San Fernando, Romblon\".",
            "The Official Website of the Provincial Government of Romblon.",
            "Retrieved 13 August 2014."
        ],
        [
            "^ Juris, The Corpus (1 October 1946).",
            "\"R.A. No.",
            "38: An Act Repealing C.A.",
            "No.",
            "581, Entitled, \"An Act Abolishing the Existing Municipal Governments and the Provincial Government of Romblon, and Creating Instead Four Special Municipalities,\" Restoring the Regular Provincial Government and Municipalities of the Province of Romblon, and Creating the Municipality of Santa Fe\".",
            "The Corpus Juris."
        ],
        [
            "^ \"Hundreds missing as ship capsizes\".",
            "BBC News.",
            "22 June 2008.",
            "Retrieved 22 June 2008."
        ],
        [
            "^ \"700 people aboard drifting ferry in Philippines\".",
            "Radio Australia.",
            "22 June 2008.",
            "Archived from the original on 14 August 2014."
        ],
        [
            "^ Ortiz, Margaux; Salaverria, Leila (24 June 2008).",
            "\"Ill-starred ship pride of Sulpicio\".",
            "Philippine Daily Inquirer.",
            "Retrieved 18 December 2012."
        ],
        [
            "^"
        ],
        [
            "\"San Fernando: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Romblon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Poverty Incidence, 2000\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"Poverty Incidence, 2003\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"Poverty Incidence, 2006\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"Poverty Incidence, 2012\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Poverty Incidence, 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Providing for a Local Government Code of 1991\".",
            "The LawPhil Project.",
            "8th Congress of the Republic of the Philippines.",
            "Retrieved 21 April 2014."
        ],
        [
            "^ \"San Fernando, Romblon Elections\".",
            "Archived from the original on 2016-05-30."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Fernando, Romblon."
        ],
        [
            "San Fernando, Romblon Profile - Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to San Fernando, Romblon"
        ],
        [
            "Magdiwang / Cajidiocan"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "San Fernando"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "vte Province of RomblonRomblon (capital)  Odiongan (largest municipality)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Banton"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Calatrava"
        ],
        [
            "Concepcion"
        ],
        [
            "Corcuera"
        ],
        [
            "Ferrol"
        ],
        [
            "Looc"
        ],
        [
            "Magdiwang"
        ],
        [
            "Odiongan"
        ],
        [
            "Romblon"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Fernando,_Romblon&oldid=1233661197\""
        ],
        [
            "Category: Municipalities of RomblonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}