{
    "name": "San Agustin",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Agustin, Romblon"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°34′08″N 122°07′53″E﻿ / ﻿12.56889°N 122.13139°E﻿ / 12.56889; 122.13139"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Romblon, Philippines"
        ],
        [
            "Municipality in Mimaropa, PhilippinesSan AgustínMunicipalityMunicipality of San AgustinMount Payaopao"
        ],
        [
            "FlagSealMap of Romblon with San Agustin highlightedOpenStreetMapSan AgustínLocation within the PhilippinesCoordinates: 12°34′08″N 122°07′53″E﻿ / ﻿12.56889°N 122.13139°E﻿ / 12.56889; 122.13139CountryPhilippinesRegionMimaropaProvinceRomblonDistrict"
        ],
        [
            "Lone districtFounded1631Named forSt.",
            "Augustine of HippoBarangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEsteban Santiago F. Madrona Jr. • Vice MayorZaldy G. Marin • RepresentativeEleandro Jesus F. Madrona • Councilors"
        ],
        [
            "Norman Fatalla"
        ],
        [
            "William Tan"
        ],
        [
            "Roland Abero"
        ],
        [
            "Johnny Jesalva"
        ],
        [
            "Claro \"Jun\" Madrilejos, Jr."
        ],
        [
            "Yolly Burguete"
        ],
        [
            "Ruben Montesa"
        ],
        [
            "Jimmy Morada"
        ],
        [
            " • Electorate16,002 voters (2022)Area • Revenue₱ 117.5 million (2020) • Assets₱ 238.2 million (2020) • Expenditure₱ 89.53 million (2020) • Liabilities₱ 57.83 million (2020)Service provider • ElectricityTablas Island Electric Cooperative (TIELCO)Time zoneUTC+8 (PST)ZIP code5501PSGC175911000IDD : area code +63 (0)42Native languagesRomblomanon TagalogWebsitesanagustinromblon.gov.ph"
        ],
        [
            "San Agustín, officially the Municipality of San Agustín,  (formerly Guintigui-an and Badajoz), is a 4th class municipality in the province of Romblon, Philippines.",
            "According to the 2020 census, it has a population of 24,115 people."
        ],
        [
            "Etymology"
        ],
        [
            "On 20 June 1957, by virtue of Republic Act No.",
            "1660, Badajoz Town was changed to San Agustin, after the town's patron saint."
        ],
        [
            "History"
        ],
        [
            "San Agustín was known during Spanish times as Guintigui-an because of the abundance of a fish called \"tigue\" in the area.",
            "Negrito and Mangyan tribes from Panay and Mindoro were the first inhabitants, as well as migrants from island of Romblon, and southern Tablas."
        ],
        [
            "In the early part of Spanish conquest, the first settlement was at barangay Cabolutan.",
            "The early settlers found it very tiring at times to cross the channel to Romblon town to attend to civil and religious duties.",
            "To solve this problem, Cabolutan leaders discussed the matter such as building a visita in their settlement of around 250 souls.",
            "Finally in 1635, the first church building made of coral stone and lime was started."
        ],
        [
            "In 1700, Spanish authorities decided to separate Cabolutan in Tablas Island from Romblon, with its seat at visita Cabolutan subjugating all settlements west of Tablas Island.",
            "The new pueblo or town of Cabolutan progressed slowly and grew more populous despite frequent Moro kidnapping raids.",
            "However, in 1790, a smallpox epidemic almost wiped out the town's entire population.",
            "The heavy casualty toll caused the pueblo's abolition which led to re- incorporation to Romblon until 1855, when another pueblo named Guintigui-an was founded some 4 kilometers south of the old town site.",
            "The town was founded by Don Laureano Montesa together with his brother Don Esteban and cousin Don Luis Montesa, who became Tiniente Absoluto in Romblon.",
            "Its jurisdiction included what is now the towns of Calatrava and Santa Maria.",
            "The construction of the Cotta (fort) at Payong-Payong hill (located in present-day barangay Cagbo-aya), started in 1873.",
            "Cotta protected the community from Muslim pirates and still stands today.",
            "In 1868, the town was renamed \"Badajoz\" by Andres Lebarde, a visiting Spanish soldier, after his native city of Badajoz, Spain."
        ],
        [
            "Geography"
        ],
        [
            "San Agustin is in the north-eastern part of Tablas Island with a total land area of 14,048 hectares (34,710 acres).",
            "It is bounded on the north by the municipality of Calatrava, on the south by the municipality of Santa Maria, on the east by Romblon Pass facing the Romblon capital town and on the west by the municipality of San Andres.",
            "Its municipal port serves as the eastern gateway to the main island of Tablas, as well as to the neighboring islands of the province."
        ],
        [
            "A mountain range shields the town from southeasterly monsoon but is completely exposed to north-easterly typhoons.",
            "San Agustin has the second highest mountain in the province, the volcano-shaped Mount Payaopao at 2,182 feet (665 m) high, overlooking Carmen Bay."
        ],
        [
            "Barangays"
        ],
        [
            "San Agustin is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bachawan"
        ],
        [
            "Binonga-an"
        ],
        [
            "Buli"
        ],
        [
            "Cabolutan"
        ],
        [
            "Cagbo-aya"
        ],
        [
            "Camantaya"
        ],
        [
            "Carmen"
        ],
        [
            "Cawayan"
        ],
        [
            "Doña Juana"
        ],
        [
            "Dubduban"
        ],
        [
            "Hinugusan"
        ],
        [
            "Lusong"
        ],
        [
            "Mahabangbaybay"
        ],
        [
            "Poblacion"
        ],
        [
            "Sugod"
        ],
        [
            "Demographics"
        ],
        [
            "According to the 2015 census, San Agustin has a population of 22,598 people.",
            "Romblomanon or Ini is the native language of the municipality's inhabitants.",
            "Tagalog is widely understood, and English stands as the medium of communication in business and trade."
        ],
        [
            "Population census of San AgustinYearPop.±% p.a.1903 5,189—    1918 8,438+3.29%1939 13,854+2.39%1948 14,425+0.45%1960 18,373+2.04%1970 18,917+0.29%1975 20,829+1.95%1980 21,664+0.79%1990 18,066−1.80%1995 20,160+2.08%2000 21,643+1.53%2007 22,118+0.30%2010 22,116−0.00%2015 22,598+0.41%2020 24,115+1.29%Source: Philippine Statistics Authority"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Agustin, Romblon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "115(4.5)"
        ],
        [
            "66(2.6)"
        ],
        [
            "55(2.2)"
        ],
        [
            "39(1.5)"
        ],
        [
            "164(6.5)"
        ],
        [
            "282(11.1)"
        ],
        [
            "326(12.8)"
        ],
        [
            "317(12.5)"
        ],
        [
            "318(12.5)"
        ],
        [
            "192(7.6)"
        ],
        [
            "119(4.7)"
        ],
        [
            "173(6.8)"
        ],
        [
            "2,166(85.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "13.6"
        ],
        [
            "9.4"
        ],
        [
            "10.4"
        ],
        [
            "10.5"
        ],
        [
            "21.1"
        ],
        [
            "26.0"
        ],
        [
            "29.0"
        ],
        [
            "27.6"
        ],
        [
            "27.5"
        ],
        [
            "23.1"
        ],
        [
            "16.7"
        ],
        [
            "16.1"
        ],
        [
            "231"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Government"
        ],
        [
            "San Agustin Municipal Hall"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Philippine municipality"
        ],
        [
            "As a municipality in the Province of Romblon, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "Pursuant to Chapter II, Title II, Book III of Republic Act 7160 or the Local Government Code of 1991, the municipal government is composed of a mayor (alkalde), a vice mayor (bise alkalde) and members (kagawad) of the legislative branch Sangguniang Bayan alongside a secretary to the said legislature, all of which are elected to a three-year term and are eligible to run for three consecutive terms."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "The incumbent mayor and vice mayor of San Agustin for the term 2019–2022 are Denon Madrona and Zaldy G. Marin, respectively."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Agustin"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  42.50"
        ],
        [
            "2009  43.50"
        ],
        [
            "2012  33.37"
        ],
        [
            "2015  37.11"
        ],
        [
            "2018  25.35"
        ],
        [
            "2021  27.41"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The municipality has various establishments including general merchandise stores, construction and welding shops, furniture outlets, funeral homes, rice mill, bake shops, bank, pawn shops, catering services, hostels, cable TV station, and Internet shops."
        ],
        [
            "Farming and fishing provide the main source of livelihood for the residents in San Agustin.",
            "The farmers primary products are rice, coconut, banana, copra, abaca.",
            "Fishermen harvest the bounty of the surrounding seas.",
            "Aside from fishing, an alternative source of livelihood are swine and poultry raising, cottage industries such as raffia production (bags, baskets, mats, hats, etc.)",
            "rattan and nitto basket and plate weaving, broom production such as soft broom made of tiger grass, locally known as walis tambo, and coconut broom or broomstick made of coconut palm fronds (leaves), locally known as walis tingting."
        ],
        [
            "Transportation"
        ],
        [
            "By air"
        ],
        [
            "From Manila, AirSWIFT serves Tugdan Airport four times a week.",
            "Travel time from Ninoy Aquino International Airport to Tugdan Airport is about an hour, and a less than an hour drive from Tugdan Airport to San Agustin."
        ],
        [
            "By water"
        ],
        [
            "Starhorse Shipping Lines and Montenegro Lines serves port of San Agustin from the port of Lucena and port of Romblon daily with roll-on/roll-off vessels.",
            "Access to San Agustin is also by ferry from the port of Batangas City in southern Luzon and disembarking at the port of Odiongan in Barangay Poctoy.",
            "M/V Princess Annavel serves San Agustin from the port of Batangas City twice a week departing Batangas to San Agustin every Thursday and Saturday at 4:00 p.m. M/V Grand Unity of Navios Shipping Lines serves San Agustin from the port of Batangas City once a week departing Batangas to San Agustin every Friday at 5:00 p.m. Travel time from Batangas to San Agustin port takes about 8–10 hours.",
            "Travel time from San Agustin port to San Agustin town proper is about 1–2 minutes by motorcycles.",
            "Jeepneys and tricycles are also readily available.",
            "Meanwhile, Montenegro Lines serves Odiongan from the port of Batangas City daily with roll-on/roll-off vessels departing Batangas at 5:00 p.m., and 2GO Travel departing Batangas to Odiongan every Sunday and Thursday at 10:00 a.m., and every Monday, Tuesday and Friday at 9:00 p.m. Travel time from Batangas to Odiongan port takes about 7–10 hours.",
            "A public utility jeep stationed in Odiongan port will bring you to San Agustin for a two-hour drive.",
            "San Agustin has daily RORO ferry (M/V Reina Magdalena/M/V Maria Querubin of Montenegro Lines) and pump boat services to Romblon, Romblon, and Magdiwang, Romblon.",
            "Pump boats leave San Agustin for Romblon, Romblon twice daily at 8:00 a.m. and 1:00 p.m. while RORO ferry (M/V Reina Magdalena/M/V Maria Querubin of Montenegro Lines) leave San Agustin for Romblon, Romblon and Magdiwang, Romblon daily at 6:00 a.m."
        ],
        [
            "Getting around"
        ],
        [
            "Public utility jeepneys, tricycles and motorcycles provide the main means of transport within the municipality, as well as to and from the neighbouring municipalities within Tablas Island."
        ],
        [
            "Communications"
        ],
        [
            "Mobile Telephony and Internet"
        ],
        [
            "Smart Communications and Globe Telecom provides mobile phone and Internet services in San Agustin."
        ],
        [
            "Television/Cable"
        ],
        [
            "The people of San Agustin is kept abreast of current events and information through broadcast media via television.",
            "At present, there are two free-to-air TV channels, GMA-7 and PTV-13, which both have established transmitter stations in the province.",
            "cable TV service is provided by a local cable TV operator, San Agustin Cable Antenna Corporation, with areas covering the barangays of Poblacion, Dubduban, Cagboaya and Carmen.",
            "A subscription-based Direct-To-Home (DTH) satellite TV service provider is also made available in San Agustin by leading DTH Service provider such as Dream Satellite TV, Cignal, and G Sat."
        ],
        [
            "Radio"
        ],
        [
            "AM radio stations broadcasting from Manila and nearby provinces such as DZMM, DZBB, DZRH, Bombo Radio, RMN Network, etc.",
            "can be heard in San Agustin.",
            "Local FM radio station DWGM Charm Radio 100.5 FM (stationed in Romblon, Romblon) is also on-the-air daily broadcasting programs tailor-made to the issues and needs of the local community."
        ],
        [
            "Print media"
        ],
        [
            "Local newspapers being circulated in the municipality are the Pinoy Text, Romblon Sun, and Romblon Times.",
            "The local online magazine accessible from San Agustin is Romblon News."
        ],
        [
            "Postal Services"
        ],
        [
            "The Philippine Postal Corporation provides postal services for the municipality with its post office in Barangay Poblacion."
        ],
        [
            "Healthcare"
        ],
        [
            "San Agustin has its own hospital, the Tablas Island District Hospital, a government hospital, and four barangay health stations."
        ],
        [
            "Education"
        ],
        [
            "San Agustin has the following 15 public Elementary Schools:"
        ],
        [
            "San Agustin Central School (Dubduban)"
        ],
        [
            "Dayongdong Primary School (Dayongdong, Sugod)"
        ],
        [
            "Cawayan Elementary School (Cawayan)"
        ],
        [
            "Long Beach Elementary School (Mahabangbaybay)"
        ],
        [
            "Sugod Elementary School (Sugod)"
        ],
        [
            "Carmen Elementary School (Carmen)"
        ],
        [
            "Cabolutan Elementary School (Cabolutan)"
        ],
        [
            "Luis M. Abello Sr. Primary School (Cagbo-aya)"
        ],
        [
            "Doña Juana Elementary School (Doña Juana)"
        ],
        [
            "Alfredo P. Navarette (Lubi) Elementary School (Binongaan)"
        ],
        [
            "Severina M. Solidum Memorial Elementary School (Lusong)"
        ],
        [
            "Hinugusan Elementary School (Hinugusan)"
        ],
        [
            "Buli Elementary School (Buli)"
        ],
        [
            "Camantaya Primary School (Camantaya)"
        ],
        [
            "Bachawan Elementary School (Bachawan)"
        ],
        [
            "High Schools:"
        ],
        [
            "Private:"
        ],
        [
            "Holy Rosary Academy (Poblacion)"
        ],
        [
            "Tablas Academy (Dubduban)"
        ],
        [
            "Public:"
        ],
        [
            "San Agustin National Trade High School (Mahabangbaybay)"
        ],
        [
            "Carmen National High School (Carmen)"
        ],
        [
            "Cabolutan National High School (Cabolutan)"
        ],
        [
            "Eduardo M. Moreno National High School (Binongaan)"
        ],
        [
            "Esteban M. Madrona Memorial National High School (Bachawan)"
        ],
        [
            "College / University:"
        ],
        [
            "Private:"
        ],
        [
            "Tablas College (Dubduban)"
        ],
        [
            "Saint Augustine Institute of New Technology (Poblacion)"
        ],
        [
            "Public: Romblon State University – San Agustin Campus (Cabolutan)"
        ],
        [
            "Tourism"
        ],
        [
            "Festivities: The people of San Agustin celebrates the Kalipayan Festival (Biniray / Streetdancing) held during the months of April and August while the Sabwagan Festival is held every month of February and July at Barangay Carmen."
        ],
        [
            "Attractions: San Agustin, among its attractions, include beaches, waterfalls, diving site, etc."
        ],
        [
            "Dubduban – Bita Falls, located in the interior of Barangay Dubduban, this impressive seven-tiered falls lies amidst dense vegetation and cool surroundings.",
            "The first tier is on the top of a hill with a 70-foot deep pool of clear blue-green waters.",
            "The bottom tier ends in a shallow pool of water."
        ],
        [
            "Long Beach, a long, wide sandy beach located at the foot of Mt.",
            "Payaopao (Barangay Mahabangbaybay), now being developed as the center of eco-tourism in the municipality."
        ],
        [
            "Sunken Spanish Galleon (Barangay Carmen), this site is highly recommended for sea explorers.",
            "This Spanish Galleon can be found in the deep waters of Carmen Bay, ideal for scuba diving."
        ],
        [
            "Kambaye Beach (Barangay Binongaan), possess a white long sandy shore and provides a full view of Romblon Island."
        ],
        [
            "Trangkalan Grotto and Stations of the Cross, this sacred place can be found in Barangay Bachawan.",
            "The place offers a tranquil atmosphere for the religious and a cascading falls to refresh picnickers.."
        ],
        [
            "Cawayan Park (Barangay Cawayan), the terrain is hilly and thickly forested, making it a homey refuge for wildlife flora and fauna."
        ],
        [
            "Punta Gorda Stairways (Barangay Cawayan), a concrete steps from the shoreline to the hilltop.",
            "Constructed by the national government in 1950, it is one of the most beautiful tourist spot in the area."
        ],
        [
            "Cotta (Barangay Cagboaya), the ruins of an old Spanish cotta or fort which was built by the natives to serve as a watch post for raiding Moro pirates.",
            "Perched on Payong-Payong Hill in Barangay Cagboaya, the remaining limestone walls of the cotta serve as a mute testimony to the town's rich historic past."
        ],
        [
            "San Agustin Freedom Park (Barangay Poblacion), the municipal park in San Agustin is a sprawling hectare of greens by the bay.",
            "It offers an undisturbed view of ships passing through Romblon Pass and, on clear days, a view of the islands of Romblon and Sibuyan."
        ],
        [
            "See also"
        ],
        [
            "List of renamed cities and municipalities in the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Agustin |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Mimaropa\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Changing the Name of the Municipality of Badajoz, Province of Romblon, to San Agustin\" LawPH.com Retrieved on 2011-04-12"
        ],
        [
            "^ a b Profile: San Agustin Romblon Travel Guide.",
            "Retrieved on 2012-04-16."
        ],
        [
            "^ San Agustin: Barangays lakbayPinas.com Retrieved on 2012-04-16."
        ],
        [
            "^ \"Total Population by Province, City, Municipality and Barangay: as of May 1, 2010\" (PDF).",
            "2010 Census of Population and Housing.",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on 15 November 2012.",
            "Retrieved 31 January 2013."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-B (Mimaropa)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-B (Mimaropa)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-B (Mimaropa)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Romblon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Agustin: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 April 2020."
        ],
        [
            "^ \"An Act Providing for a Local Government Code of 1991\".",
            "The LawPhil Project.",
            "8th Congress of the Republic of the Philippines.",
            "Retrieved April 21, 2014."
        ],
        [
            "^ \"San Agustin, Romblon Elections\".",
            "Archived from the original on 2016-05-30.",
            "Retrieved 2016-05-14."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Poverty Incidence, 2000\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"Poverty Incidence, 2003\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"Poverty Incidence, 2006\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Poverty Incidence, 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Cebu Pacific adds Masbate, Tablas to route network\".",
            "Manila Bulletin.",
            "December 13, 2016.",
            "Retrieved 12 January 2017."
        ],
        [
            "External links"
        ],
        [
            "San Agustin Profile at PhilAtlas.com"
        ],
        [
            "San Agustin, Romblon Profile - Cities and Municipalities Competitive Index"
        ],
        [
            "Mancuyas, Mario M.\"San Agustin: Scenic Getaway Town of Tablas Island\" Sanrokan.com Retrieved on 2012-04-16."
        ],
        [
            "About San Agustin Official Website of San Agustin, Romblon"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to San Agustin, Romblon"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "CalatravaSan Andres"
        ],
        [
            "San Agustin"
        ],
        [
            "Romblon Pass / Romblon"
        ],
        [
            "Odiongan"
        ],
        [
            "Santa Maria"
        ],
        [
            "vte Province of RomblonRomblon (capital)  Odiongan (largest municipality)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Banton"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Calatrava"
        ],
        [
            "Concepcion"
        ],
        [
            "Corcuera"
        ],
        [
            "Ferrol"
        ],
        [
            "Looc"
        ],
        [
            "Magdiwang"
        ],
        [
            "Odiongan"
        ],
        [
            "Romblon"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Agustin,_Romblon&oldid=1225919357\""
        ],
        [
            "Category: Municipalities of RomblonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}