{
    "name": "San Julian",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Julian, Eastern Samar"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°45′13″N 125°27′21″E﻿ / ﻿11.75361°N 125.45583°E﻿ / 11.75361; 125.45583"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Eastern Samar, Philippines"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesSan JulianMunicipalityMunicipality of San JulianChurch of San JulianMap of Eastern Samar with San Julian highlightedOpenStreetMapSan JulianLocation within the PhilippinesCoordinates: 11°45′13″N 125°27′21″E﻿ / ﻿11.75361°N 125.45583°E﻿ / 11.75361; 125.45583CountryPhilippinesRegionEastern VisayasProvinceEastern SamarDistrict"
        ],
        [
            "Lone districtBarangays16"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorDennis P. Estaron • Vice MayorYuri M. Acol • RepresentativeMaria Fe R. Abunda • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Edgardo D. Pomarca• Bernadette N. Aseo• Portia O. Anacta• Yurito M. Acol• Leandro R. Quinsayas• Cirilo G. Madolid• German T. Quinto• Abel L. NicartDILG Masterlist of Officials"
        ],
        [
            " • Electorate10,770 voters (2022)Area • Revenue₱ 96.54 million (2020) • Assets₱ 259.1 million (2020) • Expenditure₱ 104.6 million (2020) • Liabilities₱ 69.5 million (2020)Service provider • ElectricityEastern Samar Electric Cooperative (ESAMELCO)Time zoneUTC+8 (PST)ZIP code6814PSGC082620000IDD : area code +63 (0)55Native languagesWaray TagalogWebsitewww.sanjulian-esamar.gov.ph"
        ],
        [
            "San Julian, officially the Municipality of San Julian (Waray: Bungto han San Julian; Tagalog: Bayan ng San Julian), is a 5th class municipality in the province of Eastern Samar, Philippines.",
            "According to the 2020 census, it has a population of 14,800 people."
        ],
        [
            "The establishment of Libas in 1781 as a village was largely the work of a Franciscan parish priest of Sulat, Fr Melchor Claver.",
            "Through his efforts, a church was constructed, and houses were gathered around it.",
            "He directed the construction of a casa tribunal, a cemetery, and a rectory (convento).",
            "On July 4, 1863, Libas was separated from Sulat politically and ecclesiastically, and as it already had enough population and revenues to support a priest, was erected into a diocesan parish on August 25, 1871"
        ],
        [
            "History"
        ],
        [
            "The Parish/Township of San Julian owes its origin to the Pre-Spanish settlement of Libas.",
            "When the Jesuits started evangelizing the inhabitants on the eastern littoral of Samar Island in the early 17th century.",
            "Libas was already a small settlement, although the term village could not be applied to it.",
            "The houses were far removed from each other and the place was without street.",
            "It was simply a group of houses dotted near the mouth of Libas river.",
            "The inhabitants, whom from time to time the Jesuits from Sulat gathered at a makeshift chapel for worship and the doctrina were engaged in farming and fishing."
        ],
        [
            "The establishment of Libas in 1781 as a village was largely the work of a Franciscan parish priest of Sulat, Fr.",
            "Melchor Claver.",
            "Through his effort, a church was constructed and houses were gathered around it.",
            "He directed the construction of a casa tribunal, a cemetery, and a rectory (convento).",
            "On July 4, 1863, Libas was separated from Sulat politically and ecclesiastically, and as it already had enough population and revenues to support a priest, was erected into a diocesan parish on August 25, 1871."
        ],
        [
            "The new parish included the vistas (barrios) of nonoc, the patron of which was St. Pascual Baylon, Simangan, dedicated to St. John the Baptist, and Pagbabangnan, placed under the protection of St. Francis of Assisi.",
            "The first parish priest was a diocesan, Fr.",
            "Pedro Baul, who was assigned in Guiuan from 1865 to 1866.",
            "Tradition has it that he was a pastor of Libas from 1871 to 1874.",
            "The seat of the parish was, of course, Libas, with a wooden church dedicated to Our Lady of Sorrows.",
            "In 1865, the whole parish and town had a population of 2,940, and a total of 835 tributes.",
            "It also had an escuela de premer esdenanza (roughly a primary school) located at the parish seat.",
            "Its big church bell was acquired in 1885."
        ],
        [
            "When commerce in Samar Island improved in the late 19th century, the priest and the people recognized that the location of the town placed it in an economic disadvantage.",
            "In 1886, during the incumbency of Don Granizo Calim as gobernadorcillo, when the town had a total 3,645 population, and the people were already part of the inter-town commerce, Fr.",
            "Julian Diaz, the parish priest, proposed that the poblacion be transferred to the visita of Nonoc largely for economic reason."
        ],
        [
            "Having been seconded by the majority of the principales (town's leading men), the proposition for the transfer of poblacion, after much deliberation, was locally approved on April 7, 1886.",
            "With the stamp of approval by the governador general in Manila, with the assistance of the Gobernador Politico-Militar Don Pelayo Echacon y Lopez, the transfer became effective on August 14, 1887."
        ],
        [
            "Nonoc, the new poblacion was renamed San Julian, after the friar, Fr.",
            "Julian Diaz, the last resident priest of Libas and the first resident priest of Nonoc.",
            "Its first gobernardocillo was Don Francisco Villarazo.",
            "Since Nonoc had not a single street, one of the first projects of the parishioners was the opening of streets and in compliance with the usual requirements of poblacion, Fr.",
            "Diaz led in the construction of the parish church of stone (traditionally dated 1890), a church plaza, a casa tribunal (roughly a municipal  building), a convento, a cemetery (1888), and a primary school (escuela de primer ensenanza)"
        ],
        [
            "Meanwhile, Libas was reverted to the status of visita, populated by those Libasnons who chose to remain in the settlement.",
            "Before the end of the Spanish regime, one more visita was added to the pueblo (township) San Julian, namely, Nena, which was already known for its agricultural products.",
            "Originally known as Bulaun, its Militar, Don Ricardo Nouvilas, who named it after his daughter Nena.",
            "(Simangan became part of Sulat)"
        ],
        [
            "At the same time, another barrio (probably Lunang) was made, and renamed San Antonio, after the name of a well-loved pastor of San Julian, but its existence was short-lived, not only because the area was sparsely populated, but also because many inhabitants transferred to the poblacion.",
            "In 1909, San Isidro was separated from Pagbabangnan, and became an independent visita."
        ],
        [
            "The town is the most progressive in the entire Eastern Visayas region in terms of human rights upholding.",
            "It is the first and only municipality in the region to possess an ordinance which bans discrimination based on sexual orientation and gender identity."
        ],
        [
            "In April 2019, San Julian was close to the epicenter of a magnitude 6.5 earthquake.",
            "The town suffered 48 injured and damages 450 homes."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "San Julian is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Bunacan"
        ],
        [
            "Campidhan"
        ],
        [
            "Casoroy"
        ],
        [
            "Libas"
        ],
        [
            "Lunang"
        ],
        [
            "Nena (Luna)"
        ],
        [
            "Pagbabangnan"
        ],
        [
            "Barangay No.",
            "1 Poblacion"
        ],
        [
            "Barangay No.",
            "2 Poblacion"
        ],
        [
            "Barangay No.",
            "3 Poblacion"
        ],
        [
            "Barangay No.",
            "4 Poblacion"
        ],
        [
            "Barangay No.",
            "5 Poblacion"
        ],
        [
            "Barangay No.",
            "6 Poblacion"
        ],
        [
            "Putong"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Julian, Eastern Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "114(4.5)"
        ],
        [
            "81(3.2)"
        ],
        [
            "94(3.7)"
        ],
        [
            "81(3.2)"
        ],
        [
            "119(4.7)"
        ],
        [
            "192(7.6)"
        ],
        [
            "186(7.3)"
        ],
        [
            "158(6.2)"
        ],
        [
            "167(6.6)"
        ],
        [
            "185(7.3)"
        ],
        [
            "202(8.0)"
        ],
        [
            "176(6.9)"
        ],
        [
            "1,755(69.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.6"
        ],
        [
            "14.7"
        ],
        [
            "16.8"
        ],
        [
            "17.8"
        ],
        [
            "22.3"
        ],
        [
            "25.9"
        ],
        [
            "27.5"
        ],
        [
            "26.2"
        ],
        [
            "26.6"
        ],
        [
            "27.0"
        ],
        [
            "24.6"
        ],
        [
            "22.3"
        ],
        [
            "270.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San JulianYearPop.±% p.a.1903 3,765—    1918 5,364+2.39%1939 5,880+0.44%1948 6,735+1.52%1960 7,806+1.24%1970 10,237+2.74%1975 10,965+1.39%1980 13,007+3.47%1990 11,469−1.25%1995 11,858+0.63%2000 12,383+0.93%2007 13,164+0.85%2010 13,748+1.59%2015 14,498+1.02%2020 14,800+0.41%Source: Philippine Statistics Authority"
        ],
        [
            "The population of San Julian, Eastern Samar, in the 2020 census was 14,800 people, with a density of 98 inhabitants per square kilometre or 250 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Julian"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  32.40"
        ],
        [
            "2009  45.15"
        ],
        [
            "2012  43.50"
        ],
        [
            "2015  41.92"
        ],
        [
            "2018  48.41"
        ],
        [
            "2021  36.31"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Tourism has been a part of locals since the early 1990s as Liliputan opened its doors to visitors."
        ],
        [
            "Attractions include:"
        ],
        [
            "Liliputan Rocky Beach Resort - has rock formations and a natural pool that is equivalent to a 6 Olympic-size swimming pools."
        ],
        [
            "May Flower Festival (Mayomayohay) - Held every 1 May, the festival is an annual celebration of Nuestra Senora De Las Flores.",
            "It is said that it is the oldest dance festival celebration in all of Samar and Leyte."
        ],
        [
            "San Julian Century Old Church - a church made of coral stones, more than a hundred years old."
        ],
        [
            "San Julian Star - A talent competition held every July.",
            "It gathers talent for a prize which attracts locals as well as competitors from Leyte and Samar."
        ],
        [
            "Pangpang Three Waterfalls - these waterfalls offers a unique experience as it has three falls in a single location."
        ],
        [
            "Pangpang Rainy Waterfalls - A waterfall that only flows after rainfall."
        ],
        [
            "Campidhan Beach - A gray sand beach with matching white sand."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Julian |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Eastern Samar\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Julian, Eastern Samar : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 31 December 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Eastern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to San Julian, Eastern Samar"
        ],
        [
            "Sulat"
        ],
        [
            "Hinabangan, Samar"
        ],
        [
            "San Julian"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Borongan"
        ],
        [
            "vte Province of Eastern SamarBorongan (capital and largest city)Municipalities"
        ],
        [
            "Arteche"
        ],
        [
            "Balangiga"
        ],
        [
            "Balangkayan"
        ],
        [
            "Can-avid"
        ],
        [
            "Dolores"
        ],
        [
            "General MacArthur"
        ],
        [
            "Giporlos"
        ],
        [
            "Guiuan"
        ],
        [
            "Hernani"
        ],
        [
            "Jipapad"
        ],
        [
            "Lawaan"
        ],
        [
            "Llorente"
        ],
        [
            "Maslog"
        ],
        [
            "Maydolong"
        ],
        [
            "Mercedes"
        ],
        [
            "Oras"
        ],
        [
            "Quinapondan"
        ],
        [
            "Salcedo"
        ],
        [
            "San Julian"
        ],
        [
            "San Policarpo"
        ],
        [
            "Sulat"
        ],
        [
            "Taft"
        ],
        [
            "Component city"
        ],
        [
            "Borongan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Julian,_Eastern_Samar&oldid=1227714019\""
        ],
        [
            "Category: Municipalities of Eastern SamarHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textArticles with specifically marked weasel-worded phrases from September 2019Pages using the Kartographer extension"
        ]
    ]
}