{
    "name": "San Isidro",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Isidro, Isabela"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°52′N 121°46′E﻿ / ﻿16.87°N 121.77°E﻿ / 16.87; 121.77"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesSan IsidroMunicipalityMunicipality of San Isidro"
        ],
        [
            "FlagSealMap of Isabela with San Isidro highlightedOpenStreetMapSan IsidroLocation within the PhilippinesCoordinates: 16°52′N 121°46′E﻿ / ﻿16.87°N 121.77°E﻿ / 16.87; 121.77CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "6th districtFoundedJune 17, 1967Barangays13"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 103.9 million (2020) • Assets₱ 409.9 million (2020) • Expenditure₱ 85.52 million (2020) • Liabilities₱ 107.4 million (2020)Service provider • ElectricityIsabela 1 Electric Cooperative (ISELCO 1)Time zoneUTC+8 (PST)ZIP code3310PSGC023129000IDD : area code +63 (0)78Native languagesIlocano Gaddang TagalogWebsitewww.sanisidro-isabela.gov.ph"
        ],
        [
            "San Isidro, officially the Municipality of San Isidro (Ilocano: Ili ti San Isidro; Tagalog: Bayan ng San Isidro), is a 5th class municipality in the province of Isabela, Philippines.",
            "According to the 2020 census, it has a population of 27,044 people."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "History records that the early inhabitants of San Isidro were the Yogads, the natives of Echague.",
            "However, Ilokanos later settled in Camarag, making the Yogad-Ilokano groups the dominant population in the town.",
            "The Ilokanos came from Ilocos Sur and Ilocos Norte, persuaded by Antonio Mangadap, a well-traveled leader who journeyed through Northern Luzon.",
            "Mangadap’s son, Jordan, who became the leader of Camarag, served as gobernadorcillo and judge.",
            "Other members of the Mangadap clan also held leadership positions in Camarag, including Alfredo, the father of Mayor Proceso Mangadap."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "In the 18th century, when names such as Echague and San Isidro were not yet known, Camarag was already a popular place.",
            "The name Camarag was derived from the Camarag trees abundant in the area during the Spanish period in 1710.",
            "A significant Roman Catholic Church and a road connecting Camarag to other places like Santiago and Nueva Vizcaya were constructed, and the ruins of these landmarks still exist today.",
            "In 1776, Camarag became a town of the Province of Cagayan, the lone province in the Cagayan Valley at that time.",
            "However, in 1839, Camarag became the capital of Nueva Vizcaya when the province was created.",
            "Seventeen years later, in 1856, it became a town of Isabela, along with others such as Cabagan, Tumauini, Ilagan, Gamu, Angadanan, Carig (present-day Santiago), Palanan, Alamo, Gaddang, Mayoyao, Brengiones, and Catalaganes."
        ],
        [
            "Camarag remained a town for many years until the town site was transferred to Katuray, a location near the Cagayan River and the present site of Echague.",
            "The transfer occurred in 1863, and Katuray was renamed Echague in honor of General Rafael de Echague, the then-governor general of the country.",
            "The move was motivated by Katuray's proximity to the Cagayan River, the main transport artery, and the commercial center in the Cagayan Valley.",
            "Additionally, Katuray was surrounded by barangays producing high-quality tobacco and had fertile soil ideal for agriculture.",
            "With the town site transfer to Katuray in 1863, Camarag became a barrio of Echague.",
            "This remained the case until 1967 when San Isidro was established as a separate municipality, 104 years later.",
            "Thus, Camarag can be seen as the \"mother\" of Echague, which in turn became the \"mother\" of San Isidro."
        ],
        [
            "The opening of the San Jose-Santa Fee road in the 1920s facilitated the movement of people from Ilocos and Central Luzon to the Cagayan Valley, with many settling in Camarag.",
            "Leaders among these new settlers included Benito Tumamao, Vicente Ramos, Ramon Felipe, Tomas Galapia, and Alejandro Viloria.",
            "The influx of people into Camarag led to a population increase, which in turn boosted trade and commerce."
        ],
        [
            "Philippine independence"
        ],
        [
            "On June 17, 1967, Republic Act 5139, authored by Representative Melanio T. Singson, became law, creating the municipality of San Isidro.",
            "This law separated San Isidro from the municipality of Echague, its \"mother town\" since 1863.",
            "The town was officially inaugurated on January 1, 1968.",
            "The initiative to create San Isidro began in 1966 when Barangay Captain Guillermo Mariano and Municipal Councilor Ricardo Netro, both residents of San Isidro along with former Echague Mayor Patricio Ramos, then a Board Member of Isabela, petitioned Representative Singson to introduce a bill in the Philippine Congress to establish the new town of San Isidro."
        ],
        [
            "Singson initially opposed the creation of a new town due to the challenges of managing a new municipality, logistical constraints, and the limited area of the proposed municipality.",
            "However, he eventually relented to the group's persistence and enthusiasm and filed the bill in Congress.",
            "It was expected that the town site would be in Camarag due to its historical importance and popularity.",
            "However, since Camarag was located on the boundary of Echague, the site was conveniently assigned to its current location, between Barangay Gomez and Barangay Rizal."
        ],
        [
            "Since its establishment in 1967, the municipality of San Isidro has seen ten political administrations.",
            "Notably, Jolly P. Silverio stands out as one of the most influential leaders who spurred development in the area.",
            "Currently, the municipality is under the leadership of a young and dynamic mayor celebrated for his significant achievements."
        ],
        [
            "Today, while the Ilokanos remain the dominant group in San Isidro, the municipality is home to a diverse population.",
            "Tagalogs, Pangasinense, Ibanags, Gaddangs, and others have made San Isidro their place of residence and commerce."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "San Isidro is politically subdivided into 13 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Camarag"
        ],
        [
            "Cebu"
        ],
        [
            "Gomez (Poblacion)"
        ],
        [
            "Gud"
        ],
        [
            "Nagbukel"
        ],
        [
            "Patanad"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos East"
        ],
        [
            "Ramos West"
        ],
        [
            "Rizal East"
        ],
        [
            "Rizal West"
        ],
        [
            "Victoria (Doña Paulina)"
        ],
        [
            "Villaflor"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Isidro, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31.2(1.23)"
        ],
        [
            "23(0.9)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "28.1(1.11)"
        ],
        [
            "113.5(4.47)"
        ],
        [
            "141.4(5.57)"
        ],
        [
            "176.4(6.94)"
        ],
        [
            "236.6(9.31)"
        ],
        [
            "224.9(8.85)"
        ],
        [
            "247.7(9.75)"
        ],
        [
            "222.9(8.78)"
        ],
        [
            "178(7.0)"
        ],
        [
            "1,651.4(65)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "144"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San IsidroYearPop.±% p.a.1970 8,384—    1975 9,737+3.05%1980 11,527+3.43%1990 14,444+2.28%1995 16,043+1.99%2000 18,603+3.22%2007 21,387+1.94%2010 22,758+2.29%2015 24,861+1.70%2020 27,044+1.67%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Isidro, Isabela, was 27,044 people, with a density of 380 inhabitants per square kilometre or 980 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Isidro"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  18.50"
        ],
        [
            "2009  17.28"
        ],
        [
            "2012  14.63"
        ],
        [
            "2015  11.71"
        ],
        [
            "2018  11.97"
        ],
        [
            "2021  13.53"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipality of San Isidro is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the San Isidro Municipal Council(2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "District Representative"
        ],
        [
            "Faustino A. Dy V"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Vilmer B. Bravo"
        ],
        [
            "Municipal Vice-Mayor"
        ],
        [
            "Leonardo A. Tumamao"
        ],
        [
            "Municipal Councilors"
        ],
        [
            "Alberto J. Sario"
        ],
        [
            "Christine V. Bravo"
        ],
        [
            "Guill Marc Mariano"
        ],
        [
            "Levie D. Lomboy"
        ],
        [
            "Sharon S. Gervacio"
        ],
        [
            "Jerry Urbano"
        ],
        [
            "Ronald R. Sta.",
            "Maria"
        ],
        [
            "Lovelie M. Ulep"
        ],
        [
            "Congress representation"
        ],
        [
            "San Isidro, belonging to the sixth legislative district of the province of Isabela, currently represented by Hon.",
            "Faustino A. Dy V."
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "References"
        ],
        [
            "^ \"Republic Act No.",
            "5139 An Act Creating the Municipality of San Isidro in the Province of Isabela - Approved: June 17, 1967\".",
            "The LawPhil Project - lawphil.net.",
            "Retrieved June 25, 2024."
        ],
        [
            "^  Municipality of San Isidro |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c d e f g h \"History of San Isidro\".",
            "Municipality of San Isidro Isabela - rpt-sanisidro.online.",
            "Retrieved June 25, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Isabela\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Isidro, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 3 November 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"San Isidro, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved May 15, 2022."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "San Isidro at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Official website"
        ],
        [
            "Places adjacent to San Isidro, Isabela"
        ],
        [
            "Alicia"
        ],
        [
            "Ramon"
        ],
        [
            "San Isidro"
        ],
        [
            "Echague"
        ],
        [
            "Santiago"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Isidro,_Isabela&oldid=1230803239\""
        ],
        [
            "Category: Municipalities of Isabela (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}