{
    "name": "San Mateo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Mateo, Rizal"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°41′49″N 121°07′19″E﻿ / ﻿14.69694°N 121.12194°E﻿ / 14.69694; 121.12194"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Rizal, Philippines"
        ],
        [
            "Municipality in Calabarzon, PhilippinesSan MateoMunicipalitySan Mateo Municipal Hall along General Luna Avenue"
        ],
        [
            "FlagSealNickname: Mountain Biking Capital of the PhilippinesMotto(s): \"San Mateo, Bayan Ko, Mahal Ko\" (San Mateo, My Town, My Love)Map of Rizal with San Mateo highlightedOpenStreetMapSan MateoLocation within the PhilippinesCoordinates: 14°41′49″N 121°07′19″E﻿ / ﻿14.69694°N 121.12194°E﻿ / 14.69694; 121.12194CountryPhilippinesRegionCalabarzonProvinceRizalDistrict"
        ],
        [
            "3rd districtFounded21 September 1571Named forSt.",
            "Matthew the ApostleBarangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorBartolome N. Rivera (Liberal) • Vice MayorJaime M. Roxas (PDP–Laban) • RepresentativeJose Arturo Garcia Jr. (NPC) • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Boy SalenJoey BrionesJojo MarianoLeo BuenviajeCristeo CruzJoel DiazFroy SalesDenzel Diaz"
        ],
        [
            " • Electorate110,276 voters (2022)Area • Revenue₱ 797.9 million (2020) • Assets₱ 1,836 million (2020) • Expenditure₱ 833.5 million (2020) • Liabilities₱ 752.9 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code1850PSGC045811000IDD : area code +63 (0)2Native languagesTagalogWebsitewww.sanmateo.gov.ph"
        ],
        [
            "San Mateo, officially the Municipality of San Mateo (Tagalog: Bayan ng San Mateo),  is a 1st class urban municipality in the province of Rizal, Philippines.",
            "According to the 2020 census, it has a population of 273,306."
        ],
        [
            "It is bordered by Quezon City to the west, Marikina and Antipolo to the south, and by the Municipality of Rodriguez to the north.",
            "San Mateo is approximately 24 kilometers (15 mi) east of Manila and 11 kilometers (6.8 mi) north of Antipolo, the provincial capital of Rizal."
        ],
        [
            "Conurbated to the urban agglomeration of the Greater Manila Area, San Mateo is one of the fastest-growing municipalities in Rizal Province, according to the Metropolitan Manila Development Authority (MMDA) and the Provincial Government of Rizal.",
            "It is a commuter hub to Metro Manila."
        ],
        [
            "San Mateo is the home of the miraculous image of Our Lady of Aranzazu (Nuestra Señora de Aranzazu)."
        ],
        [
            "History"
        ],
        [
            "Spanish Colonial Era"
        ],
        [
            "In his book Conquistas de las Islas Filipinas, Father Gaspar de San Agustín records what is now San Mateo in 1572 to be a satellite settlement of Pasig.",
            "He described the inhabitants being “fierce but friendly and of quiet disposition.” Father Juan de Medina, in his account Relación de los Conventos Y Pueblos Fundados por los PP.",
            "Agustinos likewise put 1572 as the year the Parish of San Mateo was established.",
            "However, according to Miguel López de Legazpi, the first governor-general of the Philippines from 1571 to 1572, it was his nephew Juan de Salcedo who arrived at the site of the town during an expedition to Manila from Cebu.",
            "Accounts say that two years prior, Legazpi sent Salcedo along with 150 soldiers to prepare the inauguration of the City of Manila.",
            "It must have been Salcedo who discovered the town before Legazpi inaugurated Manila on 24 June 1571."
        ],
        [
            "Still, another account was that of a certain Augustinian named Father Cavada, who said that the first chapel in the islands with Saint Matthew as patron was built by the riverside in 1596 south of the present Población of the town, which was then only a Barrio of Tondo.",
            "Saint Matthew thus gave the town his name as the chapel was built on his feast day."
        ],
        [
            "What may be gleaned from the above accounts somehow is that San Mateo was discovered sometime in 1571, while its first church was built in 1596.",
            "It may be true, too, that the Parish of San Mateo was erected in 1572."
        ],
        [
            "Aside from the disagreement over the town’s precise foundation date, there is uncertainty as to how San Mateo acquired its name.",
            "According to one account, when the Spaniards made a reconnaissance of Manila's environs, they saw the San Mateo floodplains and were enamored by the natural beauty of the place.",
            "They decided to found a community there and one day, a Spanish scribe happened to stand on a mound with a book in one hand and a pen in the other.",
            "His statuesque pose prompted a companion to laugh and comment how the scribe resembled Saint Matthew, referring to the usual manner the evangelist is depicted in art.",
            "In the midst of their banter and merriment, they decided to call the place “San Mateo”."
        ],
        [
            "Another account says that San Mateo was named for its geographical resemblance to another town in Spain of the same name.",
            "As described by Paluzie in a geographical book, this small Spanish town is near a high mountain (and) has a river that flowed through its center, which often floods but quickly recedes.",
            "The town is also a grazing pasture for big animals and a fishing village.",
            "The present San Mateo is traversed by the Maly and Nangka rivers and its flood plains may have been a lush grazing area then."
        ],
        [
            "The Augustinian priests in San Mateo were later formally replaced (in 1689) by the Jesuits, who as early as 1637 included San Mateo among their missions, with the missions of San Isidro and Paynaan under it.",
            "The Jesuits brought with them an image of the Virgin Mary which came from the Spanish town of Arantzazu in Vizcaya.",
            "They were the ones responsible for building the church now located in the Población since the original chapel by the Augustinians beside the river was destroyed in a flood.",
            "The location of the present church is in Barangay Santa Ana and its patron saint is Our Lady of Aranzazu.",
            "The original image of Saint Matthew, which was housed in the destroyed Augustinian chapel, was translated to Barangay Dulongbayan (formerly llaya), where it was enshrined as patron of the village, which still keeps his feast on 21 September."
        ],
        [
            "In the following centuries, San Mateo had a colorful and distinguished history.",
            "In 1639, a pitched battle ensued between Chinese rebels on one side and combined Spanish and native troops on the other.",
            "The Chinese were defeated and retreated east to the Sierra Madre Mountains, but not before burning the town and its church."
        ],
        [
            "On 16 May 1687, the territory and convent of San Mateo were added to Pasig by the Augustinians, with the headquarters and residences of the mission at Mariquina (Marikina).",
            "Two years later, the Augustinians handed over the ecclesiastical administration of San Mateo to the Jesuits."
        ],
        [
            "In 1699, the convent of Saint Augustine won a court case against native inhabitants with regard to a claim over a ranch in the district of San Mateo."
        ],
        [
            "From 1696 to 1746, residents rebelled against Spanish authority in the town.",
            "They fled to the mountains and abandoned the lowland settlement until 1746, when they returned following dialogue and persuasion by the Jesuits."
        ],
        [
            "The independent-mindedness of the San Mateo people showed itself again in the 15-year period from 1751 to 1765 when they rebelled against Spanish rule.",
            "The residents were ordered to surrender their weapons, but they refused.",
            "With this resistance, the Spanish government was forced to reduce the town to ruins."
        ],
        [
            "In 1712, the governor-general, the Conde de Lizarriaga, sent Captain Don Lorenzo de Yturriaga together with twelve soldiers to punish Captain Pambila, a native chieftain who was reportedly inciting the residents to revolt against Spanish colonial authorities and the local Spanish priest.",
            "Captain Pambila attacked the Spanish officer, but the latter was able to parry the blow and shoot the native leader dead."
        ],
        [
            " Doctrina ChristianaWhen municipal governance was instituted by the Spaniards in San Mateo in 1799, the town was governed by a Gobernadorcillo who served for one year and exercised the power to appoint the Cabeza de Barangay for the same term of one year.",
            "However, there were instances when the Governadorcillo served for two or three years.",
            "The first resident appointed to the post of Governadorcillo in 1799 was Donato Sulit while the last one to hold the post in 1895 was one Ismael Amado Jr., who incidentally continued serving up to 1905 even after the establishment of the civil government under the Americans in 1901 when he was appointed Capitán Municipal by the Military Governor of the United States Army Department."
        ],
        [
            "San Mateo was partitioned on 27 April 1871, when Captain-General Isquierdo issued a decree separating the barrios of Balite, Burgos, Marang and Calipahan from San Mateo and formed them into the new municipality of Montalbán (Rodríguez)."
        ],
        [
            "In the Spanish period, there was only one public school in San Mateo and the educational advancement of the youth was very slow.",
            "The books used were limited to the religious tracts called Eaton, Camia, Castiana, and the Doctrina Christiana.",
            "After knowing how to read, most students quit school while the few wealthy enrolled in Catholic schools in Manila."
        ],
        [
            "Philippine Revolution"
        ],
        [
            "General Aguinaldo"
        ],
        [
            "On 23 August 1896, the Philippine Revolution began after the Cry of Pugad Lawin when Andrés Bonifacio and the Katipuneros began the tearing of cédulas in defiance to Spanish rule."
        ],
        [
            "On 2 November, San Mateo would fall under the revolutionary forces led by Bonifacio, capturing the municipal hall and besieging the Spanish garrison in the town.",
            "Three days later, Bonifacio would be pushed back to Montalban, and the besieged Spanish garrison would be relieved by reinforcements from Manila.",
            "The same month, General Mariano Llanera made San Mateo his headquarters."
        ],
        [
            "By 6 August 1898, San Mateo joined the revolutionary government of General Emilio Aguinaldo."
        ],
        [
            "During the succeeding Philippine–American War, General Licerio Gerónimo's guerrilla bands from the foothills of San Mateo and Montalbán attacked American troops in October 1900.",
            "However, the Filipinos were defeated.",
            "A curious twist of history occurred when during the fighting, Gen. Henry Ware Lawton–who had captured the elusive Apache leader Geronimo–was in turn killed by a sharpshooter under Gen. Gerónimo.",
            "In the eyes of the Filipino people, Gen. Geronimo became a great man for killing an illustrious American general who distinguished himself during the American Civil War and the American military campaign in Cuba as well as in northern, southern and central Luzon."
        ],
        [
            "During the American Occupation, Act No.",
            "137 of the Philippine Commission incorporated San Mateo, previously part of the Province of Manila, into the newly created Province of Rizal on 11 June 1901.",
            "In line with its policy of fiscal economy and centralized governance, the Philippine Commission also enacted Act No.",
            "942 in 1903 which merged the towns of San Mateo and Montalbán, with the former serving as the seat of government."
        ],
        [
            "On 29 February 1908, Executive Order No.",
            "20 partitioned both, thus formalizing Montalbán's status as an independent municipality.",
            "Its real divisions then included the barrios of Ampid, Santa Ana, Guitnangbayan, Dulongbayan, Malanday, Guinayang and Maly.",
            "However, due to constant development of the rural areas and the increase in population, the barrios of Guitnangbayan and Dulongbayan were divided into two sections."
        ],
        [
            "With regard to education, it was in 1909 when public schools were opened in the country under the supervision of Dr. David Burrows.",
            "San Mateo became a recipient of the new, democratized education system when Mr. Frank Green was assigned as the town’s first school supervisor, assisted by two Filipino teachers José Bernabé and Miguel Cristi.",
            "The English language was also taught in the public school.",
            "Transportation and other facilities in the municipality were increased and repaired thus resulting to more communication and exchange of goods and services."
        ],
        [
            "Japanese Occupation Era"
        ],
        [
            "During the Japanese occupation, the Imperial Japanese Army occupied San Mateo, but no battle transpired between Japanese and Filipino forces.",
            "There were only minor encounters between the Japanese soldiers and members of the Filipino guerrilla forces.",
            "Nevertheless, some prominent residents of the town were killed and maltreated by the Japanese military on suspicions that they were either guerrillas or sympathizers."
        ],
        [
            "Upon their arrival in the municipality, the Japanese troops seized school buildings and several big houses for use as their headquarters.",
            "Productive ricelands irrigated by water from the main pipe of the Metropolitan Water District were also forcibly appropriated and tilled under the direct supervision of Japanese officials.",
            "Livestock and crops were confiscated to supply the Japanese military stationed in San Mateo and Montalban."
        ],
        [
            "When the American forces landed north of Manila on 3 February 1945 and started recapturing the surrounding areas, San Mateo came under the line of fire of the Liberation Forces and was continued with help of Filipino soldiers under the Philippine Commonwealth Army and Philippine Constabulary and local guerrillas.",
            "Residents were advised by the Air Raid Warden to vacate the Población and seek refuge in Sitio Kalamyong on the west bank of the Marikina River.",
            "There, they built temporary shelters while the U.S. Air Force conducted daily bombings on Japanese installations in Montalbán.",
            "However, one afternoon, a bomb on board an American Air Force plane was accidentally dropped on the refugee camp at Sitio Kalamyong, killing a hundred civilians."
        ],
        [
            "Although in the aftermath of the war the American government compensated the people of San Mateo for the war damages, there were cases when the amounts received were not considered commensurate with the sufferings endured."
        ],
        [
            "Cityhood and redistricting proposal"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "As early as 2016, the town's Sangguniang Bayan approved Resolution No.",
            "60, Series of 2016 requesting Senate through its president, Franklin Drilon and the House of Representatives through its speaker, Feliciano Belmonte Jr. to co-sponsor a bill for San Mateo's conversion into a city and creation of a lone legislative district."
        ],
        [
            "This was proposed by Rizal's 2nd district Representative Juan Fidel Felipe Nograles through House Bill No.",
            "336, making sure that the second district of Rizal will be reorganized to add two more districts, along with Rodríguez (Montalbán).",
            "Finally, on 12 April 2021, the 3rd district of Rizal, which consists only of San Mateo, was established by virtue of Republic Act No.",
            "11533.",
            "It elected its first representative in 2022 in the person of Jose Arturo Garcia Jr."
        ],
        [
            "Timeline"
        ],
        [
            "Date/Year"
        ],
        [
            "Milestone"
        ],
        [
            "1571–1572"
        ],
        [
            "San Mateo was discovered as a town annexed to Pasig."
        ],
        [
            "1639"
        ],
        [
            "Battle between Chinese rebels and combined Spanish and native troops.",
            "The Chinese were defeated and retreated east to the Sierra Madre."
        ],
        [
            "16 May 1687"
        ],
        [
            "The territory and convent of San Mateo are annexed to Pasig by the Augustinians."
        ],
        [
            "1689"
        ],
        [
            "Jesuit priests formally replace the Augustinian priests who were in San Mateo as early as 1637.",
            "They brought the image of the Virgin Mary from the town of Aranzazu in Spain."
        ],
        [
            "1705"
        ],
        [
            "Fr.",
            "Juan Echazabal, a Jesuit priest, introduced devotion to Our Lady of Aranzazu, replacing Saint Matthew as the town patron."
        ],
        [
            "1799"
        ],
        [
            "Donato Sulit is appointed as the first resident Gobernadorcillo of San Mateo."
        ],
        [
            "27 April 1871"
        ],
        [
            "San Mateo is partitionee when Captain General Izquierdo issued a decree separating the barrios of Balite, Burgos, Marang and Calipahan from San Mateo to form Montalban (Rodriguez)."
        ],
        [
            "1895"
        ],
        [
            "Ismael Amado, Jr. presides over San Mateo as its last Gobernadorcillo.",
            "He serves up to 1905 even after the establishment of the Civil Government under the American Regime in 1901, when he was appointed Capitán Municipal by the Military Governor of the United States Army Department."
        ],
        [
            "2 November 1896"
        ],
        [
            "San Mateo would fall under the revolutionary forces led by Andres Bonifacio, capturing the municipal hall and besieging the Spanish garrison in the town."
        ],
        [
            "5 November 1896"
        ],
        [
            "Bonifacio would be pushed back to Montalban, and the besieged Spanish garrison would be relieved by reinforcements from Manila."
        ],
        [
            "November 1896"
        ],
        [
            "General Mariano Llanera makes San Mateo his headquarters during the Philippine Revolution."
        ],
        [
            "6 August 1898"
        ],
        [
            "San Mateo joins the revolutionary government of Gen. Emilio Aguinaldo."
        ],
        [
            "October 1900"
        ],
        [
            "Gen. Licerio Gerónimo's guerrilla bands from the foothills of San Mateo and Montalban (Rodriguez) attack the American troops during the Philippine–American War."
        ],
        [
            "11 June 1901"
        ],
        [
            "San Mateo is incorporated into the new province of Rizal through the Philippine Commission Act No.",
            "137 during the American Occupation."
        ],
        [
            "1903"
        ],
        [
            "Act No.",
            "942 of the Philippine Commission enacts the consolidation of the municipalities of San Mateo and Montalban (Rodriguez) with San Mateo serving as the seat of government in line with its policy of fiscal economy and centralized governance."
        ],
        [
            "1906"
        ],
        [
            "Lucas Santiago serves San Mateo as its first mayor."
        ],
        [
            "29 February 1908"
        ],
        [
            "San Mateo becomes an independent municipality under Executive Order No.",
            "20 which separates San Mateo and Montalban (Rodriguez)."
        ],
        [
            "25 June 1983"
        ],
        [
            "The Church of San Mateo is placed under the newly erected Roman Catholic Diocese of Antipolo."
        ],
        [
            "1996"
        ],
        [
            "San Mateo is raised from being a fourth class municipality in 1993 to a first class municipality under the term (1992–2001) of then Mayor Crispin \"Amo\" Santos"
        ],
        [
            "1997–1999"
        ],
        [
            "San Mateo is awarded the title of \"The Cleanest and Greenest Municipality\" in Rizal."
        ],
        [
            "2001–2006"
        ],
        [
            "San Mateo inaugurates a new town hall during the term of the late Mayor José F. Díaz"
        ],
        [
            "2001–2006"
        ],
        [
            "A new lying-in clinic in Gulod Malaya, the Pamantasan ng Bayan San Mateo and various improvement road networks are built."
        ],
        [
            "October 2003"
        ],
        [
            "Construction began on Timberland Heights, a premier mountain resort town, initially offering Mandala Residential Farm Estates 1.",
            "It is nestled in the mountains of San Mateo."
        ],
        [
            "February 2004"
        ],
        [
            "The Parish of Nuestra Señora de Aranzazu is declared a Diocesan Shrine by the Most Rev.",
            "Gabriel V. Reyes, D. D., then Bishop of the Diocese of Antipolo, it is the only church in the Philippines under this Marian title."
        ],
        [
            "July 2004"
        ],
        [
            "The Diocesan Shrine of Our Lady of Aranzazu is canonically erected."
        ],
        [
            "2007"
        ],
        [
            "San Mateo's population exceeds 150,000."
        ],
        [
            "11 August 2007"
        ],
        [
            "Budgetlane Sulitmarket, a member of Philippine Amalgamated Supermarkets Association Incorporated (PAGASA Inc.), opens to the public."
        ],
        [
            "September 2008"
        ],
        [
            "San Mateo achieved the record of \"longest parade of kakanin\" in its history."
        ],
        [
            "19 December 2008"
        ],
        [
            "Puregold Price Club opened in San Mateo at the intersection of Gen. Luna Avenue and Batasan-San Mateo Road."
        ],
        [
            "26 September 2009"
        ],
        [
            "San Mateo was devastated by Typhoon Ondoy.",
            "80% of San Mateo was submerged in muddy water."
        ],
        [
            "27 September 2011"
        ],
        [
            "Typhoon Pedring dumped heavy rains like Ondoy over Luzon including Metro Manila and nearby provinces.",
            "Floods submerged houses in several barangays of Marikina and San Mateo, including Santa Ana, Banaba, Ampid 1, and Ampid 2.",
            "The town records one death, and by 29 September 2011, the waters subsided."
        ],
        [
            "15 May 2015"
        ],
        [
            "The country's largest mall developer SM Prime Holdings opens SM City San Mateo to the public, the first full-service mall of San Mateo."
        ],
        [
            "31 May 2017"
        ],
        [
            "The image of Our Lady of Aranzazu receives a canonical coronation, being the 34th crowned Marian image in the Philippines."
        ],
        [
            "Geography"
        ],
        [
            "The town lies in the Marikina Valley.",
            "The Marikina River runs through the western portion of the municipality, while the Nangka River runs through the south, bounded by Marikina.",
            "San Mateo has lush trees in other high areas.",
            "Most of the municipality is composed of residential areas, whereas the eastern side is composed of high plateaus and foothills of the Sierra Madre Mountains."
        ],
        [
            "Barangays"
        ],
        [
            "San Mateo, Rizal Political Map.",
            "(This is subject to correction by San Mateo LGU).",
            "It shows the 15 barangays of San Mateo, Rizal and the adjacent cities/municipalities."
        ],
        [
            "San Mateo is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Barangay"
        ],
        [
            "Area (km2)"
        ],
        [
            "Population(2020 census)"
        ],
        [
            "Population density(/km2)"
        ],
        [
            "Ampid 1"
        ],
        [
            "1.316"
        ],
        [
            "27,346"
        ],
        [
            "20,794.07"
        ],
        [
            "Ampid 2"
        ],
        [
            "0.245"
        ],
        [
            "4,657"
        ],
        [
            "15,040.82"
        ],
        [
            "Banaba"
        ],
        [
            "1.382"
        ],
        [
            "27,910"
        ],
        [
            "15,595.51"
        ],
        [
            "Dulong Bayan 1"
        ],
        [
            "0.5879"
        ],
        [
            "5,229"
        ],
        [
            "8,555.88"
        ],
        [
            "Dulong Bayan 2"
        ],
        [
            "4.3"
        ],
        [
            "13,072"
        ],
        [
            "1,590"
        ],
        [
            "Guinayang"
        ],
        [
            "2.73"
        ],
        [
            "9,871"
        ],
        [
            "2,625.27"
        ],
        [
            "Guitnang Bayan 1"
        ],
        [
            "4.12"
        ],
        [
            "35,121"
        ],
        [
            "5,996.84"
        ],
        [
            "Guitnang Bayan 2"
        ],
        [
            "6.14"
        ],
        [
            "19,661"
        ],
        [
            "2,228.01"
        ],
        [
            "Gulod Malaya"
        ],
        [
            "1.394"
        ],
        [
            "12,962"
        ],
        [
            "6,143.47"
        ],
        [
            "Malanday"
        ],
        [
            "3.53"
        ],
        [
            "14,526"
        ],
        [
            "3,836.83"
        ],
        [
            "Maly"
        ],
        [
            "5.65"
        ],
        [
            "14,612"
        ],
        [
            "2,638.05"
        ],
        [
            "Pintong Bukawe"
        ],
        [
            "7.53"
        ],
        [
            "5,657"
        ],
        [
            "541.83"
        ],
        [
            "Santa Ana"
        ],
        [
            "0.8"
        ],
        [
            "10,862"
        ],
        [
            "11,470"
        ],
        [
            "Santo Niño"
        ],
        [
            "0.8711"
        ],
        [
            "12,769"
        ],
        [
            "12,650.67"
        ],
        [
            "Silangan"
        ],
        [
            "7.655"
        ],
        [
            "59,051"
        ],
        [
            "7,095.32"
        ],
        [
            "San Mateo"
        ],
        [
            "48.251"
        ],
        [
            "273,306"
        ],
        [
            "6,915.26"
        ],
        [
            "In the 2020 census, the population of San Mateo, Rizal, was 273,306 people, with a density of 5,000 inhabitants per square kilometer or 13,000 inhabitants per square mile."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Mateo, Rizal"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "7(0.3)"
        ],
        [
            "7(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "21(0.8)"
        ],
        [
            "101(4.0)"
        ],
        [
            "152(6.0)"
        ],
        [
            "188(7.4)"
        ],
        [
            "170(6.7)"
        ],
        [
            "159(6.3)"
        ],
        [
            "115(4.5)"
        ],
        [
            "47(1.9)"
        ],
        [
            "29(1.1)"
        ],
        [
            "1,005(39.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "3.5"
        ],
        [
            "4.8"
        ],
        [
            "8.1"
        ],
        [
            "18.9"
        ],
        [
            "23.5"
        ],
        [
            "26.4"
        ],
        [
            "25.5"
        ],
        [
            "24.5"
        ],
        [
            "19.6"
        ],
        [
            "10.4"
        ],
        [
            "6.4"
        ],
        [
            "174.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "San Mateo Municipal Hall"
        ],
        [
            "Population census of San MateoYearPop.±% p.a.1903 4,510—    1918 4,841+0.47%1939 6,134+1.13%1948 6,811+1.17%1960 12,044+4.86%YearPop.±% p.a.1970 29,183+9.24%1975 38,955+5.96%1980 51,910+5.91%1990 82,310+4.72%1995 99,217+3.56%YearPop.±% p.a.2000 135,603+6.93%2007 184,860+4.37%2010 205,255+3.88%2015 252,527+4.03%2020 273,306+1.57%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Mateo"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "2006  3.60"
        ],
        [
            "2009  2.18"
        ],
        [
            "2012  3.10"
        ],
        [
            "2015  5.38"
        ],
        [
            "2018  4.22"
        ],
        [
            "2021  6.64"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "E. De Los Santos Street"
        ],
        [
            "Industries"
        ],
        [
            "The industrial establishments found in San Mateo are classified as light to medium industries.",
            "Welding shops and motor pool are among the predominant industries found within the municipality.",
            "Other industrial establishments are relatively small scale, like leather craft and kiskisan.",
            "Moreover, agri-business establishments which include poultry and piggery do exist within the municipality."
        ],
        [
            "Various products are being manufactured in San Mateo.",
            "In fact, a group of different factories is found along Kambal Road, Barangay Guitnang Bayan 2.",
            "This includes San Mateo Rubber Corp. (Nikon and Durawalk Slippers), Jolly Food Corp., First Win Corp. (Slippers), and Golden Union Footwear Inc. (Evans Shoes).",
            "A Coca-Cola warehouse is also situated at Patiis Road corner GSIS Street (Daang Tubo) in Barangay Dulong Bayan 2.",
            "San Mateo also primarily manufactures gravel and sand aggregates together with other construction supplies that are found in hardware shops distributed all over the municipality."
        ],
        [
            "Commerce and trade"
        ],
        [
            "Manahan Building in Barangay Ampid 1"
        ],
        [
            "The Central Business District is strategically located amidst the concentration of settlements.",
            "A major commercial area starts from the vicinity of the public market, bounded by the national road going to Rodriguez (Montalban) and Street of Daang Bakal in Barangay Guitnang Bayan 2.",
            "This commercial zone is a conglomeration of financial institutions, a public market, restaurants/small eateries, retail stores and the like."
        ],
        [
            "Another area, which may be considered as major commercial area, is within the vicinity of De los Santos Street corner Gen. Luna Avenue, in Barangay Ampid 1.",
            "Other commercial areas extending to St. Mattheus Medical Hospital near the boundary of San Mateo and Marikina are located near Puregold San Mateo (formerly the Producer's Market) at Barangay Banaba and another at the corner of Patiis Road and Gen. Luna Avenue, in Barangay Malanday."
        ],
        [
            "SM City San Mateo along Gen. Luna Avenue in Barangay Ampid 1 adds to the list of major commercial centers of San Mateo.",
            "This SM Supermall and the very first full-service mall of San Mateo opens on May 15, 2015, serving local residents and from neighboring areas.",
            "Further boost in San Mateo's economy is expected with the mall."
        ],
        [
            "Banking"
        ],
        [
            "San Mateo has many bank branches like Banco de Oro (BDO), Bank of the Philippine Islands, Metrobank, Philippine Savings Bank (PSBank), EastWest Bank, China Bank, Philippine National Bank (PNB), Premiere Bank, Merchants Bank, Banco San Juan, Marikina Valley-San Mateo (MVSM) Bank, RCBC Savings Bank, United Coconut Planters Bank (UCPB), Banco Rodriguez, Country Builders Bank, the Real Bank (a thrift bank).",
            "Many automated teller machines in San Mateo are provided with security system such as anti-crime alarms.",
            "Security guards are also monitoring the premises of the banks in San Mateo for the safety of the customers."
        ],
        [
            "Landmarks"
        ],
        [
            "The San Mateo Arch in Rizal Province, stands as a boundary between Marikina and this town."
        ],
        [
            "Diocesan Shrine of Our Lady of Aranzazu"
        ],
        [
            "Diocesan Shrine of Our Lady of Aranzazu (Nuestra Señora de Aranzazu)"
        ],
        [
            "Our Lady of Mediatrix Shrine (in Brgy.",
            "Silangan)"
        ],
        [
            "Festivals"
        ],
        [
            "These are some of the notable events in San Mateo:"
        ],
        [
            "Events"
        ],
        [
            "Date"
        ],
        [
            "Place of Event"
        ],
        [
            "Malanday Feast"
        ],
        [
            "February 13–14"
        ],
        [
            "Patiis and Malanday"
        ],
        [
            "Ampid Fiesta: Sombrero and Walis Festival"
        ],
        [
            "May 1"
        ],
        [
            "Ampid"
        ],
        [
            "Kawan Holiday (Kab Scout of the Phil.)"
        ],
        [
            "July 21 and 22"
        ],
        [
            "All of public schools in San Mateo"
        ],
        [
            "San Mateo Festival: Parada ng Kakanin"
        ],
        [
            "September 9"
        ],
        [
            "San Mateo Plaza and San Mateo Municipal Hall Stage"
        ],
        [
            "Guitnang Bayan: Parada ng kakanin"
        ],
        [
            "September 9"
        ],
        [
            "Nuestra Señora De Aranzazu Church"
        ],
        [
            "San Mateo foundation day"
        ],
        [
            "September 21"
        ],
        [
            "Dulong Bayan Chapel"
        ],
        [
            "St. Francis of Assisi Parish Fiesta"
        ],
        [
            "October 4"
        ],
        [
            "Guinayang"
        ],
        [
            "Santa Barbara Villas 2 (SBV2) Fiesta"
        ],
        [
            "October 5"
        ],
        [
            "Santa Barbara Villas 2"
        ],
        [
            "St. Anthony Maria Zaccaria Parish Fiesta"
        ],
        [
            "July 5"
        ],
        [
            "Silangan"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "San Mateo has a variety of conveyances that provide the residents with ready means of transportation.",
            "These are public utility jeepneys, buses, tricycles, pedicabs and UV Express Service are operating in the town.",
            "These facilitate the movement of people and goods to Metro Manila and nearby towns of Rizal."
        ],
        [
            "There are six jeepney terminals in San Mateo: San Mateo Plaza, Barangay Pintong Bukawe, Barangay Banaba (Puregold), Barangay Silangan (AFP Housing & Tierra Monte) and Barangay Santo Niño (Modesta)."
        ],
        [
            "Transportation routes passing San Mateo, are Montalban-Cubao (jeepneys), Montalban-San Mateo (jeepneys), and Commonwealth, Philcoa-San Mateo (jeepneys) thru the San Mateo-Batasan Bridge.",
            "These routes traverses Quezon City, Marikina, San Mateo and Rodriguez (Montalban).",
            "The only way to get through Pintong Bukawe is through Marcos Hi-way, Cabading & Sapinit Roads in Antipolo."
        ],
        [
            "Long before the Manila Light Rail Transit System opened its services in Santolan in the Pasig-Marikina border in the early 2000s, steam train services had once served those places in the past, even before World War II."
        ],
        [
            "In Marikina, there is a street named \"Daangbakal\", also called by the names of \"Shoe Avenue Extension\", \"Munding Avenue\" and \"Bagong Silang\".",
            "There is also a similar \"Daangbakal\" in the San Mateo-Montalban (Rodriguez) area, and on the maps one can notice that the two roads should have been connected with each other.",
            "In fact, as the name suggests in Tagalog, these streets were once a single railway line.",
            "The two sides of the \"Daangbakal\" roads were once connected by a bridge in the San Mateo-Marikina border.",
            "However, as the railroad tracks have been largely ignored after the Japanese Occupation and was transformed into separate highways, the railway connection was abandoned."
        ],
        [
            "The old railroad tracks, called the Marikina Line, was connected from Tutuban station in Manila, passing through Tramo (Barangay Rosario, Pasig) coming all the way to the town of Marikina up to Montalban.",
            "On the northern end of the \"Daangbakal\" road in Montalban is a basketball court.",
            "That basketball court which stands today, surrounded by the Montalban Catholic Church and Cemetery, was once the railway station terminus of that particular line."
        ],
        [
            "The present-day Santo Niño Elementary School in Marikina was said to be a train depot.",
            "And also it was said that a railroad station once stood in the Marikina City Sports Park."
        ],
        [
            "The Marikina Line was completed in 1906, and continued its operation until 1936.",
            "It was said that the Japanese Imperial Army made use of this railway line during the Second World War.",
            "These railways were dismantled during the 1960s and were converted into ordinary roads."
        ],
        [
            "Today, the citizens are dependent on tricycles, jeepneys, Taxis, FX, Buses, and AUV's which contribute to the everyday unusual and unbearable traffic of Metropolitan Manila.",
            "Even now, there is uncertainty in the Northrail project, which links Manila to the northern provinces of Luzon, because of corruption within the project's construction."
        ],
        [
            "Aside from the Marikina Line, two other lines have existed before but are now removed permanently."
        ],
        [
            "First is the Cavite Line, which passed through Paco, Parañaque, Bacoor and up to Naic, Cavite.",
            "Completed in 1908, its operation continued until 1936."
        ],
        [
            "Second is the Antipolo Line, which passed through Santa Mesa, Mandaluyong, Pasig, Cainta, Taytay, up to Antipolo near the \"Hinulugang Taktak\" Falls.",
            "There is also a street named \"Daangbakal\" in Antipolo, where like the \"Daangbakal\" roads on Marikina and San Mateo, a railway line once existed.",
            "The railroad tracks also passed through what is now the Ortigas Avenue Extension.",
            "Its operation ceased in 1917."
        ],
        [
            "Jeepneys are the most common form of transportation within the municipality because of its convenience and low fare as compared to other forms of transportation.",
            "Other modes are tricycles and pedicabs which are used mainly to transport people and goods where regular jeepney routes are not available."
        ],
        [
            "Buses – The Marikina Auto Line Transport Corporation (MALTC) buses are the public utility buses that mainly operate in San Mateo.",
            "They operate ordinary-type buses, and newly acquired airconditioned buses which provide safe travel to passengers.",
            "There are some private buses that transport people who work at the Fortune Tobacco Plant and other nearby factories in Marikina.",
            "During the COVID-19 pandemic, the Land Transportation Franchising and Regulatory Board (LTFRB) implemented a route rationalization system for city buses.",
            "Along with MALTC, multiple bus companies operated routes from Montalban to Quezon Avenue (Route 7), and Cubao (Route 8) in Quezon City, both of which passes through San Mateo.",
            "In 2022, the LTFRB announced that they will modify Route 7 as Montalban to PITX via Quezon Avenue (Route 34), while Route 8 was cancelled because of stiff competition with smaller modes of transportation."
        ],
        [
            "Power"
        ],
        [
            "Power services in the town are provided by the Manila Electric Company (Meralco), except in the mountain barangay of Pintong Bukawe.",
            "There were 23,189 customers in San Mateo as of March 1999.",
            "Of these, 27,115 or 95.37 percent residential customers while commercial, industrial and streetlights number 971 (4.19 percent), 36 (0.15 percent), and 67 (0.29 percent), respectively.",
            "The municipality of San Mateo had a total demand of 55,355 megawatt-hours in 1998."
        ],
        [
            "San Mateo Mini-Hydro Power Plant"
        ],
        [
            "A 2.46 megawatt"
        ],
        [
            "Water"
        ],
        [
            "The main source of the municipality's water supply are deep wells, pump wells (operated by Manila Water), open wells, springs and other ground water resources.",
            "Some of the elevated parts of the municipality are under watershed protected areas since the topography is characterized by rolling to mountainous terrain."
        ],
        [
            "From 0.65%, San Mateo's water sanitation reached 100% on 2006 through the operation of Manila Water."
        ],
        [
            "North Manila Septage Treatment Plant"
        ],
        [
            "Completed and started operating in May 2007, the Manila Water North Septage Treatment Plant is located in Barangay Guitnang Bayan 2.",
            "This treats 586 cubic meters of septage a day."
        ],
        [
            "Santo Niño-Silangan Water Supply Project"
        ],
        [
            "About 42,000 residents are expected to benefit from continuous water supply once Manila Water's P320-M water supply project in San Mateo, Rizal gets completed."
        ],
        [
            "The project, dubbed as Santo Niño-Silangan Water Supply Project, is divided into two phases: Phase 1, which will serve barangays Gulod Malaya, Santo Niño and portion of Silangan, and Phase 2, which will serve the whole of Silangan and the elevated areas of Parang in Marikina."
        ],
        [
            "The project involves the construction of pumping station and reservoirs and the laying of 25 kilometers of water lines including mainlines and will benefit twelve existing subdivisions occupying a total land area of 27 hectares."
        ],
        [
            "Started in October 2007, the water project is expected to provide ample water supply to meet the 15 to 20 million liters per day (MLD) demand of the more than 13,000 households in the area."
        ],
        [
            "San Mateo Sanitary Landfill"
        ],
        [
            "In 2008, a proposal to build a 200-hectare sanitary landfill within the jurisdiction of two barangays was met with resistance by several environmental groups.",
            "The proposed landfill was to be constructed on ground area within a protected forest."
        ],
        [
            "Bucking opposition by environment activists, the operator of the San Mateo waste dump is ready to give it a go.",
            "Andy Santiago, president of the San Mateo Sanitary Landfill and Development Corp., said it has given the green light for the 19-hectare facility in Rizal province to do business."
        ],
        [
            "Communication"
        ],
        [
            "Telecommunications serve as a major link, within the sub-sectors and among other sectors of the economy, in the population centers and hinterlands.",
            "It also serves as a catalyst for growth and development.",
            "Telephone  (Fixed landline & Wireless), & DSL Broadband Internet services are being provided by the Philippines Long Distance Telephone Company (PLDT), PT&T and Converge ICT.",
            "While cellular phone services are provide by Globe Telecom, Smart Communications, and Dito Telecommunity."
        ],
        [
            "Education"
        ],
        [
            "There are public and private education institutions including colleges in San Mateo."
        ],
        [
            "Nuestra Señora de Aranzazu Parochial School"
        ],
        [
            "High schools"
        ],
        [
            "Academe Deo Favente International"
        ],
        [
            "Academia Del Tierra Grande, Inc."
        ],
        [
            "Ampid National High School"
        ],
        [
            "Center for Positive Future"
        ],
        [
            "Charles Science Integrated School of San Mateo Inc."
        ],
        [
            "Christian Care Academy"
        ],
        [
            "Christ the Lord of Harvest Academy"
        ],
        [
            "Eastern Star Academy, Inc."
        ],
        [
            "Guardian Angel Academy"
        ],
        [
            "Guinayang National High School"
        ],
        [
            "Holy Name of Mary School"
        ],
        [
            "Jose F. Diaz Memorial National High School"
        ],
        [
            "Kids' World Christian Academy High School (Annex)"
        ],
        [
            "Manila Waldorf School"
        ],
        [
            "Maria Carmeli Catholic School"
        ],
        [
            "Moses Cradle Academy"
        ],
        [
            "Nuestra Señora de Aranzazu Parochial School"
        ],
        [
            "Pintong Bukawe National High School"
        ],
        [
            "San Mateo National High School"
        ],
        [
            "Silangan National High School"
        ],
        [
            "St. Joseph Banaba"
        ],
        [
            "St. Joseph Montessori – Branch"
        ],
        [
            "St. Joseph Montessori – Main"
        ],
        [
            "St. Mary Integrated Learning School (Ampid I)"
        ],
        [
            "St. Matthew College"
        ],
        [
            "Santa Cecilia Parochial School"
        ],
        [
            "San Mateo Senior High School"
        ],
        [
            "MCCID College School Building, San Mateo, Rizal"
        ],
        [
            "Colleges and universities"
        ],
        [
            "Eastern Star Institute of Science & Technology  (TESDA accredited)"
        ],
        [
            "San Mateo Municipal College (Formerly Pamantasan ng Bayan ng San Mateo)"
        ],
        [
            "St. Matthew College"
        ],
        [
            "Special education"
        ],
        [
            "Manila Christian Computer Institute for the Deaf (MCCID)"
        ],
        [
            "Sister cities"
        ],
        [
            "These are the municipality's sister cities or municipalities."
        ],
        [
            "Local"
        ],
        [
            "Antipolo, Rizal"
        ],
        [
            "Marikina, Metro Manila"
        ],
        [
            "Quezon City, Metro Manila"
        ],
        [
            "Rodriguez, Rizal"
        ],
        [
            "Zamboanga City (2012)"
        ],
        [
            "Valenzuela, Metro Manila (2017)"
        ],
        [
            "Notable person"
        ],
        [
            "Rhea Santos"
        ],
        [
            "Makisig Morales"
        ],
        [
            "See also"
        ],
        [
            "Legislative districts of Rizal"
        ],
        [
            "References"
        ],
        [
            "^ Presidential Proclamation No.",
            "540, s. 2018 (July 25, 2018), Declaring Friday, 21 September 2018, a Special (Non-Working) Day in the Municipality of San Mateo, Province of Rizal, retrieved August 8, 2022"
        ],
        [
            "^  Municipality of San Mateo |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Richardson, Jim.",
            "\"Andres Bonifacio: Biographical notes.",
            "Part IV: August 20, 1896 - November 17, 1896\".",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ Republic Act No.",
            "11546 (March 30, 2021), An Act Reapportioning the Second Legislative District of the Province of Rizal into Three (3) Legislative Districts, retrieved August 8, 2022"
        ],
        [
            "^ The Peak Life, December 2007 Issue.",
            "A Publication of Timberland Heights"
        ],
        [
            "^"
        ],
        [
            "\"Province: Rizal\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Philippine Statistics Authority's 2015 Census of Population\".",
            "Archived from the original on 2017-07-30.",
            "Retrieved 2017-11-22."
        ],
        [
            "^"
        ],
        [
            "\"San Mateo: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 11 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Rizal\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Pending Hydropower Applications\".",
            "April 2013.",
            "Department of Energy Archived 2014-03-28 at the Wayback Machine"
        ],
        [
            "^ \"Power firm set to build eight hydro plants along Marikina River\".",
            "Lenie Lectura.",
            "January 8, 2014. Business Mirror"
        ],
        [
            "^ \"Hydrotec projects obtain permits\".",
            "Alena Mae S. Flores.",
            "March 20, 2014.",
            "Manila Standard Today"
        ],
        [
            "^ \"Big companies going into pumped storage, run-of-river power plants\".",
            "Ray S. Eñano.",
            "March 27, 2014.",
            "Manila Standard Today"
        ],
        [
            "^ Jorge C. Mateo.",
            "October 23, 2007.",
            "\"Metropolitan Waterworks and Sewerage System (MWSS) Regulatory Office\"."
        ],
        [
            "^ August 22, 2007.",
            "\"DENR Updates\" Archived June 7, 2011, at the Wayback Machine"
        ],
        [
            "^ July 1, 2008.",
            "\"P320-M water supply project in San Mateo, Rizal now underway\".",
            "Manila Water"
        ],
        [
            "^ DJ Yap.",
            "January 10, 2009.",
            "\"Plan to Build New San Mateo Landfill Hit\".",
            "Philippine Daily Inquirer Archived 2009-01-25 at the Wayback Machine"
        ],
        [
            "^ Gigi Muoz David and Erika Z. Vizcarra.",
            "February 2, 2009.",
            "\"San Mateo Dump gets the Green Light\".",
            "Manila Standard Today"
        ],
        [
            "^ Various Schools in San Mateo, Rizal Archived 2011-09-05 at the Wayback Machine – Batang San Mateo Website"
        ],
        [
            "^ List of Public Schools in San Mateo Archived 2010-07-26 at the Wayback Machine- Department of Education"
        ],
        [
            "^ \"Zamboanga City Sisterhood\".",
            "SunStar.",
            "2012.",
            "Archived from the original on April 16, 2013.",
            "Retrieved June 23, 2012."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Mateo, Rizal."
        ],
        [
            "Official website"
        ],
        [
            "San Mateo Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to San Mateo, Rizal"
        ],
        [
            "Rodriguez"
        ],
        [
            "Quezon City"
        ],
        [
            "San Mateo"
        ],
        [
            "Marikina"
        ],
        [
            "Antipolo"
        ],
        [
            "Articles Related to San Mateo, Rizal"
        ],
        [
            "vte Province of RizalAntipolo (capital and largest city)Municipalities"
        ],
        [
            "Angono"
        ],
        [
            "Baras"
        ],
        [
            "Binangonan"
        ],
        [
            "Cainta"
        ],
        [
            "Cardona"
        ],
        [
            "Jalajala"
        ],
        [
            "Morong"
        ],
        [
            "Pililla"
        ],
        [
            "Rodriguez"
        ],
        [
            "San Mateo"
        ],
        [
            "Tanay"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Component City"
        ],
        [
            "Antipolo"
        ],
        [
            "vteCalabarzon (Region IV-A)CAvite, LAguna, BAtangas, Rizal, QueZONRegional center"
        ],
        [
            "Calamba"
        ],
        [
            "Provinces"
        ],
        [
            "Batangas"
        ],
        [
            "Cavite"
        ],
        [
            "Laguna"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Lucena"
        ],
        [
            "Component cities"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Batangas City"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "Calaca"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Lipa"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tanauan"
        ],
        [
            "Tayabas"
        ],
        [
            "Trece Martires"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Antipolo"
        ],
        [
            "Batangas City"
        ],
        [
            "Imus (de jure)"
        ],
        [
            "Lucena"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Trece Martires (de facto)"
        ],
        [
            "Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alabat"
        ],
        [
            "Alaminos"
        ],
        [
            "Alfonso"
        ],
        [
            "Alitagtag"
        ],
        [
            "Amadeo"
        ],
        [
            "Angono"
        ],
        [
            "Atimonan"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Baras"
        ],
        [
            "Bauan"
        ],
        [
            "Bay"
        ],
        [
            "Binangonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Cainta"
        ],
        [
            "Calatagan"
        ],
        [
            "Calauag"
        ],
        [
            "Calauan"
        ],
        [
            "Candelaria"
        ],
        [
            "Cardona"
        ],
        [
            "Catanauan"
        ],
        [
            "Cavinti"
        ],
        [
            "Cuenca"
        ],
        [
            "Dolores"
        ],
        [
            "Famy"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Luna"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Ibaan"
        ],
        [
            "Indang"
        ],
        [
            "Infanta"
        ],
        [
            "Jalajala"
        ],
        [
            "Jomalig"
        ],
        [
            "Kalayaan"
        ],
        [
            "Kawit"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Liliw"
        ],
        [
            "Lobo"
        ],
        [
            "Lopez"
        ],
        [
            "Los Baños"
        ],
        [
            "Lucban"
        ],
        [
            "Luisiana"
        ],
        [
            "Lumban"
        ],
        [
            "Mabini"
        ],
        [
            "Mabitac"
        ],
        [
            "Macalelon"
        ],
        [
            "Magallanes"
        ],
        [
            "Magdalena"
        ],
        [
            "Majayjay"
        ],
        [
            "Malvar"
        ],
        [
            "Maragondon"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Mauban"
        ],
        [
            "Mendez"
        ],
        [
            "Morong"
        ],
        [
            "Mulanay"
        ],
        [
            "Nagcarlan"
        ],
        [
            "Naic"
        ],
        [
            "Nasugbu"
        ],
        [
            "Noveleta"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Paete"
        ],
        [
            "Pagbilao"
        ],
        [
            "Pagsanjan"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pila"
        ],
        [
            "Pililla"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Rizal"
        ],
        [
            "Rodriguez"
        ],
        [
            "Rosario (Batangas)"
        ],
        [
            "Rosario (Cavite)"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Mateo"
        ],
        [
            "San Narciso"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Sariaya"
        ],
        [
            "Silang"
        ],
        [
            "Siniloan"
        ],
        [
            "Taal"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Talisay"
        ],
        [
            "Tanay"
        ],
        [
            "Tanza"
        ],
        [
            "Taysan"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Ternate"
        ],
        [
            "Tiaong"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "Unisan"
        ],
        [
            "Victoria"
        ],
        [
            "Barangays"
        ],
        [
            "Batangas (List)"
        ],
        [
            "Cavite (List)"
        ],
        [
            "Laguna (List)"
        ],
        [
            "Quezon (List)"
        ],
        [
            "Rizal (List)"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Mateo,_Rizal&oldid=1218817616\""
        ],
        [
            "Categories: San Mateo, RizalMunicipalities of RizalPopulated places established in 15711571 establishments in the PhilippinesPopulated places on the Marikina RiverHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: missing periodicalAll articles with dead external linksArticles with dead external links from May 2018Articles with permanently dead external linksCS1 maint: numeric names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}