{
    "name": "San Jose",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Jose, Northern Samar"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°31′52″N 124°29′13″E﻿ / ﻿12.531°N 124.487°E﻿ / 12.531; 124.487"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Northern Samar, Philippines"
        ],
        [
            "For the other places named \"San Jose\" in the Philippines, see San Jose (disambiguation)."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"San Jose, Northern Samar\" – news · newspapers · books · scholar · JSTOR (April 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesSan JoseMunicipalityMunicipality of San Jose"
        ],
        [
            "FlagMap of Northern Samar with San Jose highlightedOpenStreetMapSan JoseLocation within the PhilippinesCoordinates: 12°31′52″N 124°29′13″E﻿ / ﻿12.531°N 124.487°E﻿ / 12.531; 124.487CountryPhilippinesRegionEastern VisayasProvinceNorthern SamarDistrict"
        ],
        [
            "1st districtFoundedJuly 25, 1949Barangays16"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorDamian T. Luzon Jr. • Vice MayorGoldie S. Ballesta • RepresentativePaul R. Daza • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Merlita S. Evangelista• Silvino T. Balasolla• Harlan A. Tomenio• Ernesto E. Nualla• Virgilio V. Esidera• Marcelino A. Mora• Electorado P. Somoray• Jose Agripino S. BallestaDILG Masterlist of Officials"
        ],
        [
            " • Electorate12,994 voters (2022)Area • Revenue₱ 106.9 million (2020) • Assets₱ 209.8 million (2020) • Expenditure₱ 92.05 million (2020) • Liabilities₱ 49.09 million (2020)Service provider • ElectricityNorthern Samar Electric Cooperative (NORSAMELCO)Time zoneUTC+8 (PST)ZIP code6402PSGC084819000IDD : area code +63 (0)55Native languagesWaray TagalogWebsitewww.sanjose-nsamar.gov.ph"
        ],
        [
            "San Jose, officially the Municipality of San Jose (Waray: Bungto han San Jose; Tagalog: Bayan ng San Jose), is a 5th class municipality in the province of Northern Samar, Philippines.",
            "According to the 2020 census, it has a population of 17,641 people."
        ],
        [
            "It is located at the north central part of the province, about 19 kilometres (12 mi) west of Catarman, the provincial capital, and about 30 kilometres (19 mi) east of Allen, where the ferry terminal is which connects the islands of Luzon, Samar, Leyte, and Mindanao via the Pan-Philippine Highway (formerly the Maharlika Highway).",
            "It is approximately 150 kilometres (93 mi) north-north-east of Tacloban City, the Regional Center of the Eastern Visayas."
        ],
        [
            "Politically, the municipality is bounded on the north by the Philippine Sea, on the east by the Municipality of Bobon, on the south by the Municipality of Victoria and on the west by the Municipality of Rosario."
        ],
        [
            "History"
        ],
        [
            "The Municipality of San Jose grew from a place that was then covered with bushes, shrubs, zacates, and marshes, where wild chicken, locally known as ilajas, abounded.",
            "It was then called carangian, being the site where hunters assembled their trap, known as carang, to catch wild chickens.",
            "In time, the word carangan was corrupted and the place began to be known as Carangian.",
            "Due to favorable economic opportunities, people migrated to the place.",
            "As the population grew, it became a barrio within the administrative jurisdiction of the Municipality of Bobon known as Carangian."
        ],
        [
            "With the construction of a deep-sea port, steamers and ships from Manila and other countries began to dock in Carangian, which due to its strategic location and the presence of the well-protected deep-sea port, quickly became the main port entry of Northern Samar.",
            "As its economy boomed, the barrio aspired to become an independent municipality as early as 1932.",
            "In that year, the Governor of Samar, Pedro Arteche, conducted a plebiscite for the conversion of Barrio Carangian into a municipality.",
            "Due to the overwhelming negative votes in the Poblacion of Bobon and some other barrios, that was not realized."
        ],
        [
            "Before the elections of 1949, the leaders of Carangian took advantage of a rift between President Elpidio Quirino and José Dira Avelino, President of the Senate, to separate from Bobon.",
            "A delegation was formed under the leadership of Eladio T. Balite, Representative of the first district of Samar.",
            "The delegation was dispatched to Manila to lobby for the independence of Carangian.",
            "After more than a month of going from office to office in Manila, the delegation succeeded in having the Barrio of Carangian created into the Municipality of San Jose.",
            "Eugenio Perez, Speaker of the House, was also instrumental in the creation of the new municipality.",
            "Thus, on July 25, 1949, by virtue of Executive Order No.",
            "248 of the then President Elpidio Quirino, Carangian together with eleven other barrios became the new municipality of San Jose, named in honor of the late Jose Tagros Balite Sr, then Mayor of Bobon."
        ],
        [
            "Geography"
        ],
        [
            "San Jose's total land area of 2,985 hectares (7,380 acres) is generally underlain by well-bedded and moderately undulating terrain.",
            "The rock unit is probably part of the Mawo Volcanics, which is widespread in Northern Samar.",
            "The terrain is diversely oriented with inclination angles ranging from 10 degrees to 14 degrees.",
            "In the surveyed area, mangrove swamps dominate the western part of the municipality which extends to its northern coastline.",
            "In fact, more than half of the land area in the town proper, which is located at the northern coastline of the municipality are reclaimed lands from these swamplands."
        ],
        [
            "Being a coastal town, it has several islets within its municipal waters off its northern coast: Cabaungon (or Cabanongan) Grande, Cabaungon Pequiño, Tandang, Pangilala, Puropangdan, Matungko, and Maghungaw.",
            "They are plentiful in fishes, crustaceans, and other marine products.",
            "These islands along the coast of San Jose are protected as part of the Biri Larosa Protected Landscape and Seascape."
        ],
        [
            "The municipality is in a valley bounded on the east by the Palusong Mountain Range moving south and on the west by the Hitaasan Mountain Range.",
            "The land is generally alluvial flat and swamplands which has an elevation of less than 10 metres (33 ft) above sea level, while going south, south easterly, the physiography abruptly rises to moderately rugged hills with a peak of 68 metres (223 ft).",
            "The drainage system in the area generally flows north-east towards Carangian Channel.",
            "Vegetation in this area generally consists of mangrove trees and shrubs, cogonal growth, and coconuts.",
            "The flat areas are planted with rice, corn and coconuts."
        ],
        [
            "There are small flat and level areas along Barangay Dao and Barangay Geratag creeks.",
            "There are also wide coastal swamps.",
            "Most of the agricultural land areas are located along the valley between Palusong Mountain Range, near Barangay Aguadahan, and Barangay Geratag in the east, and Hitaasan Mountain Range near Barangay Bagong Sabang and Barangay Bonglas in the west."
        ],
        [
            "Bodies of water"
        ],
        [
            "The Carangian Channel is a marine channel along its northern shore, separating Samar Island from Cabaungon Island."
        ],
        [
            "There are four large natural streams flowing through or within the municipality of San Jose: Gengarog River, Sinamangan River, Bobon River, and Nahalugan River."
        ],
        [
            "Off the National Highway about 10 minutes walk toward the hillside, there are the Honeybee Falls.",
            "The falls are on private property, but accessible with permission."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Jose, Northern Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "84(3.3)"
        ],
        [
            "59(2.3)"
        ],
        [
            "58(2.3)"
        ],
        [
            "55(2.2)"
        ],
        [
            "93(3.7)"
        ],
        [
            "133(5.2)"
        ],
        [
            "149(5.9)"
        ],
        [
            "125(4.9)"
        ],
        [
            "155(6.1)"
        ],
        [
            "165(6.5)"
        ],
        [
            "140(5.5)"
        ],
        [
            "136(5.4)"
        ],
        [
            "1,352(53.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.1"
        ],
        [
            "13.6"
        ],
        [
            "15.8"
        ],
        [
            "16.1"
        ],
        [
            "21.7"
        ],
        [
            "25.5"
        ],
        [
            "26.6"
        ],
        [
            "25.1"
        ],
        [
            "24.8"
        ],
        [
            "25.8"
        ],
        [
            "22.7"
        ],
        [
            "20.1"
        ],
        [
            "255.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "San Jose is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aguadahan"
        ],
        [
            "Bagong Sabang"
        ],
        [
            "Balite"
        ],
        [
            "Bonglas"
        ],
        [
            "Da-o"
        ],
        [
            "Gengarog"
        ],
        [
            "Geratag"
        ],
        [
            "Layuhan"
        ],
        [
            "Mandugang"
        ],
        [
            "P. Tingzon"
        ],
        [
            "San Lorenzo"
        ],
        [
            "Tubigdanao"
        ],
        [
            "Barangay North (Poblacion)"
        ],
        [
            "Barangay South (Poblacion)"
        ],
        [
            "Barangay East (Poblacion)"
        ],
        [
            "Barangay West (Poblacion)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San JoseYearPop.±% p.a.1960 10,517—    1970 8,631−1.95%1975 8,751+0.28%1980 10,388+3.49%1990 10,773+0.36%1995 12,556+2.91%2000 13,564+1.67%2007 15,185+1.57%2010 16,079+2.10%2015 17,561+1.69%2020 17,641+0.09%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Jose"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  32.20"
        ],
        [
            "2009  46.12"
        ],
        [
            "2012  48.09"
        ],
        [
            "2015  40.03"
        ],
        [
            "2018  32.10"
        ],
        [
            "2021  23.67"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "The first person to have been elected to the post of mayor of the newly created Municipality of San Jose (which at that time included now independent Municipality of Biri and some parts adjoining to form the Municipality of Rosario) is Roque H. Dato (1949–51).He was appointed as the first mayor of san jose after its creation as a municipality.",
            "He is the father of Bayani A. Dato who also assumed the post of mayor of San Jose from 1968 to 1986, and from 1988 to 1995."
        ],
        [
            "Don Francisco S. Evaristo, former Mayor of Bobon, was the next mayor of San Jose from 1952 to 1955.",
            "Other persons to have been elected mayor are: Agustin Pondemira (1956–67); Felipe Ballesta (appointed as OIC after Edsa revolution) (1986–88) Lazaro A. Ballesta (2001–07), and Damian Luzon Jr. (2007–16)."
        ],
        [
            "The current Mayor of San Jose is Clarence E. Dato."
        ],
        [
            "Facilities"
        ],
        [
            "The Port of San Jose is a reinforced concrete general purpose pier handling passengers and domestic cargoes, situated in Barangay North.",
            "The pier is 138 metres (453 ft) long and 12 feet (3.7 m) wide with a controlling depth of 25 feet (7.6 m) alongside, with 8 rubber fenders and 9 mooring bit.",
            "Its storage facilities include an open storage of 940 square metres (10,100 sq ft), 2 transit sheds with total area of 744 square metres (8,010 sq ft), and 3 private warehouse with a total area of 1,060 square metres (11,400 sq ft)."
        ],
        [
            "Notable personalities"
        ],
        [
            "Carangian (San Jose) is home to local notable persons in politics the Carangianons are proud of, to wit:"
        ],
        [
            "Edilberto Aguilar del Valle is the second person, after the first woman Governor of Northern Samar Irene Balite, to have assumed the post of Governor of Northern Samar after the separation of Northern Samar from former Samar Province constituting the whole Samar Island, including some island towns thereof.",
            "Later he assumed the higher level post, as the first and the only Assemblyman hailed from Northern Samar among the group of Regional Assemblymen representing Region VIII (Eastern Visayas) to the Interim Batasang Pambansa (or Interim National Assembly) during the Marcos regime, thus leaving the governorship to his brother who immediately succeeded him.",
            "He then served as the Assemblyman of the lone (defunct) district of Northern Samar to the Regular Batasang Pambansa (or Regular National Assembly) until abolished by President Corazon Cojuangco-Aquino.",
            "He likewise served as a Member of the Provincial Board of Samar/Northern Samar."
        ],
        [
            "Reynaldo Aguilar del Valle succeeded the governorship from his brother making him the third Governor of Northern Samar.",
            "Like his brother, he served as a Member of the Provincial Board of Samar/Northern Samar."
        ],
        [
            "Bayani A. Dato became Vice Governor of Northern Samar under the governorship of Harlin C. Abayon.",
            "He unsuccessfully ran against Abayon in the 1998 Philippine general election for Congressman to represent the first legislative district of Northern Samar in the 11th Congress of the Philippines."
        ],
        [
            "Golda Papel Somoray - Ballesta is the widow of Atty Lazaro A. Ballesta.",
            "After his death, she assumed the vacant post left by her husband as Member of the Provincial Board of Northern Samar.",
            "Currently, she is still a Board Member after winning the 2013 Local Elections."
        ],
        [
            "Lazaro Anonuevo Ballesta was a Member of the Provincial Board of Northern Samar for three(3) consecutive terms, 1992–2001.",
            "In March, 1998, when then incumbent Governor Harlin Cast.",
            "Abayon ran against his Vice Governor, Atty.",
            "Bayani A. Dato, for the position of Congressman to represent the first district of Northern Samar in the House of Representatives, automatically resigning from office in accordance with the election rules in force at that time; thus, leaving their respective positions vacant, Ballesta promptly took his oath of office as a Governor of the Provincial Government of Northern Samar, and served from late March, 1998 to June 30, 1998, being the highest ranked and most qualified provincial official to succeed, pursuant to the rules of succession provided for in the Local Government Code of 1991, thus technically becoming the third provincial governor coming from this Municipality.",
            "In 2001, he ran and won as Mayor of San Jose against then incumbent Mayor Damian T. Luzon, Jr.",
            "He won his re-election when he ran unopposed in 2004.",
            "In 2007, he did not run for his third term.",
            "Instead, he ran for Congress to represent the first district of Northern Samar, which he lost to then Senior Board Member and former Governor Paul Daza, son of former Representative Raul Daza."
        ],
        [
            "Luis Romines Dasmarinas was elected as a Member of the Provincial Board of Northern Samar.",
            "A cousin to former Governors of Northern Samar Atty.",
            "Edilberto A. del Valle, Sr. and Atty.",
            "Reynaldo A. del Valle, Sr."
        ],
        [
            "Rodolfo Robis del Valle was a Member of the Provincial Board of Northern Samar.",
            "He is the eldest child of former governor of Northern Samar, Atty.",
            "Reynaldo A. del Valle, Sr."
        ],
        [
            "Alita Verano Esidera-Rosales former Mayor of the capital town of Catarman, 2007–2010.",
            "She is the first woman to have been elected to the post (but is second only to hold the post).",
            "She is the wife of Catarman Mayor and former Member of the Provincial Board of Northern Samar, Francisco C. Rosales, Jr."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Jose |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"San Jose, Northern Samar : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 6 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Northern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Republic Act No.",
            "4221"
        ],
        [
            "Places adjacent to San Jose, Northern Samar"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Rosario"
        ],
        [
            "San Jose"
        ],
        [
            "Bobon"
        ],
        [
            "Victoria"
        ],
        [
            "vte Province of Northern SamarCatarman (capital and largest municipality)Municipalities"
        ],
        [
            "Allen"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Capul"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Gamay"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lope de Vega"
        ],
        [
            "Mapanas"
        ],
        [
            "Mondragon"
        ],
        [
            "Palapag"
        ],
        [
            "Pambujan"
        ],
        [
            "Rosario"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Victoria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Jose,_Northern_Samar&oldid=1218367769\""
        ],
        [
            "Categories: Municipalities of Northern SamarPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}