{
    "name": "San Andres",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Andres, Catanduanes"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°35′46″N 124°05′57″E﻿ / ﻿13.5961°N 124.0992°E﻿ / 13.5961; 124.0992"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Catanduanes, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"San Andres, Catanduanes\" – news · newspapers · books · scholar · JSTOR (December 2011) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bicol Region, PhilippinesSan Andres"
        ],
        [
            "CalolbonMunicipalityMunicipality of San Andres"
        ],
        [
            "FlagMotto: Calolbon Mahalon.",
            "Lalong Pauswagon!Map of Catanduanes with San Andres highlightedOpenStreetMapSan AndresLocation within the PhilippinesCoordinates: 13°35′46″N 124°05′57″E﻿ / ﻿13.5961°N 124.0992°E﻿ / 13.5961; 124.0992CountryPhilippinesRegionBicol RegionProvinceCatanduanesDistrict"
        ],
        [
            "Lone districtFounded1853Named forSt.",
            "Andrew the ApostleBarangays38"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPeter C. Cua • Vice MayorLeo Z. Mendoza • RepresentativeHector S. Sanchez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Medin T. ZafeFelix G. Romero Jr.Alan S. del ValleRamiro B. Noble Jr.Gregorio S. SalvadorRommel A. AntonioRoel A. BagadiongNenita B. Vargas"
        ],
        [
            " • Electorate28,564 voters (2022)Area • Revenue₱ 145.6 million (2020) • Assets₱ 386.1 million (2020) • Expenditure₱ 144.6 million (2020) • Liabilities₱ 116 million (2020)Service provider • ElectricityFirst Catanduanes Electric Cooperative (FICELCO)Time zoneUTC+8 (PST)ZIP code4810PSGC052008000IDD : area code +63 (0)52Native languagesCentral BikolTagalogWebsitewww.sanandres-catanduanes.gov.ph"
        ],
        [
            "San Andres, officially the Municipality of San Andres, is a 3rd class municipality in the province of Catanduanes, Philippines.",
            "According to the 2020 census, it has a population of 38,480 people."
        ],
        [
            "Luyang Cave"
        ],
        [
            "It is formerly known as Calolbon."
        ],
        [
            "San Andres is 18 kilometres (11 mi) from Virac."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"San Andres, Catanduanes\" – news · newspapers · books · scholar · JSTOR (August 2022) (Learn how and when to remove this message)"
        ],
        [
            "Spanish Era"
        ],
        [
            "The town's first leader on record was Juan Gazang who served for eight years between 1798 and 1806, with the exception of three other capitans- Cristobal (1806), Felix Santelices (1835–1842) and Teodoro Santelices (1843–1847) -the rest served two terms.",
            "The last captain was Alipio Vargas (1899–1900)."
        ],
        [
            "American Era"
        ],
        [
            "The American Era started with a controversial municipal president, Deogracias Belmonte (1901–1903).",
            "He was branded as pro-American by the insurrectos headed by Comandante Florencio Eras.",
            "Belmonte was almost beheaded on December 8, 1899, in the cemetery of Pandan, Catanduanes.",
            "However, the father of then Senator Jose O. Vera saved him from execution."
        ],
        [
            "The term \"Municipal President\" for town heads was last used by Roberto Iñigo (1931–1935)."
        ],
        [
            "During the Commonwealth of the Philippines, the town head of Calolbon was Emiliano Surban (1935–1937) who was the first to assume the title of \"Municipal Mayor\"."
        ],
        [
            "World War II"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"San Andres, Catanduanes\" – news · newspapers · books · scholar · JSTOR (August 2022) (Learn how and when to remove this message)"
        ],
        [
            "Felizardo Santelices was appointed mayor of Calolbon (in 1944–1946) by President Jose P. Laurel."
        ],
        [
            "During the WWII Japanese invasion, Santelices experienced a brutal and almost fatal eventuality.",
            "It began on October 5, 1944, when a Japanese tora-tora plane was forced to land on a rice field near the town center.",
            "Santelices conducted an inquiry, and although his first urge was to kill the pilot, he sent him instead to the Japanese headquarters in Virac, the capital of Catanduanes, to avoid potential disaster.",
            "He knew that Philippine troops and recognized guerrillas would have killed the pilot themselves, and the Japanese reprisal would have been a merciless burning of the town and surrounding areas as well as a massacre of civilians."
        ],
        [
            "The Japanese thanked Santelices for returning the pilot, but the Philippine Commonwealth troops and the recognized guerrillas, accusing him of being pro-Japanese, had the mayor arrested and brought to trial.",
            "He was convicted and sentenced to die and to be interred with a Japanese pilot who made a forced landing in the province of Camarines Sur.",
            "The condemned Japanese aviator was decapitated first, and Santelices was then placed on the execution block.",
            "Seconds before the sword was lowered, the wife of the slayer  cried out: \"Save him...save him... save him!",
            "he is an innocent man!\"",
            "So, Santelices was freed."
        ],
        [
            "Major Salvador Rodolfo organized the Catanduanes Liberation Forces.",
            "It was the backbone of the resistance movement in Catanduanes.",
            "It performed numerous ambuscades against the Japanese Imperial Army and conducted intelligence gathering, which was necessary in paving the way for the eventual liberation of the province by the combined American and Filipino troops.",
            "During his exploits as a guerilla leader, Rodolfo was rumored several times to have been killed in battle but time and again he keeps on coming back to destroy every vestige of enemy control in the province of Catanduanes, hence he was called “Phantom” or the Man who never dies."
        ],
        [
            "On February 8, 1945, when Rodolfo was about to declare the independence of the province after he and his men killed every Japanese Imperial Army and burned every Japanese garrison in Catanduanes, one of his men approached him and said that there were Japanese reinforcements on board 2 vessels approaching the island.",
            "He then talked to his men, most of whom were wounded and exhausted, he said:"
        ],
        [
            "\"Japanese reinforcements are coming.",
            "I have two options for you, we can go to the hills and save ourselves and wait there until the Americans arrive, but I assure you that all civilians left behind will be massacred by the incoming Japanese, or we can repeat what happened in the Battle of Thermopylae and stand our ground.",
            "Most of us will die, but we will live forever in the pages of history as the men who fought for the liberation of Catanduanes\"."
        ],
        [
            "With that, everybody decided to stand their ground and fight the incoming Japanese.",
            "They went to their posts to wait for the enemy's arrival but then, as if by providence, American planes arrived and bombed the Japanese vessels.",
            "Rodolfo declared independence of the entire province on February 8, 1945."
        ],
        [
            "Post War Era"
        ],
        [
            "After Philippine independence in 1946 and Catanduanes became an independent province, the first elected municipal mayor of Calolbon was Jose B. Surban (1947–1948).",
            "He was followed by Jose de la Providencia (1948–1951) Francisco Imperial (1952–1955) and Aristeo Arcilla (1956–1963)."
        ],
        [
            "During the term of Augusto T. Antonio (1964–1979), Calolbon was wired for electricity, and the town's infrastructure was greatly improved.",
            "Augusto T. Antonio was succeeded by Antonio Romano, MD (1980–1986) and then by Pedro Surban (1986–1987) as \"Officer in Charge\" of the town."
        ],
        [
            "Surban was succeeded by Lydia T. Romano (1987–1995), the first woman ever elected as mayor of Calolbon.",
            "Then Joseph Cua succeeded her.",
            "After Cua, Dr. Aly Romano, the son of ex-mayors Antonio and Lydia Romano was elected mayor.",
            "Then Leo Mendoza succeeded him in 2007.",
            "In the 2010 Elections, Dr. Antonio Romano won the mayoral post again after defeating Mendoza with a margin of 1,000 plus votes.",
            "Peter C. Cua succeeded Romano in 2013."
        ],
        [
            "Republic Act No.",
            "3948"
        ],
        [
            "In 1964, a bill was presented to the Philippine Congress to rename the town San Andres in honor of its patron, Saint Andrew the Apostle.",
            "This bill was approved as Republic Act No.",
            "3948 on June 18 that same year."
        ],
        [
            "Many Calolbonganons loved the old name, a name used since time immemorial and unique to the entire archipelago.",
            "They were upset that there had never been a referendum vote."
        ],
        [
            "\"The change of Calolbon to San Andres without consulting the townspeople\", said one outspoken native, \"is a rape of democracy.\"",
            "But for those who were deeply religious and very much devoted to St. Andrew, the change from Calolbon to San Andres was no different from changing a pagan name to a Christian one."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "San Andres is subdivided into 38 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Agojo"
        ],
        [
            "Alibuag"
        ],
        [
            "Asgad (Juan M. Alberto)"
        ],
        [
            "Bagong Sirang"
        ],
        [
            "Barihay"
        ],
        [
            "Batong Paloway"
        ],
        [
            "Belmonte (Poblacion)"
        ],
        [
            "Bislig"
        ],
        [
            "Bon-ot"
        ],
        [
            "Cabungahan"
        ],
        [
            "Cabcab"
        ],
        [
            "Carangag"
        ],
        [
            "Catagbacan"
        ],
        [
            "Codon"
        ],
        [
            "Comagaycay"
        ],
        [
            "Datag"
        ],
        [
            "Divino Rostro (Poblacion)"
        ],
        [
            "Esperanza (Poblacion)"
        ],
        [
            "Hilawan"
        ],
        [
            "Lictin"
        ],
        [
            "Lubas"
        ],
        [
            "Manambrag"
        ],
        [
            "Mayngaway"
        ],
        [
            "Palawig"
        ],
        [
            "Puting Baybay"
        ],
        [
            "Rizal"
        ],
        [
            "Salvacion (Poblacion)"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Roque (Poblacion)"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Cruz (Poblacion)"
        ],
        [
            "Sapang Palay (Poblacion)"
        ],
        [
            "Tibang"
        ],
        [
            "Timbaan"
        ],
        [
            "Tominawog"
        ],
        [
            "Wagdas (Poblacion)"
        ],
        [
            "Yocti"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for San Andres, Catanduanes"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "138(5.4)"
        ],
        [
            "83(3.3)"
        ],
        [
            "74(2.9)"
        ],
        [
            "50(2.0)"
        ],
        [
            "108(4.3)"
        ],
        [
            "165(6.5)"
        ],
        [
            "202(8.0)"
        ],
        [
            "165(6.5)"
        ],
        [
            "190(7.5)"
        ],
        [
            "186(7.3)"
        ],
        [
            "188(7.4)"
        ],
        [
            "183(7.2)"
        ],
        [
            "1,732(68.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.8"
        ],
        [
            "11.9"
        ],
        [
            "13.5"
        ],
        [
            "13.8"
        ],
        [
            "20.5"
        ],
        [
            "25.2"
        ],
        [
            "27.4"
        ],
        [
            "26.2"
        ],
        [
            "26.1"
        ],
        [
            "24.7"
        ],
        [
            "20.7"
        ],
        [
            "18.5"
        ],
        [
            "245.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San AndresYearPop.±% p.a.1903 5,783—    1918 9,080+3.05%1939 14,398+2.22%1948 17,370+2.11%1960 19,083+0.79%1970 23,885+2.27%1975 24,848+0.80%1980 25,072+0.18%1990 26,727+0.64%1995 30,242+2.34%2000 31,463+0.85%2007 33,781+0.99%2010 35,779+2.11%2015 36,779+0.53%2020 38,480+0.89%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of San Andres, Catanduanes, was 38,480 people, with a density of 230 inhabitants per square kilometre or 600 inhabitants per square mile."
        ],
        [
            "Religion"
        ],
        [
            "In 1989, according to the Catholic Directory of the Philippines published by the Catholic Bishops' Conference of the Philippines (CBCP), the town of San Andres had a total population of 18,369, the majority of which were Roman Catholic.",
            "Others belonged to diverse religious denominations that include Jehovah's Witnesses, the Iglesia ni Cristo, the Church of Jesus Christ of Latter-day Saints, as well as born-again and Fundamentalist Protestant groups."
        ],
        [
            "The entire town of Calolbon was originally under the jurisdiction of Saint Andrew the Apostle Parish.",
            "In the early 1950s, however, Saint Isidore Parish was established in the large neighborhood of Manambrag, and now includes all of the farming community of San Andres plus some barrios from outlying areas of the town.",
            "Saint Andrew the Apostle Church currently hosts has a number of Pious Associations, many of which are dedicated to the Blessed Virgin Mary."
        ],
        [
            "Clergy"
        ],
        [
            "Rev.",
            "Fr.",
            "Cornelio de Jesús (1798–1892) was the first recorded parish priest.",
            "He ministered to the town's spiritual needs for 29 years.",
            "He was responsible for founding the parish church, which was partially constructed of limestone, and he chose Saint Andrew as its titular patron since most people in Calolbon were fishermen."
        ],
        [
            "The priests who saw the end of the Spanish Rule and the advent of the American Era was Rev.",
            "Fr.",
            "Pío Imperial (1893–1902).",
            "During the next two decades, two dynamic clerics guided and strengthened the Catholic faithful of this town.",
            "They were Rev.",
            "Fr.",
            "Roberto Floranza (1910–1920) and Rev.",
            "Fr.",
            "Dominiciano Camu (1920–1930).",
            "Fr.",
            "Floranza concretely improved the church building, as it was badly damaged by a typhoon a month before he assumed his office as cura of the town.",
            "Floranza was a talented musician who organized a liturgical choir that was often invited to perform at social gatherings such as biladas and dotocas and at other public events."
        ],
        [
            "Our Lady of Sorrows of Paloway"
        ],
        [
            "Main article: Our Lady of Sorrows of Batong Paloway"
        ],
        [
            "Manolo A. de los Santos, the Bishop of Virac, said that the Catholic Bishops' Conference of the Philippines confirmed on June 13, 2008, the existence of a miraculous \"growing\" century-old stone (now 3 inches in height) in Paloway, San Andres, Catanduanes, Bicol.",
            "The stone bears the image of the Blessed Virgin Mary as Our Lady of Sorrows and is said to heal illnesses: “What is unexplainable is not that the stone grew in size over the years, but the fact that the image of the Virgin was never distorted as it grew.\"",
            "Called Batong Paloway (\"Stone of Paloway\"), it enshrined above the altar of the chapel of Our Lady of Sorrows, a \"de facto shrine\" in Barangay Paloway."
        ],
        [
            "The image on the stone is actually \"Our Lady of the Finger\" (Nuestra Señora del Dedo), as it shows Mary pointing her right index finger to the left from underneath her cloak.",
            "Originally a Spanish depiction, the title was little known in the Philippines at the time of the stone's discovery, leading the people to associate the Paloway icon with the more familiar Our Lady of Sorrows."
        ],
        [
            "The Church has no official statement on the devotion to the icon, but it does not hinder it.",
            "Every Friday, a Mass is being celebrated in Paloway Chapel for the benefit of devotees.",
            "On the evening of Maundy Thursday, youth from neighboring parishes go on pilgrimage to visit the icon."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Andres"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  39.20"
        ],
        [
            "2009  36.63"
        ],
        [
            "2012  29.93"
        ],
        [
            "2015  44.12"
        ],
        [
            "2018  25.49"
        ],
        [
            "2021  24.38"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "See also"
        ],
        [
            "List of renamed cities and municipalities in the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Andres |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Catanduanes\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"San Andres, Catanduanes : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 December 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Catanduanes\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"'Miraculous' stone with image of Mary 'grows' in Bicol\", gmanews.tv.",
            "Accessed 2 August 2022."
        ],
        [
            "^ \"Our Lady of Sorrows\", Sanandres.catanduanes.gov.ph.",
            "Accessed 2 August 2022."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "Some part of this article was taken from SAN ANDRES: A PLACE CALLED HOME, by James Santelices, 1996.",
            "Patterson, CA.",
            "U.S.A."
        ],
        [
            "External links"
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "2007 Philippine Census Information"
        ],
        [
            "Places adjacent to San Andres, Catanduanes"
        ],
        [
            "Caramoran"
        ],
        [
            "Caramoan, Camarines Sur / Maqueda Channel"
        ],
        [
            "San Andres"
        ],
        [
            "Virac"
        ],
        [
            "Lagonoy Gulf"
        ],
        [
            "vte Province of CatanduanesVirac (capital and largest municipality)Municipalities"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Baras"
        ],
        [
            "Bato"
        ],
        [
            "Caramoran"
        ],
        [
            "Gigmoto"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "San Andres"
        ],
        [
            "San Miguel"
        ],
        [
            "Viga"
        ],
        [
            "Virac"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Andres,_Catanduanes&oldid=1229743161\""
        ],
        [
            "Category: Municipalities of CatanduanesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from December 2011All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles needing additional references from August 2022All articles with specifically marked weasel-worded phrasesArticles with specifically marked weasel-worded phrases from August 2022Wikipedia articles needing clarification from August 2022All articles with unsourced statementsArticles with unsourced statements from August 2022Official website different in Wikidata and WikipediaPages using the Kartographer extension"
        ]
    ]
}