{
    "name": "San Antonio",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "San Antonio, Northern Samar"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°24′50″N 124°16′44″E﻿ / ﻿12.414°N 124.279°E﻿ / 12.414; 124.279"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Northern Samar, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"San Antonio, Northern Samar\" – news · newspapers · books · scholar · JSTOR (April 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesSan Antonio"
        ],
        [
            " Dalupiri MunicipalityMunicipality of San AntonioDalupiri Island"
        ],
        [
            "FlagMap of Northern Samar with San Antonio highlightedOpenStreetMapSan AntonioLocation within the PhilippinesCoordinates: 12°24′50″N 124°16′44″E﻿ / ﻿12.414°N 124.279°E﻿ / 12.414; 124.279CountryPhilippinesRegionEastern VisayasProvinceNorthern SamarDistrict"
        ],
        [
            "1st districtFounded1904Named forSt.",
            "Anthony of PaduaBarangays10"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorManuel M. Esponilla • Vice MayorRudy S. Baguioso • RepresentativePaul R. Daza • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Rhoda G. Lucero• Zosimo A. Agaton• Mark Neil N. Formaran• Ruel C. Solana• Nelson M. Obeda• Nelita N. Ang• Flordeliza J. Esquilon• Thelma D. SeratoDILG Masterlist of Officials"
        ],
        [
            " • Electorate7,075 voters (2022)Area • Revenue₱ 65.34 million (2020) • Assets₱ 118.9 million (2020) • Expenditure₱ 61.63 million (2020) • Liabilities₱ 26.18 million (2020)Service provider • ElectricityNorthern Samar Electric Cooperative (NORSAMELCO)Time zoneUTC+8 (PST)ZIP code6407PSGC084817000IDD : area code +63 (0)55Native languagesCebuano Waray TagalogWebsitewww.sanantonio-nsamar.gov.ph"
        ],
        [
            "San Antonio, officially the Municipality of San Antonio (Waray: Bungto san San Antonio; Cebuano: Lungsod sa San Antonio; Tagalog: Bayan ng San Antonio), is a 5th class municipality in the province of Northern Samar, Philippines.",
            "According to the 2020 census, it has a population of 8,882 people."
        ],
        [
            "Its territory is coterminous with Dalupiri Island, just off the western coast of Samar Island at the south end of the San Bernardino Strait.",
            "The island's white beaches are considered an \"undisturbed paradise\" and future \"premier tourist destination\" in the Eastern Visayas region.",
            "San Antonio is also unique, as it is the only municipality in Northern Samar that also speaks Cebuano due to the influx of Boholano and Cebuano settlers in the past.",
            "The locals speak Waray which is the predominant language of Northern Samar and it is the main lingua franca in the island."
        ],
        [
            "History"
        ],
        [
            "Payag"
        ],
        [
            "In the early 19th century the settlers from the mainland of Samar found the island an ideal ground for fishing and bird hunting.",
            "They come to the island just to catch fish and hunt birds and go back to the mainland of Samar after a handful of catch.",
            "People from Bohol and Cebu came to the island in the second half of the 19th century and introduced a method of catching fish using net, commonly known as \"laya\".",
            "With its introduction, the name \"Manoglaya\" was born, which literally means mano nga paraglaya or \"fishermen using laya\"."
        ],
        [
            "As new settlers came and built new communities in the island, they called the island as \"Sugod-sugod\", a Cebuano derivative meaning \"just to start or begin\".",
            "Later, name was changed to \"Matabia\", referring to the knife-shape of the island.",
            "No one knows now why it was changed that way, neither folklores nor historical data reveal the ways and wherefore of the change of its name to Dalupiri Island."
        ],
        [
            "In 1904, the Municipality of San Antonio of the province of Samar in Dalupiri Island was established.",
            "The Municipality of San Antonio named after its patron saint Anthony of Padua."
        ],
        [
            "Geography"
        ],
        [
            "Dalipiri top view"
        ],
        [
            "Dalupiri Island lies in the east central periphery of the Philippine archipelago.",
            "It is bounded by San Bernardino Strait in the north and east, Samar Sea in the south, and Capul Island in west.",
            "It is approximately 5 nautical miles from the Pacific Ocean and sits near the entrance along the Paso de Acapulco, otherwise known as San Bernardino Strait.",
            "It has 28 kilometres (17 mi) long white sand beach around the island."
        ],
        [
            "Dalupiri Island is a 2,700 hectare island of gently rolling hills, mostly of coconut vegetation and shrubbery.",
            "It is home to white beaches, caves, and the Lagbangan Lake."
        ],
        [
            "Topography"
        ],
        [
            "The island is composed largely of low and extremely rugged hills and small lowland areas.",
            "The island is endowed with relatively rich and fertile soil that allow most crops to be cultivated, but presently it is utilized mostly for coconut plantations."
        ],
        [
            "The highest point of the island is in its central southern portion with a maximum elevation of 35 metres (115 ft) above sea level."
        ],
        [
            "Climate"
        ],
        [
            "The island has no distinct dry or wet season but it has pronounced rainfall from October to January.",
            "The heaviest precipitation occurs in November.",
            "May is relatively the driest month."
        ],
        [
            "Climate data for San Antonio, Northern Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "84(3.3)"
        ],
        [
            "59(2.3)"
        ],
        [
            "58(2.3)"
        ],
        [
            "55(2.2)"
        ],
        [
            "93(3.7)"
        ],
        [
            "133(5.2)"
        ],
        [
            "149(5.9)"
        ],
        [
            "125(4.9)"
        ],
        [
            "155(6.1)"
        ],
        [
            "165(6.5)"
        ],
        [
            "140(5.5)"
        ],
        [
            "136(5.4)"
        ],
        [
            "1,352(53.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.1"
        ],
        [
            "13.6"
        ],
        [
            "15.8"
        ],
        [
            "16.1"
        ],
        [
            "21.7"
        ],
        [
            "25.5"
        ],
        [
            "26.6"
        ],
        [
            "25.1"
        ],
        [
            "24.8"
        ],
        [
            "25.8"
        ],
        [
            "22.7"
        ],
        [
            "20.1"
        ],
        [
            "255.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "San Antonio is politically subdivided into 10 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Burabod"
        ],
        [
            "Dalupirit"
        ],
        [
            "Manraya"
        ],
        [
            "Pilar"
        ],
        [
            "Rizal"
        ],
        [
            "San Nicolas"
        ],
        [
            "Vinisitahan"
        ],
        [
            "Ward I (Poblacion)"
        ],
        [
            "Ward II (Poblacion)"
        ],
        [
            "Ward III (Poblacion)"
        ],
        [
            "The town center (poblacion) is divided into three small barangays: Poblacion Ward I, Poblacion Ward II, and Poblacion Ward III."
        ],
        [
            "Barangay San Nicolas, named after its patron Saint Nicolas, is home to picturesque rock formation along the coast.",
            "Barangay Rizal is home to a solar spring and cave.",
            "Barangay Pilar is the southernmost tip of the island where a fish sanctuary is located.",
            "This is the home of palatable seashells and other seafood."
        ],
        [
            "Barangay Burabod's major livelihood is boat-building, fishing, copra and dynamite blasting cap manufacturing."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of San AntonioYearPop.±% p.a.1903 2,059—    1918 3,994+4.52%1939 6,421+2.29%1948 6,781+0.61%1960 5,898−1.16%1970 6,291+0.65%1975 7,250+2.89%1980 7,008−0.68%1990 7,164+0.22%1995 7,984+2.05%2000 7,915−0.19%2007 8,151+0.41%2010 8,877+3.15%2015 9,058+0.39%2020 8,882−0.39%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of San Antonio"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  28.30"
        ],
        [
            "2009  32.49"
        ],
        [
            "2012  36.56"
        ],
        [
            "2015  43.19"
        ],
        [
            "2018  26.81"
        ],
        [
            "2021  19.50"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "San Antonio is one of the manufacturing centers of dynamite chemicals like ammonium nitrate, used in the manufacture of blasting caps that are sold in the other provinces of Samar island.",
            "It was learned that the island has been tagged by the police as one of the areas in the manufacture of the dynamite blasting caps."
        ],
        [
            "Chief Supt.",
            "Abner Cabalquinto, Regional VIII Police Director, disclosed that the police operatives in Northern Samar confiscated 50 bags of ammonium nitrate in the town of San Antonio.",
            "However, the suspects were able to escape and alluded arrest by the police."
        ],
        [
            "Because of the prevalence of homemade dynamite, blast fishing is a perennial problem in the region."
        ],
        [
            "The Dalupiri Ocean Power Plant is a proposed tidal fence generating station across the Dalupiri Passage between the islands of Dalupiri and Samar."
        ],
        [
            "Tourism"
        ],
        [
            "Dalupiri Beach"
        ],
        [
            "San Antonio de Padua Festival"
        ],
        [
            "Because of Dalupiri Island's pristine white sand beach, Republic Act No.",
            "9458 declared San Antonio, together with the island towns of Biri, Capul, and San Vicente, as eco-tourism zones in May 2007."
        ],
        [
            "With its coral reefs, Dalupiri island is ideal for scuba diving, snorkeling, sailing, yachting, jet skiing, para-sailing and marine life observation."
        ],
        [
            "Manoglaya Festival"
        ],
        [
            "A cultural-tourism festival held in the town of San Antonio from the 9th to the 12th of June annually, celebrating the fishing skills of the townfolks.",
            "The festival composed of cultural performances, street dance, beauty search and exhibit complemented with “sugod-sugod sa plaza”, a nightly entertainment of music and other performances from leading local performers in the community."
        ],
        [
            "Transportation"
        ],
        [
            "Airport"
        ],
        [
            "Dalupiri Airport, also known as San Antonio Airport, is an airstrip in San Antonio in the Eastern Visayas region of Philippines.",
            "Its construction was approved by the Senate and House of Representatives of the Philippines on August 8, 2004.",
            "This airport is still under constructions and not yet operational to the general public, local resident and Island tourist."
        ],
        [
            "Seaport"
        ],
        [
            "San Antonio town proper Seaport the central part of the island premier gateway to the seaport of the town of Victoria.",
            "This two seaports are the busiest port connecting the Island and the mainland of Samar, providing main transport system to the island tourist and local resident."
        ],
        [
            "There are also several seaport in the nearby barangay that also the gateway of the Island to the mainland land of Samar, in northern part of the island is the Vinisitahan Seaport and the western coast is the Dalupiri Seaport both to seaport in the town of Allen,Northern Samar and in the southern coast of the Island is the Burabod Seaport to the town of San Isidro, Northern Samar."
        ],
        [
            "Land transport system"
        ],
        [
            "Circumferential Road"
        ],
        [
            "The main transportation going to the different part of the Island is the motorcycle where local called it as \"honda\" regardless of the manufacturer of the motorcycle.",
            "While going through the town proper there are several \"padyak\" as commonly called by the local residents; it is a bicycle driven cart."
        ],
        [
            "Education"
        ],
        [
            "Private schools"
        ],
        [
            "Pearl Island Academy"
        ],
        [
            "Spring View Adventist Academy"
        ],
        [
            "Public schools"
        ],
        [
            "Secondary school:"
        ],
        [
            "San Antonio Agricultural and Vocational School"
        ],
        [
            "Elementary schools:"
        ],
        [
            "San Antonio Central Elementary School"
        ],
        [
            "Vinisitahan Elementary School"
        ],
        [
            "Dalupirit Elementary School"
        ],
        [
            "San Nicolas Elementary School"
        ],
        [
            "Rizal Elementary School"
        ],
        [
            "Manraya Elementary School"
        ],
        [
            "Pilar Elementary School"
        ],
        [
            "Burabod Elementary School"
        ],
        [
            "Healthcare"
        ],
        [
            "San Antonio District Hospital"
        ],
        [
            "Municipal Health Center"
        ],
        [
            "Barangay Health Center"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of San Antonio |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^  https://elevationmap.net/ward-i-san-antonio-northern-samar-ph-1001556708.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Vicente S. Labro (26 August 2011).",
            "\"Northern Samar offers undisturbed paradise islets\".",
            "Philippine Daily Inquirer.",
            "Retrieved 15 April 2013."
        ],
        [
            "^"
        ],
        [
            "\"San Antonio, Northern Samar : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 6 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Northern Samar\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ .",
            "Manila Bulletin.",
            "Retrieved on 2012-09-16"
        ],
        [
            "^ .",
            "Dynamite Fishing in San Antonio.",
            "Retrieved on 2012-09-16"
        ],
        [
            "^ .",
            "Yahoo Group.",
            "Retrieved on 2012-09-16"
        ],
        [
            "^ Judah S. Aliposa.",
            "Why Blast Fishing thrives in Samar.",
            "San Antonio Northern Samar.",
            "Retrieved on 2012-09-16"
        ],
        [
            "^ \"Tidal Fences\".",
            "Wave and tidal power.",
            "Fujita Research.",
            "July 2000.",
            "Retrieved 15 April 2013."
        ],
        [
            "^ AN ACT DECLARING THE ISLAND-TOWNS OF BIRI, CAPUL, SAN ANTONIO AND SAN VICENTE, ALL IN THE PROVINCE OF NORTHERN SAMAR AS ECO-TOURISM ZONES.",
            "Philippine Congress.",
            "Approved May 15, 2007.",
            "Retrieved on 2013-04-15"
        ],
        [
            "^ The LawPhil Project: RA 9330 AN ACT ESTABLISHING THE SAN ANTONIO AIRPORT IN THE ISLAND-MUNICIPALITY OF SAN ANTONIO, PROVINCE OF NORTHERN SAMAR AND APPROPRIATING FUNDS THEREFOR.",
            "Retrieved on 2012-09-22"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to San Antonio, Northern Samar."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Facebook:"
        ],
        [
            "Places adjacent to San Antonio, Northern Samar"
        ],
        [
            "San Bernardino Strait"
        ],
        [
            "Dalupiri Pass / Allen"
        ],
        [
            "Capul / Capul Pass"
        ],
        [
            "San Antonio"
        ],
        [
            "Dalupiri Pass / Victoria"
        ],
        [
            "Samar Sea"
        ],
        [
            "Dalupiri Pass / San Isidro"
        ],
        [
            "vte Province of Northern SamarCatarman (capital and largest municipality)Municipalities"
        ],
        [
            "Allen"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Capul"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Gamay"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lope de Vega"
        ],
        [
            "Mapanas"
        ],
        [
            "Mondragon"
        ],
        [
            "Palapag"
        ],
        [
            "Pambujan"
        ],
        [
            "Rosario"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Victoria"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=San_Antonio,_Northern_Samar&oldid=1192177821\""
        ],
        [
            "Categories: Municipalities of Northern SamarIsland municipalities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: missing titleCS1 errors: bare URLCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2013All articles needing additional referencesCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}