{
    "name": "Santa Barbara",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa Barbara, Iloilo"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°49′23″N 122°32′04″E﻿ / ﻿10.82306°N 122.53444°E﻿ / 10.82306; 122.53444"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Iloilo, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Santa Barbara, Iloilo\" – news · newspapers · books · scholar · JSTOR (August 2011) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Western Visayas, PhilippinesSanta BarbaraMunicipalityMunicipality of Santa BarbaraSanta Barbara Parish Church and Convent"
        ],
        [
            "FlagSealNickname: Heritage Center of Western VisayasMap of Iloilo with Santa Barbara highlightedOpenStreetMapSanta BarbaraLocation within the PhilippinesCoordinates: 10°49′23″N 122°32′04″E﻿ / ﻿10.82306°N 122.53444°E﻿ / 10.82306; 122.53444CountryPhilippinesRegionWestern VisayasProvinceIloiloDistrict"
        ],
        [
            "2nd districtFounded1617Named forSaint BarbaraBarangays60"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorDennis S. Superficial, M.D.",
            "• Vice MayorIsabelo J. Maquino • RepresentativeMichael B. Gorriceta • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ramon Julius S. SodustaNeil S. SuperficialChristine Marie D. RoblesMa.",
            "Salvacion Portia A. MaquinoCrisanto C. ColadaCharles Louigi S. BadonTimoteo M. PadillaRamon G. Sullano"
        ],
        [
            " • Electorate42,339 voters (2022)Area • Revenue₱ 222.2 million (2020) • Assets₱ 732.4 million (2020) • Expenditure₱ 167.3 million (2020) • Liabilities₱ 274.7 million (2020)Service provider • ElectricityIloilo 1 Electric Cooperative (ILECO 1)Time zoneUTC+8 (PST)ZIP code5002PSGC063043000IDD : area code +63 (0)33Native languagesHiligaynon Karay-a Ati Tagalog"
        ],
        [
            "Santa Barbara, officially the Municipality of Santa Barbara (Hiligaynon: Banwa sang Santa Barbara, Tagalog: Bayan ng Santa Barbara),  is a 2nd class municipality in the province of Iloilo, Philippines.",
            "According to the 2020 census, it has a population of 67,630 people."
        ],
        [
            "Santa Barbara is a part of the Metro Iloilo–Guimaras area, centered on Iloilo City."
        ],
        [
            "History"
        ],
        [
            "The Augustinian Archives, Vol.",
            "17–18, which recorded the missionary achievements of the Augustinian missionaries, mentions that in 1617 the missionaries ministered a community then known as Catmon, a name derived from a fruit tree which was an imposing landmark, which sat on a rich and fertile plain traversed by the Salug (now Tigum) and Aganan rivers, producing rice, corn, sugar, mongo and tobacco.",
            "Then Catmon was only a “Visita Catmon” of Jaro vicariate."
        ],
        [
            "In 1760, Catmon was established as an independent parish, whose patron saint was Santa Barbara and the settlement became a “pueblo” named after her.",
            "Its total population at the time was 15,094."
        ],
        [
            "In 1845, its population was 19,719 and it covered an area which are now the Municipalities of Maasin, Janiuay, Cabatuan, Alimodian, San Miguel, Zarraga, New Lucena and parts of Leganes and Pavia."
        ],
        [
            "When the Philippine Revolution broke out on Luzon in 1896, it did not spread immediately to Iloilo.",
            "The Spanish authorities thought that they could keep the Ilonggos loyal to Spain.",
            "Governador–General Basilio Agustin organized the Volunteer Militia in Iloilo to enlist Ilonggos to fight the Tagalog rebels.",
            "Being a “mestizo” and having occupied the highest office in his town, Martin Teofilo Delgado was appointed commander of the “voluntaries” in Santa Barbara."
        ],
        [
            "Unknown to the Spaniards, however, Delgado had already become a “revolucionario”.",
            "On October 28, 1898, he publicly declared himself for the Revolution and seized the municipal building.",
            "The Revolutionary Government of the Visayas was organized and on November 17, 1898, was formally inaugurated at the town plaza of Santa Barbara.",
            "A large crowd hailing from many places across Iloilo gathered for the historic occasion.",
            "The Philippine flag was raised for the first time outside of Luzon."
        ],
        [
            "The officials of the Revolutionary Government were Roque Lopez, president; Vicente Franco, vice president and secretary of the interior; Venancio Concepcion, secretary of finance; Ramon Avanceňa, secretary of state; Jovito Yusay, secretary of justice; Julio Hernandez, secretary of war; Fernando Salas, secretary general.",
            "General Martin T. Delgado was chosen General –in-Chief of the Revolutionary Forces."
        ],
        [
            "Santa Barbara became the headquarters of the Revolutionary Forces and from here, Gen. Delgado launched the campaign to liberate the whole province which culminated in the surrender of Iloilo City by Governor-General de los Rios on December 24, 1898."
        ],
        [
            "The victory against Spain was short-lived as the Philippine–American War followed.",
            "Gen. Delgado led the same army against Americans from 1899 to 1901.",
            "Delgado was forced to surrender on February 2, 1901."
        ],
        [
            "Upon the establishment of the civil government, Martin Delgado was appointed as the first provincial Governor of Iloilo and was elected to the same position in the first elections held in 1903.",
            "Santa Barbara became a town under American regime and was incorporated into a municipality by the Commonwealth Government.",
            "The town soon began to progress."
        ],
        [
            "In 1948, Barangay Tuburan-Solbud was transferred to Zarraga, Iloilo."
        ],
        [
            "Towards the end of the last term allowed to him by the Philippine Constitution,Ferdinand Marcos placed the Philippines under martial law in 1972."
        ],
        [
            "Booming developments in Santa Barbara began after the opening of the Iloilo International Airport in Cabatuan in 2007, as Santa Barbara serves as a thoroughfare to Iloilo City.",
            "Developers, including Megaworld's Global-Estate Resorts, were drawn to Santa Barbara and invested in a mixed-use development near the airport.",
            "Santa Barbara is also poised to become a hub for provincial and regional government offices, as the Iloilo Provincial Government is gradually relocating government offices from Iloilo City to their new site in Santa Barbara, aiming to alleviate congestion in the city."
        ],
        [
            "Geography"
        ],
        [
            "Santa Barbara has a land area of 13,196 hectares (32,610 acres), ranks 29th as to size among the 42 municipalities of the province and occupies 1.5% of all lands in the Province of Iloilo.",
            "Almost 100% of Santa Barbara's land is cultivated and alienable or disposable.",
            "It is 15 kilometres (9.3 mi) from Iloilo City."
        ],
        [
            "The topography of Santa Barbara varies from slightly rolling hills to almost flat or gradually inclined plains, sliced by Tigum River at its centremost, which flows from the north-west to the southeast and the Aganan River in the southern section."
        ],
        [
            "Land Use"
        ],
        [
            "Basically, Santa Barbara is an agricultural town with 84.75% or 6,568.19 hectares (16,230.4 acres) devoted to agriculture.",
            "The rolling hills, amounting to 155.99 hectares (385.5 acres), are unsuitable to farming and are utilized as pasture and open grassland.",
            "The built-up areas within the poblacion and the barangay areas total 678.98 hectares (1,677.8 acres) or 8.761%.",
            "Also included in this category are the areas utilized for commercial, institutional purposes, parks and open space.",
            "Agro-industrial area is 101.928 has.",
            "or 1.315%, industrial area is .069 % or 5.330 has., utilities or roads comprise 150.853 has.",
            "or 1.946% .",
            "The area for the cemeteries is 4.720 has.",
            "or .061 % and bodies of water is 1.084% or 84 hectares."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Santa Barbara, Iloilo"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "19(0.7)"
        ],
        [
            "17(0.7)"
        ],
        [
            "26(1.0)"
        ],
        [
            "37(1.5)"
        ],
        [
            "119(4.7)"
        ],
        [
            "191(7.5)"
        ],
        [
            "258(10.2)"
        ],
        [
            "260(10.2)"
        ],
        [
            "248(9.8)"
        ],
        [
            "196(7.7)"
        ],
        [
            "97(3.8)"
        ],
        [
            "39(1.5)"
        ],
        [
            "1,507(59.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "7.2"
        ],
        [
            "5.2"
        ],
        [
            "8.3"
        ],
        [
            "11.9"
        ],
        [
            "22.3"
        ],
        [
            "26.5"
        ],
        [
            "28.3"
        ],
        [
            "28.2"
        ],
        [
            "27.3"
        ],
        [
            "26.4"
        ],
        [
            "18.7"
        ],
        [
            "11.8"
        ],
        [
            "222.1"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "There is a distinct climate in this municipality, which is ideal for planting of multiple crops.",
            "It has a type “C” (moist ) rain sufficiently distributed with almost 4 ½ dry months or first –type climate with two distinct seasons of six months."
        ],
        [
            "The average annual rainfall is 137.47 centimetres (54.12 in).",
            "The average temperature is 27.9 °C (82.2 °F).",
            "This municipality is not within the country's typhoon belt although tropical storms and occasional typhoons pass through it."
        ],
        [
            "Barangays"
        ],
        [
            "Santa Barbara is politically subdivided into 60 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Agusipan"
        ],
        [
            "Agutayan"
        ],
        [
            "Bagumbayan"
        ],
        [
            "Balabag"
        ],
        [
            "Balibagan Este"
        ],
        [
            "Balibagan Oeste"
        ],
        [
            "Ban-ag"
        ],
        [
            "Bantay"
        ],
        [
            "Barangay Zone I (Poblacion)"
        ],
        [
            "Barangay Zone II (Poblacion)"
        ],
        [
            "Barangay Zone III (Poblacion)"
        ],
        [
            "Barangay Zone IV (Poblacion)"
        ],
        [
            "Barangay Zone V (Poblacion)"
        ],
        [
            "Barangay Zone VI (Poblacion)"
        ],
        [
            "Barasan Este"
        ],
        [
            "Barasan Oeste"
        ],
        [
            "Binangkilan"
        ],
        [
            "Bitaog-Taytay"
        ],
        [
            "Bolong Este"
        ],
        [
            "Bolong Oeste"
        ],
        [
            "Buayahon"
        ],
        [
            "Buyo"
        ],
        [
            "Cabugao Norte"
        ],
        [
            "Cabugao Sur"
        ],
        [
            "Cadagmayan Norte"
        ],
        [
            "Cadagmayan Sur"
        ],
        [
            "Cafe"
        ],
        [
            "Calaboa Este"
        ],
        [
            "Calaboa Oeste"
        ],
        [
            "Camambugan"
        ],
        [
            "Canipayan"
        ],
        [
            "Conaynay"
        ],
        [
            "Daga"
        ],
        [
            "Dalid"
        ],
        [
            "Duyanduyan"
        ],
        [
            "Gen. Martin T. Delgado"
        ],
        [
            "Guno"
        ],
        [
            "Inangayan"
        ],
        [
            "Jibao-an"
        ],
        [
            "Lacadon"
        ],
        [
            "Lanag"
        ],
        [
            "Lupa"
        ],
        [
            "Magancina"
        ],
        [
            "Malawog"
        ],
        [
            "Mambuyo"
        ],
        [
            "Manhayang"
        ],
        [
            "Miraga-Guibuangan"
        ],
        [
            "Nasugban"
        ],
        [
            "Omambog"
        ],
        [
            "Pal-agon"
        ],
        [
            "Pungsod"
        ],
        [
            "San Sebastian"
        ],
        [
            "Sangcate"
        ],
        [
            "Tagsing"
        ],
        [
            "Talanghauan"
        ],
        [
            "Talongadian"
        ],
        [
            "Tigtig"
        ],
        [
            "Tungay"
        ],
        [
            "Tuburan"
        ],
        [
            "Tugas"
        ],
        [
            "Migration from Santa Barbara to Mindanao"
        ],
        [
            "Migration occurred in the 20th century to Mindanao in the 1940s under Manuel Roxas who was from Panay.",
            "Thousands migrated throughout the 1940s and 1950s as part of a resettlement movement sponsored by the government.",
            "Today, many Santa Barbaranon are now living in Mindanao, with a huge presence in:"
        ],
        [
            "Cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "General Santos"
        ],
        [
            "Kidapawan City"
        ],
        [
            "Koronadal City, South Cotabato"
        ],
        [
            "Tacurong City, Sultan Kudarat"
        ],
        [
            "Municipalities"
        ],
        [
            "Banga, South Cotabato"
        ],
        [
            "Columbio, Sultan Kudarat"
        ],
        [
            "Esperanza, Sultan Kudarat"
        ],
        [
            "Isulan, Sultan Kudarat"
        ],
        [
            "Kabacan, Cotabato"
        ],
        [
            "Lake Sebu, South Cotabato"
        ],
        [
            "Midsayap, Cotabato"
        ],
        [
            "M’lang, Cotabato"
        ],
        [
            "Norala, South Cotabato"
        ],
        [
            "Pikit, Cotabato"
        ],
        [
            "Polomolok, South Cotabato"
        ],
        [
            "Santo Niño, South Cotabato"
        ],
        [
            "Surallah, South Cotabato"
        ],
        [
            "Tampakan, South Cotabato"
        ],
        [
            "Tantangan, South Cotabato"
        ],
        [
            "T’boli, South Cotabato"
        ],
        [
            "Tulunan, Cotabato"
        ],
        [
            "Tupi, South Cotabato"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Santa BarbaraYearPop.±% p.a.1903 15,149—    1918 28,467+4.30%1939 35,406+1.04%1948 21,951−5.17%1960 23,458+0.55%1970 27,858+1.73%1975 30,662+1.94%1980 32,693+1.29%1990 37,730+1.44%1995 39,667+0.94%2000 46,076+3.26%2007 51,075+1.43%2010 55,472+3.05%2015 60,215+1.57%2020 67,630+2.31%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Santa Barbara, Iloilo, was 67,630 people, with a density of 510 inhabitants per square kilometre or 1,300 inhabitants per square mile."
        ],
        [
            "The population of Santa Barbara mostly speaks Kinaray-a.",
            "Hiligaynon is also spoken as a secondary language.",
            "Tagalog and English are also spoken."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Santa Barbara"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  14.70"
        ],
        [
            "2009  13.54"
        ],
        [
            "2012  13.14"
        ],
        [
            "2015  17.28"
        ],
        [
            "2018  11.38"
        ],
        [
            "2021  11.02"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Santa Barbara is a major municipality with a high annual income within Metro Iloilo.",
            "It serves as a gateway to Iloilo City as it hosts the access road to Iloilo International Airport.",
            "The municipality is home to various large commercial establishments, including the newly opened Wilcon Depot, SUVIL Town Center, SM Savemore, and the upcoming Shophouse District.",
            "These commercial developments contribute to the economic growth of the area."
        ],
        [
            "A significant project currently underway in Santa Barbara is the development of Santa Barbara Heights by Megaworld's Global-Estate Resorts, Inc.",
            "This 173-hectare (430-acre) mixed-use development encompasses residential, commercial, and office buildings, an international school, residential villages, and more.",
            "The project aims to enhance the town's livability and attract investment opportunities."
        ],
        [
            "Moreover, Santa Barbara is set to become a hub for provincial and regional government offices.",
            "The new Iloilo Province Government Center, located in Barangay Bolong Oeste, will house offices such as the Department of Health (DOH), Department of the Interior and Local Government (DILG), Office of Civil Defense (OCD), and PhilHealth, among others.",
            "The government center will also feature commercial areas, including business process outsourcing (BPO) companies and hotels.",
            "There is a proposal to transfer the provincial capital from Iloilo City to Santa Barbara, as it is seen as a more strategic location for the whole province.",
            "This move aims to accelerate further development in the metropolitan area outside Iloilo City, fostering growth and progress in the region."
        ],
        [
            "Transportation"
        ],
        [
            "The total road network is 159.60 kilometres (99.17 mi); 117.20 kilometres (72.82 mi) of which are barangay roads, 25.49 kilometres (15.84 mi) provincial roads, 9.06 kilometres (5.63 mi) municipal streets and 7.85 kilometres (4.88 mi) national highways."
        ],
        [
            "In July 2007, the new Iloilo International Airport, located in Cabatuan and Santa Barbara, Iloilo was opened to the public.",
            "As a result, access to air transportation has significantly improved.",
            "Before, the plying of taxis in the municipality is an uncommon sight to most Santa Barbaranhon's but with the construction and operation of the New Iloilo Airport the town started progressing economically more and more every year."
        ],
        [
            "In the past few years, there have been proposals for the revival of the defunct Panay Railways, which would include a train station in Santa Barbara.",
            "It will re-connect the town to Iloilo City, Roxas City, and Malay, Aklan."
        ],
        [
            "Landmarks"
        ],
        [
            "Santa Barbara Church"
        ],
        [
            "Santa Barbara Convent"
        ],
        [
            "General Martin Teofilo Delgado Statue"
        ],
        [
            "Iloilo Golf Course and Country Club"
        ],
        [
            "Roman Catholic Church and Convent"
        ],
        [
            "One of the better restored and preserved churches in the province, Santa Barbara Church is an excellent example of the Filipino baroque colonial architecture.",
            "It is a neoclassical church where General Martin T. Delgado of the Visayan Revolutionary Government convened the junta that raised the first of cry revolution against Spain in Iloilo.",
            "The church was dedicated to the towns patron saint, Santa Barbara last December 3, 2015.",
            "It was also declared as a National Historical Landmark in 1991, National Museum in 2015, and Philippine National Treasure also in 2015 because of the importance of the church and convent in the history of the Philippines."
        ],
        [
            "Cry of Santa Barbara Marker"
        ],
        [
            "This lies in the same site where the Filipino Flag was first raised outside Luzon.",
            "The event is now popularity known as Cry of Santa Barbara, one which recognizes the heroism and bravery of General Martin T. Delgado and his Liberating Army.",
            "This marker is the anchor of the Town's important role in the Philippine History."
        ],
        [
            "Roman Catholic Cemetery"
        ],
        [
            "One of the oldest landmarks in the town.",
            "Its facade bears the mark of the Spanish influence in the country and considered as one of the strongest structure in the town.",
            "It was constructed in 1845."
        ],
        [
            "Catmon Tree"
        ],
        [
            "A tree with thick, green foliage and distinctly big, white flowers, this is where the town was first named after.",
            "Standing alone at the front, left side of the Municipal Hall Building, the Catmon Tree is the only one of its kind that can be found in the town now."
        ],
        [
            "Flagpole"
        ],
        [
            "In front of the Municipal Hall building, stood a 120-feet flagpole amidst a well manicured mini-park.",
            "This was constructed in time with the 1998 Philippine Centennial Celebration and it flies the biggest Philippine Flag outside Luzon.",
            "This flag is one of the only five giant flags in the country."
        ],
        [
            "Santa Barbara Plaza Victory plaza"
        ],
        [
            "Nestled in the heart of the town and landscaped in time for the 1998 Philippine Centennial, this is considered as a favorite hang-out of young and old especially during afternoons and early evenings.",
            "It has two main historical features which include the Bandstand and the Rizal Monument.",
            "The Bandstand, an octagonal-shaped structure was constructed in 1925 and since then served as venue to various political gatherings and other social activities.",
            "Another prominent structure with historical value in the plaza is the monument of Dr. Jose Rizal and the Propagandist."
        ],
        [
            "The Santa Barbara plaza is one of the finest, and most beautiful plazas in the Philippines.",
            "It is also where the Seat of the Republic of the Visayas was declared on November 17, 1898, headed by president Roque Lopez.",
            "The plaza was also the site where the first Philippine flag was raised outside Luzon on December 25, 1898, followed by the plaza libertad in Metro Iloilo also in the same date.",
            "The plaza was also declared as a Historical Landmark in 2015."
        ],
        [
            "General Martin Delgado Monument"
        ],
        [
            "A bronze statue, facing the Municipal Hall Building in the north-western entrance of the \"Victory Plaza\".",
            "The monument is a tribute to the town's most distinguished son and the greatest revolutionary hero Visayas has ever produced, Gen. Martin T. Delgado.",
            "The statue which was unveiled in time with the 1998 Centennial Celebration is an unfading memorial of the gallantry and patriotism of Gen. Delgado and his revolutionary forces."
        ],
        [
            "Iloilo Golf and Country Club"
        ],
        [
            "Carved on a 35 hectares of plain and rolling hills, the 18-hole golf course in Barangay San Sebastian claims an undisputed pre-eminence in golfing history.",
            "Asia's largest golfing publication \"Golf Digest\" called Santa Barbara Golf Course as the oldest course in the Philippines and one of the oldest courses in Asia.",
            "Built in 1907 by a group of British expatriates working on the Panay Railways system, it distinguishes itself from other clubs as not only a place for recreation but a historical landmark as well."
        ],
        [
            "Centennial Museum and Convention Center"
        ],
        [
            "Constructed in 1998 as part of the Centennial Freedom Trail Site Project of the Philippine Centennial Commission, the museum houses antiques, artifacts and photos which tells the story of Santa Barbara's proud historical heritage."
        ],
        [
            "Santa Barbara Irrigation Dam"
        ],
        [
            "Constructed in 1926, the irrigation dam is the first gravity irrigation system in the Visayas that has revolutionized farming.",
            "This is the oldest irrigation system in the country."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Santa Barbara |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"An act to transfer the barrio of Tuburan-Solbud from the municipality of Santa Barbara to the municipality of Zarraga, both of the province of Iloilo\".",
            "LawPH.com.",
            "Retrieved April 8, 2011."
        ],
        [
            "^ Mackerras, Colin, ed.",
            "(2004).",
            "Ethnicity in Asia.",
            "London: RoutledgeCurzon.",
            "p. 143.",
            "ISBN 0-203-38046-0."
        ],
        [
            "^ \"Alfred McCoy, Dark Legacy: Human rights under the Marcos regime\".",
            "Ateneo de Manila University.",
            "September 20, 1999."
        ],
        [
            "^ Abinales, P.N.",
            "; Amoroso, Donna J.",
            "(2005).",
            "State and society in the Philippines.",
            "Lanham, MD: Rowman & Littlefield Publishers.",
            "ISBN 978-0742510234.",
            "OCLC 57452454."
        ],
        [
            "^ \"Gone too soon: 7 youth leaders killed under Martial Law\".",
            "Rappler.",
            "Retrieved June 15, 2018."
        ],
        [
            "^ \"Martyrs & Heroes: Pablo Fernandez\".",
            "Bantayog ng mga Bayani.",
            "June 3, 2023.",
            "Retrieved December 19, 2023."
        ],
        [
            "^ Sunnexdesk (May 10, 2018).",
            "\"Guv leads groundbreaking for new DOH-Western Visayas office\".",
            "SunStar Publishing Inc. Retrieved January 19, 2024."
        ],
        [
            "^ Momblan, Gail (May 26, 2019).",
            "\"Iloilo donates lot for DILG reg'l office\".",
            "Philippine News Agency.",
            "Retrieved January 19, 2024."
        ],
        [
            "^ a b c d \"General Features\".",
            "Official Website of Santa Barbara, Iloilo.",
            "March 11, 2008.",
            "Retrieved March 1, 2013."
        ],
        [
            "^"
        ],
        [
            "\"Santa Barbara: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 3, 2020."
        ],
        [
            "^"
        ],
        [
            "\"Province: Iloilo\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved November 12, 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Iloilo\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Momblan, Gail (May 26, 2019).",
            "\"Iloilo donates lot for DILG reg'l office\".",
            "www.pna.gov.ph.",
            "Retrieved September 8, 2022."
        ],
        [
            "^ \"You are being redirected...\" www.panaynews.net.",
            "Retrieved September 8, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa Barbara, Iloilo."
        ],
        [
            "Official website"
        ],
        [
            "Santa Barbara, Iloilo"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Santa Barbara, Iloilo"
        ],
        [
            "Cabatuan"
        ],
        [
            "New Lucena"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Zarraga"
        ],
        [
            "San Miguel"
        ],
        [
            "Pavia"
        ],
        [
            "Leganes"
        ],
        [
            "vteMetro Iloilo–GuimarasIloilo"
        ],
        [
            "Iloilo"
        ],
        [
            "Cabatuan"
        ],
        [
            "Leganes"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Guimaras"
        ],
        [
            "Buenavista"
        ],
        [
            "Jordan"
        ],
        [
            "Nueva Valencia"
        ],
        [
            "San Lorenzo"
        ],
        [
            "Sibunag"
        ],
        [
            "Metropolitan Iloilo–Guimaras Economic Development Council"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa_Barbara,_Iloilo&oldid=1197202413\""
        ],
        [
            "Categories: Municipalities of Iloilo1617 establishments in the PhilippinesPopulated places established in 1617Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Articles needing additional references from August 2011All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Hiligaynon-language textArticles containing Tagalog-language textCommons category link from WikidataOfficial website not in WikidataArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}