{
    "name": "Santa Maria",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa Maria, Bulacan"
        ],
        [
            "24 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschΕλληνικάEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSimple EnglishSvenskaTagalogاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°49′N 120°58′E﻿ / ﻿14.82°N 120.96°E﻿ / 14.82; 120.96"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bulacan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Santa Maria, Bulacan\" – news · newspapers · books · scholar · JSTOR (December 2016) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesSanta Maria"
        ],
        [
            "Santa Maria de PandiMunicipalityMunicipality of Santa Maria"
        ],
        [
            "(From top, left to right): Población skyline • Paso Bridge • Immaculate Conception Church • Philippine Arena • Municipal Hall at night"
        ],
        [
            "FlagSealNickname: Chicharon Capital of the PhilippinesMotto(s): ONE Santa Maria, Lahat Kasama(English: ONE Santa Maria, All Together)Anthem: Bayan Kong Mahal(English: My Beloved Town)Map of Bulacan with Santa Maria highlightedOpenStreetMapSanta MariaLocation within the PhilippinesCoordinates: 14°49′N 120°58′E﻿ / ﻿14.82°N 120.96°E﻿ / 14.82; 120.96CountryPhilippinesRegionCentral LuzonProvinceBulacanDistrict"
        ],
        [
            "6th districtFounded13th century CE(part of the Kingdom of Tondo)Incorporated.• Barriocirca 1647 (1647)• HaciendaJuly 4, 1699 (1699-07-04)• PuebloNovember 26, 1793 (1793-11-26)Founded byFray Francisco Javier OFMBarangays24"
        ],
        [
            "  (see Barangays)Government • TypeSangguniang Bayan • MayorBartolome R. Ramos • Vice MayorPablo L. Juan • RepresentativeSalvador A. Pleyto Sr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Marisa T. TuazonFroilan C. CaguiatNeil B. MateoCarl G. CastilloNelson Carmelo V. LucianoEsperanza G. RamosJesus B. de Guzman Jr.Mark Angelo R. Clemente"
        ],
        [
            " • Electorate142,380 voters (2022)Area • Revenue₱ 889.1 million (2020) • Assets₱ 1,757 million (2020) • Expenditure₱ 668.9 million (2020) • Liabilities₱ 157.3 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code3022PSGC031423000IDD : area code +63 (0)44Native languagesTagalogCatholic dioceseDiocese of MalolosPatron saintOur Lady of The Immaculate Conception"
        ],
        [
            "Santa Maria (/ˌsæntə məˈriːə/ SAN-tə mə-REE-ə, Tagalog:  representing 7.8% of the population of the province."
        ],
        [
            "Located on the banks of the Santa Maria River, 32 kilometres (19.9 mi) north of Manila, Santa Maria has been a thriving settlement for almost four centuries.",
            "It was founded as a barrio of Bocaue in the early 17th century until it was established as an independent municipality on November 26, 1793, by the Spanish friar Francisco Dominguez Javier OFM.",
            "Known before as Santa Maria de Pandi (Tagalog pronunciation: ), it is named under the patronage of the Immaculate Conception (also known as La Purisima Concepcion).",
            "Its administrative center, the Poblacion, forms the historic core of the municipality.",
            "It is surrounded by four rivers and it still largely retains its 2.88 square-kilometer boundaries since the Spanish Colonial Era."
        ],
        [
            "Santa Maria, with a population of 289,820, remains by a significant margin the most populous municipality in Central Luzon, as well as the 7th most populous municipality in the Philippines.",
            "It is also the 2nd most populous local government unit in Bulacan next to San Jose del Monte City.",
            "The projected population for 2025 was 305,668."
        ],
        [
            "Its downtown area consists of three highly urbanized barangays: Poblacion, Bagbaguin, and Sta.",
            "Clara.",
            "It is one of the biggest and busiest commercial centers in the province as it accounts for more than half of all economic activities in the municipality.",
            "It is also one of Bulacan's leading financial centers."
        ],
        [
            "Santa Maria was the home town of José Corazón de Jesús, a Filipino poet popularly known as \"Huseng Batute\", who started composing his verse as a child.",
            "Another native of Santa Maria is Francisco Santiago, a composer who wrote \"Nasaan Ka Irog\" and other kundiman songs.",
            "In the political arena, Santa Maria has produced three Bulacan governors: Jose Serapio (1900–1901), Trinidad Icasiano (1912–1916), Fortunato Halili (1943–1944 and 1946–1951); and two representatives of the second and fourth district: Rogaciano Mercado (1953–1972, 1987-1989) and Reylina Nicolas (2001–2010)."
        ],
        [
            "Etymology"
        ],
        [
            "Santa Maria got its name from the Immaculate Conception (also known as La Purisima Concepcion).",
            "Formerly known as Santa Maria de Pandi, the second name Pandi was derived from pande, Kapampangan word of \"blacksmith,\" cognate of Tagalog word \"panday.\""
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(June 2018) (Learn how and when to remove this message)"
        ],
        [
            "Pre colonial (before 1521)"
        ],
        [
            "Before the Spaniards came to the Philippines, Santa Maria was just a vast wilderness, inhabited by wild animals and covered by thick and lush rainforests.",
            "Aetas and Dumagats are also known to inhabit the place a long time ago."
        ],
        [
            "Spanish Era (1521–1898)"
        ],
        [
            "Santa Maria's existence can be traced as early as the year 1647 when it is still a barrio (village) of Bocaue.",
            "The barrio was believed to be established on the same period when the Dominicans founded the vast Hacienda de Lolomboy that extends up to the Angat river on the north, Bocaue river on the west, Marilao river on the south and the Pulo River (Pulong Buhangin) on the east."
        ],
        [
            "Santa Maria was founded as an independent town by the Franciscan Fray Francisco Dominguez Javier on November 26, 1793.",
            "He began constructing the church which was completed in the early 1800s by Fray Tomas Marti.",
            "The construction of the church was viewed as the foundation of the spiritual crusade in the said locality.",
            "Natives were converted into Christianity and more people began to inhabit the place.",
            "Civil affairs started to take shape and the appointment of the first Capitan del Barrio, Andres dela Cruz, paved way for the permanent establishment of Poblacion, which was the seat of Spanish colonial government.",
            "People in those days were just renting their pieces of land.",
            "They paid their rents to the friars who were stationed in what is now known as Sta.",
            "Clara, a barangay where at present one can see the ruins of a big convento of friars.",
            "People from other nearby places such as Balagtas, Pandi, Santa Maria, and San Jose del Monte, paid their rents in this convento.",
            "Santa Maria at that time was then called \"Santa Maria de Pandi\".",
            "The people acquired their lands after paying certain sum to the friars and the land became \"Lupang Tagalog\"."
        ],
        [
            "There were 82 capitanes who served the Spanish colonial administration from 1793 to 1899."
        ],
        [
            "American Era and Japanese Occupation (1898–1946)"
        ],
        [
            "Under the Americans, the title \"captain\" was changed to \"presidente\".",
            "The first to hold the position was Maximo Evidente, who served from 1899 to 1900.",
            "Of the 12 others who succeeded him, the most popular were Agustin Morales (1928–34) and Fortunato F. Halili (1934–37).",
            "Morales was responsible for the construction of the first main water system in the town.",
            "Halili, who never drew his salary as executive, later on became Governor of Bulacan.",
            "It was during Halili's term as provincial governor when the Capitol building at Malolos was heavily damage due to the aftermath of World War II.",
            "He decided to take over and resurge Casa Real de Malolos as a temporary Gubernatorial Office during the period when the Capitol building was severely damaged.",
            "It was his effort to rebuild and to reconstruct the Capitol building into its original structure."
        ],
        [
            "During the Japanese Occupation, Dr. Teofilo Santiago, dubbed as Dr. Kamoteng Kahoy for his widespread campaign among the town's citizenry to plant cassava, became mayor of Santa Maria.",
            "Santiago was also responsible for the launching of the poultry industry – a livelihood project which earned for the town the distinction of being \"The Egg Basket of the Philippines\".",
            "He was also the \"Father of Santa Maria Dairy Plant\".",
            "After the Liberation, Capitan Ireneo Hermogenes was appointed Municipal Mayor from March 20, 1945, to October 1945.",
            "He was succeeded by Marciano Bautista."
        ],
        [
            "From the American colonial rule until the restoration period after World War II, Santa Maria was administered by 12 Presidentes from 1899 to 1937 and 4 Alcaldes from 1938 to 1947."
        ],
        [
            "Liberation period (1947–present)"
        ],
        [
            "The post-liberation period saw Conrado Ignacio as the first elected Mayor of Santa Maria (1947–1955).",
            "He was succeeded by prominent personalities in Santa Maria local politics such as Ricardo G. Nicolas Sr. (1956–1959/1964–1967), Eriberto Ramos, Sr. (1960–1963), Paulino M. Luciano Sr. (1968–1971), Ricardo D. Nicolas, Jr.(1972–1978) and Paulino Luciano, Jr. (1979–1986)."
        ],
        [
            "After the People Power Revolution in February 1986, President Corazon Aquino appointed Dr. Alfredo Perez, who was then the vice mayor of the town, as Officer-in-Charge of the municipality until May 1986, when he was replaced by Ricardo Nicolas, Jr.",
            "In December 1986, however, Nicolas was appointed OIC Vice Governor of Bulacan and was succeeded by Benjamin G. Geronimo (1987–1988) and Atty.",
            "Ramon H. Clemente (1988)."
        ],
        [
            "During the 1988 elections, Eriberto Ramos was elected Mayor and served until June 30, 1992.",
            "On July 1, 1992, he was succeeded by Reylina G. Nicolas.",
            "Her three terms of leadership gave the municipality various awards and citations.",
            "On July 1, 1993, the municipality rose from third class to second-class municipality and July 1, 1996, the income level of the municipality rose again from second-class municipality to first-class municipality.",
            "In the 2001 elections, Nicolas ran for Representative of the 4th Congressional District of Bulacan and won a landslide victory with more than 80,000 votes over her closest rival.",
            "Nicolas was succeeded by Bartolome R. Ramos."
        ],
        [
            "During the 2004 elections, Jesus Mateo defeated the incumbent Ramos and became mayor of the municipality until 2007.",
            "One of Mateo's accomplishments as mayor of Santa Maria was the establishment of the Santa Maria extension campus of the Polytechnic University of the Philippines in 2005.",
            "In 2007 elections, Bartolome R. Ramos defeated Mateo and became mayor of the municipality again."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "Fourth District Congressman Henry Villarica has pledged to file a house bill to convert Santa Maria into a component city.",
            "Last February 29, 2024, Representative Salvador A. Pleyto (6th District-Bulacan) filed House Bill 9998 entitled, \" An Act Converting the Municipality of Santa Maria in the Province of Bulacan into a Component City to be known as the City of Santa Maria.\""
        ],
        [
            "Geography"
        ],
        [
            "Main article: Geography of Santa Maria, Bulacan"
        ],
        [
            "The Santa Maria River is the 2nd largest river in Bulacan by water volume and the 4th longest."
        ],
        [
            "A paddy field in Bulac.",
            "Agriculture remains a major source of income in the municipality."
        ],
        [
            "The municipality of Santa Maria lies 32 kilometres (20 mi) north-east of Manila and is located at the eastern portion of Bulacan.",
            "The town is bounded on the north by the municipalities of Angat and Pandi; portion of San Jose del Monte City on the south; Norzagaray and other portions of San Jose del Monte on the east; and the municipalities of Marilao and Bocaue on the western side.",
            "Santa Maria is 18 kilometres (11 mi) away from Malolos City, the provincial capital, and 38 kilometres (24 mi) from San Fernando, Pampanga, the regional centre of Central Luzon."
        ],
        [
            "Santa Maria has a land area of about 9,092.5 hectares (22,468 acres).",
            "The town is generally plain although hilly at the northern portion.",
            "It has a lone body of water – the Santa Maria River."
        ],
        [
            "The topography of Santa Maria is generally flat, however, it is becoming hilly towards the north.",
            "This area covers the barangays of Silangan, Mag-asawang Sapa, Pulong Buhangin and some parts of Balasing with landscape ranging from 8 to 18 percent slope.",
            "The rest of the barangays have a slope range from level to undulating."
        ],
        [
            "Most of the barangays in the municipality of Santa Maria have low susceptibility to flooding.",
            "Those with portion with moderate to high susceptibility to flooding are located along the Santa Maria River and near or adjacent to creeks that are tributaries of the Santa Maria River."
        ],
        [
            "There are 18 barangays with low susceptibility to flooding in the municipality (Manggahan, Santa Cruz, Cay Pombo, Caysio, Pulong Buhangin, Mag-asawang Sapa, Silangan, Balasing, Parada, Tumana, Mahabang Parang, Bulac, Catmon, San Vicente, Camangyanan, Tabing Bakod, Buenavista and San Gabriel).",
            "The barangay centers and populated areas in the barangays have low susceptibility to flooding.",
            "The portions of the barangays usually inundated are the generally low-lying areas and catchment areas of the barangays and near active creeks and rivers."
        ],
        [
            "Santa Maria was part of the 4th district of Bulacan along with Marilao, Meycauayan, and Obando from 1987 to 2022.",
            "It was moved to 6th district since 2021 along with neighboring municipalities Angat and Norzagaray."
        ],
        [
            "Land use"
        ],
        [
            "Basically agricultural, about 29.02 square kilometres (11.20 sq mi) or 30.54% of the town's land area is devoted to crop production.",
            "Approximately 26.66 square kilometres (10.29 sq mi) of riceland in Santa Maria are rain-fed and 2.36 square kilometres (0.91 sq mi) are irrigated.",
            "An area of 32.74 square kilometres (12.64 sq mi) are classified as non-productive agricultural area or open grasslands."
        ],
        [
            "Mineral resources"
        ],
        [
            "The town of Santa Maria has rich deposits of gravel,sand and volcanic tuff or adobe.",
            "Quarrying has been a good source of livelihood among the citizens."
        ],
        [
            "Climate"
        ],
        [
            "Due to its location near Metro Manila, rainfall and climate in Santa Maria is almost similar to the country's capital Manila.",
            "The location of Santa Maria in the western side of the Philippines made Philippine Atmospheric, Geophysical and Astronomical Services Administration (PAG-ASA) to classify its weather scheme as Type I.",
            "Wind coming from the Pacific Ocean is generally blocked by the Sierra Madre mountain range, a few kilometers east of the municipality."
        ],
        [
            "Its proximity to the equator tends to make its temperature to rise and fall into very small range: from as low as 19 °C (66 °F) to as high as 35 °C (95 °F).",
            "The Köppen climate system classifies Santa Maria climate as tropical monsoon (Am) due to its location and precipitation characteristics.",
            "This means that the municipality has two pronounced seasons: dry and wet seasons.",
            "The municipality's driest months are from November to April where it receives less than 60 millimetres (2.4 in) of rainfall.",
            "On the other hand, maximum rain period is from June to September where it receives not more than 600 millimetres (24 in) of rainfall.",
            "Hail and snow is not observed in the municipality."
        ],
        [
            "Humidity levels are usually high in the morning, especially during June to November, which makes it feel warmer.",
            "Lowest humidity levels are recorded in the evening during wet season.",
            "Discomfort from heat and humidity is extreme during May and June, otherwise it is higher compared to other places in the country.",
            "Average sunlight is maximum at 254.25 hours during April and minimum at 113 hours during July, August and September."
        ],
        [
            "Climate data for Santa Maria, Bulacan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "7(0.3)"
        ],
        [
            "7(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "21(0.8)"
        ],
        [
            "101(4.0)"
        ],
        [
            "152(6.0)"
        ],
        [
            "188(7.4)"
        ],
        [
            "170(6.7)"
        ],
        [
            "159(6.3)"
        ],
        [
            "115(4.5)"
        ],
        [
            "47(1.9)"
        ],
        [
            "29(1.1)"
        ],
        [
            "1,005(39.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.3"
        ],
        [
            "3.5"
        ],
        [
            "11.1"
        ],
        [
            "8.1"
        ],
        [
            "18.9"
        ],
        [
            "23.5"
        ],
        [
            "26.4"
        ],
        [
            "25.5"
        ],
        [
            "24.5"
        ],
        [
            "19.6"
        ],
        [
            "10.4"
        ],
        [
            "6.4"
        ],
        [
            "181.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Political map of Santa Maria."
        ],
        [
            "Santa Maria is politically subdivided into 24 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Barangays"
        ],
        [
            "District"
        ],
        [
            "Population(2020)"
        ],
        [
            "Area(km2)"
        ],
        [
            "Density(/km2)"
        ],
        [
            "Bagbaguin"
        ],
        [
            "Downtown"
        ],
        [
            "7,839"
        ],
        [
            "7.6358"
        ],
        [
            "1,026.61"
        ],
        [
            "Balasing"
        ],
        [
            "North"
        ],
        [
            "9,732"
        ],
        [
            "6.3713"
        ],
        [
            "1,527.47"
        ],
        [
            "Buenavista"
        ],
        [
            "South"
        ],
        [
            "2,821"
        ],
        [
            "2.4647"
        ],
        [
            "1,144.56"
        ],
        [
            "Bulac"
        ],
        [
            "East"
        ],
        [
            "10,015"
        ],
        [
            "5.2009"
        ],
        [
            "1,925.63"
        ],
        [
            "Camangyanan"
        ],
        [
            "South"
        ],
        [
            "5,019"
        ],
        [
            "2.4761"
        ],
        [
            "2,026.98"
        ],
        [
            "Catmon"
        ],
        [
            "East"
        ],
        [
            "15,938"
        ],
        [
            "8.2860"
        ],
        [
            "1,923.49"
        ],
        [
            "Cay Pombo"
        ],
        [
            "North"
        ],
        [
            "32,674"
        ],
        [
            "4.1626"
        ],
        [
            "7,849.42"
        ],
        [
            "Caysio"
        ],
        [
            "West"
        ],
        [
            "14,979"
        ],
        [
            "3.1198"
        ],
        [
            "4,801.27"
        ],
        [
            "Guyong"
        ],
        [
            "West"
        ],
        [
            "16,909"
        ],
        [
            "3.6191"
        ],
        [
            "4,672.16"
        ],
        [
            "Lalakhan"
        ],
        [
            "West"
        ],
        [
            "2,319"
        ],
        [
            "0.3354"
        ],
        [
            "6,914.13"
        ],
        [
            "Mag-asawang Sapa"
        ],
        [
            "North"
        ],
        [
            "10,381"
        ],
        [
            "1.1327"
        ],
        [
            "9,164.83"
        ],
        [
            "Mahabang Parang"
        ],
        [
            "South"
        ],
        [
            "5,140"
        ],
        [
            "1.0466"
        ],
        [
            "4,911.14"
        ],
        [
            "Manggahan"
        ],
        [
            "West"
        ],
        [
            "2,779"
        ],
        [
            "1.6386"
        ],
        [
            "1,695.96"
        ],
        [
            "Parada"
        ],
        [
            "East"
        ],
        [
            "9,419"
        ],
        [
            "4.0669"
        ],
        [
            "2,316.01"
        ],
        [
            "Población"
        ],
        [
            "Downtown"
        ],
        [
            "12,871"
        ],
        [
            "2.8032"
        ],
        [
            "4,591.54"
        ],
        [
            "Pulong Buhangin"
        ],
        [
            "North"
        ],
        [
            "41,218"
        ],
        [
            "14.3817"
        ],
        [
            "2,866.00"
        ],
        [
            "San Gabriel"
        ],
        [
            "South"
        ],
        [
            "9,630"
        ],
        [
            "3.6787"
        ],
        [
            "2,617.77"
        ],
        [
            "San Jose Patag"
        ],
        [
            "West"
        ],
        [
            "13,985"
        ],
        [
            "2.5218"
        ],
        [
            "5,545.64"
        ],
        [
            "San Vicente"
        ],
        [
            "East"
        ],
        [
            "24,451"
        ],
        [
            "7.2537"
        ],
        [
            "3,370.83"
        ],
        [
            "Sta.",
            "Clara"
        ],
        [
            "Downtown"
        ],
        [
            "12,419"
        ],
        [
            "2.1470"
        ],
        [
            "5,784.35"
        ],
        [
            "Sta.",
            "Cruz"
        ],
        [
            "West"
        ],
        [
            "11,364"
        ],
        [
            "2.2705"
        ],
        [
            "5,005.06"
        ],
        [
            "Silangan"
        ],
        [
            "North"
        ],
        [
            "2,102"
        ],
        [
            "0.9387"
        ],
        [
            "2,239.27"
        ],
        [
            "Tabing Bakod"
        ],
        [
            "South"
        ],
        [
            "5,410"
        ],
        [
            "1.2530"
        ],
        [
            "4,317.64"
        ],
        [
            "Tumana"
        ],
        [
            "South"
        ],
        [
            "10,406"
        ],
        [
            "2.1202"
        ],
        [
            "4,908.03"
        ],
        [
            "Demographics"
        ],
        [
            "Main article: Demographics of Santa Maria, Bulacan"
        ],
        [
            "Population census of Santa MariaYearPop.±% p.a.1903 10,791—    1918 12,174+0.81%1939 14,987+0.99%1948 17,509+1.74%1960 26,341+3.46%1970 36,369+3.27%1975 45,615+4.65%1980 58,748+5.19%1990 91,468+4.53%1995 101,071+1.89%2000 144,282+7.93%2007 205,258+4.98%2010 218,351+2.28%2015 256,454+3.11%2020 289,820+2.43%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Santa Maria, Bulacan, was 289,820 people, with a density of 3,200 inhabitants per square kilometre or 8,300 inhabitants per square mile.",
            "It is the largest among the municipalities in the Central Luzon Region in terms of population."
        ],
        [
            "Among the 24 barangays comprising the municipality, barangay Pulong Buhangin was the leading barangay in terms of population size with 41,218 persons."
        ],
        [
            "Religion"
        ],
        [
            "The majority of the population are Christians.",
            "Roman Catholicism is the dominant religion with 91% of the populace professed themselves as Roman Catholics.",
            "Santa Maria is under the jurisdiction of the Roman Catholic Diocese of Malolos.",
            "There are  eight parishes and one quasi-parish in Santa Maria namely: Minor Basilica and Parish of La Purisima Concepcion – Poblacion; Our Lady of Mount Carmel Parish – Pulong Buhangin; Santo Niño Parish – Parada; St. Gabriel the Archangel Parish – San Gabriel; Holy Family Parish – Catmon; St. John the Apostle and Evangelist Parish – Bagbaguin; Blessed Sacrament Parish – Cay Pombo; Parish & Diocesan Shrine of Mary, Mother of the Eucharist & Grace - San Vicente and San Isidro Labrador Quasi-Parish – Partida, Pulong Buhangin.",
            "The majority of villages in each barangays have their own chapel and patron saint."
        ],
        [
            "Other religious groups with strong presence in the municipality are the following: Members Church of God International, Iglesia ni Cristo, United Methodist Church, The Church of God, Jehovah's Witness, Jesus Is Lord Church and other evangelical or \"born-again\" groups, Pentecostal, Islam, and others."
        ],
        [
            "The Members Church of God International, or popularly known as Ang Dating Daan, has multiple coordinating centers or locales in the municipality, namely: Poblacion, Balasing (located in Pulong Buhangin near their border), Bulac, Cay Pombo, Caysio, Gardenville (Pulong Buhangin), and Parada.",
            "Although a locale is named after a barangay, members come from the barangay itself and neighboring barangays.",
            "For example, the locale of Bulac has members from nearby Catmon and Sapang Palay Proper (San Jose Del Monte City)."
        ],
        [
            "UNTV Public Service channel and Members Church of God International has provided many public service activities to Santa Maria such as tree planting, blood letting, free medical missions and free legal consultations.",
            "Thousands of residents have benefited from the charity events."
        ],
        [
            "Residential"
        ],
        [
            "There are about 45 subdivisions in the municipality of low, medium and high density category.",
            "The existing residential hub occupies 1,360 hectares (13.60 km2) of land distributed unevenly in its 12 barangays.",
            "These subdivisions used to occupy the stretch of the roads but now they are now developing the inner portions of their barangays.",
            "It is expected that within the next ten years, land use development in Santa Maria will represent the sub-urban mix which means that the government will provide development where the level of accessibility is very high.",
            "This will provide for the clustering of lower density land uses to help meet housing, employment and public services needs of the people."
        ],
        [
            "Economy"
        ],
        [
            "Governor Fortunato F. Halili Avenue in Bagbaguin is the busiest highway in the municipality."
        ],
        [
            "Poverty incidence of Santa Maria"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  5.60"
        ],
        [
            "2009  4.96"
        ],
        [
            "2012  4.10"
        ],
        [
            "2015  6.24"
        ],
        [
            "2018  4.58"
        ],
        [
            "2021  11.53"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Santa Maria is one of the municipalities in Bulacan with a high population growth rate due to in migration.",
            "Its rapid population growth contributes largely to the establishment of more commercial and trading activities as some people see this as an opportunity for business.",
            "Industries in Santa Maria include agribusiness, food processing, cottage making, banking, fireworks making, rubber, and textile making."
        ],
        [
            "The public market at Poblacion and the private market in Pulong Buhangin are the major areas for the exchange of goods and services."
        ],
        [
            "On March 3, 2003, President Gloria Macapagal Arroyo issued Presidential Proclamation No.",
            "337 designating the Santa María Industrial Park as a Special Economic Zone (Ecozone)."
        ],
        [
            "There are 28 pyrotechnics manufacturers, 5 textile, 87 garment factories, and 9 rubber industries operating in the municipality."
        ],
        [
            "In the Cities and Municipalities Competitive Index 2022 Rankings, the Municipality of Santa Maria was ranked No.",
            "5 for economic dynamism and No.",
            "9 for infrastructure."
        ],
        [
            "Agriculture"
        ],
        [
            "Rice, orchard products, corn, vegetables, hogs, cattle, and poultry, and freshwater fish are the major agricultural products of the municipality."
        ],
        [
            "Food processing"
        ],
        [
            "There are about 36 food processing establishments in Santa María."
        ],
        [
            "Agro-industrial sector"
        ],
        [
            "Industrial activities in Santa María are mostly agro-based.",
            "For the past two decades, there has been a great boom in its poultry and hog raising industries.",
            "Presently, there are around more than 150 poultry and piggery farms."
        ],
        [
            "The boost in agri-business necessitated the establishment of feed mills and feed trading centres.",
            "There are eight commercial feed mills and 15 feed trading centres operating in the town."
        ],
        [
            "There are 20 rice mills in Santa María that accommodate the milling and storage needs of the farmers for their palay harvest."
        ],
        [
            "Cottage industry"
        ],
        [
            "There are 10 furniture-making establishments in the town."
        ],
        [
            "Commerce"
        ],
        [
            "Santa Maria has one public wet and dry market, the Pamilihang Bayan ng Santa Maria, in Poblacion and several private wet and dry markets (one each in Cay Pombo and in Pulong Buhangin)."
        ],
        [
            "The mall has a supermarket, kiosks, a department store, school and office supplies store, bookstore, drugstore, 3 cinemas, hardware, and several restaurants.",
            "Convenience stores can also be found in the neighborhoods of the municipality."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Municipal hall"
        ],
        [
            "Like other municipalities in the Philippines, Santa Maria is governed by a mayor and vice mayor who are elected to three-year terms.",
            "The mayor is the executive head who leads the municipality's departments in the implementation of municipal ordinances and in the delivery of public services.",
            "The vice mayor heads a legislative council that is composed of 10 members: 8 councilors and two ex-officio officers: one for the Sangguniang Kabataan Federation President, representing the youth sector, and one for the Association of Barangay Chairmen President as the barangay sectoral representative.",
            "The council is in charge of creating the municipality's policies in the form of ordinances and resolutions."
        ],
        [
            "Santa Maria is part of the 6th District of Bulacan."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Santa Maria Municipal Council (2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Party"
        ],
        [
            "Mayor"
        ],
        [
            "Bartolome \"Omeng\" D. Ramos"
        ],
        [
            "Lakas"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Pablo \"Eboy\" L. Juan"
        ],
        [
            "Lakas"
        ],
        [
            "Councilors"
        ],
        [
            "Marisa T. Tuazon"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Froilan C. Caguiat"
        ],
        [
            "NUP"
        ],
        [
            "Neil B. Mateo"
        ],
        [
            "Lakas"
        ],
        [
            "Carl G. Castillo"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Nelson Carmelo V. Luciano"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Esperanza \"Fe\" G. Ramos"
        ],
        [
            "Lakas"
        ],
        [
            "Jesus \"Jess\" B. de Guzman Jr."
        ],
        [
            "PDP–Laban"
        ],
        [
            "Mark Angelo \"Mac\" R. Clemente"
        ],
        [
            "Lakas"
        ],
        [
            "Ex Officio Municipal Council Members"
        ],
        [
            "ABC President"
        ],
        [
            "Leovigildo \"Ging\" A. Ramos (Sto.",
            "Tomas)"
        ],
        [
            "Nonpartisan"
        ],
        [
            "SK Federation President"
        ],
        [
            "Marco B. Trajano (Bagbaguin)"
        ],
        [
            "Nonpartisan"
        ],
        [
            "List of chief executives"
        ],
        [
            "Main article: Mayor of Santa Maria, Bulacan"
        ],
        [
            "No."
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Took office"
        ],
        [
            "Left office"
        ],
        [
            "1"
        ],
        [
            "Maximo Evidente"
        ],
        [
            "1899"
        ],
        [
            "1900"
        ],
        [
            "2"
        ],
        [
            "Teodoro Geronimo"
        ],
        [
            "1900"
        ],
        [
            "1901"
        ],
        [
            "3"
        ],
        [
            "Maximo de Jesus"
        ],
        [
            "1901"
        ],
        [
            "1903"
        ],
        [
            "4"
        ],
        [
            "Pedro Gallardo"
        ],
        [
            "1903"
        ],
        [
            "1906"
        ],
        [
            "5"
        ],
        [
            "Juan Mendoza"
        ],
        [
            "1906"
        ],
        [
            "1910"
        ],
        [
            "6"
        ],
        [
            "Marciano de Leon"
        ],
        [
            "1910"
        ],
        [
            "1912"
        ],
        [
            "7"
        ],
        [
            "Bonifacio Morales"
        ],
        [
            "1912"
        ],
        [
            "1916"
        ],
        [
            "8"
        ],
        [
            "Antonio Rodriguez"
        ],
        [
            "1916"
        ],
        [
            "1919"
        ],
        [
            "9"
        ],
        [
            "Mariano Santiago"
        ],
        [
            "1919"
        ],
        [
            "1922"
        ],
        [
            "10"
        ],
        [
            "Cipriano de Guzman"
        ],
        [
            "1922"
        ],
        [
            "1928"
        ],
        [
            "11"
        ],
        [
            "Agustin Morales"
        ],
        [
            "1928"
        ],
        [
            "1934"
        ],
        [
            "12"
        ],
        [
            "Fortunato F. Halili"
        ],
        [
            "1934"
        ],
        [
            "1937"
        ],
        [
            "No."
        ],
        [
            "Alcalde"
        ],
        [
            "Took office"
        ],
        [
            "Left office"
        ],
        [
            "1"
        ],
        [
            "Pedro J. Mansilla"
        ],
        [
            "1938"
        ],
        [
            "1940"
        ],
        [
            "2"
        ],
        [
            "Dr. Teofilo S. Santiago"
        ],
        [
            "1941"
        ],
        [
            "1945"
        ],
        [
            "3"
        ],
        [
            "Ireneo Hermogenes"
        ],
        [
            "1945"
        ],
        [
            "1945"
        ],
        [
            "4"
        ],
        [
            "Marciano Bautista"
        ],
        [
            "1946"
        ],
        [
            "1947"
        ],
        [
            "No."
        ],
        [
            "Municipal Mayors"
        ],
        [
            "Took office"
        ],
        [
            "Left office"
        ],
        [
            "1"
        ],
        [
            "Conrado H. Ignacio"
        ],
        [
            "1947"
        ],
        [
            "1955"
        ],
        [
            "2"
        ],
        [
            "Ricardo G. Nicolas, Sr."
        ],
        [
            "1956"
        ],
        [
            "1959"
        ],
        [
            "3"
        ],
        [
            "Eriberto R. Ramos"
        ],
        [
            "1960"
        ],
        [
            "1963"
        ],
        [
            "4"
        ],
        [
            "Ricardo G. Nicolas, Sr."
        ],
        [
            "1964"
        ],
        [
            "1967"
        ],
        [
            "5"
        ],
        [
            "Paulino Luciano, Sr."
        ],
        [
            "1968"
        ],
        [
            "1971"
        ],
        [
            "6"
        ],
        [
            "Ricardo D. Nicolas, Jr."
        ],
        [
            "1972"
        ],
        [
            "1978"
        ],
        [
            "7"
        ],
        [
            "Paulino A. Luciano, Jr."
        ],
        [
            "1978"
        ],
        [
            "1986"
        ],
        [
            "8"
        ],
        [
            "Dr. Alfredo M. Perez (OIC)"
        ],
        [
            "1986"
        ],
        [
            "1986"
        ],
        [
            "9"
        ],
        [
            "Ricardo D. Nicolas, Jr. (OIC)"
        ],
        [
            "1986"
        ],
        [
            "1986"
        ],
        [
            "10"
        ],
        [
            "Benjamin I. Geronimo (OIC)"
        ],
        [
            "1987"
        ],
        [
            "1988"
        ],
        [
            "11"
        ],
        [
            "Atty.",
            "Ramon H. Clemente (OIC)"
        ],
        [
            "1988"
        ],
        [
            "1988"
        ],
        [
            "12"
        ],
        [
            "Eriberto R. Ramos"
        ],
        [
            "1988"
        ],
        [
            "1992"
        ],
        [
            "13"
        ],
        [
            "Reylina G. Nicolas"
        ],
        [
            "1992"
        ],
        [
            "2001"
        ],
        [
            "14"
        ],
        [
            "Bartolome R. Ramos"
        ],
        [
            "2001"
        ],
        [
            "2004"
        ],
        [
            "15"
        ],
        [
            "Jesus R. Mateo"
        ],
        [
            "2004"
        ],
        [
            "2007"
        ],
        [
            "16"
        ],
        [
            "Bartolome R. Ramos"
        ],
        [
            "2007"
        ],
        [
            "2016"
        ],
        [
            "17"
        ],
        [
            "Russel G. Pleyto"
        ],
        [
            "2016"
        ],
        [
            "2022"
        ],
        [
            "18"
        ],
        [
            "Bartolome R. Ramos"
        ],
        [
            "2022"
        ],
        [
            "incumbent"
        ],
        [
            "Tourism"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(June 2018) (Learn how and when to remove this message)"
        ],
        [
            "Wave pool at 4K Resort in Catmon"
        ],
        [
            "Santa Maria is home to ten resorts located in barangays Pulong Buhangin, Balasing, Catmon, Bulac, Mahabang Parang, Tumana and Lalakhan.",
            "These resorts have become the main destinations of the residents from Metro Manila and Santa Maria's nearby towns for their leisure and summer experience.",
            "Facilities like swimming pools, convention/seminar rooms, hotel, cottages, and spacious parking spaces that could accommodate fifty buses at a time equipped these resorts.",
            "Some resorts accommodate local and foreign tourist for live-in accommodations."
        ],
        [
            "In 2005, over 138,000 tourists visited the resorts in Santa Maria.",
            "Sitio Lucia Resort situated in Pulong Buhangin attracted 36 percent of the total volume of resort visitors.",
            "4K Garden Resort of Barangay Catmon came next with 29 percent share.",
            "The Summer Resort in Barangay Mahabang Parang settled at the bottom with 2 percent contribution."
        ],
        [
            "Grand Marian Exhibit in La Purísima Concepción Parish Church"
        ],
        [
            "Historical places"
        ],
        [
            "La Purísima Concepción Parish Church"
        ],
        [
            "Huseng Batute Marker"
        ],
        [
            "Francisco Santiago Marker"
        ],
        [
            "Festivals"
        ],
        [
            "The town fiesta of Santa Maria in honor of its Patroness, the Purisima Concepcion is a month-long celebration in February which clearly shows the Marian devotion of the town.",
            "The movable feast is held on the Thursday after February 2 which tradition refers to as La Candelaria.",
            "It is preceded by the traditional novena of Masses before the feast and High Masses and processions on the Sundays of the month."
        ],
        [
            "Throughout the month several other events are held such as musical variety shows led by popular personalities, outdoor sports exhibitions of nationally acclaimed players, concerts by well known bands and cultural shows."
        ],
        [
            "Most notable during the month of February is the availability of \"Tuge\", a ready to eat root crop sold by vendors that signify the ambiance of the festivity together with the cool breeze which last right after the celebration of the town fiesta."
        ],
        [
            "The joyous celebration of February takes on a somber mood as the liturgical calendar moves on to Cuaresma or Lent."
        ],
        [
            "Apparently, the devotion was brought by the Franciscans who evangelized the town where the principal celebrations before the War was celebrated at the Lourdes Church which was then in Intramuros.",
            "Lost during the War, it was revived by the Hermandad y Cofradia de la Sagrada Pasion y de Maria Santisima de la Esperanza, a confraternity organized in 1999 to spearhead the revival and promotion of the Lenten traditions of Santa Maria from the Jubilee Year 2000 onwards.",
            "Incidentally, the Hermandad de la Sagrada Pasion has been an affiliate of the Hermandad de la Macarena in Seville, Spain since 2008 making it the twenty first confraternity to be recognized, the second outside of Spain and the first in Asia."
        ],
        [
            "Sports and recreation"
        ],
        [
            "The Philippine Arena is a multi-purpose indoor arena at Ciudad de Victoria, a 75-hectare tourism enterprise zone located in the towns of Santa Maria and Bocaue, Bulacan.",
            "With a capacity of up to 55,000, it was the centerpiece of the Iglesia ni Cristo's (INC) centennial, which was celebrated on July 27, 2014."
        ],
        [
            "Sports and recreation activities in the locality are usually basketball, softball, bowling, badminton, tennis and chess.",
            "The most common sports and recreational facilities in the town are basketball courts located in school compounds and in other part of 24 barangays.",
            "These courts also serve as multi-purpose pavements.",
            "A tennis court and a gymnasium named after the late Ricardo D. Nicolas, Jr. was constructed at the FFHNAS campus in Barangay Guyong.",
            "There are also two badminton courts in the town."
        ],
        [
            "Infrastructure"
        ],
        [
            "Santa Maria Welcome Arch"
        ],
        [
            "Bridges"
        ],
        [
            "Santa Maria Bridge"
        ],
        [
            "As of 2004, Santa Maria has a network of ten bridges passing rivers and other waterways of the town.",
            "All are made of reinforced concrete design girders which are in good condition and passable."
        ],
        [
            "Communications"
        ],
        [
            "Communication facilities in Santa Maria are provided by government telegraph (BUTEL), postal system, the Philippine Long Distance and Telephone Company (PLDT), Radio City Telephone Company (RACITELCOM), Digitel telephone Company, Converge ICT, the three major cellular companies (Smart Communications, Globe Telecom, Dito Telecommunity) and two MVNO: (Talk N' Text, Sun Cellular and Touch Mobile)."
        ],
        [
            "Water"
        ],
        [
            "Water supply is provided by LWUA (Local Water Utilities Administration) through the Santa Maria Water District."
        ],
        [
            "Electricity"
        ],
        [
            "The Manila Electric Company (Meralco) is the sole electric distributor in Santa Maria."
        ],
        [
            "Basic services"
        ],
        [
            "Health"
        ],
        [
            "Santa Maria has one government-run hospital and seven private hospitals."
        ],
        [
            "Animal health"
        ],
        [
            "Santa Maria also have veterinary clinics and an animal pet corner center."
        ],
        [
            "These veterinary clinics handle farm animals and pets.",
            "Services range from simple to major surgeries, microchip implantation, vaccinations, laboratory works, confinements, emergency cases, and grooming."
        ],
        [
            "Peace and order"
        ],
        [
            "Santa Maria is generally peaceful being served by 51 policemen and 15 firemen.",
            "The backlog of manpower requirement is complemented with 480 barangay tanods coming from 24 barangays.",
            "Crime incidence is low with 37 cases reported and 33 case were solve resulting to 89.19% crime solution efficiency."
        ],
        [
            "Education"
        ],
        [
            "The Santa Maria extension campus of the Polytechnic University of the Philippines"
        ],
        [
            "Santa Maria is part of Division of Bulacan under the Department of Education (DepEd).",
            "There are 32 public elementary schools and 5 public secondary schools in the municipality.",
            "The public schools are divided into three educational districts for representative purposes.",
            "Private schools can also be found in the municipality."
        ],
        [
            "There are two tertiary institutions in the municipality.",
            "The Polytechnic University of the Philippines operates a campus in Santa Maria."
        ],
        [
            "Notable people"
        ],
        [
            "José Corazón de Jesús (1896–1932), Huseng Batute – Filipino poet"
        ],
        [
            "Francisco Santiago (1889–1947), Ama ng Kundiman"
        ],
        [
            "Jolina Marie B. Reyes (born 1996), A child actress, also known as Krystal Reyes"
        ],
        [
            "Angel Locsin (born 1985), actress, commercial model and host"
        ],
        [
            "Alfred Vargas (born 1981), actor"
        ],
        [
            "Maine Mendoza (born 1995), also known as \"Yaya Dub\" and one of the co-hosts of Eat Bulaga!"
        ],
        [
            "Sister cities"
        ],
        [
            "Santa Maria is twinned with:"
        ],
        [
            " Milton, Ontario, Canada (since July 6, 1999)"
        ],
        [
            "See also"
        ],
        [
            "Fortunato F. Halili Avenue"
        ],
        [
            "Legislative districts of Bulacan"
        ],
        [
            "Notes"
        ],
        [
            "References"
        ],
        [
            "^ \"Province: BULACAN\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on July 18, 2016.",
            "Retrieved October 10, 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Doh Population Projections by Region, Province, City/Municipality and Barangay from 2020–2025\" (PDF).",
            "Retrieved February 5, 2021."
        ],
        [
            "^ a b Statistics comelec.gov.ph"
        ],
        [
            "^ \"PHILIPPINE DEPOSIT INSURANCE CORPORATION : PHILIPPINE BANKING SYSTEM DISTRIBUTION OF DOMESTIC a/ DEPOSITS\".",
            "Pdic.gov.ph.",
            "June 30, 2016.",
            "Retrieved December 15, 2016."
        ],
        [
            "^ \"Commission on Audit – Bulacan\".",
            "Coa.gov.ph.",
            "Retrieved December 15, 2016."
        ],
        [
            "^ \"2012 City and Municipal-Level Small Area Poverty Estimates\".",
            "Psa.gov.ph.",
            "Retrieved December 15, 2016."
        ],
        [
            "^ Velasco, Shane F. (May 20, 2019).",
            "\"Tagalog News: Henry Villarica, bagong kinatawan ng Ika-Apat na Distrito ng Bulacan\".",
            "Philippine Information Agency (in Tagalog).",
            "Retrieved July 23, 2020."
        ],
        [
            "^ a b \"Archived copy\" (PDF).",
            "www.mgbr3.ph.",
            "Archived from the original (PDF) on August 13, 2016.",
            "Retrieved January 13, 2022.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ \"Archived copy\".",
            "kidlat.pagasa.dost.gov.ph.",
            "Archived from the original on June 5, 2003.",
            "Retrieved January 13, 2022.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^"
        ],
        [
            "\"Santa Maria: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 12, 2020."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b \"Philippine Statistics Authority | Republic of the Philippines\"."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bulacan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ a b \"Highlights on the 2020 Census of Population and Housing (2020 CPH) - Province of Bulacan | Philippine Statistics Authority RSSO 03\"."
        ],
        [
            "^ \"Santa Maria, Bulacan, Philippines Official Website : Physical and Demographic Profile - Religion\".",
            "www.santamariabulacan.gov.ph.",
            "Archived from the original on December 12, 2010.",
            "Retrieved January 13, 2022."
        ],
        [
            "^ \"MCGI Takes Part in Public Service Channel UNTV's Celebration of 10th Year\".",
            "UNTVweb.com.",
            "July 2, 2014.",
            "Retrieved December 30, 2018."
        ],
        [
            "^ \"Mahigit 1,000 residente sa Santa Maria, Bulacan, napaglingkuran sa medical mission ng UNTV at MCGI\".",
            "UNTVweb.com.",
            "April 1, 2016.",
            "Retrieved December 30, 2018."
        ],
        [
            "^ \"Over 600 residents of Santa Maria, Bulacan, benefit from medical mission of UNTV and MCGI\".",
            "UNTVweb.com.",
            "December 16, 2016.",
            "Retrieved December 30, 2018."
        ],
        [
            "^ \"Mga taga-Santa Maria, Bulacan, napaglingkuran sa medical mission ng UNTV at MCGI\".",
            "UNTVweb.com.",
            "June 10, 2016.",
            "Retrieved December 30, 2018."
        ],
        [
            "^ \"Medical mission, isinagawa ng UNTV at Ang Dating Daan sa Santa Maria, Bulacan (MAY062014)\".",
            "UNTVweb.com.",
            "May 7, 2014.",
            "Retrieved December 30, 2018."
        ],
        [
            "^ \"Mahigit 100 bag ng dugo, nakolekta sa isinagawang 3rd quarter Mass Blood Letting ng MCGI at UNTV sa Bulacan\".",
            "UNTVweb.com.",
            "October 3, 2017.",
            "Retrieved December 30, 2018."
        ],
        [
            "^ \"Bro Eli Soriano, Kuya Daniel Razon Sponsor Charity Works\".",
            "elisoriano.com.",
            "February 2, 2016.",
            "Retrieved December 30, 2018."
        ],
        [
            "^ \"Santa Maria, Bulacan, Philippines Official Website : Socio-Economic Profile - Residential\".",
            "www.santamariabulacan.gov.ph.",
            "Archived from the original on June 19, 2009.",
            "Retrieved January 13, 2022."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Santa Maria, Bulacan, Philippines Official Website : Business in Sta.",
            "Maria, Bulacan\".",
            "santamariabulacan.gov.ph.",
            "Archived from the original on December 26, 2008.",
            "Retrieved January 13, 2022."
        ],
        [
            "^ \"DTI names Bulacan as the 10th Most Competitive Province anew – Provincial Government of Bulacan\"."
        ],
        [
            "^ \"Santa Maria, Bulacan, Philippines Official Website : Business -Major Industries\".",
            "www.santamariabulacan.gov.ph.",
            "Archived from the original on May 14, 2009.",
            "Retrieved January 13, 2022."
        ],
        [
            "^ \"Santa Maria, Bulacan, Philippines Official Website : Socio-Economic Profile - Peace and Order\".",
            "www.santamariabulacan.gov.ph.",
            "Archived from the original on December 12, 2010.",
            "Retrieved January 13, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa Maria, Bulacan."
        ],
        [
            "Wikisource has the text of the 1905 New International Encyclopedia article  \"Santa María de Pandi\"."
        ],
        [
            "Official website (archived)"
        ],
        [
            "NSCB – ActiveStats – PSGC Interactive – Municipality: SANTA MARIA Archived July 3, 2018, at the Wayback Machine"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Official website"
        ],
        [
            "Places adjacent to Santa Maria, Bulacan"
        ],
        [
            "Pandi"
        ],
        [
            "Angat"
        ],
        [
            "Norzagaray"
        ],
        [
            "Santa María"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Bocaue"
        ],
        [
            "Marilao"
        ],
        [
            "vte Province of BulacanMalolos (capital)  San Jose del Monte (largest city)Municipalities"
        ],
        [
            "Angat"
        ],
        [
            "Balagtas"
        ],
        [
            "Bocaue"
        ],
        [
            "Bulakan"
        ],
        [
            "Bustos"
        ],
        [
            "Calumpit"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Guiguinto"
        ],
        [
            "Hagonoy"
        ],
        [
            "Marilao"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Pandi"
        ],
        [
            "Paombong"
        ],
        [
            "Plaridel"
        ],
        [
            "Pulilan"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Maria"
        ],
        [
            "Component cities"
        ],
        [
            "Baliwag"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa_Maria,_Bulacan&oldid=1229007149\""
        ],
        [
            "Categories: Santa Maria, BulacanPopulated places established in 17921792 establishments in the PhilippinesMunicipalities of BulacanHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 Tagalog-language sources (tl)CS1 maint: archived copy as titleCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse mdy dates from September 2021Articles needing additional references from December 2016All articles needing additional referencesPages using infobox settlement with possible motto listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Tagalog IPAArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from December 2019Articles needing additional references from June 2018Commons category link from WikidataWebarchive template wayback linksOfficial website different in Wikidata and WikipediaPages using the Kartographer extension"
        ]
    ]
}