{
    "name": "Santa Fe",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa Fe, Nueva Vizcaya"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°09′33″N 120°56′16″E﻿ / ﻿16.1592°N 120.9378°E﻿ / 16.1592; 120.9378"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Nueva Vizcaya, Philippines"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesSanta Fe"
        ],
        [
            "ImuganMunicipalityMunicipality of Santa FeAerial view"
        ],
        [
            "FlagSealNickname(s): Bus Layover Hub of Cagayan ValleyLittle BaguioMap of Nueva Vizcaya with Santa Fe highlightedOpenStreetMapSanta FeLocation within the PhilippinesCoordinates: 16°09′33″N 120°56′16″E﻿ / ﻿16.1592°N 120.9378°E﻿ / 16.1592; 120.9378CountryPhilippinesRegionCagayan ValleyProvinceNueva VizcayaDistrict"
        ],
        [
            "Lone districtBarangays16"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 158.4 million (2020) • Assets₱ 245.1 million (2020) • Expenditure₱ 136.7 million (2020) • Liabilities₱ 53.04 million (2020)Service provider • ElectricityNueva Vizcaya Electric Cooperative (NUVELCO)Time zoneUTC+8 (PST)ZIP code3705PSGC025012000IDD : area code +63 (0)78Native languagesGaddang Ilocano Ibaloi Kallahan TagalogWebsitehttps://santafe-nvizcaya.gov.ph"
        ],
        [
            "Santa Fe, officially the Municipality of Santa Fe (Gaddang: Ili na Santa Fe; Ilocano: Ili ti Santa Fe; Tagalog: Bayan ng Santa Fe), is a 3rd class, landlocked municipality in the province of Nueva Vizcaya, Philippines.",
            "According to the 2020 census, it has a population of 18,276."
        ],
        [
            "It is the only town in Nueva Vizcaya that borders Pangasinan and is a typical bus stop for commuters going to the provinces of Isabela and Cagayan.",
            "This town is the end point of the Dalton Pass, a zig zag road from San Jose and Carranglan, Nueva Ecija.",
            "It is also where the infamous Battle of Balete Pass where Brigadier General James Dalton II was killed during the Second World War."
        ],
        [
            "Etymology"
        ],
        [
            "According to the official website of Santa Fe, Nueva Vizcaya, the town's former name \"Imugan\" derives from the combination of \"imug\", a Kalanguya word and \"gone\", an English term, both of which have the same meaning, while the current name was derived from the town's patron saint San Jose de Santa Fe."
        ],
        [
            "History"
        ],
        [
            "The town's original inhabitants were the Kalanguya, an ethnic minority belonging to the Igorot people then later on followed by the Ilocanos, Pangasinenses and the Tagalogs."
        ],
        [
            "Spanish era"
        ],
        [
            "Santa Fe was formerly an Igorot settlement during the Spanish era called Imugan.",
            "It was one of the settlements discovered during the mission of Ituy, which later became part of the jurisdiction of the Commandancia of Kayapa.",
            "It became part of Aritao before it finally stood independently as a town."
        ],
        [
            "American era"
        ],
        [
            "The Municipal district of Imugan was founded by Governor-General Francis Burton Harrison in 1917 by virtue of Executive Order No.",
            "39.",
            "The first appointed municipal president was a certain Kalanguya chief named Licodan who served until 1910."
        ],
        [
            "On November 7, 1923, the Route 5 also known as San Jose–Santa Fe Road (Now part of the Maharlika Highway) was informally opened allowing easy access from Central Luzon to the Cagayan Valley."
        ],
        [
            "Japanese occupation"
        ],
        [
            "Main articles: Dalton Pass § Battle of Balete Pass, and Battle of Villa Verde Trail"
        ],
        [
            "During the Second World War, the Japanese Imperial Army established a puppet government in the country.",
            "Two strategic locations, Dalton Pass in Tactac and Salacsac Pass in Malico, witnessed significant combat between the retreating Japanese Army and the pursuing Allied Forces.",
            "Brigadier General James Dalton II of the United States Army Forces in the Far East (USAFFE) lost his life in the battle of Balete Pass on May 16, 1945, which is now known as \"Dalton Pass\" in his memory.",
            "Similarly, a shrine was built in Salacsac Pass to honor the unknown soldiers who displayed heroism during the war."
        ],
        [
            "Historical Marker commemorating the Battle of Balete Pass"
        ],
        [
            "Tomb of the Unknown Soldier in Salacsac Pass"
        ],
        [
            "Post-war era"
        ],
        [
            "On 9 November 1950, Executive Order No.",
            "368,"
        ],
        [
            "Contemporary period"
        ],
        [
            "In December 2000, around 50 NPA rebels raided the town's police station located at the municipal town hall.",
            "They ransacked and occupied the town hall for nearly two hours and leaving six policemen dead."
        ],
        [
            "Geography"
        ],
        [
            "Santa Fe is located in the southwest part of Nueva Vizcaya and is borders the municipalities of Aritao in the northwest, Kayapa in the northeast, Carranglan, Nueva Ecija in the south, Itogon, Benguet in the east, San Nicolas, and Natividad, Pangasinan"
        ],
        [
            "Santa Fe is 50 kilometres (31 mi) from Bayombong and 215 kilometres (134 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Santa Fe is politically subdivided into 16 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Atbu"
        ],
        [
            "Bacneng"
        ],
        [
            "Balete"
        ],
        [
            "Baliling"
        ],
        [
            "Bantinan"
        ],
        [
            "Baracbac"
        ],
        [
            "Buyasyas"
        ],
        [
            "Canabuan"
        ],
        [
            "Imugan"
        ],
        [
            "Malico"
        ],
        [
            "Poblacion"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Sinapaoan"
        ],
        [
            "Tactac"
        ],
        [
            "Unib"
        ],
        [
            "Villaflores"
        ],
        [
            "Boundary dispute"
        ],
        [
            "Santa Fe currently has a boundary dispute with San Nicolas, Pangasinan, in which Santa Fe claims the territory of barangay Malico."
        ],
        [
            "On July 2024, the Pangasinan provincial government has allocated ₱200 million (US$4.06 million) for projects and services in Malico.",
            "Governor Ramon Guico III asserted Malico's affiliation with Pangasinan, emphasizing the province's commitment to enhancing local infrastructure and services regardless of the territorial dispute.",
            "Nueva Vizcaya Governor Jose Gambito warns of potential legal repercussions for Pangasinan's investments in the area.",
            "He also said that the two government agreed to pay"
        ],
        [
            "₱600,000 (US$12,182.74) for every NAMRIA survey but Pangasinan allegedly did not fulfill its promises."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Santa Fe, Nueva Vizcaya"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "16(61)"
        ],
        [
            "17(63)"
        ],
        [
            "18(64)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "18(64)"
        ],
        [
            "17(63)"
        ],
        [
            "19(67)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "13(0.5)"
        ],
        [
            "15(0.6)"
        ],
        [
            "21(0.8)"
        ],
        [
            "33(1.3)"
        ],
        [
            "92(3.6)"
        ],
        [
            "121(4.8)"
        ],
        [
            "142(5.6)"
        ],
        [
            "124(4.9)"
        ],
        [
            "121(4.8)"
        ],
        [
            "143(5.6)"
        ],
        [
            "50(2.0)"
        ],
        [
            "22(0.9)"
        ],
        [
            "897(35.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "6.0"
        ],
        [
            "6.4"
        ],
        [
            "9.2"
        ],
        [
            "12.2"
        ],
        [
            "20.3"
        ],
        [
            "23.1"
        ],
        [
            "25.1"
        ],
        [
            "22.5"
        ],
        [
            "22.4"
        ],
        [
            "20.0"
        ],
        [
            "11.6"
        ],
        [
            "7.1"
        ],
        [
            "185.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Santa FeYearPop.±% p.a.1918 3,571—    1939 2,043−2.62%1948 2,126+0.44%1960 4,982+7.35%1970 4,254−1.57%1975 5,961+7.00%1980 6,338+1.23%YearPop.±% p.a.1990 9,960+4.62%1995 11,854+3.32%2000 12,949+1.91%2007 13,421+0.50%2010 14,427+2.67%2015 16,180+2.21%2020 18,276+2.42%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2020 census, Santa Fe has a population of 18,276 in 4,496 households, the 13th most populated and 3rd least populated in the province of Nueva Vizcaya just higher than Ambaguio and slightly lower than Diadi.",
            "The population has grown by 2.42% compare to 2015.",
            "The population density of the municipality is 46 people per square kilometer (120/sq mi)."
        ],
        [
            "People"
        ],
        [
            "Kalanguya (Ikalahan)"
        ],
        [
            "Main article: Kalanguya people"
        ],
        [
            "The municipality is one of the contiguous areas where the Kalanguya people, part of the Igorot people currently living.",
            "They are noted for production of basketry and brooms."
        ],
        [
            "Iwak"
        ],
        [
            "Iwak (or I'kaw) people was one of the tribes present in the municipality, mostly found in Barangay Buyasyas.",
            "They are noted for making \"Kabang\", an all purpose basket which they sold in shops across the town."
        ],
        [
            "Ilocanos"
        ],
        [
            "Nueva Vizcaya as a whole was one of the place where the Ilocanos migrated into during early 20th century"
        ],
        [
            "Tagalogs"
        ],
        [
            "Tagalogs migrated to Santa Fe at the same time as the Ilocanos."
        ],
        [
            "Religion"
        ],
        [
            "According to the 2000 census by the National Statistics Office (NSO), majority of the people of Santa Fe adhere to some form of Christianity.",
            "There were 62 people adhering to folk/tribal religion."
        ],
        [
            "Roman Catholic"
        ],
        [
            "Santa Fe has one Roman Catholic Parish Church named \"Church of Our Mother of Perpetual Help\".",
            "The church is under the jurisdiction of the Diocese of Bayombong."
        ],
        [
            "Iglesia Ni Cristo"
        ],
        [
            "Iglesia ni Cristo in the municipality is under the church district of Nueva Vizcaya.",
            "There were 2 church in the municipality namely, \"Local of Santa Fe\" located in Barangay Villaflores"
        ],
        [
            "Language"
        ],
        [
            "Ilocano and Filipino is widely spoken across Nueva Vizcaya including the municipality of Santa Fe."
        ],
        [
            "Culture"
        ],
        [
            "Kalanguya Festival"
        ],
        [
            "Kalanguya Festival is a town fiesta held every March to promote Kalanguya culture.",
            "It features activities such as dance competition by various ethnic groups in the municipalities, float completion, beauty pageants, and various traditional Kalanguya games such as arm wrestling or hanggol and dapapnikillum or pig catching."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Santa Fe"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  15.20"
        ],
        [
            "2009  11.44"
        ],
        [
            "2012  23.65"
        ],
        [
            "2015  15.14"
        ],
        [
            "2018  17.65"
        ],
        [
            "2021  16.18"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "According to the Philippine Statistics Authority, as of 2021, 16.18% of the population of Santa Fe have is living in poverty.",
            "It decrease by 1.47% since 2018.",
            "It is the 4th highest poverty incidence in the province of Nueva Vizcaya, slightly higher than Alfonso Castañeda and lower than Kasibu."
        ],
        [
            "Local products include brooms, strawberry jam, strawberry wine, peanut butter, orchids and quilts."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Santa Fe, belonging to the lone congressional district of the province of Nueva Vizcaya, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Luisa L. Cuaresma"
        ],
        [
            "Governor"
        ],
        [
            "Jose V. Gambito"
        ],
        [
            "Mayor"
        ],
        [
            "Liwayway C. Caramat"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Jonathan M. Tindaan"
        ],
        [
            "Councilors"
        ],
        [
            "Wycliff Dulawan"
        ],
        [
            "Jon Dennis Galate"
        ],
        [
            "Eddie Caramat Jr."
        ],
        [
            "Langley Bautista"
        ],
        [
            "Mark Kristian Padilla"
        ],
        [
            "Lovely Wowie Petonio"
        ],
        [
            "Jayson Omallio"
        ],
        [
            "Elias Baguya"
        ],
        [
            "IPMR"
        ],
        [
            "Benjamin Baguya"
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Nueva Vizcaya governs the town's public education system.",
            "The division office is a field office of the DepEd in Cagayan Valley region.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Some of the schools in Santa Fe are:"
        ],
        [
            "Santa Fe National High School (Villaflores)"
        ],
        [
            "Kalahan Academy (Imugan)"
        ],
        [
            "Santa Fe Central School (Baliling)"
        ],
        [
            "Canabuan National High School (Canabuan)"
        ],
        [
            "Tourism"
        ],
        [
            "Imugan Falls"
        ],
        [
            "Imugan Falls is a 35 feet (11 m) two level waterfall located 1 kilometer (0.62 mi) from the barangay proper of Imugan."
        ],
        [
            "Balete Pass National Park"
        ],
        [
            "Main article: Dalton Pass"
        ],
        [
            "Balete Pass National Park also known as Dalton Pass is a 144.09 hectares (356.1 acres) national park where the famous Battle of Balete Pass between the US army and the Japanese Imperial Army happen in 1945.",
            "It features the white cross in the Japanese memorial site with the text “Peace Forever.”"
        ],
        [
            "Gallery"
        ],
        [
            "Municipal hall"
        ],
        [
            "Public market"
        ],
        [
            "Municipal hall complex"
        ],
        [
            "Town proper"
        ],
        [
            "Forest Park"
        ],
        [
            "Notes"
        ],
        [
            "^ Santa Fe claims that it borders the municipality of Natividad, Pangasinan, but the border is located in the disputed Barangay Malico.",
            "(See Boundary Dispute)"
        ],
        [
            "^ This includes the disputed barangay Malico"
        ],
        [
            "^ Malico is a disputed barangay between the Municipalities of San Nicolas, Pangasinan and Santa Fe, Nueva Vizcaya (See Boundary Dispute)"
        ],
        [
            "^ (now Philippine Statistics Authority (PSA))"
        ],
        [
            "References"
        ],
        [
            "^ a b c d e Romero, Alexis (March 27, 2015).",
            "\"A Nueva Summer Destination\".",
            "The Philippine Star.",
            "Retrieved June 17, 2024."
        ],
        [
            "^  Municipality of Santa Fe |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ a b c d e f g h \"Municipal Profile\".",
            "Santa Fe, Nueva Vizcaya Official Website.",
            "Retrieved April 10, 2024."
        ],
        [
            "^ \"Imugan | Santa Fe, Nueva Vizcaya\".",
            "Santa Fe Official Website.",
            "Retrieved June 11, 2024."
        ],
        [
            "^ a b c d \"Sta.",
            "Fe - Nueva Vizcaya, Philippines\".",
            "Nueva Vizcaya Official Website.",
            "July 16, 2020.",
            "Retrieved April 10, 2024."
        ],
        [
            "^ Journal of Northern Luzon.",
            "Saint Mary's College.",
            "1970. p. 51."
        ],
        [
            "^ Gobernador-General, Philippines (1923).",
            "Annual Report of the Governor General, Philippine Islands: Message from the President of the United States Transmitting the Annual Report of the Governor General of the Philippine Islands for the Year Ended ... U.S. Government Printing Office.",
            "p. 48."
        ],
        [
            "^ Governor, Philippines (1925).",
            "Report of the Governor General of the Philippine Islands.",
            "p. 219."
        ],
        [
            "^ \"BATTLE OF BALETE PASS: 77TH ANNIVERSARY CELEBRATED\".",
            "Philippine Veterans Affairs Office.",
            "Retrieved April 10, 2024."
        ],
        [
            "^ \"Reorganizing the municipalities and municipal districts in the province of Nueva Vizcaya into ten municipalities, defining their boundaries, and abolishing the municipal districts\".",
            "Official Gazette of the Republic of the Philippines.",
            "November 11, 1950.",
            "Retrieved January 12, 2021."
        ],
        [
            "^ \"An Act to Recreate the Municipal District of Imugan, Province of Nueva Vizcaya, Which Name is to be Changed to Santa Fe\".",
            "LawPhil.net.",
            "Retrieved January 12, 2021."
        ],
        [
            "^ \"Classifying Municipal Districts In The Philippines And Declaring Certain Municipal Districts As Municipalities And Certain Municipalities As First Class Municipal Districts\".",
            "Official Gazette of the Republic of the Philippines.",
            "July 18, 1967.",
            "Retrieved January 12, 2021."
        ],
        [
            "^ \"FVR raps failed drive vs NPA, asks Estrada to resign\".",
            "Philippine Star.",
            "December 26, 2000.",
            "Retrieved April 21, 2024."
        ],
        [
            "^ Lagasca, Charlie (March 13, 2002).",
            "\"Nueva Ecija solon, mayor gave arms to NPA, says captured reb\".",
            "The Philippine Star.",
            "Retrieved April 21, 2024."
        ],
        [
            "^ a b Cardinoza, Gabriel (September 30, 2022).",
            "\"Barangay torn between Pangasinan, NVizcaya\".",
            "The Manila Times.",
            "Retrieved October 8, 2022."
        ],
        [
            "^ Cardinoza, Gabriel (October 8, 2022).",
            "\"Pangasinan gov: We own Malico\".",
            "The Manila Times.",
            "Retrieved October 8, 2022."
        ],
        [
            "^ Domingo, Leander (September 26, 2022).",
            "\"Pangasinan, NVizcaya land dispute worsens\".",
            "The Manila Times.",
            "Retrieved January 10, 2023."
        ],
        [
            "^ Sotelo, Yolanda; Visaya Jr., Villamor (July 5, 2024).",
            "\"Pangasinan-Nueva Vizcaya row over village still raging\".",
            "INQUIRER.net.",
            "Retrieved July 6, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Santa Fe: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved July 4, 2021."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Nueva Vizcaya\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ Cayat, Gaspar.",
            "\"Manuscript on Kalanguya Cultural Communities\".",
            "National Commission for Culture and the Arts.",
            "Retrieved April 17, 2024."
        ],
        [
            "^ \"Peoples of the Philippines: Ikalahan/Kalanguya\".",
            "National Commission for Culture and the Arts.",
            "Retrieved April 17, 2024."
        ],
        [
            "^ Rambo, A. Terry; Gillogly, Kathleen (January 1, 1991).",
            "Profiles in Cultural Evolution: Papers from a Conference in Honor of Elman R. Service.",
            "University of Michigan Press.",
            "p. 437.",
            "ISBN 978-0-915703-23-4."
        ],
        [
            "^ \"Peoples of the Philippines: Iwak\".",
            "National Commission for Culture and the Arts.",
            "Retrieved April 17, 2024."
        ],
        [
            "^ \"I-Wak\".",
            "California State University, East Bay.",
            "Retrieved April 17, 2024."
        ],
        [
            "^ Ncip (2007).",
            "The Indigenous Peoples of the Philippines' 2007 Ed.",
            "Rex Book Store.",
            "p. 30.",
            "ISBN 9789712346705.",
            "Retrieved June 11, 2024."
        ],
        [
            "^ a b c d e f g \"2000 CENSUS OF POPULATION AND HOUSING\" (PDF).",
            "Philippine Statistics Authority.",
            "Retrieved June 11, 2024."
        ],
        [
            "^ Lewis, Henry T. (December 1984).",
            "\"Migration in the Northern Philippines: The Second Wave\".",
            "Wiley.",
            "55 (2): 118–136.",
            "JSTOR 40330799.",
            "PMID 12313778 – via JSTOR."
        ],
        [
            "^ \"Church of Our Mother of Perpetual Help 🇵🇭\".",
            "GCatholic.",
            "Retrieved June 11, 2024."
        ],
        [
            "^ \"INC Directory\".",
            "directory.iglesianicristo.net.",
            "Retrieved June 11, 2024."
        ],
        [
            "^ \"INC Directory\".",
            "directory.iglesianicristo.net.",
            "Retrieved June 11, 2024."
        ],
        [
            "^ Guinsiman, Leticia D. (June 2016).",
            "\"Establishing Standardized and Harmonized Kalanguya Orthography Towards Effective Writing: A Contribution in MTB-MLE Curriculum\" (PDF).",
            "NVSU Research Journal.",
            "III (1).",
            "Retrieved June 12, 2024."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"2022 ELECTION RESULT\".",
            "Rappler.",
            "Retrieved March 22, 2024."
        ],
        [
            "^ \"DepED Regional Office No.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "^ \"Public SEC Schools – NUEVA VIZCAYA\".",
            "Department of Education Region 2.",
            "Retrieved June 17, 2024."
        ],
        [
            "^ \"Public ELEM Schools – NUEVA VIZCAYA\".",
            "Department of Education Region 2.",
            "Retrieved June 17, 2024."
        ],
        [
            "^ Romero, Alexis (May 18, 2016).",
            "\"Dalton Pass declared a national shrine\".",
            "The Philippine Star.",
            "Retrieved June 17, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa Fe, Nueva Vizcaya."
        ],
        [
            "Official website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Santa Fe, Nueva Vizcaya"
        ],
        [
            "Kayapa / Aritao"
        ],
        [
            "Itogon, Benguet"
        ],
        [
            "Santa Fe"
        ],
        [
            "Aritao"
        ],
        [
            "San Nicolas, Pangasinan"
        ],
        [
            "Carranglan, Nueva Ecija"
        ],
        [
            "vte Province of Nueva VizcayaBayombong (capital and largest municipality)Municipalities"
        ],
        [
            "Alfonso Castañeda"
        ],
        [
            "Ambaguio"
        ],
        [
            "Aritao"
        ],
        [
            "Bagabag"
        ],
        [
            "Bambang"
        ],
        [
            "Bayombong"
        ],
        [
            "Diadi"
        ],
        [
            "Dupax del Norte"
        ],
        [
            "Dupax del Sur"
        ],
        [
            "Kasibu"
        ],
        [
            "Kayapa"
        ],
        [
            "Quezon"
        ],
        [
            "Santa Fe"
        ],
        [
            "Solano"
        ],
        [
            "Villaverde"
        ],
        [
            "BarangaysSee: List of barangays in Nueva Vizcaya"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa_Fe,_Nueva_Vizcaya&oldid=1232915839\""
        ],
        [
            "Category: Municipalities of Nueva VizcayaHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from June 2024All Wikipedia articles written in Philippine EnglishUse mdy dates from June 2024Pages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Gaddang-language textArticles containing Ilocano-language textArticles containing Tagalog-language textCommons category link from WikidataOfficial website not in WikidataPages using the Kartographer extension"
        ]
    ]
}