{
    "name": "Santa Catalina",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa Catalina, Ilocos Sur"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°35′30″N 120°21′52″E﻿ / ﻿17.5917°N 120.3644°E﻿ / 17.5917; 120.3644"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Santa Catalina, Ilocos Sur\" – news · newspapers · books · scholar · JSTOR (September 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesSanta Catalina"
        ],
        [
            "Santa Catalina Virgen y MartirMunicipalityMunicipality of Santa CatalinaSt.",
            "Catherine of Alexandria Church"
        ],
        [
            "FlagSealNickname: Vegetable Bowl of the NorthMotto: Larga Santa CatalinaMap of Ilocos Sur with Santa Catalina highlightedOpenStreetMapSanta CatalinaLocation within the PhilippinesCoordinates: 17°35′30″N 120°21′52″E﻿ / ﻿17.5917°N 120.3644°E﻿ / 17.5917; 120.3644CountryPhilippinesRegionIlocos RegionProvinceIlocos SurDistrict"
        ],
        [
            "1st districtNamed forSt.",
            "Catherine of AlexandriaBarangays9"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorEdgar R. Rapanut • Vice MayorJonathan Amando R. Redoble • RepresentativeDeogracias Victor B. Savellano • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Restituto R. OandasanExpedito R. RapanutNiño R. RealinRowena R. RacadioAngelie Victoria R. RagasaDonato R. RagasaConrado A. RagucosMerlito R. Rapacon"
        ],
        [
            " • Electorate10,617 voters (2022)Area • Revenue₱ 68.97 million (2020) • Assets₱ 377.2 million (2020) • Expenditure₱ 80.27 million (2020) • Liabilities₱ 55.25 million (2020)Service provider • ElectricityIlocos Sur Electric Cooperative (ISECO)Time zoneUTC+8 (PST)ZIP code2701PSGC012923000IDD : area code +63 (0)77Native languagesIlocano Tagalog"
        ],
        [
            "Santa Catalina, officially the Municipality of Santa Catalina (Ilocano: Ili ti Santa Catalina; Filipino: Bayan ng Santa Catalina), is a 5th class municipality in the province of Ilocos Sur, Philippines.",
            "According to the 2020 census, it has a population of 14,493 people."
        ],
        [
            "The feast of the town is celebrated every 25th day of November to celebrate the feast day of Saint Catherine of Alexandria (the town's patron saint)."
        ],
        [
            "Etymology"
        ],
        [
            "When the Augustinians were busy with the Christianization of the Ilocos Region, a group of missionaries sailed westward through the river known as \"El Mestizo\" to the place now called Santa Catalina.",
            "They were also looking for fresh water, since the area where he landed yielded only salty water.",
            "When they finally found a fresh water spring up north, and were busy quenching their thirst, some of them saw an image of a beautiful lady near the place where he drank, which disappeared after a few minutes.",
            "One of them recognized the image as that of Saint Catherine of Alexandria.",
            "The Augustinians returned to Villa Fernandina (Vigan) and reported this matter to their superiors.",
            "This resulted in the construction of a church in the town with Saint Catherine of Alexandria as the patron saint.",
            "It was also declared that Santa Catalina be the name of the town."
        ],
        [
            "A replica of the cross once planted by Salcedo and his party—to signify that the Spanish has conquered the area—stands near the entrance to the municipality."
        ],
        [
            "Geography"
        ],
        [
            "With an area of 968 hectares (2,390 acres), it is the smallest municipality in the province and the only municipality in Ilocos Sur which has an urban status for all its barangays based on National Statistical Coordination Board (NSCB)."
        ],
        [
            "Barangays"
        ],
        [
            "Santa Catalina is politically subdivided into 9 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Cabaroan"
        ],
        [
            "Cabittaogan"
        ],
        [
            "Cabuloan"
        ],
        [
            "Pangada"
        ],
        [
            "Paratong"
        ],
        [
            "Poblacion"
        ],
        [
            "Sinabaan"
        ],
        [
            "Subec"
        ],
        [
            "Tamorong"
        ],
        [
            "It has 3 sitios, namely:"
        ],
        [
            "Calawaan in barangay Tamorong"
        ],
        [
            "Mindanao, formerly Sabangan in barangay Paratong"
        ],
        [
            "Punta in barangay Cabittaogan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Santa Catalina, Ilocos Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "19(66)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "9(0.4)"
        ],
        [
            "11(0.4)"
        ],
        [
            "13(0.5)"
        ],
        [
            "23(0.9)"
        ],
        [
            "92(3.6)"
        ],
        [
            "122(4.8)"
        ],
        [
            "153(6.0)"
        ],
        [
            "137(5.4)"
        ],
        [
            "139(5.5)"
        ],
        [
            "141(5.6)"
        ],
        [
            "42(1.7)"
        ],
        [
            "14(0.6)"
        ],
        [
            "896(35.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "4.6"
        ],
        [
            "4.0"
        ],
        [
            "6.2"
        ],
        [
            "9.1"
        ],
        [
            "19.5"
        ],
        [
            "23.2"
        ],
        [
            "24.0"
        ],
        [
            "22.5"
        ],
        [
            "21.5"
        ],
        [
            "15.2"
        ],
        [
            "10.5"
        ],
        [
            "6.0"
        ],
        [
            "166.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Santa CatalinaYearPop.±% p.a.1903 5,625—    1918 6,494+0.96%1939 6,495+0.00%1948 7,125+1.03%1960 8,414+1.40%YearPop.±% p.a.1970 8,921+0.59%1975 9,391+1.04%1980 9,761+0.78%1990 11,388+1.55%1995 11,228−0.26%YearPop.±% p.a.2000 12,537+2.39%2007 13,284+0.80%2010 13,597+0.85%2015 13,945+0.48%2020 14,493+0.76%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Santa Catalina had a population of 14,493.",
            "The population density was 1,500 inhabitants per square kilometre (3,900/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Santa Catalina"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  6.30"
        ],
        [
            "2009  11.71"
        ],
        [
            "2012  16.71"
        ],
        [
            "2015  13.31"
        ],
        [
            "2018  5.87"
        ],
        [
            "2021  13.12"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "As of February 2006, Santa Catalina with a poverty incidence of 7.9 percent and Vigan City with a poverty incidence of 8.6 percent, are the top two municipalities/cities with lowest poverty incidences"
        ],
        [
            "Trade"
        ],
        [
            "The main source of income for the locals include farming, fishing and small-scale businesses.",
            "As with most Philippine towns, the phenomenon of migrant labor has also contributed much to the development of the town.",
            "It is evidenced by the numerous mansions and large houses that dot the area along with the vast expanse of active farms and fields.",
            "Santa Catalina is only four (4) kilometers away from Vigan City, which is the province's center of commerce and trade, and because of this; there are few establishments in the locality.",
            "Santa Catalina has yet to establish a Central Business District (CBD).",
            "Residents currently go to Vigan to sell their produce and at the same time buy their household needs and other goods and merchandise that will be retailed in the locality."
        ],
        [
            "Light Industries"
        ],
        [
            "Santa Catalina also has manufacturing of concrete well rings-a material used as reservoir in the making of open-dug wells to irrigate farm lots.",
            "There are also service-oriented industries such as gravel and sand businesses that cater to the needs of the Housing Sector and the metal crafts that manufacture sidecars for motorized-tricycles.",
            "These industries do have limited employment.",
            "One pioneering industry in the locality is the manufacture of Cigars but this industry is already nearing its extinction because of lack of the raw materials (native tobacco) that were used in the manufacture.",
            "We do have also the Onion Dehydration Plant an industry that pulverized onion that was exported in different Asian countries.",
            "The reason why this dehydrating plant had closed was because of dollar fluctuations."
        ],
        [
            "Agriculture"
        ],
        [
            "A total of 696.5888 hectares or 74.581% of the total land area of Santa Catalina is utilized for crop production.",
            "Croplands are found in every barangay.",
            "The whole area of 696.588 hectares is planted with rice during rainy season.",
            "30 hectares or 4.31 percent of the total agricultural land is planted with white corn while 20 hectares or 2.87 percent are planted with corn.",
            "Next to rice/corn season, farmers also plant vegetables with a total effective area of 1,150 hectares or 165.09 percent of the agricultural lands.",
            "Onions, cabbage, cauliflower, sweet pepper, eggplant, beans, tomato, sweet potato, yam beans, mongo and peanut are the vegetables that are planted.",
            "Because of the limited agricultural land in the municipality, inter cropping farming system are commonly practiced.",
            "As had been mentioned earlier that 696.588 hectares are planted with rice and corn while 1,150 hectares are planted with vegetable.",
            "This municipality has been known as the “VEGETABLE BOWL OF THE NORTH”.",
            "The total value of vegetable production alone is PhP 523.04 million that brings a lot of income to farmers."
        ],
        [
            "Saint Catherine of Alexandria Parish Church in 2023"
        ],
        [
            "Poultry, Livestock And Fisheries"
        ],
        [
            "The farmers in the locality do not produce livestock or poultry in commercial scale but mostly on the backyard level.",
            "Livestock such as cows and water buffalo were being raised to help farmers in their farm needs and serves as working animal.",
            "Likewise goats were raised but not in herds and these are for local and home consumption of the farmers.",
            "Likewise farmers do not raise poultry in commercial scale but they raised chickens in backyard scale.",
            "Most farmers raised fighting cocks which commands higher prices in the market.",
            "The total area for fishponds is 53.9021 hectares.",
            "These fishponds are almost located in every barangay but the biggest area is at barangay Cabittaogan.",
            "Fishponds are classified as a) brackish pond where milkfish are cultured, b) freshwater for the production of tilapia, c) fish cages, d) Municipal fishing grounds which were found within 15 kilometers from the shoreline of coastal barangay and e) communal fishing grounds found in Govantes River."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Santa Catalina, belonging to the first congressional district of the province of Ilocos Sur, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Deogracias Victor B. Savellano"
        ],
        [
            "Mayor"
        ],
        [
            "Edgar R. Rapanut"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Jonathan Amando R. Redoble"
        ],
        [
            "Councilors"
        ],
        [
            "Restituto R. Oandasan"
        ],
        [
            "Expedito R. Rapanut"
        ],
        [
            "Niño R. Realin"
        ],
        [
            "Rowena R. Racadio"
        ],
        [
            "Angelie Victoria R. Ragasa"
        ],
        [
            "Donato R. Ragasa"
        ],
        [
            "Conrado A. Ragucos"
        ],
        [
            "Merlito R. Rapacon"
        ],
        [
            "Education"
        ],
        [
            "Interior of St. Catherine of Alexandria Church"
        ],
        [
            "It has 7 elementary schools, namely:"
        ],
        [
            "Santa Catalina Central"
        ],
        [
            "Bernardo P. Ragasa Elementary"
        ],
        [
            "Cabittaogan Elementary"
        ],
        [
            "Paratong Elementary"
        ],
        [
            "Pangada-Cabaroan Elementary"
        ],
        [
            "Calawaan Elementary"
        ],
        [
            "Cabuloan Elementary"
        ],
        [
            "It has two high schools, namely:"
        ],
        [
            "Cabittaogan High School and"
        ],
        [
            "Santa Catalina High School (formerly known as Benito Soliven Institute)."
        ],
        [
            "Sister cities"
        ],
        [
            "Makati, Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Santa Catalina |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b"
        ],
        [
            "\"Province: Ilocos Sur\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Santa Catalina: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 14 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c \"Sta.",
            "Catalina|Economy & Business (Light Industries- Continued...)\".",
            "2008-11-21.",
            "Archived from the original on 2008-11-21.",
            "Retrieved 2020-08-07."
        ],
        [
            "^ a b \"Sta.",
            "Catalina|Economy & Business\".",
            "2008-08-21.",
            "Archived from the original on 2008-08-21.",
            "Retrieved 2020-08-07."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 11, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa Catalina, Ilocos Sur."
        ],
        [
            "Community Website of Santa Catalina, Ilocos Sur"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Santa Catalina, Ilocos Sur"
        ],
        [
            "San Vicente"
        ],
        [
            "South China Sea"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Bantay"
        ],
        [
            "Vigan"
        ],
        [
            "vte Province of Ilocos SurVigan (capital)  Candon (largest city)Municipalities"
        ],
        [
            "Alilem"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bantay"
        ],
        [
            "Burgos"
        ],
        [
            "Cabugao"
        ],
        [
            "Caoayan"
        ],
        [
            "Cervantes"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Lidlidda"
        ],
        [
            "Magsingal"
        ],
        [
            "Nagbukel"
        ],
        [
            "Narvacan"
        ],
        [
            "Quirino"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Juan"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Component cities"
        ],
        [
            "Candon"
        ],
        [
            "Vigan"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Sur"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa_Catalina,_Ilocos_Sur&oldid=1229557198\""
        ],
        [
            "Category: Municipalities of Ilocos SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textWikipedia articles needing clarification from September 2022Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}