{
    "name": "Santa Ana",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa Ana, Cagayan"
        ],
        [
            "21 languages"
        ],
        [
            "العربيةBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 18°27′32″N 122°08′31″E﻿ / ﻿18.4589°N 122.1419°E﻿ / 18.4589; 122.1419"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cagayan, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Santa Ana, Cagayan\" – news · newspapers · books · scholar · JSTOR (January 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesSanta AnaMunicipalityMunicipality of Santa AnaView of Santa Ana coast from Mount Cagua"
        ],
        [
            "FlagSealNickname: Game Fishing Center of the PhilippinesMap of Cagayan with Santa Ana highlightedOpenStreetMapSanta AnaLocation within the PhilippinesCoordinates: 18°27′32″N 122°08′31″E﻿ / ﻿18.4589°N 122.1419°E﻿ / 18.4589; 122.1419CountryPhilippinesRegionCagayan ValleyProvinceCagayanDistrict"
        ],
        [
            "1st districtFoundedOctober 21, 1949Barangays16"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 209.1 million (2020) • Assets₱ 571.2 million (2020) • Expenditure₱ 181.4 million (2020) • Liabilities₱ 159.3 million (2020)Service provider • ElectricityCagayan 2 Electric Cooperative (CAGELCO 2)Time zoneUTC+8 (PST)ZIP code3514PSGC021523000IDD : area code +63 (0)78Native languagesIbanag Ilocano Dupaningan Agta TagalogWebsitehttps://santaanacagayan.gov.ph/"
        ],
        [
            "Santa Ana, officially the Municipality of Santa Ana (Ibanag: Ili nat Santa Ana; Ilocano: Ili ti Santa Ana; Tagalog: Bayan ng Santa Ana), is a 2nd class municipality in the province of Cagayan, Philippines.",
            "In the 2020 census, it had a population of 35,688 people."
        ],
        [
            "The municipality contains the north-easternmost point of Luzon and also includes Palaui Island.",
            "It is the home of the Cagayan Special Economic Zone and the Camilo Osias Naval Base in Barangay San Vicente.",
            "Santa Ana is 154 kilometres (96 mi) from Tuguegarao and 635 kilometres (395 mi) from Manila."
        ],
        [
            "History"
        ],
        [
            "The first inhabitants of the region were the Negritos and hacheros (woodcutters) under Don Julián Astigarraga (Capitan Vasco 1854-1901"
        ],
        [
            "In 1900, the woodcutters from Aparri arrived by boat.",
            "The clearing of forests began shortly after."
        ],
        [
            "From 1919 to 1935, several groups of settlers from the Ilocos Region came to claim territory aboard virays (light boats).",
            "The once-forested areas were only accessible via rivers and the sea.",
            "Before reaching the settlements in the northern and eastern portions of the region, they had to navigate along the Palawig River."
        ],
        [
            "The name Palawig was coined from the local term pasawig, meaning mouth of the river."
        ],
        [
            "In 1935, the gimongs Inanama and Dagupan fused into one group called Da Inanama.",
            "Headed by Navarro, they began to work for the separation of Palawig as a municipality independent from Gonzaga.",
            "Their application was held in abeyance because their population did not meet the needed number required by law.",
            "The move was suspended in 1941 and not carried out due to World War Two."
        ],
        [
            "Barrio Palawig and its neighboring barrios were separated from Gonzaga and the town was created by President Elpidio Quirino via Executive Order No.",
            "289 on 21 October 1949.",
            "Contrary to the usual assumption, it is not named for Saint Anne but is an acronym of the surnames of the then-three provincial officials: Governor Nicasio Arranz and Provincial Board members Federico Navarro and Roberto Avena.",
            "The association to the saint was a back-formation in keeping with traditional Hispanicised toponyms."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Santa Ana is politically subdivided into 16"
        ],
        [
            "barangays.",
            "Each barangay consists of puroks while some have sitios.",
            "The town is divided into two sections by the Palawig River, east and west."
        ],
        [
            "Casagan - E"
        ],
        [
            "Casambalangan (Port Irene) - W"
        ],
        [
            "Centro (Poblacion) - W"
        ],
        [
            "Diora-Zinungan - W"
        ],
        [
            "Dungeg - E"
        ],
        [
            "Kapanikian - W"
        ],
        [
            "Marede - E"
        ],
        [
            "Palawig - E"
        ],
        [
            "Batu-Parada - E"
        ],
        [
            "Patunungan - E"
        ],
        [
            "Rapuli (Punti) - W"
        ],
        [
            "San Vicente (Fort) - E"
        ],
        [
            "Santa Clara - E"
        ],
        [
            "Santa Cruz - E"
        ],
        [
            "Tangatan - E"
        ],
        [
            "Visitacion (Poblacion) - W"
        ],
        [
            "Climate"
        ],
        [
            "Santa Ana has a tropical monsoon climate (Am according to the Köppen climate classification) with hot, humid conditions prevailing year round.",
            "The average annual high temperature is 28 °C (82 °F) and the average annual low temperature is 23 °C (73 °F).",
            "Santa Ana receives 1,818 millimetres (71.6 in) of precipitation annually."
        ],
        [
            "Climate data for Santa Ana, Cagayan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "28(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "150(5.9)"
        ],
        [
            "106(4.2)"
        ],
        [
            "84(3.3)"
        ],
        [
            "48(1.9)"
        ],
        [
            "103(4.1)"
        ],
        [
            "115(4.5)"
        ],
        [
            "134(5.3)"
        ],
        [
            "156(6.1)"
        ],
        [
            "136(5.4)"
        ],
        [
            "240(9.4)"
        ],
        [
            "246(9.7)"
        ],
        [
            "300(11.8)"
        ],
        [
            "1,818(71.6)"
        ],
        [
            "Average rainy days"
        ],
        [
            "19"
        ],
        [
            "14.3"
        ],
        [
            "12.8"
        ],
        [
            "10.8"
        ],
        [
            "17.7"
        ],
        [
            "18.9"
        ],
        [
            "21.5"
        ],
        [
            "23.3"
        ],
        [
            "22.1"
        ],
        [
            "20.4"
        ],
        [
            "20.3"
        ],
        [
            "22.2"
        ],
        [
            "223.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Santa AnaYearPop.±% p.a.1960 7,227—    1970 9,799+3.09%1975 11,360+3.01%1980 12,551+2.01%1990 17,614+3.45%1995 18,640+1.07%YearPop.±% p.a.2000 21,612+3.22%2007 25,833+2.49%2010 30,458+6.18%2015 32,906+1.48%2020 35,688+1.61%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Santa Ana, was 35,688 people, with a population density of 81 inhabitants per square kilometre or 210 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Santa Ana"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  14.70"
        ],
        [
            "2009  16.33"
        ],
        [
            "2012  20.62"
        ],
        [
            "2015  12.54"
        ],
        [
            "2018  13.87"
        ],
        [
            "2021  13.19"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The economy of Santa Ana is composed of both agriculture and the commercial sector.",
            "Most of the commercial and industrial activities are at Port Irene as part of the Cagayan Special Economic Zone in Barangay Casambalangan."
        ],
        [
            "Some of its agricultural and aquatic products are rice, corn, peanut, fish, lumber, shells, etc.",
            "Among its natural resources are limestone deposits at Bawac Mountain, coal at Carbon Mountain, Santa Clara and guano deposit at Kapannikian Cave."
        ],
        [
            "Tourism"
        ],
        [
            "Pacific Ocean view from top of Cape Engaño Lighthouse, Palaui Island"
        ],
        [
            "Aside from the Cagayan Special Economic Zone which host casinos and other gaming facilities, Santa Ana has other scenic spots and historical landmarks.",
            "These include:"
        ],
        [
            "Cape Engaño Lighthouse/Cove (USA Survivor 27 and 28 filming area)"
        ],
        [
            "Siwangag Cove (USA Survivor 27 and 28 filming area)"
        ],
        [
            "White beaches like Anguib Beach, Mapurao Beach, Nangaramoan Beach, and Puzo Robo Beach"
        ],
        [
            "Gotan mangrove forest and waterfalls"
        ],
        [
            "Suncity Casino in Barangay Tangatan"
        ],
        [
            "Buwacag Falls at Santa Clara (open for public), Padlas Falls at Casambalangan, and Lamesa Falls at Casagan (not yet ready for public)"
        ],
        [
            "Dumasag River at Rapuli"
        ],
        [
            "Riding Takuli (a traditional kayak) and firefly watching at Barangay Casagan"
        ],
        [
            "Belt Fishing Activity at Diora-Zinungan"
        ],
        [
            "Santa Ana is the game fishing hub of the Philippines.",
            "It has hosted international decathlons, where athletes run through the rugged terrain of Punta Verde to Cape Engaño, then swim in the Philippine Sea."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Santa Ana, belonging to the first legislative district of the province of Cagayan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through elections held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Ramon C. Nolasco Jr."
        ],
        [
            "Mayor"
        ],
        [
            "Nelson P. Robinion"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Catherine J. Ladrido"
        ],
        [
            "Councilors"
        ],
        [
            "Delfin A. Nepomuceno III"
        ],
        [
            "Victoriano T. Fabro Jr."
        ],
        [
            "Jovemar A. Castillo"
        ],
        [
            "Manolo G. Ignacio"
        ],
        [
            "Jignet Rose A. Guittap"
        ],
        [
            "Joel A. Martinez"
        ],
        [
            "Araceli P. Torralba"
        ],
        [
            "Rexmel C. Eslava"
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Cagayan governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Culture"
        ],
        [
            "Every year from May 26 to May 30, the town hosts the Viray Festival, organized by the local government with the support of the regional tourism office and the private sector.",
            "Launched in June 2005, the Viray Festival was conceived to dramatize the significance of the viray, which played a key role in the lives and history of the town."
        ],
        [
            "A viray is a large, flat wooden boat which, before the emergence of gasoline-fed engines in the early 1950s, was propelled by sails.",
            "Traders used large virays measuring 18 metres (59 ft) long, 5 metres (16 ft) wide and 3.5 metres (11 ft) high.",
            "Fishermen, on the other hand, used smaller ones, usually 11 metres (36 ft) long, 5 metres (16 ft) wide and 2.5 metres (8 ft 2 in) high.",
            "Equipped with oars to reach nearby fishing grounds, these types sailed for longer distances."
        ],
        [
            "Due to its capacity to carry great quantities of cargo, the viray was the only means of transport used by the first settlers of Santa Ana."
        ],
        [
            "Leaders and well-off families gained income from the services of the viray, ranging from fishing, commerce and trading to means of transport during the years when Santa Ana was in its prime.",
            "They used the viray for fishing, as the boats could carry fishing gear, provisions, supplies, and people.",
            "It was assisted by small bancas during fishing operations."
        ],
        [
            "An annual fluvial parade of colorful boats is held during the first day.",
            "The second day of the festival features a grand carabao parade where each of the sixteen barangays composing the municipality take their turn to show off their artistic talents.",
            "On the third day, both locals and visitors line up along the main street to watch people participating in the street dancing competition."
        ],
        [
            "Sports"
        ],
        [
            "Santa Ana is also known as a site for kiteboarding and windsurfing.",
            "In 2015, the Philippine Windsurfing Association and the Philippine Kiteboarding Association organized a competition off Anguib Beach."
        ],
        [
            "In 2016, the Beach Volleyball Republic league hosted the third leg of the Nationwide On Tour on Anguib Beach.",
            "Beach volleyball players Charo Soriano and Filipino-American Alexa Micek won the third leg of the tournament."
        ],
        [
            "Media"
        ],
        [
            "107.9 MHz TAPS Radio Santa Ana"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Santa Ana |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Family archives"
        ],
        [
            "^"
        ],
        [
            "\"Province: Cagayan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Santa Ana, Cagayan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 27 December 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Cagayan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 10, 2022."
        ],
        [
            "^ \"History of DepED SDO Cagayan\".",
            "DepED SDO Cagayan | Official Website of DepED SDO Cagayan.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "^ Domingo, Leander (January 10, 2015).",
            "\"Cagayan hosts surf, kite contests\".",
            "The Manila Times.",
            "Retrieved March 7, 2016."
        ],
        [
            "^ \"Beach volleyball in Cagayan\".",
            "The Daily Tribune.",
            "February 17, 2016.",
            "Retrieved March 7, 2016."
        ],
        [
            "^ \"TAPS Radio Santa Ana\".",
            "Facebook.com.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa Ana, Cagayan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Manidad Island in Santa Ana Cagayan Valley"
        ],
        [
            "Places adjacent to Santa Ana, Cagayan"
        ],
        [
            "CalayanBabuyan Channel (Luzon Strait)"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Santa Ana"
        ],
        [
            "Gonzaga"
        ],
        [
            "Philippine Sea"
        ],
        [
            "vte Province of CagayanTuguegarao (capital and largest city)Municipalities"
        ],
        [
            "Abulug"
        ],
        [
            "Alcala"
        ],
        [
            "Allacapan"
        ],
        [
            "Amulung"
        ],
        [
            "Aparri"
        ],
        [
            "Baggao"
        ],
        [
            "Ballesteros"
        ],
        [
            "Buguey"
        ],
        [
            "Calayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "Claveria"
        ],
        [
            "Enrile"
        ],
        [
            "Gattaran"
        ],
        [
            "Gonzaga"
        ],
        [
            "Iguig"
        ],
        [
            "Lal-lo"
        ],
        [
            "Lasam"
        ],
        [
            "Pamplona"
        ],
        [
            "Peñablanca"
        ],
        [
            "Piat"
        ],
        [
            "Rizal"
        ],
        [
            "Sanchez Mira"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Solana"
        ],
        [
            "Tuao"
        ],
        [
            "Component city"
        ],
        [
            "Tuguegarao"
        ],
        [
            "BarangaysSee: List of barangays in Cagayan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa_Ana,_Cagayan&oldid=1223654843\""
        ],
        [
            "Categories: Municipalities of CagayanPort cities and towns in the PhilippinesBeaches of the PhilippinesPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2014All articles needing additional referencesCoordinates on WikidataArticles containing Ibanag-language textArticles containing Ilocano-language textArticles containing Tagalog-language textArticles containing Spanish-language textAll articles with unsourced statementsArticles with unsourced statements from September 2023Wikipedia articles needing clarification from September 2023Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}