{
    "name": "Santa",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa, Ilocos Sur"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoעבריתKapampanganBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°29′10″N 120°26′04″E﻿ / ﻿17.486042°N 120.434444°E﻿ / 17.486042; 120.434444"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Sur, Philippines"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesSanta"
        ],
        [
            "Sta.",
            "Catalina de AlexandriaMunicipalityMunicipality of SantaView of Santa"
        ],
        [
            "FlagSealNickname(s): Gateway to the Cordilleras; Virgen Catalina de AlexandriaMotto: Paspas Santa!",
            "(Faster Santa!",
            ")Anthem: Santa MarchMap of Ilocos Sur with Santa highlightedOpenStreetMapSantaLocation within the PhilippinesCoordinates: 17°29′10″N 120°26′04″E﻿ / ﻿17.486042°N 120.434444°E﻿ / 17.486042; 120.434444CountryPhilippinesRegionIlocos RegionProvinceIlocos SurDistrict"
        ],
        [
            "2nd districtFounded1576Barangays26"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJesus B. Bueno Jr. • Vice MayorJeremy Jesus D. Bueno III • RepresentativeKristine Singson-Meehan • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Eugene B. BorjeLorenzo Q. Formoso Jr.Domingo L. RituaBella G. BelloBenedicto A. BurgonioMarino S. BurgosEncarnita B. dela CuevaReynold B. Queral"
        ],
        [
            " • Electorate10,293 voters (2022)Area • Revenue₱ 145.9 million (2020) • Assets₱ 437.3 million (2020) • Expenditure₱ 101.9 million (2020) • Liabilities₱ 26.04 million (2020)Service provider • ElectricityIlocos Sur Electric Cooperative (ISECO)Time zoneUTC+8 (PST)ZIP code2703PSGC0102922000IDD : area code +63 (0)77Native languagesIlocano TagalogWebsitewww.lgusanta.org"
        ],
        [
            "Santa, officially the Municipality of Santa (Ilocano: Ili ti Santa; Filipino: Bayan ng Santa), is a 4th class municipality in the province of Ilocos Sur, Philippines.",
            "According to the 2020 census, it has a population of 14,992 people."
        ],
        [
            "Due to Santa's natural setting (the ridge of Mount Tetas de Santa in the east;"
        ],
        [
            "Etymology"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(March 2012) (Learn how and when to remove this message)"
        ],
        [
            "These are the probable origins of the municipality's name."
        ],
        [
            "A popular lore tells us that when the scribe of the Spanish explorers was naming the places where they already established settlements, the scribe had a difficult time of thinking of a Catholic Saint's name of saints to name the place (Santa Catalina, Santa Lucia, and Santa Maria were already taken), so the town was simply named \"Santa.\"",
            "(Some versions of the story say that the scribe fell asleep or was drunk when he was writing a name for the town and just wrote \"Santa\".)"
        ],
        [
            "The municipality of Santa was formerly called Santa Catalina de Alexandria, Virgen y Mártir, after the town's patron saint Saint Catherine of Alexandria.",
            "According to folk stories, after the devastation of the town by the first flood in 1852 (Layos Bungsot), the name was shortened to Santa Catalina de Alexandria.",
            "The present name of Santa came to be, after the second flood of 1905 (Layos Nawnaw).",
            "It was believed that by changing the name after the disasters would save the town from further devastation."
        ],
        [
            "History"
        ],
        [
            "Foundation of the pueblo"
        ],
        [
            "According to Augustinian maps of 1831 and 1834, Santa was founded in 1576.",
            "The Augustinian established missionary centers in the towns of Vigan in 1575 and Santa in 1576.",
            "On the founding of Bantay in 1591 as a pueblo, Santa was made its “visita” until 1713 when it became an independent vicariate.",
            "The prestige of the town was boosted in 1802 when the provisional diocese was established and was housed in the rectory of Santa until 1834."
        ],
        [
            "Malong Revolt"
        ],
        [
            "The “Malong Revolt” disturbed the quiet life of the town in 1660-1661 when Andres Malong of Binalatongan (now San Carlos City in Pangasinan province) rose in arms to protest the abuses in the collection of tribute and in the conscription of men for “palo y servicios” (forced labor).",
            "Malong proclaimed himself “King of Pangasinan” and tried to extend his kingdom by sending his Count Pedro Gumapos to Ilocos."
        ],
        [
            "Gumapos pursued the retreating Spaniards who sought refuge in Agoo in present-day La Union.",
            "The Spaniards and the loyalists made their last stand in Pideg, Santa.",
            "Pedro de la Peña, who was defending Pideg Pass, sheltered the great number of the rebels who camped in nearby Narvacan and offered them free passage across Pideg Pass."
        ],
        [
            "Diego Silang revolt"
        ],
        [
            "On December 14, 1762, Diego Silang led the “caillianes” (common man or townsfolk) in the most obstinate insurrection against the Spaniards in the 18th century.",
            "He crystallized the discontent of the “caillianes” caused by the imposition of tribute and forced labor.",
            "He proclaimed a “Free Ilocos” and made Vigan its capital."
        ],
        [
            "When the Spaniards failed to stop Diego Silang in combat, Miguel Vicos aided by Pedro Becbec who were both Silang's trusted friends, betrayed Diego Silang by shooting him in the back on May 26, 1763."
        ],
        [
            "Destructive floods"
        ],
        [
            "A destructive flood called “Layos Bungsot” (literal: \"Flood of Rotting\") of 1852 eroded the first poblacion founded in 1576 and caused the town center to be transferred to a new site, about 4 kilometres (2.5 mi) south of the first site.",
            "Fr.",
            "Pedro Torrices started the new church in 1849-1855 and Fr.",
            "Luis Lagar finished it in 1875."
        ],
        [
            "In 1905, another destructive flood, “Layos Nawnaw” (literal: \"Dissolving Flood\") motivated the people to transfer the poblacion to Pasungol in the southern part of the town in 1907.",
            "Don Domingo Bueno y Ramirez, the presidente municipal (town mayor), transferred the government, and the new poblacion was laid out.",
            "Circumferential roads were laid out in the shape of a spider web with the town plaza in the middle."
        ],
        [
            "American colonial period"
        ],
        [
            "The guerrilla activities of Gen. Manuel Tinio dominated the Philippine–American War in Ilocos.",
            "The civil government of Ilocos Sur began to function in 1899 with Don Mena Crisologo, the former Ilocos Sur delegate to the Malolos Congress, as the first Civil Governor."
        ],
        [
            "World War II and thereafter"
        ],
        [
            "On December 19, 1941, the Imperial Japanese Army landed in Santa.",
            "The people fled to the mountains where they suffered from privations, hunger and diseases.",
            "The Japanese soldiers held a garrison at the south of Quirino Bridge and massacred 70 civilians in Barrio Rizal on January 26, 1945."
        ],
        [
            "In 1945, Filipino forces of the 121st Infantry Regiment, Philippine Commonwealth Army, USAFIP-NL liberated the town and defeated the Japanese Imperial forces at the end of World War II.",
            "On the resumption of the Commonwealth Government, Pres.",
            "Sergio Osmeña appointed Sixto Brillantes after being elected as assemblyman of the second district of Ilocos Sur."
        ],
        [
            "Geography"
        ],
        [
            "The municipality of Santa is triangular shape.",
            "Its northern border, forming the baseline of the triangular land and running in the east–west direction, follow the ever-changing course of the Abra River from the Banaoang Gap in the north-east corner of the town to the sea for about 18 kilometres (11 mi).",
            "Some islands of the river delta are settled by the people of Santa.",
            "The largest island, Barangay Rancho, is connected by a bridge to the main town.",
            "Another island occupied by Brgys.",
            "Dammay and Oribi is only accessible by boat."
        ],
        [
            "It is bordered by the municipality of Bantay to the north, Vigan and Caoayan to the west, San Quintin, Abra to the east and Narvacan to the south"
        ],
        [
            "Santa is 386 kilometres (240 mi) north of Manila and 21 kilometres (13 mi) south of Vigan, the capital of the province.",
            "It can be reached by bus, jeepney and other motorized means of transport by way of the National Highway."
        ],
        [
            "Santa has an area of 109.1 square kilometres (42.1 sq mi), which is distributed in twenty-six (26) barangays and constitutes almost 4.2% of the entire area of the province of Ilocos Sur."
        ],
        [
            "Barangays"
        ],
        [
            "Santa is politically subdivided into 26 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Ampandula"
        ],
        [
            "Banaoang"
        ],
        [
            "Basug"
        ],
        [
            "Bucalag"
        ],
        [
            "Cabangaran"
        ],
        [
            "Calungboyan"
        ],
        [
            "Casiber"
        ],
        [
            "Dammay"
        ],
        [
            "Labut Norte"
        ],
        [
            "Labut Sur"
        ],
        [
            "Mabilbila Norte"
        ],
        [
            "Mabilbila Sur"
        ],
        [
            "Magsaysay District (Poblacion)"
        ],
        [
            "Manueva"
        ],
        [
            "Marcos (Poblacion)"
        ],
        [
            "Nagpanaoan"
        ],
        [
            "Namalangan"
        ],
        [
            "Oribi"
        ],
        [
            "Pasungol"
        ],
        [
            "Quezon (Poblacion)"
        ],
        [
            "Quirino (Poblacion)"
        ],
        [
            "Rancho"
        ],
        [
            "Rizal"
        ],
        [
            "Sacuyya Norte"
        ],
        [
            "Sacuyya Sur"
        ],
        [
            "Tabucolan"
        ],
        [
            "Topography"
        ],
        [
            "The topography of the municipality is undulating to rolling with slope ranging from 0-30%."
        ],
        [
            "Soil and vegetation"
        ],
        [
            "There are three types of soil in Santa, namely: clay loam which is used for crop production, clay on the eastern part of the town and sandy loam on the western part.",
            "Although Santa has fair type of soil, vegetative cover is good for rice, corn, vegetables and fruit-bearing trees."
        ],
        [
            "Mineral resources"
        ],
        [
            "Major mineral resources of the municipality are salt from the coast, and gravel and sand washed down the river banks of Abra River.",
            "Gravel and sand are gathered along the river bank and sold for construction.",
            "Salt-making is found along the coastal barangays of Santa with some of the residents engaged in the industry as their means of livelihood."
        ],
        [
            "Natural and man-made risk areas"
        ],
        [
            "Because of its location, Santa has been plagued by disasters and calamities since the Spanish Colonial Period (See Destructive flooding below).",
            "During heavy rains, large amount of water coming down from the Central Cordillera Mountains flows down to the sea through the Abra River, the sixth largest river system in the Philippines, devastating Santa which traverses the western part of the municipality.",
            "Flood prone areas in the western part of the town include Barangays Pasungol, Tabucolan, Calungboyan, Casiber, Rancho, Oribi and Dammay.",
            "Even places located at the foot of the mountain are also prone to flash floods because of the denuded mountain east of the town.",
            "During the typhoon of June 5, 1999, the storm surge devastated Santa destroying residences along the coastal barangays."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Santa, Ilocos Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "10(0.4)"
        ],
        [
            "10(0.4)"
        ],
        [
            "14(0.6)"
        ],
        [
            "23(0.9)"
        ],
        [
            "80(3.1)"
        ],
        [
            "103(4.1)"
        ],
        [
            "121(4.8)"
        ],
        [
            "111(4.4)"
        ],
        [
            "119(4.7)"
        ],
        [
            "144(5.7)"
        ],
        [
            "39(1.5)"
        ],
        [
            "15(0.6)"
        ],
        [
            "789(31.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5.2"
        ],
        [
            "3.9"
        ],
        [
            "6.2"
        ],
        [
            "9.1"
        ],
        [
            "18.5"
        ],
        [
            "21.4"
        ],
        [
            "22.9"
        ],
        [
            "19.8"
        ],
        [
            "19.8"
        ],
        [
            "16.2"
        ],
        [
            "10.5"
        ],
        [
            "6.1"
        ],
        [
            "159.6"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "The type of climate in Santa is generally the same as the climate of all coastal towns of Ilocos Sur.",
            "There are two seasons in the region, wet and dry season.",
            "The dry season commences in the month of February and ends in the month of June while the wet season is during the rest of the year."
        ],
        [
            "The Philippine Atmospheric, Geophysical and Astronomical Services Administration (PAGASA) data for the municipality gives the annual average temperature at 29 °C (84 °F).",
            "April and May were recorded as the hottest months with a temperature from 29 to 31 °C (84 to 88 °F) respectively while the coldest months are January and February with a temperature ranging from 24 to 21 °C (75 to 70 °F)."
        ],
        [
            "During the rainy season, Santa experience more or less 20 typhoons a year.",
            "Rainfall record of Santa is the same as the records of other municipalities of Ilocos Sur.",
            "Average monthly average during the wet season is estimated at 213 millimetres (8.4 in)."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of SantaYearPop.±% p.a.1903 8,063—    1918 9,748+1.27%1939 10,174+0.20%1948 8,917−1.45%1960 10,214+1.14%YearPop.±% p.a.1970 10,859+0.61%1975 11,799+1.68%1980 11,359−0.76%1990 12,570+1.02%1995 12,801+0.34%YearPop.±% p.a.2000 13,918+1.81%2007 14,059+0.14%2010 15,106+2.65%2015 15,340+0.29%2020 14,992−0.45%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Santa had a population of 14,992.",
            "The population density was 140 inhabitants per square kilometre (360/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Santa"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  20.00"
        ],
        [
            "2009  13.59"
        ],
        [
            "2012  12.64"
        ],
        [
            "2015  11.15"
        ],
        [
            "2018  4.78"
        ],
        [
            "2021  10.40"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Santa, belonging to the second congressional district of the province of Ilocos Sur, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Kristine Singson-Meehan"
        ],
        [
            "Mayor"
        ],
        [
            "Jesus B. Bueno Jr."
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Jeremy Jesus D. Bueno III"
        ],
        [
            "Councilors"
        ],
        [
            "Eugene B. Borje"
        ],
        [
            "Lorenzo Q. Formoso Jr."
        ],
        [
            "Domingo L. Ritua"
        ],
        [
            "Bella G. Bello"
        ],
        [
            "Benedicto A. Burgonio"
        ],
        [
            "Marino S. Burgos"
        ],
        [
            "Encarnita B. dela Cueva"
        ],
        [
            "Reynold B. Queral"
        ],
        [
            "Tourism"
        ],
        [
            "Welcome arch at town center"
        ],
        [
            "Banaoang Gap"
        ],
        [
            "The Banaoang Gap is a water gap about 9 kilometres (5.6 mi) long formed by the Abra River by cutting three consecutive tall mountain ridges in the Ilocos Range.",
            "It separates Santa and Bantay towns and stretches to San Quintin, Abra.",
            "The gap is spanned by the old and new Quirino Bridges connecting the two towns.",
            "A viewing deck is located in Barangay Banaoang in Santa offering dramatic view of the bridge and the broad Abra River backdropped by Mount Tetas de Santa, Mount Binitalo"
        ],
        [
            "Northern Luzon Heroes Hill National Park"
        ],
        [
            "Further information: Northern Luzon Heroes Hill National Park"
        ],
        [
            "Located southeast of Santa and partly in Narvacan, Ilocos Sur,"
        ],
        [
            "Gabriela Silang Memorial Park"
        ],
        [
            "Located west of the national park along the National Highway is the Old Pideg Pass, the historic gateway to Santa, renamed Diego-Gabriela Silang Pass in 1976.",
            "The Gabriela Silang Memorial Park was erected here dedicated to Gabriela who was born in the old barrio of Caniogan in Santa on March 19, 1731, and is regarded as the first heroine of Ilocos."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Santa |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Mount Tetas de Santa\".",
            "Google Maps.",
            "Retrieved on 2012-03-26."
        ],
        [
            "^ a b c d e f g h i \"Profile of Santa\".",
            "Paspas Santa!",
            "Official Website of Santa.",
            "Retrieved on 2012-03-26."
        ],
        [
            "^ a b c d e f \"History\".",
            "Official Website of Santa.",
            "Retrieved on 2012-03-26."
        ],
        [
            "^ a b \"Gabriela Silang\".",
            "National Historical Commission of the Philippines.",
            "Retrieved on 2012-04-05."
        ],
        [
            "^ a b \"Santa, Ilocos Sur\".",
            "Google Maps.",
            "Retrieved on 2012-03-26."
        ],
        [
            "^ a b"
        ],
        [
            "\"Province:\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Santa: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 14 May 2020."
        ],
        [
            "^ (1990).",
            "\"Ilocos Sur\".",
            "National Statistical Coordination Board.",
            "Retrieved on 2012-03-26."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 11, 2022."
        ],
        [
            "^ \"Mount Binitalo\".",
            "Google Maps.",
            "Retrieved on 2012-04-05."
        ],
        [
            "^ \"Banaong View Deck\".",
            "Google Maps.",
            "Retrieved on 2012-04-04."
        ],
        [
            "^ \"Northern Luzon Heroes Hill National Park\".",
            "Google Maps.",
            "Retrieved on 2012-04-05."
        ],
        [
            "^ \"Protected Areas in Region 1\" Archived 2012-03-21 at the Wayback Machine.",
            "Protected Areas and Wildlife Bureau.",
            "Retrieved on 2012-04-05."
        ],
        [
            "^ Teenee (2011-06-08).",
            "A historical marker.",
            "\"Pasong Diego-Gabriela Silang (Santa, Ilocos Sur)\".",
            "Visit Pilipinas.",
            "Retrieved on 2012-04-05."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa, Ilocos Sur."
        ],
        [
            "Municipality of Santa, Ilocos Sur"
        ],
        [
            "Pasyalang Ilocos Sur"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Santa, Ilocos Sur"
        ],
        [
            "Vigan"
        ],
        [
            "Bantay"
        ],
        [
            "Caoayan"
        ],
        [
            "Santa"
        ],
        [
            "San Quintin, Abra"
        ],
        [
            "South China Sea"
        ],
        [
            "Narvacan"
        ],
        [
            "vte Province of Ilocos SurVigan (capital)  Candon (largest city)Municipalities"
        ],
        [
            "Alilem"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bantay"
        ],
        [
            "Burgos"
        ],
        [
            "Cabugao"
        ],
        [
            "Caoayan"
        ],
        [
            "Cervantes"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Lidlidda"
        ],
        [
            "Magsingal"
        ],
        [
            "Nagbukel"
        ],
        [
            "Narvacan"
        ],
        [
            "Quirino"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Juan"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Component cities"
        ],
        [
            "Candon"
        ],
        [
            "Vigan"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Sur"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa,_Ilocos_Sur&oldid=1177422368\""
        ],
        [
            "Categories: Municipalities of Ilocos SurPopulated places on the Abra RiverHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataPages using infobox settlement with possible nickname listInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textArticles needing additional references from March 2012All articles needing additional referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}