{
    "name": "Santa Maria",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa Maria, Ilocos Sur"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°22′19″N 120°28′53″E﻿ / ﻿17.3719°N 120.4814°E﻿ / 17.3719; 120.4814"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Santa Maria, Ilocos Sur\" – news · newspapers · books · scholar · JSTOR (December 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesSanta MariaMunicipalityMunicipality of Santa MariaNuestra Señora de la Asuncion Church"
        ],
        [
            "FlagSealMap of Ilocos Sur with Santa Maria highlightedOpenStreetMapSanta MariaLocation within the PhilippinesCoordinates: 17°22′19″N 120°28′53″E﻿ / ﻿17.3719°N 120.4814°E﻿ / 17.3719; 120.4814CountryPhilippinesRegionIlocos RegionProvinceIlocos SurDistrict"
        ],
        [
            "2nd districtFoundedApril 25, 1765Barangays33"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorBrigido C. Camarillo Jr. • Vice MayorMichael S. Florendo • RepresentativeKristine Singson-Meehan • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Rema Pazvia D. CabatuKristine G. IfurungRomeo A. TanArlon S. SerdeniaMeltodio Mario D. de VeraSeverino T. DagdagDaisy T. AvilaFederico D. Calibuso"
        ],
        [
            " • Electorate20,786 voters (2022)Area • Revenue₱ 428.4 million (2020) • Assets₱ 1,893 million (2020) • Expenditure₱ 111.4 million (2020) • Liabilities₱ 212.9 million (2020)Service provider • ElectricityIlocos Sur Electric Cooperative (ISECO)Time zoneUTC+8 (PST)ZIP code2705PSGC012926000IDD : area code +63 (0)77Native languagesIlocano TagalogMajor religionsRoman CatholicFeast dateAugust 15Catholic dioceseArchdiocese of Nueva SegoviaPatron saintNuestra Señora de AsuncionWebsitewww.santamariailocossur.gov.ph"
        ],
        [
            "Santa Maria, officially the Municipality of Santa Maria (Ilocano: Ili ti Santa Maria; Filipino: Bayan ng Santa Maria), is a 3rd class municipality in the province of Ilocos Sur, Philippines.",
            "According to the 2020 census, it has a population of 30,006 people."
        ],
        [
            "History"
        ],
        [
            "The community of Santa Maria must have been already an organized settlement before the Spaniards came to the Philippines.",
            "When Captain Juan de Salcedo conquered the Ilocos in 1572, they found out that the people were already engaged in a brisk trade and commerce with the Japanese and the Chinese.",
            "The people's main industries were fishing and farming and to some extent weaving of cotton cloth and pottery.",
            "The people were noted for their religiosity.",
            "They worshiped the anitos, spirits and local Gods.",
            "Although the conquest of the Ilocos Region was a slow and painful process for the inhabitants resisted, they were later conquered through the use of the sword and hand in hand with the Cross.",
            "It was the religious nature of the people that the friars greatly exploited to convert the Ilocanos to the new faith — Christianity."
        ],
        [
            "In 1572, Juan De Salcedo established an encomienda in Vigan as more places fell under the control of the Spaniards, more parishes or visitas (sub-parishes) were set up in place that could be easily serviced by the ecclesiastical and military officials.",
            "When Narvacan was created as a definitory by the Augustinians on April 25, 1576, its visitas were Santa Maria, San Esteban and Santiago.",
            "It is recorded that Narvacan was an encomienda of Don Nicolas de Figeroa in 1589; and left vacant in 1610.",
            "During this time, or a period later, Fr.",
            "Diego de Soria who later became bishop expanded the mission or religious control to the hinterlands - extending as far as Pangasinan and to the Cagayan Valley."
        ],
        [
            "In the beginning, Santa Maria experienced hardships due to wars and other events.",
            "In 1638, the Chinese burned the town and ten years later in 1660–1661, during the Andres Malong Revolt, the Zambals ransacked and looted at the same time killed some of the inhabitants of the town.",
            "Much of the church properties were carried away by the rebels.",
            "In 1762, the forces of Diego Silang, the leader of the Ilocos Revolt of 1762–1763 during the British Occupation, controlled the town of Santa Maria until Silang was assassinated in Bantay by his close friend, a mestizo named Miguel Vicos, in 1763."
        ],
        [
            "Establishment as an independent parish"
        ],
        [
            "There are conflicting dates regarding the establishment of this town as an independent parish or mission.",
            "The Catholic Directory of the Philippines as well as sources available at the Filipiniana Division of the National Library and National Archives show that the first Augustinian mission was established in Santa Maria in 1760.",
            "According to Reyes, Santa Maria was erected canonically in 1768; 1765 by Galende and Font; and 1769 by Buzeta, Bravo and Medina.",
            "It is likely that the town reverted to a visita of Narvacan for a period of time because of lacking a priest.",
            "In 1769, it was made again as an independent ministry under the patronage of the Blessed Virgin Mary of the Assumption in whose honor the name of the town was changed from Purok to Santa Maria.",
            "(The National Historical Commission of the Philippines placed the year as 1769, however, the people must have decided to have the foundation of Santa Maria as a separate in 1767 by basing their contention of the records that are still extent in Santa Maria.",
            "So that in 1967, the Santa Maria populace celebrated the 200th Anniversary of her Christianization.)"
        ],
        [
            "From then on, Santa Maria progressed.",
            "During the second half of the eighteenth century, vigorous and active missions or \"expeditions\" were launched by the missionaries toward the hinterlands from Santa Maria.",
            "The Pilar district in Abra was a place where commercial dealings with the natives took place.",
            "Occasionally, the people of Pilar went down to the town of Santa Maria to market and in most visitas, they were instructed into the faith, baptized or received the Holy Sacraments.",
            "(The Pilar district was a part of Ilocos Sur until the latter part of 1846, when it became part of Abra.",
            "It became a politico-military district later.)",
            "By 1800, the visitas of Santa Maria were San Esteban and Santiago.",
            "Fr.",
            "Bernardo Lago made it a religious center and converted thousands of its inhabitants to Christianity."
        ],
        [
            "The following Augustinian missionaries are certain to have stayed in Santa Maria: Fr.",
            "Jose Laboza – 1769; Fr.",
            "Diego Sayar – 1773; Fr.",
            "Agustin Gomez- 1779; Fr.",
            "Manuel Silva- 1783–1785; (and who died there), Fr.",
            "Manuel Aparico – 1887; Fr.",
            "Exequiel Ortiz Lanzagorta – 1791 and who was secretary of the bishop of Nueva Segovia; and Fr.",
            "Alejandro Peyrona in 1786."
        ],
        [
            "Santa Maria's progress can be discerned from the growth of her population.",
            "In 1793, it had 834 inhabitants and ranked fifteenth as one of the most densely populated towns in the Ilocos.",
            "By 1803, it had 7,893 people."
        ],
        [
            "In 1813, a priest by the name Fr.",
            "Juan Cardaño built the irrigation system by digging a canal to divert the river to water the rice fields.",
            "During the construction of the irrigation system, the inhabitants felt embittered by the enforced labor.",
            "In 1817, the town of Santa Maria was fenced under the direction of Fr.",
            "Cardaño who finished the work through use of forced labor on the inhabitants.",
            "Then men were later sent to cut lumber for the shipbuilding industry."
        ],
        [
            "Because of the rapid progress of the Ilocos, the region was divided into Ilocos Norte and Ilocos Sur provinces, pursuant to the Real Cedula as of February 2, 1818.",
            "The population of Santa Maria decreased in 1820 due to the cholera epidemic.",
            "Except for periods when cholera or other natural calamities affected Santa Maria, its progress took an upward trend.",
            "As a result of its progress, Nueva Coveta, now Burgos, was separated from Santa Maria and established in 1831."
        ],
        [
            "In 1850, Buzeta and Bravo describes the town of Santa Maria as follows:"
        ],
        [
            "In 1850, the town had some 1,983 houses constructed like most Philippine houses, some made of wood, most of bamboo and cogon grass.",
            "The more notable edifices were the tribunal, tile roofed and made of stone, on whose ground floor is the prison.",
            "This building is located in the plaza near the market place, where vegetables, eggs, meat and fish are sold.",
            "Sometimes itinerant mestizos sold merchandise there."
        ],
        [
            "In front of the tribunal stood three private houses, also tile-roofed and made of stones, as well as two others, of the same material about to be finished.",
            "The town has a primary school maintained by the coffers of the town.",
            "Moreover, there are private schools for boys and girls."
        ],
        [
            "The Church and tower are made of stone, and the sacristy, of stone and bricks.",
            "Near the house, atop a hill, is the convent of the parish house, which is equally imposing building.",
            "Down below, and 200 meters away, is the cemetery with its well-ventilated chapel, but which was destroyed by earthquake not long ago."
        ],
        [
            "In Santa Maria, mail is received from the North (from Narvacan) every Tuesday morning and those from Manila, through Santiago every Thursday noon.",
            "The town consists of the barrios of Patac (Pacak), in the south, and those of San Gelacio, San Gregorio, and San Francisco which are close to the church (bajo de campana); farther away Tanggapan, Silas, Minorio, Bitalag, Gusing, Subsubosob, Dingtan, and Cabaritan, separated by wide fields but each of these barrios have only a few huts where the natives stay during harvest time."
        ],
        [
            "The town has two ports: one in the west capable of handling big ships, the other in the north, which only handle smaller boats because of its narrow entrance but it can be widened to accommodate bigger ships as it did sometime in the past, when two full-rigged boats were constructed there."
        ],
        [
            "The land is quite fertile, most of which is irrigated; thanks to the zeal of Fr.",
            "Juan Cardaño, present (1850) parish priest who, with the help of the colonial government was able to realize any improvements of the town, including the construction of the irrigation system, after six years of work.",
            "In 1804, when Cardaño took over the parish, the harvest were always in the danger of being lost due to the lack of irrigation, thus only 994 tributes (were paid); now 1850, 2,595 do so."
        ],
        [
            "Their most important products are rice, wheat, cane and corn.",
            "Corn is abundant that it is exported to Santa, Bantay, Santa Catalina, San Vicente and many others.",
            "Oranges, santol and many kinds of bananas, pineapple, cacao are also grown in abundance."
        ],
        [
            "In the mountains nearby, are different kinds of wood, like narra, molave, banaba, panurapin, bulala and others.",
            "Also found there, are chickens, deer and various varieties of birds.",
            "There is a gold mine in Pinsal, which is still to be exploited."
        ],
        [
            "The inhabitants engaged in agriculture, lumbering and the women in weaving cotton cloth; some of which are sold in other places."
        ],
        [
            "By this time in 1850, Santa Maria had a population of 11,900, up from 10,908 in 1845.",
            "By 1865, it was 12,059 and by 1880, 15,152 souls.",
            "There was a drought in 1878 followed by devastation of the fields by locusts and insects; and famine set in."
        ],
        [
            "In 1881, embittered at the Spanish authorities due to the harsh treatment given them, the people stoned the tribunal and almost rose in arms against the Spaniards.",
            "During the great renovation of the convent in 1895, many of the inhabitants migrated to Cuyapo, Nueva Ecija to escape the forced labor and established a new community.",
            "Furthermore, the epidemics of cholera in 1881, 1883, and 1889 reduced greatly her population to 11,426 by 1892."
        ],
        [
            "From the Philippine revolution and thereafter"
        ],
        [
            "During the Philippine revolution, Julian Directo became its first elected president in September 1898.",
            "The members of the Philippine Independent Church (PIC) took over the churches in Ilocos.",
            "It was an offshoot from the abuses of the friars and the effect of the revolution.",
            "The outbreak of the revolution further attributed to the decline of Santa Maria's inhabitants to 10,030 by 1901."
        ],
        [
            "Since the transfer of the Philippine sovereignty to the Americans in December 1898, many of the foreigners who traveled to the north and saw the Church of Santa Maria were much impressed and called the church as a Cathedral.",
            "Henry Savage Landor, an English painter, writer and explorer who visited the Philippines in 1900, says:"
        ],
        [
            "At Santa Maria a most picturesque church is to be found, reached on an imposing flight of steps.",
            "An enormous convent stands beside the church, upon a terrace some 80 feet above the plaza.",
            "There are a number of brick buildings, schoolhouses and office, which must have been very handsome but are tumbling down, the streets being in the absolute possession of sheeps, goats and hogs.",
            "A great expanse of level land was now well-cultivated into paddy fields and across it is a road fifteen feet wide, well-metalled and with a sandy surface.",
            "Barrios and homes were scattered all around the plain."
        ],
        [
            "When civil government was restored in Ilocos Sur under the American rule in 1901, Sinfroso Tamayo became its first president.",
            "According to some records, William Cameron Forbes, a member of the Taft Commission visited Santa Maria in 1901.",
            "A report in 1902 describes Santa Maria as town along the coast of Ilocos Sur, Luzon, (with) several cart roads that led to the interior; a city that built and by way of historical note, adds that on December 3, 1900, 2,150 insurgents surrendered here, (and) took oath of allegiance to the United States."
        ],
        [
            "The Church of Santa Maria and other churches held by the PIC priests were returned to the administration of the Roman Catholic Church by the enactment of the Philippine Commission Act No.",
            "1376 on July 24, 1905.",
            "(In spite of this major decision, the members of the Philippine Independent Church still hold their own in the Ilocos Region today.)"
        ],
        [
            "In 1902, another epidemic of cholera occurred followed by typhoid in 1909.",
            "Floods and typhoons added to the sufferings of the people in 1911 and 1913.",
            "These calamities greatly reduced the population and hindered the progress of Santa Maria.",
            "Many of the people after this period migrated to the central plains of Luzon, Mindanao and to as far as Hawaii and California in the United States of America."
        ],
        [
            "The conditions in Santa Maria greatly changed fifty years later.",
            "The American Occupation had some beneficial effects as then roads, schools and better ways of farming were introduced in Santa Maria.",
            "A new generation became prominent who became new leaders in the present town of Santa Maria.",
            "In 1932, President Manuel Quezon visited Santa Maria on the occasion of his tour of Northern Luzon before the Commonwealth.",
            "After World War II, new buildings were built and churches were erected by the different religious as well as commercial and tourist spots developed."
        ],
        [
            "Geography"
        ],
        [
            "Situated at the western coastline of the island of Luzon, Santa Maria is nestled in a valley surrounded by mountains.",
            "It lies in the central part of the province of Ilocos Sur.",
            "Santa Maria is 369 kilometres (229 mi) from Metro Manila and 38 kilometres (24 mi) from Vigan City, the provincial capital.",
            "It is bordered by the municipality of Narvacan to the north, Pilar, Abra to the east and San Esteban and Burgos, Ilocos Sur to the south"
        ],
        [
            "Barangays"
        ],
        [
            "Santa Maria is politically subdivided into 33 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Ag-agrao"
        ],
        [
            "Ampuagan"
        ],
        [
            "Baballasioan"
        ],
        [
            "Baliw Daya (San Gelacio)"
        ],
        [
            "Baliw Laud (Simbuok)"
        ],
        [
            "Bia-o"
        ],
        [
            "Butir"
        ],
        [
            "Cabaroan"
        ],
        [
            "Danuman East"
        ],
        [
            "Danuman West"
        ],
        [
            "Dunglayan"
        ],
        [
            "Gusing"
        ],
        [
            "Langaoan"
        ],
        [
            "Laslasong Norte"
        ],
        [
            "Laslasong Sur"
        ],
        [
            "Laslasong West"
        ],
        [
            "Lesseb"
        ],
        [
            "Lingsat"
        ],
        [
            "Lubong"
        ],
        [
            "Maynganay Norte"
        ],
        [
            "Maynganay Sur (San Ignacio)"
        ],
        [
            "Nagsayaoan"
        ],
        [
            "Nagtupacan"
        ],
        [
            "Nalvo"
        ],
        [
            "Pacang"
        ],
        [
            "Penned"
        ],
        [
            "Poblacion Norte (San Gregorio)"
        ],
        [
            "Poblacion Sur (San Francisco)"
        ],
        [
            "Silag"
        ],
        [
            "Sumagui"
        ],
        [
            "Suso"
        ],
        [
            "Tangaoan"
        ],
        [
            "Tinaan"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Santa Maria, Ilocos Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "10(0.4)"
        ],
        [
            "10(0.4)"
        ],
        [
            "14(0.6)"
        ],
        [
            "23(0.9)"
        ],
        [
            "80(3.1)"
        ],
        [
            "103(4.1)"
        ],
        [
            "121(4.8)"
        ],
        [
            "111(4.4)"
        ],
        [
            "119(4.7)"
        ],
        [
            "144(5.7)"
        ],
        [
            "39(1.5)"
        ],
        [
            "15(0.6)"
        ],
        [
            "789(31.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5.2"
        ],
        [
            "3.9"
        ],
        [
            "6.2"
        ],
        [
            "9.1"
        ],
        [
            "18.5"
        ],
        [
            "21.4"
        ],
        [
            "22.9"
        ],
        [
            "19.8"
        ],
        [
            "19.8"
        ],
        [
            "16.2"
        ],
        [
            "10.5"
        ],
        [
            "6.1"
        ],
        [
            "159.6"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Santa MariaYearPop.±% p.a.1903 10,082—    1918 11,743+1.02%1939 13,103+0.52%1948 13,637+0.44%1960 16,313+1.50%YearPop.±% p.a.1970 18,819+1.44%1975 19,857+1.08%1980 21,308+1.42%1990 23,821+1.12%1995 24,580+0.59%YearPop.±% p.a.2000 26,396+1.54%2007 28,002+0.82%2010 28,597+0.77%2015 30,321+1.12%2020 30,006−0.21%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Santa Maria had a population of 30,006.",
            "The population density was 470 inhabitants per square kilometre (1,200/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Santa Maria"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  17.20"
        ],
        [
            "2009  16.91"
        ],
        [
            "2012  18.54"
        ],
        [
            "2015  11.33"
        ],
        [
            "2018  4.73"
        ],
        [
            "2021  15.91"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Main highway through Santa Maria"
        ],
        [
            "Located in a fertile region with a cool tropical climate, the principal crops of Santa Maria are corn, cotton, indigo, rice, sugarcane and tobacco."
        ],
        [
            "Santa Maria's economy remained docile for almost four decades, subsisting only with fair performance in the aquaculture and agricultural ventures with no new developments in-place to create job opportunities in the commercial sector.",
            "Tourism industry's growth remains to be seen in the long-term.",
            "Industries relative interests to the town has to be developed and the corresponding infrastructure must be funded and implemented accordingly to create and sustain future development."
        ],
        [
            "Santa Maria is the Home of the First SM SaveMore Market in Ilocos Sur located in Barangay Maynganay Sur in front of the Santa Maria New Public Market."
        ],
        [
            "Local events"
        ],
        [
            "Name of Event"
        ],
        [
            "Date"
        ],
        [
            "Santa Maria Inter-Barangay Basketball Tournament"
        ],
        [
            "March to April"
        ],
        [
            "Santa Maria Town Fiesta - Balicutia Festival"
        ],
        [
            "March / April"
        ],
        [
            "Feast Day of Nuestra Senora de la Asuncion"
        ],
        [
            "August 15"
        ],
        [
            "Santa Maria Children's Christmas Festival"
        ],
        [
            "December 28"
        ],
        [
            "Tourist attractions"
        ],
        [
            "The town is home to the Our Lady of the Assumption Church (Nuestra Señora de la Asuncion), a UNESCO World Heritage Site.",
            "The townspeople celebrate their patronal festival in honor of the Virgin Mary as Our Lady of the Assumption (more commonly known as Apo Baket) every August 15 and lasting for several days."
        ],
        [
            "Nuestra Senora de la Asuncion Church"
        ],
        [
            "Main article: Santa Maria Church"
        ],
        [
            "Nuestra Senora de la Asuncion or Santa Maria Church"
        ],
        [
            "The Church of Our Lady of the Assumption (Nuestra Señora de la Asuncion) (also known as the Santa Maria Church) in Santa Maria is a designated a UNESCO World Heritage Site in 1993 as part of the Baroque Churches of the Philippines collection of four Spanish-era churches."
        ],
        [
            "Pinsal Falls"
        ],
        [
            "Pinsal Falls"
        ],
        [
            "Pinsal Falls, considered as the largest and grandest waterfalls in Ilocos Region, are located in a narrow gorge in Barangay Baballasioan of Santa Maria.",
            "Pinsal is a group of plunge and cascades waterfalls falling from a 300-ft wide irregular shaped river ledge the highest of which is a drop of about 85 feet (26 m).",
            "Upriver are several smaller falls with their own natural pools.",
            "Behind the cascading water of the main falls is a hidden cave where one can swim from.",
            "Another tall waterfall is located at the southern ledge."
        ],
        [
            "The grandeur and pristine beauty of these falls has long been attracting foreign and local tourists.",
            "Crystal clear water cascades down to two natural pools where visitors can frolic during hot summer.",
            "The surrounding hillsides are covered with verdant big trees making the place fairly cool.",
            "A trip to Pinsal Falls is not complete without climbing the carved steps to the top where more natural pools are found, the biggest of which is the 'footprint of Angalo'.",
            "According to the folklore, the ground indentation is the footprint the giant Angalo left behind while searching for his wife Aran.",
            "Another notable geographical feature is a phallic shaped rock, which the legend says belong to the male giant.",
            "Meters from this spot is the famous hot spring where one can boil an egg in 10 to 15 minutes."
        ],
        [
            "Adjacent to Pinsal falls are stones stairs carved out of the mountain to reach the upper falls.",
            "It is also used by the residents of the adjacent town of Pilar, Abra province in hiking to or from the Municipality of Santa Maria."
        ],
        [
            "Pinsal Falls is located about 11 kilometres (6.8 mi) on paved road from the municipal hall of Santa Maria via the Pinsal Falls Road, and can be reached in 20 minutes by any vehicular transportation ."
        ],
        [
            "On August 22, 2019, President Rodrigo Roa Duterte signed Republic Act No.",
            "11409 that declared the falls as a tourist destination, which will prioritize its development by the Department of Tourism."
        ],
        [
            "Santa Maria Agricultural Tramline"
        ],
        [
            "Located in Barangay Baballasioan before Pinsal Falls.",
            "Similar to cable car the first in Ilocos Sur and the first in Ilocos Region.",
            "This facility is not functional, the machine used to rotate the steel rope up to the upper station was submerged by waters coming from the pinsal falls.",
            "The location of this facility is within the ground level of the river downstream from the Pinsal Falls."
        ],
        [
            "Santa Maria Twin Chapel and Ruins"
        ],
        [
            "The compound of Santa Maria East Central School houses the Santa Maria Twin Chapels, the site of the First established parish of Santa Maria, wherein the northern chapel was dedicated to Senor Santo Kristo and the southern chapel was dedicated to Nuestra Senora dela Asuncion.",
            "But only the southern chapels stands nowadays, the northern chapel was damaged.",
            "The Provincial Government of Ilocos Sur is having the plan to restore / rebuilt the damaged chapel."
        ],
        [
            "Santa Maria Spanish Era Cemetery"
        ],
        [
            "it is located 200 meters east of the Santa Maria Church declared as UNESCO World Heritage Site, National Historical Landmark by the National Historical Commission of the Philippines and lately National Cultural Treasure by the National Museum of the Philippines in which this cemetery was included as part of the declaration \"Santa Maria Church & Complex\".",
            "The square shaped cemetery today undergoes in a restoration the whole cemetery site (the brick perimeter fence, the ruins of the chapel and other structures found inside the compound) to preserve its original beauty for the next generation.",
            "The restoration is expected to be finished this December 2019 and to be turned over to the Archdiocese of Nueva Segovia, Parish of Our Lady of the Assumption, and to the Local Government Unit of Sta.",
            "Maria, Ilocos Sur.",
            "After the restoration is said that the site will be declared as another tourist site additional attraction to be visited when visiting the Santa Maria Church."
        ],
        [
            "Santa Maria Old Spanish Bridges"
        ],
        [
            "Built during the 19th century, one of the few remaining bridges built by the Spanish Colonial Authorities, the bridge in the town of Santa Maria is made entirely of bricks.",
            "Proof of its durability and strength, the bridge still withstands the weight of passing busses and trucks.",
            "This Old Spanish Bridge is located in between Poblacion Norte and Baliw Daya."
        ],
        [
            "Another old Spanish Bridge can also be found on the road going to Barangay Cabaroan.",
            "It is not noticeable when you pass by the road unless you go down to the fields.",
            "This bridge is still utilize not only as a bridge but also for irrigation system."
        ],
        [
            "Santa Maria Beach"
        ],
        [
            "Beautiful beaches along Barangay Suso, Nalvo, Lingsat, and Bia-o have clear waters.",
            "These places are very alluring for picnic and swimming for tourists and vacationists.",
            "They are very accessible to all kinds of vehicles.",
            "A road connecting these into one super beach is being planned on ground."
        ],
        [
            "Santa Maria Diving Spot - Suso Reef"
        ],
        [
            "One of the six dive spots being developed and promoted as an Eco-Tourism project by the Provincial Government of Ilocos Sur through the leadership of Gov.",
            "Ryan Singson.",
            "This project aims to help grow tourism in the province, provide alternative livelihood to the coastal communities and reduce fishing pressures on these beautiful marine resources."
        ],
        [
            "Mt.",
            "Caliag (Bantay Calbo) Mountain Hiking"
        ],
        [
            "Highest peak and on this spot you will see the 180 degree view of the town of Santa Maria located in Barangay Pacang through hiking."
        ],
        [
            "Lourdes Grotto and Gazebo"
        ],
        [
            "Located at the foot of the Santa Maria Church.",
            "It is the exact replica of the Lourdes Grotto of Lourdes, France."
        ],
        [
            "Penned Irrigation Dam"
        ],
        [
            "Water from the Pinsal Falls passes through this dam which of the locals uses it as an irrigation and swimming area.",
            "This is located in Barangay Penned."
        ],
        [
            "Santa Maria Lighthouse"
        ],
        [
            "A lighthouse on a side of a hill in Barangay Nalvo near the Super Beach Road.",
            "This lighthouse is visible when passing on the National Highway in Barangay Suso.",
            "This lighthouse is inactive and needs for repairs by the Philippine Coast Guard."
        ],
        [
            "Santa Maria Super Beach Road"
        ],
        [
            "Newly constructed Road connecting Barangay Nalvo and Lingsat.",
            "On this part you can view the captivating beauty of the West Philippine Sea."
        ],
        [
            "The Hill of Suso Beach"
        ],
        [
            "One day, Angalo and his wife Aran were at the what is today called Suso Beach in Santa Maria, Ilocos Sur.",
            "While on the beach, Angalo"
        ],
        [
            "piled up stones, shrubs, and sand to form a hill.",
            "When asked about his creation, he told his wife that he made the hill to resemble and honor her breasts.",
            "To this day.",
            "the hill on the southern side of Suso beach is said to be that hill."
        ],
        [
            "Balikucha, Ilocos Sur"
        ],
        [
            "Balicucha Festival"
        ],
        [
            "In 2023 Easter Sunday, April 9, the heritage town led by Mayor Brigido C. Camarillo Jr. celebrated the week-long Balicucha Festival.",
            "11 Balicucha and other agri-fishery products-inspired floats paraded in front of the World Heritage Site Santa Maria Church."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Santa Maria, belonging to the second congressional district of the province of Ilocos Sur, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Kristine Singson-Meehan"
        ],
        [
            "Mayor"
        ],
        [
            "Brigido C. Camarillo Jr."
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Michael S. Florendo"
        ],
        [
            "Councilors"
        ],
        [
            "Rema Pazvia D. Cabatu"
        ],
        [
            "Kristine G. Ifurung"
        ],
        [
            "Romeo A. Tan"
        ],
        [
            "Arlon S. Serdenia"
        ],
        [
            "Meltodio Mario D. de Vera"
        ],
        [
            "Severino T. Dagdag"
        ],
        [
            "Daisy T. Avila"
        ],
        [
            "Federico D. Calibuso"
        ],
        [
            "Education"
        ],
        [
            "Tertiary levels"
        ],
        [
            "Ilocos Sur Polytechnic State College"
        ],
        [
            "University of Northern Philippines - Branch of the University of Northern Philippines at Barangay Nalvo that houses the Marine Research and Development Center."
        ],
        [
            "St. Mary's College of Santa Maria, Ilocos Sur, Inc. - Private Institution at Santa Maria that offers education courses."
        ],
        [
            "Secondary schools"
        ],
        [
            "Santa Maria has four (4) secondary schools: 1 private and 3 public secondary schools:"
        ],
        [
            "ISPSC - Laboratory High School"
        ],
        [
            "St. Mary's College - High School Department"
        ],
        [
            "Santa Maria National High School"
        ],
        [
            "Ag-agrao National High School"
        ],
        [
            "Public elementary schools"
        ],
        [
            "Santa Maria District has 20 elementary schools: 1 private and 19 public elementary schools:"
        ],
        [
            "St. Mary's College - Elementary Department"
        ],
        [
            "Santa Maria East Central School"
        ],
        [
            "Santa Maria West Centra School"
        ],
        [
            "Ag-agrao Elementary School"
        ],
        [
            "Ampuagan - Langaoan - Lesseb Elementary School"
        ],
        [
            "Baballasioan - Penned Elementary School"
        ],
        [
            "Bia-o - Lingsat Elementary School"
        ],
        [
            "Butir Elementary School"
        ],
        [
            "Cabaroan Elementary School"
        ],
        [
            "Danuman Elementary School"
        ],
        [
            "Dunglayan Elementary School"
        ],
        [
            "Gusing Elementary School"
        ],
        [
            "Laslasong Elementary School"
        ],
        [
            "Maynganay Elementary School"
        ],
        [
            "Nagsayaoan Elementary School"
        ],
        [
            "Nalvo Elementary School"
        ],
        [
            "Silag - Pacang Elementary School"
        ],
        [
            "Suso Elementary School"
        ],
        [
            "Tangaoan Elementary School"
        ],
        [
            "Tinaan Elementary School"
        ],
        [
            "Healthcare"
        ],
        [
            "Judge Celestino Guerrero Memorial Hospital - Poblacion Sur"
        ],
        [
            "Reyes Hospital - Poblacion Sur"
        ],
        [
            "Santo Niño Hospital - Baliw Laud"
        ],
        [
            "Santa Maria Rural Health Unit - - Poblacion Sur"
        ],
        [
            "Ilocos Sur District Hospital - Santa Maria (Soon to Rise)"
        ],
        [
            "Notable personalities"
        ],
        [
            "William Dar - Former Director General of ICRISAT located in India and Secretary of the Department of Agriculture of the Philippine Republic."
        ],
        [
            "Captivating Katkat, Drag Performer, Winner of Drag Race Philippines (Season 2)"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Santa Maria |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Sherwin_magayanes (2009-08-07).",
            "\"Simbahan ng Santa Maria, UNESCO World Heritage Site \".",
            "Panoramio.",
            "Retrieved on 2014-02-07."
        ],
        [
            "^ U.S. War Department (1905-06-30).",
            "\"Annual Reports of the War Department, Vol.",
            "XIV - Acts of the Philippines Commission\", pp.",
            "146–151.",
            "Government Printing Office, Washington."
        ],
        [
            "^"
        ],
        [
            "\"Province: Ilocos Sur\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Santa Maria: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 14 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"An Act Declaring Pinsal Falls in the Municipality of Santa Maria, Province of Ilocos Sur a Tourist Destination, Providing for Its Development and Appropriating Funds Therefor\" (PDF).",
            "Official Gazette of the Republic of the Philippines.",
            "Congress of the Philippines.",
            "August 29, 2019.",
            "Retrieved 11 September 2019."
        ],
        [
            "^ Doe, John.",
            "\"CCP Encyclopedia of Philippine Art: Ilocano Philippine Ethnography\".",
            "National Library of the Philippines.",
            "IT Division, National Library of the Philippines.",
            "Archived from the original on January 29, 2018.",
            "Retrieved February 28, 2018."
        ],
        [
            "^ Lazaro, Freddie (Apr 9, 2023).",
            "\"Balicucha Festival in Ilocos Sur unwraps on Easter Sunday\".",
            "Manila Bulletin.",
            "Retrieved April 17, 2024."
        ],
        [
            "^ Hernando, Ivy (April 7, 2024).",
            "\"Sta.",
            "Maria residents showcase local cuisine through the Balicucha Festival\".",
            "GMA Integrated News.",
            "Retrieved April 17, 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 11, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa Maria, Ilocos Sur."
        ],
        [
            "Wikisource has the text of the 1905 New International Encyclopedia article  \"Santa María\"."
        ],
        [
            "Municipality of Santa Maria Homepage Archived 2022-01-19 at the Wayback Machine"
        ],
        [
            "UNESCO Website"
        ],
        [
            "Baroque Churches of the Philippines"
        ],
        [
            "Department of Tourism"
        ],
        [
            "Pasyalang Ilocos Sur"
        ],
        [
            "Philippine Standard Geographic Code Archived 2012-04-13 at the Wayback Machine"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-05-09 at the Wayback Machine"
        ],
        [
            "Places adjacent to Santa Maria, Ilocos Sur"
        ],
        [
            "Narvacan"
        ],
        [
            "South China Sea"
        ],
        [
            "Santa Maria"
        ],
        [
            "Pilar, Abra"
        ],
        [
            "San Esteban / Burgos"
        ],
        [
            "vte Province of Ilocos SurVigan (capital)  Candon (largest city)Municipalities"
        ],
        [
            "Alilem"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bantay"
        ],
        [
            "Burgos"
        ],
        [
            "Cabugao"
        ],
        [
            "Caoayan"
        ],
        [
            "Cervantes"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Lidlidda"
        ],
        [
            "Magsingal"
        ],
        [
            "Nagbukel"
        ],
        [
            "Narvacan"
        ],
        [
            "Quirino"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Juan"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Component cities"
        ],
        [
            "Candon"
        ],
        [
            "Vigan"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Sur"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa_Maria,_Ilocos_Sur&oldid=1230384669\""
        ],
        [
            "Category: Municipalities of Ilocos SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from December 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}