{
    "name": "Santa Rita",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa Rita, Pampanga"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°59′43″N 120°36′55″E﻿ / ﻿14.99528°N 120.61528°E﻿ / 14.99528; 120.61528"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pampanga, Philippines"
        ],
        [
            "Municipality in Central Luzon, PhilippinesSanta RitaMunicipalityMunicipality of Santa RitaDowntown area"
        ],
        [
            "SealNickname: Sesen taya ing Santa RitaMap of Pampanga with Santa Rita highlightedOpenStreetMapSanta RitaLocation within the PhilippinesCoordinates: 14°59′43″N 120°36′55″E﻿ / ﻿14.99528°N 120.61528°E﻿ / 14.99528; 120.61528CountryPhilippinesRegionCentral LuzonProvincePampangaDistrict"
        ],
        [
            "2nd districtNamed forSt.",
            "Rita of CasciaBarangays10"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorArthur \"Art\" L. Salalila • Vice MayorMercedita \"Mercy\" B. Carreon • RepresentativeGloria Macapagal Arroyo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Reynan S. CaloArthur \"Jr\" Salalila Jr.Kimberly \"Kim\" CosmeRico Sta.",
            "CruzAlvin MartinAlexander \"Alex\" CruzRogelio \"Roy\" GalangRenato \"Nat\" Gopez"
        ],
        [
            " • Electorate28,467 voters (2022)Area • Revenue₱ 139.1 million (2020) • Assets₱ 321.5 million (2020) • Expenditure₱ 143.3 million (2020) • Liabilities₱ 74.13 million (2020)Service provider • ElectricityPampanga 2 Electric Cooperative (PELCO 2)Time zoneUTC+8 (PST)ZIP code2002PSGC0305420000IDD : area code +63 (0)45Native languagesKapampangan TagalogWebsitewww.santaritapampanga.gov.ph"
        ],
        [
            "Santa Rita, officially the Municipality of Santa Rita (Kapampangan: Balen ning Santa Rita; Tagalog: Bayan ng Santa Rita), is a 4th class municipality in the province of Pampanga, Philippines.",
            "According to the 2020 census, it has a population of 48,209 people.",
            "The town of Santa Rita belongs to the Second District of Pampanga, along with the towns in the south-western part of the province.",
            "It is 79 kilometres (49 mi) from Manila."
        ],
        [
            "Santa Rita is famous in Pampanga for the turones de casoy delicacy, which is a cashew candy.",
            "It is chiefly a agricultural town."
        ],
        [
            "History"
        ],
        [
            "In 1697, the town started as a settlement at a place called Gasac, now Barangay San Isidro.",
            "Sta Rita was expanded to a wide territory which is now Barangays San Vicente, San Matias, Santa Monica, San Agustin and San Juan.",
            "Due to Hispanicization, Sta Rita was referred to as Santa Rita de Lele or neighbouring Santa Rita and Santa Rita Baculud.",
            "In 1839, Rev.",
            "Fr.",
            "Francisco Rayo, the town’s parish priest, spearheaded the herculean task of building the present Parish Church located in now known as Barangay San Jose."
        ],
        [
            "Geography"
        ],
        [
            "Santa Rita is landlocked, located in the centre of the coastal province of Pampanga."
        ],
        [
            "Barangays"
        ],
        [
            "Santa Rita is politically subdivided into 10 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Becuran"
        ],
        [
            "Dila Dila"
        ],
        [
            "San Agustin"
        ],
        [
            "San Basilio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (poblacion)"
        ],
        [
            "San Juan"
        ],
        [
            "San Matias (poblacion)"
        ],
        [
            "Santa Monica"
        ],
        [
            "San Vicente (poblacion)"
        ],
        [
            "The largest barangays are Dila-dila and San Basilio which occupy more than half (52%) of the total municipal land area.",
            "Barangays San Agustin and San Vicente with only a space of 2% and 2.13%, of the whole municipal land area are the smallest barangays."
        ],
        [
            "There are three barangays which compose the poblacion of Santa Rita: barangays San Vicente, San Jose and part of San Matias.",
            "Barangay San Vicente serves as the minor Central Business District.",
            "It is where the Public Market is located, while Santa Rita Church and the Municipal Hall are located in Barangay San Jose.",
            "Mixed old and new houses surround the area."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Santa Rita, Pampanga"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "20(68)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "8(0.3)"
        ],
        [
            "9(0.4)"
        ],
        [
            "15(0.6)"
        ],
        [
            "34(1.3)"
        ],
        [
            "138(5.4)"
        ],
        [
            "203(8.0)"
        ],
        [
            "242(9.5)"
        ],
        [
            "233(9.2)"
        ],
        [
            "201(7.9)"
        ],
        [
            "126(5.0)"
        ],
        [
            "50(2.0)"
        ],
        [
            "21(0.8)"
        ],
        [
            "1,280(50.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3.7"
        ],
        [
            "4.1"
        ],
        [
            "6.5"
        ],
        [
            "11.2"
        ],
        [
            "21.2"
        ],
        [
            "24.9"
        ],
        [
            "27.7"
        ],
        [
            "26.5"
        ],
        [
            "25.5"
        ],
        [
            "21.8"
        ],
        [
            "12.6"
        ],
        [
            "5.6"
        ],
        [
            "191.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Santa RitaYearPop.±% p.a.1903 7,954—    1918 8,989+0.82%1939 10,801+0.88%1948 12,684+1.80%1960 15,492+1.68%1970 19,439+2.29%1975 22,167+2.67%1980 24,995+2.43%YearPop.±% p.a.1990 28,296+1.25%1995 32,321+2.52%2000 32,780+0.30%2007 36,723+1.58%2010 38,762+1.99%2015 40,979+1.06%2020 48,209+3.25%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Santa Rita, Pampanga, was 48,209 people, with a density of 1,600 inhabitants per square kilometre or 4,100 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Santa Rita"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "9"
        ],
        [
            "10"
        ],
        [
            "2006  5.70"
        ],
        [
            "2009  9.38"
        ],
        [
            "2012  4.91"
        ],
        [
            "2015  7.03"
        ],
        [
            "2018  4.10"
        ],
        [
            "2021  8.42"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Santa Rita is a fourth class municipality in the province of Pampanga, Philippines."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Santa Rita Town Hall"
        ],
        [
            "Like other towns in the Philippines, Santa Rita is governed by a mayor and vice mayor who are elected to three-year terms.",
            "The mayor is the executive head and leads the town's departments in executing the ordinances and improving public services.",
            "The vice mayor heads a legislative council (Sangguniang Bayan) consisting of councilors from the Barangays or Barrios."
        ],
        [
            "The municipal government is divided into three branches: executive, legislative and judiciary.",
            "The judicial branch is administered solely by the Supreme Court of the Philippines.",
            "The LGUs have control of the executive and legislative branch."
        ],
        [
            "The executive branch is composed of the mayor and the barangay captain for the barangays.",
            "The legislative branch is composed of the Sangguniang Bayan (town assembly), Sangguniang Barangay (barangay council), and the Sangguniang Kabataan for the youth sector."
        ],
        [
            "The seat of Government is vested upon the Mayor and other elected officers who hold office at the Town hall.",
            "The Sanguniang Bayan is the center of legislation."
        ],
        [
            "Elected officials"
        ],
        [
            "The Local Government Unit LGU of Santa Rita, Pampanga's Elected officials for the term of 2022-2025 are:"
        ],
        [
            "Mayor: Arthur \"Art\" Salalila"
        ],
        [
            "Vice mayor: Mercedita \"Mercy\" Bonaobra Carreon"
        ],
        [
            "Sangguniang Bayan Members"
        ],
        [
            "Reynan Calo"
        ],
        [
            "Arthur \"Jr\" Salalila"
        ],
        [
            "Kimberly \"Kim\" Cosme"
        ],
        [
            "Rico Sta.",
            "Cruz"
        ],
        [
            "Alvin Martin"
        ],
        [
            "Alexander \"Alex\" Cruz"
        ],
        [
            "Rogelio \"Roy\" Galang"
        ],
        [
            "Renato \"Nat\" Gopez"
        ],
        [
            "Heritage, culture, landmarks and attractions"
        ],
        [
            "This section contains content that is written like an advertisement.",
            "Please help improve it by removing promotional content and inappropriate external links, and by adding encyclopedic content written from a neutral point of view.",
            "(November 2019) (Learn how and when to remove this message)"
        ],
        [
            "Dúman (Green Gold) festival & Santa Rita Delicacies"
        ],
        [
            "Dúman (Susie's of Tarlac)."
        ],
        [
            "Ocampo Lansang Delicacies (Turones de Casuy, Sansrival, Uraro)."
        ],
        [
            "Santa Rita is the home of Dúman and Ocampo-Lansang Delicacies (Turones de Casuy, Sansrival, Uraro and other sweets that sell in SM City Malls nationwide)."
        ],
        [
            "Dúman is made of malagkit rice (lacatan malútû) that is beaten from its husks and toasted in a clay oven.",
            "To the rest of the country, it may just be plain green rice or even un-popped pinipig.",
            "But it is a prized seasonal food that can be found during the Christmas season, after the rice harvest in November.",
            "The younger kernels of rice that don't fall off the husks are colored green.",
            "These husks are beaten against a hard surface until they fall off.",
            "They are then soaked in water, cooked for 30 minutes and then pounded.",
            "This rigorous process helps release the sweet oils and nuttiness of the rice."
        ],
        [
            "Families who produce duman rice are called Mágdurúman.",
            "They pass their methods from generation to generation and have kept to the manual production process.",
            "Throughout Pampanga, street vendors selling green rice in bilaos or flat baskets are seen.",
            "These vendors often sell dúman near churches or marketplaces.",
            "It can be eaten plain and munched on like popcorn.",
            "It can also be snacked on in spoonfuls with sugar or made into rice cakes.",
            "Kapampangans also like adding dúman to other dishes like fresh carabao's milk or hot chocolate as a breakfast cereal, or even ice cream."
        ],
        [
            "Harvested and processed through the end of December, dúman is usually eaten with fresh carabao milk (gátas damúlag) for breakfast or stirred into sucláti (drinking chocolate made with Philippine cacao).",
            "In Santa Rita, a Pampangan municipality and the epicenter of dúman production, the eagerly awaited specialty is honored annually with its own festival."
        ],
        [
            "Years ago, during dúman season, Santa Rita's streets rang daily with the “tok-tok” of baseball bat-sized wooden pestles hitting meter-high mortars as lacatan malútû, a red-husked variety of glutinous rice, was transformed into dúman.",
            "Nowadays, only a few barangays engage in the laborious and time-consuming production process."
        ],
        [
            "The Dúman Festival started in 2002, which originated from the long-standing tradition of pounding and winnowing unripe glutinous rice (lacatan).",
            "The festival features alfresco dining in front of the Santa Rita Church patio were rows and rows of delicacy stalls would sell various pastries and native dishes of the town with duman being the major highlight.",
            "The food sold during the festival would include native pastry attractions of the town like sansrival, masa podrido, mamón and mamón tostado."
        ],
        [
            "Dúman is relatively expensive.",
            "Food critic Claude Tayag explains that unlike the regular rice variety, which can be planted and harvested three times a year, dúman can only be harvested in the cool air of November and December, otherwise it will not be a bountiful one.",
            "For every hectare (San Agustín and Santa Mónica), a farmer can produce only a maximum of 4.5 cavans of duman, while a maximum of 300 cavans can be harvested from the regular rice variety.",
            "Dúman prices range from P600 to P1,000 per kilo depending on the quality."
        ],
        [
            "Santa Rita de Casia Parish Church"
        ],
        [
            "Santa Rita of Casia Parish Church"
        ],
        [
            "The heritage Church is under the jurisdiction of the Roman Catholic Archdiocese of San Fernando."
        ],
        [
            "Fr.",
            "Pedro de San Nicolas served as minister of both Porac and Santa Rita in 1722, but it was only in 1726 when Santa Rita had its own priest and therefore became an independent parish.",
            "Fr.",
            "Francisco Royo built the present church in 1839; Fr.",
            "Juan Merino completed it in 1868.",
            "These two priests also opened the road linking Santa Rita with Porac and Guagua.",
            "During the Revolution, the townspeople hid their last Augustianian parish priest, Fr.",
            "Celestino Garcia in their houses until the forces of Gen. Maximino Hizon captured him in Bacolor and took him all the way to Lepanto in the Cordilleras."
        ],
        [
            "Building of the church had to be delayed until the late 19th century due to economic adjuristicial conditions.",
            "The single-nave church is 55m long, 13m wide and 10m high.",
            "It has a large and well lit transept.",
            "The solid brass facade has baroque characteristics and the single columns are relatively slender."
        ],
        [
            "The reliquary"
        ],
        [
            "Altar of St. Rita de Casia"
        ],
        [
            "The parish is the site where the Holy Relic of Saint Rita de Cascia is enshrined.",
            "The parish first obtained the First Class Relic of the saint through the help and assistance of His Excellency, Most Rev.",
            "Riccardo Fontana of Spoleto-Norcia, Italy, the archdiocese to which Cascia belongs.",
            "Archbishop Fontana forwarded the Relic through the mediation of the Apostolic Nunciature in Manila to Archbishop Paciano Aniceto who in turn handed it over to the parish of Santa Rita de Cascia on August 17, 2008.",
            "The First Class Relic is from the flesh “ex carne”of the Saint.",
            "As noted in its accompanying Certificate of Authenticity, the relic was part of the last batch extracted from the incorrupt body of Saint Rita on 20 August 1972."
        ],
        [
            "The reliquary is laid open for public veneration every August 17.",
            "St. Rita of Cascia (1381) was born in the Italian town of Roccaporena.",
            "When her husband and twin sons died, she entered the Augustinian Nuns.",
            "The next 40 years of her life saw St. Rita devoting herself to a life of prayer and works and deeds of charity as dictated by the rules of St Augustine.",
            "At age 60, while meditating before the cross, a wound seeming afflicted by a thorn appeared on her forehead.",
            "St. Rita began boring the sign of stigmatization which is considered being one with Jesus.",
            "Because of the stigmata, she suffered in pain for the next 15 years which she courageously accepted.",
            "St. Rita died on May 22, 1457.",
            "Her intact and incorrupt body is kept and honored in the shrine at her hometown on Cascia, Italy."
        ],
        [
            "See also"
        ],
        [
            "Historic houses in Santa Rita, Pampanga"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Santa Rita |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"History of Santa Rita\".",
            "Official Website of Santa Rita.",
            "Retrieved 2021-10-26."
        ],
        [
            "^ \"Santa Rita Pampanga History, Tourist Spots, Festival - PeoPlaid Profile\".",
            "PeoPlaid.",
            "2020-06-20.",
            "Retrieved 2021-10-26."
        ],
        [
            "^"
        ],
        [
            "\"Santa Rita: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 5 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Local Government Code of the Philippines, Book III Archived 2009-03-26 at the Wayback Machine, Department of the Interior and Local Government official website"
        ],
        [
            "^ Duman: The Little Known Pampango Treat | OpenRice Philippines"
        ],
        [
            "^ 10th Duman Festival all set on December 3 | Sun.Star"
        ],
        [
            "^  sta.",
            "rita, pampanga, philippines: profile & brief history"
        ],
        [
            "^ \"国产在线精品亚洲二区,日本片黄网站色大全免费,日日摸处处碰天天看,最近中文字幕完整视频,久久一日本道色综合久久\"."
        ],
        [
            "^ a b Pampanga Churches"
        ],
        [
            "^ a b Department of Tourism - The Philippines Ultimate Travel Guide for Tourist"
        ],
        [
            "^ a b : Santa Rita de Cascia :.",
            ".",
            ": History of Santa Rita de Cascia Parish :"
        ],
        [
            "^ Welcome santaritaparishasf.org - BlueHost.com"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa Rita, Pampanga."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Santa Rita, Pampanga"
        ],
        [
            "Bacolor"
        ],
        [
            "Porac"
        ],
        [
            "Santa Rita"
        ],
        [
            "Guagua"
        ],
        [
            "Guagua"
        ],
        [
            "vte Province of PampangaSan Fernando (capital)  Angeles City (largest city)Municipalities"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Candaba"
        ],
        [
            "Floridablanca"
        ],
        [
            "Guagua"
        ],
        [
            "Lubao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Masantol"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Porac"
        ],
        [
            "San Luis"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Component cities"
        ],
        [
            "Mabalacat"
        ],
        [
            "San Fernando"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Angeles (Administratively independent from the province but grouped under Pampanga by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa_Rita,_Pampanga&oldid=1231537084\""
        ],
        [
            "Category: Municipalities of PampangaHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Kapampangan-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from June 2014Articles with a promotional tone from November 2019All articles with a promotional toneCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}