{
    "name": "Santa Rosa",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa Rosa, Nueva Ecija"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°25′26″N 120°56′20″E﻿ / ﻿15.4239°N 120.9389°E﻿ / 15.4239; 120.9389"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Nueva Ecija, Philippines"
        ],
        [
            "Not to be confused with Santa Rosa, Laguna."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Santa Rosa, Nueva Ecija\" – news · newspapers · books · scholar · JSTOR (December 2022) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesSanta RosaMunicipalityMunicipality of Santa RosaDowntown"
        ],
        [
            "FlagSealMap of Nueva Ecija with Santa Rosa highlightedOpenStreetMapSanta RosaLocation within the PhilippinesCoordinates: 15°25′26″N 120°56′20″E﻿ / ﻿15.4239°N 120.9389°E﻿ / 15.4239; 120.9389CountryPhilippinesRegionCentral LuzonProvinceNueva EcijaDistrict"
        ],
        [
            "3rd districtFoundedAugust 1, 1878Barangays33"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJosefino M. Angeles • Vice MayorAtty.",
            "Ethel Catherine Jean Angeles-Roxas • RepresentativeRosanna V. Vergara • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Ma.Cerissa AngelesIrene S. BernardoRamil SumeraDennis D. DimacaliGlenn B. SantosArdee SantiagoClaudine BaldazoAntonio RomeroSK Federal President Vera Liane Gabriel"
        ],
        [
            " • Electorate48,393 voters (2022)Area • Revenue₱ 253.5 million (2020) • Assets₱ 686.5 million (2020) • Expenditure₱ 234.2 million (2020) • Liabilities₱ 243.5 million (2020)Service provider • ElectricityNueva Ecija 2 Area 2 Electric Cooperative (NEECO 2 A2)Time zoneUTC+8 (PST)ZIP code3101PSGC034928000IDD : area code +63 (0)44Native languagesTagalog Ilocano"
        ],
        [
            "Santa Rosa, officially the Municipality of Santa Rosa (Tagalog: Bayan ng Santa Rosa) is a 1st class municipality in the province of Nueva Ecija, Philippines.",
            "According to the 2020 census, it has a population of 75,649 people."
        ],
        [
            "History"
        ],
        [
            "An ancestral house in the poblacion area"
        ],
        [
            "Santa Rosa, according to the National Historical Commission of the Philippines, was founded as a municipality on August 1, 1878, through a Spanish decree.",
            "In his letter dated March 9, 2017, NHCP OIC-Chairman Rene Escalante said the Spanish decree was retrieved from the Archivo Historico Nacional in Madrid, Spain and is entitled \"Creacion de un pueblo civil formado por al barrio de Santa Rosa en la provincia de Nueva Ecija\"."
        ],
        [
            "In his book, Nueva Ecija: 1896–1946, Cesar Baroman wrote that Santa Rosa was a mere bisita of Cabanatuan before while Cabanatuan was a barrio of Gapan."
        ],
        [
            "During the American occupation, the Philippine Commission enacted Act.",
            "Number 933 (\"An Act reducing the 23 municipalities of the province of Nueva Ecija to fifteen\") on October 8, 1903, which merged Santa Rosa with Cabanatuan."
        ],
        [
            "In 1907, Act Number 1687 (\"An Act to increase the number of municipalities in the province of Nueva Ecija from 14 to 15, by separating from Cabanatuan the former municipality of Santa Rosa, reconstituting the latter as a municipality, and giving to each the territory it comprised prior to the passage of Act 933\") was enacted by the Philippine Commission which separated Santa Rosa from Cabanatuan.",
            "According to Act #1687, the Municipal President would receive P400 per year while the Municipal Treasurer would get a salary of P300/year."
        ],
        [
            "Geography"
        ],
        [
            "Santa Rosa is bounded by Cabanatuan to the north, Laur to the east, General Tinio to the south-east, Peñaranda and San Leonardo to the South, Jaen to the south-west, and Zaragoza to the west.",
            "The Pampanga River traverses near the center of the municipality."
        ],
        [
            "Santa Rosa is 9 kilometres (5.6 mi) from Cabanatuan, 23 kilometres (14 mi) from Palayan, and 107 kilometres (66 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Santa Rosa is politically subdivided into 33 barangays.",
            "Each barangay consists of seven puroks and some have sitios."
        ],
        [
            "The Punong Barangay heads the Barangay Government, assisted by the Barangay Kagawads (Councilors).",
            "There is also a Barangay Secretary, Barangay Treasurer, Hepe ng Tanod (Chief), Barangay Tanods, Barangay Health Workers and BNS, Day Care Worker in every barangay.",
            "In 2018, SK Chairpersons and SK Kagawads were elected.",
            "The SK Chairperson became a member of the Sangguniang Barangay.",
            "There is a chapter of the Liga ng Barangay at Santa Rosa and it is currently headed by LNB President Marcial Rommel Marcelo.",
            "The present SK Federation President is Vera Liane Gabriel who is the SK Chairperson at Barangay Tramo.",
            "The BHWs and Day Care Workers have an organization at the municipal-level."
        ],
        [
            "Cojuangco (Poblacion)"
        ],
        [
            "La Fuente"
        ],
        [
            "Liwayway"
        ],
        [
            "Malacañang"
        ],
        [
            "Maliolio"
        ],
        [
            "Mapalad"
        ],
        [
            "Rizal (Poblacion)"
        ],
        [
            "Rajal Centro"
        ],
        [
            "Rajal Norte"
        ],
        [
            "Rajal Sur"
        ],
        [
            "San Gregorio"
        ],
        [
            "San Mariano"
        ],
        [
            "San Pedro"
        ],
        [
            "Santo Rosario"
        ],
        [
            "Soledad"
        ],
        [
            "Valenzuela (Poblacion)"
        ],
        [
            "Zamora (Poblacion)"
        ],
        [
            "Aguinaldo"
        ],
        [
            "Berang"
        ],
        [
            "Burgos"
        ],
        [
            "Del Pilar"
        ],
        [
            "Gomez"
        ],
        [
            "Inspector"
        ],
        [
            "Isla"
        ],
        [
            "Lourdes"
        ],
        [
            "Luna"
        ],
        [
            "Mabini"
        ],
        [
            "San Isidro"
        ],
        [
            "San Joseph"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Sapsap"
        ],
        [
            "Tagpos"
        ],
        [
            "Tramo"
        ],
        [
            "Originally, Santa Rosa had 3 barangays or barrios during the Spanish period: Soledad, La Fuente and Rajal.",
            "In 1903, the number of barrios became four with the addition of Poblacion.",
            "Later on, the number of barrios increased to 17, namely, Cojuangco, La Fuente, Liwayway, Malacanang, Maliolio, Mapalad, Rizal, Rajal Centro, Rajal Norte, Rajal Sur, San Gregorio, San Mariano, San Pedro, Santo Rosario, Soledad, Valenzuela and Zamora."
        ],
        [
            "During the term of Mayor Juanito Bernardo (1988–1998), the 17 barangays became 33 barangays.",
            "Some barangays such as San Gregorio, San Mariano, La Fuente, Santo Rosario and San Pedro were subdivided.",
            "San Gregorio, for example, was divided into 5 barangays (Aguinaldo, Burgos, Mabini, Tramo and San Gregorio); San Mariano became four barangays (Del Pilar, Gomez, Luna and San Mariano); La Fuente became 3 barangays (La Fuente, San Joseph and Sapsap); Santo Rosario became two barangays (Inspector and Santo Rosario) and San Pedro became two barangays (San Isidro and San Pedro)."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Santa Rosa, Nueva Ecija"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "4(0.2)"
        ],
        [
            "4(0.2)"
        ],
        [
            "5(0.2)"
        ],
        [
            "11(0.4)"
        ],
        [
            "66(2.6)"
        ],
        [
            "99(3.9)"
        ],
        [
            "127(5.0)"
        ],
        [
            "113(4.4)"
        ],
        [
            "99(3.9)"
        ],
        [
            "84(3.3)"
        ],
        [
            "35(1.4)"
        ],
        [
            "14(0.6)"
        ],
        [
            "661(26.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "2.2"
        ],
        [
            "1.9"
        ],
        [
            "3.2"
        ],
        [
            "5.3"
        ],
        [
            "16.1"
        ],
        [
            "20.8"
        ],
        [
            "23.5"
        ],
        [
            "22.8"
        ],
        [
            "22.2"
        ],
        [
            "16.5"
        ],
        [
            "8.9"
        ],
        [
            "3.5"
        ],
        [
            "146.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Santa RosaYearPop.±% p.a.1903 3,253—    1918 6,915+5.16%1939 12,809+2.98%1948 11,764−0.94%1960 15,989+2.59%1970 22,554+3.50%1975 25,732+2.68%1980 32,424+4.73%YearPop.±% p.a.1990 40,439+2.23%1995 47,522+3.07%2000 51,804+1.87%2007 58,762+1.75%2010 64,503+3.45%2015 69,467+1.42%2020 75,649+1.69%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Santa Rosa"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  24.60"
        ],
        [
            "2009  14.99"
        ],
        [
            "2012  15.62"
        ],
        [
            "2015  13.25"
        ],
        [
            "2018  4.01"
        ],
        [
            "2021  9.60"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Santa Rosa primarily depends on rice cultivation, vegetable production, commercial fishery, and tricycle sidecar fabrication.",
            "Just recently, the town started realizing its development potential."
        ],
        [
            "The town's strategic location at the crossroads of two national highways: the Maharlika Highway and the Tarlac-Santa Rosa-Fort Magsaysay Road is accelerating its commercial and industrial development.",
            "It is also inevitably set to benefit from the spillover of Cabanatuan's built-up area."
        ],
        [
            "As a result, Santa Rosa is gradually replacing agriculture with services and agro-industry as the main engines for growth.",
            "The stretch of Maharlika Highway is a growing commercial strip of local entrepreneurs competing with national businesses while the eastern part of the town is attracting investments in large commercial farms."
        ],
        [
            "As of 2017, based on Commission on Audit of the Philippines, Santa Rosa economic status was:"
        ],
        [
            "Income – P190,671,476.98"
        ],
        [
            "Assets – P470,150,569.41"
        ],
        [
            "Liabilities – P181,022,725.17"
        ],
        [
            "Allotments – 294,983,551.31"
        ],
        [
            "Concurrent to Santa Rosa's rapid growth is the buildup of perennially heavy traffic at the approach to the intersection of the national roads.",
            "To address the worsening situation, the local government teamed up with the Cabanatuan city government to construct a road that will bypass the town proper.",
            "As for Santa Rosa, only further growth is anticipated when Central Luzon Link Expressway and North Luzon East Expressway finally materialize."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Santa Rosa municipal hall"
        ],
        [
            "Pursuant to the Local government in the Philippines, the political seat of the municipal government is located at the Municipal Town Hall.",
            "In the History of the Philippines (1521–1898), the Gobernadorcillo was the Chief Executive who holds office in the Presidencia.",
            "In 1895, the Spaniards changed the position of Gobernadorcillo to Capitan Municipal.",
            "(Local Government in the Philippines, Jose P. Laurel) During the American rule (1898–1946) (History of the Philippines (1898–1946)), the elected Mayor and local officials, including the appointed ones, held office at the Municipal Town Hall."
        ],
        [
            "Under the Local Government Code of 1991 or Republic Act No.",
            "7160, the Mayor acts as the Local Chief Executive and the different departments (Budget, Engineering, Treasury, Accounting, etc.)",
            "are under the supervision of the Mayor.",
            "The Vice Mayor, on the other hand, is the Presiding Officer of the Sangguniang Bayan/Sangguniang Panlungsod which enacts ordinances or issues Resolutions.",
            "The LGC of 1991, primarily authored by former Senator Aquilino \"Nene\" Pimentel Jr., gave local autonomy to local government units (LGUs) at the provincial, city/municipal and barangay level.",
            "The LGUs were provided with Internal Revenue Allotment (IRA) that gave them a substantial amount of public funds aside from the locally generated funds (real property tax, fees, charges).",
            "Functions and services formerly provided by national government agencies such as the Dept.",
            "of Agriculture, Dept.",
            "of Health, Dept.",
            "of Social Welfare and Development were devolved to the provincial and city/municipal LGUs."
        ],
        [
            "During the last National and Local Elections in 2022, the following were elected as local officials of Santa Rosa: Mayor: Josefino Angeles; Vice Mayor: Atty.",
            "Ethel Catherine Jean Angeles-Roxas; Municipal Councilors: Ma.",
            "Cerissa Angeles, Ardee Santiago, Ramil Sumera, Antonio Romero, Claudine Baldazo, Dennis Dimacali, Irene Bernardo and Glenn Santos.",
            "ABC President Marcial Rommel Marcelo and SK Federation President Vera Gabriel are also members of the Sangguniang Bayan."
        ],
        [
            "The local officials elected for 2019–2022 were Mayor Josefino M. Angeles while the Vice Mayor was Marie C. Evangelista.",
            "The Municipal Councilors were Romeo Angeles, Irene Bernardo, Dennis Dimacali, Roberto Jacinto, Armando Manuel, Marjorie Matias, Julian Mendoza and Glenn Santos.",
            "ABC President Rommel Marcelo and SK Federal President Vera Liane Gabriel were also members of the Sanggunang Bayan."
        ],
        [
            "Previous Mayors and Vice Mayors"
        ],
        [
            "The previous Mayors of Santa Rosa were the following:"
        ],
        [
            "Eulalio Saulo, 1909–1911"
        ],
        [
            "Dionisio Punsal, 1911–1913"
        ],
        [
            "Rafael Andres, 1917–1919"
        ],
        [
            "Apolinario Manubay, 1919–1921"
        ],
        [
            "Amado del Barrio, 1923–1928"
        ],
        [
            "Matias Beley, 1929–1931"
        ],
        [
            "Casimiro Marcelo, 1932–1939"
        ],
        [
            "Lazaro Cajucom, 1941–1944"
        ],
        [
            "Jacinto Martin, 1945–1947"
        ],
        [
            "Bonifacio Santos, 1948–1951"
        ],
        [
            "Severino Angeles, 1952–1959"
        ],
        [
            "and in 1964–1971"
        ],
        [
            "Pedro Manubay, 1960–1963"
        ],
        [
            "Cesar Angeles, 1972–1985"
        ],
        [
            "Eduardo Enrile, 1985–1986"
        ],
        [
            "Juanito Bernardo, 1988–1998"
        ],
        [
            "Edgar Matias, July 1998 – December 1998"
        ],
        [
            "Geronimo Baldazo, December 1998–2001"
        ],
        [
            "Marlon Marcelo, 2001–2007"
        ],
        [
            "Josefino Manucot Angeles, 2007–2016"
        ],
        [
            "Marita Chua Angeles 2016–2019"
        ],
        [
            "Josefino M. Angeles, 2019–2022"
        ],
        [
            "Josefino M. Angeles, 2022–2025"
        ],
        [
            "The following served as Vice Mayors of Santa Rosa:"
        ],
        [
            "Benito Germino, 1952–1959"
        ],
        [
            "and in 1964–1971"
        ],
        [
            "Marciano Marcelo, 1969–1979"
        ],
        [
            "Eduardo Ennrile, 1972–1985"
        ],
        [
            "Rufino Galman, 1985–1988"
        ],
        [
            "Sesinando Santos, 1988–1992"
        ],
        [
            "Edgar Matias, 1992–1998"
        ],
        [
            "Gerry Baldazo, 1998"
        ],
        [
            "Julian \"Jojo\" Mendoza, 1998–2001"
        ],
        [
            "Josefino \"Otep\" Angeles, 2001–2007"
        ],
        [
            "Irene Bernardo, 2007–2013"
        ],
        [
            "Antonio Romero, 2013–2016"
        ],
        [
            "Eliseo Angeles, 2016–2019"
        ],
        [
            "Marie Evangelista, 2019–2022"
        ],
        [
            "Atty.",
            "Ethel Catherine Jean Angeles-Roxas, 2022–2025"
        ],
        [
            "SGLG Awardee"
        ],
        [
            "The LGU of Santa Rosa is an awardee of the Seal of Good Housekeeping (SGH) in 2011 and Seal of Good Local Governance (SGLG) in 2017, 2018, 2019 and 2022.",
            "These two awards are given by the Department of the Interior and Local Government to local government units which practice good governance, transparency and accountability."
        ],
        [
            "Tourism"
        ],
        [
            "Santa Rosa's main landmark includes Santa Rosa Supermarket or \"Pamilihang Bayan ng Santa Rosa\", Santa Rosa Town Hall, Santa Rosa Town Park, Santa Rosa Central School, and St. Rose of Lima Parish Church.",
            "Other attractions which are most visited by tourists are The famous and old, round-shaped, miraculous chapel of San Mariano known as \"The Miraculous Round Chapel of San Mariano\", 18th Century Ancestral Houses in Santa Rosa, a private \"Gazebo\" of Cruz Compound in San Mariano, 1890 Ancestral House of Brgy.",
            "San Gregorio, American Air Base and rivers, Mga Munting Bahay-kubo, and scenic rice fields."
        ],
        [
            "St. Rose of Lima Church"
        ],
        [
            "St. Rose of Lima Parish Church"
        ],
        [
            "The 1879 St. Rose Of Lima Parish Church belongs to the Roman Catholic Diocese of Cabanatuan (Dioecesis of Cabanatuanensi, Suffragan of Lingayen-Dagupan, comprising 16 towns of Southern Nueva Ecija, Cabanatuan, Palayan City and Gapan; Titular: St. Nicholas of Tolentine, September 10; Most Reverend Sofronio A. Bancud, SSS, DD)."
        ],
        [
            "The Church is located at Maharlika Hway, Poblacion, Santa Rosa, 3101 Nueva Ecija.",
            "It is part of the Vicariate of St. Rose of Lima (Titular: St. Rose of Lima, Feast, Aug 23).",
            "Its current Parish Priest is Rev.",
            "Fr.",
            "Edwin C. Dizon."
        ],
        [
            "St. Rose of Lima, T.O.S.D., (April 20, 1586 – August 24, 1617) was the first person born in the Americas to be canonized by the Catholic Church."
        ],
        [
            "1946 Holy Cross College and Chapel"
        ],
        [
            "The Holy Cross College was founded in 1946 by Rt.",
            "Rev.",
            "Msgr.",
            "Fernando C. Lansangan, parish priest of the town of Santa Rosa, as a secondary school with two first-year classes.",
            "In 1948, government recognition was granted to the school for its high school department.",
            "In 1981, the expansion of the school's curricular program was conceived.",
            "During SY 1982–1983, the MECS granted permit for the first and second year curriculum of the degree Bachelor of Arts and the first and second year curriculum for the Junior Secretarial Course were offered to the public In its 39th year of service to the community."
        ],
        [
            "Dr. Raquel Tioseco Santa Ines, niece of the founder Priest took over the management of the college after his death.",
            "In all its 66 years of existence, HCC continues with additional TESDA programs in Restaurant Management, Computer Secretarial, and Electronic and Computer Technology; and six-month courses in Contact Call Center and Medical Transcription.",
            "HCC offers Masters in Education major in Mathematics and English."
        ],
        [
            "San Mariano Chapel or \"The Miraculous Round Chapel of San Mariano\""
        ],
        [
            "San Mariano Chapel"
        ],
        [
            "San Mariano Chapel is a round-shaped chapel located at the core of Barangay San Mariano Santa Rosa, Nueva Ecija.",
            "This serves as a landmark of the said Barangay.",
            "It was named after the patron saint of the barrio, \"San Mariano\".",
            "The land where it is located was privately owned by a devoted family.",
            "After total and complete renovation of the said chapel, the land title was donated to St. Rose of Lima Parish Church."
        ],
        [
            "The Old Miraculous San Mariano Chapel was then reconstructed with the help of a devotee named Antonio M. Romero year 2000 after he recovered from paralysis in 1989.",
            "The said devotee religiously attended the mass held at San Mariano Chapel then miraculously recovered from such an illness as stated.",
            "He, later on, served as the Vice Mayor of the town and lost in his re-election due to black propaganda."
        ],
        [
            "People of San Mariano in the early 1900s used to kneel when passing by the old church including their carabaos or \"kalabaw\" before farming at dawn as a sign of respect in the said chapel."
        ],
        [
            "The chapel was believed to be miraculous and famous as it was known to be visited by thousands of devotees of the Blessed Virgin Mary and Santo Niño during the 1960s and 1970s.",
            "Miracles were actually witnessed by the people who visited the chapel and attended the mass held by the parish priest at that time.",
            "Evidence of such miracles were collected and kept by groups of families and people."
        ],
        [
            "The Feast of Santo Niño was celebrated in San Mariano Chapel every 25 February wherein a mass was held and simple gift-giving and feeding for the children were organized by certain groups."
        ],
        [
            "1890 Ancestral House of Brgy.",
            "San Gregorio, Santa Rosa"
        ],
        [
            "An ancestral house built in 1890, this is a landmark known in the whole town of Santa Rosa.",
            "Its renovation was initiated in 1974 and finished in 1977.",
            "A house strongly founded out of tons of cement and copper steel.",
            "It comprises 4 balconies, 3 living room areas, 3 kitchens, 5 common bedrooms, and a master bedroom.",
            "The living room area had its traditional atmosphere through the marble design floors.",
            "During the Spanish era, the chandeliers illuminated the whole house.",
            "The majority of its wooden surface was made out of pure narra.",
            "The great descendants of Capt.",
            "Gregorio drl Barrio (founder of San Gregorio) had meaningful experiences full of love which are worth reminiscing up to the present generation.",
            "The house symbolizes a Filipino's resilience for it stood for more than a hundred years overcoming raging calamities like typhoons and earthquakes."
        ],
        [
            "Education"
        ],
        [
            "Santa Rosa, Nueva Ecija is served by both public and DepEd-accredited private/catholic schools."
        ],
        [
            "The Holy Cross College, Santa Rosa, is a Catholic school established in 1946 and is the legacy of Fernando C. Lansangan (died 1980).",
            "Msgr.",
            "Lansangan was parish priest of St. Rose of Lima Parish"
        ],
        [
            "Jesus Is Lord Christian School"
        ],
        [
            "Malacanang National High School"
        ],
        [
            "Saint Rose of Lima Catholic School"
        ],
        [
            "Santa Rosa Central School"
        ],
        [
            "Santa Rosa National High School"
        ],
        [
            "Rose of Sharon Christian School"
        ],
        [
            "Santo Rosario National High School"
        ],
        [
            "Saint Christopher Montessori School of Santa Rosa"
        ],
        [
            "Gallery"
        ],
        [
            "Holy Cross College"
        ],
        [
            "Municipal road and Town hall"
        ],
        [
            "Santa Rosa Town Hall"
        ],
        [
            "Santa Rosa Park"
        ],
        [
            "Public market"
        ],
        [
            "Crossing, Junction"
        ],
        [
            "Sister cities"
        ],
        [
            "Cabanatuan, Nueva Ecija"
        ],
        [
            "Gapan, Nueva Ecija"
        ],
        [
            "Aliaga, Nueva Ecija"
        ],
        [
            "Santa Rosa City, Laguna"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Santa Rosa |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on 25 May 2021.",
            "Retrieved 16 July 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA releases the 2015 Municipal and City Level Poverty Estimates\".",
            "Quezon City, Philippines.",
            "Retrieved 1 January 2020."
        ],
        [
            "^"
        ],
        [
            "\"Santa Rosa: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 4 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Nueva Ecija\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved 28 December 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Annual Audit Report\".",
            "Commission on Audit.",
            "Retrieved 19 October 2018."
        ],
        [
            "^ \"Philippines : About the Philippines\".",
            "Government of the Philippines.",
            "Archived from the original on 3 October 2006.",
            "Retrieved 28 March 2009."
        ],
        [
            "^ \"The Local Government Code of the Philippines\" – via Chan Robles Virtual Law Library."
        ],
        [
            "^ Patron Saints Index: Saint Rose of Lima Retrieved on 2008-08-23."
        ],
        [
            "^ http://www.mb.com.ph/node/26231#.UPEmMeSyA8s"
        ],
        [
            "^ \"History\".",
            "Group4neust.tripod.com.",
            "1 January 1981.",
            "Retrieved 21 December 2021."
        ],
        [
            "^ \"Holy Cross College-Nueva Ecija · Philippines College Courses\".",
            "Archived from the original on 14 March 2016."
        ],
        [
            "^ \"HCC Sta.",
            "Rosa – Our story: History\".",
            "Holy Cross College Santa Rosa NE."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa Rosa, Nueva Ecija."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Santa Rosa, Nueva Ecija"
        ],
        [
            "Aliaga"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Zaragoza"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Laur"
        ],
        [
            "Jaen"
        ],
        [
            "San Leonardo / Peñaranda"
        ],
        [
            "General Tinio"
        ],
        [
            "vte Province of Nueva EcijaPalayan (capital)  Cabanatuan (largest city)Municipalities"
        ],
        [
            "Aliaga"
        ],
        [
            "Bongabon"
        ],
        [
            "Cabiao"
        ],
        [
            "Carranglan"
        ],
        [
            "Cuyapo"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Guimba"
        ],
        [
            "Jaen"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Llanera"
        ],
        [
            "Lupao"
        ],
        [
            "Nampicuan"
        ],
        [
            "Pantabangan"
        ],
        [
            "Peñaranda"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Leonardo"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Zaragoza"
        ],
        [
            "Component cities"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Jose"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa_Rosa,_Nueva_Ecija&oldid=1230191263\""
        ],
        [
            "Categories: Municipalities of Nueva EcijaPopulated places on the Pampanga RiverHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listAll articles with dead external linksArticles with dead external links from February 2022Articles with short descriptionShort description is different from WikidataUse dmy dates from December 2023Articles needing additional references from December 2022All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}