{
    "name": "Santa Barbara",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Santa Barbara, Pangasinan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°00′11″N 120°24′03″E﻿ / ﻿16.00306°N 120.40083°E﻿ / 16.00306; 120.40083"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Pangasinan, Philippines"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesSanta BarbaraMunicipalityMunicipality of Santa BarbaraStreet in Sta.",
            "Barbara"
        ],
        [
            "SealMap of Pangasinan with Santa Barbara highlightedOpenStreetMapSanta BarbaraLocation within the PhilippinesCoordinates: 16°00′11″N 120°24′03″E﻿ / ﻿16.00306°N 120.40083°E﻿ / 16.00306; 120.40083CountryPhilippinesRegionIlocos RegionProvincePangasinanDistrict"
        ],
        [
            "3rd districtFoundedOctober 30, 1741Named forSaint BarbaraBarangays29"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorCarlito S. Zaplan • Vice MayorRogelio Quibrantos Navarro • RepresentativeMaria Rachel J. Arenas • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Eleazar Q. DalopeMark CruzCarlito D. Zaplan, Jr.Bobby G. BarbiranPhyll Anthony ZaplanRamil Delos SantosBernardine BarbiranRoderick B. Torio"
        ],
        [
            " • Electorate54,954 voters (2022)Area • Revenue₱ 282.1 million (2020) • Assets₱ 811.4 million (2020) • Expenditure₱ 232.7 million (2020) • Liabilities₱ 124.4 million (2020)Service provider • ElectricityPangasinan 3 Electric Cooperative (PANELCO 3)Time zoneUTC+8 (PST)ZIP code2419PSGC015538000IDD : area code +63 (0)75Native languagesPangasinan Ilocano TagalogWebsitewww.stabarbara-pangasinan.ph"
        ],
        [
            "Santa Barbara, officially the Municipality of Santa Barbara (Pangasinan: Baley na Santa Barbara; Ilocano: Ili ti Santa Barbara; Tagalog: Bayan ng Santa Barbara), is a 1st class municipality in the province of Pangasinan, Philippines.",
            "According to the 2020 census, it has a population of 92,187 people."
        ],
        [
            "Geography"
        ],
        [
            "Santa Barbara lies on a plain terrain in the northern part of the Agno Valley, at the center of Pangasinan.",
            "It is just west of the business center of Urdaneta City, with centuries-old mango trees lining the national highway to Santa Barbara.",
            "9 kilometres (5.6 mi) further west is Dagupan along Lingayen Gulf, and to its south is the town of Malasiqui and beyond it the City of San Carlos."
        ],
        [
            "Santa Barbara is 24 kilometres (15 mi) from Lingayen, 200 kilometres (120 mi) from Manila, 9 kilometres (5.6 mi) from Malasiqui, and 9 kilometres (5.6 mi) from Mangaldan."
        ],
        [
            "Barangays"
        ],
        [
            "Santa Barbara is politically subdivided into 29 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alibago"
        ],
        [
            "Balingueo"
        ],
        [
            "Banaoang"
        ],
        [
            "Banzal"
        ],
        [
            "Botao"
        ],
        [
            "Cablong"
        ],
        [
            "Carusucan"
        ],
        [
            "Dalongue"
        ],
        [
            "Erfe"
        ],
        [
            "Gueguesangen"
        ],
        [
            "Leet"
        ],
        [
            "Malanay"
        ],
        [
            "Maningding"
        ],
        [
            "Maronong"
        ],
        [
            "Maticmatic"
        ],
        [
            "Minien East"
        ],
        [
            "Minien West"
        ],
        [
            "Nilombot"
        ],
        [
            "Patayac"
        ],
        [
            "Payas"
        ],
        [
            "Tebag East"
        ],
        [
            "Tebag West"
        ],
        [
            "Poblacion Norte"
        ],
        [
            "Poblacion Sur"
        ],
        [
            "Primicias"
        ],
        [
            "Sapang"
        ],
        [
            "Sonquil"
        ],
        [
            "Tuliao"
        ],
        [
            "Ventenilla"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Santa Barbara, Pangasinan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "4.3(0.17)"
        ],
        [
            "19.1(0.75)"
        ],
        [
            "27.3(1.07)"
        ],
        [
            "45.2(1.78)"
        ],
        [
            "153.3(6.04)"
        ],
        [
            "271.3(10.68)"
        ],
        [
            "411.1(16.19)"
        ],
        [
            "532(20.9)"
        ],
        [
            "364.4(14.35)"
        ],
        [
            "182.5(7.19)"
        ],
        [
            "56.3(2.22)"
        ],
        [
            "24.4(0.96)"
        ],
        [
            "2,091.2(82.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "3"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "5"
        ],
        [
            "14"
        ],
        [
            "17"
        ],
        [
            "22"
        ],
        [
            "23"
        ],
        [
            "21"
        ],
        [
            "13"
        ],
        [
            "7"
        ],
        [
            "4"
        ],
        [
            "134"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Santa BarbaraYearPop.±% p.a.1903 10,367—    1918 13,263+1.66%1939 15,125+0.63%1948 19,570+2.90%1960 24,005+1.72%1970 30,580+2.45%1975 34,418+2.40%1980 37,001+1.46%1990 48,056+2.65%1995 54,116+2.25%2000 64,261+3.75%2007 73,025+1.78%2010 76,637+1.77%2015 82,012+1.30%2020 92,187+2.33%Source: Philippine Statistics Authority"
        ],
        [
            "Santa Barbara is populated mainly by Pangasinans with a sprinkling of other ethnic groups led by the Ilocanos."
        ],
        [
            "It is largely a suburban community with much of its population densely concentrated in 29 barangays.",
            "By the year 2016, the town's population was projected to have reached 86,269, with a growth rate of 3.75 percent per year for the past seven years, faster than the national average."
        ],
        [
            "A high level of self-sufficiency in food is likewise gleaned in the town's minimal rate of malnutrition of only .50 percent severely malnourished out of 5.12 percent malnourished -pre-school children.",
            "The public school system is also proud of having an unusually low drop-out rate in the elementary grades and high school."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Santa Barbara"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  28.20"
        ],
        [
            "2009  20.36"
        ],
        [
            "2012  12.32"
        ],
        [
            "2015  11.70"
        ],
        [
            "2018  9.99"
        ],
        [
            "2021  16.81"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "More than half of the families or roughly 60 percent are farmers who till the northern part of the rich Agno Valley.",
            "The average family income as of the 2000 national census, was a low P9,662.67 a year.",
            "Maybe because the average farming family does not buy, but produce the bulk of its own food, family expenditures were lower at P7,545.42.",
            "The average Santa Barbaran family has a disposable income of over P2,000 a year despite statistical data that had shown that a family In the Ilocos region needed PhP 14,749.00 in income a year to survive."
        ],
        [
            "The poverty rate in Santa Barbara is high as the average income is even lower than the regional poverty threshold.",
            "But food self-sufficiency has saved its town folks from sliding to the ranks of the very poor."
        ],
        [
            "Although a large part of Santa Barbara is fast getting urbanized, the main economic activity remains to farm.",
            "Rice remains its main crop with 6,662 hectares or close to all its total tillable lands devoted to rice farming.",
            "The second most important crop is mango of which the town is famous as the home of age-old Philippine mango seedling nurseries, a veritable home industry in town."
        ],
        [
            "Rice and mango are the only crops that are raised in all its 29 barangays.",
            "The third most important crop in a variety of vegetables followed by corn.",
            "Legumes and root crops are grown in small quantities."
        ],
        [
            "Their livestock includes cattle, carabao, hogs, goats, and dogs.",
            "They likewise raise native chickens for their food and some poultry farms commercially produce chicken layers and broilers."
        ],
        [
            "Out of the farm produce, Santa Barbara has developed its own food processing industry that includes the making of rice cakes like latik and suman, nata-de coco making, and pickles from different fruits."
        ],
        [
            "It likewise has a highly developed clay tile and pottery industry coupled with non-farm-based processing industries like candle and soap making and the making of hollow blocks for construction.",
            "The town has one industrial plant, the Ginebra San Miguel gin manufacturing plant in Tebag West barangay along the national highway towards Dagupan."
        ],
        [
            "The town's business and trading center in and around the public market features a variety of wholesale and retail and other services establishments from farm inputs to construction materials.",
            "The market serves as the place where its people buy their needs and sell their produce.",
            "Transportation between the commercial center and the many barangays is served by a large fleet of individually owned tricycles."
        ],
        [
            "Santa Barbara's close proximity to Urdaneta City, has, however, constrained the growth of its trading sector."
        ],
        [
            "Urban development"
        ],
        [
            "Also owing to its suburban location and easy access to three nearby cities, Urdaneta, San Carlos, and Dagupan, Santa Barbara has attracted subdivision developers,  both for middle-class and low-cost markets.",
            "As of mid-2008, it has attracted to its territory eight different housing projects including subdivisions developed by the company owned by Senate President Manny Villar and a pilot Gawad Kalinga housing project for the very poor embarked by the town government and its private sector partners."
        ],
        [
            "Infrastructure"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Santa Barbara, Pangasinan\" – news · newspapers · books · scholar · JSTOR (May 2024) (Learn how and when to remove this message)"
        ],
        [
            "The town has a total of 137.509 linear kilometers of road network classified into national, provincial, municipal, and barangay roads.",
            "All the national highways passing through town and those under the town government have been paved.",
            "The 17 kilometers of provincial roads are about three-fourths paved while more than half (67.10%)  of 92.5 kilometers of barangay roads otherwise known as farm-to-market roads, needed concreting."
        ],
        [
            "Unlike paved roads, electricity has reached all of the town's 29 barangays with about 80 percent of all households served.",
            "Power rates are much lower than in Metro Manila for both households, commercial and industrial users."
        ],
        [
            "Two of the biggest landline telephone companies, PLDT and Digitel, plus one wireless company, Smart, serve the communication needs of the town although the unit to users ratio as of 2007 was still low at one phone for every 93 residents."
        ],
        [
            "The local government-run Rural Health Unit and its 10 satellite barangay health centers, plus seven private medical clinics and one dental clinic serve the basic health needs of Santa Barbara residents."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Santa Barbara, belonging to the third congressional district of the province of Pangasinan, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Rose Marie J. Arenas"
        ],
        [
            "Mayor"
        ],
        [
            "Carlito S. Zaplan"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Roger Navarro"
        ],
        [
            "Councilors"
        ],
        [
            "Rogelio Q. Navarro"
        ],
        [
            "Roderick B. Torio"
        ],
        [
            "Buena D. Ico"
        ],
        [
            "Roger S. Zaplan"
        ],
        [
            "Angelo D. Tamayo"
        ],
        [
            "Bobby G. Barbiran"
        ],
        [
            "Eleazar Q. Dalope"
        ],
        [
            "Sherwin N. Pioquinto"
        ],
        [
            "Education"
        ],
        [
            "Santa Barbara has an extensive public elementary and high school system.",
            "It has a total of 26 elementary schools supervised by two school districts plus 7 public high schools.",
            "These are staffed by 418 teachers and other school personnel with a student body of over 15,000 children in any given year."
        ],
        [
            "Their healthy teacher to pupil ratio averaging one to 34 in the elementary grades and one is to 41 in high school and there are minimal drop-out rates of two percent in the elementary grades and less than four in every 100 students that enter high school.",
            "This was the state of things in Santa Barbara when the local leadership changed in mid-2007."
        ],
        [
            "Religion"
        ],
        [
            "The heritage Santa Barbara Parish of the Holy Family Church, built in 1716, is part of the Roman Catholic Archdiocese of Lingayen-Dagupan, Vicariate III.",
            "Rev.",
            "Fr.",
            "Fidelis B. Layog is its Parish Priest, and Rev.",
            "Fr.",
            "Jim Cerezo is its Parish Vicar."
        ],
        [
            "Façade of the Church"
        ],
        [
            "Parish Office and Convent Façade"
        ],
        [
            "Interior"
        ],
        [
            "Far view of the altar"
        ],
        [
            "Interior of the Oratory"
        ],
        [
            "Oratory"
        ],
        [
            "Gallery"
        ],
        [
            "Town hall"
        ],
        [
            "Halls of Justice, Municipal Court"
        ],
        [
            "Water district tower"
        ],
        [
            "Façade of the Don Daniel B. Maramba High School"
        ],
        [
            "Santa Barbara Public Plaza"
        ],
        [
            "Grave of Daniel B. Maramba"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Santa Barbara |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Santa Barbara, Pangasinan: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 31 October 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Pangasinan\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 7, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Santa Barbara, Pangasinan."
        ],
        [
            "Santa Barbara Profile at PhilAtlas.com"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Santa Barbara at the Pangasinan Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Santa Barbara, Pangasinan"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mapandan"
        ],
        [
            "Calasiao"
        ],
        [
            "Santa Barbara"
        ],
        [
            "San Carlos"
        ],
        [
            "Malasiqui"
        ],
        [
            "Urdaneta"
        ],
        [
            "vte Province of PangasinanLingayen (capital)  San Carlos City (largest city)Municipalities"
        ],
        [
            "Agno"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Anda"
        ],
        [
            "Asingan"
        ],
        [
            "Balungao"
        ],
        [
            "Bani"
        ],
        [
            "Basista"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos"
        ],
        [
            "Calasiao"
        ],
        [
            "Dasol"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lingayen"
        ],
        [
            "Mabini"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Natividad"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Rosales"
        ],
        [
            "San Fabian"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Quintin"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sison"
        ],
        [
            "Sual"
        ],
        [
            "Tayug"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "San Carlos"
        ],
        [
            "Urdaneta"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan (Administratively independent from the province but grouped under Pangasinan by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Pangasinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Santa_Barbara,_Pangasinan&oldid=1227038760\""
        ],
        [
            "Category: Municipalities of PangasinanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textArticles needing additional references from May 2024All articles needing additional referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}