{
    "name": "Sariaya",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sariaya"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°58′N 121°32′E﻿ / ﻿13.97°N 121.53°E﻿ / 13.97; 121.53"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Quezon, Philippines"
        ],
        [
            "Municipality in Calabarzon, PhilippinesSariayaMunicipalityMunicipality of SariayaFrom L-R: Sariaya Town Plaza, Saint Francis of Assisi Parish Church, Sariaya Municipal Building, Governor Natalio Enriquez Ancestral House, Facade of Gala-Rodriguez Ancestral House, Don Lucio Rodriguez Ancestral House, Emralino-Rodriguez Ancestral House, Don Catalino Rodriguez Ancestral House"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "Heritage Town of Quezon"
        ],
        [
            "Art Deco Capital of Southern Luzon"
        ],
        [
            "Home of famous Pinagong Bread"
        ],
        [
            "Motto(s): Gilas Sariaya!",
            "(Be valiant Sariaya!",
            ")Map of Quezon with Sariaya highlightedOpenStreetMapSariayaLocation within the PhilippinesCoordinates: 13°58′N 121°32′E﻿ / ﻿13.97°N 121.53°E﻿ / 13.97; 121.53CountryPhilippinesRegionCalabarzonProvinceQuezonDistrict"
        ],
        [
            "2nd districtFounded1599Barangays43"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorMarcelo P. Gayeta • Vice MayorAlexander A. Tolentino • RepresentativeDavid C. Suarez • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Arlene M. GenoveDemia P. MaghirangVince Rudolph A. BantaRenz Kevin E. MarcuapMinerva R. RemoOfelia C. VillapandoHaydee M. CaringalMario M. Medrano"
        ],
        [
            " • Electorate96,447 voters (2022)Area • Revenue₱ 442.1 million (2020) • Assets₱ 1,123 million (2020) • Expenditure₱ 369.3 million (2020) • Liabilities₱ 497.3 million (2020)Service provider • ElectricityManila Electric Company (Meralco)Time zoneUTC+8 (PST)ZIP code4322PSGC045645000IDD : area code +63 (0)42Native languagesTagalogWebsitewww.sariaya.gov.ph"
        ],
        [
            "Sariaya ("
        ],
        [
            "As the only Mount Banahaw town in both Quezon and Laguna Provinces that has a sea coast, the town is famous for its pristine beach resorts and nature-trekking activities that lead adventurous hikers to the peak of mythical Mount Banahaw.",
            "With more than a hundred of cultural properties and ancestral houses mostly built in Art Deco architecture within the municipality, Sariaya is considered as the Heritage Town of Quezon and the Art Deco Capital of Southern Luzon.",
            "This heritage town has been branded by various cultural experts as a 'cultural gem worthy of a UNESCO designation.'",
            "The local government of the municipality with the National Commission for Culture and the Arts of the Philippines were designated to work for the heritage town's inclusion in the UNESCO World Heritage List."
        ],
        [
            "With the 2020 census population of almost reaching 161,000, Sariaya is the most populous municipality in the province of Quezon and the 19th most populous municipality in the Philippines.",
            "Cityhood might be coming to Sariaya in a matter of years."
        ],
        [
            "Etymology"
        ],
        [
            "The origin of the word Sariaya was allegedly came from the word Sadyaya — one of the town's numerous rivers, but words of the great ancestors and legends have it that it was named after Saria, an supposedly 'illiterate' (according to the Spanish) woman who encountered the first Spaniards in the town who were asking the name of the settlement.",
            "Saria can't understand the question as it was in Spanish, which was foreign and unknown to everyone in the area during that time.",
            "She was thus branded as illiterate by the Spanish despite being highly educated through Tagalog traditional knowledge.",
            "The woman gave her name as answer to the Spanish, assuming that they were asking her name.",
            "The Spaniards wrote \"Saria\" on their notebooks as the name of the settlement.",
            "And while the Spaniards were talking with each other, the natives heard them utter the words \"Saria-ya\".",
            "Hence, the words traveled from mouth to mouth and became a common saying until the two words were combined."
        ],
        [
            "History"
        ],
        [
            "The beginning of Sariaya's documented history occurred with the arrival of Augustinian missionary priests in a Malay seaside settlement in what is now Barangay Castañas on the shores of Tayabas Bay.",
            "They discovered a thriving native people who were heathen, and they converted the majority of them to Christianity."
        ],
        [
            "After years of Tayabas rule, Sariaya obtained freedom in 1631 and fled north to avoid the destructive flame-throwing loot of the Moro pirates."
        ],
        [
            "A strong earthquake in 1743 caused the bell tower of the Tumbaga church to collapse.",
            "Then, this ancient community is referred to as \"Lumangbayan,\" or Old Town.",
            "Given this, the surviving settlers were left with little choice but to relocate and travel far north in quest of a new, safer place."
        ],
        [
            "The contemporary town of Sariaya is perfectly situated to see all the activity down along the Tayabas Bay coastline, with a clear view of the coastline to the south."
        ],
        [
            "Furthermore, compared to the stone church of Tumbaga, a more durable combination of materials was used in the construction of the current church.",
            "These components consist of bricks, adobe blocks, albumin or egg white, stones, and masonry.",
            "In addition to being a house of worship, the church and its four-story belfry served as a lookout point for the surrounding fields and mountains as well as a citadel or last line of defense for the residents in the unlikely event that invaders managed to get past all of the defenses and into the town."
        ],
        [
            "Sariaya is fostering relations with global communities after joining the Santa Clarita Sister Cities program in the United States."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "Encouraged by recent economic growth fueled by investments, the municipal council of Sariaya hopes to make the town a city by 2025."
        ],
        [
            "Geography"
        ],
        [
            "Sariaya is an inland municipality in the province of Quezon, located 120 kilometres (75 mi) south of Metro Manila and 10 kilometres (6.2 mi) from the provincial capital Lucena.",
            "The municipality is bordered by Tayabas City on north-east side, the city of Lucena on its southeast, the municipality of Candelaria on its west, and the town of San Juan in Batangas on its south-west.",
            "Mount Banahaw flanks it on the north and Tayabas Bay on the south side.",
            "It has a total land area of 24,530 hectares"
        ],
        [
            "Barangays"
        ],
        [
            "Sariaya is politically subdivided into 43 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Currently, six barangays are urban barangays located at the Poblacion, one barangay is classified as sub-urban and six barangays are coastal barangays."
        ],
        [
            "Hereunder is the list of Barangays in Municipality of Sariaya and its land area:"
        ],
        [
            "Aerial view of Sariaya's coast with Lucena City in the background."
        ],
        [
            "Barangay"
        ],
        [
            "Land Area (Ha)"
        ],
        [
            "Area Rank"
        ],
        [
            "Population (2020)"
        ],
        [
            "Classification"
        ],
        [
            "Antipolo"
        ],
        [
            "490.60"
        ],
        [
            "27.5"
        ],
        [
            "1,888"
        ],
        [
            "Rural"
        ],
        [
            "Balubal"
        ],
        [
            "560.68"
        ],
        [
            "19"
        ],
        [
            "5,304"
        ],
        [
            "Rural"
        ],
        [
            "Bignay 1"
        ],
        [
            "630.80"
        ],
        [
            "15"
        ],
        [
            "6,105"
        ],
        [
            "Rural"
        ],
        [
            "Bignay 2"
        ],
        [
            "728.90"
        ],
        [
            "10"
        ],
        [
            "3,857"
        ],
        [
            "Rural"
        ],
        [
            "Bucal"
        ],
        [
            "518.63"
        ],
        [
            "23.5"
        ],
        [
            "3,408"
        ],
        [
            "Rural"
        ],
        [
            "Canda"
        ],
        [
            "588.71"
        ],
        [
            "18"
        ],
        [
            "3,052"
        ],
        [
            "Rural"
        ],
        [
            "Castañas"
        ],
        [
            "876.10"
        ],
        [
            "8"
        ],
        [
            "7,120"
        ],
        [
            "Rural"
        ],
        [
            "Concepcion 1"
        ],
        [
            "827.00"
        ],
        [
            "9"
        ],
        [
            "5,764"
        ],
        [
            "Rural"
        ],
        [
            "Concepcion Banahaw"
        ],
        [
            "1,345.00"
        ],
        [
            "2"
        ],
        [
            "3,411"
        ],
        [
            "Rural"
        ],
        [
            "Concepcion Palasan"
        ],
        [
            "939.14"
        ],
        [
            "6"
        ],
        [
            "7,680"
        ],
        [
            "Rural"
        ],
        [
            "Concepcion Pinagbakuran"
        ],
        [
            "714.90"
        ],
        [
            "11"
        ],
        [
            "3,050"
        ],
        [
            "Rural"
        ],
        [
            "Gibanga"
        ],
        [
            "546.70"
        ],
        [
            "21"
        ],
        [
            "3,752"
        ],
        [
            "Rural"
        ],
        [
            "Guisguis San Roque"
        ],
        [
            "448.54"
        ],
        [
            "29.5"
        ],
        [
            "2,645"
        ],
        [
            "Rural"
        ],
        [
            "Guisguis Talon"
        ],
        [
            "530.65"
        ],
        [
            "22"
        ],
        [
            "4,376"
        ],
        [
            "Rural"
        ],
        [
            "Janagdong 1"
        ],
        [
            "518.63"
        ],
        [
            "23.5"
        ],
        [
            "3,935"
        ],
        [
            "Rural"
        ],
        [
            "Janagdong 2"
        ],
        [
            "672.80"
        ],
        [
            "12.5"
        ],
        [
            "3,242"
        ],
        [
            "Rural"
        ],
        [
            "Limbon"
        ],
        [
            "280.34"
        ],
        [
            "36"
        ],
        [
            "1,428"
        ],
        [
            "Rural"
        ],
        [
            "Lutucan 1"
        ],
        [
            "392.50"
        ],
        [
            "34"
        ],
        [
            "4,961"
        ],
        [
            "Rural"
        ],
        [
            "Lutucan Bata"
        ],
        [
            "490.60"
        ],
        [
            "27.5"
        ],
        [
            "2,498"
        ],
        [
            "Rural"
        ],
        [
            "Lutucan Malabag"
        ],
        [
            "497.60"
        ],
        [
            "26"
        ],
        [
            "4,847"
        ],
        [
            "Rural"
        ],
        [
            "Mamala 1"
        ],
        [
            "441.07"
        ],
        [
            "32"
        ],
        [
            "3,187"
        ],
        [
            "Rural"
        ],
        [
            "Mamala 2"
        ],
        [
            "442.00"
        ],
        [
            "31"
        ],
        [
            "6,016"
        ],
        [
            "Sub-Urban"
        ],
        [
            "Manggalang 1"
        ],
        [
            "1,198.43"
        ],
        [
            "3"
        ],
        [
            "6,966"
        ],
        [
            "Rural"
        ],
        [
            "Manggalang Bantilan"
        ],
        [
            "672.80"
        ],
        [
            "12.5"
        ],
        [
            "4,073"
        ],
        [
            "Rural"
        ],
        [
            "Manggalang Kiling"
        ],
        [
            "616.85"
        ],
        [
            "17"
        ],
        [
            "3,125"
        ],
        [
            "Rural"
        ],
        [
            "Manggalang Tulo-Tulo"
        ],
        [
            "623.80"
        ],
        [
            "16"
        ],
        [
            "3,209"
        ],
        [
            "Rural"
        ],
        [
            "Montecillo"
        ],
        [
            "658.79"
        ],
        [
            "14"
        ],
        [
            "4,271"
        ],
        [
            "Rural"
        ],
        [
            "Morong"
        ],
        [
            "434.53"
        ],
        [
            "33"
        ],
        [
            "2,098"
        ],
        [
            "Rural"
        ],
        [
            "Pili"
        ],
        [
            "448.54"
        ],
        [
            "29.5"
        ],
        [
            "4,196"
        ],
        [
            "Rural"
        ],
        [
            "Poblacion 1"
        ],
        [
            "8.5"
        ],
        [
            "40"
        ],
        [
            "1,867"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion 2"
        ],
        [
            "14.5"
        ],
        [
            "39"
        ],
        [
            "1,206"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion 3"
        ],
        [
            "7.0"
        ],
        [
            "42"
        ],
        [
            "1,184"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion 4"
        ],
        [
            "16.60"
        ],
        [
            "38"
        ],
        [
            "3,545"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion 5"
        ],
        [
            "7.5"
        ],
        [
            "41"
        ],
        [
            "1,037"
        ],
        [
            "Urban"
        ],
        [
            "Poblacion 6"
        ],
        [
            "6.0"
        ],
        [
            "43"
        ],
        [
            "1,207"
        ],
        [
            "Urban"
        ],
        [
            "Sampaloc 1"
        ],
        [
            "1,037.26"
        ],
        [
            "4"
        ],
        [
            "2,603"
        ],
        [
            "Rural"
        ],
        [
            "Sampaloc 2"
        ],
        [
            "1,023.24"
        ],
        [
            "5"
        ],
        [
            "6,862"
        ],
        [
            "Rural"
        ],
        [
            "Sampaloc Bogon"
        ],
        [
            "1,675.03"
        ],
        [
            "1"
        ],
        [
            "1,255"
        ],
        [
            "Rural"
        ],
        [
            "Santo Cristo"
        ],
        [
            "911.11"
        ],
        [
            "7"
        ],
        [
            "9,007"
        ],
        [
            "Rural"
        ],
        [
            "Talaan Aplaya"
        ],
        [
            "553.67"
        ],
        [
            "20"
        ],
        [
            "3,011"
        ],
        [
            "Rural"
        ],
        [
            "Talaan Pantoc"
        ],
        [
            "273.33"
        ],
        [
            "37"
        ],
        [
            "2,322"
        ],
        [
            "Rural"
        ],
        [
            "Tumbaga 1"
        ],
        [
            "518.63"
        ],
        [
            "23.5"
        ],
        [
            "4,903"
        ],
        [
            "Rural"
        ],
        [
            "Tumbaga 2"
        ],
        [
            "336.41"
        ],
        [
            "35"
        ],
        [
            "1,936"
        ],
        [
            "Rural"
        ],
        [
            "Topography"
        ],
        [
            "Sariaya is situated on a flat land except for a portion on the north occupying a part of the foot of Mount Banahaw.",
            "The municipality has the highest point of elevation on 3,800 feet above sea level at Barangays Concepcion Banahaw and Sampaloc Bogon."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sariaya"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "92(3.6)"
        ],
        [
            "55(2.2)"
        ],
        [
            "46(1.8)"
        ],
        [
            "62(2.4)"
        ],
        [
            "117(4.6)"
        ],
        [
            "184(7.2)"
        ],
        [
            "211(8.3)"
        ],
        [
            "211(8.3)"
        ],
        [
            "233(9.2)"
        ],
        [
            "320(12.6)"
        ],
        [
            "323(12.7)"
        ],
        [
            "263(10.4)"
        ],
        [
            "2,117(83.3)"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Sariaya falls under Type III of the PAGASA's climatic classification system this is because it is situated on the southern portion of the province's mountain ranges characterized by seasons not very pronounced, relatively dry from December to April and wet during the rest of the year.",
            "The maximum rain periods are not very pronounced with the short dry season lasting from two to four months."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of SariayaYearPop.±% p.a.1903 12,453—    1918 14,158+0.86%1939 25,736+2.89%1948 29,904+1.68%1960 42,089+2.89%1970 58,997+3.43%1975 66,847+2.54%1980 74,148+2.09%1990 91,081+2.08%1995 100,709+1.90%2000 114,568+2.80%2007 128,248+1.57%2010 138,894+2.94%2015 148,980+1.34%2020 161,868+1.64%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2020 census of population, Sariaya has a total population of 161,868 people making the second most populous area in Quezon after the City of Lucena."
        ],
        [
            "Barangay Santo Cristo is the most populous area in Sariaya with a total population of 9,007 people according to the 2020 census, The Poblacion ranks second and Concepcion Palasan placed in the third rank."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Sariaya"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  21.00"
        ],
        [
            "2009  14.51"
        ],
        [
            "2012  23.22"
        ],
        [
            "2015  19.77"
        ],
        [
            "2018  6.34"
        ],
        [
            "2021  14.80"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Sariaya Public Market"
        ],
        [
            "Sentrong Pamilihan ng Produktong Agrikultura sa Quezon"
        ],
        [
            "Stores along the Sariaya's Business District"
        ],
        [
            "Commerce"
        ],
        [
            "The trade and commerce in Sariaya is heavily concentrated at General Luna Street (Maharlika Highway), which is the town's central business district where majority of the town's commercial establishments are situated such as retail, supermarkets, banks, drugstores, bakeries, merchandising, grocery, hardware, fastfood chains, shopping center, convenience stores and others."
        ],
        [
            "Income"
        ],
        [
            "Agriculture is one of the major sources of income in Sariaya.",
            "According to the 2016 Competitiveness Index of the National Competitiveness Council or NCC, the municipality belongs to the Top 50 most competitive municipalities in the Philippines.",
            "According to the annual Audit Report of Commission on Audit (COA), Sariaya is also one of Quezon's top grossing municipalities when factoring annual income."
        ],
        [
            "Here's the list of the total annual income, assets, expenses and equity of Sariaya since 2008:"
        ],
        [
            "Year"
        ],
        [
            "Total Income (COA)."
        ],
        [
            "Assets"
        ],
        [
            "Expenses"
        ],
        [
            "Equity"
        ],
        [
            "2008"
        ],
        [
            "₱139.37 million"
        ],
        [
            "₱141.48 million"
        ],
        [
            "₱112.92 million"
        ],
        [
            "₱101.17 million"
        ],
        [
            "2009"
        ],
        [
            "₱154.89 million"
        ],
        [
            "₱198.33 million"
        ],
        [
            "₱141.55 million"
        ],
        [
            "₱109.66 million"
        ],
        [
            "2010"
        ],
        [
            "₱164.55 million"
        ],
        [
            "₱202.63 million"
        ],
        [
            "₱158.44 million"
        ],
        [
            "₱101.71 million"
        ],
        [
            "2011"
        ],
        [
            "₱183.43 million"
        ],
        [
            "₱243.13 million"
        ],
        [
            "₱172.08 million"
        ],
        [
            "₱106.77 million"
        ],
        [
            "2012"
        ],
        [
            "₱183.59 million"
        ],
        [
            "₱237.29"
        ],
        [
            "₱181.60 million"
        ],
        [
            "₱112.67 million"
        ],
        [
            "2013"
        ],
        [
            "₱212.08 million"
        ],
        [
            "₱239.29 million"
        ],
        [
            "₱200.54 million"
        ],
        [
            "₱117.99 million"
        ],
        [
            "2014"
        ],
        [
            "₱243.73 million"
        ],
        [
            "₱390.88 million"
        ],
        [
            "₱206.07 million"
        ],
        [
            "₱152.49 million"
        ],
        [
            "2015"
        ],
        [
            "₱275.70 million"
        ],
        [
            "₱467.81 million"
        ],
        [
            "₱248.83 million"
        ],
        [
            "₱176.53 million"
        ],
        [
            "Culture"
        ],
        [
            "Agawan Festival"
        ],
        [
            "Bagakays"
        ],
        [
            "Celebrated every 15th day of May, this religious festivity pays tribute to San Isidro Labrador, the patron saint of farmers.",
            "This much-anticipated feast has close affinity with the 'Pahiyas Festival' of Lucban, Quezon.",
            "Pliant bamboo treetops and trellises (bagakay) weighed down by succulent fruits, native candies, rice cakes, and colorful rice krispies called \"kiping\" are deliberately pulled down on the streets by noisy merrymakers right after the afternoon procession.",
            "Festival revelers from the town's barangays, neighboring towns, and other provinces would then scramble to gather as many treats as they can snatch and carry, hence the term \"Agawan.\""
        ],
        [
            "Town Fiesta"
        ],
        [
            "Santo Cristo de Burgos"
        ],
        [
            "On September 14, pious devotees from far and wide pay homage to the miraculous image of the Santo Cristo de Burgos during the Feast of the Exaltation of the Cross.",
            "The Catholic feast is a day-long veneration of the replica of the Crucified Christ at the ancient Cathedral of Burgos, Spain long believed to be a gift of King Philip V of Spain in 1703 to the people of Lumangbayan in Sariaya.",
            "People from far-flung barangays flock to the Poblacion to attend the packed fiesta Masses.",
            "They also sell their farm products and handicrafts in the public market as they eagerly sample the gaudily-decorated and crowded venue for the annual \"perya\" (fiesta fair) for thrilling rides, occasional circus performances, and shows featuring human mutants, trained animals performing tricks, vendors peddling herbal medicines, and \"peryantes,\" those hardy and itinerant peddlers of cheap clothing, toys, and kitchen utensils.",
            "The town's basketball tournament also holds its cherished championship game on the eve of this much-awaited day.",
            "Sometimes there are hired stage performances at the town plaza that feature some of the nation's stage, television and film celebrities as well as musical stars."
        ],
        [
            "......."
        ],
        [
            "Government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Elected officials"
        ],
        [
            "Sariaya Municipal Building"
        ],
        [
            "Elected officials for the 2019–2022 term are:"
        ],
        [
            "Members of the Sariaya Municipal Council (2022–present)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Mayor"
        ],
        [
            "Marcelo \"Marcing\" P. Gayeta"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Alexander A. Tolentino"
        ],
        [
            "Councilors"
        ],
        [
            "Arlene Genove"
        ],
        [
            "Demia Perez- Maghirang"
        ],
        [
            "Vince Alcala Banta"
        ],
        [
            "Renz Marcuap"
        ],
        [
            "Minerva “Miner” Remo"
        ],
        [
            "Ofelia C. Villapando"
        ],
        [
            "Haidee Medina- Caringal"
        ],
        [
            "Mario Medina Medrano"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Maharlika Highway, locally known as General Luna Street, at the town proper"
        ],
        [
            "Sariaya is traversed by the Maharlika Highway (N1), which passes through the town proper as the congested General Luna Street, and the newer Quezon Eco-Tourism Road (N422) which passes through the municipality's coastal areas.",
            "New highways will be South Luzon Expressway (SLEX) Toll Road 4, which will have one exit west of town proper, and the Sariaya Bypass Road, which is being built to decongest Maharlika Highway through the town center."
        ],
        [
            "Buses between Manila, Lucena, and Bicol stop at Sariaya town proper, and jeepneys provide short-distance transportation to nearby towns.",
            "Tricycles are used to travel between barangays."
        ],
        [
            "Communication"
        ],
        [
            "Sariaya is served by landline and mobile phone companies like the General Telephone System, Inc. (GTSi) and Digitel Telecommunications (PLDT-Digitel) as the main telecommunication services providers in the municipality.",
            "Major mobile phone providers in the area includes Globe Telecom, Smart Communications, and Dito Telecommunity.",
            "Also, Sariaya has a cable provider which is the Sariaya Cable Network."
        ],
        [
            "Tourism"
        ],
        [
            "See also: List of Cultural Properties of Sariaya"
        ],
        [
            "Saint Francis of Assisi Parish Church"
        ],
        [
            "Sariaya Church built in 1748"
        ],
        [
            "Saint Francis of Assisi Parish Church is a stone church built in 1748, located at Barangay Poblacion II.",
            "Records tell that the present church is the fifth one erected by the Spanish Franciscan Friars in the history of Sariaya.",
            "In 1938, a historical marker bearing a brief history of the church was installed on its facade by the National Research and Markers Committee, precursor of the National Historical Commission of the Philippines."
        ],
        [
            "Heritage houses"
        ],
        [
            "On May 14, 2008, the National Historical Institute (NHI) unveiled markers of heritage houses for the three ancient yet still stately mansions at the heart of Sariaya town.",
            "These venerable houses are best viewed from the south, as they are silhouetted against the majestic and mystical Mount Banahaw, Quezon's long-dormant volcano.",
            "Cultural recognition was bestowed on three ancestral houses, namely:  The Enriquez-Gala mansion, owned by former Tayabas (now Quezon) Gov.",
            "Natalio Enriquez and Susana Gala; the Gala-Rodriguez house of Dr. Isidro Rodriguez and Gregoria Gala, and the house of Catalino and Luisa Rodriguez also known as Villa Sariaya."
        ],
        [
            "Governor Natalio Enriquez Ancestral House"
        ],
        [
            "Gala-Rodriguez Ancestral House"
        ],
        [
            "Don Catalino Rodriguez Ancestral House (Villa Sariaya)"
        ],
        [
            "Margarita Rodriguez Ancestral House"
        ],
        [
            "Tumbaga Church ruins"
        ],
        [
            "Extant wall of Tumbaga Church ruins"
        ],
        [
            "Remains of an early 18th-century stone church and former town site of Sariaya, located at Barangay Tumbaga I.",
            "The settlement was inaugurated in 1703 with Father Lucas Fernandez as first parish priest and Francisco Argente as Presidente del Pueblo.",
            "The church, which measured 500 square meters, served a recorded population of 3000 parishioners.",
            "Two events led to the abandonment of the town site: the earthquake of 1743 which consequently destroyed the church's bell tower, and the Moro raids which left the town site in ruins after being razed by fire.",
            "The venerated image of Santo Cristo de Burgos is said to have been enshrined in the church before it was transferred to its present shrine in the San Francisco Church in the present-day town proper of Sariaya.",
            "The unscathed image was said have been retrieved from the burnt church after the Muslim raider attack.",
            "The church is believed to be the fourth church structure built by the Spanish Franciscan Friars in Sariaya."
        ],
        [
            "Sariaya Park"
        ],
        [
            "Sariaya Park"
        ],
        [
            "This multi-purpose park is a perfect place for recreational activities because of its pleasant and calm ambiance where kids can play at the park's playground, located at the heart of the town in front of Sariaya Church and the Town Hall at the left side.",
            "Sariaya Park is also the location where Sariaya Sports Complex is situated and usually used as the venue of different events and Basketball Leagues in the town."
        ],
        [
            "Resorts"
        ],
        [
            "This article is written like a travel guide.",
            "Please help improve the article by introducing an encyclopedic style or move the content to Wikivoyage.",
            "(January 2020)"
        ],
        [
            "Sariaya is the first town in the western part of the province with a sea coast.",
            "The municipality hosts numerous beach resorts and pool resorts which offers pristine beach and recreational activities."
        ],
        [
            "Resort"
        ],
        [
            "Name"
        ],
        [
            "Location"
        ],
        [
            "Monte Vista Beach Resort"
        ],
        [
            "Barangay Bignay 2"
        ],
        [
            "Villa del Prado Beach Resort"
        ],
        [
            "Barangay Guisguis Talon"
        ],
        [
            "Dalampasigan Beach Resort"
        ],
        [
            "Barangay Guisguis Talon"
        ],
        [
            "Paraiso Beach Resort"
        ],
        [
            "Barangay Guisguis Talon"
        ],
        [
            "Balai Loreta Beach Resort"
        ],
        [
            "Barangay Talaan Aplaya"
        ],
        [
            "Balai Sadyaya Resort"
        ],
        [
            "Barangay Balubal"
        ],
        [
            "Oyayi Farm and Resort"
        ],
        [
            "Barangay Castañas"
        ],
        [
            "Marina Azul Beach Resort"
        ],
        [
            "Barangay Bignay 2"
        ],
        [
            "Christian's Beach Resort"
        ],
        [
            "Barangay Bignay 2"
        ],
        [
            "Baywatch Palm Beach Club Resort"
        ],
        [
            "Barangay Talaan Aplaya"
        ],
        [
            "Beachwood Resort"
        ],
        [
            "Barangay Bignay 2"
        ],
        [
            "Blue Bay Waters Beach Resort"
        ],
        [
            "Barangay Bignay 2"
        ],
        [
            "Mar Del Sol Beach Resort"
        ],
        [
            "Barangay Guisguis Talon"
        ],
        [
            "La Felizza Resort"
        ],
        [
            "Barangay Guisguis Talon"
        ],
        [
            "Mapresco Beach Resort"
        ],
        [
            "Barangay Guisguis Talon"
        ],
        [
            "Villa Vicenta Beach Resort"
        ],
        [
            "Barangay Bignay 2"
        ],
        [
            "Villa Melania Beach Resort"
        ],
        [
            "Barangay Guisguis Talon"
        ],
        [
            "Safari Beach Resort"
        ],
        [
            "Barangay Guisguis Talon"
        ],
        [
            "Villa Trenta Eddy WoW Pool Farm Resort"
        ],
        [
            "Villa Trenta / Eddy WoW Pool Farm Resort"
        ],
        [
            "Barangay Pili (Barangay Bucal)"
        ],
        [
            "Floreddy's Farm Resort"
        ],
        [
            "Barangay Pili"
        ],
        [
            "Pool Resorts"
        ],
        [
            "Villa Leandro Resort"
        ],
        [
            "Lucky D Resort"
        ],
        [
            "Primavera Resort"
        ],
        [
            "Lynelle's Lagoon Resort"
        ],
        [
            "Ada's Resort and Spa"
        ],
        [
            "BLT Farmville Resort"
        ],
        [
            "Villa Trenta / Eddy WoW Pool Farm Resort"
        ],
        [
            "Floreddy's Farm Resort"
        ],
        [
            "Beach Resorts with Boat Rides to Coral Reefs"
        ],
        [
            "Triple J Beach Resort (Barangay Guis-Guis Talon)"
        ],
        [
            "M.Y.",
            "Beach Resort (Barangay Guis-Guis Talon)"
        ],
        [
            "Healthcare"
        ],
        [
            "Greg Hospital, one of the three hospitals located in Sariaya"
        ],
        [
            "There are three private hospitals in Sariaya, with a dependable and well-staffed health center providing free medical and preventive services for residents of the forty-three barangays of the municipality."
        ],
        [
            "Greg Hospital, located at General Luna St., Barangay Poblacion 1"
        ],
        [
            "Soler General Hospital, located at Mabini St., Barangay Poblacion 6"
        ],
        [
            "Allied Care Experts (ACE) Medical Center, located at Maharlika Hwy., Barangay Gibanga"
        ],
        [
            "Education"
        ],
        [
            "Colegio de Santo Cristo de Burgos"
        ],
        [
            "Sariaya Institute"
        ],
        [
            " St. Joseph's Academy"
        ],
        [
            "Sariaya East Central Main Elementary School"
        ],
        [
            "Educational Institutions in Sariaya"
        ],
        [
            "Level"
        ],
        [
            "School"
        ],
        [
            "Tertiary"
        ],
        [
            "CSTC - College of Sciences, Technology, and Communications, Inc."
        ],
        [
            "Colegio de Santo Cristo de Burgos"
        ],
        [
            "Secondary"
        ],
        [
            "Sariaya Institute (private non-sectarian)"
        ],
        [
            "St. Joseph's Academy of Sariaya, Quezon (private sectarian)"
        ],
        [
            "St. Francis High School (private sectarian)"
        ],
        [
            "Mamala Integrated School (public)"
        ],
        [
            "Lutucan Integrated National High School (public)"
        ],
        [
            "Governor Anacleto C. Alcala National High School (public)"
        ],
        [
            "Canda National High School (public)"
        ],
        [
            "Sariaya National High School (public)"
        ],
        [
            "Pili National High School (public)"
        ],
        [
            "Janagdong National High School (public)"
        ],
        [
            "Primary"
        ],
        [
            "Sariaya East Central Main Elementary School"
        ],
        [
            "Manuel L. Quezon Elementary School"
        ],
        [
            "Jose Rizal Elementary School"
        ],
        [
            "Antipolo Elementary School"
        ],
        [
            "Balubal Gibanga Elementary School"
        ],
        [
            "Bogon Elementary School"
        ],
        [
            "Sampaloc Elementary School"
        ],
        [
            "Sto.",
            "Cristo Elementary School"
        ],
        [
            "Concepcion Elementary School"
        ],
        [
            "Governor Natalio and Susana Enriquez Elementary School"
        ],
        [
            "Pili Elementary School"
        ],
        [
            "Pantoc Elementary School"
        ],
        [
            "Talaan Elementary School"
        ],
        [
            "Tumbaga 1 Elementary School"
        ],
        [
            "Tumbaga 2 Elementary School"
        ],
        [
            "Morong Elementary School"
        ],
        [
            "Montecillo Elementary School"
        ],
        [
            "Kiling Elementary School"
        ],
        [
            "Manggalang Elementary School"
        ],
        [
            "Concepcion Ibaba Elementary School"
        ],
        [
            "Concepcion Pinagbakuran Elementary School"
        ],
        [
            "Lutucan 1 Elementary School"
        ],
        [
            "Lutucan Bata Elementary School"
        ],
        [
            "Lutucan Central School"
        ],
        [
            "Concepcion Banahaw Elementary School"
        ],
        [
            "Tulo-Tulo Elementary School"
        ],
        [
            "Castañas Elementary School"
        ],
        [
            "Lutucan Adventist Elementary School"
        ],
        [
            "Sariaya Conservative Baptist Christian School Inc."
        ],
        [
            "Holy Spirit Learning Center"
        ],
        [
            "St. Therese of the Child Jesus Learning Center"
        ],
        [
            "Beersheba Christian School"
        ],
        [
            "Notable personalities"
        ],
        [
            "Leo Austria — former professional basketball player and the head coach of San Miguel Beermen of the Philippine Basketball Association."
        ],
        [
            "Maximo Rodriguez — twice Sariaya Municipal President (Mayor) in 1906–1907 and 1914-1916 and twice Tayabas (Quezon) Provincial Governor in 1916–1922 and 1933–1937.",
            "He also became the principal sponsor of former Philippine president Manuel L. Quezon and Aurora Aragon at their Hong Kong wedding and he was also the instrument in the peaceful surrender of the dreaded Kapitan Kulas and became the Chairman-General Manager of the National Coconut Corporation (NACOCO), the fore runner of the Philippine Coconut Authority.",
            "He established the Maximo Rodriguez Solid Laboratory in Sariaya."
        ],
        [
            "Braulio de Villa — twice Sariaya Town Gobernadorcillo (Mayor) in 1889 and 1892 to 1894, and later became the Provincial Governor of Batangas, his home province."
        ],
        [
            "Natalio Enriquez – Sariaya Municipal President (Mayor) from 1938 to 1940 and later became the Provincial Governor of Tayabas (Quezon Province) from 1941 to 1945."
        ],
        [
            "Jovencio de Villa – became the Provincial Governor of Tayabas Province (Quezon Province) during the Japanese Occupation period."
        ],
        [
            "Roberto P. Racelis – was elected as Provincial Vice Governor of Quezon Province thrice but became Governor (by Operation of Law) from August 8, 1995, to July 25, 1996, and from April 4, 1998, to June 30, 1998."
        ],
        [
            "Don John L. Montalbo – is known for discovering the \"Talon sa Bahanaw\" on August 24, 1996."
        ],
        [
            "Lily Monteverde - movie producer"
        ],
        [
            "Sister cities"
        ],
        [
            "Sariaya has a sister city relationship with the foreign community of:"
        ],
        [
            " Santa Clarita, California, United States, since 2003"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sariaya |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Sariaya, Quezon itinuturing na Art Deco Capital of Southern Luzon dahil sa heritage houses\".",
            "GMA News."
        ],
        [
            "^ \"Sariaya, Quezon (History, People, Places, About, Facts)\".",
            "WowQuezon.",
            "Retrieved April 26, 2017."
        ],
        [
            "^ \"Very strong mag.",
            "6.0 earthquake - Philippines September 1743\".",
            "VolcanoDiscovery.com.",
            "Retrieved June 1, 2024."
        ],
        [
            "^ \"Banahaw\".",
            "Global Volcanism Program.",
            "Retrieved June 1, 2024."
        ],
        [
            "^ Ongpin-Periquet, Lisa (May 25, 2024).",
            "\"Sariaya: A town of heritage enthusiasts\".",
            "Philippine Star Life.",
            "Retrieved June 1, 2024."
        ],
        [
            "^ \"ABOUT SARIAYA\".",
            "Official Website of Sariaya Quezon.",
            "Retrieved June 1, 2024."
        ],
        [
            "^ \"Sariaya, Philippines\".",
            "Santa Clarita Sister Cities Official Website.",
            "Retrieved June 1, 2024."
        ],
        [
            "^ Otordoz, Belinda (January 23, 2024).",
            "\"Quezon town eyes cityhood by 2025\".",
            "Philippine News Agency.",
            "Retrieved June 1, 2024.",
            "{{cite news}}:  CS1 maint: url-status (link)"
        ],
        [
            "^"
        ],
        [
            "\"Average High/Low Temperature for Sariaya, Quezon, Philippines\".",
            "World Weather Online.",
            "Retrieved July 2, 2016."
        ],
        [
            "^ \"Climate of Sariaya\".",
            "Mount Banahaw."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Quezon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Competitiveness Index\".",
            "National Competitiveness Council."
        ],
        [
            "^ \"2014 COA Annual Financial Report for Local Government Unit\".",
            "Commission on Audit."
        ],
        [
            "^ \"Sariaya Church\".",
            "Waypoints."
        ],
        [
            "^ Mallari Jr., Delfin.",
            "\"History lives in Sariaya mansions\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on December 29, 2013.",
            "Retrieved May 14, 2013."
        ],
        [
            "^ San Jose-Valdoria, Nancy (November–December 2001).",
            "\"Tumbaga: Unang \"Pueblo\", 1703-1743\".",
            "Sariaya Community Magazine.",
            "2 (7): 20–22."
        ],
        [
            "^ \"Santa Clarita, California Sister Cities\" at Santa Clarita Sister Cities (SCVIP) website."
        ],
        [
            "^ \"Sariaya, Philippines & Santa Clarita, California\".",
            "Washington, DC: Sister Cities International.",
            "Retrieved February 4, 2015."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Sariaya."
        ],
        [
            "Wikivoyage has a travel guide for Sariaya."
        ],
        [
            "Sariaya Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Official website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "CSTC - College of Sciences, Technology and Communication, Inc. (Sariaya)"
        ],
        [
            "Places adjacent to Sariaya"
        ],
        [
            "Mount Banahaw"
        ],
        [
            "Candelaria"
        ],
        [
            "Sariaya"
        ],
        [
            "TayabasLucena"
        ],
        [
            "San Juan, Batangas"
        ],
        [
            "Tayabas Bay"
        ],
        [
            "vte Province of QuezonLucena (capital and largest city)Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Alabat"
        ],
        [
            "Atimonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Calauag"
        ],
        [
            "Candelaria"
        ],
        [
            "Catanauan"
        ],
        [
            "Dolores"
        ],
        [
            "General Luna"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Infanta"
        ],
        [
            "Jomalig"
        ],
        [
            "Lopez"
        ],
        [
            "Lucban"
        ],
        [
            "Macalelon"
        ],
        [
            "Mauban"
        ],
        [
            "Mulanay"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagbilao"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Narciso"
        ],
        [
            "Sariaya"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Tiaong"
        ],
        [
            "Unisan"
        ],
        [
            "Component city"
        ],
        [
            "Tayabas"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Lucena (Administratively independent from the province but grouped under Quezon by the Philippine Statistics Authority.",
            "However, qualified voters of this city are still allowed to participate in the election of provincial officials as part of Quezon’s 2nd Sangguniang Panlalawigan district.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sariaya&oldid=1233859032\""
        ],
        [
            "Category: Municipalities of QuezonHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: url-statusCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Pages using infobox settlement with possible motto listCoordinates on WikidataPages with Tagalog IPAArticles containing Tagalog-language textWikipedia articles with style issues from January 2020All articles with style issuesCommons category link from WikidataOfficial website different in Wikidata and WikipediaPages using the Kartographer extension"
        ]
    ]
}