{
    "name": "Sigay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sigay"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°02′38″N 120°34′50″E﻿ / ﻿17.0439°N 120.5806°E﻿ / 17.0439; 120.5806"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Sigay\" – news · newspapers · books · scholar · JSTOR (September 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesSigayMunicipalityMunicipality of Sigay"
        ],
        [
            "SealMap of Ilocos Sur with Sigay highlightedOpenStreetMapSigayLocation within the PhilippinesCoordinates: 17°02′38″N 120°34′50″E﻿ / ﻿17.0439°N 120.5806°E﻿ / 17.0439; 120.5806CountryPhilippinesRegionIlocos RegionProvinceIlocos SurDistrict"
        ],
        [
            "2nd districtBarangays7"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorCarlo Crisanto P. Peredo • Vice MayorJovita D. Garnace • RepresentativeKristine Singson-Meehan • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Bal P. WandasDionisio M. Lang-ay Jr.Aries D. GaerlanMardoquio B. CalengSionie W. DillaJezebel G. DonglosFancie W. RamoleteBenjamin L. Suen"
        ],
        [
            " • Electorate2,071 voters (2022)Area • Revenue₱ 237.9 million (2020) • Assets₱ 880.1 million (2020) • Expenditure₱ 41.43 million (2020) • Liabilities₱ 50.01 million (2020)Service provider • ElectricityIlocos Sur Electric Cooperative (ISECO)Time zoneUTC+8 (PST)ZIP code2719PSGC012929000IDD : area code +63 (0)77Native languagesIlocano TagalogWebsitewww.sigayilocossur.com"
        ],
        [
            "Sigay, officially the Municipality of Sigay (Ilocano: Ili ti Sigay; Filipino: Bayan ng Sigay), is a 5th class municipality in the province of Ilocos Sur, Philippines.",
            "According to the 2020 census, it has a population of 2,552 people, making it the least populated municipality in the province."
        ],
        [
            "History"
        ],
        [
            "Natives of the town claim that Sigay is as old as any other place in the province founded during the Spanish regime.",
            "But written records are yet to be found regarding its history.",
            "Oral tradition, however, has it that the name of the town originated from the Ilocano term for fish trap, \"sigay\".",
            "The legend goes that, in the older times, Lake Ban-ao in Barangay Mabileg was once the village's most valuable source of fish.",
            "Around the area, a mudfish was caught in a fish trap by a woman, who brought the fish to the market.",
            "A Spaniard came along and asked where she got the fish.",
            "Thinking that the stranger was asking about the gear she caught the fish with, she answered, \"Sigay\".",
            "It was by this incidence that the town started to be known by that name."
        ],
        [
            "Another version of the etymology situates the legend in a setting when the \"sigay\" itself had to be re-invented for hunting.",
            "In those times, the village was still made up of tribes.",
            "As was the custom, each tribe chose a leader who ought to be the strongest, most fearless, and bravest in the clans.",
            "One of the leaders and his hunters climbed the mountains to hunt for food.",
            "Because it would then be easier to trap the animals in the forests than run after them for the kill, the hunters devised a big net in the fashion of the \"sigay\" (fish trap/net).",
            "Hunting thus became much more easier.",
            "Because of the widespread use of the \"sigay\" both in the water and in the jungles, the lowland people who visited the place would eventually refer to it as Sigay."
        ],
        [
            "The original settlers of Sigay were Igorots, who wandered from their ancestral lands in the Mountain Province north-westward to the Ilocos uplands.",
            "Many of them found a home in the mountains of Sigay.",
            "Years later, the natives' descendants made vows in marriage with Ilocanas.",
            "Their offspring were born mestizos - fair skinned, red lipped, pink cheeked and brown haired - and became known as the \"New Ilocanos\".",
            "In the year 1700, when Christianity was introduced in the interior towns, baptized children were proclaimed as the \"New Christians\" or in Tagalog, the \"BAGO\".",
            "To this day, descendants of the Igorot natives, the Bago tribes continue to live in Sigay."
        ],
        [
            "Although most of the area has been modernized, there are definite traces of the native customs and beliefs.",
            "For instance, to this day, the dance \"Tadek\" is performed during the wedding celebrations.",
            "In many sitios, the bayanihan spirit generally prevails, especially when building houses, or during the planting and harvest seasons.",
            "However, some of the older rituals like the Kanlaw are no longer performed, unless necessary."
        ],
        [
            "Many members of the Bago tribe from Sigay ventured into the municipality of Tabuk - the capital town of what was then the province of Kalinga-Apayao - in the 1940s well into the 1950s.",
            "There, they found settlements which were then exclusively made up of settlers with Sigay origin - the most notable of which is the barangay of Casigayan (with the Sigay still kept in the name), which literally means \"a place of Sigay people.\""
        ],
        [
            "Establishment of the Municipality"
        ],
        [
            "By the time the Spaniards arrived in the area, all the interior towns of Ilocos Sur were part of the Montanosa or the Mountain Provinces.",
            "A sub-province of Montanosa was Amburayan, a prominent area of trade and commerce, which among others, included the towns of Gregorio del Pilar, Quirino, Cervantes, Lidlidda and San Emilio.",
            "Named after the vast Amburayan River that ran through it, Amburayan was a vast stronghold of the natives; the river itself, fed by the springs from the mountains in the East, was wide, and foreign vessels used to dock there to trade with the natives.",
            "When the Spanish founded Ciudad Fernandina (Vigan), all the interior towns, including Sigay, were cut off from the Montanosa, and these became part of the Province of Ilocos Sur.",
            "The original inhabitants were natives and had the same facial features as the Igorots."
        ],
        [
            "Although already fully recognized by the Spanish Regime as a municipal district in the 1800s, it was only in 1960 that Sigay emerged as a fully-fledged municipality.",
            "This came after the first elections of its local officials on November 12, 1959."
        ],
        [
            "For a long time, the seat of local government resided in Abaccan.",
            "Later on, Mayor Simeon Wandas (1960–1977) decided to build a Municipal Hall in Maday-aw, where he transferred all the local government's offices."
        ],
        [
            "Geography"
        ],
        [
            "Nestled near the Cordillera ranges, Sigay has crisp cool air and rustic scenery.",
            "Known to nature-lovers, adventurers, campers and mountaineers, the town attracts visitors with its version of the rice terraces, the 142 feet (43 m) Aw-asen Falls, the kilometric hanging bridge, and its picturesque rivers.",
            "Sigay is 86 kilometres (53 mi) from Vigan City and 371 kilometres (231 mi) from Manila."
        ],
        [
            "Sigay is bordered on the north by the Municipality of Gregorio del Pilar, south by the Municipality of Suyo; east by the Municipality of Quirino, and west by the Municipality of Santa Cruz.",
            "Sigay can be reached one and a half hour ride from the City of Candon through strong-geared vehicles traversing 30 km, 22 km concrete and 8 km rugged roads, passing stony rivers crossing several times and going up through mountain terrains.",
            "During rainy season, the place is isolated by swollen rivers and muddy slippery roads.",
            "Residents adopt themselves by negotiating distances by hike."
        ],
        [
            "The Municipality is nestled in a wide mountainous area where most of its forest is still untouched.",
            "Both ends of the Municipality are bounded with rivers namely Quinibor Rivers at the north, and Ida and Suyo Rivers in the south.",
            "Its type of soil is best suited to diversified crops."
        ],
        [
            "The town has a total land area of 80.28 km2.",
            "comprising seven barangays."
        ],
        [
            "Barangays"
        ],
        [
            "Sigay is politically subdivided into 7 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Abaccan"
        ],
        [
            "Mabileg"
        ],
        [
            "Matallucod"
        ],
        [
            "Poblacion (Madayaw)"
        ],
        [
            "San Elias"
        ],
        [
            "San Ramon"
        ],
        [
            "Santo Rosario"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sigay, Ilocos Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "17(63)"
        ],
        [
            "18(64)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "18(64)"
        ],
        [
            "21(69)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "27(1.1)"
        ],
        [
            "31(1.2)"
        ],
        [
            "40(1.6)"
        ],
        [
            "71(2.8)"
        ],
        [
            "207(8.1)"
        ],
        [
            "237(9.3)"
        ],
        [
            "286(11.3)"
        ],
        [
            "261(10.3)"
        ],
        [
            "261(10.3)"
        ],
        [
            "254(10.0)"
        ],
        [
            "88(3.5)"
        ],
        [
            "46(1.8)"
        ],
        [
            "1,809(71.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "9.4"
        ],
        [
            "9.3"
        ],
        [
            "12.7"
        ],
        [
            "17.0"
        ],
        [
            "25.4"
        ],
        [
            "26.8"
        ],
        [
            "27.4"
        ],
        [
            "26.1"
        ],
        [
            "25.0"
        ],
        [
            "21.0"
        ],
        [
            "15.5"
        ],
        [
            "10.6"
        ],
        [
            "226.2"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "The climate pattern of Sigay has two pronounced season, wet and dry season.",
            "The type of season is very common not only in the nearby towns but in the entire region as well.",
            "The wet or rainy season is from the months of June to October and dry season is from the months November to May.",
            "The place is cold throughout the year due to the altitude of the town.",
            "The coldest months are from November to February."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of SigayYearPop.±% p.a.1903 11—    1918 1,036+35.39%1939 1,655+2.26%1948 1,571−0.58%1960 1,371−1.13%YearPop.±% p.a.1970 1,475+0.73%1980 1,741+1.67%1990 1,964+1.21%1995 2,235+2.45%2000 2,375+1.31%YearPop.±% p.a.2007 2,453+0.45%2010 2,419−0.51%2015 2,737+2.38%2020 2,552−1.37%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Sigay had a population of 2,552.",
            "The population density was 31 inhabitants per square kilometre (80/sq mi)."
        ],
        [
            "The municipality's population started a total number of eleven inhabitants during the 1930 National Census of Population, and gradually increased to 1,036 in the following years of census (1908 census) with a highest geometric growth rate in its history at 33.26% per year."
        ],
        [
            "Language"
        ],
        [
            "The language used by the residents in the place is purely Ilocano, although many residents, specially the youth can understand and speak English and Tagalog."
        ],
        [
            "Religion"
        ],
        [
            "The Roman Catholic faith is practiced by the majority of the population while the remaining faiths include those of Protestant churches such as the United Church of Christ in the Philippines, The Way of Salvation, Seventh Day Adventist, the Assemblies of God, and Jehovah's Witnesses."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Sigay"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  36.20"
        ],
        [
            "2009  27.17"
        ],
        [
            "2012  22.92"
        ],
        [
            "2015  21.42"
        ],
        [
            "2018  9.47"
        ],
        [
            "2021  12.87"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The town of Sigay is predominantly an agricultural municipality.",
            "Though the area is rugged and mountainous, it has a wide level of areas suited for agriculture.",
            "Most residents raise crops like tobacco and coffee which are their main products and primary sources of livelihood."
        ],
        [
            "The town has no public market up to the present so residents need to transport their farm products to the lowlands for proper disposal and convert it into cash to buy their some basic needs especially during rainy season."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Sigay, belonging to the second congressional district of the province of Ilocos Sur, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Kristine Singson-Meehan"
        ],
        [
            "Mayor"
        ],
        [
            "Carlo Crisanto P. Peredo"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Jovita D. Garnace"
        ],
        [
            "Councilors"
        ],
        [
            "Bal P. Wandas"
        ],
        [
            "Dionisio M. Lang-ay Jr."
        ],
        [
            "Aries D. Gaerlan"
        ],
        [
            "Mardoquio B. Caleng"
        ],
        [
            "Sionie W. Dilla"
        ],
        [
            "Jezebel G. Donglos"
        ],
        [
            "Fancie W. Ramolete"
        ],
        [
            "Benjamin L. Suen"
        ],
        [
            "Education"
        ],
        [
            "The municipality has seven schools including the Secondary School.",
            "There are two primaries which are situated at Barangay Mabileg and Barangay Matallucod while there are four elementary schools.",
            "One is Sigay Central School situated at Barangay San Ramon.",
            "Another is Abaccan Elementary School and the other two are San Elias Elementary School and Santo Rosario Elementary School.",
            "The secondary school is located at Poblacion which is now on its 8th year of operation."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sigay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Sigay: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 14 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 11, 2022."
        ],
        [
            "External links"
        ],
        [
            "Pasyalang Ilocos Sur"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Sigay"
        ],
        [
            "Salcedo"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Sigay"
        ],
        [
            "Cervantes"
        ],
        [
            "Suyo"
        ],
        [
            "vte Province of Ilocos SurVigan (capital)  Candon (largest city)Municipalities"
        ],
        [
            "Alilem"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bantay"
        ],
        [
            "Burgos"
        ],
        [
            "Cabugao"
        ],
        [
            "Caoayan"
        ],
        [
            "Cervantes"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Lidlidda"
        ],
        [
            "Magsingal"
        ],
        [
            "Nagbukel"
        ],
        [
            "Narvacan"
        ],
        [
            "Quirino"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Juan"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Component cities"
        ],
        [
            "Candon"
        ],
        [
            "Vigan"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Sur"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sigay&oldid=1221168192\""
        ],
        [
            "Category: Municipalities of Ilocos SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textPages using the Kartographer extension"
        ]
    ]
}