{
    "name": "Silago",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Silago"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°31′45″N 125°09′42″E﻿ / ﻿10.5291°N 125.1618°E﻿ / 10.5291; 125.1618"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Southern Leyte, Philippines"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesSilagoMunicipalityMunicipality of SilagoView of Silago"
        ],
        [
            "FlagSealMotto: Kalimpyo + Kahimsug + Kalinaw = Kalambuan (3K's=1K)Anthem: Silago HymnMap of Southern Leyte with Silago highlightedOpenStreetMapSilagoLocation within the PhilippinesCoordinates: 10°31′45″N 125°09′42″E﻿ / ﻿10.5291°N 125.1618°E﻿ / 10.5291; 125.1618CountryPhilippinesRegionEastern VisayasProvinceSouthern LeyteDistrict"
        ],
        [
            "2nd districtFoundedJune 20, 1950Barangays15"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorLemuel P. Honor (PROMDI) • Vice MayorSandielito A. Ando (PROMDI) • RepresentativeChristopherson M. Yap • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Eduardo M. GomezArtemio B. MontañaGeorge S. Kuizon Jr.Manuel M. Labrador Jr.Arsenio T. Engcoy Jr.Lerma D. DollenteEldie H. HinampasRamon I. Lucero"
        ],
        [
            " • Electorate10,045 voters (2022)Area • Revenue₱ 111.3 million (2020) • Assets₱ 273.1 million (2020) • Expenditure₱ 104.9 million (2020) • Liabilities₱ 37.23 million (2020)Service provider • ElectricitySouthern Leyte Electric Cooperative (SOLECO)Time zoneUTC+8 (PST)ZIP code6606PSGC086416000IDD : area code +63 (0)53Native languagesBoholano dialect Cebuano Tagalog"
        ],
        [
            "Silago, officially the Municipality of Silago (Cebuano: Lungsod sa Silago; Tagalog: Bayan ng Silago), is a 4th class municipality in the province of Southern Leyte, Philippines.",
            "According to the 2020 census, it has a population of 13,116 people.",
            "It was used to be barrio of Hinunangan until Executive Order No.",
            "326 dated May 17, 1950"
        ],
        [
            "Etymology"
        ],
        [
            "The name \"Silago\" was a shortening of Spanish murcielago (\"bat\"), referring to an account when the Spaniards encountered bats in the area perching in trees locally known as tuog.",
            "The natives replied the incomprehensible question of the name of their place asked by the Spaniards saying \"tua'y daghang kabug\" in the belief that the Spaniards were amazed the huge number of bats present in the area that time.",
            "The place was then called \"Murcielago\" and over time, was shortened to its present name Silago."
        ],
        [
            "However, accounts from Pigafetta on the Magellan voyage indicates a certain island in Leyte recorded as 'Cenalo' along with the recorded 'Hinnangar' (Hinunangan), and 'Abarien' (Cabalian), which in a new presentation by Greg Hontiveros on the First Mass controversy published in 2008, designated it to the Hingatungan Point in the town and therefore not an island as the account indicates."
        ],
        [
            "History"
        ],
        [
            "Silago was once part of the Municipality of Hinunangan, and under its political jurisdictions, even during World War I and II."
        ],
        [
            "During World War II, Silago was chosen as the site of submarine landing of American military arms and equipment for the Leyte guerillas.",
            "The military hardware was efficiently moved to Leyte by hundreds of volunteer guards under the Leyte area command of Col. Ruperto K. Kangleon."
        ],
        [
            "After the Second World War, Silago became more progressive and had increased its population, and thus became the biggest barangay of Hinunangan.",
            "Progress served as pushing factor that Silago has availed and gained qualifications to become a municipality."
        ],
        [
            "In 1948, the Secretary of National Defense Ruperto Kangleon took efforts for the conversion of barrio Silago to a municipality.",
            "And on June 20, 1950, the Municipality of Silago was inaugurated by virtue of an Executive Order No.",
            "326 issued by President Elpidio Quirino.",
            "Such Executive Order was chartered through Republic Act No.",
            "5962 \"Creating the Municipality of Silago in the Province of Southern Leyte\" on June 21, 1969."
        ],
        [
            "This was made possible also through the invaluable services and voluntary effort extended by Canuto Capapas and Apolonio A. Lucero by donating real properties as lands to meet the requirements of becoming a municipality."
        ],
        [
            "Mayor Tomol with NDRRMC"
        ],
        [
            "The first set of Municipal Officials were appointed by President Elpidio Quirino on May 17, 1951.",
            "It was headed by Felix Balagon as Municipal Mayor, Leon Fortaliza as Vice Mayor, Manuel Tomol, Enrique Sarona, Modesto Miras and Manuel Cruzada as councilors.Mr.",
            "Pedro Tomol was appointed as Municipal Secretary."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Silago is politically subdivided into 15 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "There are 5 brangays of which are landlocked and the remaining 10 barangays are located at the east coast."
        ],
        [
            "Population Growth per Barangay"
        ],
        [
            "Barangays"
        ],
        [
            "Population (2015)"
        ],
        [
            "Population (2020)"
        ],
        [
            "Percent Change"
        ],
        [
            "Balagawan"
        ],
        [
            "825"
        ],
        [
            "850"
        ],
        [
            "3.03%"
        ],
        [
            "Catmon"
        ],
        [
            "179"
        ],
        [
            "141"
        ],
        [
            "-21.23%"
        ],
        [
            "Hingatungan"
        ],
        [
            "2,129"
        ],
        [
            "2,184"
        ],
        [
            "2.58%"
        ],
        [
            "Imelda"
        ],
        [
            "268"
        ],
        [
            "291"
        ],
        [
            "8.58%"
        ],
        [
            "Katipunan"
        ],
        [
            "589"
        ],
        [
            "728"
        ],
        [
            "23.60%"
        ],
        [
            "Laguma"
        ],
        [
            "800"
        ],
        [
            "795"
        ],
        [
            "-0.63%"
        ],
        [
            "Mercedes"
        ],
        [
            "1,840"
        ],
        [
            "1,824"
        ],
        [
            "-0.87%"
        ],
        [
            "Poblacion District 1"
        ],
        [
            "1,339"
        ],
        [
            "1,286"
        ],
        [
            "-3.96%"
        ],
        [
            "Poblacion District 2"
        ],
        [
            "1,406"
        ],
        [
            "1,439"
        ],
        [
            "2.35%"
        ],
        [
            "Puntana"
        ],
        [
            "356"
        ],
        [
            "322"
        ],
        [
            "-9.55%"
        ],
        [
            "Salvacion"
        ],
        [
            "642"
        ],
        [
            "652"
        ],
        [
            "1.56%"
        ],
        [
            "Sap-ang"
        ],
        [
            "609"
        ],
        [
            "650"
        ],
        [
            "6.73%"
        ],
        [
            "Sudmon"
        ],
        [
            "445"
        ],
        [
            "511"
        ],
        [
            "14.83%"
        ],
        [
            "Tuba-on"
        ],
        [
            "437"
        ],
        [
            "479"
        ],
        [
            "9.61%"
        ],
        [
            "Tubod"
        ],
        [
            "911"
        ],
        [
            "964"
        ],
        [
            "5.82%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Silago, Southern Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "90(3.5)"
        ],
        [
            "67(2.6)"
        ],
        [
            "82(3.2)"
        ],
        [
            "70(2.8)"
        ],
        [
            "97(3.8)"
        ],
        [
            "145(5.7)"
        ],
        [
            "142(5.6)"
        ],
        [
            "127(5.0)"
        ],
        [
            "132(5.2)"
        ],
        [
            "152(6.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "144(5.7)"
        ],
        [
            "1,417(55.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.0"
        ],
        [
            "13.5"
        ],
        [
            "16.0"
        ],
        [
            "16.5"
        ],
        [
            "20.6"
        ],
        [
            "24.3"
        ],
        [
            "26.0"
        ],
        [
            "25.4"
        ],
        [
            "25.2"
        ],
        [
            "26.4"
        ],
        [
            "23.0"
        ],
        [
            "21.1"
        ],
        [
            "255"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of SilagoYearPop.±% p.a.1960 5,315—    1970 7,459+3.44%1975 7,967+1.33%1980 9,323+3.19%1990 9,733+0.43%1995 9,785+0.10%2000 10,486+1.49%2007 11,163+0.87%2010 12,310+3.62%2015 12,775+0.71%2020 13,116+0.52%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Silago"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  30.60"
        ],
        [
            "2009  38.06"
        ],
        [
            "2012  31.11"
        ],
        [
            "2015  41.67"
        ],
        [
            "2018  26.77"
        ],
        [
            "2021  22.15"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Education"
        ],
        [
            "Elementary schools:"
        ],
        [
            "Almost all barangays have Elementary / Primary Schools, few are mentioned below:"
        ],
        [
            "Silago Central Elementary School - Barangay Poblacion District I"
        ],
        [
            "Sudmon Elementary School - Barangay Sudmon"
        ],
        [
            "Hingatungan Elementary School - Barangay Hingatungan"
        ],
        [
            "Awayon Elementary School - Barangay Mercedes"
        ],
        [
            "High schools:"
        ],
        [
            "There are only 4 high schools, which are strategically located at cater far flung areas."
        ],
        [
            "Silago National Vocational High School - Barangay Poblacion District II"
        ],
        [
            "Hingatungan National High School - Barangay Hingatungan (located at northern portion of the municipality)"
        ],
        [
            "Mercedes National High School - Barangay Mercedes (located at southern portion of the municipality)"
        ],
        [
            "Katipunan National High School - Barangay Katipunan (located at western portion of the municipality)"
        ],
        [
            "Tourism"
        ],
        [
            "Silago got her name from the word “murcielago” which is a Spanish term for bat, because of this species' dominance in the locality.",
            "Proof to this is the giant bat sanctuary at Barangay Catmon.",
            "Along the coastal barangays of the town, there are clean beaches and a structure designed by nature lying in the town's deep blue sea known as Pelada Rock, also locally known as “Batong Dako\" meaning large rock, which was occupied and utilized as a camp by the Japanese Imperial Army during the Second World War.",
            "The peculiar beauty of this rock is enhanced with the abundance of birds hovering and built their nest on it, sea snakes making the rock as their dwelling place, with fish and other marine products surrounding it.",
            "The rock is located just a short distance from the shore of Barangay Laguma and Barangay Salvacion."
        ],
        [
            "Farther north, is a natural rock formation with a length of more or less 50 meters from the shore and about 10 meters wide."
        ],
        [
            "The interior of Silago is mountainous, in which is the town's vast forest, home of the wild pigs locally known as “Baboy Ihas”.",
            "Among all the municipalities of the province, Silago is identified to have the biggest forest area."
        ],
        [
            "The Municipal Tree Park is another kind of tourist attraction in the municipality where fresh breeze and songs of the birds make the atmosphere pleasantly unique.",
            "On its northern part is a clean and clear river suitable for swimming."
        ],
        [
            "In the upper portion of the town, at different locations, are waterfalls.",
            "Kagut-an Falls is more or less 1 kilometer away from the national highway, at Barangay Katipunan.",
            "This falls is paired with another falls near its vicinity, locally called as Kagut-an Dako Dos Falls, which possesses an exceptional attraction to all who sees it.",
            "In the same barangay is another falls called Kagut-an Gamay Falls.",
            "In Barangay Mercedes, about 1 kilometer distance from Mercedes Barangay Road, is Sitio Kawayan Falls with a height of about 10 meters."
        ],
        [
            "Another falls is in Barangay Tubod distinctive in structure with matching cave on its opposite side.",
            "Water from this falls, along its way meets the Lanang River flow, which also has its own unique attraction."
        ],
        [
            "Aside from Lanang River, which is located at the town's mountain barangay, is the Maag River that crosses along the national highway in Poblacion District 1.",
            "This river forms a lake that is suited for boating recreation.",
            "At the mouth of the river is the brown fine sand beach of Silago, which is more or less 1 kilometer long."
        ],
        [
            "In the months of November to February, Silago's beaches are ideal for surfing with huge sea waves, comparable to waves in Siargao."
        ],
        [
            "Town Hymn"
        ],
        [
            "The Hymn was written and composed by Rev.",
            "Fr.",
            "Plutarco Rodriguez and Neil Mate, and was implemented by Mayor Martin Tomol Sr."
        ],
        [
            "Hymn of Silago"
        ],
        [
            "Lyrics"
        ],
        [
            "English translation"
        ],
        [
            "O lungsod kong mahal ikaw akong ampingan,"
        ],
        [
            "Tuburan sa kinabuhi sa mga lumulupyo,"
        ],
        [
            "Ikaw ang pag-laum nga nagagikan sa sidlakan,"
        ],
        [
            "Ikaw akong pangga-on ug akong mahalon."
        ],
        [
            "Silago, Silago, buot ako nga magpabilin kanimo,"
        ],
        [
            "Ang imong katahom gakson ko hangtud sa kahangturan,"
        ],
        [
            "Himuon ko ang tanan alang kanimo lungsod ko,"
        ],
        [
            "Kay ikaw ang gimat-an ko minahal nga yuta."
        ],
        [
            "Kalimpyo, kahimsug ug kalinaw, mao ang dalan sa Kalambuan,"
        ],
        [
            "Ug kining akong kinabuhi ihalad ko kanimo Silago,"
        ],
        [
            "Luha sa kagul-anan modagayday kung ikaw pasipad-an,"
        ],
        [
            "Kalipay og katawa ang matagamtaman,"
        ],
        [
            "Kung ang bidlisiw sa kalampusan makit-an."
        ],
        [
            "Silago, Silago, matin-aw pa ang suba sa paglaum,"
        ],
        [
            "Malunhaw pa gihapon ang tanaman sa kabukiran,"
        ],
        [
            "Ang balod sa kadagatan may panahon pa sa iyang paglurang,"
        ],
        [
            "O, Silago, ikaw ang lungsod kong mahal!"
        ],
        [
            "O, Silago, ikaw ang lungsod kong mahal!"
        ],
        [
            "Oh my beloved town, I will take care of you,"
        ],
        [
            "The source of life among the dwellers,"
        ],
        [
            "You are the hope that comes from the east,"
        ],
        [
            "You are the one I'll embrace and love."
        ],
        [
            "Silago, Silago, I desire to stay with you,"
        ],
        [
            "Your beauty I shall embrace forever,"
        ],
        [
            "I will do everything for you, my beloved town,"
        ],
        [
            "Because you awaken me, my beloved land."
        ],
        [
            "Cleanliness, Well-being, and Peace, is what you bring to Progress,"
        ],
        [
            "And I'll give my life to you, Silago,"
        ],
        [
            "The tears of anguish would flow away if you are harmed,"
        ],
        [
            "Joy and laughter would be experienced,"
        ],
        [
            "If the shine of success would be seen."
        ],
        [
            "Silago, Silago, the hope is clear as your rivers,"
        ],
        [
            "Such as green as the harvest in the plains,"
        ],
        [
            "The strong waves of the seas would someday be calm,"
        ],
        [
            "Oh, Silago, you are my beloved town!"
        ],
        [
            "Oh, Silago, you are my beloved town!"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Silago |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "326, s. 1950\".",
            "www.officialgazette.gov.ph.",
            "Retrieved 2023-12-24."
        ],
        [
            "^ a b \"Silago\".",
            "www.southernleyte.gov.ph.",
            "Retrieved 2016-04-28."
        ],
        [
            "^ \"Silago, Southern Leyte Profile – PhilAtlas\".",
            "www.philatlas.com.",
            "Retrieved 2022-07-28."
        ],
        [
            "^"
        ],
        [
            "\"Silago, Southern Leyte : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 13 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Southern Leyte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Philippine Company Listings - Philippine Business Directory - Page 1\".",
            "Philippine Companies."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Silago, Southern Leyte."
        ],
        [
            "Silago Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Silago"
        ],
        [
            "Abuyog, Leyte"
        ],
        [
            "Sogod"
        ],
        [
            "Silago"
        ],
        [
            "Leyte Gulf"
        ],
        [
            "Hinunangan"
        ],
        [
            "vte Province of Southern LeyteMaasin (capital and largest city)Municipalities"
        ],
        [
            "Anahawan"
        ],
        [
            "Bontoc"
        ],
        [
            "Hinunangan"
        ],
        [
            "Hinundayan"
        ],
        [
            "Libagon"
        ],
        [
            "Liloan"
        ],
        [
            "Limasawa"
        ],
        [
            "Macrohon"
        ],
        [
            "Malitbog"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pintuyan"
        ],
        [
            "Saint Bernard"
        ],
        [
            "San Francisco"
        ],
        [
            "San Juan"
        ],
        [
            "San Ricardo"
        ],
        [
            "Silago"
        ],
        [
            "Sogod"
        ],
        [
            "Tomas Oppus"
        ],
        [
            "Component City"
        ],
        [
            "Maasin"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Silago&oldid=1194741849\""
        ],
        [
            "Categories: Municipalities of Southern LeytePolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}