{
    "name": "Sinait",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sinait"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°52′00″N 120°27′30″E﻿ / ﻿17.8667°N 120.4583°E﻿ / 17.8667; 120.4583"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Sinait\" – news · newspapers · books · scholar · JSTOR (September 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesSinaitMunicipalityMunicipality of Sinait"
        ],
        [
            "FlagSealNickname: Garlic Center of the NorthMotto: Singising SinaitMap of Ilocos Sur with Sinait highlightedOpenStreetMapSinaitLocation within the PhilippinesCoordinates: 17°52′00″N 120°27′30″E﻿ / ﻿17.8667°N 120.4583°E﻿ / 17.8667; 120.4583CountryPhilippinesRegionIlocos RegionProvinceIlocos SurDistrict"
        ],
        [
            "1st districtBarangays44"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorGlenn B. Guzman • Vice MayorShee-an C. Guzman • RepresentativeRonald Singson • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jespher R. BarcelonaJoselito L. InesBlayne B. GuzmanEhlafe Y. BattadWilhelmino R. IbañezMarlowrie I. RemolacioMarlon B. InesJojo Q. Yoro"
        ],
        [
            " • Electorate18,752 voters (2022)Area • Revenue₱ 139.2 million (2020) • Assets₱ 1,319 million (2020) • Expenditure₱ 155.5 million (2020) • Liabilities₱ 88.49 million (2020)Service provider • ElectricityIlocos Sur Electric Cooperative (ISECO)Time zoneUTC+8 (PST)ZIP code2733PSGC012930000IDD : area code +63 (0)77Native languagesIlocano Tagalog"
        ],
        [
            "Sinait, officially the Municipality of Sinait (Ilocano: Ili ti Sinait; Filipino: Bayan ng Sinait), is a 3rd class municipality in the province of Ilocos Sur, Philippines.",
            "According to the 2020 census, it has a population of 25,998 people."
        ],
        [
            "History"
        ],
        [
            "The Chapel of the Santo Cristo Milagroso in Dadalaquiten Norte (the white building), taken from the Chapel of the La Virgen Milagrosa in nearby Paguetpet, Badoc.",
            "The body of water in the picture is part of the seashore where the two images were allegedly found floating in a box."
        ],
        [
            "Before Magellan discovered the Philippines in 1521, the locality was only a small village of little over a hundred natives who were called \"Tirongs.\"",
            "By nature, these primitive inhabitants were sea-faring warlike.",
            "In their fast and picturesque sailboats, they traveled to adjoining and distant places, most particularly to settlements and villages along the Ilocos Coast in Ilocos Norte, Ilocos Sur, La Union, Pangasinan and even Zambales.",
            "In those adventures, the “Tirongs “ always challenged the people encountered to tribal wars and fought small battles against them.",
            "Often, those sturdy and brave natives came out victorious.",
            "Even in their daily chores, those people showed their ferocious characteristics.",
            "When the renowned Iberians came, Juan de Salcedo was sent to explore and colonized the Ilocos territory during the early years of the Spanish regime, he found the “Tirongs” of Sinait in apogee of the social state.",
            "Small battles were daily occurrence so that in the year 1535, when the locality was organized and established as a “Pueblo.” Salcedo named the new community as “SIN-NAIT”, a word in the local tongue which means “CONTEST”.",
            "As a pueblo, Sinait embraced and included in its territorial limit such as distant places as \"Rancheria de Paur,\" now the Municipality of Nueva Era in Ilocos Norte and Southern barrios of Badoc of the same Province.",
            "The vast territory, however, was reduced to present 78 square kilometers.",
            "In the year 1575, the natives fully realized the hardships of pronouncing the term “Sin-nait” and to go away with the trouble, Salcedo declared that one of the letter “N” be dropped.",
            "Since then, this Municipality has been called “Sinait”.",
            "Nevertheless, it was only in 1913 when the same was “deeded” by the government upon the initiative of the late Don Calixto Cabacungan so that the Municipality Council enacted a resolution to that effect, that Sinait was adopted as official name of the community to which said resolution was duly approved by the Provincial board of Ilocos Sur and by the Defunct Philippine Legislature."
        ],
        [
            "The Santo Cristo Milagroso"
        ],
        [
            "Sinait houses the Sanctuary of the Miraculous Statue of the Black Nazarene (El Santo Cristo Milagroso), fondly called by its residents as \"Apo Lakay,\" and a treasure of Ilocandia.",
            "History traces the life-sized statue to Nagasaki, Japan.",
            "It was probably sent floating in the sea by missionaries operating in secret in Japan (for fear of persecution during the Tokugawa Bakufu).",
            "The box was found by local fishermen in the shores of Barangay Dadalaquiten Norte, on the boundary between Sinait and nearby Paguetpet (La Virgen Milagrosa), Badoc, in the year 1620, and fishermen from both towns carried it ashore.",
            "They found two statues inside the box—a statue of the Black Nazarene, and a statue of the Blessed Virgin Mary.",
            "According to legend, The fishermen from Sinait mysteriously were unable to move the statue of the Blessed Virgin Mary, but had no problems moving the Statue of the Black Nazarene.",
            "The fishermen from Badoc, however, were able to move the Statue of the Blessed Virgin Mary (later called the La Virgen Milagrosa) with ease, as they were unable to carry the image of the Black Nazarene.",
            "They took the statues to their respective towns and were venerated.",
            "In 1656, with a spreading devotion to the Santo Cristo Milagroso due to its miraculous powers, the Black Crucifix was taken to the capital town of Vigan, since an epidemic was raging there and through the devotion of the faithful, many got cured.",
            "Because of this, it is considered as an intercessor of all kinds of affliction and sickness.",
            "In 1660, because of the growing veneration to the image, the faithful begun the construction of a permanent edifice to house it.",
            "It took the people of Sinait eight years to construct the church with funds provides by the Spanish Audiencia.",
            "Today the landing site of Apo Lakay is marked by a chapel at Lugo Beach in Barangay Dadalaquiten Norte, and is a place of pilgrimage for devotees, as with the nearby chapel marking La Virgen Milagrosa's landing site."
        ],
        [
            "Geography"
        ],
        [
            "It is the northernmost municipality of the province and is 36 kilometres (22 mi) from the provincial capital, Vigan, 46 kilometres (29 mi) from Laoag, and 441 kilometres (274 mi) from Manila.",
            "The municipality is bordered by the province of Ilocos Norte by Badoc and Nueva Era to the north, and Cabugao to the south."
        ],
        [
            "Barangays"
        ],
        [
            "Sinait is politically subdivided into 44 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Aguing"
        ],
        [
            "Ballaigui (Poblacion)"
        ],
        [
            "Baliw"
        ],
        [
            "Baracbac"
        ],
        [
            "Barikir"
        ],
        [
            "Battog"
        ],
        [
            "Binacud"
        ],
        [
            "Cabangtalan"
        ],
        [
            "Cabarambanan"
        ],
        [
            "Cabulalaan"
        ],
        [
            "Cadanglaan"
        ],
        [
            "Calingayan"
        ],
        [
            "Curtin"
        ],
        [
            "Dadalaquiten Norte"
        ],
        [
            "Dadalaquiten Sur"
        ],
        [
            "Duyayyat"
        ],
        [
            "Jordan"
        ],
        [
            "Calanutian"
        ],
        [
            "Katipunan"
        ],
        [
            "Macabiag (Poblacion)"
        ],
        [
            "Magsaysay"
        ],
        [
            "Marnay"
        ],
        [
            "Masadag"
        ],
        [
            "Nagcullooban"
        ],
        [
            "Nagbalioartian"
        ],
        [
            "Nagongburan"
        ],
        [
            "Namnama (Poblacion)"
        ],
        [
            "Pacis"
        ],
        [
            "Paratong"
        ],
        [
            "Dean Leopoldo Yabes (Pug-os)"
        ],
        [
            "Purag"
        ],
        [
            "Quibit-quibit"
        ],
        [
            "Quimmallogong"
        ],
        [
            "Rang-ay (Poblacion)"
        ],
        [
            "Ricudo"
        ],
        [
            "Sabangan (Marcos)"
        ],
        [
            "Sallacapo"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Sapriana"
        ],
        [
            "Tapao"
        ],
        [
            "Teppeng"
        ],
        [
            "Tubigay"
        ],
        [
            "Ubbog"
        ],
        [
            "Zapat"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sinait, Ilocos Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "19(66)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "9(0.4)"
        ],
        [
            "11(0.4)"
        ],
        [
            "13(0.5)"
        ],
        [
            "23(0.9)"
        ],
        [
            "92(3.6)"
        ],
        [
            "122(4.8)"
        ],
        [
            "153(6.0)"
        ],
        [
            "137(5.4)"
        ],
        [
            "139(5.5)"
        ],
        [
            "141(5.6)"
        ],
        [
            "42(1.7)"
        ],
        [
            "14(0.6)"
        ],
        [
            "896(35.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "4.6"
        ],
        [
            "4.0"
        ],
        [
            "6.2"
        ],
        [
            "9.1"
        ],
        [
            "19.5"
        ],
        [
            "23.2"
        ],
        [
            "24.0"
        ],
        [
            "22.5"
        ],
        [
            "21.5"
        ],
        [
            "15.2"
        ],
        [
            "10.5"
        ],
        [
            "6.0"
        ],
        [
            "166.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of SinaitYearPop.±% p.a.1903 9,157—    1918 12,335+2.01%1939 11,722−0.24%1948 12,015+0.27%1960 15,170+1.96%YearPop.±% p.a.1970 16,429+0.80%1975 17,952+1.79%1980 19,050+1.19%1990 21,779+1.35%1995 22,608+0.70%YearPop.±% p.a.2000 24,070+1.35%2007 24,896+0.47%2010 25,427+0.77%2015 25,640+0.16%2020 25,998+0.27%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Sinait had a population of 25,998.",
            "The population density was 400 inhabitants per square kilometre (1,000/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Public Market"
        ],
        [
            "Poverty incidence of Sinait"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  16.70"
        ],
        [
            "2009  18.68"
        ],
        [
            "2012  20.00"
        ],
        [
            "2015  12.24"
        ],
        [
            "2018  5.64"
        ],
        [
            "2021  18.28"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "As major producer of Garlic, Sinait is also known as the Garlic Center of the North."
        ],
        [
            "Tourism"
        ],
        [
            "The Basilica of Saint Nicholas de Tolentino of Sinait."
        ],
        [
            "Sinait Public Market - On certain days garlic from the municipality and even the neighboring municipalities of Badoc and Pinili in neighboring Ilocos Norte are traded here."
        ],
        [
            "Barangay Pug-os/Dean Leopoldo Yabes - Barangay Pug-os was renamed as Barangay Dean Leopoldo Yabes, in honor of the Ilocano writer and dean from the University of the Philippines who once lived in Sinait."
        ],
        [
            "Cabangtalan (Imelda's Cove) - Features white sand beaches.",
            "It is located on the way to Barangay Dadalaquiten Norte and Paguetpet (Badoc)."
        ],
        [
            "Basilica of Saint Nicholas de Tolentino and Shrine of El Santo Cristo Milagroso - A Roman Catholic church, and a minor basilica, that houses the Miraculous Statue of the Black Nazarene (El Santo Cristo Milagroso) or \"Apo Lakay.\"",
            "On May 3, 2021, Archbishop Marlo Peralta of the Archdiocese of Nueva Segovia announced that Pope Francis elevated the church to the rank of minor basilica during a Mass."
        ],
        [
            "Barangay Dadalaquiten Norte - The landing place of the Miraculous Statue of the Black Nazarene in 1620, close to the landing place of the La Virgen Milagrosa in neighboring Paguetpet, Badoc, Ilocos Norte."
        ],
        [
            "Libunao Protected Landscape -  A protected watershed area in Barangay Nagcullooban."
        ],
        [
            "Sinait National High School - One of the largest secondary schools in Ilocos Sur."
        ],
        [
            "Calanutian - Homeplace of Inez Cannoyan the wife of Lam-Ang in the fictional Ilocano Story Biag ni Lam-Ang"
        ],
        [
            "Lugo Beach - A summer destination located at Dadalaquiten Norte, where the Dadalaquiten Floating Cottages are found.",
            "The place where the Santo Cristo Milagroso was carried ashore when it was found (with the La Virgen Milagrosa)."
        ],
        [
            "Cabulalaan Hills - A hiking destination."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Sinait, belonging to the first congressional district of the province of Ilocos Sur, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2022–2025)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Ronald V. Singson"
        ],
        [
            "Mayor"
        ],
        [
            "Glenn B. Guzman"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Shee-an C. Guzman"
        ],
        [
            "Councilors"
        ],
        [
            "Romel P. Dayoan"
        ],
        [
            "Marlowrie I. Remolacio"
        ],
        [
            "Marlon B. Ines"
        ],
        [
            "King Dave V. Guzman"
        ],
        [
            "Jojo Q. Yoro"
        ],
        [
            "Wilhelmina R. Ibanez"
        ],
        [
            "Jaco Rafael C. Agdeppa"
        ],
        [
            "Leopoldo Florentino D. Rosete"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sinait |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Ilocos Sur\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Sinait: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 14 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Pope declares Sinait Church a minor basilica\".",
            "CBCPNews.",
            "4 May 2021.",
            "Retrieved 14 May 2021."
        ],
        [
            "^ \"Sinait Church in Ilocos Sur formally elevated to minor basilica\".",
            "CBCPNews.",
            "2022-02-16.",
            "Retrieved 2022-02-25."
        ],
        [
            "^ Baroña, Franco Jose C. (2022-02-20).",
            "\"It's official: Sinait church now a basilica minor\".",
            "The Manila Times.",
            "Retrieved 2022-02-25."
        ],
        [
            "^ \"Heritage church in Ilocos Sur declared 'minor basilica'\".",
            "RAPPLER.",
            "2022-02-21.",
            "Retrieved 2022-02-25."
        ],
        [
            "^ \"Tourism\".",
            "Municipality of Sinait.",
            "Retrieved 14 May 2021."
        ],
        [
            "^ \"Get a glimpse of Ilocos Sur history via visita iglesia\".",
            "GMA News Online.",
            "21 March 2008.",
            "Retrieved 14 May 2021."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 11, 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Sinait."
        ],
        [
            "Pasyalang Ilocos Sur"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Sinait National High School - Official Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Sinait"
        ],
        [
            "Badoc, Ilocos Norte"
        ],
        [
            "South China Sea"
        ],
        [
            "Sinait"
        ],
        [
            "Nueva Era, Ilocos Norte"
        ],
        [
            "Cabugao"
        ],
        [
            "vte Province of Ilocos SurVigan (capital)  Candon (largest city)Municipalities"
        ],
        [
            "Alilem"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bantay"
        ],
        [
            "Burgos"
        ],
        [
            "Cabugao"
        ],
        [
            "Caoayan"
        ],
        [
            "Cervantes"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Lidlidda"
        ],
        [
            "Magsingal"
        ],
        [
            "Nagbukel"
        ],
        [
            "Narvacan"
        ],
        [
            "Quirino"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Juan"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Component cities"
        ],
        [
            "Candon"
        ],
        [
            "Vigan"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Sur"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sinait&oldid=1219847268\""
        ],
        [
            "Category: Municipalities of Ilocos SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textAll articles with unsourced statementsArticles with unsourced statements from July 2020Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}