{
    "name": "Sindangan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sindangan"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogУкраїнськаTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°14′19″N 122°59′55″E﻿ / ﻿8.2386°N 122.9986°E﻿ / 8.2386; 122.9986"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Zamboanga del Norte, Philippines"
        ],
        [
            "Municipality in Zamboanga Peninsula, PhilippinesSindanganMunicipalityMunicipality of Sindangan(From top, left to right): Port of Sindangan, Downtown Proper, Jollibee Rotonda, Sindangan River Esplanade, Musical and Dancing Fountain"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "Fish Capital of Zamboanga del Norte"
        ],
        [
            "Zanorte’s Premier Municipality"
        ],
        [
            "Motto: Uswag Sindangan!Map of Zamboanga del Norte with Sindangan highlightedOpenStreetMapSindanganLocation within the PhilippinesCoordinates: 8°14′19″N 122°59′55″E﻿ / ﻿8.2386°N 122.9986°E﻿ / 8.2386; 122.9986CountryPhilippinesRegionZamboanga PeninsulaProvinceZamboanga del NorteDistrict"
        ],
        [
            "2nd districtFoundedDecember 22, 1936Barangays52"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRosendo S. Labadlabad • Vice MayorNilo Florentino Z. Sy • RepresentativeGlona G. Labadlabad • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Clint V. MaciasBethlehem B. GurreaRonnie A. AnselingGervalieto S. AbapoJerome E. OchavoVictoria S. LabadlabadVirginia G. OngMarcelo B. Yano"
        ],
        [
            " • Electorate72,613 voters (2022)Area • Total103,952 • Rank"
        ],
        [
            "1st out of 25 municipalities in Zamboanga del Norte"
        ],
        [
            "1st out of 67 municipalities in Zamboanga Peninsula"
        ],
        [
            " • Density230/km2 (600/sq mi) • Households24,895DemonymSindanganonEconomy • Income class1st municipal income class • Poverty incidence47.48% (2021)"
        ],
        [
            " • Revenue₱ 459 million (2020) • Assets₱ 905.2 million (2020) • Expenditure₱ 233.8 million (2020) • Liabilities₱ 204.2 million (2020)Service provider • ElectricityZamboanga del Norte Electric Cooperative (ZANECO)Time zoneUTC+8 (PST)ZIP code7112PSGC097218000IDD : area code +63 (0)65Native languagesSubanon Cebuano TagalogCatholic dioceseDiocese of DipologPatron saintSaint Joseph the Worker (primary) Our Lady of Fatima (secondary)Websitewww.sindangan.gov.ph"
        ],
        [
            "Sindangan, officially the Municipality of Sindangan (Cebuano: Lungsod sa Sindangan; Subanen: Benwa Sindangan; Chavacano: Municipalidad de Sindangan; Tagalog: Bayan ng Sindangan), is a 1st class municipality in the province of Zamboanga del Norte, Philippines.",
            "According to the 2020 census, it has a population of 103,952 people."
        ],
        [
            "With increasing investor interests, improved infrastructures, and rapid population growth over the last decade, Sindangan is the fastest-growing municipality in the province of Zamboanga del Norte.",
            "It is also the second most populous locality after the provincial capital, Dipolog, and is the biggest and the most populous municipality in the entire Zamboanga Peninsula region, followed by the municipalities of Ipil in Zamboanga Sibugay, and Molave in Zamboanga del Sur."
        ],
        [
            "Due to its rapid demographic and economic growth, steps are being taken to convert the status of Sindangan from a municipality to a city in the next coming years.",
            "Once approved and ratified, Sindangan will be the third city in Zamboanga del Norte, following the cities of Dipolog and Dapitan."
        ],
        [
            "Etymology"
        ],
        [
            "As to how Sindangan got its name, several stories have been told."
        ],
        [
            "The first version narrates that a native fisherman carrying a basket full of fish was on his way home met a Guardia Civil, military guards during the Spanish regime, who asked this question, \"Cuál es el nombre de este lugar, amigo?\"",
            "(English: What is the name of this place, friend?)",
            "And the Subanon fisherman who did not understand the Spanish language answered \"Indangan\", believing he asked on the kind of fish he caught.",
            "The stranger heard this as \"Sindangan\", thinking that was the exact answer to his inquiry to the fisherman about the name of the fish.",
            "From then on, the natives used Sindangan to name the place until it became into a municipality in 1936."
        ],
        [
            "The town appeared in the 1734 Murillo Velarde map which was originally spelled as Sindãgan."
        ],
        [
            "History"
        ],
        [
            "President Quezon declared the charter day of Sindangan"
        ],
        [
            "Pre-Spanish Era"
        ],
        [
            "This town sets back its origin during the pre-Spanish colonization of the Philippines.",
            "Subanon people or tribe was its first inhabitants.",
            "The Subanens, a nomadic tribe of Indo-Malayan stock, were the earliest known settlers who lived along river banks or \"suba\", from which word they received their present tribal identity as Subanen.",
            "They built houses and sanctuaries for their shelter and formed their own 'government' ruled by the Datu."
        ],
        [
            "Over the years the Moros settled also in this place and preached Islam."
        ],
        [
            "Spanish Era (As a Municipal District)"
        ],
        [
            "During the Spanish reign in the archipelago where towns had already been established, Sindangan was a barrio under the jurisdiction of the then municipality of Dapitan as early as 1598 to 1729, and slowly people from the Visayas islands flocked to Mindanao to find greener pasture.",
            "Christianity also propagated on this area through the effort of the Catholic missionaries like the Society of Jesus or the Jesuits, the Augustinians, and the Dominicans.",
            "One of its great missionaries was Padre Francesco Palliola, a Jesuit missionary from Nola, Italy who tirelessly preached the Christian message, perform baptisms and sacraments and helped the tribal people in this area of Zamboanga Peninsula.",
            "He was assigned in Dapitan and Katipunan, and met his martyrdom in the barrio of Ponot (now Jose Dalman) where he was killed by the Subanen people through the leadership of their chieftain.",
            "Later on, the barrio of Sindangan was transferred under the newly established town of Lubungan (now Katipunan, who also was then a barrio of Dapitan) since the 19th century, unconnected by road."
        ],
        [
            "Commonwealth Era (As a separate Municipality)"
        ],
        [
            "A portion of the downtown area along Quezon Avenue in 1961 (left) and in 2022 (right)"
        ],
        [
            "On December 23, 1936, Sindangan was separated from the municipality of Katipunan and became an independent municipality by virtue of Executive Order No.",
            "77 issued by President of the Commonwealth of the Philippines, Manuel L. Quezon.",
            "The municipalities of Sindangan, Siocon, Margosatubig, Pagadian, and Kabasalan were created out of the municipal districts of Sindangan, Panganuran, Labangan, Dinas, Sibuko, Sirawai, Margosatubig, Malangas, Kabasalan and Bangaan.",
            "The Municipality of Sindangan covered the area of Sindangan and Panganuran."
        ],
        [
            "Bartolome Lira Sr. was appointed to organize the Municipality of Sindangan and was its first Municipal President.",
            "As his appointive tenure expired, he was elected as the first Municipal Mayor of Sindangan until 1941."
        ],
        [
            "In 1955, four barrios of were created:"
        ],
        [
            "Dicoyong - sitios of Labakid, Layawan, Morob, Gusani, Domalogdog, Maoal, Nato, Diongan, Makasing, Dipolo and Dicoyong Proper;"
        ],
        [
            "Bacungan - sitios of Palandok, Rison, Bogabongan, Manil, Gusao, Talinga and Bacungan Proper;"
        ],
        [
            "Lagag - sitios of Milaub, Mangalop, Gopit, Pase, Lipaga, Mianib, Siayan, Litolit, Balok, and Lagag Proper; and Bitoon - sitios of Misok, Hagonoy, Lico, Guban, Makinong, and Bitoon Proper"
        ],
        [
            "Binuangan - sitios of Taguicon, Upper Binuangan, and Gusapong Proper"
        ],
        [
            "In 1959, the sitios of Gonayen, Gowayan, Domogok, Dinoyak, Mangilay, Pange, Balak, Laclac, Siriac, Macasing and Diongan were constituted into the barrio of Gonayen."
        ],
        [
            "Sindangan's political territory in 1936 (left) and in the present (right) in comparison with Zamboanga City"
        ],
        [
            "At the time of its creation as an independent municipality, Sindangan had the biggest territory in terms of land area in the then Province of Zamboanga (now the administrative region Zamboanga Peninsula with three separate provinces).",
            "It once comprised the current municipalities of Sindangan, Siayan, Leon B. Postigo, Salug, Godod, Liloy, Tampilisan, Labason, Gutalac, and Kalawit.",
            "With these measurements as evidenced, Sindangan was deemed to be bigger than the present land area of Zamboanga City before its division."
        ],
        [
            "It was during the Third Philippine Republic when Sindangan subsequently lost huge portions of its territories after the creation of its offspring municipalities, namely: Labason (1947), These aforementioned new municipalities also went reductions of their territories later in the years in light of the creation of newer municipalities, making Sindangan their mother and grandmother town."
        ],
        [
            "Since its elevation to a municipality in 1936, people from Luzon and the Visayas continued migrating to Sindangan to settle together with their families and built businesses.",
            "That is why aside from the Subanens, there are Sindanganons whose origins are from Bohol, Cebu, Samar, Leyte, Negros, Bicol, Pampanga, and Manila."
        ],
        [
            "World War II"
        ],
        [
            "When the Japanese forces invaded parts of Zamboanga Peninsula during the second world war, Sindangan was fortunately spared from the air bombings and battles happening in the Mindanao Island at the time.",
            "Nonetheless, Sindangan shared a piece of World War II history when the SS Shinyō Maru sank in the waters of Sindangan Bay with hundreds of prisoners of war on board the Japanese hell ship."
        ],
        [
            "With approximately 750 Filipino and American prisoners of war (POW) on board, the vessel departed from its POW camp in Davao for Manila with stopover point in Zamboanga City.",
            "She departed Zamboanga the next day via Cebu in a convoy of large freighters, tankers, and torpedo boats to protect her against American destroyers.",
            "Meanwhile, an allied intelligence intercepted the Japanese Navy radio signals about Shinyō Maru’s movements which prompted the US Navy to send the submarine USS Paddle in a mission to intercept the convoy and sink her.",
            "With its movement now determined, the US submarine had waited for hours for the hell ship to pass by, two miles off coast from Sindangan point."
        ],
        [
            "Upon reaching the waters of Sindangan Bay, Shinyō Maru was seen to be leading the convoy.",
            "Paddle got into position and fired a spread of four torpedoes at her, two of which hit her in her holds.",
            "Paddle then torpedoed a second ship of the convoy, whose commander beached her to prevent her from sinking.",
            "The Japanese escorts then started unsuccessfully depth charging Paddle, but she dived deep and escaped serious damage."
        ],
        [
            "The torpedoes that hit Shin'yō Maru killed or wounded many of the POWs, and some of her Japanese crew and guards.",
            "As she sank, the guards machine-gunned the POWs to try to prevent them from abandoning ship.",
            "The surviving ships of the convoy launched boats to rescue Shin'yō Maru's crew and guards.",
            "A machine-gun mounted on the grounded ship also fired on the prisoners.",
            "Of 750 PoWs aboard the hell ship, 668 were killed.",
            "83 got ashore alive, but one died the next day.",
            "47 of her 52 Japanese crew and army guards were also killed."
        ],
        [
            "The escaped POWs went inland, where they met a Filipino guerilla group commanded by a US Colonel McGee.",
            "The guerillas radioed US forces, who sent the submarine USS Narwhal to rescue them.",
            "On 29 October 1944 Narwhal came into Sindangan Bay, where she embarked 81 of the 82 survivors.",
            "One survivor, Joseph Coe, chose to remain to serve with the guerillas."
        ],
        [
            "On September 7, 2014, on the 70th anniversary of the incident, the municipality of Sindangan dedicated a memorial remembering the victims and survivors of the Shinyo Maru, as well as the townsfolk who extended their hospitality and help."
        ],
        [
            "Potential for Cityhood"
        ],
        [
            "Plans to convert Sindangan into a city started as early as 2006 upon observations that the town has become the most progressive and  the most income-generating municipality in Zamboanga Peninsula.",
            "This initiative, however, did not materialize after politicians who spearheaded the proposal did not win the following elections.",
            "Since 2020, Sindangan had surpassed two out of the three requirements for cityhood as mandated by the Local Government Code — its land area and total population.",
            "With an increasing number of investors in the last five years since 2017, the town is hopeful to meet the minimum annual income requirement of 100 million by the end of 2025.",
            "Currently, the local government has initiated a campaign called “Damgo Dos Mil Baynte Singko ” where ambitious projects and massive remodelings are being done in all its vicinity in ways of addressing the town’s inadequacies, aiming to improve its facilities, and making the town a conducive place for investment in the upcoming years.",
            "With its vision to become the third city in Zamboanga del Norte (after Dipolog and Dapitan), and the sixth in Zamboanga Peninsula (after Dipolog, Dapitan, Pagadian, Isabela, and Zamboanga), the municipal government of Sindangan is venturing into big steps for them to make the grade and finally be able to file a bill in the congress for its conversion from a first class municipality to a chartered component city."
        ],
        [
            "Geography"
        ],
        [
            "Sindangan lies on the northwest corridor of Zamboanga del Norte.",
            "Its diverse geography ranges from Sulu Sea on the west and southwest, the Municipality of Leon Postigo on the south, the Municipality of Siayan on the east, the Municipality of Bayog, Zamboanga del Sur on the southeast, and the Municipality of Jose Dalman on the north.",
            "Ranging from plain, slightly rolling, hilly to mountainous terrains, the Municipality of Sindangan embraces 45,100 hectares of land.",
            "Of its 52 barangays, 22 are situated along the seacoast, bountifully blessed with marine resources which gained Sindangan the title “the fishing capital of Zamboanga del Norte.”"
        ],
        [
            "It is approximately 86 kilometers away from Dipolog and 234 kilometers away from Zamboanga City.",
            "Hence, the municipality is identified as the trading hub of the province considering, this is a major terminal point for links to Dipolog down to Ipil and further down south to Zamboanga City."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sindangan, Zamboanga del Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "104(4.1)"
        ],
        [
            "76(3.0)"
        ],
        [
            "92(3.6)"
        ],
        [
            "97(3.8)"
        ],
        [
            "199(7.8)"
        ],
        [
            "238(9.4)"
        ],
        [
            "195(7.7)"
        ],
        [
            "193(7.6)"
        ],
        [
            "178(7.0)"
        ],
        [
            "212(8.3)"
        ],
        [
            "171(6.7)"
        ],
        [
            "110(4.3)"
        ],
        [
            "1,865(73.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "14.7"
        ],
        [
            "12.5"
        ],
        [
            "15.8"
        ],
        [
            "17.5"
        ],
        [
            "27.6"
        ],
        [
            "28.5"
        ],
        [
            "29.0"
        ],
        [
            "27.5"
        ],
        [
            "26.9"
        ],
        [
            "27.9"
        ],
        [
            "23.5"
        ],
        [
            "18.2"
        ],
        [
            "269.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Sindangan is politically subdivided into 52 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "It is the most of the 27 local government units in Zamboanga del Norte."
        ],
        [
            "Bago"
        ],
        [
            "Balok"
        ],
        [
            "Bantayan"
        ],
        [
            "Bato"
        ],
        [
            "Benigno Aquino Jr."
        ],
        [
            "Binuangan"
        ],
        [
            "Bitoon"
        ],
        [
            "Bucana"
        ],
        [
            "Calatunan"
        ],
        [
            "Caluan"
        ],
        [
            "Calubian"
        ],
        [
            "Dagohoy"
        ],
        [
            "Dapaon"
        ],
        [
            "Datagan"
        ],
        [
            "Datu Tangkilan"
        ],
        [
            "Dicoyong"
        ],
        [
            "Disud"
        ],
        [
            "Don Ricardo G Macias (Dinokot)"
        ],
        [
            "Doña Josefa"
        ],
        [
            "Dumalogdog"
        ],
        [
            "Fatima"
        ],
        [
            "Gampis"
        ],
        [
            "Goleo"
        ],
        [
            "Imelda"
        ],
        [
            "Inuman"
        ],
        [
            "Joaquin Macias"
        ],
        [
            "La Concepcion"
        ],
        [
            "La Roche San Miguel"
        ],
        [
            "Labakid"
        ],
        [
            "Lagag"
        ],
        [
            "Lapero"
        ],
        [
            "Lawis"
        ],
        [
            "Mandih"
        ],
        [
            "Maras"
        ],
        [
            "Mawal"
        ],
        [
            "Misok"
        ],
        [
            "Motibot"
        ],
        [
            "Nato"
        ],
        [
            "Nipaan"
        ],
        [
            "Pangalalan"
        ],
        [
            "Piao"
        ],
        [
            "Poblacion"
        ],
        [
            "Pres.",
            "Ramon Magsaysay"
        ],
        [
            "Santo Niño"
        ],
        [
            "Santo Rosario"
        ],
        [
            "Siari"
        ],
        [
            "Talinga"
        ],
        [
            "Tigbao"
        ],
        [
            "Tinaplan"
        ],
        [
            "Titik"
        ],
        [
            "Upper Inuman"
        ],
        [
            "Upper Nipaan"
        ],
        [
            "Barangay Mandih, Poblacion, and Siari are the most densely populated areas of Sindangan as of the latest count."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of SindanganYearPop.±% p.a.1903 43—    1918 10,095+43.89%1939 27,324+4.86%1948 30,484+1.22%1960 37,105+1.65%1970 43,349+1.57%1975 53,649+4.37%1980 66,177+4.29%YearPop.±% p.a.1990 66,692+0.08%1995 72,098+1.47%2000 80,133+2.29%2007 87,720+1.26%2010 94,146+2.61%2015 99,435+1.05%2020 103,952+0.88%Source: Philippine Statistics Authority"
        ],
        [
            "Population"
        ],
        [
            "Sindangan is the first (and currently the only) municipality in Zamboanga Peninsula to reach the 100,000 population mark.",
            "As of the 2020 census, the town has a population of 103,952 people, making it the second largest local government unit in the province of Zamboanga del Norte after the provincial capital city of Dipolog.",
            "Despite being a municipality, it is 20,000 people ahead of the population of the city of Dapitan and is either twice or three times more of the population of every municipality in the province compared, making Sindangan the most populous municipality in Zamboanga del Norte.",
            "It is also the most populous municipality in Region IX."
        ],
        [
            "Sindangan is populated by the tri-people – the Subanens, Muslims, and the Christian migrants coming from Luzon and Visayan islands."
        ],
        [
            "Community-Based Monitoring System puts the number of Subanens as 24,640 or 27.5 percent of the total population with the greater number of them living in the interior barangays.",
            "The Muslims – Maranao and Tausug merchants live and ply their trades in Poblacion and its adjoining barangays."
        ],
        [
            "As of 2023, Sindangan has a stronghold of 72,613 registered voters."
        ],
        [
            "Religion"
        ],
        [
            "Roman Catholicism strongly dominates Sindangan as shown by their religious festivities and fiestas.",
            "Famous to these Catholic Devotion is the Diocesan Shrine of the Divine Mercy in Barangay Siari where thousands of pilgrims flocked from all over the region to pray and visit to the shrine.",
            "Other Christian denominations are also present in Sindangan as well as Islam."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Sindangan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  58.20"
        ],
        [
            "2009  56.84"
        ],
        [
            "2012  46.94"
        ],
        [
            "2015  48.35"
        ],
        [
            "2018  37.10"
        ],
        [
            "2021  47.48"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Sindangan’s economy is mainly focused on agriculture and fishing.",
            "It has a plain and elevated geography that is ideal for planting crops.",
            "Among its primary agricultural products are rice, corn, banana, and vegetable crops that is typically grown on its outlying barangays and are brought by batches in the town center every Sunday morning.",
            "Being a coastal town, Sindangan boasts its fresh sea products coming from the abundant waters of the Sindangan Bay.",
            "The municipality has been the main supplier of sea products in landlocked municipalities such as Siayan in Zamboanga del Norte, and the towns of Dumingag, Mahayag, Sominot, Midsalip, and Molave in Zamboanga del Sur, thus earning Sindangan the nickname as the “Fishing Capital”.",
            "More than that, the town is also famous of its varieties of fresh and dried fish products and its local restaurants known as “Sutukil”."
        ],
        [
            "The Internal Revenue Allotment of the municipality for Year 2014 is P161,572, 290.00.",
            "For the past five years, the IRA has been varying and increasing except for the year 2012 which has decreased by 2.8% from the previous year.",
            "This year's IRA has an increase of 12% compared to last year which is P 141,862,067.00."
        ],
        [
            "Income from local sources for 2012 amounted to P 17,457,998.60 which has an increase of about 14.5% from the previous year.",
            "In 2009, the local income recorded is P 9,548,248.00 and has an increase of 20% by the following year which amounted to P13,080,838.79.",
            "Its major income relies on fishing and agriculture.",
            "There is also significant growth in the town's business firms as it rises on the past years."
        ],
        [
            "In 2015, the Gross Sales of registered firms in Sindangan amounted to 1,062,872,781.00 PHP and expects to rise significantly in the next following years.",
            "Financial institutions are also growing in the town, as of 2015, it has 42 institutions and banks catering the Sindanganons financially."
        ],
        [
            "In 2022, Sindangan maintained its title as being the richest municipality in Zamboanga Peninsula as proven by the data released in the annual fiscal audit of COA, having a total revenue of 654,795,923 and a net income of 330,721,739."
        ],
        [
            "The health capacity and services of Sindangan is significantly improving as health workers such as Doctors, Nurses, Midwives, etc., are growing.",
            "On 2014, there are 90 health servers in the town both in public and in private."
        ],
        [
            "Government"
        ],
        [
            "Mayors of the Municipality of Sindangan"
        ],
        [
            "Bartolome Lira Sr., 1936-1941"
        ],
        [
            "Emilio Ortuoste, 1942-1945"
        ],
        [
            "Joaquin Macias, 1946-1953, 1958-1963"
        ],
        [
            "Abundio Siasico, 1954-1957"
        ],
        [
            "Filomena Macias, 1964-1967"
        ],
        [
            "Jose Tan, 1968-1971"
        ],
        [
            "Mariano S. Macias, 1972-1979"
        ],
        [
            "Ricardo S. Macias, 1980-1985"
        ],
        [
            "Crescente Y. Llorente Jr., 1986-1995, July–November 2004"
        ],
        [
            "Winnie O. Albos, 1995-2004"
        ],
        [
            "Bert S. Macias, November 2004-June 2010"
        ],
        [
            "Nilo Florentino Z. Sy, July 2010-June 2019"
        ],
        [
            "Rosendo S. Labadlabad, July 2019-present"
        ],
        [
            "Sindangan's local government structure is composed of one mayor, one vice mayor and eight councilors, named as Sangguniang Bayan members, all elected through popular vote.",
            "Two ex officio members are added to the Sangguniang Bayan with one representing Sindangan's 52 Barangay Captains being the Association of Barangay Councils (ABC) President, and one representing Sindangan's 52 Barangay Youth Council Presidents being the Sangunniang Kabataan (SK) Federation President.",
            "Each official, with the exemption of the ABC and SK Presidents, is elected publicly to a 3-year term and can be re-elected up to 3 terms in succession."
        ],
        [
            "Transportation"
        ],
        [
            "Tricycles, 'trisikads' and 'habal-habal' are the common public transport in the town center, both uptown and downtown.",
            "Racal Motorcycles are also emerging as public transportation in the town."
        ],
        [
            "By Land"
        ],
        [
            "The Sindangan Integrated Bus Terminal in Barangay Goleo is served by numerous public land transports such as the RTMI Buses (Rural Transit) via National Highway.",
            "It provides daily transport from Dipolog, Ipil, to Zamboanga City.",
            "SUVs or 'van', Ceres Liners and jeepneys are also available for daily transport.",
            "Trips to Pagadian City has also been already operational via Sindangan-Siayan-Dumingag-Mahayag road."
        ],
        [
            "By Sea"
        ],
        [
            "Aerial view of the port of Sindangan"
        ],
        [
            "The Port of Sindangan is a seaport located in Barangay Calatunan, facing the Sindangan Bay.",
            "It is currently managed under the Philippine Ports Authority (PPA) and is considered as the main gateway of the town's economy.",
            "Recently, since June 2022, the port is already operating regular RORO trips to and from the cities of Dumaguete and Cebu."
        ],
        [
            "Sports"
        ],
        [
            "The Sindangan dancing fountain illuminating the colors of the Philippine flag"
        ],
        [
            "Sindangan Cultural and Sports Complex"
        ],
        [
            "Sports life and social recreation are active in Sindangan.",
            "The town was also energized as the Sindangan Cultural and Sports Complex, one of the biggest in the Region 9, was made into a reality.",
            "The complex consists of an outdoor basketball and tennis court, an olympic-size swimming pool, diving board, musical and dancing fountain, and a coliseum-type sports center, known as the SinDome, that is capable of handling concerts, pageants, seminars, and other related events."
        ],
        [
            "Today, the sports complex is already functional for big events such as provincial sports meet, regional meets, and for every annual celebration of the Linggo ng Sindangan."
        ],
        [
            "In addition, each barangay in Sindangan is equipped with a covered court that is capable of handling barangay events and community gatherings."
        ],
        [
            "Tourism"
        ],
        [
            "These are only some of its places of interest and recreation."
        ],
        [
            "The esplanade with the Piao Bridge in the far background"
        ],
        [
            "Sindangan River Boardwalk Esplanade"
        ],
        [
            "The Sindangan River Boardwalk Esplanade, more commonly referred to as the Sindangan Sunset Boulevard, is an under-construction esplanade on the bank of the Sindangan River, initially spanning from the national highway of Barangay Goleo to the southern portion of Barangay Lawis.",
            "It is now on its completing stage of its phase 1 development and will soon serve as a recreation site for tourists and local Sindanganons.",
            "When completed, it will span at an approximate total of 8 kilometers from the northern end of the Piao Bridge in Barangay Goleo to the eastern portion of the Port of Sindangan in Barangay Calatunan, which will then be an ideal site for street festivals and sporting events like marathons and triathlons."
        ],
        [
            "Resorts"
        ],
        [
            "Sindangan River Boardwalk Esplanade"
        ],
        [
            "Sindangan Musical and Dancing Fountain"
        ],
        [
            "Arrow Hive Resort"
        ],
        [
            "Coco Groove Pension and Beach Resort"
        ],
        [
            "Lagag Mountain Resort"
        ],
        [
            "Aloha Ohana Pool Resort"
        ],
        [
            "Gangnam City Park"
        ],
        [
            "Melleno's Pension and Beach Resort"
        ],
        [
            "NSAR Beach Resort"
        ],
        [
            "Pitogo Beach"
        ],
        [
            "Sevilleno Beach Resort"
        ],
        [
            "Winschin Pool Resort"
        ],
        [
            "Commerce"
        ],
        [
            "Sindangan is known as a melting pot of businesses and investors due to its strategic and promising location.",
            "It is the second commercial hub of the province next to Dipolog."
        ],
        [
            "Among the popular brands present in the town are Jollibee, Mang Inasal, Watsons, Mercury Drug, Potato Corner,  Goldilocks, Penshoppe, and Mr.DIY."
        ],
        [
            "Quezon Avenue, the oldest and the busiest street in Sindangan"
        ],
        [
            "Healthcare"
        ],
        [
            "Sindangan is being served by the Sindangan District Hospital, a community hospital located in Barangay Poblacion."
        ],
        [
            "Education"
        ],
        [
            "Educational institutions are widely distributed in Sindangan."
        ],
        [
            "The town has two college institutions, both religious, the St. Joseph College of Sindangan Incorporated (SJCSI) and the Philippine Advent College (PAC).",
            "Both offer courses in education, liberal arts, and computer sciences.",
            "PAC consistently produces nurses passing the board."
        ],
        [
            "The town has fifty-seven (57) elementary schools, ten (10) secondary schools.",
            "Five are situated in the outlying barangays and four (4) in the urban barangays."
        ],
        [
            "A TESDA training center in Barangay Goleo offers technical courses and training to qualified students."
        ],
        [
            "In 2021, an extension campus of the Mindanao State University is formally opened in Sindangan."
        ],
        [
            "Universities"
        ],
        [
            "Mindanao State University Main Campus - Sindangan Extension"
        ],
        [
            "In 2020, an extension campus of  MSU Main was approved by the board of directors and a campus was erected in uptown Misok.",
            "Formal opening of classes for their pioneering batch commenced in 2021.",
            "Currently, the MSU-MCSE offers ten courses."
        ],
        [
            "BS Statistics"
        ],
        [
            "BS Mathematics"
        ],
        [
            "BS Fisheries"
        ],
        [
            "BS Psychology"
        ],
        [
            "BS Environmental Science"
        ],
        [
            "BS Agricultural and Biosystems Engineering"
        ],
        [
            "BS Mechanical Engineering"
        ],
        [
            "BS Civil Engineering"
        ],
        [
            "BS Electrical Engineering"
        ],
        [
            "BS Chemical Engineering"
        ],
        [
            "Colleges"
        ],
        [
            "Saint Joseph College of Sindangan, Inc. was founded on March 19, 1968, as Saint Joseph High School and eventually became the first college institution in Sindangan.",
            "The college was owned and supervised by The Roman Catholic Diocese of Dipolog until now together with its other institutions like Saint Vincent's College in Dipolog, and Saint Estanislaus Kostka College in Manukan, Zamboanga del Norte."
        ],
        [
            "List of the College Presidents in the Diocese"
        ],
        [
            "1.+Most.",
            "Rev.",
            "Felix Sanchez Zafra, D.D.",
            "-first bishop of the Diocese of Dipolog appointed by Pope Paul VI on July 31, 1967.",
            "He was transferred as Bishop of the Diocese of Tagbilaran by Pope John Paul II on October 20, 1986.",
            "By then, the seat of the bishop of the diocese was vacant for more or less 7 months."
        ],
        [
            "2.",
            "Most.",
            "Rev.",
            "Jose Ricare Manguiran, D.D.",
            "- appointed by Pope John Paul II as second bishop of the Diocese of Dipolog on May 27, 1987, until his retirement on July 25, 2014."
        ],
        [
            "3.",
            "Most.",
            "Rev.",
            "Severo Cagatan Caermare, D.D.",
            "-appointed by Pope Francis on July 25, 2014, as third bishop of the diocese."
        ],
        [
            "Philippine Advent College, Sindangan, formerly known as Hillside View College, a Christian college founded in Sindangan on 1975.",
            "It is currently the only institution in town who offers a bachelor's program for nursing."
        ],
        [
            "High schools"
        ],
        [
            "Sindangan National High School"
        ],
        [
            "Sindangan National Agricultural School"
        ],
        [
            "Saint Joseph College of Sindangan, Incorporated, High School Department"
        ],
        [
            "Philippine Advent College, High School Department"
        ],
        [
            "Siare John H. Roemer Memorial National High School"
        ],
        [
            "Bartolome Lira National High School"
        ],
        [
            "Dumalogdog National High School"
        ],
        [
            "Lapero National High School"
        ],
        [
            "Dona Natividad L. Macias Integrated School, High School Department"
        ],
        [
            "Culture"
        ],
        [
            "Saint Joseph the Worker Town Fiesta- May 1 (Labor's Day)"
        ],
        [
            "Honors the Primary Patron Saint of the town, Saint Joseph the Worker, Husband of the Virgin Mary and the foster father of Jesus Christ.",
            "He is entitled as \"El Obrero\" or \"the Worker\" because he is a modest carpenter who works hard to earn a living for the Holy Family and a role model and patron saint for all Fathers and Labor Workers.",
            "He is fit to become the town's patron saint because the people of Sindangan are known as hard-worker laborers since the pre-second world war."
        ],
        [
            "Sinulog Festival - Siari's Feast Day"
        ],
        [
            "The second parish in Sindangan in the Barangay of Siari honors their patron saint, Santo Nino de Cebu, every third Sunday of January where a grand fluvial procession at the eve of the fiesta is celebrated.",
            "On the day of the fiesta, a street dance procession is held and a Sinulog Dance Competition follows at the end of the procession."
        ],
        [
            "Pasidungog Festival"
        ],
        [
            "It is one of Sindangan's grand festivals in honor of the town's patron saint itself — Saint Joseph the Worker.",
            "The parish dedicated to the said patron is the first and oldest in Sindangan, and is also the biggest of all the parishes in the Diocese of Dipolog.",
            "Saint Joseph College's founding anniversary happens on March 19 during the Solemnity of Saint Joseph, the Husband of Mary."
        ],
        [
            "Linggo ng Sindangan"
        ],
        [
            "Binibining Sindangan, known as the biggest and the most sought beauty pageant in Zamboanga Peninsula"
        ],
        [
            "Crowning of Binibining Sindangan 2022 at the SinDome Arena"
        ],
        [
            "An annual celebration that commemorates the municipal charter day of Sindangan.",
            "The celebration usually starts on 17 December and ends on 22 December.",
            "During the course of the week-long event, competitions and shows are usually held such as trade fairs, amateur boxing, motorcross, singing competitions, firework shows, and many more.",
            "Mainly, the celebration is highlighted by a beauty pageant competition.",
            "Dubbed as the biggest beauty pageant in the entire Zamboanga Peninsula region, the annual search for the Binibining Sindangan has caused headlines and draws hundreds of applicants from throughout the country with its prestigious production and generous grand and consolation prizes.",
            "The winner of the most recent competition, which took place in December 2023, took home a brand-new car along with a cash reward of 500,000 pesos and a round trip ticked to the United States."
        ],
        [
            "Binibining Sindangan Gallery of Winners"
        ],
        [
            "Year"
        ],
        [
            "Winner"
        ],
        [
            "Image"
        ],
        [
            "Prize"
        ],
        [
            "2019"
        ],
        [
            "Sheka Torres"
        ],
        [
            "Php 150,000"
        ],
        [
            "2020"
        ],
        [
            "No pageant held due to the COVID-19 pandemic"
        ],
        [
            "2021"
        ],
        [
            "No pageant held due to the COVID-19 pandemic"
        ],
        [
            "2022"
        ],
        [
            "We’am Ahmed"
        ],
        [
            "Php 500,000 + Toyota Corolla Altis"
        ],
        [
            "2023"
        ],
        [
            "Reina Kobayashi"
        ],
        [
            "Php 500,000 + Toyota Corolla Altis + Round trip ticket to the United States"
        ],
        [
            "Media"
        ],
        [
            "Radio stations"
        ],
        [
            "102.5 Like Radio Sindangan: Owned and operated by Capitol Broadcasting Center."
        ],
        [
            "95.3 Prime FM (DXST): Owned and operated by Prime Broadcasting Network."
        ],
        [
            "Cable and Satellite TV providers"
        ],
        [
            "Prime Cable Network"
        ],
        [
            "Amatec Cable TV"
        ],
        [
            "Cignal Digital TV"
        ],
        [
            "G Sat"
        ],
        [
            "Sky Direct (previously, prior to lapse of Congressional Franchise of ABS-CBN)"
        ],
        [
            "Notable people"
        ],
        [
            "Junrey Balawing, former Filipino record holder for the world's shortest man alive"
        ],
        [
            "General Alexander B. Yano, 38th Chief of Staff of the Armed Forces of the Philippines"
        ],
        [
            "Feliz Clareianne Thea Recentes, Miss Philippines Air 2024"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sindangan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"About Sindangan – Search Sindangan\".",
            "Retrieved 2022-07-14."
        ],
        [
            "^ \"Executive Order No.",
            "77, s. 1936 | GOVPH\".",
            "Official Gazette of the Republic of the Philippines."
        ],
        [
            "^ \"R.A. No.",
            "1313, An Act Converting into Barrios Certain Sitios in the Province of Zamboanga Del Norte\".",
            "LawPH.com.",
            "Archived from the original on 2012-07-14.",
            "Retrieved 2011-04-11."
        ],
        [
            "^ \"R.A. No.",
            "2110, An Act Creating the Barrio of Gonayen in the Municipality of Sindangan, Province of Zamboanga Del Norte\".",
            "LawPH.com.",
            "Retrieved 2011-04-13."
        ],
        [
            "^ \"Executive Order No.",
            "79, s. 1947\".",
            "Official Gazette (Philippines).",
            "Government of the Philippines.",
            "August 12, 1947.",
            "Retrieved March 19, 2023."
        ],
        [
            "^ \"Executive Order No.",
            "469, s. 1951\".",
            "Official Gazette (Philippines).",
            "Government of the Philippines.",
            "August 22, 1951.",
            "Retrieved March 19, 2023."
        ],
        [
            "^ \"Republic Act No.",
            "4989\".",
            "The Lawphil Project.",
            "Arellano Law Foundation.",
            "June 17, 1967.",
            "Retrieved March 8, 2024."
        ],
        [
            "^ \"Batas Pambansa Blg.",
            "204\".",
            "Supreme Court E-Library.",
            "Supreme Court of the Philippines.",
            "March 25, 1982.",
            "Retrieved March 6, 2024."
        ],
        [
            "\"Republic Act No.",
            "6830\".",
            "Supreme Court E-Library.",
            "Supreme Court of the Philippines.",
            "December 30, 1989.",
            "Retrieved March 6, 2024."
        ],
        [
            "^ \"Hell Ship Memorial- Shinyo Maru Sinking\".",
            "US War Memorials Overseas, Inc. Retrieved 8 May 2023."
        ],
        [
            "^"
        ],
        [
            "\"Sindangan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 30 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IX (Zamboanga Peninsula)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IX (Zamboanga Peninsula)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Zamboanga del Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Municipality of Sindangan | Profile\".",
            "Archived from the original on 2017-07-02.",
            "Retrieved 2017-02-18."
        ],
        [
            "^ Everett Rosenfeld (June 14, 2011).",
            "\"New 'World's Shortest Man' Celebrates Birthday, World Record\".",
            "Time.com.",
            "Retrieved 14 August 2014."
        ],
        [
            "^ \"Gen. Yano to keynote ABCollege's 70th Foundation Day celebration\".",
            "Andres Bonifacio College."
        ],
        [
            "External links"
        ],
        [
            "Sindangan Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Sindanganon website"
        ],
        [
            "Places adjacent to Sindangan"
        ],
        [
            "Sulu Sea"
        ],
        [
            "Jose Dalman"
        ],
        [
            "Sindangan Bay"
        ],
        [
            "Sindangan"
        ],
        [
            "Siayan"
        ],
        [
            "Leon B. Postigo"
        ],
        [
            "vte Province of Zamboanga del NorteDipolog (capital and largest city)Municipalities"
        ],
        [
            "Baliguian"
        ],
        [
            "Godod"
        ],
        [
            "Gutalac"
        ],
        [
            "Jose Dalman"
        ],
        [
            "Kalawit"
        ],
        [
            "Katipunan"
        ],
        [
            "La Libertad"
        ],
        [
            "Labason"
        ],
        [
            "Leon B. Postigo"
        ],
        [
            "Liloy"
        ],
        [
            "Manukan"
        ],
        [
            "Mutia"
        ],
        [
            "Piñan"
        ],
        [
            "Polanco"
        ],
        [
            "Roxas"
        ],
        [
            "Rizal"
        ],
        [
            "Salug"
        ],
        [
            "Sergio Osmeña Sr."
        ],
        [
            "Siayan"
        ],
        [
            "Sibuco"
        ],
        [
            "Sibutad"
        ],
        [
            "Sindangan"
        ],
        [
            "Siocon"
        ],
        [
            "Sirawai"
        ],
        [
            "Tampilisan"
        ],
        [
            "Component cities"
        ],
        [
            "Dapitan"
        ],
        [
            "Dipolog"
        ],
        [
            "Islands"
        ],
        [
            "Aliguay"
        ],
        [
            "Bayangan"
        ],
        [
            "Murcielagos Island"
        ],
        [
            "Piñahon"
        ],
        [
            "Selinog"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sindangan&oldid=1234490543\""
        ],
        [
            "Categories: Municipalities of Zamboanga del NortePolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textArticles containing explicitly cited English-language textPages using the Kartographer extension"
        ]
    ]
}