{
    "name": "Sogod",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sogod, Southern Leyte"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSimple EnglishSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°23′N 124°59′E﻿ / ﻿10.38°N 124.98°E﻿ / 10.38; 124.98"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Southern Leyte, Philippines"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesSogodMunicipalityMunicipality of SogodSkyline from the shore"
        ],
        [
            "FlagSealMap of Southern Leyte with Sogod highlightedOpenStreetMapSogodLocation within the PhilippinesCoordinates: 10°23′N 124°59′E﻿ / ﻿10.38°N 124.98°E﻿ / 10.38; 124.98CountryPhilippinesRegionEastern VisayasProvinceSouthern LeyteDistrict"
        ],
        [
            "2nd districtFoundedSeptember 6, 1571 (as a District the Leyte encomienda); 1603 (as a Catholic mission station)EstablishedMay 18, 1700 (as a barangay)IncorporatedJune 10, 1853 (as a municipality)Barangays45"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorSheffered Lino S. Tan (Aksyon) • Vice MayorJose Ramil G. Golo (Aksyon) • RepresentativeChristopherson M. Yap • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Marilyn L. VillaAlberto M. Casil Sr.Rolando A. Terante Sr.Rufo C. OloEliseo D. FaelnarPatrick V. FelianoRogelyn P. YuAlna S. Dejarme"
        ],
        [
            " • Electorate32,748 voters (2022)Area • Revenue₱ 202 million (2020) • Assets₱ 442.8 million (2020) • Expenditure₱ 193.5 million (2020) • Liabilities₱ 178.6 million (2020)Service provider • ElectricitySouthern Leyte Electric Cooperative (SOLECO)Time zoneUTC+8 (PST)ZIP code6606PSGC0806417000IDD : area code +63 (0)53Native languagesBoholano dialect Cebuano Tagalog"
        ],
        [
            "Sogod (IPA:Tagalog pronunciation:"
        ],
        [
            "The name of the municipality originated from the Cebuano word, sogod, meaning \"to start.\"",
            "Founded as a Catholic mission station by the Society of Jesus in 1601, Sogod became a regular municipality on June 10, 1853."
        ],
        [
            "Sogod is located along the Southern Leyte section of the Pan-Philippine Highway, 126 kilometers (78 miles) south of Tacloban City, the regional center of Eastern Visayas.",
            "Rugged mountains enveloped most of the town's northern terrain with numerous river systems crept throughout the southern lowlands.",
            "Known as the center of trade, commerce and industry in the south-central region of Leyte, Sogod is also home to Southern Leyte State University (SLSU) Main Campus and Saint Thomas Aquinas College (STAC)."
        ],
        [
            "History"
        ],
        [
            "The dearth of resource materials brought difficulty in providing a complete historical account of Sogod from the pre-Hispanic era up to today.",
            "Most of the references identified in the account were chronicles written by Spanish missionaries – the Jesuits, the Augustinians, and the Seculars (the Franciscans were assigned to parishes of northeastern Leyte and Samar) – who administered the town.",
            "At the forefront of colonization, the islands of Leyte and Samar were neglected by the Spanish colonial government which brought short-term revolts and insurrections to the region.",
            "In addition, it is worthy to attribute the Catholic Church's influence in the islands which further improved the shaping of cultural, political, economic and spiritual dimension of the people of Sogod."
        ],
        [
            "Pre-Hispanic period"
        ],
        [
            "Early annals account that Sogod was first located near the mouth of the Subangdaku River.",
            "It was then a satellite territory under the domain of Seilani, which comprises the areas from Bontoc and Sogod to the island of Panaon.",
            "Around 1544, due to unfavorable winds, a Spanish expedition headed by Ruy López de Villalobos arrived at the eastern town of Abuyog, Leyte where an aged inhabitant informed Garcia de Escalante Alvarado, the chronicler of the expedition, on the presence of trading posts found in the archipelago:\"I asked him"
        ],
        [
            "The early years of Jesuit evangelization"
        ],
        [
            "The missionaries of the Order of Saint Augustine (OSA) were the first to Christianize Leyte in 1580.",
            "But because they were lacking in number, the mission was given to the care of the priests of the Society of Jesus (SJ) in 1595.",
            "The Vice-Provincial of the Jesuit mission in the Philippines, Padre Antonio Sedeño, chose four priests, Pedro Chirino, Antonio Pereira, Juan del Campo, and Cosme de Flores, and one lay brother, Gaspar Garay to reopen the mission of Leyte.",
            "Of the five, Padre Chirino was the superior of the expedition.",
            "The missionaries arrived in the town of Carigara on the morning of July 16, 1595, the feast of the Exaltation of the Holy Cross, from Zebu.",
            "They introduced themselves to the encomendero of Carigara, Cristobal de Trujillo, and presided an assembly for the construction of the mission residence there.",
            "While the rest of the Jesuits studied Visayan and catechize the natives to the Faith, Padre Chirino and Padre Pereira crossed the central Leyte valley towards the eastern Pacific coast and founded the town of Dulac.",
            "Within a span of two years, the Sons of Saint Ignatius of Loyola founded five permanent mission stations: Carigara (July 1595), Dulag (September 1595), Palo (October 1596), Alangalang (May or June 1595) and Ogmoc (1597)."
        ],
        [
            "Following the successful establishment of settlements in northern Leyte, the Jesuits began to move southwards around the early 1600s.",
            "One of these pastors was Padre Fabrizio Sersali, an Italian Jesuit from Naples and former superior of Carigara and Ormoc.",
            "After founding the mission of Cabalian, he and Padre Cristobal Jimenez, then parish priest of Palo in 1595, planned to established mission stations in the settlements of Limasawa, Sogod"
        ],
        [
            "After Bancao accepted Padre Sersali in Sogod, the Jesuit began catechizing the villagers to Catholic Christianity.",
            "In one of his classes, he noticed that two of Bancao's grandchildren were gravely ill.",
            "He immediately requested to the datu that the Last sacrament be administered to them.",
            "Seeing the sincerity of the missionaries, Bancao consented and the Jesuits performed the rite to the children.",
            "The next morning, Bancao was very pleased to find out that his children were free from their sickness.",
            "In gratitude, the family members of the datu were baptized.",
            "Afterwards, an improvised chapel of nipa, bamboo and cogon, located near the shore, was constructed in 1603.",
            "Bancao and the leaders of the village wanted the missionaries to stay and live with them, but because of missionary work, the priests refused their offer and proceeded to Cabalian.",
            "This significant event laid the foundation of Christendom in the town."
        ],
        [
            "\"Sogod, Sogod!\""
        ],
        [
            "The dark years of Leyte started at the middle of the 15th and 18th centuries when the Mindanao Muslims plundered the south-western and northern shores of the island.",
            "Most of the victims were sold as slaves in the markets of Sulu and some were held as hostages.",
            "As a result, these marauders were able to extract money from the Spanish civil officials and the Leyte Jesuits for their release."
        ],
        [
            "Accordingly, it was around this period that Sogod begot its name.",
            "was built to warn villagers against the approach of the raiders.",
            "There were no Jesuits stationed in southern Leyte at this time and that all commands came from the datu.",
            "In such crisis, Bancao, who was, and until now, revered as Mangkaw, emerged among the populace.",
            "The son of a certain Mangaris, his presence in Sogod was explained by some Portuguese chroniclers.",
            "Around 1563, some Portuguese from Moluccas raided and depopulated Limasawa, with a fleet of eight (8) praus.",
            "Eventually, Bancao and a number of his household managed to escape to Sogod, while his brother fled to Butuan for refuge."
        ],
        [
            "Notorious for his defense against the pirates, Bancao was a known net-fisherman.",
            "Already a fishing ground that it is today, Sogod then had houses clustered close to shore around the watchtower.",
            "Being an expert in the art of casting the net, Laya, he could send out the casting net in a perfect circle in the sea.",
            "As the community grew bigger, the residents agitated for a name for their place.",
            "Meetings after meetings were held presided by Mangkaw.",
            "But every time a meeting is ongoing, a shoal of fish would form a quick shifting shadow beneath the surface.",
            "The eyes of the pondering datu kept stalking it, interfering with the discussion.",
            "Satisfying his unequalled fisherman's instinct, he would leave the session unattended.",
            "The body language of the datu, which portrays an artful slide of the feet, the legs and the hips, while getting a perfect hold of the fishes through his laya would amaze the attendees from the shore.",
            "As a father to the community, he shared his catch with the people for the asking, even by strangers.",
            "After which, shouts of \"Sogod, sogod!\"",
            "(vernacular for \"to begin\") would reconvene the meeting.",
            "Thus the word \"Sogod\" became the name of the town."
        ],
        [
            "Although the name Sogod already existed before the 1600s, the Bancao account remains to be the accepted etymological origin of the name of the town.",
            "However, it might be deduced that the first name, which is pronounced as (sú.gut.)",
            "fits the Escalante description of Sogod being a bustling commercial town of the pre-Hispanic era.",
            "The major means of initiating trade during those days were done by barter, that is \"to comply,\" or \"to consent\" with the suggested value offered by the merchant to the townsfolk of Sogod.",
            "Thus, whenever the buyer and the seller came into agreement on the bartered item, the expression was affirmed in Cebuano, \"ming-súgut.\""
        ],
        [
            "The term Tugud, on the other hand, seems like a concealed version of the former.",
            "The Spaniards, as accounted by many town histories in Leyte , have difficulty reading and pronouncing Visayan."
        ],
        [
            "Moro attacks"
        ],
        [
            "Before the Jesuits could speed up the missionary endeavor, the Portuguese came into Leyte through Mindanao, plundering major settlements known to be in alliance with the Spaniards.",
            "The Portuguese already sacked vital trading towns in Mindanao, arousing hostility among the Moros against the Europeans and the newly baptized Visayan Christians.",
            "As a result, a fleet of seventy caracoas , under the command of Datu Buwisan, raided Palo, Dulag and the towns of north-eastern Leyte in August 1603.",
            "The pirates held the Jesuit, Padre Sebastian Hurtado, as captive.",
            "Fortunately, a storm prevented the onslaught from sacking Sogod and Cabalian."
        ],
        [
            "In the nearby island of Bohol, a babaylan  This revolt would spread to Leyte and influenced Bancao, who welcomed Legazpi to the Philippines in 1565, baptized at the same time and settled in the town of Carigara.",
            "Bancao had been having trouble with Muslim onslaughts in his territory, in particular, in Limasawa.",
            "He had witnessed the massacre and bloodshed brought about by the raids of the Moros on his land and kinsmen."
        ],
        [
            "When the Moros gave out a condition that they would stop the plundering if the Christian natives would abandon the Church, Bancao grasped what it meant and returned to his old pagan religion.",
            "The datu then consigned to halt the conversion process undergone by the Jesuits to the Leyteños.",
            "With Pagali, his high priest, Bancao solicited the assistance of other chieftains of the neighboring settlements of Baibai, Panaon, and Sogod and easily won his way across the island to the very capital in the north which was Carigara."
        ],
        [
            "The rebels, as they were divided all over the settlements that revolted, were not equal, however, to the force of fifty (50) Spaniards and one thousand (1,000) Cebuanos that Don Juan de Alcarazo, the alcalde mayor  The head of Bancao, as ordered by the Spaniards, was publicly exposed on a pike in the town plaza of Carigara."
        ],
        [
            "Afterwards, in 1632, Padre Ventura Barcena, a Jesuit administering the towns of Sogod, Cabalian and Hinundayan, was captured in Sogod and died in captivity in Tawi-tawi."
        ],
        [
            "The Kampanang Bulaw and the latter years of Jesuit evangelization"
        ],
        [
            "The old ruins of the Baluarte used to safeguard the village of then Sugut from Moro pirates during the 1700s."
        ],
        [
            "Around 1643, the Jesuits Padre Juan del Carpio, and Padre Juan Bautista Laviarri placed Cabalian as the center of the southeastern Leyte mission.",
            "Of the three settlements, Sogod was the farthest.",
            "and Bitanjuan [a mountain in Libagon town).",
            "When the residencia of Carigara increased into ten villages, Sogod had already its own resident pastor, Padre Antonio de Abarca.",
            "However, in 1645, the Jesuits formally grouped the settlements of Cabalian, Hinundayan and Sogod into an ecclesiastical district."
        ],
        [
            "The Muslims of Jolo sacked the islands of Camotes, Leyte and Samar, in particular the settlements of Poro, Baibai, Sogod, Cabalian, Basey, Bangajon"
        ],
        [
            "On May 18, 1700, the colonial government of the Philippines established Sogod as a regular visita"
        ],
        [
            "The structure of the Jesuit church was rectangular in shape and faced towards the west.",
            "Two entrances were located at the sides.",
            "It measured seventeen (17) yards in length and ten (10) yards.",
            "The floor of the altar is a little bit raised, and it had a pulpit and a baptismal font.",
            "The thickness of its walls measures two feet.",
            "At the side near the main entrance a Christian can see stones which are rectangular in shape."
        ],
        [
            "Aside from the church, a watchtower was constructed about twenty-five (25) yards away from the edge of Sogod Bay and around fifty (50) yards from the river of Subangdaku.",
            "The thickness of the stonewalls made of hardened limestone deposits measured four (4) to five (5) feet in thickness while the height measured twenty (20) to twenty-five (25) feet.",
            "There are four (4) entrances to the tower equidistant to each other.",
            "Unfortunately, the church and watchtower were razed to the ground when a battalion of Moros stormed the visita in March and July 1754."
        ],
        [
            "Local grapevine states that the church and watchtower boasts of a bell made out of pure gold, the Kampanang Bulaw.",
            "Moments before the siege, the watcher already signaled the villagers of the impending attack by pealing the bell.",
            "In a hurried state, with no resident pastor present, the villagers took the artifact and buried it in the rice fields opposite the present Subangdaku River.",
            "However, there are possible accounts that the kampana was tossed to a nearby quicksand, in what is now the bus station in barangay Zone III, the old site of Sogod poblacion.",
            "Until now, the bell has never been recovered."
        ],
        [
            "With the founding of the town and residencia of Jilongos in 1737, the Leyte mission was already divided into three residencies.",
            "The other two were Carigara and Dagami.",
            "Jilongos had then the settlements of Palompon, Poro, Ormoc, Baybay, Maasin, Cabalian, Hinundayan and Sogod as its annex visitas."
        ],
        [
            "At the time of their dismissal, the Society of Jesus had founded many settlements patterned after Spanish colonies in the Americas.",
            "In every settlement, an organized road system exists, which further divides it into different subdivisions or districts.",
            "The main center of these towns was the plaza, with the parish church and rectory, the casa real  Upon the return of Augustinians, the entire island province of Leyte had already exceeded to 11,000 tributos divided among seventeen (17) settlements."
        ],
        [
            "The Augustinian years"
        ],
        [
            "On their first years of evangelizing, the Calced Augustinians encountered severe problems and evaluated some methods that the Jesuits initiated.",
            "At first, there were only three (3) priests administering the eastern and southern sections of the island province and were not well-received in most towns.",
            "More Leyteños were inclined to live in the hinterlands where the farming and fishing was better than in the settlements.",
            "And lastly, the Babaylanes spread rumors that the friars were \"royal agents who procured babies to fatten tigers of the King of Spain.\""
        ],
        [
            "Because of their dislike of the missionary work of the Jesuits in Leyte, the Augustinians transferred the poblacion of each municipality in Leyte to the visitas.",
            "Some barrios were separated from the town centers and were made independent municipalities.",
            "Examples of which were the relocation of the town centers of Carigara to Barugo, Dagami to Burauen, and Sogod and Liloan to Cabalian.",
            "The construction of roads and stone churches and the cultivation of farmlands were prioritized by the friars as means of improving the economic lifestyle of Leyte.",
            "They also appealed to the Spanish monarch for the building of fortresses and supplying ammunition to the civil guards stationed in the settlements, which was granted by the king.",
            "However, owing to the 1754 raid, Sogod was not included on the census conducted by Padre Agustin Maria de Castro, which reports the condition of churches and fortifications in the towns administered by the Augustinians."
        ],
        [
            "The order was also responsible for catechizing the Leyteños to the Christian faith through the building of schools."
        ],
        [
            "The Dagohoy revolt prompted more Boholanos to settle the southern towns of Leyte, in particular in Hilongos, Bato, Matalom, Maasin, Macrohon, Malitbog and Hinunangan.",
            "Sometime in 1771, seventeen (17) families from the different towns of Bohol migrated in the southeastern coast of Sogod.",
            "Led by Marciano Escaño, Agun Espedilla, Fernando Escueta, Mariano Evailar, Lazaro Idhaw (now spelled as Idjao), Jose Endriga, Soldiano Arot, Fausto and Agustin Enclona (some families changed their spelling Encluna), Rosendo Evalin, Mauro Escamilla, Laurente Edillo, Domingo Espinosa, Francisco Felipe and Tiburcio Egina, they founded the visita of Libagon.",
            "The first appointed cabeza de barangay of Libagon was Domingo Mateo Espina, which was the son of Agustin Mateo Espina and Francisca Barbara and the grandson of Pedro Espina of Duero, Bohol."
        ],
        [
            "By 1778, there were only seven (7) priests distributed among the eighteen (18) parishes of Leyte.",
            "The island province had a number of 34,054 Catholics.",
            "Of the Catholic population, there were 1,702 souls exempted from tributos and 12,867 souls subject for tributos."
        ],
        [
            "Around 1843, the missionary priests of the Order of Friars Minor Capuchin (OFM), or he Franciscans, replaced the Calced Augustinians, in accordance to a Royal Decree issued on October 29, 1837.",
            "They occupied sixteen (16) parishes in the eastern part of Leyte: Abuyog, Alangalang, Babatngon, Barugo, Burauen, Carigara, Dagami, Dulag, Hinunangan, Hinundayan, Jaro, Leyte, Malibago , Palo, San Miguel, Tacloban, Tanauan, and Tolosa.",
            "With the arrival of the Franciscans and the ceasing of Moro raids, the provincial population increased, more infrastructures were developed and agricultural output in the pueblos was maximized.",
            "Education was also prioritized, as what the Augustinians started, and more schools were built along the villages.",
            "Churches were also remodeled and refurbished.",
            "Muslim attacks had practically ceased and the existence of major trade centers spurred the progress among these towns.",
            "Large barrios were becoming independent from the poblacion, and separated as pueblos."
        ],
        [
            "The establishment of a pueblo and a parroquia"
        ],
        [
            "While the Franciscans evangelized the northern towns, the diocesan priests from Cebu took the Cebuano-speaking areas of the province as their parochial assignments  – Albuera, Baybay, Cabalian, Hilongos, Maasin, Macrohon, Malitbog, Ormoc, Palompon, Quiot, Sogod and Villaba – in the middle of the 19th century.",
            "Although Sogod was founded years before Malitbog was made a municipality on December 14, 1849, the latter enjoyed the civil privileges being conferred from Manila.",
            "The visitas of Buntuk, Cabalian, Himay-angan"
        ],
        [
            "A move to create Sogod an independent pueblo was pushed by the tenientes del barrio"
        ],
        [
            "The resolution was received by Don Jose Torres Busquet, the Alcalde Mayor"
        ],
        [
            "Don Antonio Prima succeeded Cavales as gobernadorcillo of Sogod during the 1855 elections.",
            "Under his administration were Eulogio Cavales as teniente 1, German Catajoy as juez de sementeros, Vicente Canillo as juez de policia y ganados, Martin Cajoles as teniente 2, and Francisco Catajoy and Domingo Calago as police officers.",
            "Prima and the rest of the council served the municipality until 1857."
        ],
        [
            "By 1857, Don Eulogio Cavales assumed the position as gobernadorcillo.",
            "During his time, the visita of Hipgasan"
        ],
        [
            "Sogod remained an annex of the parish of Malitbog until May 14, 1866 when Spain approved the parochial position of the town.",
            "However, the order was again delayed for almost three years.",
            "It was on April 8, 1869, through a Diocesan decree, that the parish of Sogod was acknowledged by the Most Reverend Romualdo Ximeno Ballesteros, OSA, bishop of Cebu.",
            "During this period, the parish of Sogod comprises all the territories north of Malitbog excluding the visitas of Banday and San Isidro.",
            "The new parochial district was placed under the intercession of the La Purisima Concepcion de Maria with Padre Don Tomas Logroño, a native of Inabanga, Bohol, as the town’s first parish priest.",
            "One of the first Diocesan priests assigned in Leyte, he spearheaded the construction of a temporary chapel and rectory atop the ruins of the old Jesuit church.",
            "In the 1868 survey of the diocese of Cebu, the records of Sogod were still merged with Malitbog, numbering a total population of 12,262 Catholics, 417 Catholics exempted from taxation and 2,026 tributos."
        ],
        [
            "By March 1870, Don Gabriel Ydjao became the chief executive of Sogod and transferred the poblacion  The parish church of Sogod would remain in Libagon until January 1924, when a group of concerned Sogodnons plead to the diocese of Calbayog to return the seat of the parish in Sogod.",
            "A canonical approval was issued by the Most Reverend Sofronio Hacbang Gaborni, the diocesan bishop of Calbayog."
        ],
        [
            "After Ydjao, Don Patricio Tubia, the former teniente del barrio of Buntuk, became the new gobernadorcillo in the 1876 elections.",
            "He served the town until 1878.",
            "By 1883, the sitio of Consolacion was created as a visita of Sogod Nuevo"
        ],
        [
            "Don Nicolas Idjao won the position of gobernadorcillo in the 1885 elections with Gabino Ellacer as teniente 2, Antonio Reyes as juez de sementeros, Rufino Espina as juez de policia, Ramon Espina as juez de ganados, Vicente Pajuyo as teniente 2 and Catalino Encinas as juez.",
            "The alguacils  By 1887, Don Eleuterio Falenar, who once served as the teniente del barrio of Sogod Viejo, assumed as gobernadorcillo.In this clipped 1899 map of Leyte surveyed by the Observatorio de Manila and later published by the United States Coast and Geodetic Survey, the town is located east of the Subangdaku river in what is now barangay Consolacion.",
            "These labels in geographic features are still in used as names of the present villages, rivers and mountains in the towns of Sogod, Bontoc and Libagon."
        ],
        [
            "Brief information of the visitas under the parish of Sogod was accounted in the 1886 diocesan summary of Padre Felipe Redondo Sendino.",
            "Of the six (6) barrios, three are considered visitas.",
            "The chapels in these villages has attached interim rectories constructed out of light materials:"
        ],
        [
            "Consolacion, 2 ½ leguas ;"
        ],
        [
            "Buntuk, 3 ½ leguas ; and,"
        ],
        [
            "Hipgasan, 2 ½ leguas"
        ],
        [
            "The census also accounted the geographical location of the town, stating the relocation of the town center to Libagon from the original site in barangay Zone III:\"The town of Sogod is located on the shore of the great inlet of Malitbog to the south of the island of Leyte, in the western coast of the said inlet and adjoins Cabalian on the east with the island of Panaon further south, some three hours away.",
            "The town of Malitbog in the south-west is two-to-three-hour crossing through the said inlet… The old"
        ],
        [
            "The church was later destroyed after the Japanese Imperial Army burned it during World War II.",
            "By the 1950s, the structure was rebuilt in modern architecture, slightly smaller than the original.",
            "The parishioners tried to reposition the original columns of the church.",
            "The structure was so firm that the workers had to severe the posts from the surface.",
            "Presently, much of the church interiors and facade are completely remodeled from the original construction."
        ],
        [
            "A narrative shows the 1886 construction of the church of Libagon: Saturday, the volunteers, or the loggers, would trek the mountains, scouting for timber which will be used for the church pillars, walls...",
            "The rainforest mountains of Libagon were then abundant with Narra (pterocarpus), Molave  (vitex parviflora), White Lauan (shorea contorta) trees... After which, the volunteers would fasten every end of the logs with ropes and drag them down to the town center.",
            "In like manner, another group of volunteers were in charge of guiding the frequency and synchronicity of all those volunteers hauling timber and howled, “Hiboy!...\"",
            "Each of them brought with them their own food and coconut wine known as tuba stored in a baler shell or bamboo container... Aside from timber, the church’s foundation were made of crushed rocks, stones and sand that were hauled and made into huge bricks framed as walls.",
            "The stone walls stood nearly at five (5) to six (6) feet tall and laid on top with lumber that continued up to the ceiling.",
            "The groundwork for every column was deep and durable.",
            "As cement, the workers used stones and sand daubed with whipped egg whites mixed with lime to reinforce the pillars.",
            "The floor tiles were imported from Barcelona, Spain.",
            "The belfry stood high with three large church bells.",
            "Each piece, when rang, upended and plunged causing a loud sound that can be heard as far as San Isidro, Banday, and the entire Sogod Bay.\""
        ],
        [
            "From 1889 to 1891, Don Cipriano Lebiste (now spelled as Leviste) became the gobernadorcillo of Sogod.",
            "The members of the municipal council under Lebiste's administration were Eugenio Destrisa (some families spelled it as Destreza or Destriza), Felix Entino, Magdaleno Dagaas, Catalina Idjao, Pedro Bellesa, Patricio Tubia, Victoriano Godes, Lucio Dagas and Agustin Ballina."
        ],
        [
            "When Don Luis Espina became gobernadorcillo from 1891 to 1893, the municipal council was composed of Buenaventura Gimenes (now spelled as Jimenez), Bernardo Endriga and Damaso Amongan as subalterno tenientes and Anastacio Ylan, Calexto Montanes, Protacio Elejorde and Carlos Ymluna (some families spelled it as Encluna or Enclona) as police officers.",
            "During Espina’s incumbency, the visita of Maak was reduced to a sitio of barrio Consolacion with Antonio Cañete as the teniente 1, Gregorio Debera (now spelled as De Vera or De Veyra) as teniente 2, Rosales Bonot and Leoncio Cocido as juezes; and Eugenio Demosmog and Pantaleon Dejarme as police officers.",
            "With Maak’s status being demoted, Sogod Viejo was also placed under the jurisdiction of the visita of Hipgasan with Crispulo Cabales as teniente 1, Domingo Bellesa as teniente 2, Mauro Catajoy as juez 1, Tranquilino Dagohoy as juez 2, and Victoriano Camba and Juan Javier as police officers.",
            "In Buntuk, Felipe Aguilar and Felix Entino assumed the position of tenientes 1 and 2 while Graciano Samaño and Antonio Arguelles were designated as juezes and Leoncio Resma as police officer."
        ],
        [
            "By 1893, Sogod was again headed by Don Nicolas Idjao with Crisante Pajuyo, Dimas Yndico (now spelled as Endico), Macario Ylang and Mauricio Sembrano as tenientes, Patricio Tubia as juez de sementeras, Luis Espina became the juez de ganados, Buenaventura Gimenez as juez de policia, and Felipe Paitan, Pedro Ralo, Enrique Tiguetigue and Fruto Egina as police officers."
        ],
        [
            "The American era"
        ],
        [
            "The latter years of Hispanic colonization of Sogod witnessed three (3) nationwide armed struggles: the Philippine revolution (1896–1898), the Spanish–American War (1898) and the Philippine–American War (1899–1902).",
            "The Katipunan movement, which Andres Bonifacio founded, had encouraged Filipino commoners from Luzon, Visayas and northern Mindanao to raise arms for independence.",
            "There were anti-Spanish skirmishes in Manila, Cebu, Negros, Ilocos, Batangas and Pampanga after Doctor Jose Rizal's execution on December 30, 1896."
        ],
        [
            "Social unrest in Leyte was not relatively ferment as in Manila and other provinces in the country.",
            "The situation in the island province was that it was generally peaceful and most of the dominating local officials were reluctant to join the revolution.",
            "The Katipunan had only secure autonomy to Leyte when Catalino Tarcela resigned as gobernadorcillo of Tacloban and replaced Gabriel Galza, a peninsulares"
        ],
        [
            "The next year, General Ambrocio Mojica replaced General Vicente Lukban as the designated expeditionary chief and governor of Leyte and reestablished the government system in the municipalities.",
            "The general also organized guerilla warfare against the Americans and transferred the provincial capital to Palo.",
            "The town of Sogod, with Libagon as the functioning town center, was under the fourth military zone which comprises the towns from Maasin to Hinunangan with Lieutenant Mariano Pacheco as the commander of the entire district.",
            "A known strategist and pacifier, he was successful in defending Maasin through a naval combat and attacking an American detachment in Malitbog in 1900, which earned him the rank as captain.",
            "These accomplishments brought the respect from the revolutionary leaders of Maasin, Malitbog, Sogod-Libagon, Liloan-Panaon, Cabalian and Hinundayan.",
            "All guerilla activities in Sogod were headed by Ladislao Decenteceo and the members of the Idjao clan."
        ],
        [
            "With the surrender of Mojica and the capture of Lukban, the revolutionary commanders of Leyte finally sided with the Americans in the middle of 1902.",
            "The new government delegated Don Benito Faelnar as presidente municipal after the mayoral position of Sogod was vacant from 1897 to 1903.",
            "During his administration, Faelnar reinstated the poblacion to Sogod.",
            "By this year, Sogod had a total population of 4,055 inhabitants, 1,011 of whom were registered voters while Libagon had 4,642 inhabitants with an electorate of 1,073 voters."
        ],
        [
            "Protestantism came to Leyte in 1903 when Reverend Doctor Charles Rath and a group of American missionaries belonging to the Presbyterian Church acquired a church lot in Tacloban.",
            "They began a massive campaign in the island, having a stronghold over the towns of Baybay, Maasin, Padre Burgos, Cabalian and Hinunangan.",
            "By the mid-1930s, Reverend Rath and a number of newly-baptized Leyteño Presbyterians made a number of converts from Buntuk, Sogod, Consolacion and from the sitios  of Libagon.",
            "These believers would lay the very foundation of the present-day United Church of Christ in the Philippines (UCCP), the first Protestant church to be established in the municipality, and would attract more Protestant sects and denominations to the towns of Sogod bay region."
        ],
        [
            "Don Ladislao Decenteceo, who has already pledged his allegiance to the Insular Government of the Philippine Islands, won against the reelection bid of Faelnar during the 1904 elections and transferred again the town center to barrio Consolacion, his residence.",
            "The voting process was done by whispering the name of a candidate of the voter's choice to the municipal secretary.",
            "While Don Dionisio Labata became the first municipal mayor who won the first election thru balloting in 1905."
        ],
        [
            "During the mayoral administration of Don Gregorio Leviste (1908–1912), the municipal territory of Sogod comprises the barrios of Bontoc, Buac, Concepcion, Consolacion, Gakat, Hipgasan, Libagon, Libas, Maak, Mayuga, Kawayan, Nahulid, Pandan, San Isidro (Malupao), San Miguel (Batang), Sogod poblacion, Santa Cruz and Union, which were grouped into seven (7) districts.",
            "Each district, with its respective barrios were under the care of a municipal councilor.",
            "Education was the main concern of this period and that the municipal government sent Sotero Toting, Ignacio Chavarria and a person named Sumaya to Tacloban to urge teachers from the capital to teach in Sogod.",
            "The first teacher to arrive in Sogod was Pelagia Tibay, who arrived in town on April 1911.",
            "On May of the same year, Hugo Rojas and Jesus Pedrosa were the first batch of municipal scholars attending the Leyte Normal School in Tacloban.",
            "As the number of school children increases, the town officials saw that the only Gabaldon building of the Sogod Central School, located in the present barangay of Zone I, was too small to house them.",
            "The municipal council therefore resolved it by voting to make the municipal hall as transient school building for the students."
        ],
        [
            "The tenure of Leviste also marked the titling of the barangays of Sogod, which occurred on July 1911.",
            "In a joint session held at Sogod on September 20, 1911, the boundary between the towns of Sogod and Liloan was fixed by both municipal councils.",
            "A boundary marker was fixed at Malaa River and a resolution was signed by the councilors of the two towns.",
            "Transportation during this period was through boat since there were no existing road networks in southern Leyte.",
            "Vessels like the MV Bongao, MV Malitbog and MV Mindoro would ferry passengers from Tacloban to Sogod."
        ],
        [
            "With the restoration of the poblacion to Sogod in 1912, the barrio of Libagon was converted into a municipality on October 16, 1913.",
            "The areas from barangay Gakat to barangay Punta formed part of the municipal district of Libagon.",
            "The municipal mayor of Sogod during this development was Don Vicente Cariño (1912–1916).",
            "Mariano Espina, who was then a member of the municipal council of Sogod and the main mover of the resolution to make Libagon into a separate township, as appointed as first town executive of Libagon."
        ],
        [
            "During the Philippine–American War of 1900s, Don Estanislao Flores became one of the guerrilla surrenderrees in 1902.",
            "He was also designated as one of the second lieutenants, together with Victor Montederamos of Libagon, of the Leyte southern division which spans from Maasin to Silago."
        ],
        [
            "The Japanese occupation and World War II"
        ],
        [
            "Following the successful invasions of China, Korea, Taiwan, Hong Kong and the Southeast Asian region, Imperial Japan occupied the Philippines from 1942 to 1944.",
            "The Japanese military authorities immediately began organizing a new government structure in the Philippines.",
            "Although the Japanese had promised independence for the archipelago after occupation, they initially organized a Council of State through which they directed civil affairs until October 1943, when the empire declared the Philippines an independent republic.",
            "Most of the Philippine elite, with a few notable exceptions, served under the Japanese.",
            "The puppet republic was headed by President Jose Laurel."
        ],
        [
            "The Japanese did not reinforce the island province of Leyte until 1943 because they saw that it lacked raw materials that would establish a base for their soldiers.",
            "This means that the local resistance forces in Leyte were able to establish numerically ahead since the official surrender of the Philippines in April 1942.",
            "Nonetheless, the Japanese Army was still able to garrison the municipalities of Ormoc and Tacloban as their bases of operations in Leyte even if the remaining pockets of resistance tactically attacked these localities until 1944."
        ],
        [
            "Geographically, Sogod was hardly accessed through land due to the lack of roads resulting in the scanty presence of Japanese forces in the area.",
            "The situation made the guerillas more organized compared to other municipalities in Leyte which were led by the former United States Army Forces in the Far East (USAFFE) members Lieutenant Sergio Nuqui and Captain Francisco, both under the leadership of Colonel Ruperto Kangleon.",
            "However, with the Church silent and the absence of a strong centralized civil government, political disputes, corruption and allegiance marred most of the Japanese rule of Sogod."
        ],
        [
            "Prior to the war, Severino Macasocol won the local elections of December 1940 as municipal mayor.",
            "against his political rival Cadio, an ex-USAFFE member.",
            "The bitter rivalry between the two that continued after the elections brought tragic events in the political situation of Sogod.",
            "It was reported that Macasocol, as well as the municipal vice mayor, Pablo Maglinte, were murdered around June 1942.",
            "These murders were presumably ordered by Cadio.",
            "Since that event happened, Sogod no longer had chief local officials to administer the welfare of the townspeople.",
            "To solve this problem, prominent citizens assembled and nominated the former chief of police Hospicio Labata to assume the mayoral office."
        ],
        [
            "The people of Sogod passed a resolution requesting the Japanese garrison in the town of Malitbog to appoint Hospicio Labata as mayor and Victorino Mercado as vice mayor after consulting Lieutenant Nuqui.",
            "According to local historians, this is a strange case of having both the guerillas and the occupying forces agreeing on the appointment of a mayor.",
            "In August 1942, Nuqui’s troops successfully expelled the Japanese out of the poblacion giving them the full support of the civilians.",
            "This situation gave the guerillas the opportunity to gather in November 1942 in Inopacan convened by the American officer Chester Peter, which led to a bloody encounter between the troops of Blas Miranda and Ruperto Kangleon due to their personal grudges.",
            "The northern and southern guerilla forces attempted to convene another unification talk in January 1943 led by Alejandro Balderian.",
            "This event officially made Kangleon the Military Advisor for these groups."
        ],
        [
            "But after a year, during the celebration of the town fiesta on December 8, 1943, the Japanese returned and reorganized the municipal government.",
            "Instead of appointing Labata, they chose Mercado to be the mayor of the town.",
            "The reason behind this action is unknown but it can be assumed that the Japanese knew Labata’s connection with the guerillas.",
            "According to a 1961 interview of Lieutenant Lapulapu Mondragon, a former guerilla, Mercado and Labata were taken to Tacloban on January 9, 1944, through a motorboat carrying the mayors of southern Leyte, where the Japanese-sponsored provincial governor, Bernardo Torres and acting governor Pastor Salazar persuaded Labata to whole-heartedly cooperate and implement Japanese policies."
        ],
        [
            "Due to their persuasion, Labata fully cooperated with the Japanese and performed his duties to their favor to pacify the townspeople.",
            "After the war, Central Intelligence Command (CIC) investigations pointed out in their interview with Geronimo Ruiz, a municipal councilor of Sogod, that Labata was indeed a rascal who only finished third or fourth grade education.",
            "Being an unschooled man, he was seen to be an abusive official even during the time when he was appointed as chief of police but was eventually discharged due to bribery.",
            "Example of his evildoing during the Japanese occupation was the assassination of Mayor Mercado who made contact with the guerillas.",
            "CIC documents stated that Labata killed the mayor by the order of the Japanese in Sogod.",
            "Labata gained again the post of mayor but he had numerous enemies in Sogod who attempted to kill him due to his cruelty such as ordering the public execution of Volunteer Guards in June 1944.",
            "He also confiscated the fishes of residents and sold these to the Japanese so that they will not be able to aid the guerillas."
        ],
        [
            "At the end of the war, Mayor Hospicio Labata was charged with (16) counts of treason and was sentenced to life imprisonment.",
            "He appealed to the court.",
            "After a careful review of the case, Labata was acquitted because of the lack of two witnesses to prove whether he really ordered the arrest of guerillas that led to their execution.",
            "In May 1945, the guerilla organizer Francisco Villamor was appointed as the postwar mayor of the town because of his popularity in fighting Labata’s collaboration."
        ],
        [
            "List of municipal executives from 1853 up to present"
        ],
        [
            "The newly created municipality was governed by duly elected Gobernadorcillos, Presidente Municipales and Municipal Mayors like:"
        ],
        [
            "Term"
        ],
        [
            "Gobernadorcillos"
        ],
        [
            "1853–1855"
        ],
        [
            "Don Juan Cavales"
        ],
        [
            "1856–1857"
        ],
        [
            "Don Antonio Prima"
        ],
        [
            "1858–1859"
        ],
        [
            "Don Eulogio Cavales"
        ],
        [
            "1876–1878"
        ],
        [
            "Don Patricio Tubia"
        ],
        [
            "1885–1887"
        ],
        [
            "Don Nicolas Idjao"
        ],
        [
            "1887–1889"
        ],
        [
            "Don Eleuterio Faelnar"
        ],
        [
            "1889–1891"
        ],
        [
            "Don Cipriano Leviste"
        ],
        [
            "1891–1893"
        ],
        [
            "Don Luis Espina"
        ],
        [
            "1893–1895"
        ],
        [
            "Don Nicolas Idjao"
        ],
        [
            "1895–1897"
        ],
        [
            "Don Luis Espina"
        ],
        [
            "1898–1903"
        ],
        [
            "Vacant"
        ],
        [
            "Term"
        ],
        [
            "Presidentes Municipal"
        ],
        [
            "1903–1904"
        ],
        [
            "Don Benito Faelnar"
        ],
        [
            "1904–1905"
        ],
        [
            "Don Ladislao Decenteceo"
        ],
        [
            "1905–1907"
        ],
        [
            "Don Dionisio Labata"
        ],
        [
            "1908–1912"
        ],
        [
            "Don Gregorio Leviste"
        ],
        [
            "1912–1916"
        ],
        [
            "Don Vicente Cariño"
        ],
        [
            "1917–1919"
        ],
        [
            "Don Estanislao Flores"
        ],
        [
            "1920–1922"
        ],
        [
            "Don Floro Espina"
        ],
        [
            "1923–1925"
        ],
        [
            "Don Estanislao Flores"
        ],
        [
            "1926–1931"
        ],
        [
            "Don Filomeno Mercado"
        ],
        [
            "1938–1940"
        ],
        [
            "Don Gervacio Cadavos"
        ],
        [
            "Term"
        ],
        [
            "Municipal Mayors"
        ],
        [
            "1941–1942 (December 1940 – June 1942)"
        ],
        [
            "Severino Macasocol"
        ],
        [
            "1942–1943 (?)"
        ],
        [
            "Gervacio Cadavos"
        ],
        [
            "1943–1944 (1942–1943?)"
        ],
        [
            "Hospicio Labata"
        ],
        [
            "December 1943 – 1944"
        ],
        [
            "Victorino Mercado"
        ],
        [
            "1944–1947 (May 1945 – 1947)"
        ],
        [
            "Francisco Villamor"
        ],
        [
            "1947–1950"
        ],
        [
            "Federico dela Plana"
        ],
        [
            "1950–1951"
        ],
        [
            "Cecilio Gonzales.",
            "During his tenure, Bontoc was made a regular municipality on July 29, 1950, through the provisions of Republic Act No.",
            "522 dated June 15, 1950."
        ],
        [
            "1952–1955"
        ],
        [
            "Gregorio Bagares"
        ],
        [
            "1956–1959"
        ],
        [
            "Jovencio Caday"
        ],
        [
            "1960–1964"
        ],
        [
            "Jose Maria Veloso.",
            "His ancestral roots originated from the wealthy Veloso clan of Consolacion and Maac.",
            "A graduate of University of Santo Tomas (UST), Veloso was a lawyer by profession, a journalist and a former governor of Leyte from 1912 to 1919."
        ],
        [
            "1964–1986"
        ],
        [
            "Ignacio Siega.",
            "He served the town of Sogod for over twenty-two years and was responsible for organizing the proper boundaries of the barangays in the poblacion in 1972."
        ],
        [
            "1986 – November 30, 1987"
        ],
        [
            "Doctor Gonzalo D. Yong Jr..",
            "He served as Officer-in-charge (OIC) during the post-EDSA People Power Revolution of February 1986."
        ],
        [
            "December 1, 1987 – January 1, 1998"
        ],
        [
            "Oscar T. Rio.",
            "He took over as caretaker after the EDSA People Power Revolution of February 1986."
        ],
        [
            "January 2, 1998 – March 27, 1998"
        ],
        [
            "Doctor Gonzalo D. Yong Jr.. During this period, Yong’s administration was marred by economic progress.",
            "He laid out the plans for the complete pavement of streets in the poblacion.",
            "The construction of the municipal wharf, municipal auditorium and bus terminal were one of his notable achievements.",
            "Recently, the terminal was renamed Gonzalo D. Yong Jr. Memorial Bus Terminal."
        ],
        [
            "March 28, 1998 – June 30, 1998"
        ],
        [
            "Amalia M. Yap"
        ],
        [
            "July 1, 1998 – June 30, 2004"
        ],
        [
            "Doctor Edmundo R. Villa"
        ],
        [
            "July 1, 2004 – June 30, 2013"
        ],
        [
            "Shefferd Lino S. Tan.",
            "A native of San Juan town, he was elected for three (3) terms to the mayoral positionfrom 2004 to 2013.",
            "Tan also ran for the vice-gubernatorial post during the 2013 general elections and won."
        ],
        [
            "July 1, 2013 – Present"
        ],
        [
            "Imelda U. Tan"
        ],
        [
            "History of the barangays"
        ],
        [
            "The annual Sogod Founding Day Celebration Agro-Fair held every June 10, display and sell some of the town’s agricultural produce."
        ],
        [
            "Benit"
        ],
        [
            "Etymologically, the village derived its name from Baknet or Benit, a kind of wild raspberries (Robus rosifulius Linn) which once thrived in the area.",
            "Formerly under the civil jurisdiction of barangay Magatas, Benit was established as a barangay on June 21, 1959, through the mandated provisions of Republic Act No.",
            "2563, and was subdivided into two sitios: Benit Centro and Layug.",
            "However, in 2017, the residents of sitio Layug had been evacuated to Benit Centro due to poor soil condition and frequent mudslides."
        ],
        [
            "Buac Daku and Buac Gamay"
        ],
        [
            "Buac was one of the sitios forming the barrio of Consolacion.",
            "Although \"Burak\" is the generic Cebuano term for a flower , now virtually unused, the name of the village specifically refers to the ilang-ilang (Cananga odorata), a tree whose fragrant flowers are extracted for oil used in the perfume industry.",
            "The village is home to the largest Seventh-day Adventist church in Sogod, with an elementary school for educating the residents of barrios Buac Gamay and Malinao; the adjoining La Caridad and Bendicar Farms, owned by the Gerona family; and the Consolacion Catholic Cemetery.",
            "Currently, Buac is divided into two villages with Buac Gamay covering the original site of Buac, and Buac Daku in the north, which is only accessible via footpath in barangay Suba."
        ],
        [
            "Cabadbaran"
        ],
        [
            "Named after a local shrub or tree known as Badba-an that abounded in the area, this interior barangay was officially established on June 21, 1959, through the provisions of the Republic Act No.",
            "2563.",
            "Cabadbaran was formerly a sitio of barangay Libas."
        ],
        [
            "Consolacion"
        ],
        [
            "Originally, barangay Consolacion used to be part of barrio Maac.",
            "The hamlet gained prominence when the Augustinian friars administered a school for boys and girls in the site from 1774 to 1785.",
            "It became a farming estate when the Javier and the Veloso clans cultivated the western lands of Maac in the 1880s.",
            "On account of the productivity of the area, the settlement became “Consolacion,” which was a sentiment nearer to the Cebuano terms, “makapahuway” and “makalipay”.",
            "The settlement was also called as such because the produce of the land brought relief and gratitude to the people farming the area.",
            "By 1883, Maak was divided into two (2) subdistricts as a result of the Velosos' influence on the area and migrations from Cebu, Bohol and Surigao.",
            "Aside from the Javiers and the Velosos, families of Spanish descent like the Decenteceos and Mercados also came to the sitio and acquired farmlands from its residents.",
            "This resulted to a gradual exodus of the original settlers from Consolacion to the uplands, where they continued farming coconuts, abaca, corn and rice.",
            "The new settlements would later be recognized as villages in the 1940s.",
            "By 1891, Maak was placed under the jurisdiction of Consolacion after the latter was elevated into a barrio.",
            "During the 1900 Philippine–American War, the Americans garrisoned Consolacion due to its participation in guerilla activities.",
            "Since Consolacion was a midway between Sogod and Libagon, it was dictated by the municipal council, under the administration of Don Ladislao Decenteceo (1904–1905) to move the seat of government there in 1904.",
            "The poblacion remained in Consolacion until 1912 when the seat of government, under the tenure of Don Vicente Cariño (1912–1916), was returned to Sogod.",
            "Again, by the mid-1920s, Estanislao Flores (1923–1925), the municipal mayor of Sogod, held his office in Consolacion for a short time.",
            "It was created an ecclesiastical district, under the patronage of the Holy Child Jesus, on January 25, 1967 by Bishop Teotimo Pacis, diocese of Palo.",
            "Presently, the barangay is subdivided into six (6) puroks: Acacia, Bougainvilla, Calachuchi, Flordeliz, Mangingisda and Orchids."
        ],
        [
            "Dagsa"
        ],
        [
            "Formerly a sitio of barangay San Isidro, Dagsa was made a barrio on June 21, 1959, through the mandated provisions of Republic Act No.",
            "2563  The name of the village derived from the Cebuano word, “Nahidagsa” or “Dinagsa,” which means “to swarm, to invade or to flock.” Jose Flores and his family discovered the site around the early 1920s.",
            "Before the barangay site was settled, the area was then forested.",
            "Engaged in primitive farming, Flores claimed huge tracts of land in the area.",
            "Until such time, that people from the poblacion and the neighboring barrios settled and flocked the site.",
            "These migrants, forming a small sitio, decided to celebrate this accomplishment with a fiesta.",
            "At that time, a vendor came to the hamlet selling a statue of San Jose.",
            "Accordingly, the hamlet heads came into an agreement to purchase the image and made Saint Joseph as patron saint of Dagsa.",
            "It was at this moment that the annual fiesta date of the barangay falls every March 19.",
            "The village is also famed for its waterfalls, which is a fifteen-minute trek from the barangay site."
        ],
        [
            "Hibod-Hibod"
        ],
        [
            "Early records account that Hibod-hibod existed as a hamlet in 1947 under the civil jurisdiction of barangay San Isidro.",
            "The name “Hibod-hibod” evolved from the Cebuano word, “Tubod”, which is attributed to the springs existing in the village.",
            "The springs in the area lure many people from Sogod and Bontoc in search of potable water.",
            "According to local grapevine, when the color of the water of the spring near Hiloctogan Creek turns milky or whitish, the villagers were reminded of an upcoming typhoon.",
            "Through the mandated provisions of the Republic Act No.",
            "2563, dated June 21, 1959, Hibod-hibod was granted the status of a barangay."
        ],
        [
            "Hindangan"
        ],
        [
            "The barangay is named after the Hindang, also known as Anubing (Artocarpus ovatus), a tree reaching a height of about thirty (30) meters and a diameter of about one hundred (100) centimeters.",
            "The tree was used as a marker of the location of the settlement during the early 1920s.",
            "It was only on June 21, 1959, through the provisions of the Republic Act No.",
            "2563, that Hindangan was made a village.",
            "One of the frontier barangays of Sogod, Hindangan is only accessible through a foottrail from barangay Cabadbaran."
        ],
        [
            "Hipantag"
        ],
        [
            "This interior barangay was established on June 19, 1965, through the provisions mandated by the Republic Act No.",
            "4306.",
            "Hipantag is only accessible by river from sitio Balintulay in barangay Kahupian."
        ],
        [
            "Immaculada Concepcion (Concepcion I) and La Purissima Concepcion (Concepcion II)"
        ],
        [
            "Named after its patroness, La Purissima Concepcion de Maria, barangay Concepcion was formerly a large farming village.",
            "Aside from the size of the barrio, most of its inhabitants were scattered from one place to another.",
            "Some of the villagers settled at the barrio’s southern coastal end, which was called by the locals as “Punong”  to maximize government services to the rural areas of Sogod."
        ],
        [
            "Kahupian"
        ],
        [
            "Considered as the seedbed of abaca and copra industries in the entire municipality, Kahupian is the largest and the northernmost barangay of Sogod.",
            "The first settlers of the village were the Duran family.",
            "It was accounted that the Kalapi (Mauritia flexuosa), a palm tree fruit, deep chest nut in color, grew in abundance in the village giving the name \"Kahupian\"  Today, the barangay of Kahupian is divided into six (6) sitios: Balintulay, Hagna, Kabernal, Kahupian Centro, Lubong Sapa and Silao Bato."
        ],
        [
            "Kanangkaan"
        ],
        [
            "Named after the Nangka (Artocarpus heterophyllus), a species of tree in the mulberry family, Kanangkaan was founded as a barrio in 1952.",
            "It was narrated that a cluster of Nangka trees once served as boundary markers for the territory of the village.",
            "Thus, the village was recognized as \"Kanangkaan\", a place where the trees abound.",
            "With the recent opening of a new resort complex, the Negulian Mountain Resort, in the barangay, it is expected that it will boost the area's potential for eco-tourism."
        ],
        [
            "Kauswagan"
        ],
        [
            "Formerly a sitio of barangay Libas, Kauswagan was created a barangay on June 21, 1959, through Republic Act No.",
            "2563.",
            "The name of the place, which originated from the Cebuano “Uswag,” means progress."
        ],
        [
            "Libas"
        ],
        [
            "Situated along the Bonbon River, Libas is one of the most populous barangays in the municipality.",
            "The present village was founded by a group of kaingeros  searching for abaca vegetation in the early 1930s.",
            "The mountains of western Sogod were then rich of abaca and coconut plantations leading to the establishment of hamlets in the area during this period.",
            "Before the campsite was cleared, the kaingeros were aware of the presence of trees locally known as Libas (Spondias pinnata), a medium-to-tall tree reaching a height of about twenty-five (25) meters and a diameter of about sixty (60) centimeters.",
            "Upon its recognition as a barrio of Sogod, the settlers decided to name the area after the tree.",
            "In 1940, Ceberino Caballes assumed as the village chieftain of Libas and was succeeded by Miguel Abella and Rafael Calooy, who assumed the position until the Second World War of 1944.",
            "After the war, Serafin Dalinog, Sergio Agoylo (1950), Eliseo Benero (1960), Jose Miculob and Leopoldo dela Piña (now spelled as dela Peña) came to head the civil administration of Libas.",
            "It was during the incumbency of Miguel Alao that the production of abaca and copra in the village increased.",
            "By 1972, Libas registered the biggest number of population in the municipality of Sogod with Prudencio Tomon (1972–1977) as the barangay chief.",
            "Tomon held the office until 1977 when Alma Labrador (1979–1994) replaced him during the elections.",
            "One of Labrador’s main accomplishments was the construction of school buildings in the village.",
            "By 1995 onwards, Concepcion Tomon (1995–2002) and David Tuble (2007–present) served the people of Libas as barangay chairmen."
        ],
        [
            "Lum-an"
        ],
        [
            "Known for its waterfalls, the village was then a sitio of barangay Libas.",
            "A landlocked barangay, Lum-an is accessible through a concrete road from barangay Taa in the town of Bontoc."
        ],
        [
            "Maac"
        ],
        [
            "One of the oldest barangays in Sogod, Maac was founded as a visita by the missionaries belonging to the Society of Jesus in February 3, 1730.",
            "As to the etymology of the name of the barangay, there exist three accounts.",
            "Accordingly, the name “Maak\" evolved from the old Cebuano term, “Maag” or “Maa”, which means \"river current\".",
            "It would remain a part of Consolacion until the American occupation.",
            "The following were the barangay chairmen who served Maac: Jose Lora, Benito Blanco, Pepe, Navarette, Proceso Diapolet, Victor Rubio, Juliano Rallos, Bienvenido Diapolet, Jonathan Segales and Arcadio Lora."
        ],
        [
            "Mabicay"
        ],
        [
            "The name of the village is a combination of two words.",
            "According to local grapevine, there lived a couple named Mabini and Ikay, who were known in the village as farmers of root crops.",
            "It was said that the villagers would go to the house of the couple just to buy their produce, whenever the need arises.",
            "As the years passed, the site, where the house and farm was located, came to be “Mabicay”.",
            "This landlocked barangay was separated from barangay Tampoong on June 21, 1959, through Republic Act No.",
            "2563.",
            "Presently, barangay Mabicay has a total land area of 250 hectares, divided into three (3) puroks and two (2) sitios: Mabicay proper and Paril."
        ],
        [
            "Magatas"
        ],
        [
            "A landlocked village nestled in a valley, Magatas was established as a barrio on May 8, 1942.",
            "It was first settled by the Timpla clan.",
            "The name of the village is derived from the word “Gatason”  and Tininaan."
        ],
        [
            "Mahayahay, Maria Plana and Javier"
        ],
        [
            "Mahayahay existed as a sitio of barangay Consolacion before the outbreak of Second World War.",
            "At first, the area was not considered a sitio but was a private lot settled by a clan.",
            "Among the family members lived an elderly man named Iyo Saloy .",
            "A native of barrio Consolacion, Javier’s achievement as a principal of the university and providing education, health and extensive farming activities to the various villages of Cabadbaran, Agusan del Norte and in barangay Bugho, Abuyog, Leyte, gave prestige in naming the sitio after him.",
            "Eventually, Bugho was renamed after him in 1965, eight (8) years after the barangay was elevated a municipality in 1957."
        ],
        [
            "Malinao"
        ],
        [
            "The sitio was founded by the settlers of nearby barrio Buac as Iloco on May 1, 1958.",
            "In the vicinity of the area lies a large reservoir, which was then described by the locals as “Malinao” or clear.",
            "Today, this reservoir supplies the southeastern villages of the town with potable water.",
            "Upon its establishment as a barangay on June 21, 1959, through Republic Act No.",
            "2563, the barangay was renamed “Malinao”.",
            "By June 19, 1960, Republic Act No.",
            "2810 was passed in Congress to redefine the metes and boundaries of the village."
        ],
        [
            "Milagroso"
        ],
        [
            "Milagroso was founded around 1883 by the Tagoon and Lamoste families.",
            "Legend has it that a man came to plant a stalk of banana in his lot at the village site  A circumferential road links the barrio from barangay San Roque and barangay San Pedro."
        ],
        [
            "Olisihan"
        ],
        [
            "In the former days, the sitio of Olisihan was located atop a mountain ridge with the Vanzuela and Chato families as its first settlers.",
            "The abundance of Olisi trees got the attention of the natives and called their place \"Olisihan\".",
            "When the national highway was constructed at the mountainside, many barrio folks transferred near the road leaving the old site abandoned.",
            "The area became the new site of the hamlet until it was granted a barangay status on June 21, 1959, through Republic Act No 2563.",
            "Olisihan was then under the territorial jurisdiction of barangay Suba."
        ],
        [
            "Pancho Villa"
        ],
        [
            "Formerly known as Pinamonoan, the barrio of Pancho Villa was first settled by the Dikit, Oquendo and Balengkit families.",
            "The area was named so because of the convergence, known in Cebuano as “Pinamonoan” of the rivers of Subangdaku and San Francisco.",
            "After it was created a barangay on June 21, 1959, through Republic Act No 2563, the name of the village was changed in honor of the first Filipino boxer Pancho Villa.",
            "Today, barangay Pancho Villa is divided into two (2) sitios: Dampoy and Pancho Villa Centro."
        ],
        [
            "Pandan"
        ],
        [
            "The village got its name from the Pandan (Pandanus amaryllifolius), which was growing abundantly in the area.",
            "Presently, the barangay of Pandan is the site of the 10-mega volt ampere Sogod power substation of the Southern Leyte Electric Cooperative (SOLECO)."
        ],
        [
            "Rizal"
        ],
        [
            "During the 1945 liberation, influx of new settlers came and resided in the southern part of the ba The rise of population in the area already qualified the settlement to be a fully pledged barangay.",
            "However, according to barangay accounts, the people residing near the poblacion and Rizal Street Extension, were not considered part of the sitio.",
            "Hence, the village heads accounted that the households situated near the Pandan River, at the northernmost area of sitio, were deemed legible residents of the settlement.",
            "It was on June 21, 1959, that the sitio was established a barangay through the provisions of Republic Act No.",
            "2563.",
            "The new settlement was called \"Rizal\", not because it was named in honor of Jose Rizal, the national hero of the Philippines, but the area stood at the end of the town's main street.",
            "By the year 1966, a barangay charter was imposed for the definition of the exact boundary of Rizal with the poblacion.",
            "It emphasized that Rizal Street form the barangay's southern boundary with the poblacion.",
            "Today, barangay Rizal is home to various low-price lodges, dormitories and apartments for students enrolled at the province's only state university."
        ],
        [
            "Salvacion"
        ],
        [
            "The increase of area and population in Consolacion prompted the creation of a new barrio in 1973, by virtue of the Presidential Decree Nos.",
            "210 and 211 inaugurated by President Ferdinand Marcos.",
            "By the time of its division, the southern area of the barrio remained as Consolacion while the northern part was named “Salvacion”.",
            "The name of the barangay was a namesake of Salvacion Oppus-Yñiguez, the governor of Southern Leyte from 1972 to 1986, who initiated the barangayhood of Salvacion.",
            "The barangay chieftains who served Salvacion were Mileton Ramos, followed by Froilan Echavia, Luciano Diaz, Maurillo Canon-Pingco and Luis Beliso.",
            "Two educational institutions are located in this highway barangay: the Consolacion Elementary School and the Consolacion National High School."
        ],
        [
            "San Francisco Mabuhay"
        ],
        [
            "Founded in 1952 after the World War II by settlers from the poblacion, San Francisco Mabuhay got its name from a combination of words.",
            "Francisco Garlet, the teniente del barrio of this far-flung sitio, spearheaded the move to declare the sitio as a barangay.",
            "The appeal of Garlet and the rest of the sitio were granted by the municipal council of Sogod.",
            "During its declaration, loud shouts of \"Mabuhay, Mabuhay!\"",
            "circulated through the village.",
            "With no name, the villagers decided to name their place, “San Francisco”, as dedication to the efforts done by the barrio chief.",
            "Later, Mabuhay was attached to the official name of the barangay.",
            "The barangay was formally organized as a barangay on June 21, 1959, through the mandated provisions of Republic Act No.",
            "2563.",
            "Presently, the barangay is divided into two sitios: San Francisco proper and Honob, which is accessible through a mountain trail from sitio Kabernal in barangay Kahupian via the National Highway."
        ],
        [
            "San Isidro"
        ],
        [
            "The first known settlers of Malupao, the first name of barangay San Isidro, were the families of Pedro Senillo, Ceriaca Dalugdugan and Apolonia Aguillon.",
            "Nestled along the town's rice producing area, the barrio folks renamed it after San Isidro Labrador, the patron saint of farmers."
        ],
        [
            "San Jose"
        ],
        [
            "The village was established around 1948 as part of barangay San Pedro.",
            "The distance of the settlement from San Pedro earned the site's name as \"Sudlonon\"  The pebbled shorelines of San Jose are dotted with beach resorts and hotel accommodation.",
            "Renamed after its patron saint, the residents in the area celebrate their annual fiesta in honor of San Jose every March 19."
        ],
        [
            "San Juan"
        ],
        [
            "The barangay was formerly called as \"Agta\", a legendary creature that resides on trees and far-flung places.",
            "Many residents believed that the Agta owned and lived in the present site of the village.",
            "A certain educated stranger later emerged in the barrio and taught the settlers of basic education there.",
            "He was also symbolic in making San Juan el Bautista the patron saint of the settlement.",
            "By June 21, 1959, under Republic Act No.",
            "2563, San Juan was created as a barangay.",
            "But it was on June 19, 1960 that the territorial jurisdiction of San Juan was defined, further covering the sitios of Hubasan, Agta Proper, Manduduknay, Kabas-an and Cabadbaran."
        ],
        [
            "San Miguel"
        ],
        [
            "The barangay was once known as “Batang”, a term coined from a phenomenon of fallen logs, or driftwood, carried away from the currents of the Subangdaku River whenever a typhoon occurs.",
            "The western bank of the Subangdaku River was then settled by the families of Severo Obra Jr., Eleuterio Maasin Jr. and Eleuterio Balogo, which were Cebuano migrants hailing from Argao, Cebu in the 1940s.",
            "As the barangay expanded during the 1960s, the villagers decided to change the name of the site in honor of San Miguel Arcangel, the patron saint of the town of Argao."
        ],
        [
            "San Pedro"
        ],
        [
            "One of the oldest visitas of Sogod, barangay San Pedro was formally founded in 1857 with Selverio Biliza, Victoriano Catajoy and Esteban Rana as the first cabezas de barangay.",
            "The village was formerly the site of a high school administered by the Augustinian friars, which was operational from 1774 to 1785.",
            "There exist two narratives portraying the etymological origin of the name \"Hipgasan.\".",
            "The first account states that the term was a namesake of the river passing through the village.",
            "Accordingly, the village site was then the “Hugasan,” a place where the settlers washed their spears, bows and arrows and their hunted animals.",
            "A village chief came to this place for hunting and killed a number of wild animals.",
            "As soon as the chieftain dipped the carcasses to the river for cleaning, a maiden appeared, warning him not to kill the animals in the area.",
            "The fairy also cautioned him not to dirty the water with blood.",
            "To his surprise, the chieftain ran away and warned his people not to go to the present-day Banat-e spring, the source of the river, where the maiden lives.",
            "Hence the name “Hipgasan” is an evolution of the Cebuano word, “Hugasan”.",
            "Another account was based on the acronym, “Hipno nga gawi ug pamatasan”.",
            "The name came to be since the settlers of the village were hospitable to the visitors bathing in the river.",
            "The efforts of teniente del barrio Alberto Linga, together with the cooperation of the settlers of the village, materialized the creation of irrigation canals in the southwestern areas of Sogod with its source in sitio Banahaw.",
            "Thus, the expression, “Hipno nga gawi ug pamatasan” or “HipGaSan”, was attached to the identity of the people of barangay San Pedro.",
            "The population of barrio Hipgasan increased when the Boholanos migrated the area in the 1920s.",
            "Raymundo Carpiz and the clan of Felipe Vistal Sr., whose offspring bore the Capilitan and Damalerio clans, were recognized as the earliest recorded inhabitants of barangay San Pedro.",
            "Sooner, a couple of Cebuano families migrated in the area and prospered before the World War II.",
            "Demetrio Angcoy, who hails from the town of Argao, Cebu, married a Sogodnon, Cirila Vargas.",
            "The couple was to be the main bearer of the Angcoy and Albert families in Sogod.",
            "By 1955, through the efforts of teniente del barrio Dionisio Logronio, the name of the barangay was changed after the village’s patron saint, San Pedro Apostol.",
            "A native of Bohol, Logronio married Eulalia Diola, a native of this settlement.",
            "Presently, barangay San Pedro is politically subdivided into four (4) puroks and a sitio."
        ],
        [
            "San Roque"
        ],
        [
            "Barangay San Roque was formerly known as \"Himaylag\", which is named after a stream coursing through the northern part of the district.",
            "In the old days, people from the poblacion would flock to get water from the brook.",
            "Due to the pristine quality of the water, the name of the area was shortened to \"Maylag\".",
            "As the settlement grew, a meeting was convened by the village chief for the first barrio fiesta.",
            "It was agreed that the event be celebrated every August in honor of San Roque de Montpellier, the patron saint of pilgrims.",
            "It is also believed that the villagers choose the saint as the barangay patron because the teniente del barrio of Maylag, who was suffering from an unknown disease during that period, was allegedly cured on August 16 through the intercession of the saint.",
            "Later, the name of the village was changed to \"San Roque\" as a tribute to the patron saint.",
            "Today, barangay San Roque is divided into four (4) puroks and is the site of Southern Leyte State University (SLSU), the province's state university."
        ],
        [
            "San Vicente"
        ],
        [
            "The earliest record accounts that the village existed in 1950.",
            "Situated at the foot of a mountain, the hamlet experienced frequent landslips during rainy seasons.",
            "Thus, the settlers called their area as “Anas”"
        ],
        [
            "Santa Maria"
        ],
        [
            "Before the area was settled, a species of fruit known locally as Santa Maria (Passiflora foetida) surround the landscape.",
            "After the place was cultivated by the farmers and residents from the village of Libas, it was coined as \"Santa Maria\".",
            "It was officially carved out from barangay Libas on June 21, 1959, by Republic Act No.",
            "2563.",
            "The patron saint of the barangay is the Santo Niño de Cebú."
        ],
        [
            "Suba"
        ],
        [
            "Located along the Subangdaku River, the site was first settled by the Aklan family.",
            "Upon its founding, the site was known as “Tindahan”, which means a mini-grocery.",
            "When the Typhoon Amy ravaged Leyte in December 1951, the hamlet experienced severe destruction as the river flooded the area and the nearby villages in Sogod.",
            "It was told that every rainy season, the river becomes very wide, swollen and destructive that the trail connecting the hamlet to the poblacion becomes impassable.",
            "And during summer months, the dried riverbed serves as an airport for small airplanes.",
            "Thus, the barangay was called “Suba” ."
        ],
        [
            "Tampoong"
        ],
        [
            "The present-day barangay of Santa Cruz, now part of Bontoc town, serves as boundary between the poblacion of Sogod and the visita of Bontoc in 1897.",
            "Santa Cruz, which was then called “Malangsa,” had the barangays of Tampoong and Casao  to the subject matter."
        ],
        [
            "Zone I"
        ],
        [
            "Having a land area of about 27.40 hectares, the barangay of Zone I is the residential, educational, and commercial core of the poblacion of Sogod.",
            "The barangay was then a sitio once known as \"San Antonio,\" after the street which passes through the chapel, dedicated to San Antonio de Padua and the barangay hall.",
            "It was on 1973, when President Ferdinand Marcos decreed the creation of San Antonio as a barangay and renamed the district as Zone I.",
            "Today, this barrio is divided into nine (9) puroks and houses the municipal hall complex, police station and Regional Trial Court (RTC), Grace Christian School of Sogod (GCS), Royal Waldorf School, Sogod Central School, Sogod SPED Center, Sogod National High School, Sogod District Hospital, Sogod Water District and other government and commercial establishments."
        ],
        [
            "Zone II"
        ],
        [
            "The late President Ferdinand Marcos passed Presidential Decree Nos.",
            "210 and 211 in 1973, further establishing barangays in the country.",
            "Mayor Ignacio Siega (1964–1986), through a municipal resolution authorized the creation of districts in the poblacion of Sogod.",
            "Popularly known by the residents as \"Kalanggaman\" , the newly-created barangay has jurisdiction over the area south of Osmeña Street to Concepcion Street, ending at the municipal wharf; and the area north of the shoreline, which includes the entire span of Gervacio Cadavos Street, monitoring from the wharf to the creek bounding barangay San Jose.",
            "The barangay chieftains who served Zone II were Luis Yap (1973–1976), Felipe Rio (1976), Benjamin Caadyang (-1986), Renato Altejar (1986–1992), Rodulfo Telin (1992–1994), Samuel Dagohoy (1994–1997) and Oscar Tan Jr. (1997–2000)."
        ],
        [
            "Zone III"
        ],
        [
            "This historic barangay was formerly known as \"Baluarte,\" after the former watchtower that existed during the colonial years.",
            "The Moro raid of 1754 destroyed the Spanish-era church and watchtower, which houses the golden bell, and killed and enslaved most of the town’s inhabitants.",
            "Being the original locus of the poblacion, much of the town’s history revolved around this district.",
            "By 1973, the poblacion of Sogod was divided into five (5) barangays through a municipal resolution.",
            "The jurisdiction of Baluarte covers the area east of Concepcion Street, from the municipal wharf to Osmeña Street; the site south of Osmeña Street monitoring towards Subangdaku river; and the area west of Subangdaku river to the shoreline.",
            "After the 1987 canonization of San Lorenzo Ruiz, the barangay council passed a resolution to the municipal hall in 1991 for the changing of the name of the district after the first Filipino saint and patron of the new district.",
            "The motion was approved by the provincial government of Southern Leyte in 1992.",
            "With an area of eleven (11) hectares, barangay Zone III is the commercial center of Sogod with the Sogod Integrated Market and the Doctor Gonzalo Yong Bus Terminal as its major establishments.",
            "The barangay chieftains who served Zone III were Francisco Cajoles (1973–1980), Conchita Telin (1980–1986), Mario Cajoles (1986–1988), Floro Espina (1988–1992, 1994–1997 and 1997–2000), Agustin Lagat (1982–1998), Teofila Barosa (2000–2001), and Bonifacio Felicilda (2001–2004).",
            "Presently, there are six (6) puroks composing the barangay of Zone III: Block Market 1, Block Market 2, Bitoon, Maligaya 1, Maligaya 2 and Santo Niño."
        ],
        [
            "Zone IV"
        ],
        [
            "Situated in the innermost area of the poblacion, Zone IV is considered as the residential and commercial hub of Sogod.",
            "The barangay is the site of the Sogod Auditorium, Police Station, Firemen’s Hall, the Association of Barangay Councils (ABC) Office, Rural Health Unit (RHU) Building, a government-run birthing facility and other national and provincial offices.",
            "The town center was divided into five different barangays in 1973."
        ],
        [
            "Zone V"
        ],
        [
            "With a total land area of 46,186.594 square meters, the barangay of district Zone V has a jurisdiction over the areas east of Rizal Street monitoring towards sitio Katambisan, Rizal Street Extension; the areas east of sitio Katambisan to Pandan River, which covers south; the areas west of Subangdaku River to the southern boundary facing barangay Zone III; and the areas north of Osmeña Street to the intersection of Rizal Street.",
            "At present, barangay Zone V is divided into seven (7) puroks and is the site of Southern Leyte Provincial Public Safety Company (SLPPSC) Headquarters, Gaisano Capital Mall of Sogod, Corrompido Specialty Hospital and among others."
        ],
        [
            "Geography"
        ],
        [
            "The town covered a total land area of 236.4 square kilometers (91.3 square miles) until 1953.",
            "Due to the enactment of Republic Act No.",
            "522 on June 15, 1950, which establishes the municipality of Bontoc, the municipal area of Sogod decreased.",
            "However, the newly ordained act was proven to be lax in nature.",
            "The juridical boundaries of the town of Bontoc were not fully indicated, causing much tension between the two municipalities.",
            "After the 1959 promulgation of the Executive Order No.",
            "368, all conflicting areas between the municipalities of Sogod and Bontoc were reorganized and reevaluated.",
            "Many complaints and petitions were sent to the Provincial Board of Southern Leyte and to the Regional Trial Court (RTC) to reconcile the disputed villages to Sogod, but all were in vain.",
            "As a result, the land area of the municipality was reduced to 19,270 hectares (47,600 acres) in land area."
        ],
        [
            "With the coordinates of 10°23'10 North Longitude and 124°58'48 East Latitude, Sogod is situated in the northern portion of the province of Southern Leyte and in the south-central side of Leyte Island, facing the Sogod Bay.",
            "It is approximately 72 kilometers east from the city of Maasin, the provincial capital of Southern Leyte; 127 kilometers south from Tacloban City, the regional center of Eastern Visayas and the provincial capital of Leyte; 106 kilometers from Ormoc City, a port city on the north-western coast of Leyte."
        ],
        [
            "Rice paddies in barangay Salvacion with the Abuyog-Liloan Cordillera in the background.",
            "Wide plains characterize much of the south-eastern terrain of the town."
        ],
        [
            "The town is bounded by the municipality of Mahaplag, approximately 38 kilometers northbound via the Maharlika Highway; in the east are the municipalities of Silago, Hinunangan, and Saint Bernard; in the southeast is the municipality of Libagon, about 22 kilometers eastbound via the national highway; facing to the south is Sogod Bay, the only water form that divides the province from west to east; 6 kilometers south-west lies the municipality of Bontoc; in the west are the towns of Bato, Hindang, Hilongos, and Inopacan."
        ],
        [
            "The Mahaplag-Sogod mountain rim is the boundary line of the two provinces of Leyte and Southern Leyte.",
            "Two bridges in sitio Balintulay, barangay Kahupian serve as markers for the boundary.",
            "In the east and west sides of the municipality are much similar to the north.",
            "The slopes serve as barricades from the municipalities facing the eastern Pacific region.",
            "Every rainy season, frequent landslips would mar the soil condition of upland barangays causing the feeder roads to be impassable.",
            "The southern part is bordered by rivers and creeks.",
            "The Santa Cruz Creek serves as a demarcation line between the towns of Bontoc and Sogod.",
            "Gakat Creek functions as boundary between Sogod and Libagon."
        ],
        [
            "Barangay"
        ],
        [
            "Sogot is politically subdivided into 45 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Benit"
        ],
        [
            "Buac Daku"
        ],
        [
            "Buac Gamay"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Concepcion"
        ],
        [
            "Consolacion"
        ],
        [
            "Dagsa"
        ],
        [
            "Hibod-hibod"
        ],
        [
            "Hindangan"
        ],
        [
            "Hipantag"
        ],
        [
            "Javier"
        ],
        [
            "Kahupian"
        ],
        [
            "Kanangkaan"
        ],
        [
            "Kauswagan"
        ],
        [
            "La Purisima Concepcion"
        ],
        [
            "Libas"
        ],
        [
            "Lum-an"
        ],
        [
            "Mabicay"
        ],
        [
            "Mac"
        ],
        [
            "Magatas"
        ],
        [
            "Mahayahay"
        ],
        [
            "Malinao"
        ],
        [
            "Maria Plana"
        ],
        [
            "Milagroso"
        ],
        [
            "Olisihan"
        ],
        [
            "Pancho Villa"
        ],
        [
            "Pandan"
        ],
        [
            "Rizal"
        ],
        [
            "Salvacion"
        ],
        [
            "San Francisco Mabuhay"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pedro"
        ],
        [
            "San Roque"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Maria"
        ],
        [
            "Suba"
        ],
        [
            "Tampoong"
        ],
        [
            "Zone I"
        ],
        [
            "Zone II"
        ],
        [
            "Zone III"
        ],
        [
            "Zone IV"
        ],
        [
            "Zone V"
        ],
        [
            "Topography"
        ],
        [
            "The municipality has flat-to-rolling plains in the southern part, with rivers crisscrossing the lowland.",
            "The rivers of Subangdaku and San Francisco are the major waterways of the town.",
            "The headwaters of these rivers are located at the Leyte Cordillera.",
            "The rivers flow southward from the villages of Kahupian, Pancho Villa, San Francisco Mabuhay and San Juan to its mouth at the Sogod Bay near the Sogod poblacion."
        ],
        [
            "Numerous springs are located in the town.",
            "Some of them are situated in barangay Consolacion, Hibod-Hibod, Kahupian, Lum-an, Pancho Villa, and San Juan.",
            "The Magaupas Spring in barangay Pandan and Banat-e Spring in barangay San Pedro supplies the water needs of the Sogodnons."
        ],
        [
            "Rugged peaks covered the town’s northern area.",
            "These slopes are dotted with thick rain forests which served as habitat for rare species of flora and fauna, like the Philippine Eagle and Tarsier.",
            "Of the twenty-four mountains in Southern Leyte province, five are located in Sogod.",
            "These are the mountains of Bitanhuan 3,169 feet (966 meters), Cagbano 725 feet (221 meters), Capuloan 2,583 feet (787 meters), Llave 2,583 feet (787 meters) and Panjongon 1,259 feet (384 meters)."
        ],
        [
            "Recently, two new species of frogs belonging to the genus Platymantis were discovered specifically inhabiting the montane and mossy forests of the Nacolod Mountain Range (the Hinunangan-Silago-Sogod corridor of the Leyte Cordillera) in Southern Leyte.",
            "Both species differ markedly from other known species of Philippine Platymantis frogs by their body size, coloration patterns, and advertisement calls.",
            "The two species are allied to two different species groups, the Platymantisguentheri group and Platymantishazelae group.",
            "This is the first time that a Platymantis species belonging to the Hazelae group has been discovered in Mindanao faunal region, of which the island of Leyte belongs to."
        ],
        [
            "There are three mountain ranges that separates the municipality from the other towns of the province, these are: Baybay-Maasin Cordillera, the Abuyog-Liloan Cordillera and Mahaplag mountain range."
        ],
        [
            "The Baybay-Maasin Cordillera consists of rolling hills and varied upland plains.",
            "This area is known for its lush and productive coconut and abaca plantations.",
            "Rice paddies formed the rest of the agricultural thicket of the area."
        ],
        [
            "The Abuyog-Liloan Cordillera is regarded as the bounty for endangered animals such as tarsiers, eagles, deers and monkeys.",
            "The mountain range has an altitude of about 2,000 above sea level.",
            "In the recent years, this part of the province had experienced deforestation.",
            "Due to massive exploitation of hardwood in the area, it resulted to severe flowing of the Subangdaku River and landslides in Sogod’s mountain villages.",
            "In the mid-1980s, the Philippine Government issued the banning of timber cutting in the entire country, leading to the massive restoration of the forests in the country."
        ],
        [
            "The Mahaplag cordillera is an arm of the Abuyog-Liloan mountain range and has the same characteristics with the other mountain ranges.",
            "Being isolated by human activities, it is also home to rare species of flora and fauna."
        ],
        [
            "Being a coastal town, the bay that divides the province into two regions is named after Sogod.",
            "Of all the municipalities comprising the province of Southern Leyte, the municipality has the shortest shoreline."
        ],
        [
            "Subangdaku River"
        ],
        [
            "Main article: Subangdaku River"
        ],
        [
            "The view of Subangdaku River, as seen from the Subangdaku I Bridge in barangay Suba."
        ],
        [
            "Subangdaku is the largest river in the province of Southern Leyte that empties into Sogod Bay.",
            "Based on the physical description of rivers done by the Ateneo de Naga University, Subangdaku is considered a braided river since there are several channels that divide and reunite forming an alluvial fan with very wide floodplain.",
            "Sediments of various sizes are deposited in this floodplain every typhoon season, causing the river to swell.",
            "The larger materials are deposited first while the finest materials such as silt and clay are deposited last as the river moves towards its mouth to meet the sea, which is seen as a natural occurrence."
        ],
        [
            "The town center of Sogod and a number of barangays along the banks of Subangdaku were reportedly affected by a strong flood similar to that experienced with Typhoon Amy in 1951.",
            "Typhoon Amy had the strength and volume of water that caused sediments of various sizes to roll downstream sweeping away several villages, vegetation, and farm animals.",
            "After the typhoon, logs were seen floating in Sogod Bay together with dead bodies.",
            "For months, the people of Sogod and the surrounding villages did not eat fish caught from the bay."
        ],
        [
            "Mounds of gravel deposits are dumped beside the banks of Subangdaku River for the strengthening of the river control in barangay San Miguel.",
            "Farmers along the river banks complained on the soil erosion caused by the rechannelization project.",
            "Environmentalists in the province also claim that the sand and gravel quarrying in barangay Immaculada Concepcion was not a re-channeling project but a large-scale mining which exports these mineral deposits to Cebu and abroad."
        ],
        [
            "Recent typhoons did not result to the terrible destruction brought about by Typhoon Amy.",
            "Flooding happens only every heavy rains.",
            "Some of the destroyed agricultural lands were reclaimed by local people when some of the portion of Subangdaku dried out as a result of quarrying and rechanneling activities.",
            "The river has been known to meander along its course, ever changing its way over time."
        ],
        [
            "Exploitation"
        ],
        [
            "A map showing the Subangdaku River, as part of a position paper presented at the Ateneo de Naga University, dated March 21, 2002."
        ],
        [
            "For years, following the floodings of the river, Subangdaku created an issue over the province.",
            "The quarrying in the area became rampant and destructive.",
            "After many attempts of conserving the site, the issue remained unsolved until today."
        ],
        [
            "The Department of Public Works and Highways (DPWH) recommended to the Southern Leyte Governor Oscar Tan, for the rechannelling of the river in order to “redirect the flow of water straight to the bridge (present Subangdaku Bridge in barangay Suba) waterway.” A permit was granted to Shemberg with the “objective of rechannelling the meandering Subangdaku River, thereby protecting the existing infrastructure, the lives and properties of Sogodnons” on July 13, 1993.",
            "Rechannelling was commenced shortly after.",
            "In 1998, a group of Sogodnons complained about the destruction in the river allegedly due to the quarrying operations of Shemberg.",
            "Supporting papers in 1998 backed the continued rechannelling operations of said company, thus quarrying and rechanneling activities were resumed."
        ],
        [
            "Shemberg-Rockland Marketing Corporation was granted an Environmental Compliance Certificate (ECC) by the Regional Department of Environment of Natural Resources (DENR-8), through the Mines and Geosciences Bureau (MGB-8), to conduct quarrying operations in the river.",
            "Although the ECC allowed them to extract 60,000 cubic meters per year (ECC was granted on June 25, 1993), some sectors believed that what was extracted from the river was more than this amount.",
            "For instance, it was alleged that small operators and local residents also collect sand and gravel and sell them to Shemberg.",
            "By June 5, 1998, MGB-8 issued a renewal of permit (SAG No.",
            "IP-98-011) to Shemberg Marketing Corporation (SMC) allowing it to extract 350,000 cubic meters for five years, renewable for the same period and volume.",
            "This amount has increased by 10,000 cubic meters annually.",
            "Aside from Shemberg, there were also other operators that extracted sand and gravel, such as Reeline Commercial Aggregates and a Gaudencio Ang."
        ],
        [
            "On December 12, 2001, Typhoon Nanang damaged a road shoulder in barangay San Miguel.",
            "Shemberg, however, denies responsibility for the destruction.",
            "The company reports that the total concession area of Shemberg is only 19 hectares which occupies about 2 kilometers of the river and that its “upstream boundary is located near the concrete structure, at the bend of San Miguel and is approximately 300 meters downstream of the newly collapsed road pavement.”"
        ],
        [
            "The Save Subangdaku Movement (SSDM) requested for assistance from the people hearing mass at the Immaculate Conception of Mary Parish during the celebration of the patronal fiesta on December 15, 2001.",
            "While the local officials blamed the rechannelization project of the government and uncontrolled quarrying of gravel and sand at the side of river as the cause of the flood.",
            "At a meeting on March 18, 2002, a government agency alleged that the reason of the incidents of flood and other environmental problems in the river was due to the Philippine Fault System which caused rocks to rumble down.",
            "However, the reason was contended because the fault is a geological feature and environmental problems in the province just occurred that time."
        ],
        [
            "In response, the Institute for Environmental Conservation and Research (INECAR) team visited Sogod on May 20–23 and September 2–3, 2002 to investigate the alleged impacts of quarrying in the river.",
            "Some of the local residents, the SSDM in particular, feared that the cause of the destruction of a portion of the road in barangay San Miguel was quarrying.",
            "They were also worried that the present destruction is a prelude to a larger destruction that will affect the town of Sogod itself and adjacent villages when the rainy and typhoon season comes."
        ],
        [
            "A portion of the national highway in barangay San Miguel taken during the 2002 overflowing of the river."
        ],
        [
            "The team identified the probable reasons why the roadslip and erosion occurred in barangay San Miguel: a) increased in energy upstream as a result of rechanneling downstream and b) the river has been fragmented by quarrying operations creating channels that are directed towards the area of the barangay concerned."
        ],
        [
            "The provincial government pushed for immediate rechanneling of Subangdaku considering that the river has been tagged by the Department of Environment and Natural Resources (DENR-8) as very susceptible to flash floods.",
            "The restoration led to the construction of dikes along the barangays of Suba, San Isidro, San Miguel and Inmaculada Concepcion in 2007."
        ],
        [
            "An irrigation dam was constructed beneath the Subangdaku Bridge I in Barangay Suba to control the flow of the current to the farmlands in the south-eastern portion of the municipality.",
            "However, the dam was destroyed after strong river currents breached the infrastructure in January 2011."
        ],
        [
            "The Subangdaku Bridge II was inaugurated in March 2013, connecting it to barangay San Miguel and barangay Inmaculada Concepcion.",
            "It was seen as a solution to cut the travel time from Maasin City to the rest of the province."
        ],
        [
            "Today"
        ],
        [
            "The provincial government is seeking for the immediate suspension of two-decade-old quarrying operation in the river after numerous violations done by the permit holders.",
            "Last August 20, 2013, Governor Roger Mercado told the press that the government is \"waiting for the complete assessment report from the Mines and Geosciences Bureau (MGB) and Environmental Management Bureau (EMB).\""
        ],
        [
            "The suspension of sand and gravel extraction of Subangdaku will give way to delineation of the areas as part of the revised rechanneling plan.",
            "Extractors are to resume operations after implementing the rechanneling plan, under the supervision of the Provincial Environment and Natural Resources Office (PENRO)."
        ],
        [
            "The governor added that the Cebu-based Shemberg Marketing Corporation \"keep on renewing from MGB-8 since 1993.\"",
            "The quarrying firm never sought an approval from the provincial governor and committed a grave violation under existing environmental laws and the local government code."
        ],
        [
            "Records of the MGB regional office showed that as of June 2013, there are two existing sand and gravel industrial permits.",
            "Shemberg Marketing Corporation has the biggest concession area at 19 hectares.",
            "Selena Salas, a permit holder from Cebu City were given go signal to quarry in 12.53 hectares.",
            "There are two pending application for sand and gravel industrial permits in the area.",
            "These local firms are owned by Emily Chiongbian and Rodolfo Gervacio with a combined proposed extraction area of 13.73 hectares."
        ],
        [
            "Despite the call for suspension, MGB clarified that the provincial government of Southern Leyte has no authority to suspend quarrying operations along Subangdaku.",
            "The latter can only recommend for suspension of sand and gravel extraction but it has to be approved by the MGB regional office.",
            "The office also added that the permit holders have no violations."
        ],
        [
            "Sogod Bay"
        ],
        [
            "Main article: Sogod Bay"
        ],
        [
            "An aerial view of Sogod Bay from Milagroso hill.",
            "Every Lenten season, Catholics flock at the summit of the hill for the reenactment of the passion and death of Christ.",
            "The trail, leading to the summit of the hill, which starts from the national high school in barangay San Roque, is complete with life-size statues depicting the stations of the cross."
        ],
        [
            "Sogod is situated at the head of Sogod Bay.",
            "The bay, home to a variety of fishes, provided food and livelihood to the people of Sogod and nearby municipalities."
        ],
        [
            "The Subangdaku River is a major tributary of the bay, emptying into the bay at the municipality of Sogod.",
            "Much of the bay's ecology has been disturbed due to human activity, ranging from quarrying and rechanneling to improper waste management."
        ],
        [
            "Sogod-Bontoc boundary dispute"
        ],
        [
            "The enactment of the Republic Act No.",
            "522 on June 15, 1950, granted the creation of the municipality of Bontoc, a village situated six (6) kilometers west from Sogod.",
            "But it was on July 29, 1950, that Bontoc was formally inaugurated as a fully pledged municipality.",
            "In the latter times of the Spanish colonization, Bontoc was already a functioning village of Sogod with a status of a visita (barrio with chapel) around 1886."
        ],
        [
            "The Republic Act included the villages of Bontoc, Divisoria, Union, Paku, Beniton, Catmon, Hilaan, Taa, Santa Cruz, and Mahayahay, which were under the political jurisdiction of Sogod, to be part of the municipality of Bontoc.",
            "The problem was that the boundaries between the two towns were not “well-defined” and the majority of the people residing in Bontoc preferred to have their transactions in Sogod.",
            "Much worse when the municipio (town hall) in Sogod began exacting taxation and jurisdiction from the barangays mentioned in the Republic Act 522 in which falls under the area of the local government unit (LGU) of Bontoc."
        ],
        [
            "On June 17, 1952, the provincial board of Leyte issued the holding of a plebiscite among the villages of Pangi, Taa, Santa Cruz, Tuburan, Lawgawan and their corresponding sitios (hamlets).",
            "The purpose of such activity is to determine whether the people in these barrios would like to remain with the municipality of Sogod or with Bontoc.",
            "The plebiscite was conducted on August 1, 1952, and the results show that more votes were cast in favor of Sogod than those in favor of Bontoc."
        ],
        [
            "After seven years, the controversy was recommended by the provincial board of Leyte to Manila for the amendment of Republic Act No.",
            "522 to include the villages of Baugo, Himakilo, Esperanza, Hibagwan, Pamahawan, Mahayahay, Bunga, Dao and Maoylab to the municipal jurisdiction of Bontoc.",
            "At that time, a series of Republic Acts were approved and enacted to make sitios into barangays in the province of Leyte."
        ],
        [
            "One interesting feature of the said development is that the provincial board of Leyte recommended to Manila that the villages of Lawgawan, Taa, Tuburan, Santa Cruz and Pangi, equidistant to the poblacion of Sogod, be annexed to the municipal jurisdiction of Sogod.",
            "The proposal got the support of President Carlos Polestico Garcia and approved the move to include the newly established barangays, located in the hinterlands of Bontoc, to be part of the territorial jurisdiction of the municipality of Bontoc.",
            "After the 1959 promulgation of the Executive Order No.",
            "368, all conflicting areas between the municipalities of Sogod and Bontoc were reorganized and reevaluated.",
            "Many complaints and petitions were sent to the Provincial Board of Southern Leyte and to the Regional Trial Court (RTC) to reconcile the disputed villages to Sogod, but all were in vain."
        ],
        [
            "On July 18, 1960, the Provincial Board of Southern Leyte permanently suspends implementation of Executive Order 368.",
            "The board conducted a plebiscite in the barrios and sitios affected by Executive Order 368 and to finally settle the boundary dispute."
        ],
        [
            "On June 24, 1970, the municipality of Sogod filed Civil Case No.",
            "R-1706 for certiorari and prohibition with the Court of First Instance of Southern Leyte (now Regional Trial Court), to enjoin the provincial board and provincial governor from taking cognizance of the long pending boundary dispute between the two municipalities and to enjoin the municipality of Bontoc from exercising territorial jurisdiction over the barrios of Pangi, Taa, Casao, Santa Cruz, Tuburan and Lawgawan all allegedly belonging to the municipality of Sogod."
        ],
        [
            "On August 31, 1973, the trial court dismissed the action for lack of jurisdiction over the subject matter of the case."
        ],
        [
            "Presidente Carlos P. Garcia promulgated Executive Order No.",
            "368, which approved the recommendation of the provincial board of Leyte and reconstituted the barrios and sitiosunder the territorial dispute between the two municipalities with Granada Creek as its boundary line, on December 28, 1959."
        ],
        [
            "However, on July 14, 1960, then Executive Secretary Castillo sent a telegram to the Provincial Board of Southern Leyte which states as follows:"
        ],
        [
            "BY DIRECTION OF PRESIDENT PLEASE SUSPEND IMPLEMENTATION OF EXECUTIVE ORDER 368 SERIES 1959 RECONSTITUTION (sic) BARRIOS AND SITIOS TO COMPOSE MUNICIPALITIES OF SOGOD AND BONTOC AND READJUSTING TERRITORIES SAID MUNICIPALITIES UNTIL FURTHER ADVISE STOP TO DETERMINE TRUE WISHES OF INHABITANTS PLEASE SUPERVISE HOLDING OF PLEBISCITE IN BARRIO AND SITIOS AFFECTED ADVISING THIS OFFICE IMMEDIATELY OF RESULT."
        ],
        [
            "SEC.",
            "CASTILLO (P. 20, Rollo)"
        ],
        [
            "The Provincial Board of newly established Southern Leyte passed Resolution No.",
            "62 suspending the implementation of Executive Order 368 on July 18, 1960.",
            "The board also created a committee to conduct the holding of a plebiscite in the barrios and sitios affected by the Executive Order and to finally settle the boundary dispute."
        ],
        [
            "On June 24, 1970, the municipality of Sogod filed Civil Case No.",
            "R-1706 for certiorari and prohibition with the Court of First Instance of Southern Leyte (now Regional Trial Court ), to enjoin the provincial board and provincial governor from taking cognizance of the long pending boundary dispute between the two municipalities and to enjoin Bontoc town from exercising territorial jurisdiction over the said barrios.",
            "However, the trial court dismissed the action for lack of jurisdiction over the subject matter of the case on August 31, 1973."
        ],
        [
            "On December 17, 1973, the trial court denied petitioner’s motion for reconsideration.",
            "Hence, this petition was filed alleging that the respondent judge acted with grave abuse of discretion in dismissing the case."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sogod, Southern Leyte, Philippines"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "33(91)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "415(16.3)"
        ],
        [
            "261(10.3)"
        ],
        [
            "233(9.2)"
        ],
        [
            "68(2.7)"
        ],
        [
            "131(5.2)"
        ],
        [
            "170(6.7)"
        ],
        [
            "132(5.2)"
        ],
        [
            "234(9.2)"
        ],
        [
            "301(11.9)"
        ],
        [
            "185(7.3)"
        ],
        [
            "259(10.2)"
        ],
        [
            "242(9.5)"
        ],
        [
            "2,631(103.6)"
        ],
        [
            "Source: http://www.sunmap.eu/weather/asia/philippines/southern-leyte/sogod"
        ],
        [
            "The average climate in Sogod presents a low mean seasonality in comparison to similar climates in other parts of the world.",
            "This means that, on average, seasons (whether hot or cold or dry or wet) are not marked.",
            "The mean monthly temperature ranges from 23.6 °C to 25.4 °C and Precipitation from 147 to 351 millimeters/month."
        ],
        [
            "According to the Coronas Classification, the main climate classification system used in the Philippines, the largest part of Sogod falls under Type II, which characterized by the absence of a dry season and months with the largest rainfalls between November and January.",
            "A small part of Sogod, the western part of the province of Southern Leyte, falls under Type IV and has an even more evenly distributed rainfall throughout the year."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of SogodYearPop.±% p.a.1903 4,055—    1918 17,996+10.44%1939 28,222+2.17%1948 31,848+1.35%1960 17,716−4.77%1970 23,487+2.86%1975 24,373+0.75%1980 26,246+1.49%1990 31,342+1.79%1995 31,062−0.17%2000 37,402+4.06%2007 39,864+0.88%2010 41,411+1.40%2015 44,986+1.59%2020 47,552+1.10%Source: Philippine Statistics Authority"
        ],
        [
            "Population"
        ],
        [
            "The population of Sogod exceeded 45,000 during the 2015 Philippine National Census.",
            "Of about 3,382 inhabitants, Zone V is the most populous barangay in Sogod, followed by Zone III and Maac with the population of 1,934 inhabitants and 1,869 inhabitants, respectively.",
            "But the barangay with the lowest population is Lum-an, having a population of only 90 individuals; followed by Hindangan and Buac Daku with the population of 116 and 119."
        ],
        [
            "Pandan, Rizal, San Jose, San Miguel, San Pedro, San Roque, Tampoong and Casao and Santa Cruz in Bontoc are the immigration barangays within the poblacion.",
            "Mountain barangays such as Benit, Lum-an, Hindangan, Hipantag, Maria Plana and Santa Maria are experiencing a decline in population.",
            "Employment and livelihood lead the people from these villages to settle in the poblacion and in other urban centers in the province.",
            "The lack of road systems and infrastructures linking these villages to the town proper is one of the factors that attribute to this problem.",
            "This migratory pattern is called Rural Exodus.",
            "It is exacerbated when the population decline leads to the loss of rural services such as business enterprises and schools, which leads to greater loss of population as people leave to seek those features."
        ],
        [
            "Ethnicity and language"
        ],
        [
            "The local populace of Sogod is of Boholano and Cebuano descent with Cebuano as the major language spoken in the municipality.",
            "But most native speakers have Boholano (Bol-anon) intonation because of its proximity to Bohol province.",
            "Waray-Waray and Surigaonon are regarded as secondary languages.",
            "However, Tagalog is still the lingua franca when conversing to other ethnic groups."
        ],
        [
            "Natives also understood foreign languages such as English and Spanish."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Sogod"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  31.30"
        ],
        [
            "2009  36.83"
        ],
        [
            "2012  39.13"
        ],
        [
            "2015  35.58"
        ],
        [
            "2018  27.22"
        ],
        [
            "2021  24.68"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Gaisano Capital Sogod is the largest department store in the province."
        ],
        [
            "Major industries"
        ],
        [
            "Charcoal (Burnt Coconut shells), Abaca Fibers, Ceramics, Furnitures, Garments,Hollow Blocks, Gravel, Sand, Rice Refining, Textiles, Saw Mill"
        ],
        [
            "Major products"
        ],
        [
            "Rice, white corn, sugar cane, copra, Abaca production, root crops, bread,Coconuts, Poultry, Hog Raising, fisheries"
        ],
        [
            "At present, the municipality still relies much on the Internal Revenue Allotment (IRA) from the national government.",
            "However, it is worthwhile noting that local revenue collection has been increasing from year to year without passing a new revenue-raising ordinance.",
            "Sogod is now classified as a second class municipality."
        ],
        [
            "The total Internal Revenue Allotment (IRA) share of Sogod for the fiscal year of 2012 was ₱64,820,215.00 and ₱24,200,000.00 for the local-sourced revenues that become one of the fastest growing economies in province."
        ],
        [
            "Gaisano Capital Group, one of largest shopping mall chains in the country, opened its first branch in the province during the town’s 158th founding anniversary on June 10, 2011."
        ],
        [
            "List of banking institutions"
        ],
        [
            "Name of bank"
        ],
        [
            "Address"
        ],
        [
            "Cantilan Bank, Inc."
        ],
        [
            "Osmeña Street, Barangay Zone II"
        ],
        [
            "Landbank"
        ],
        [
            "Doctor Gonzalo Yong Bus Terminal, Barangay Zone III"
        ],
        [
            "Metrobank"
        ],
        [
            "Rizal Street, Barangay Zone IV"
        ],
        [
            "Philippine National Bank"
        ],
        [
            "Osmeña Street, Barangay Zone II"
        ],
        [
            "Rural Bank of Hindang, Inc."
        ],
        [
            "RIzal Street, Barangay Zone IV"
        ],
        [
            "United Coconut Planters Bank"
        ],
        [
            "Osmeña Street, Barangay Zone IV"
        ],
        [
            "Industry"
        ],
        [
            "Manufacturing and trade"
        ],
        [
            "The port of Sogod"
        ],
        [
            "Manufacturing is small-scale: charcoal (burnt coconut shells or uling), abaca products, ceramics, coconut oil, furniture making, hollow block making, and gravel and sand.",
            "Export products are copra, abaca, abaca handicrafts and fiber craft items."
        ],
        [
            "Minerals"
        ],
        [
            "As of 1992, the province of Southern Leyte's metallic reserves totaled 771,830 metric tons.",
            "All of the municipalities and one city in the province have mineral deposits including Sogod.",
            "The town has magnesite, gold, silver and copper deposits.",
            "However, Sogod's mountains are unexplored and the soil is not suitable for mining due to soft clay surface."
        ],
        [
            "Metalworks"
        ],
        [
            "Except for blacksmithing, work is undertaken principally in the poblacion and in the barrios of Sogod, turning out working bolos, machete and steel fabrication of window grills and other household needs; metalwork for the past years changed but the old process in molding metals are still being used.",
            "The body repairs of vehicles are carried out by small metal shops, doubling as jack-of-all-trade.",
            "Metalwork is concerned with an accessory fabrication for pump boats that abound in the town's waters and building construction where steel had replaced the disappearing wood as housing material."
        ],
        [
            "Media"
        ],
        [
            "Two provincial newspapers are circulating in the town, these are the Southern Leyte Times (English) and the Southern Leyte Balita (Cebuano).",
            "The newspapers are based in the capital city of Maasin and gives accurate and constructive news in the province of Southern Leyte and Leyte.",
            "National newspapers such as the Philippine Daily Inquirer, The Philippine Star and the Manila Bulletin have reached the town before the establishment of provincial newspaper companies."
        ],
        [
            "Radio station"
        ],
        [
            "There are two radio stations operating in Sogod: Radyo ng Bayan Sogod (DYSL-FM 104.7), a branch of the Philippine Broadcasting Service (PBS), and the Radyo Natin Sogod (DYSC 101.1 FM), one of the radio stations owned by Radyo Natin Network."
        ],
        [
            "Cable television"
        ],
        [
            "The Maasin Cable TV provides the town concessionaires with forty to fifty channels.",
            "Recently, the cable television have expanded its services in the towns of Bontoc and Libagon.",
            "Other cable operators operating in the town are Dream Satellite TV and Cignal Digital TV."
        ],
        [
            "Government"
        ],
        [
            "Municipal officials"
        ],
        [
            "The 2019 general election in the Philippines had appointed seats for the executive and legislative branches for all levels of government – national, provincial, and local, except for the barangay officials."
        ],
        [
            "With a total of 17,612 votes, Imelda Uy-Tan (LP) retains her position as the municipal mayor of Sogod against incumbent Zone III barangay chairman Nathan Abihay-Gabronino (IND), who only bagged 7,638 votes.",
            "Incumbent councilor Atty.",
            "Jose Ramil Golo (LP) also won against Greg Regis (IND), having 14,871 votes while the latter with 9,148.",
            "The Tans have been active in politics since 2004."
        ],
        [
            "Mayor"
        ],
        [
            "Imelda Uy-Tan"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Jose Ramil Golo"
        ],
        [
            "Municipal Councilor"
        ],
        [
            "Rogelyn Paranas"
        ],
        [
            "Ely Faelnar"
        ],
        [
            "Jose Autida"
        ],
        [
            "Nilo Casil"
        ],
        [
            "Tommy Dejarme"
        ],
        [
            "Ellyn Villa"
        ],
        [
            "Rufo Caindoy-Olo"
        ],
        [
            "Patrick Feliano"
        ],
        [
            "Political subdivisions"
        ],
        [
            "The newly-constructed Sogod Municipal Hall replaced the old town hall built during the Marcos regime."
        ],
        [
            "Sogod is politically subdivided into forty-five barangays; ten (10) of which compose the poblacion (town proper): Rizal, San Jose, San Pedro, San Roque, Tampoong, Zone I, Zone II, Zone III, Zone IV and Zone V."
        ],
        [
            "Sogod Municipal Trial Court alongside the municipal jail."
        ],
        [
            "Kahupian is the largest barangay in the municipality, in terms of land area.",
            "Other large villages such as San Francisco Mabuhay, Hipantag, Kauswagan, Javier, Hindangan and Magatas are only accessible by habal-habal via feeder roads (with the exception of barangay Javier, which is reachable by jeepney and motorcab plying for Libagon town)."
        ],
        [
            "Most of the smaller barangays are found in densely populated areas in the municipality, particularly in the poblacion.",
            "These barangays are Zone I, Zone II, Zone III, Zone IV and Zone V, San Jose, Rizal, Mabicay and Consolacion."
        ],
        [
            "Barangays"
        ],
        [
            "These are the subdistricts that constitute the municipality of Sogod:"
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 086417001   Benit"
        ],
        [
            " 0.1%"
        ],
        [
            " 70"
        ],
        [
            " 328"
        ],
        [
            "  ▾"
        ],
        [
            " −14.31%"
        ],
        [
            " 086417002   Buac Daku"
        ],
        [
            " 0.3%"
        ],
        [
            " 127"
        ],
        [
            " 101"
        ],
        [
            "  ▴"
        ],
        [
            " 2.32%"
        ],
        [
            " 086417003   Buac Gamay"
        ],
        [
            " 1.6%"
        ],
        [
            " 769"
        ],
        [
            " 742"
        ],
        [
            "  ▴"
        ],
        [
            " 0.36%"
        ],
        [
            " 086417004   Cabadbaran"
        ],
        [
            " 0.4%"
        ],
        [
            " 196"
        ],
        [
            " 179"
        ],
        [
            "  ▴"
        ],
        [
            " 0.91%"
        ],
        [
            " 086417006   Consolacion"
        ],
        [
            " 2.6%"
        ],
        [
            " 1,246"
        ],
        [
            " 1,161"
        ],
        [
            "  ▴"
        ],
        [
            " 0.71%"
        ],
        [
            " 086417007   Dagsa"
        ],
        [
            " 1.0%"
        ],
        [
            " 483"
        ],
        [
            " 483"
        ],
        [
            " 0.00%"
        ],
        [
            " 086417008   Hibodhibod"
        ],
        [
            " 0.9%"
        ],
        [
            " 432"
        ],
        [
            " 368"
        ],
        [
            "  ▴"
        ],
        [
            " 1.62%"
        ],
        [
            " 086417009   Hindangan"
        ],
        [
            " 0.3%"
        ],
        [
            " 123"
        ],
        [
            " 125"
        ],
        [
            "  ▾"
        ],
        [
            " −0.16%"
        ],
        [
            " 086417010   Hipantag"
        ],
        [
            " 0.7%"
        ],
        [
            " 313"
        ],
        [
            " 298"
        ],
        [
            "  ▴"
        ],
        [
            " 0.49%"
        ],
        [
            " 086417005   Inmaculada Concepcion (Concepcion I)"
        ],
        [
            " 2.6%"
        ],
        [
            " 1,246"
        ],
        [
            " 1,179"
        ],
        [
            "  ▴"
        ],
        [
            " 0.55%"
        ],
        [
            " 086417011   Javier"
        ],
        [
            " 1.6%"
        ],
        [
            " 762"
        ],
        [
            " 721"
        ],
        [
            "  ▴"
        ],
        [
            " 0.55%"
        ],
        [
            " 086417012   Kahupian"
        ],
        [
            " 3.1%"
        ],
        [
            " 1,456"
        ],
        [
            " 1,363"
        ],
        [
            "  ▴"
        ],
        [
            " 0.66%"
        ],
        [
            " 086417013   Kanangkaan"
        ],
        [
            " 0.7%"
        ],
        [
            " 351"
        ],
        [
            " 309"
        ],
        [
            "  ▴"
        ],
        [
            " 1.28%"
        ],
        [
            " 071247013   Kauswagan"
        ],
        [
            " 0.8%"
        ],
        [
            " 365"
        ],
        [
            " 321"
        ],
        [
            "  ▴"
        ],
        [
            " 1.29%"
        ],
        [
            " 071247014   La Purisima Concepcion (Concepcion II)"
        ],
        [
            " 2.4%"
        ],
        [
            " 1,153"
        ],
        [
            " 1,075"
        ],
        [
            "  ▴"
        ],
        [
            " 0.70%"
        ],
        [
            " 071247015   Libas"
        ],
        [
            " 3.9%"
        ],
        [
            " 1,876"
        ],
        [
            " 1,865"
        ],
        [
            "  ▴"
        ],
        [
            " 0.06%"
        ],
        [
            " 071247016   Lum-an"
        ],
        [
            " 0.3%"
        ],
        [
            " 143"
        ],
        [
            " 127"
        ],
        [
            "  ▴"
        ],
        [
            " 1.19%"
        ],
        [
            " 071247017   Maac"
        ],
        [
            " 3.8%"
        ],
        [
            " 1,811"
        ],
        [
            " 1,788"
        ],
        [
            "  ▴"
        ],
        [
            " 0.13%"
        ],
        [
            " 071247018   Mabicay"
        ],
        [
            " 1.7%"
        ],
        [
            " 822"
        ],
        [
            " 719"
        ],
        [
            "  ▴"
        ],
        [
            " 1.35%"
        ],
        [
            " 071247019   Magatas"
        ],
        [
            " 2.7%"
        ],
        [
            " 1,285"
        ],
        [
            " 1,139"
        ],
        [
            "  ▴"
        ],
        [
            " 1.21%"
        ],
        [
            " 071247020   Mahayahay"
        ],
        [
            " 2.1%"
        ],
        [
            " 977"
        ],
        [
            " 914"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 071247021   Malinao"
        ],
        [
            " 1.1%"
        ],
        [
            " 503"
        ],
        [
            " 497"
        ],
        [
            "  ▴"
        ],
        [
            " 0.12%"
        ],
        [
            " 071247022   Maria Plana"
        ],
        [
            " 0.5%"
        ],
        [
            " 236"
        ],
        [
            " 234"
        ],
        [
            "  ▴"
        ],
        [
            " 0.09%"
        ],
        [
            " 071247023   Milagroso"
        ],
        [
            " 1.5%"
        ],
        [
            " 700"
        ],
        [
            " 657"
        ],
        [
            "  ▴"
        ],
        [
            " 0.64%"
        ],
        [
            " 071247024   Olisihan"
        ],
        [
            " 1.1%"
        ],
        [
            " 540"
        ],
        [
            " 440"
        ],
        [
            "  ▴"
        ],
        [
            " 2.07%"
        ],
        [
            " 071247025   Pancho Villa"
        ],
        [
            " 2.2%"
        ],
        [
            " 1,065"
        ],
        [
            " 1,030"
        ],
        [
            "  ▴"
        ],
        [
            " 0.33%"
        ],
        [
            " 071247026   Pandan"
        ],
        [
            " 3.0%"
        ],
        [
            " 1,412"
        ],
        [
            " 1,182"
        ],
        [
            "  ▴"
        ],
        [
            " 1.79%"
        ],
        [
            " 071247027   Rizal (Poblacion)"
        ],
        [
            " 4.3%"
        ],
        [
            " 2,028"
        ],
        [
            " 1,531"
        ],
        [
            "  ▴"
        ],
        [
            " 2.85%"
        ],
        [
            " 071247028   Salvacion"
        ],
        [
            " 1.6%"
        ],
        [
            " 781"
        ],
        [
            " 710"
        ],
        [
            "  ▴"
        ],
        [
            " 0.96%"
        ],
        [
            " 071247029   San Francisco Mabuhay"
        ],
        [
            " 1.0%"
        ],
        [
            " 467"
        ],
        [
            " 437"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 071247030   San Isidro (Malupao)"
        ],
        [
            " 2.3%"
        ],
        [
            " 1,098"
        ],
        [
            " 1,030"
        ],
        [
            "  ▴"
        ],
        [
            " 0.64%"
        ],
        [
            " 071247031   San Jose (Poblacion)"
        ],
        [
            " 3.1%"
        ],
        [
            " 1,483"
        ],
        [
            " 1,326"
        ],
        [
            "  ▴"
        ],
        [
            " 1.13%"
        ],
        [
            " 071247032   San Juan (Agta)"
        ],
        [
            " 1.5%"
        ],
        [
            " 720"
        ],
        [
            " 668"
        ],
        [
            "  ▴"
        ],
        [
            " 0.75%"
        ],
        [
            " 071247033   San Miguel (Batang)"
        ],
        [
            " 3.3%"
        ],
        [
            " 1,586"
        ],
        [
            " 1,269"
        ],
        [
            "  ▴"
        ],
        [
            " 2.25%"
        ],
        [
            " 071247034   San Pedro (Poblacion; Hipgasan)"
        ],
        [
            " 3.9%"
        ],
        [
            " 1,867"
        ],
        [
            " 1,707"
        ],
        [
            "  ▴"
        ],
        [
            " 0.90%"
        ],
        [
            " 071247034   San Roque (Poblacion; Maylag)"
        ],
        [
            " 3.6%"
        ],
        [
            " 1,717"
        ],
        [
            " 1,528"
        ],
        [
            "  ▴"
        ],
        [
            " 1.17%"
        ],
        [
            " 071247034   San Vicente"
        ],
        [
            " 0.4%"
        ],
        [
            " 204"
        ],
        [
            " 189"
        ],
        [
            "  ▴"
        ],
        [
            " 0.77%"
        ],
        [
            " 071247034   Santa Maria"
        ],
        [
            " 0.5%"
        ],
        [
            " 217"
        ],
        [
            " 209"
        ],
        [
            "  ▴"
        ],
        [
            " 0.38%"
        ],
        [
            " 071247034   Suba"
        ],
        [
            " 2.6%"
        ],
        [
            " 1,216"
        ],
        [
            " 1,031"
        ],
        [
            "  ▴"
        ],
        [
            " 1.66%"
        ],
        [
            " 071247034   Tampoong (Poblacion)"
        ],
        [
            " 4.2%"
        ],
        [
            " 1,989"
        ],
        [
            " 1,622"
        ],
        [
            "  ▴"
        ],
        [
            " 2.06%"
        ],
        [
            " 071247034   Zone I (Poblacion; San Antonio)"
        ],
        [
            " 3.3%"
        ],
        [
            " 1,567"
        ],
        [
            " 1,531"
        ],
        [
            "  ▴"
        ],
        [
            " 0.23%"
        ],
        [
            " 071247034   Zone II (Poblacion; Kalanggaman)"
        ],
        [
            " 1.8%"
        ],
        [
            " 857"
        ],
        [
            " 821"
        ],
        [
            "  ▴"
        ],
        [
            " 0.43%"
        ],
        [
            " 071247034   Zone III (Poblacion; San Lorenzo Ruiz)"
        ],
        [
            " 5.0%"
        ],
        [
            " 2,359"
        ],
        [
            " 2,138"
        ],
        [
            "  ▴"
        ],
        [
            " 0.99%"
        ],
        [
            " 071247034   Zone IV (Poblacion)"
        ],
        [
            " 1.0%"
        ],
        [
            " 470"
        ],
        [
            " 462"
        ],
        [
            "  ▴"
        ],
        [
            " 0.17%"
        ],
        [
            " 071247034   Zone V (Poblacion)"
        ],
        [
            " 8.2%"
        ],
        [
            " 3,902"
        ],
        [
            " 3,536"
        ],
        [
            "  ▴"
        ],
        [
            " 0.99%"
        ],
        [
            "Total"
        ],
        [
            "47,552"
        ],
        [
            "41,411"
        ],
        [
            " ▴"
        ],
        [
            "1.39%"
        ],
        [
            "Religion"
        ],
        [
            "Religions in Sogod"
        ],
        [
            "Roman Catholicism"
        ],
        [
            "93%"
        ],
        [
            "Protestantism"
        ],
        [
            "6.6%"
        ],
        [
            "Islam"
        ],
        [
            "0.4%"
        ],
        [
            "The Most Reverend Precioso D. Cantillas, SDB, DD (left), bishop of the Roman Catholic Diocese of Maasin, and Monsignor Nestor Astillo, PC (right), parish priest of the Immaculate Conception Parish Church of Sogod, presided the Pontifical Mass for the annual town fiesta last December 15, 2013."
        ],
        [
            "The Holy Child Parish Church in barangay Consolacion."
        ],
        [
            "The majority of the population of Sogod belongs to the Roman Catholic Church, with a percentage of about 93%.",
            "Other Christian sects such as the Seventh-day Adventist Church, United Church of Christ in the Philippines (UCCP), Iglesia ni Cristo (INC), The Church of Jesus Christ of Latter-day Saints (Mormons), Members Church of God International, Filipino Crusaders World Army (Moncados), Sogod Fundamental Baptist Church, Jehovah’s Witnesses, Christian and Missionary Alliance Churches of the Philippines (CAMACOP)-Sogod Alliance Church, Assemblies of God and among others, formed the remaining 7% of the census.",
            "Considered as one of the largest churches in the province, the Immaculate Conception Parish in barangay Rizal falls under the jurisdiction of the Roman Catholic Diocese of Maasin."
        ],
        [
            "Roman Catholicism in Sogod"
        ],
        [
            "See also: Roman Catholic Diocese of Maasin"
        ],
        [
            "The Roman Catholic Church is a deeply rooted institution in Sogod introduced and preached by the Jesuit missionaries in the early 1600s.",
            "Eventually, the town as made an independent parish through an episcopal decree on April 8, 1869 and was canonically approved by January 1924.",
            "Since 1967, the church in Sogod is divided into two parishes, namely:"
        ],
        [
            "Holy Child Parish, barangay Consolacion"
        ],
        [
            "Immaculate Conception of the Blessed Virgin Mary Parish, barangay Rizal"
        ],
        [
            "Presently, the town is the seat of the Vicariate of the Immaculate Conception, which is composed of six parishes."
        ],
        [
            "Holy Child Parish"
        ],
        [
            "According to a 2008 parish-wide census, the Holy Child Parish of barangay Consolacion, Sogod has a total population of 12,261 inhabitants.",
            "The recorded Catholic population in the parish exceeds to 10,658 individuals.",
            "The remaining 1,603 individuals belong to other mainline Protestant denominations."
        ],
        [
            "Barangay Consolacion was established as an ecclesiastical district in 1967 by Bishop Teotimo Pacis, diocese of Palo.",
            "At present, the parish has maintained a number of mandated religious organizations which are active in the various fields of church apostolates, namely: Catholic Women's League, Legion of Mary, Catholic Charismatic Renewal Movement, and cofradias (confraternities) like the Birhen sa Lourdes (Our Lady of Lourdes), Sagrada Corazon (Sacred Heart), Inahan sa Kanunayng Panabang (Our Lady of Perpetual Help), San Jose (Saint Joseph) and San Antonio (Saint Anthony of Padua).",
            "Other organizations are the Knights of the Santo Niño (established by Father Oliver Edulan), Lay Ministers, Catechists, Catholic Faith Lay Apostolic Movement of the Philippines (CF-LAMP), Parish Emergency Action Team and the Knights of the Altar (KOA)."
        ],
        [
            "From September 1992 to March 1993, the parish launched an intensive doctrinal and spiritual formation program through the Catholic Faith Lay Apostolic Movement of the Philippines (CF-LAMP), a local group tasked of defending the Catholic faith from proselytizing sects.",
            "This program has brought about remarkable conversations especially among the nominal and indifferent Catholics that the effects have been dubbed balik-Simbahan.",
            "One of the fruits of this program is that the barrio faithful have also embarked on renovations and extensions of their respective chapels."
        ],
        [
            "List of parish priests serving the Holy Child Parish from 1967 until present"
        ],
        [
            "Period of tenure"
        ],
        [
            "Parish priest"
        ],
        [
            "1967–1968; June – July 1969"
        ],
        [
            "Father Gregorio Florendo"
        ],
        [
            "April – June 1969"
        ],
        [
            "Father Dominador Sudario"
        ],
        [
            "1969–1971"
        ],
        [
            "Father Crutato Arceño"
        ],
        [
            "1971–1973"
        ],
        [
            "Father Vicente Lora"
        ],
        [
            "1973–1976"
        ],
        [
            "Father Nestor Sarvida Astillo"
        ],
        [
            "1976–1977"
        ],
        [
            "Father Patrick Kelly, SFM"
        ],
        [
            "1977–1979"
        ],
        [
            "Father Amado Ducot Olayvar"
        ],
        [
            "1979–1981"
        ],
        [
            "Father Celso Sanchez Rojas"
        ],
        [
            "1981–1982"
        ],
        [
            "Father Wilson Rosios De los Reyes"
        ],
        [
            "1983–1984"
        ],
        [
            "Father Urcisino Luzon"
        ],
        [
            "1984–1986"
        ],
        [
            "Father Marianito Tandoc Dondoyano"
        ],
        [
            "1986–1988"
        ],
        [
            "Father Prospero Paz Pael"
        ],
        [
            "1988–1992"
        ],
        [
            "Father Oliver Cornejo Edulan"
        ],
        [
            "1992–1999"
        ],
        [
            "Father Santos Sabondo Jr."
        ],
        [
            "1999 – April 2005"
        ],
        [
            "Father Dioscoro Aporador Rasonabe"
        ],
        [
            "April 2005 – 2011"
        ],
        [
            "Father Norberto Piao Cordoves"
        ],
        [
            "May 9, 2011 – March 2014"
        ],
        [
            "Father Jose Bonito de la Victoria Labrador"
        ],
        [
            "March 23, 2014 – present"
        ],
        [
            "Father Ronaldo Doguiles Lago"
        ],
        [
            "List of Basic Ecclesial Community"
        ],
        [
            "Barangay"
        ],
        [
            "Patron Saint"
        ],
        [
            "Feast Day"
        ],
        [
            "Buac Daku"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 8"
        ],
        [
            "Buac Gamay"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 16"
        ],
        [
            "Concepcion"
        ],
        [
            "Immaculate Conception of the Blessed Virgin Mary"
        ],
        [
            "December 8"
        ],
        [
            "Consolacion"
        ],
        [
            "Holy Child Jesus"
        ],
        [
            "Last Saturday of January"
        ],
        [
            "Hubasan (San Juan)"
        ],
        [
            "Saint Peter the Apostle"
        ],
        [
            "June 28"
        ],
        [
            "Javier"
        ],
        [
            "Saint Peter the Apostle"
        ],
        [
            "June 27"
        ],
        [
            "Kanangkaan"
        ],
        [
            "Saint Augustine of Hippo"
        ],
        [
            "August 28"
        ],
        [
            "La Purisima Concepcion"
        ],
        [
            "Immaculate Conception of the Blessed Virgin Mary"
        ],
        [
            "December 8"
        ],
        [
            "Liberty (Maac)"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 15"
        ],
        [
            "Maac"
        ],
        [
            "Christ the King"
        ],
        [
            "October 31"
        ],
        [
            "Mahayahay"
        ],
        [
            "Holy Child Jesus"
        ],
        [
            "January 15"
        ],
        [
            "Malinao"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 12"
        ],
        [
            "Maria Plana"
        ],
        [
            "Holy Child Jesus"
        ],
        [
            "January 18"
        ],
        [
            "Olisihan"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 15"
        ],
        [
            "Salvacion"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 25"
        ],
        [
            "San Juan"
        ],
        [
            "Saint John the Baptizer"
        ],
        [
            "June 24"
        ],
        [
            "San Vicente"
        ],
        [
            "Saint Vincent Ferrer"
        ],
        [
            "April 28"
        ],
        [
            "Suba"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 15"
        ],
        [
            "Our Lady of Immaculate Conception Parish of Sogod"
        ],
        [
            "The newly-renovated facade of the Immaculate Conception Parish Church."
        ],
        [
            "The Immaculate Conception Shrine, which stood beside the parish rectory, was recently demolished to give way for the construction of a multi-purpose covered court that would house civil and religious activities in the town.",
            "It was a project earmarked by the former parish priest, now deceased Monsignor Felix Paloma, PC"
        ],
        [
            "The statue of the revered patroness of the town, the Immaculate Conception, is displayed in the church sanctuary during the town fiesta, which falls every December 14 and 15."
        ],
        [
            "According to a 2016 parish-wide census, the Immaculate Conception parish of Sogod has a total land area of 145.27 square miles.",
            "With a total population of 31,148 inhabitants, the recorded Catholic population in the parish exceeds to 27,449 individuals.",
            "The remaining 3,699 individuals belong to Islam and other mainline Protestant denominations.",
            "A proposed mission station, dedicated to Saint Lorenzo Ruiz, will be established at barangay Libas this 2018 to cater the pastoral and spiritual needs of the western villages of the town."
        ],
        [
            "Aptly chosen as the patroness of the municipality as well by the community, the Immaculate Conception of Mary Parish of Sogod is the mother-parish of the ecclesiastical districts of barangay Divisoria, Bontoc  (1995), Bontoc (1957), barangay Consolacion, Sogod (1967) and Libagon (1869/ reestablished in 1924)."
        ],
        [
            "The church structure was once constructed in barangay Zone III, made out of light materials during the time of Father Tomas Logroño.",
            "It remained there until the early 1930s, until it was moved to the new town hall site in barangay Zone I.",
            "Old parishioners recall that the building was made out of hardwood.",
            "Around the 1960s, a lot was donated in barangay Rizal for the construction of a concrete edifice, which is now the present church and rectory of Sogod."
        ],
        [
            "List of parish priests serving the Immaculate Conception Parish from 1869 until present"
        ],
        [
            "Period of Tenure"
        ],
        [
            "Pastor"
        ],
        [
            "c. 1603"
        ],
        [
            "Father Fabrizio Sersali, SJ"
        ],
        [
            "c. 1603"
        ],
        [
            "Father Cristobal Jimenez, SJ"
        ],
        [
            "c. 1632"
        ],
        [
            "Father Ventura Barcena, SJ"
        ],
        [
            "c. 1634"
        ],
        [
            "Father Juan Francisco de Luzon, SJ"
        ],
        [
            "c. 1643"
        ],
        [
            "Father Juan del Carpio, SJ"
        ],
        [
            "c. 1643"
        ],
        [
            "Father Juan Bautista Laviarri, SJ"
        ],
        [
            "c. 1643"
        ],
        [
            "Father Antonio de Abarca, SJ"
        ],
        [
            "c. 1660s"
        ],
        [
            "Father Pedro Oriol, SJ"
        ],
        [
            "c. 1700"
        ],
        [
            "Father Miguel Pozo, SJ"
        ],
        [
            "c. 1703"
        ],
        [
            "Father Vicente Alsina, SJ"
        ],
        [
            "c. 1711"
        ],
        [
            "Father Constantino Carreras, SJ"
        ],
        [
            "c. 1714"
        ],
        [
            "Father Jose Labrada, SJ"
        ],
        [
            "c. 1723"
        ],
        [
            "Father Jose Ramirez, SJ"
        ],
        [
            "c. 1735"
        ],
        [
            "Father Francisco Javier Pecthl, SJ"
        ],
        [
            "c. 1751"
        ],
        [
            "Father Ignacio Descallar, SJ"
        ],
        [
            "c. 1768"
        ],
        [
            "Father Joaquin Romeo, SJ"
        ],
        [
            "c. 1775 – 1778"
        ],
        [
            "Father Tomas Sanchez, OSA"
        ],
        [
            "c. 1785"
        ],
        [
            "Father Vicente Rodriguez, OSA"
        ],
        [
            "c. 1850s"
        ],
        [
            "Father Francisco Fernandez"
        ],
        [
            "c. 1850s"
        ],
        [
            "Father Mamerto Balit"
        ],
        [
            "June 1869 – April 1882"
        ],
        [
            "Father Tomas Logroño"
        ],
        [
            "April 1882 – November 1902"
        ],
        [
            "Father Ramon Abarca"
        ],
        [
            "November 1902 – December 1903"
        ],
        [
            "Father Domingo Javier"
        ],
        [
            "December 1903 – June 1908"
        ],
        [
            "Father Diego Paras"
        ],
        [
            "June 1908 – December 1910"
        ],
        [
            "Father Pelagio Aviles"
        ],
        [
            "December 1910 – February 1916"
        ],
        [
            "Father Segundo Espiritu"
        ],
        [
            "March 1916 – June 1921"
        ],
        [
            "Father Pablo Cui"
        ],
        [
            "January 1924 – June 1925"
        ],
        [
            "Father Januario Cordobes"
        ],
        [
            "July 1925 – December 1925"
        ],
        [
            "Father Francisco Sacro"
        ],
        [
            "December 1925 – July 1926"
        ],
        [
            "Father Pedro Morfe"
        ],
        [
            "July 1926 – October 1933"
        ],
        [
            "Father Abino B. Abrera"
        ],
        [
            "October 1933 – November 1933"
        ],
        [
            "Father Januario Cordobes"
        ],
        [
            "November 1933 – March 1944"
        ],
        [
            "Father Pedro Aruta"
        ],
        [
            "April 1944 – April 1957"
        ],
        [
            "Father Luis Diaz Caintic"
        ],
        [
            "1953"
        ],
        [
            "Father Generoso Nielo"
        ],
        [
            "August 1957 – November 1957"
        ],
        [
            "Father John Li"
        ],
        [
            "November 1957 – April 1961"
        ],
        [
            "Father Sergio Osmeña"
        ],
        [
            "September 1958 – April 1961"
        ],
        [
            "Father Juan Gaborni"
        ],
        [
            "May 1961 – May 1963"
        ],
        [
            "Father Licerio S. Oledan"
        ],
        [
            "May 1963 – April 1972"
        ],
        [
            "Father Porfirio Paulo Suarez"
        ],
        [
            "April 1972 – May 1981"
        ],
        [
            "Father Vicente Salas Lora"
        ],
        [
            "1980–1981"
        ],
        [
            "Father Wilson Rosios Delos Reyes"
        ],
        [
            "June 1981 – May 1986"
        ],
        [
            "Father Juanito Avestruz Arreglo"
        ],
        [
            "May 1986 – June 1986"
        ],
        [
            "Monsignor Amado Ducot Olayvar, PC"
        ],
        [
            "July 1986 – June 1992"
        ],
        [
            "Father Manuel Saz Nueve"
        ],
        [
            "June 1992 – February 1999"
        ],
        [
            "Monsignor Amado Ducot Olayvar, PC"
        ],
        [
            "June 1992 – 1993"
        ],
        [
            "Father Marnito Bitco Bansig"
        ],
        [
            "June 1993 (?)"
        ],
        [
            "Father Conrado Cervantes Saavedra Jr."
        ],
        [
            "1994–1995"
        ],
        [
            "Father Cruf Fernandez Climaco"
        ],
        [
            "1996–1997"
        ],
        [
            "Father Norberto Piao Cordovez"
        ],
        [
            "April 1998 – 1999"
        ],
        [
            "Father Melgabar Necio Enero"
        ],
        [
            "February 1999 – 2000"
        ],
        [
            "Father Jose Bonito de la Victoria Labrador"
        ],
        [
            "January 2000 – October 2002"
        ],
        [
            "Father Benedicto L. Lambonao"
        ],
        [
            "February 1999 – May 2004"
        ],
        [
            "Father Lorenzo Suarez"
        ],
        [
            "2001–2003"
        ],
        [
            "Father Remigio Mollaneda, SVD"
        ],
        [
            "November 2002 – April 2005 (parochial vicar) and 2005–2012 (resident priest)"
        ],
        [
            "Father Merwin Labastida Kangleon"
        ],
        [
            "September 2004 – April 2005"
        ],
        [
            "Father Leonardo Galozo Kilat"
        ],
        [
            "April 2005 – 2011"
        ],
        [
            "Monsignor Felix Dayola Paloma, PC"
        ],
        [
            "April 2005 – 2011"
        ],
        [
            "Father Pablo Felicilda Acedo"
        ],
        [
            "April 2005 – August 2005"
        ],
        [
            "Father Clyve Alvyn N. Ocon"
        ],
        [
            "October 2005 – May 2006"
        ],
        [
            "Father Wonderly Jay Valdez Madrona"
        ],
        [
            "2010"
        ],
        [
            "Father Wilson Rosios De los Reyes"
        ],
        [
            "May 8, 2011 – November 2018"
        ],
        [
            "Monsignor Nestor Sarvida Astillo, PC"
        ],
        [
            "May 9, 2011 – July 2011"
        ],
        [
            "Father Carlo Joven Caracut"
        ],
        [
            "May 9, 2011 – July 2011"
        ],
        [
            "Father Wilson Rosios De los Reyes"
        ],
        [
            "May 9, 2011 – August 2011"
        ],
        [
            "Father Roy Jarabe Royeras"
        ],
        [
            "September 2011 – November 2018"
        ],
        [
            "Father Pepito Pusa Generan"
        ],
        [
            "2014 – November 2018"
        ],
        [
            "Father Merwin Labastida Kangleon"
        ],
        [
            "October 2014 – August 2016"
        ],
        [
            "Father Ikenna Sabinnus Chukwonyonyerem"
        ],
        [
            "November 2016 – November 15, 2017"
        ],
        [
            "Father Ernesto Banal Sabandal IV"
        ],
        [
            "November 18, 2017 – present"
        ],
        [
            "Father Brian Compendio Flandez"
        ],
        [
            "List of Basic Ecclesial Community"
        ],
        [
            "The Immaculate Conception Parish of Sogod has a total number of forty-seven (47) BEC chapels, fifteen (15) of which are sitios.",
            "Recently, the chapel community of sitio Layog, barangay Benit, has been merged with the mother chapel, Benit, due to the land condition of the hamlet:"
        ],
        [
            "Barangay"
        ],
        [
            "Patron Saint"
        ],
        [
            "Feast Day"
        ],
        [
            "Balintulay (Kahupian)"
        ],
        [
            "Immaculate Conception of the Blessed Virgin Mary"
        ],
        [
            "December 6"
        ],
        [
            "Benit"
        ],
        [
            "Our Lady of Perpetual Help"
        ],
        [
            "June 27"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 5"
        ],
        [
            "Casao, Bontoc town"
        ],
        [
            "Holy Cross"
        ],
        [
            "May 20"
        ],
        [
            "Catubig Village (Zone III)"
        ],
        [
            "Saint John the Baptizer"
        ],
        [
            "June 24"
        ],
        [
            "Curva (Dagsa)"
        ],
        [
            "Holy Cross / Saint Isidore the Laborer"
        ],
        [
            "May 19"
        ],
        [
            "Dagsa"
        ],
        [
            "Saint Joseph"
        ],
        [
            "March 19"
        ],
        [
            "Dampoy (Pancho Villa)"
        ],
        [
            "Saint Augustine of Hippo"
        ],
        [
            "August 28"
        ],
        [
            "Hagna (Kahupian)"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 20"
        ],
        [
            "Hibod-Hibod"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 22"
        ],
        [
            "Hindangan"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 25"
        ],
        [
            "Hipantag"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 15"
        ],
        [
            "Hon-ob (San Francisco Mabuhay)"
        ],
        [
            "Saint Roch"
        ],
        [
            "August 15"
        ],
        [
            "Kabernal (Kahupian)"
        ],
        [
            "Kahupian"
        ],
        [
            "Our Lady of Perpetual Help"
        ],
        [
            "June 26"
        ],
        [
            "Kauswagan"
        ],
        [
            "Saint Vincent Ferrer"
        ],
        [
            "Last Saturday of April"
        ],
        [
            "Lawgawan, Bontoc town"
        ],
        [
            "Holy Child Jesus"
        ],
        [
            "January 21"
        ],
        [
            "Layog (Benit)"
        ],
        [
            "Our Lady of Perpetual Help"
        ],
        [
            "June 27"
        ],
        [
            "Libas"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 16"
        ],
        [
            "Lubong Sapa (Kahupian)"
        ],
        [
            "Holy Child Jesus"
        ],
        [
            "January"
        ],
        [
            "Lum-an"
        ],
        [
            "Holy Child Jesus"
        ],
        [
            "January 20"
        ],
        [
            "Mabicay"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 15"
        ],
        [
            "Magatas"
        ],
        [
            "Saint Philomena"
        ],
        [
            "August 11"
        ],
        [
            "Matalwa (San Miguel)"
        ],
        [
            "Holy Cross"
        ],
        [
            "May 17"
        ],
        [
            "Milagroso"
        ],
        [
            "Our Lady of the Most Holy Rosary"
        ],
        [
            "Third Saturday of October"
        ],
        [
            "Pancho Villa"
        ],
        [
            "Saint Augustine of Hippo"
        ],
        [
            "August 27"
        ],
        [
            "Pandan"
        ],
        [
            "Holy Child Jesus"
        ],
        [
            "Last Saturday of January"
        ],
        [
            "Pangi, Bontoc town"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 18"
        ],
        [
            "Paril (Mabicay)"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "May 21"
        ],
        [
            "Rizal"
        ],
        [
            "Holy Child Jesus"
        ],
        [
            "January 16"
        ],
        [
            "San Francisco Mabuhay"
        ],
        [
            "Saint Vincent Ferrer"
        ],
        [
            "April 25"
        ],
        [
            "San Isidro"
        ],
        [
            "Saint Isidore the Laborer"
        ],
        [
            "Last Saturday of May"
        ],
        [
            "San Jose"
        ],
        [
            "Saint Joseph"
        ],
        [
            "March 19"
        ],
        [
            "San Miguel"
        ],
        [
            "Saint Michael the Archangel"
        ],
        [
            "September 29"
        ],
        [
            "San Pedro"
        ],
        [
            "Saints Peter and Paul"
        ],
        [
            "June 29"
        ],
        [
            "San Roque"
        ],
        [
            "Saint Roch"
        ],
        [
            "August 16"
        ],
        [
            "Santa Cruz, Bontoc town"
        ],
        [
            "Holy Cross / Our Lady of the Most Holy Rosary"
        ],
        [
            "May 24"
        ],
        [
            "Santa Maria"
        ],
        [
            "Holy Child Jesus"
        ],
        [
            "Last Monday of January"
        ],
        [
            "Silao Bato (Kahupian)"
        ],
        [
            "Sacred Heart of Jesus"
        ],
        [
            "June 16"
        ],
        [
            "Ta-a, Bontoc town"
        ],
        [
            "Our Lady of the Most Holy Rosary / Sacred Heart of Jesus"
        ],
        [
            "October 7"
        ],
        [
            "Tampoong"
        ],
        [
            "Holy Cross"
        ],
        [
            "May 3"
        ],
        [
            "Tinina-an (Magatas)"
        ],
        [
            "Holy Cross"
        ],
        [
            "May 3"
        ],
        [
            "Tigao (Magatas)"
        ],
        [
            "Saint Philomena"
        ],
        [
            "August 10"
        ],
        [
            "Tuburan, Bontoc"
        ],
        [
            "Waling-Waling (San Pedro)"
        ],
        [
            "Divine Mercy"
        ],
        [
            "Divine Mercy Sunday"
        ],
        [
            "Zone I"
        ],
        [
            "Saint Anthony of Padua"
        ],
        [
            "June 13"
        ],
        [
            "Zone II"
        ],
        [
            "Saint Roch"
        ],
        [
            "August 21"
        ],
        [
            "Zone III"
        ],
        [
            "Saint Lorenzo Ruiz"
        ],
        [
            "September 28"
        ],
        [
            "Zone IV"
        ],
        [
            "Our Lady of the Most Holy Rosary"
        ],
        [
            "Third Saturday of October"
        ],
        [
            "Zone V"
        ],
        [
            "Our Lady of Light"
        ],
        [
            "September 8"
        ],
        [
            "Education"
        ],
        [
            "Statistics on Education"
        ],
        [
            "Literacy Rate"
        ],
        [
            "98%"
        ],
        [
            "Pre-Elementary :"
        ],
        [
            "Public: 28Private: 6"
        ],
        [
            "Elementary :"
        ],
        [
            "Public: 28Private: 7"
        ],
        [
            "Secondary :"
        ],
        [
            "Public: 3Private: 1"
        ],
        [
            "Tertiary :"
        ],
        [
            "Public: 1Private: 2"
        ],
        [
            "The municipality of Sogod is divided into two school districts: Sogod (Sogod Central School) as the center of the west district and barangay Consolacion (Consolacion Elementary School) as the center of the east district."
        ],
        [
            "Formerly known as the Southern Leyte State College of Science and Technology  was converted through the passage of Republic Act No.",
            "9261 on March 7, 2004.",
            "The institution is the only state university in the province of Southern Leyte, located at barangay San Roque."
        ],
        [
            "Secondary education in the town are provided by four high schools: three National High Schools and a high school administered by the Roman Catholic Diocese of Maasin.",
            "Last 2014, Representative Damian G. Mercado filed two house bills, namely: House Bill No.",
            "1743 and House Bill No.",
            "1739, establishing National Vocational High Schools in the barangays of Kahupian and San Isidro.",
            "Students from the northern barangays of Benit, Hibod-hibod, Hipantag, Kahupian, Magatas, Pancho Villa, San Isidro, San Juan, San Francisco Mabuhay, San Isidro, San Vicente and Suba would travel to the poblacion or to barangay Polahongon in Mahaplag for basic High School education.",
            "The House Bills are now pending for approbation in the Congress."
        ],
        [
            "Tertiary Education is being concentrated in four colleges in the poblacion with Ormoc City Institute of Technology as the latest addition to the town’s educational facilities."
        ],
        [
            "List of elementary schools"
        ],
        [
            "Name of school"
        ],
        [
            "Address"
        ],
        [
            "Benit Primary School"
        ],
        [
            "Barangay Benit"
        ],
        [
            "Buac Adventist Elementary School"
        ],
        [
            "Barangay Buac Gamay"
        ],
        [
            "Buac Elementary School"
        ],
        [
            "Barangay Buac Gamay"
        ],
        [
            "Cabadbaran Primary School"
        ],
        [
            "Barangay Cabadbaran"
        ],
        [
            "Concepcion Elementary School"
        ],
        [
            "Barangay Concepcion"
        ],
        [
            "Creative Minds Leaning Center"
        ],
        [
            "Barangay Rizal"
        ],
        [
            "Consolacion Elementary School"
        ],
        [
            "Barangay Salvacion"
        ],
        [
            "Dagsa Primary School"
        ],
        [
            "Barangay Dagsa"
        ],
        [
            "Grace Baptist School of Sogod (GCS)"
        ],
        [
            "Tranquilino Dagohoy Street, Barangay Zone I (Poblacion)"
        ],
        [
            "Hindangan Primary School"
        ],
        [
            "Barangay Hindangan"
        ],
        [
            "Hipantag Primary School"
        ],
        [
            "Barangay Hipantag"
        ],
        [
            "Kahupian Elementary School"
        ],
        [
            "National Highway, Barangay Kahupian"
        ],
        [
            "Kanangkaan Elementary School"
        ],
        [
            "Barangay Kanangkaan"
        ],
        [
            "Kauswagan Primary School"
        ],
        [
            "Barangay Kauswagan"
        ],
        [
            "Libas Elementary School"
        ],
        [
            "Barangay Libas"
        ],
        [
            "Lum-an Primary School"
        ],
        [
            "Barangay Lum-an"
        ],
        [
            "Maac Elementary School"
        ],
        [
            "Barangay Maac"
        ],
        [
            "Magatas Elementary School"
        ],
        [
            "Barangay Magatas"
        ],
        [
            "Marianne Learning Center (Primary)"
        ],
        [
            "G. Ruiz Street, Barangay San Jose (Poblacion)"
        ],
        [
            "Merryhills Academy of Sogod (Primary)"
        ],
        [
            "Veloso Street, Barangay Rizal (Poblacion)"
        ],
        [
            "Milagroso Elementary School"
        ],
        [
            "Barangay Milagroso"
        ],
        [
            "Olisihan Elementary School"
        ],
        [
            "National Highway, Barangay Olisihan"
        ],
        [
            "Our Lady of Consolation Kindergarten School"
        ],
        [
            "Barangay Consolacion"
        ],
        [
            "Pancho Villa Elementary School"
        ],
        [
            "National Highway, Barangay Pancho Villa"
        ],
        [
            "Pandan – San Miguel Elementary School"
        ],
        [
            "National Highway, Barangay San Miguel"
        ],
        [
            "Rizal Primary School"
        ],
        [
            "Barangay Rizal"
        ],
        [
            "Royal Waldorf School"
        ],
        [
            "Jovencio Caday Street (formerly San Antonio Street), Barangay Zone I (Poblacion)"
        ],
        [
            "San Isidro Elementary School"
        ],
        [
            "National Highway, Barangay San Isidro"
        ],
        [
            "San Juan Elementary School"
        ],
        [
            "Barangay San Juan"
        ],
        [
            "San Pedro Elementary School"
        ],
        [
            "Kangleon Drive Extension, Barangay San Pedro"
        ],
        [
            "San Vicente Primary School"
        ],
        [
            "Barangay San Vicente"
        ],
        [
            "Sogod Adventist Multigrade School"
        ],
        [
            "Barangay Rizal"
        ],
        [
            "Sogod Central School"
        ],
        [
            "Dela Plana Street, Barangay Zone I"
        ],
        [
            "Sogod Special Education Division School (SPED)"
        ],
        [
            "Flores Street, Barangay Zone I (Poblacion)"
        ],
        [
            "Saint Thomas Aquinas College (STAC)"
        ],
        [
            "Concepcion Street, Barangay Zone IV (Poblacion)"
        ],
        [
            "Suba Elementary School"
        ],
        [
            "National Highway, Barangay Suba"
        ],
        [
            "List of secondary schools"
        ],
        [
            "Name of school"
        ],
        [
            "Address"
        ],
        [
            "Consolacion National High School (CNHS)"
        ],
        [
            "National Highway, Barangay Salvacion"
        ],
        [
            "Libas National High School (LNHS)"
        ],
        [
            "Barangay Libas"
        ],
        [
            "Saint Thomas Aquinas College (STAC)"
        ],
        [
            "Concepcion Street, Barangay Zone IV (Poblacion)"
        ],
        [
            "San Isidro National High School (SINHS)"
        ],
        [
            "National Highway, Barangay San Isidro"
        ],
        [
            "Sogod National High School (SNHS)"
        ],
        [
            "Flores Street, Barangay Zone I (Poblacion)"
        ],
        [
            "List of colleges and universities"
        ],
        [
            "Name of college/university"
        ],
        [
            "Address"
        ],
        [
            "Ormoc City Institute of Technology – Sogod Branch (OCIT)"
        ],
        [
            "Rizal Street, Barangay Zone IV (Poblacion)"
        ],
        [
            "Saint Thomas Aquinas College (STAC)"
        ],
        [
            "Concepcion Street, Barangay Zone IV (Poblacion)"
        ],
        [
            "Southern Leyte State University (SLSU) Main Campus"
        ],
        [
            "Concepcion Street, Barangay San Roque (Poblacion)"
        ],
        [
            "Healthcare"
        ],
        [
            "The Sogod District Hospital is the oldest health care institution in the municipality.",
            "The construction of the hospital was envisioned through the provisions stated by the Republic Act No.",
            "2693 dated June 18, 1960."
        ],
        [
            "The planning and the implementation of health care programs in the municipality are shouldered by the Sogod Rural Health Unit (RHU).",
            "The department operates a number of Rural Health Centers (RHC), Barangay Health Stations (BHS) and one municipal-run hospital, the Sogod District Hospital (SDH), with a total bed capacity of fifty.",
            "The private sector, mostly medical practitioners from the Sogod District Hospital, operates three hospitals in Sogod.",
            "Medical clinics present in the town proper are being serviced by attending doctors from the local health department."
        ],
        [
            "List of hospitals"
        ],
        [
            "Name of hospital"
        ],
        [
            "Address"
        ],
        [
            "Christ the Healer (established in 2017)"
        ],
        [
            "Don Vicente Cariño Street, Barangay Rizal (Poblacion)"
        ],
        [
            "Consuelo K. Tan Memorial Medical Center, Inc. (established in 1960)"
        ],
        [
            "Osmeña Street, Barangay Zone II (Poblacion)"
        ],
        [
            "Corrompido Specialty Hospital (established in 1960)"
        ],
        [
            "Leopoldo Regis Street, Barangay Zone V (Poblacion)"
        ],
        [
            "Havilah Polymedic (established in 2017)"
        ],
        [
            "Bagares Extension, Barangay Zone V (Poblacion)"
        ],
        [
            "Pudpud Polyclinic and Specialty Hospital"
        ],
        [
            "National Highway, Barangay San Miguel"
        ],
        [
            "Sogod District Hospital"
        ],
        [
            "Osmeña Street, Barangay Zone I (Poblacion)"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Provincial buses, PUV's and jeepneys picks up and drops off passengers at the Sogod Bus Terminal in barangay Zone III"
        ],
        [
            "Jeepneys, habal-habals and potpots are common means of public transportation in the municipality.",
            "A converted army jeep outfitted with many decorations, jeeepneys are often used for short trips and plays an integral part of the town’s public transportation system.",
            "The following are the existing jeepney routes in town:"
        ],
        [
            "Sogod – Bato/Hilongos"
        ],
        [
            "Sogod – Maasin City"
        ],
        [
            "Sogod – Malitbog/Padre Burgos"
        ],
        [
            "Sogod – Tomas Oppus/TONC (Southern Leyte State University-Tomas Oppus)"
        ],
        [
            "Sogod – Paku"
        ],
        [
            "Sogod – Libagon"
        ],
        [
            "Sogod – Himay-angan/Liloan"
        ],
        [
            "Sogod – Saint Bernard/HinunanganHabal-habal, a motorcycle modified to seat more than six persons, is used by commuters plying for the interior and far-flung areas of the municipality.",
            "Most habal-habals terminate at:"
        ],
        [
            "Mahaplag town proper"
        ],
        [
            "Polahongon"
        ],
        [
            "Kahupian/Kabernal/Lubong Sapa/Hagna"
        ],
        [
            "San Vicente/San Juan"
        ],
        [
            "Magatas/Benit"
        ],
        [
            "Buac Gamay"
        ],
        [
            "Dagsa"
        ],
        [
            "Matalwa"
        ],
        [
            "Milagroso"
        ],
        [
            "Libas/Kauswagan/Pangi"
        ],
        [
            "Taa/Guinsangaan"
        ],
        [
            "Hilaan/Pamigsian/Beniton"
        ],
        [
            "Paku/Buenavista"
        ],
        [
            "Catmon"
        ],
        [
            "Dao/Mauylab"
        ],
        [
            "Blue Potpots thrive at Osmeña street in barangay Zone II."
        ],
        [
            "A potpot is a type of an auto rickshaw carrying nine to twelve passengers, including the driver.",
            "In Sogod, the rickshaws are classified into three color types: blue, white and red.",
            "The blue potpots roam around the vicinity of the poblacion and the barangays of Santa Cruz, Mabicay, Tampoong, San Pedro, San Roque, Rizal, Pandan and San Miguel.",
            "The white potpots cover the western areas of Sogod Bay, covering from barrio Casao, passing through Bontoc town proper and barrios Divisoria and San Vicente, to the poblacion of Tomas Oppus town.",
            "And the red potpots span the eastern section of the bay, starting from barangays San Miguel and Suba to barangay Nahulid of Libagon town."
        ],
        [
            "The town of Sogod can be reached via land, air and sea.",
            "Sogod is a three-to-six-hour-ride from Cebu City via sea travel (ships dock at the ports of Bato and Hilongos, in the province of Leyte) and a three-day drive from Manila through the Pan-Philippine Highway."
        ],
        [
            "Sogod is also accessible by air from Manila through Tacloban City’s Daniel Z. Romualdez Airport.",
            "Though heavily damaged by Typhoon Haiyan, the airport remains an important thoroughfare in travelling to other points of Eastern Visayas.",
            "From Tacloban Transport Terminal in barangay Abucay, Tacloban City, one can take a Public Utility Van (PUV) or a bus bound for Sogod.",
            "Buses from the cities of Baybay, Maasin, Ormoc and Tacloban terminate daily at the town’s Doctor Gonzalo D. Yong Jr.",
            "Bus Terminal.",
            "The town is a vital link connecting Visayas and Mindanao because of its nearness to the ports of Liloan and Benit in San Ricardo town.",
            "These seaports provide daily trips to Surigao City, the gateway of Mindanao."
        ],
        [
            "Utilities"
        ],
        [
            "Water and electricity"
        ],
        [
            "Water services are managed by the Sogod Water District (SWD), which is presently serving a total of 2,524 concessionaires throughout the town proper.",
            "The water district was created pursuant to the Presidential Decree 188 (Provincial Water Utilization Act of 1973) with the approval of the municipal government of Sogod.",
            "After the issuance of Conditional Certificate of Conformance No.",
            "188, the SWD was given authority to start its operation to supply and maintain potable water to the residents of the town.",
            "Other than the SWD, all the barangay units of Sogod manage and maintain the water services in the rural areas.",
            "Chief sources of water supply in the municipality are situated in Magaupas Spring in barangay Pandan, Banat-e Spring in barangay San Pedro and the Buac-Malinao Reservoir in barangay Malinao."
        ],
        [
            "Electricity in Sogod is powered by the Southern Leyte Electric Cooperative (SoLeCo), the only electric power distributor in Southern Leyte.",
            "Created under Presidential Decree 269 as a non-stock and non-profit, service oriented cooperative for the purpose of supplying electricity in an area coverage basis, the SOLECO began its operation on December 1, 1975.",
            "Electrification efforts in the province was first launched in the towns of Macrohon and Padre Burgos (February 15, 1976), Malitbog (August 2, 1976), Tomas Oppus (January 11, 1977), Bontoc (May 10, 1977) and Sogod (December 26, 1977).",
            "The second phase of the electrification started only after the electric company signed into a contract with Engineering and Development Corporation of the Philippines (EDCOP) for the latter's architecture and engineering services in the survey and design of the expansion in Libagon, the Pacific area and Panaon island in 1979."
        ],
        [
            "Communications"
        ],
        [
            "Telecommunication facilities, broadband and wireless internet connections are provided by Globe Telecoms, Smart Communications and Sun Cellular."
        ],
        [
            "Tourism"
        ],
        [
            "The pebble beaches in barangay San Jose."
        ],
        [
            "The Gerona Farm in barangay Buac Gamay owned by the Gerona Family."
        ],
        [
            "A stalagmite adorned the entrance of a cavern in Magsuhot Park in barangay Mahayahay."
        ],
        [
            "The main attraction of the town is the Agas-Agas Bridge, the country’s tallest viaduct.",
            "Other sites found in the municipality are the Banat-e Spring of barangay San Pedro, the CTL Farms in barangay Concepcion, Dagsa-Pasanon Falls in barangay Dagsa, the Lanao Spring in barangay San Juan, the Calvary Trail of barangays San Roque and Milagroso, the mighty Subangdaku River in the barangays of Suba and San Miguel, the Buac-Malinao Reservoir of barangay Malinao, La Caridad Farms in barangay Buac Gamay, Labong Cave in barangay Javier, the Magapso Fish and Marine Sanctuary of barangay Maac, the Manubsuab Falls in barangay Kanangkaan, the Bagacay Beach of barangay Consolacion and the Prima, Cabadoy and Palanca Pebble Beaches in barangay San Jose.",
            "Inns and hotel accommodations are concentrated in the poblacion."
        ],
        [
            "Agas-Agas Bridge and Adventure Park"
        ],
        [
            "Main article: Agas-Agas Bridge"
        ],
        [
            "The Agas-Agas Bridge zipline or what they call \"Zipline Leyte\" is a twin zip line and one of the longest in the country gliding diagonally above the bridge and the riverine below it."
        ],
        [
            "Cainting Cave and Falls"
        ],
        [
            "Cainting Cave and Falls has been discovered in 2003 by foreign visitors trailing in the northern mountainous area of the town.",
            "Undisturbed by human activities, the cave matched with a cascading falls has not yet been fully explored.",
            "This site, which forms part of the lush Sogod Rainforest served as meeting point of three (3) rivers which offers a scenic junction of a natural pool.",
            "The presence of leeches locally known as “limatok” thrive on its waters."
        ],
        [
            "The area can be reached after a five-kilometer walk from the road proper in barangay Pancho Villa to the barrio of San Francisco Mabuhay.",
            "Pancho Villa is a 20-minute habal-habal ride from Doctor Gonzalo Yong Bus Terminal in the poblacion.",
            "It is also accessible via a feeder road in barangay Kahupian which connects it from the sitios of Lubong Sapa, Silao Bato, Kabernal and Hagna.",
            "The latter, which is the farthest of the sitios and under the territorial jurisdiction of barangay San Francisco Mabuhay, is the location of the cave and falls."
        ],
        [
            "Magsuhot Park"
        ],
        [
            "The 500-hectare forested Magsuhot National Park, located three (3) kilometers from barangay Mahayahay, has a four 20-meter high waterfalls falling into a common basin.",
            "It is located in the barangay of Maria Plana."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sogod |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c d e f Imperial, Reynaldo (1996).",
            "Leyte, 1898–1902 : the Philippine–American War _ Philippine–American War.",
            "Diliman, Quezon CIty: Office of Research Coordination, University of the Philippines."
        ],
        [
            "^ a b c d e de la Costa, Rev.",
            "Fr.",
            "Horacio (1965).",
            "Readings in Philippine History.",
            "Manila: Bookmark, Inc."
        ],
        [
            "^ \"Inopacan Profile: Culture and History\".",
            "inopacanprofile.",
            "19 June 2011.",
            "Retrieved 2016-01-13."
        ],
        [
            "^ \"The Philippine Islands, 1493–1803, Volume V., 1582–1583\".",
            "Retrieved January 14, 2015."
        ],
        [
            "^ a b c d e f g h i j k l m n o p q r s t u v w x y Gan, Edito.",
            "\"Sogod of our Memories: A Special History-Genealogy Account.\"",
            "Sogod, Southern Leyte: Sogod Local Government Unit"
        ],
        [
            "^ a b c d e f g h Borrinaga, Rolando (2006).",
            "The Colonial Odyssey of Leyte (1521–1914), a translation of Reseña de la Provincia de Leyte by Manuel Artigas y Cuerva.",
            "Quezon City: New Days Publisher."
        ],
        [
            "^ a b c d e f g h Chong, Joaquin (1996).",
            "Southern Leyte (Book II - Towns).",
            "Maasin City, Southern Leyte.",
            "pp. 50–51.",
            "{{cite book}}:  CS1 maint: location missing publisher (link)"
        ],
        [
            "^ a b c d e f Gan, Edito (1990).",
            "Sogod, Southern Leyte: Then and Now.",
            "Sogod, Southern Leyte: Sogod Local Government Unit."
        ],
        [
            "^ Dimayuga, Paul.",
            "\"Messianic Leaders of the Revolution\".",
            "Philippine History Group of Los Angeles.",
            "Retrieved January 24, 2016."
        ],
        [
            "^ Borrinaga, Rolando (September 25–28, 2000).",
            "\"Leyte: A Forgotten Symbol of Resistance Movements in the Visayas\".",
            "Philippine EJournals.",
            "Retrieved May 7, 2014."
        ],
        [
            "^ a b c d e f g h i j Breve Reseña de lo que fue y de lo que es la Diocesis de Cebu en las Islas Filipinas.",
            "Cebu City: University of San Carlos Press.",
            "2014."
        ],
        [
            "^ a b c \"Leyte Historical Junctures\".",
            "oocities.",
            "Retrieved January 14, 2016."
        ],
        [
            "^ a b Espina, Francisco Sr. (1985).",
            "Ang Lungsod sa Libagon.",
            "Libagon, Southern Leyte.",
            "{{cite book}}:  CS1 maint: location missing publisher (link)"
        ],
        [
            "^ Task of the Presbyterian Church in the Philippines.",
            "New York: Presbyterian Church in the U.S.A. Board of Foreign Missions.",
            "1916."
        ],
        [
            "^ a b c d e f Ara, Satoshi (June 13, 2018).",
            "\"A Study of Japanese Occupation in Leyte, 1942-1945\".",
            "ResearchGate."
        ],
        [
            "^ a b c Ara, Satoshi (June 13, 2018).",
            "\"A Study of Japanese Occupation in Leyte, 1942-1945\".",
            "ResearchGate – via ResearchGate."
        ],
        [
            "^ \"The sitio of Benit to be known as the barrio of Benit\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Cabadbaran to be known as the barrio of Cabadbaran\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Dagsa to be known as the barrio of Dagsa\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Hibod-Hibod to be known as the barrio of Hibod-Hibod\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Hindangan to be known as the barrio of Hindangan\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Hipantag to be known as the barrio of Hipantag\".",
            "lawph.com.",
            "June 19, 1965.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Punong in the Municipality of Sogod, Province of Leyte, is hereby converted into a barrio to be known as Barrio La Purisima Concepcion\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"An act creating the barrio of Kahupian\".",
            "Chan Robles Virtual Law Library.",
            "June 19, 1971.",
            "Retrieved May 8, 2014."
        ],
        [
            "^ \"The sitio of Kauswagan to be known as the barrio of Kauswagan\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"Sitios Kantabuan, Baycasili, Mamingaw, Tagabaca and Kampuwa, into a barrio to be named Barrio Kauswagan\".",
            "lawph.com.",
            "June 19, 1960.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Mabicay to be known as the barrio of Mabicay\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Maria Plana to be known as the barrio of Maria Plana\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Malinao to be known as the barrio of Malinao\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Milagroso to be known as the barrio of Milagroso\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Olisihan to be known as the barrio of Olisihan\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Pinamono-an to be known as the barrio of Pinamono-an\".",
            "Philippine Law Info.",
            "June 21, 1959.",
            "Archived from the original on May 8, 2014.",
            "Retrieved May 9, 2014."
        ],
        [
            "^ Pedalino, Marcelo.",
            "\"New substation solves low power woes in Sogod Bay\".",
            "Philippine Information Agency (PIA).",
            "Archived from the original on 2014-05-12.",
            "Retrieved May 9, 2014."
        ],
        [
            "^ \"The sitio of Rizal to be known as the barrio of Rizal\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of San Francisco Mabuhay to be known as the barrio of San Francisco Mabuhay\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of San Jose to be known as the barrio of San Jose\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of San Juan to be known as the barrio of San Juan\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of San Vicente to be known as the barrio of San Vicente\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ \"The sitio of Santa Maria to be known as the barrio of Santa Maria\".",
            "lawph.com.",
            "June 21, 1959.",
            "Retrieved May 3, 2011."
        ],
        [
            "^ a b \"Total Population by Province, City, Municipality and Barangay as of 2010 (Southern Leyte)\".",
            "www.blgs.gov.ph.",
            "June 10, 2010.",
            "Retrieved June 10, 2010."
        ],
        [
            "^ \"Southern Leyte mountains and peaks\".",
            "Peakery Web Archive.",
            "Archived from the original on 2014-05-08.",
            "Retrieved May 7, 2014."
        ],
        [
            "^ \"New Species of Frogs Discovered in the Philippine Forest of Southern Leyte - A Critical Biodiversity Area\".",
            "Department of Environment and Natural Resources.",
            "Archived from the original on May 8, 2014.",
            "Retrieved May 7, 2014."
        ],
        [
            "^ a b c Inercar Paper"
        ],
        [
            "^ Southern Leyte-News on Samar 5"
        ],
        [
            "^ \"Southern Leyte governor seeks suspension of Subang Daku River quarrying\".",
            "www.manilanewsonline.com.",
            "2003-12-11.",
            "Archived from the original on 2014-05-08.",
            "Retrieved May 7, 2014."
        ],
        [
            "^ \"Subang Daku quarrying issue in S. Leyte heats up\".",
            "SunStar.",
            "Sun Star Tacloban.",
            "August 13, 2013.",
            "Retrieved May 7, 2014."
        ],
        [
            "^ \"G.R.",
            "No.",
            "L-38204 September 24, 1991 THE MUNICIPALITY OF SOGOD, petitioner, vs. AVELINO S. ROSAL, as Judge of the Court of First instance of Southern Leyte, Branch III, THE PROVINCIAL BOARD OF SOUTHERN LEYTE, SALVACION O. YNIGUEZ, in her capacity as Governor of Southern Leyte and the MUNICIPALITY OF BONTOC, respondents.",
            "G.R.",
            "No.",
            "38205 September 24, 1991 THE MUNICIPALITY OF SOGOD, petitioner, vs. AVELINO S. ROSAL, as Judge of the Court of First Instance of Southern Leyte, Branch III and the Municipality of Bontoc, respondents\".",
            "The LawPhil Project.",
            "September 24, 1991."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Local Government Performance Management System\".",
            "www.blgs.gov.ph.",
            "March 31, 2012.",
            "Retrieved March 31, 2012."
        ],
        [
            "^ \"2019 Election Results: Sogod, Southern Leyte\".",
            "ABS-CBN Corporation.",
            "May 22, 2019.",
            "Retrieved May 22, 2019."
        ],
        [
            "^ a b c Pedalino, Bong (1993).",
            "Silver Anniversary Diocese of Maasin.",
            "Maasin City, Southern Leyte: Diocese of Maasin.",
            "p. 47."
        ],
        [
            "^ \"History of Southern Leyte Electric Cooperative (SOLECO)\".",
            "Southern Leyte Electric Cooperative.",
            "Retrieved May 18, 2016."
        ],
        [
            "^ \"Kainting Cave in Sogod attracts tourists\".",
            "www.pia.gov.ph.",
            "2003-12-11.",
            "Retrieved May 7, 2011."
        ],
        [
            "Philippines portal"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Sogod, Southern Leyte."
        ],
        [
            "Wikivoyage has a travel guide for Sogod, Southern Leyte."
        ],
        [
            "Sogod Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2012-05-30 at the Wayback Machine"
        ],
        [
            "Places adjacent to Sogod, Southern Leyte"
        ],
        [
            "Inopacan, Leyte"
        ],
        [
            "Mahaplag, Leyte"
        ],
        [
            "Silago"
        ],
        [
            "Hindang, LeyteHilongos, Leyte"
        ],
        [
            "Sogod"
        ],
        [
            "Hinunangan"
        ],
        [
            "Bato, Leyte / Bontoc"
        ],
        [
            "Sogod Bay"
        ],
        [
            "Libagon / Saint Bernard"
        ],
        [
            "vte Province of Southern LeyteMaasin (capital and largest city)Municipalities"
        ],
        [
            "Anahawan"
        ],
        [
            "Bontoc"
        ],
        [
            "Hinunangan"
        ],
        [
            "Hinundayan"
        ],
        [
            "Libagon"
        ],
        [
            "Liloan"
        ],
        [
            "Limasawa"
        ],
        [
            "Macrohon"
        ],
        [
            "Malitbog"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pintuyan"
        ],
        [
            "Saint Bernard"
        ],
        [
            "San Francisco"
        ],
        [
            "San Juan"
        ],
        [
            "San Ricardo"
        ],
        [
            "Silago"
        ],
        [
            "Sogod"
        ],
        [
            "Tomas Oppus"
        ],
        [
            "Component City"
        ],
        [
            "Maasin"
        ],
        [
            "vteEastern Visayas (Region VIII)Regional center"
        ],
        [
            "Tacloban"
        ],
        [
            "Provinces"
        ],
        [
            "Biliran"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Leyte"
        ],
        [
            "Northern Samar"
        ],
        [
            "Samar"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc"
        ],
        [
            "Component cities"
        ],
        [
            "Baybay"
        ],
        [
            "Borongan"
        ],
        [
            "Calbayog"
        ],
        [
            "Catbalogan"
        ],
        [
            "Maasin"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Borongan"
        ],
        [
            "Catarman"
        ],
        [
            "Catbalogan"
        ],
        [
            "Maasin"
        ],
        [
            "Naval"
        ],
        [
            "Tacloban"
        ],
        [
            "Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Allen"
        ],
        [
            "Almagro"
        ],
        [
            "Almeria"
        ],
        [
            "Anahawan"
        ],
        [
            "Arteche"
        ],
        [
            "Babatngon"
        ],
        [
            "Balangiga"
        ],
        [
            "Balangkayan"
        ],
        [
            "Barugo"
        ],
        [
            "Basey"
        ],
        [
            "Bato"
        ],
        [
            "Biliran"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Bontoc"
        ],
        [
            "Burauen"
        ],
        [
            "Cabucgayan"
        ],
        [
            "Caibiran"
        ],
        [
            "Calbiga"
        ],
        [
            "Calubian"
        ],
        [
            "Can-avid"
        ],
        [
            "Capoocan"
        ],
        [
            "Capul"
        ],
        [
            "Carigara"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Culaba"
        ],
        [
            "Dagami"
        ],
        [
            "Daram"
        ],
        [
            "Dolores"
        ],
        [
            "Dulag"
        ],
        [
            "Gamay"
        ],
        [
            "Gandara"
        ],
        [
            "General MacArthur"
        ],
        [
            "Giporlos"
        ],
        [
            "Guiuan"
        ],
        [
            "Hernani"
        ],
        [
            "Hilongos"
        ],
        [
            "Hinabangan"
        ],
        [
            "Hindang"
        ],
        [
            "Hinunangan"
        ],
        [
            "Hinundayan"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Jiabong"
        ],
        [
            "Jipapad"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "Kawayan"
        ],
        [
            "La Paz"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lawaan"
        ],
        [
            "Leyte"
        ],
        [
            "Libagon"
        ],
        [
            "Liloan"
        ],
        [
            "Limasawa"
        ],
        [
            "Llorente"
        ],
        [
            "Lope de Vega"
        ],
        [
            "MacArthur"
        ],
        [
            "Macrohon"
        ],
        [
            "Mahaplag"
        ],
        [
            "Malitbog"
        ],
        [
            "Mapanas"
        ],
        [
            "Marabut"
        ],
        [
            "Maripipi"
        ],
        [
            "Maslog"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Matuguinao"
        ],
        [
            "Maydolong"
        ],
        [
            "Mayorga"
        ],
        [
            "Mercedes"
        ],
        [
            "Merida"
        ],
        [
            "Mondragon"
        ],
        [
            "Motiong"
        ],
        [
            "Naval"
        ],
        [
            "Oras"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagsanghan"
        ],
        [
            "Palapag"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pambujan"
        ],
        [
            "Paranas"
        ],
        [
            "Pastrana"
        ],
        [
            "Pinabacdao"
        ],
        [
            "Pintuyan"
        ],
        [
            "Quinapondan"
        ],
        [
            "Rosario"
        ],
        [
            "Saint Bernard"
        ],
        [
            "Salcedo"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro (Leyte)"
        ],
        [
            "San Isidro (Northern Samar)"
        ],
        [
            "San Jorge"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose de Buan"
        ],
        [
            "San Juan"
        ],
        [
            "San Julian"
        ],
        [
            "San Miguel"
        ],
        [
            "San Policarpo"
        ],
        [
            "San Ricardo"
        ],
        [
            "San Roque"
        ],
        [
            "San Sebastian"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Margarita"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Silago"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Sogod"
        ],
        [
            "Sulat"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Taft"
        ],
        [
            "Tagapul-an"
        ],
        [
            "Talalora"
        ],
        [
            "Tanauan"
        ],
        [
            "Tarangnan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tomas Oppus"
        ],
        [
            "Tunga"
        ],
        [
            "Victoria"
        ],
        [
            "Villaba"
        ],
        [
            "Villareal"
        ],
        [
            "Zumarraga"
        ],
        [
            "Visayas, Republic of the Philippines"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sogod,_Southern_Leyte&oldid=1229960882\""
        ],
        [
            "Category: Municipalities of Southern LeyteHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: location missing publisherCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages with Tagalog IPAArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataAll articles with dead external linksArticles with dead external links from May 2018Articles with permanently dead external linksArticles with dead external links from August 2023Webarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}