{
    "name": "Sulop",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sulop"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 6°35′55″N 125°20′37″E﻿ / ﻿6.59861°N 125.34361°E﻿ / 6.59861; 125.34361"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Davao del Sur, Philippines"
        ],
        [
            "Municipality in Davao Region, PhilippinesSulopMunicipalityMunicipality of SulopSulop Municipal Hall"
        ],
        [
            "FlagSealOpenStreetMapSulopLocation within the PhilippinesCoordinates: 6°35′55″N 125°20′37″E﻿ / ﻿6.59861°N 125.34361°E﻿ / 6.59861; 125.34361CountryPhilippinesRegionDavao RegionProvinceDavao del SurDistrict"
        ],
        [
            "Lone districtFoundedApril 24, 1958Barangays25"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorAtty.",
            "Jose Jimmy S. Sagarino • Vice MayorAtty.",
            "Willie S. Villegas • RepresentativeJohn Tracy F.  Cagas • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Atty.",
            "Victoria D. AbabaAntonio L. AlbinoEdgar F DapusalaSebastian C. Mondejar Jr.Boyet T. HernanDyane Therese G. IdulsaAngel A. CalugasResty S. DealaGuillermo A. PregloKamylle A. Anito"
        ],
        [
            " • Electorate24,114 voters (2022)Area • Revenue₱ 165.6 million (2020) • Assets₱ 742.3 million (2020) • Expenditure₱ 153.4 million (2020)Service provider • ElectricityDavao del Sur Electric Cooperative (DASURECO)Time zoneUTC+8 (PST)ZIP code8009PSGC112414000IDD : area code +63 (0)82Native languagesDavawenyo Cebuano Kalagan Tagalog Ata ManoboWebsitewww.sulop.gov.ph"
        ],
        [
            "New Overland Transport Terminal"
        ],
        [
            "Municipal Police Station"
        ],
        [
            "MHO and Municipal Hall Building"
        ],
        [
            "Municipal Health Building"
        ],
        [
            "Municipal Children's Playground"
        ],
        [
            "Municipal Ground"
        ],
        [
            "Sulop, officially the Municipality of Sulop (Cebuano: Lungsod sa Sulop; Tagalog: Bayan ng Sulop), is a 3rd class municipality in the province of Davao del Sur, Philippines.",
            "According to the 2020 census, it has a population of 35,151 people."
        ],
        [
            "History"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(May 2014) (Learn how and when to remove this message)"
        ],
        [
            "Once a swampy area surrounded by the second-growth forest, Sulop was inhabited by the natives of the Tagacaolo, B’laan, and Bagobo tribes.",
            "The B’laans were headed by their tribal chieftain DATU SULO while the Tagacaulos were headed by TIO BUNDAY.",
            "The means of survival of these indigenous people were hunting wild boars and agriculture, the main product of which was corn.",
            "Flooding was (and still is) a common occurrence and the people called the rushing waters “surop”."
        ],
        [
            "In the early part of the 19th century, particularly in the 1930s, the first migrants came to settle down, mostly Sugbuanons from Kauswagan, Lanao del Norte.",
            "From then on, waves of immigrants from the Visayas Region, mostly from Cebu, came to Sulop which was still a barangay under the Municipality of Limonso (now Padada).",
            "Settlers from Leyte, Iloilo, and Bohol"
        ],
        [
            "also arrived within the century.",
            "They acquired lands from the natives who retreated to the hinterlands when they came.",
            "The settlers then converted the place into settlement sites and agricultural production areas."
        ],
        [
            "After the war, Barrio Sulop was still part of the Municipality of Limonso.",
            "But the people have multiplied, and the community has grown.",
            "Several persons, particularly Eulalio Masocol, Zoilo Comabig, and Antonio Go Pace emerged as respected figures of the community.",
            "They espoused the idea of creating a new town separate from Limonso.",
            "It was decided to call the town SULOP, a word reconciled from the term “surop” meaning rushing waters, “sul-op” from the Tagacaulo dialect meaning wild (ihalas in Cebuano), and the name of the B’laan tribalchieftain Datu Sulo.",
            "From then on, the place came to be known as SULOP."
        ],
        [
            "Antonio Go Pace lobbied for the creation of Sulop as a town.",
            "He went to Manila in January 1958 and came back four months after with EXECUTIVE ORDER 259 issued by then-President Carlos P. Garcia on April 24, 1958, officially separating the Barrio of Sulop and its adjacent barrios and sitios from Limonso and creating an independent town….",
            "the MUNICIPALITY OF SULOP."
        ],
        [
            "         During those days, the people would converge every Tuesday to a place they fondly called LOTE for their marketing, the common marketplace located near the residence of spouses Agripina and Segundo Lumbab beside the Sulop Elementary School.",
            "The mode of transportation then was the horse-drawn “tartanilya” or “calesa” and the carabao and cow drawn “caromata” or “cariton”.",
            "But most people would opt to walk their way to and from the marketplace.",
            "It was only in 1964 when buses, jeepneys, and pedicabs started plying the route to and from Sulop."
        ],
        [
            "The first seat of government after the creation of Sulop was the residence of Enrique Pacatan.",
            "The policemen in those days were appointed by the mayor and the first to assume as Chief of Police was Felix Dullin, Sr..",
            "There was only one (1) secondary school then, the Sulop Community High School located in the area where the municipal health center now stands.",
            "The school children go to the Sulop Elementary School (now Sulop Central Elementary School)."
        ],
        [
            "The first place of worship erected in the locality was the Aglipayan Church (FILIPINISTAS) which is still in existence.",
            "Then the ADVENTISTS erected their edifice after which the IGLESIA NI CRISTO (INC) and the JEHOVAS WITNESSES followed suit.",
            "Meanwhile, the ROMAN CATHOLICS used to go to Padada to worship while others worship in a small chapel (located in"
        ],
        [
            "the area of what is now the Sulop Medical Clinic) donated by spouses Agripina and Segundino Lumbab.",
            "When the chapel was burned down, Fr.",
            "Gravel, then parish priest of Padada, requested a group of devout catholic women who were responsible for the establishment of the chapel, to look for an area where to erect a permanent church for the Roman Catholics.",
            "With"
        ],
        [
            "funds provided by then-Governor Alejandro Almendras, a lot was purchased where the first catholic church was built.",
            "Fr.",
            "Bouchard was installed as the first parish priest."
        ],
        [
            "After its creation, the first set of municipal officials were appointed by President Garcia with Nestorio Comabig as mayor."
        ],
        [
            "Its development underwent several changes of political leadership, viz:"
        ],
        [
            "President Carlos P. Garcia appointed Nestorio Comabig as the first mayor of the Municipality of Sulop whose achievement was the assignment of residential lots to interested parties consistent with the townsite development plan.",
            "However, Mayor Nestorio Comabig resigned from office six (6) months after he assumed office;"
        ],
        [
            "The then Vice Mayor Antonio Go Pace assumed the vacated mayorship position and facilitated the construction of the first Town Hall of the municipality;"
        ],
        [
            "Vice-mayor Sebastian Mondejar, Sr. succeeded the mayorship of Antonio Go Pace when the latter died and then facilitated the establishment of the Cacao Investors Incorporated (CII), a multi-million-peso corporation engaged in cacao beans production;"
        ],
        [
            "Vice-mayor Perfecto O. Sagarino, Sr. succeeded as mayor when Mayor Sebastian Mondejar, Sr. was killed in an ambush on December 3, 1982 during the height of the insurgency.",
            "His greatest achievement was the construction of the Sulop Public Market building.",
            "Unfortunately, he was forced to relinquish his position after the EDSA REVOLUTION in 1986; Atty.",
            "Leopoldo C. Diones was then installed as OIC-Mayor who retained his position by winning the 1987 and 1992 elections.",
            "Mayor Leopoldo C. Diones’ achievement was the restoration of peace and order of the municipality and the construction of the municipal gymnasium, municipal nursery, animal breeding center, municipal cemetery, and the waterworks system;"
        ],
        [
            "Atty.",
            "Jose Jimmy S. Sagarino, son of former mayor Perfecto O. Sagarino Sr., won the mayoralty race in 1995.",
            "Mayor Jose Jimmy S. Sagarino then initiated the formulation of the vision of Sulop and the 1995 – 2005 Comprehensive Development Plan of the municipality.",
            "The Construction of the new Municipal Government Center of Sulop was made during his incumbency.",
            "Notable transformation of the LGU-Sulop from a sleepy town to a vibrant and progressive political subdivision transpired during the administration of the energetic young mayor throughout his three (3) terms as mayor;"
        ],
        [
            "On June 30, 2004, the local leadership was then steered by Mayor Restituto C. Ornales.",
            "In his quest to sustain the obtaining momentum of development, he placed agricultural productivity as the centerpiece of his development thrusts and initiated the construction of Labon – Clib Steel Bridge;"
        ],
        [
            "Another change in leadership took place on June 30, 2007, when the newly elected mayor assumed the post at noon marking the return of Mayor Jose Jimmy S. Sagarino who, in his new term as local chief executive, celebrated the Golden Founding Anniversary of the Municipality of Sulop.",
            "He then commenced the continuity of what he started during his first 3 terms as mayor, laying down the foundation of the sustainable growth of the locality."
        ],
        [
            "A new era in the local political leadership transpired when the first lady Chief Executive assumed the highest position of the municipality with the assumption of Honorable Maria S. Sagarino as the new mayor on June 30, 2016.",
            "For the first time in the history of Sulop, a woman handled the reins of governance of the municipality.",
            "She pursued the development efforts laid down by her predecessor, her son and former mayor Atty.",
            "Jose Jimmy Sagarino."
        ],
        [
            "Then eventually on June 30, 2019, Atty.",
            "Jose Jimmy S. Sagarino again assumed the local leadership after winning the local election unopposed.",
            "It is the third time he became Municipal Mayor of Sulop, a feat never before achieved by any politician in the history of Sulop.",
            "Right at the commencement of his new mandate as a steward, he initiated the formulation of the new direction of the municipality, envisioning it to become a premier agri-industrial municipality with a diversified economy."
        ],
        [
            "Geography"
        ],
        [
            "Sulop is about 17 kilometres (11 mi) from Digos, the seat of the provincial government of Davao del Sur.",
            "The municipality is located halfway between two major growth centers of Mindanao, namely, Davao City of Region XI and General Santos of Region XII."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sulop, Davao del Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "59(2.3)"
        ],
        [
            "46(1.8)"
        ],
        [
            "41(1.6)"
        ],
        [
            "54(2.1)"
        ],
        [
            "105(4.1)"
        ],
        [
            "159(6.3)"
        ],
        [
            "179(7.0)"
        ],
        [
            "197(7.8)"
        ],
        [
            "162(6.4)"
        ],
        [
            "147(5.8)"
        ],
        [
            "102(4.0)"
        ],
        [
            "65(2.6)"
        ],
        [
            "1,316(51.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.3"
        ],
        [
            "11.7"
        ],
        [
            "12.2"
        ],
        [
            "14.5"
        ],
        [
            "22.6"
        ],
        [
            "25.6"
        ],
        [
            "26.6"
        ],
        [
            "27.5"
        ],
        [
            "25.5"
        ],
        [
            "26.0"
        ],
        [
            "21.2"
        ],
        [
            "16.0"
        ],
        [
            "241.7"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Sulop is politically subdivided into 25 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Balasinon"
        ],
        [
            "Buguis"
        ],
        [
            "Carre"
        ],
        [
            "Clib"
        ],
        [
            "Harada Butai"
        ],
        [
            "Katipunan"
        ],
        [
            "Kiblagon"
        ],
        [
            "Labon"
        ],
        [
            "Laperas"
        ],
        [
            "Lapla"
        ],
        [
            "Litos"
        ],
        [
            "Luparan"
        ],
        [
            "Mckinley"
        ],
        [
            "New Cebu"
        ],
        [
            "Osmeña"
        ],
        [
            "Palili"
        ],
        [
            "Parame"
        ],
        [
            "Poblacion"
        ],
        [
            "Roxas"
        ],
        [
            "Solongvale"
        ],
        [
            "Tagolilong"
        ],
        [
            "Tala-o"
        ],
        [
            "Talas"
        ],
        [
            "Tanwalang"
        ],
        [
            "Waterfall"
        ],
        [
            "Demographics"
        ],
        [
            "Municipal Hall of Sulop"
        ],
        [
            "Population census of SulopYearPop.±% p.a.1960 28,385—    1970 22,762−2.18%1975 22,014−0.67%1980 23,094+0.96%1990 24,513+0.60%1995 25,968+1.09%2000 27,340+1.11%2007 29,082+0.86%2010 32,163+3.73%2015 33,613+0.84%2020 35,151+0.88%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Sulop"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  39.20"
        ],
        [
            "2009  36.85"
        ],
        [
            "2012  37.10"
        ],
        [
            "2015  21.42"
        ],
        [
            "2018  16.12"
        ],
        [
            "2021  16.01"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Education"
        ],
        [
            "DSSC-Sulop Extension Campus"
        ],
        [
            "The Davao Del Sur State College (DSSC), a campus based in Matti, Digos has a Sulop Extension.",
            "Located at Purok 2, Poblacion, Sulop, Davao Del Sur."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sulop |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Sulop: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 28 January 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XI (Davao Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region XI (Davao Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XI (Davao Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Davao del Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Sulop."
        ],
        [
            "Sulop Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Sulop"
        ],
        [
            "Padada"
        ],
        [
            "Kiblawan"
        ],
        [
            "Sulop"
        ],
        [
            "Davao Gulf"
        ],
        [
            "Malalag"
        ],
        [
            "vte Province of Davao del SurDigos (capital)  Davao City (largest city)Municipalities"
        ],
        [
            "Bansalan"
        ],
        [
            "Hagonoy"
        ],
        [
            "Kiblawan"
        ],
        [
            "Magsaysay"
        ],
        [
            "Malalag"
        ],
        [
            "Matanao"
        ],
        [
            "Padada"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Sulop"
        ],
        [
            "Component City"
        ],
        [
            "Digos"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Davao City (Administratively independent from the province but grouped under Davao del Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sulop&oldid=1224372965\""
        ],
        [
            "Categories: Municipalities of Davao del SurPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataPages using infobox settlement with image map1 but not image mapArticles containing Cebuano-language textArticles containing Tagalog-language textArticles needing additional references from May 2014All articles needing additional referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}