{
    "name": "Sultan Kudarat",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sultan Kudarat, Maguindanao del Norte"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogไทยاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°14′N 124°15′E﻿ / ﻿7.23°N 124.25°E﻿ / 7.23; 124.25"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "(Redirected from Sultan Kudarat, Maguindanao)"
        ],
        [
            "Municipality in Maguindanao del Norte, Philippines"
        ],
        [
            "Not to be confused with the province of Sultan Kudarat."
        ],
        [
            "Municipality in Bangsamoro Autonomous Region in Muslim Mindanao, PhilippinesSultan Kudarat"
        ],
        [
            "سلطان قدراتNulingMunicipalityMunicipality of Sultan KudaratMunicipal Hall at Brgy.",
            "Dalumangcob"
        ],
        [
            "SealMap of Maguindanao del Norte with Sultan Kudarat highlightedOpenStreetMapSultan KudaratLocation within the PhilippinesCoordinates: 7°14′N 124°15′E﻿ / ﻿7.23°N 124.25°E﻿ / 7.23; 124.25CountryPhilippinesRegionBangsamoro Autonomous Region in Muslim MindanaoProvinceMaguindanao del NorteDistrict"
        ],
        [
            "Lone districtNamed forSultan Muhammad Dipatuan KudaratBarangays39"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorTucao Mastura • Vice MayorShameem B. Mastura • RepresentativeSittie Shahara I. Mastura • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Saman L. AbdulAbas D. AhmadBrahim K. AliOmar K. BakarNorhana M. MaikMohammed A. CasimNasser A. AliNor-ain M. Kunakon"
        ],
        [
            " • Electorate62,134 voters (2022)Area • Revenue₱ 342.7 million (2020) • Assets₱ 359.6 million (2020) • Expenditure₱ 324.8 million (2020) • Liabilities₱ 60.16 million (2020)Service provider • ElectricityMaguindanao Electric Cooperative (MAGELCO)Time zoneUTC+8 (PST)ZIP code9605PSGC153812000IDD : area code +63 (0)64Native languagesMaguindanao Iranun TagalogWebsitewww.sultankudarat-mag.gov.ph"
        ],
        [
            "Sultan Kudarat, officially the Municipality of Sultan Kudarat (Maguindanaon: Inged nu Sultan Kudarat; Iranun: Inged a Sultan Kudarat; Tagalog: Bayan ng Sultan Kudarat), is a 1st class municipality of the province of Maguindanao del Norte, Philippines.",
            "At the 2020 census it had a population of 105,121."
        ],
        [
            "Formerly known as Nuling, it became the de jure capital of the former Maguindanao province in 1977.",
            "It served as the legislative capital of Maguindanao in 2011 as it plays host to the Maguindanao Provincial Board, previously housed in the former capitol at Shariff Aguak.",
            "This restored its previous status as provincial capital, which was shared with Buluan which served as the executive capital.",
            "In 2022, Republic Act 11550 officially designated Datu Odin Sinsuat as the official capital of Maguindanao del Norte and Buluan as official capital of Maguindanao del Sur.",
            "Once a provincial capitol is erected in Datu Odin Sinsuat, the legislature will move in that municipality."
        ],
        [
            "History"
        ],
        [
            "Sultan Kudarat town was founded as a municipality by the name Nuling on August 18, 1947 by virtue of Executive Order No.",
            "82 signed by President Manuel Roxas.",
            "The town had its present name, pursuant to  REPUBLIC ACT NO.",
            "5647, titled AN ACT CHANGING THE NAME OF THE MUNICIPALITY OF NULING IN THE PROVINCE OF COTABATO, TO SULTAN KUDARAT.",
            "which was enacted by Congress on June 21, 1969."
        ],
        [
            "Thus, an ACT (REPUBLIC ACT NO.",
            "5647) CHANGING THE NAME OF THE MUNICIPALITY OF NULING IN THE PROVINCE OF COTABATO, TO SULTAN KUDARAT.",
            "was enacted by the Seventh Congress, eight (8) years before the Municipality of Sultan Kudarat became the capital of the province of Maguindanao.",
            "The province was created under PD 341 issued by President Ferdinand E. Marcos on November 22, 1973 (not in 1977)."
        ],
        [
            "The town was part of the province of Shariff Kabunsuan from October 2006 until its nullification by the Supreme Court in July 2008."
        ],
        [
            "The original seat of the Sultanate of Maguindanao was located at the mouth of the Maguindanao river (now Matampay) but later transferred to the nearby sitio at the bank of the Nuling Creek of Barangay Salimbao of this Municipality."
        ],
        [
            "Sultan Mastura Kudarat, a royal lineage of the hero soldier Sultan Dipatuan Kudaratullah was appointed by American Governor Carpenter as President of the Municipal District of Nuling.",
            "The former, however, tactfully declined said and after and instead, designated his son, Datu Mamadra Mastura for the position, who served from 1922 to 1923.",
            "He was succeeded by the following executives:"
        ],
        [
            "1924 to 1926, Datu Lembak Mastura;"
        ],
        [
            "1927 to 1934, Datu Baraguir Mamadra;"
        ],
        [
            "1935 to 1945, Datu Baraguir Mamadra, first elected Municipal district Mayor of Nuling under the Philippine Commonwealth with Barangay Salimbao as the seat of the Government of Nuling;"
        ],
        [
            "1945 to 1946, Datu Dagadas Taha, appointed by President Sergio Osmeña through the recommendation of former Governor Salipada Pendatun of Cotabato Province;"
        ],
        [
            "1946, Datu Abas Mastura;"
        ],
        [
            "1946, Datu Ali Compania;"
        ],
        [
            "1947 to 1951, Datu Mokamad Mamadra, first elected Mayor of the newly created regular Municipality of Nuling;"
        ],
        [
            "1951 to 1955, Datu Osmena Mamadra;"
        ],
        [
            "1956 to July 1977, Hadji Datu Sanggacala Mamadra Baraguir, first elected Municipal Mayor of the newly named Sultan Kudarat Municipality (formerly Nuling)."
        ],
        [
            "Almost ten years later, after the creation of the regular Municipality of Nuling on August 18, 1947, then President Carlos P. Garcia, aware on the development of the town, issued Executive Order No.",
            "267 fixing the seat of the Municipal Government of Sultan Kudarat to Barangay Dalumangcob of the town."
        ],
        [
            "July 1977 to January 30, 1980, Datu Tucao O. Mastura, CPA, appointed by the President of the Philippines, Ferdinand E. Marcos."
        ],
        [
            "On the same year, following the assumption of Mayor Mastura, President Ferdinand E. Marcos, issued Presidential Decree No.",
            "1170, transferring the seat of Government of the Province of Maguindanao from the Municipality of Maganoy to the Municipality of Sultan Kudarat on July 11, 1977;"
        ],
        [
            "January 30, 1980, to June 30, 1998, Datu Tucao O. Mastura, CPA, elected on January 30, 1980;"
        ],
        [
            "July 1, 1998, to June 30, 2001, Bai Shajida Mastura-Bandila, first woman elected Municipal Mayor."
        ],
        [
            "In a plebiscite conducted on March 15, 2003, the electorate of the Municipality unanimously voted in favor of the creation of a new Municipality in the name of Sultan Mastura, being a son of Sultan Dipatuan Kudaratullah, better known as Sultan Kudarat.",
            "The new Municipality of Sultan Mastura absorbed 13 barangays from the former leaving 39 for its mother town."
        ],
        [
            "July 1, 2001, to June 30, 2004, Datu Tucao O. Mastura, CPA, once again elected as Municipal Mayor unopposed;"
        ],
        [
            "July 1, 2004, to June 30, 2007, Datu Tucao O. Mastura, CPA, elected again as Municipal Mayor;"
        ],
        [
            "July 1, 2007, to June 30, 2010, Bai Shajida Mastuar-Bandila, again elected as Municipal Mayor of the Municipality of Sultan Kudarat, Shariff Kabunsuan, while his father, former Mayor Datu Tucao O. Mastura, CPA, ran for the position of Governor of the newly created Shariff Kabunsuan Province;"
        ],
        [
            "July 1, 2010, to June 30, 2013, Datu Tucao O. Mastura, CPA returned as the Municipal Mayor of the municipality with his daughter, former mayor Bai Shajida Biruar Mastura as his Vice Mayor;"
        ],
        [
            "July 1, 2013, to June 30, 2022, Datu Shameem B. Mastura, grandson of the Datu Tucao O. Mastura, CPA assumed as newly elected mayor of the municipality of Sultan Kuidarat, Maguindanao.",
            "He was the youngest mayor at the age of 23 in the Autonomous Region in Muslim Mindanao (ARMM).",
            "At that time, he was ranked as the third youngest mayor in Philippine History at the age of 23, next to Benigno Aquino Jr. at the age of 22 in Tarlac and Jono Humamoy at the age of 21 of Inabanga, Bohol in 2007."
        ],
        [
            "July 1, 2022–present, Datu Tucao O. Mastura, CPA returned as the Municipal Mayor of the municipality"
        ],
        [
            "Presently, Sultan Kudarat has a total land area of 71,151 hectares (175,820 acres) and an unofficial Population Census Result of 152,667 and a 24,651 households as of August 1, 2007."
        ],
        [
            "On January 23, 2021, a joint police-military operation occurred, with twelve members of the Talusan group including a former village chief, as well as a Special Action Force member, killed in a shootout.",
            "The armed group was the \"most wanted\" in the municipality."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Sultan Kudarat is politically subdivided into 39 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Alamada"
        ],
        [
            "Banatin"
        ],
        [
            "Banubo"
        ],
        [
            "Bulalo"
        ],
        [
            "Bulibod"
        ],
        [
            "Calsada"
        ],
        [
            "Crossing Simuay"
        ],
        [
            "Dalumangcob (Poblacion)"
        ],
        [
            "Damaniog"
        ],
        [
            "Darapanan"
        ],
        [
            "Gang"
        ],
        [
            "Inawan"
        ],
        [
            "Kabuntalan"
        ],
        [
            "Kakar"
        ],
        [
            "Kapimpilan"
        ],
        [
            "Katamlangan (Matampay)"
        ],
        [
            "Katidtuan"
        ],
        [
            "Katuli"
        ],
        [
            "Ladia"
        ],
        [
            "Limbo"
        ],
        [
            "Maidapa"
        ],
        [
            "Makaguiling"
        ],
        [
            "Matengen"
        ],
        [
            "Mulaug"
        ],
        [
            "Nalinan"
        ],
        [
            "Nara(Sultan Kudarat Mopakc)"
        ],
        [
            "Nekitan"
        ],
        [
            "Olas"
        ],
        [
            "Panatan"
        ],
        [
            "Pigcalagan"
        ],
        [
            "Pigkelegan (Ibotegen)"
        ],
        [
            "Pinaring"
        ],
        [
            "Pingping"
        ],
        [
            "Raguisi"
        ],
        [
            "Rebuken"
        ],
        [
            "Salimbao"
        ],
        [
            "Sambolawan"
        ],
        [
            "Senditan"
        ],
        [
            "Ungap"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sultan Kudarat, Maguindanao"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "53(2.1)"
        ],
        [
            "44(1.7)"
        ],
        [
            "41(1.6)"
        ],
        [
            "39(1.5)"
        ],
        [
            "69(2.7)"
        ],
        [
            "89(3.5)"
        ],
        [
            "92(3.6)"
        ],
        [
            "97(3.8)"
        ],
        [
            "72(2.8)"
        ],
        [
            "79(3.1)"
        ],
        [
            "72(2.8)"
        ],
        [
            "49(1.9)"
        ],
        [
            "796(31.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "15.3"
        ],
        [
            "13.5"
        ],
        [
            "16.3"
        ],
        [
            "16.9"
        ],
        [
            "22.3"
        ],
        [
            "23.5"
        ],
        [
            "22.5"
        ],
        [
            "23.1"
        ],
        [
            "19.4"
        ],
        [
            "21.5"
        ],
        [
            "20.6"
        ],
        [
            "17.5"
        ],
        [
            "232.4"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Sultan KudaratYearPop.±% p.a.1918 6,603—    1939 15,823+4.25%1948 15,127−0.50%1960 30,614+6.05%1970 40,377+2.80%1975 47,101+3.14%1980 48,383+0.54%1990 72,331+4.10%1995 76,125+0.96%2000 94,861+4.83%2007 121,324+3.45%2010 82,758−13.00%2015 95,201+2.70%2020 105,121+1.97%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty Incidence of Sultan Kudarat"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2000  59.72"
        ],
        [
            "2003  35.10"
        ],
        [
            "2006  50.10"
        ],
        [
            "2009  50.03"
        ],
        [
            "2012  54.66"
        ],
        [
            "2015  52.26"
        ],
        [
            "2018  58.88"
        ],
        [
            "2021  37.17"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The LGU had a poverty incidence of 35.1% or there are about 57,147 of the 181,419 population who are living below the ARMM's poverty threshold of 75,000 or an annual per capita income of P10,714 for the family size of 7.",
            "This poverty incidence is 1.4% lower than the National average of 32.9%."
        ],
        [
            "Though Sultan Kudarat hosts seventy percent of the agro-industries of the Province of Shariff Kabunsuan, its main economy is derived from the agriculture sector."
        ],
        [
            "The municipality of Sultan Kudarat hosts Lamsan, one of the largest corn products manufacturers in the Philippines.",
            "The company provides employment to hundreds of workers in the municipality and nearby towns of Maguindanao."
        ],
        [
            "The Gross Domestic Product of the Municipality (2022) is 23,646,300,000(PHP)."
        ],
        [
            "Farming"
        ],
        [
            "The municipality has 23,152.263 hectares of agricultural lands.",
            "While based on the year 2005 MAO's report, only 10,035 hectares of which or forty percent (49%) have been productively used, reflecting a yield of 121.4, 13,282 and 7,820 metric tons for copra, rice and corn respectively, earning a gross income of P169,279,300.00 for the year 2005.",
            "Its High Value Commercial crops have so far covered 273 hectares and shared a total yield of 536 metric tons that earned P9, 357,000.00."
        ],
        [
            "YEAR 2010 CROP PRODUCTION"
        ],
        [
            "CROPS PLANTED AREA PLANTED IN HA."
        ],
        [
            "Ave. / Yield, crop, ha (in Metric Tons) / Remarks"
        ],
        [
            "Rice / 12,000 / 3.5 / Mostly upland rice"
        ],
        [
            "Corn / 10,000 / 2.5"
        ],
        [
            "Coconut intercropped with corn and other crops / 12,000 / 2 (for coconut) 2,5 (for other crops)"
        ],
        [
            "Mango / 2,000 / 3"
        ],
        [
            "Banana / 5,000 / 5"
        ],
        [
            "TOTAL: 41,000 18.2"
        ],
        [
            "Fishing"
        ],
        [
            "The town possesses vast fishing grounds, the Maguindanao and Matampay Rivers, Illana Bay, lakes and its 1,393.4 hectares fishpond have been the major source of fish that supplies the fish requirements of the municipality and its neighboring towns.",
            "However, development programs have to be introduced to fully develop its potentials.",
            "The fish production reported is only 167,300 kilograms for the year 2005 which is not enough to supply the municipality's fish requirement of 3.9 million kilograms."
        ],
        [
            "Livestock and poultry"
        ],
        [
            "In 2005, the Municipality of Sultan Kudarat has a total livestock population of 10,997 heads.",
            "The livestock species that are popularly raised in the municipality are carabao, cattle, and goat, probably because the town is thickly populated by the Islam believers.",
            "Its poultry population have totaled to 24,693 heads.",
            "The present livestock and poultry production of the municipality is not sufficient to supply the meat requirements of the municipality for it can only provide a total of 234,691 kilograms for the year 2005 which is very far behind the town's food requirements of about 3.7 million kilograms."
        ],
        [
            "Livestock Production:"
        ],
        [
            "Livestock / Number of Heads / Percent to Total"
        ],
        [
            "Carabao / 3,120 / 17.4"
        ],
        [
            "Cattle / 4,387 / 24.4"
        ],
        [
            "Goat / 8,775 / 48.9"
        ],
        [
            "Swine / 960 / 5.3"
        ],
        [
            "Sheep / 136 / .75"
        ],
        [
            "Horse / 53 / .29"
        ],
        [
            "Others / 500 / 2.7"
        ],
        [
            "T O T A L: 17,931 100%"
        ],
        [
            "Poultry Production:"
        ],
        [
            "Livestock / Number of Heads / Percent (%) to Total"
        ],
        [
            "Chicken / 31,287 / 36.1"
        ],
        [
            "Ducks / 38,732 / 44.7"
        ],
        [
            "Turkeys / 6,751 / 7.79"
        ],
        [
            "Geese / 9,873 / 11.39"
        ],
        [
            "T O T A L: 86,643 100.00%"
        ],
        [
            "Source: DAF-ARMM, Sultan Kudarat, Maguindanao"
        ],
        [
            "Social services"
        ],
        [
            "Education and literacy"
        ],
        [
            "About 79.2 percent of the municipality's school age population are literate, that is able to read and write, based on the 1995 census.",
            "The data likewise shows that 43% are in elementary level and 26% are in high school level.",
            "College undergraduate shared with 5.4%, and 2.4% are college graduate."
        ],
        [
            "Health"
        ],
        [
            "There is one government hospital in the town, the Cotabato Sanitarium, but it caters only to specific health needs.",
            "There are about 26 Barangay Health Centers and 10 health personnel, composed of 1 medical doctor, 1 dental doctor, 6 midwives, 1 nurse and 1 sanitary inspector, serving the 39 barangays of the municipality.",
            "The health personnel are being augmented by 8 health workers and 39 trained hilots."
        ],
        [
            "See also"
        ],
        [
            "List of renamed cities and municipalities of the Philippines"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sultan Kudarat |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Bangsamoro (BARMM)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Executive Order No.",
            "82, s. 1947 (August 18, 1947), Organizing into ten municipalities all, except three, municipal districts in the province of Cotabato and annexing the said three municipal districts to the municipality of Cotabato, retrieved June 19, 2022"
        ],
        [
            "^ Basman, Taj (January 23, 2021).",
            "\"13 killed in police operations in Sultan Kudarat, Maguindanao\".",
            "Rappler.",
            "Retrieved March 4, 2023."
        ],
        [
            "^ Gem Avanceña (January 25, 2021).",
            "The Big Story: 13 killed in joint police-military operations in Sultan Kudarat, Maguindanao (news report).",
            "One News.",
            "Retrieved March 4, 2023 – via Facebook."
        ],
        [
            "^"
        ],
        [
            "\"Sultan Kudarat, Maguindanao : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 19 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"ARMM – Autonomous Region in Muslim Mindanao\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Maguindanao\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Sultan Kudarat Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "2000 Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Inquirer.net, Sultan Kudarat town aims for nat’l recognition"
        ],
        [
            "Places adjacent to Sultan Kudarat, Maguindanao del Norte"
        ],
        [
            "Sultan Mastura / Parang"
        ],
        [
            "Illana Bay"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Pigcawayan, Cotabato"
        ],
        [
            "Cotabato City"
        ],
        [
            "Kabuntalan"
        ],
        [
            "vteProvince of Maguindanao del NorteDatu Odin Sinsuat (capital)  Cotabato City (largest city)Municipalities"
        ],
        [
            "Barira"
        ],
        [
            "Buldon"
        ],
        [
            "Datu Blah T. Sinsuat"
        ],
        [
            "Datu Odin Sinsuat"
        ],
        [
            "Kabuntalan"
        ],
        [
            "Matanog"
        ],
        [
            "Northern Kabuntalan"
        ],
        [
            "Parang"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sultan Mastura"
        ],
        [
            "Talitay"
        ],
        [
            "Upi"
        ],
        [
            "Component Cities"
        ],
        [
            "Cotabato City (administratively and statistically independent from the province, but grouped with Maguindanao del Norte for geographical and the purpose of electing representatives to the Congress of the Philippines)"
        ],
        [
            "vte Bangsamoro Autonomous Region in Muslim Mindanao (BARMM)Regional center"
        ],
        [
            "Cotabato City (de facto)"
        ],
        [
            "Parang, Maguindanao del Norte (de jure)"
        ],
        [
            "Provinces"
        ],
        [
            "Basilan"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Sulu"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Independent component cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Component cities"
        ],
        [
            "Lamitan"
        ],
        [
            "Marawi"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Bongao"
        ],
        [
            "Buluan"
        ],
        [
            "Datu Odin Sinsuat"
        ],
        [
            "Jolo"
        ],
        [
            "Lamitan"
        ],
        [
            "Marawi"
        ],
        [
            "Municipalities"
        ],
        [
            "Akbar"
        ],
        [
            "Al-Barka"
        ],
        [
            "Amai Manabilang"
        ],
        [
            "Ampatuan"
        ],
        [
            "Bacolod-Kalawi"
        ],
        [
            "Balabagan"
        ],
        [
            "Balindong"
        ],
        [
            "Banguingui"
        ],
        [
            "Barira"
        ],
        [
            "Bayang"
        ],
        [
            "Binidayan"
        ],
        [
            "Bongao"
        ],
        [
            "Buadiposo-Buntong"
        ],
        [
            "Bubong"
        ],
        [
            "Buldon"
        ],
        [
            "Buluan"
        ],
        [
            "Butig"
        ],
        [
            "Calanogas"
        ],
        [
            "Datu Abdullah Sangki"
        ],
        [
            "Datu Anggal Midtimbang"
        ],
        [
            "Datu Blah T. Sinsuat"
        ],
        [
            "Datu Hoffer Ampatuan"
        ],
        [
            "Datu Montawal"
        ],
        [
            "Datu Odin Sinsuat"
        ],
        [
            "Datu Paglas"
        ],
        [
            "Datu Piang"
        ],
        [
            "Datu Salibo"
        ],
        [
            "Datu Saudi-Ampatuan"
        ],
        [
            "Datu Unsay"
        ],
        [
            "Ditsaan-Ramain"
        ],
        [
            "Ganassi"
        ],
        [
            "General Salipada K. Pendatun"
        ],
        [
            "Guindulungan"
        ],
        [
            "Hadji Mohammad Ajul"
        ],
        [
            "Hadji Muhtamad"
        ],
        [
            "Hadji Panglima Tahil"
        ],
        [
            "Indanan"
        ],
        [
            "Jolo"
        ],
        [
            "Kabuntalan"
        ],
        [
            "Kadayangan"
        ],
        [
            "Kalingalan Caluang"
        ],
        [
            "Kapai"
        ],
        [
            "Kapalawan"
        ],
        [
            "Kapatagan"
        ],
        [
            "Languyan"
        ],
        [
            "Lantawan"
        ],
        [
            "Ligawasan"
        ],
        [
            "Lugus"
        ],
        [
            "Lumba-Bayabao"
        ],
        [
            "Lumbaca-Unayan"
        ],
        [
            "Lumbatan"
        ],
        [
            "Lumbayanague"
        ],
        [
            "Luuk"
        ],
        [
            "Madalum"
        ],
        [
            "Madamba"
        ],
        [
            "Maguing"
        ],
        [
            "Maimbung"
        ],
        [
            "Malabang"
        ],
        [
            "Malidegao"
        ],
        [
            "Maluso"
        ],
        [
            "Mamasapano"
        ],
        [
            "Mangudadatu"
        ],
        [
            "Mapun"
        ],
        [
            "Marantao"
        ],
        [
            "Marogong"
        ],
        [
            "Masiu"
        ],
        [
            "Matanog"
        ],
        [
            "Mulondo"
        ],
        [
            "Nabalawag"
        ],
        [
            "Old Kaabakan"
        ],
        [
            "Northern Kabuntalan"
        ],
        [
            "Old Panamao"
        ],
        [
            "Omar"
        ],
        [
            "Pagalungan"
        ],
        [
            "Pagayawan"
        ],
        [
            "Paglat"
        ],
        [
            "Pahamuddin"
        ],
        [
            "Pandag"
        ],
        [
            "Pandami"
        ],
        [
            "Panglima Estino"
        ],
        [
            "Panglima Sugala"
        ],
        [
            "Pangutaran"
        ],
        [
            "Parang (Maguindanao del Norte)"
        ],
        [
            "Parang (Sulu)"
        ],
        [
            "Pata"
        ],
        [
            "Patikul"
        ],
        [
            "Piagapo"
        ],
        [
            "Picong"
        ],
        [
            "Poona Bayabao"
        ],
        [
            "Pualas"
        ],
        [
            "Rajah Buayan"
        ],
        [
            "Saguiaran"
        ],
        [
            "Sapa-Sapa"
        ],
        [
            "Shariff Aguak"
        ],
        [
            "Shariff Saydona Mustapha"
        ],
        [
            "Siasi"
        ],
        [
            "Sibutu"
        ],
        [
            "Simunul"
        ],
        [
            "Sitangkai"
        ],
        [
            "South Ubian"
        ],
        [
            "South Upi"
        ],
        [
            "Sultan Dumalondong"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sultan Mastura"
        ],
        [
            "Sultan sa Barongis"
        ],
        [
            "Sumisip"
        ],
        [
            "Tabuan-Lasa"
        ],
        [
            "Tagoloan II"
        ],
        [
            "Talayan"
        ],
        [
            "Talipao"
        ],
        [
            "Talitay"
        ],
        [
            "Tamparan"
        ],
        [
            "Tandubas"
        ],
        [
            "Tapul"
        ],
        [
            "Taraka"
        ],
        [
            "Tipo-Tipo"
        ],
        [
            "Tubaran"
        ],
        [
            "Tuburan"
        ],
        [
            "Tugaya"
        ],
        [
            "Tugunan"
        ],
        [
            "Turtle Islands"
        ],
        [
            "Ungkaya Pukan"
        ],
        [
            "Upi"
        ],
        [
            "Wao"
        ],
        [
            "Other"
        ],
        [
            "Special Geographic Area"
        ],
        [
            "Clusters"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vteComponent local government units of Shariff Kabunsuan (Former province)Municipalities"
        ],
        [
            "Barira"
        ],
        [
            "Buldon"
        ],
        [
            "Datu Blah T. Sinsuat"
        ],
        [
            "Datu Odin Sinsuat"
        ],
        [
            "Kabuntalan"
        ],
        [
            "Matanog"
        ],
        [
            "Northern Kabuntalan"
        ],
        [
            "Parang"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sultan Mastura"
        ],
        [
            "Upi"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sultan_Kudarat,_Maguindanao_del_Norte&oldid=1222309783\""
        ],
        [
            "Categories: Municipalities of Maguindanao del NortePolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textPages using the Kartographer extension"
        ]
    ]
}