{
    "name": "Sumilao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Sumilao"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlands日本語PangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°19′41″N 124°58′42″E﻿ / ﻿8.3281°N 124.9783°E﻿ / 8.3281; 124.9783"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bukidnon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Sumilao\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesSumilaoMunicipalityMunicipality of SumilaoLandscape of a mountainous area in Sumilao"
        ],
        [
            "FlagSealMap of Bukidnon with Sumilao highlightedOpenStreetMapSumilaoLocation within the PhilippinesCoordinates: 8°19′41″N 124°58′42″E﻿ / ﻿8.3281°N 124.9783°E﻿ / 8.3281; 124.9783CountryPhilippinesRegionNorthern MindanaoProvinceBukidnonDistrict"
        ],
        [
            "1st districtFoundedJuly 1, 1956Barangays10"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJose Antonio A. Villo • Vice MayorJhun Dhee C. Leparto • RepresentativeMa.",
            "Lourdes O. Acosta-Alba • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "George Jeremy B. BaulaBenjamin A. BalumaGary A. del RosarioNissabel T. CañadaCresanto J. Apiag Jr.Leandro C. BadeRomeo B. AnobaVernie N. Castillo"
        ],
        [
            " • Electorate18,843 voters (2022)Area • Revenue₱ 156.5 million (2020) • Assets₱ 422.3 million (2020) • Expenditure₱ 136.5 million (2020) • Liabilities₱ 157.1 million (2020)Service provider • ElectricityBukidnon 2 Electric Cooperative (BUSECO)Time zoneUTC+8 (PST)ZIP code8701PSGC101319000IDD : area code +63 (0)88Native languagesBinukid Cebuano Ata Manobo TagalogWebsitewww.sumilaobuk.gov.ph"
        ],
        [
            "Sumilao, officially the Municipality of Sumilao (Bukid and Higaonon: Banuwa ta Sumilao; Cebuano: Lungsod sa Sumilao; Tagalog: Bayan ng Sumilao), is a 4th class municipality in the province of Bukidnon, Philippines.",
            "According to the 2020 census, it has a population of 29,531 people."
        ],
        [
            "Etymology"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(February 2022) (Learn how and when to remove this message)"
        ],
        [
            "The word “Sumilao” came from a Bukidnon phrase \"Kon sumilaw da”, which means “When light comes again.”"
        ],
        [
            "A story has been told that there lived a man named Walu who possessed supernatural powers.",
            "Many believed that he lives somewhere in Kilabong, a place near Palaopao Hill.",
            "Time came when seven “baylan” (spiritual leaders who possessed special powers), who were living at the plain below, fabricated degrading stories against Walu."
        ],
        [
            "This angered him.",
            "Standing on the hill, he shouted at the top of his voice and pointed to the seven men rebuking them for their evil intentions.",
            "At this instant, bright, glaring light emitted from the tip of the pointing finger and the seven “baylan” were blinded.",
            "It was said that their eyesight will be restored when the same light will come again."
        ],
        [
            "History"
        ],
        [
            "Oral history from the town's old-time residents stated that before the Spanish colonization, the present site of the Poblacion was already inhabited.",
            "Four big buildings housing several families were already constructed.",
            "These families were directly controlled by a settlement datu or chief.",
            "They have grouped together to protect themselves from the fierce “mangangayaw” or headhunters from the hills."
        ],
        [
            "When the Spaniards came, Datu Manlomero and Opecio, with their men, fought against the invading conquistadores.",
            "Unfortunately, the natives were defeated due to the inferiority of their weapons."
        ],
        [
            "So they laid down their arms and accepted the new ruler.",
            "They were baptized to the Christian religion.",
            "In the 1860s, the Recollect missionaries were already making visits to Sumilao."
        ],
        [
            "When the Jesuit priests took over the missionary work in Bukidnon in the 1870s, Sumilao was already one of the rancherias of the Visita of Tagoloan.",
            "Regular missionary trips to Sumilao and Linabo were intensified by Fathers Juan Terricarbas and Eusebio Barrado.",
            "By 1887, there were 200 Christian residents of the Rancheria de Sumilao."
        ],
        [
            "In January 1890, Sumilao was created into the first active mission station in Bukidnon, thus making her the nucleus of the Roman Catholic faith in the province.",
            "Mission de Sumilao assumed jurisdiction over the rancherias of Tagoloan up to Bugcaon, formerly all under the parish of Tagoloan."
        ],
        [
            "Sumilao was now under the Residencia de Balingasag.",
            "The name rancheria was later changed to reduccion de Nuevo Cristianos.",
            "By 1891, Mission de Sumilao had 15 reducciones with a combined Christian population of 8, 399.",
            "The reduccion of Sumilao, however had 11, 340 inhabitants.",
            "Father Eusebio Barrado was the missionary curate during that time."
        ],
        [
            "In 1893, Mission de Mailag (Mailag) was created.",
            "This reduced the number of reducciones of Mission de Sumilao.",
            "By 1894, the mission had only 4, 122 Christian inhabitants."
        ],
        [
            "During the Spanish colonizations, the local datu were appointed to political positions by the missionary priests.",
            "These political leaders were under the administrative control of the higher authorities who are stationed at Misamis Oriental.",
            "Some of these local leaders were Capitanes Dalahigon, Alejo Yansao – alis Mandita, Akuman and Tao."
        ],
        [
            "In 1907, the American took over the administration of Bukidnon.",
            "The town's chief was now called president.",
            "In 1914, Sumilao was one of the communities created into municipal districts of Bukidnon pursuant to Executive Order No.",
            "10 issued by Frank Carpenter, Governor of the Department of Mindanao and Sulu on August 15, 1914."
        ],
        [
            "It was also during the American regime that a parochial school known as Little Flower Academy flourished.",
            "Its operation, however, lasted only up to the outbreak of World War II.",
            "The Catholic Church and the school building were bombed by the American fighter planes in 1944."
        ],
        [
            "Mr. Juan Sumbalan was the president sometime in the 1920s up to the outbreak of the war.",
            "Under the Japanese military government, Mr, Restituto Parista was appointed as the town's chief."
        ],
        [
            "During the war, several young and brave men of Sumilao joined the guerilla resistance movement.",
            "Some of these men were Lieutenants Candido G. Sumbalan and Alejandro Sale."
        ],
        [
            "When liberation came, Mr, Juan Sumbalan, who returned to power, ordered some of his men to settle in Kisolon to protect themselves from the Japanese stragglers who were still roaming in the vicinity of Poblacion, Sumilao.",
            "Kisolon which was then a part of Impasugong, was formerly a ranch owned by a certain Guingona."
        ],
        [
            "When Mr. Juan Sumbalan died in 1945, Mr. Restituto Parista was appointed to the vacated position.",
            "In 1953, Mr, Martin Langue replaced Mr. Parista.",
            "However, he did not stay long for on that same year, Mr. Candido G. Sumbalan was appointed Mayor by Provincial Governor Marcus A. Reciña."
        ],
        [
            "Political Birth of the Municipality"
        ],
        [
            "Although Sumilao was one of the early missionary centers of Bukidnon, its economic and political growth was quite slow.",
            "This could be attested by the fact that by 1917, four municipal districts of the province were organized into regular municipalities.",
            "These municipalities have bigger populations and their leaders were politically prepared to administer the affairs of their respective municipalities.",
            "Population conducted during the period of 1918-1948 showed that Sumilao has the lowest number of inhabitants compared to the other municipal districts.",
            "It has only one barangay in the 1900s (Barangay Puntian)."
        ],
        [
            "Sumilao became a regular municipality on July 1, 1956, pursuant to Executive Order No.",
            "272 signed by the President Carlos P. Garcia.",
            "The following were the elected and appointed officials of the municipality from its establishment up to the present."
        ],
        [
            "The Sumilao Farmers' March"
        ],
        [
            "On December 3, 2007, 55 farmers of the Higaonon tribe from Sumilao arrived in Metro Manila, 2 months after their march through 13 provinces from Mindanao to ask the government to stop the conversion of the land they are claiming into a hog farm.",
            "They farmers petitioned the Department of Agrarian Reform (DAR) to issue a cease-and-desist order (CDO) on the contested 144-hectare property in Barangay (village) San Vicente, Sumilao which San Miguel Foods Inc. (SMFI) converted into a hog farm.",
            "The Supreme Court of the Philippines had earlier dismissed the farmers' rights lack of legal standing.",
            "Farmer Tuminhay stated that: “Our titles were cancelled because Norberto Quisumbing was allowed to convert his land on condition that he would implement a five-year development plan.",
            "Since he did not implement the plan, it is only proper that DAR renew the CARP process and give us back our titles.”  Quisumbing's development plan for the property included the establishment of a development academy, a cultural center, an institute for livelihood science, a museum, library, golf course, a sports development complex, an agro-industrial park, forest development and support facilities, and construction of a 360-room hotel, restaurant, housing projects, inter alia."
        ],
        [
            "On December 17, 2007, the government revoked the conversion order on the disputed 144-hectare lot in Sumilao, resulting to the return of the land ownership to the 55 members of the Higaonon tribe farmers who marched 1,700 kilometers for 2 months from Mindanao to Metro Manila.",
            "The order reads: “Wherefore premises considered and as recommended by DAR, the petition for cancellation and/or revocation of the conversion order covering 144 hectares of land…is hereby granted.” San Miguel Foods as landowner must be paid the current value of the property before the land can be distributed to the farmers."
        ],
        [
            "In March 2008, San Miguel and the Sumilao farmers signed a deal returning 50 hectares to the farmers.",
            "The farmers will get a total of 144 hectares, which is equivalent in size of the original property they sought for."
        ],
        [
            "Geography"
        ],
        [
            "Sumilao is one of the 20 municipalities of Bukidnon.",
            "It is located between latitudes 8 degrees, 11 seconds and 8 degrees, 12 seconds North and longitudes 124 degrees, 52 seconds and 125 degrees and 2 seconds East.",
            "It is bounded in the east by the Municipality of Impasugong, in the south by the municipalities of Baungon and Libona and in the north by the Municipality of Manolo Fortich."
        ],
        [
            "It is particularly bounded in the east by the town of Impasugong, south by Lantapan and Talakag, west and north by Manolo Fortich."
        ],
        [
            "Ten barangays comprise the municipality with Kisolon as the seat of government.",
            "It occupies an aggregate land area of 20, 445 hectares.",
            "Sumilao is traversed by the deep Kulaman Canyon which physically separates six barangays from the Poblacion and Kisolon."
        ],
        [
            "Sumilao is approximately 62 kilometers from Cagayan de Oro and 29 kilometers from the provincial capital, the City of Malaybalay.",
            "It is situated between the two growth centers of the province, Manolo Fortich and the City of Malaybalay.",
            "It is accessible by land transportation and vehicles plying the Cagayan de Oro and Malaybalay/Valencia routes passing through the eight kilometer stretch of the National Sayre Highway, which traverses the municipality's area."
        ],
        [
            "Land area and classification"
        ],
        [
            "Sumilao has an aggregate land area of is 207.49 km2 representing 2.4% of the total land area of the province.",
            "Its participation in the region is 0.7212.",
            "Of the ten barangays, Lupiagan has the largest area accounting to about 29.18% of the total land area.",
            "San Vicente is the smallest with 8.54 km2 or 4.14% of the total land area."
        ],
        [
            "The Department of Environment and Natural Resources (DENR) data revealed that the information on Sumilao's total land area which is 207.49 km2 can be classified as: 155.92 km2 are considered alienable and disposable and 51.57 km2 of which are forestal/timberland."
        ],
        [
            "Topography"
        ],
        [
            "Generally, Sumilao's physical configuration is characterized by extreme features.",
            "From the south to the central portion moving towards the north and north-western areas are mountain ranges, canyons, and high relief topography, including part of Mt.",
            "Kitanglad, the second highest mountain peak in the Philippines, and the Palaopao Mountains.",
            "In the Upper Kulaman areas, settlements sprawl between the vast stretches of pineapple plantations.",
            "Per topographic map of the municipality from NAMRIA, the average elevation of Sumilao is 600 meters above sea level."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Sumilao, Bukidnon"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "152(6.0)"
        ],
        [
            "103(4.1)"
        ],
        [
            "80(3.1)"
        ],
        [
            "79(3.1)"
        ],
        [
            "185(7.3)"
        ],
        [
            "275(10.8)"
        ],
        [
            "292(11.5)"
        ],
        [
            "319(12.6)"
        ],
        [
            "298(11.7)"
        ],
        [
            "275(10.8)"
        ],
        [
            "195(7.7)"
        ],
        [
            "120(4.7)"
        ],
        [
            "2,373(93.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "16.2"
        ],
        [
            "12.9"
        ],
        [
            "13.1"
        ],
        [
            "14.4"
        ],
        [
            "25.9"
        ],
        [
            "28.5"
        ],
        [
            "29.9"
        ],
        [
            "29.6"
        ],
        [
            "28.4"
        ],
        [
            "27.8"
        ],
        [
            "22.0"
        ],
        [
            "16.4"
        ],
        [
            "265.1"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Bukidnon province has two prevailing climate variations based on rainfall pattern existing in its northern and southern sections.",
            "The northern part where Sumilao is located falls under the third or intermediate A type.",
            "Under this type, seasons are not very pronounced; relatively dry from November to April and wet for the rest of the year, maximum rain period is not very pronounced.",
            "Specifically, the climate in the southern part of the municipality is relatively cool and humid throughout the year.",
            "These areas are along the foot of the Mt.",
            "Kitanglad while in the northern areas, rainfall is more or less evenly distributed throughout the year.",
            "Most often in these areas, heavy downpour occurs every afternoon while in the morning the sun shines.",
            "The average heaviest rainfall for the past five years occurs in June with 431.7 millimeters and the lowest in March with only 89.2 millimeters."
        ],
        [
            "Barangays"
        ],
        [
            "Sumilao is politically subdivided into 10 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 101319001   Kisolon"
        ],
        [
            " 39.1%"
        ],
        [
            " 11,532"
        ],
        [
            " 10,584"
        ],
        [
            "  ▴"
        ],
        [
            " 0.86%"
        ],
        [
            " 101319002   Culasi"
        ],
        [
            " 2.2%"
        ],
        [
            " 635"
        ],
        [
            " 560"
        ],
        [
            "  ▴"
        ],
        [
            " 1.26%"
        ],
        [
            " 101319003   Licoan"
        ],
        [
            " 2.9%"
        ],
        [
            " 858"
        ],
        [
            " 848"
        ],
        [
            "  ▴"
        ],
        [
            " 0.12%"
        ],
        [
            " 101319004   Lupiagan"
        ],
        [
            " 2.7%"
        ],
        [
            " 809"
        ],
        [
            " 840"
        ],
        [
            "  ▾"
        ],
        [
            " −0.38%"
        ],
        [
            " 101319005   Ocasion"
        ],
        [
            " 2.1%"
        ],
        [
            " 619"
        ],
        [
            " 632"
        ],
        [
            "  ▾"
        ],
        [
            " −0.21%"
        ],
        [
            " 101319006   Puntian"
        ],
        [
            " 5.3%"
        ],
        [
            " 1,566"
        ],
        [
            " 1,575"
        ],
        [
            "  ▾"
        ],
        [
            " −0.06%"
        ],
        [
            " 101319007   San Roque"
        ],
        [
            " 4.3%"
        ],
        [
            " 1,264"
        ],
        [
            " 1,124"
        ],
        [
            "  ▴"
        ],
        [
            " 1.18%"
        ],
        [
            " 101319008   San Vicente"
        ],
        [
            " 10.6%"
        ],
        [
            " 3,139"
        ],
        [
            " 2,593"
        ],
        [
            "  ▴"
        ],
        [
            " 1.93%"
        ],
        [
            " 101319009  Poblacion"
        ],
        [
            " 15.9%"
        ],
        [
            " 4,705"
        ],
        [
            " 4,464"
        ],
        [
            "  ▴"
        ],
        [
            " 0.53%"
        ],
        [
            " 101319010   Vista Villa"
        ],
        [
            " 8.6%"
        ],
        [
            " 2,533"
        ],
        [
            " 2,448"
        ],
        [
            "  ▴"
        ],
        [
            " 0.34%"
        ],
        [
            "Total"
        ],
        [
            "29,531"
        ],
        [
            "25,668"
        ],
        [
            " ▴"
        ],
        [
            "1.41%"
        ],
        [
            "Sumilao is politically subdivided into ten (10) barangays, six of which are traversed by the Kulaman River that separate them from the other four barangays.",
            "The ten barangays are Kisolon, Kulasi, Licoan, Lupiagan, Occasion, Poblacion, Puntian, San Roque, San Vicente and Vista Villa.",
            "Unlike any other municipalities, the seat of government in Sumilao is located at barangay Kisolon; Barangay Poblacion serves as a satellite barangay for other rural barangays."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of SumilaoYearPop.±% p.a.1918 1,490—    1939 2,670+2.82%1948 1,981−3.26%1960 3,712+5.37%1970 6,528+5.80%1975 6,927+1.20%1980 8,635+4.50%YearPop.±% p.a.1990 13,494+4.57%1995 15,640+2.80%2000 17,958+3.01%2007 21,720+2.66%2010 25,668+6.27%2015 27,660+1.43%2020 29,531+1.30%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Sumilao, Bukidnon, was 29,531 people, with a density of 150 inhabitants per square kilometre or 390 inhabitants per square mile."
        ],
        [
            "Sumilao had the lowest population in the census year 1990 and second lowest in 1995, among the 21 municipalities.",
            "However, as for population growth, it ranks the highest percent increase of 18.90% with an increase population of 2,146 between 1990 and 1995.",
            "On the census conducted by the Philippine Statistics Authority on the year 2000, the population of Sumilao increased to 17,958 brought about by in-migration of agro-industrial workers from the neighboring towns of Manolo Fortich, Impasugong, Malaybalay City and from the provinces of Misamis Oriental, Misamis Occidental, Camiguin, Bohol and other places in Luzon."
        ],
        [
            "Population density"
        ],
        [
            "The urban barangay of Kisolon and the two urbanizable barangays of San Vicente and Poblacion and one rural barangay of Vista Villa have a density of 160 people/km2.",
            "The density appears very good and ideal noting the density against the census of 10,000 people/km2."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Sumilao"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  39.10"
        ],
        [
            "2009  40.21"
        ],
        [
            "2012  45.10"
        ],
        [
            "2015  43.02"
        ],
        [
            "2018  32.26"
        ],
        [
            "2021  38.47"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Sumilao is basically an agriculture-based community where most of the populace are dependents on agriculture as its main economic activity and as source of main income.",
            "Ordinary farmers are planting rice, corn and vegetables both traditional and high value crops while the large corporations, the DOLE Philippines-Skyland Division and the De Monte Philippines, Inc. are engaged in planting commercial crops of sweet lakatan variety banana and pineapple.",
            "There is also an influx of agro-industrial establishment in the area, the piggery and breeder farms but required a minimal employment only.",
            "The municipality boost of its natural and man-made attractions which when developed can be a source of income for the populace.",
            "Small cottage industries like broom making made of guiyong, ceramics and pot made of clay and hollow blocks making are gaining headway in the area."
        ],
        [
            "Tourism"
        ],
        [
            "Alalum Falls"
        ],
        [
            "Alalum Falls"
        ],
        [
            "The falls is located along the Sayre Highway and less than a kilometer distance from the Municipal Hall.",
            "Its imposing grandeur can easily be seen by travelers on motor vehicles.",
            "It is approximately 148 feet (45 m) high.",
            "However, due to ongoing public constructions, it may be difficult to catch a glimpse of the attraction.",
            "But the falls will be open to public again soon."
        ],
        [
            "Sumalsag Cave"
        ],
        [
            "Known as the longest cave in the first Congressional District of Bukidnon, Sumalsag Cave is located in Kilabong, Vista Villa, Sumilao, Bukidnon.",
            "It is generally wet or filled with water.",
            "The total length of Sumalsag Cave's three branches is approximately 1,859 meters.",
            "Its wide entrance, boasting of huge stalactites, opens to a spacious chamber floored with mud.",
            "From its mouth, a gigantic column that dwarfs any person standing near it can be seen.",
            "Beyond this chamber is a bigger chamber, which allegedly used to be a rebel headquarters.",
            "Remnants of the headquarters facilities can still be found.",
            "Stalagmites, stalactites and rimstones can be seen."
        ],
        [
            "Lagundang Cave"
        ],
        [
            "Lagundang Cave boasts of its 225-foot (69 m) entrance, a mini Niagara Falls and ponds full of crabs and fishes.",
            "It is a wonder how crabs and fishes got into this cave, the only opening of which is a vertical drop.",
            "Except for treasure hunting, there has been no known activities pertaining to Lagundang Cave.",
            "Had the public known of its existence, repelling enthusiast would be thrilled therein and the fascinating rock formations inside the cave."
        ],
        [
            "Mt.",
            "Palaopao"
        ],
        [
            "Stretching along the boundary of Sumilao and Manolo Fortich from the north-east, Mt.",
            "Palaopao stands 836 feet above sea level.",
            "The top was once covered with virgin forest while the side contain several caves, rock shelters and limestones overhangs contain wooden coffin and artifacts which designs are traced back during the metal age.",
            "These places were used as burial ground in the early part of the 19th century."
        ],
        [
            "Mapaso Spring"
        ],
        [
            "Mapaso is a Binukid term for hot.",
            "The spring is located at the north-east part of Sitio Alas-as, Barangay Licoan, Sumilao, Bukidnon.",
            "It is reachable in two-hour hike through a poisonous ivy trail or cliff rappeling.",
            "As one of the potential tourist spots, the KIN-PAMB LivelihooD Committee and the Integrated Area Fund approved the Development Fund of Three Million Pesos for the development of the area."
        ],
        [
            "Basag Cave"
        ],
        [
            "The presence of 8 waterfalls, all in Basag Cave is incredibly unique.",
            "There is also an abundance of stalactites, stalagmites"
        ],
        [
            "Healthcare"
        ],
        [
            "Health as a devolved function, the Municipal Government through the Local Health Board and the Municipal Health Office, has given priority on health related programs.",
            "Crude birth rates and crude death rates are maintained and improved through the implementation of programs and projects of health.",
            "The Municipal Health Office of Sumilao was renovated and a Philhealth station was constructed adjacent to it manned by the personnel from the Provincial Government under the Provincial Indigency Health Program of Jose Ma.",
            "R. Zubiri, Jr.",
            "The Municipal Health Office is manned by the designated Officer-in-Charge who is at the same time its medical technologist, including other personnel like the DOH representative, public health nurse, rural sanitary inspector and midwives with the Barangay Health Workers and trained hilots as extension workers.",
            "The functions of the OIC of the said office are only focused on signing Daily Time Records, payrolls, communication representing head of office and other administrative functions but not on signing death certificates, medico legal and all claims which are referred to the Provincial Health Office in Malaybalay City."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Sumilao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Executive Order No.",
            "272, s. 1957 | GOVPH\".",
            "Official Gazette of the Republic of the Philippines.",
            "4 October 1957."
        ],
        [
            "^ Inquirer.net, Protesting Sumilao farmers reach Manila After 2-month march from Mindana"
        ],
        [
            "^ https://www.rappler.com/nation/sumilao-farmers-march-for-robredo/"
        ],
        [
            "^ Inquirer.net, Palace restores Sumilao land to agricultural use"
        ],
        [
            "^ GMANews.tv, Parties to Sumilao land row hit ‘win-win’ deal"
        ],
        [
            "^"
        ],
        [
            "\"Sumilao: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 April 2020."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bukidnon\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Sumilao."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Places adjacent to Sumilao"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Sumilao"
        ],
        [
            "Impasugong"
        ],
        [
            "Baungon"
        ],
        [
            "Mount Kitanglad"
        ],
        [
            "Malaybalay"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Sumilao&oldid=1194742033\""
        ],
        [
            "Categories: Municipalities of BukidnonPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textArticles needing additional references from February 2022All articles with unsourced statementsArticles with unsourced statements from February 2022Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}