{
    "name": "Taguig",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Taguig"
        ],
        [
            "39 languages"
        ],
        [
            "العربية閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoEuskaraفارسیFrançais한국어IlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuმარგალურიBahasa MelayuМонголNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogТатарча / tatarçaTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadView sourceView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadView sourceView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°31′N 121°03′E﻿ / ﻿14.52°N 121.05°E﻿ / 14.52; 121.05"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Highly urbanized city in Metro Manila, Philippines"
        ],
        [
            "Highly urbanized city in National Capital Region, PhilippinesTaguigHighly urbanized citySkyline of Bonifacio Global City and the Embo barangaysNapindan ParolaMinor Basilica of St. AnneTaguig City HallArca SouthPhilippine Army HeadquartersLibingan ng mga BayaniMercado del Lago Lakeshore"
        ],
        [
            "FlagSealWordmarkEtymology: Taga-giik (rice thresher)Nickname: ProbinsyudadMotto: \"I Love Taguig\" \"Think Big.",
            "Dream Big.",
            "Love Taguig.",
            "\"Anthem: Martsa ng Taguig (\"Taguig March\")"
        ],
        [
            "Map of Metro Manila with Taguig highlightedOpenStreetMapTaguigLocation within the PhilippinesCoordinates: 14°31′N 121°03′E﻿ / ﻿14.52°N 121.05°E﻿ / 14.52; 121.05CountryPhilippinesRegionNational Capital RegionProvincenoneDistrict"
        ],
        [
            "1st district (shared with Pateros) and 2nd districtEstablishedApril 25, 1587Municipal corporationJanuary 31, 1901 • TypeSangguniang Panlungsod • MayorMa.",
            "Laarni L. Cayetano (Nacionalista) • Vice MayorArvin Ian V. Alit (Nacionalista) • Representatives"
        ],
        [
            "Ricardo S. Cruz Jr. (1st District with Pateros) (Nacionalista)"
        ],
        [
            "Amparo Maria J. Zamora (2nd District) (Nacionalista)"
        ],
        [
            "Luis Jose Angel Campos Jr. (Makati's 2nd District comprising the Embo barangays) (NPC)"
        ],
        [
            " • City Council"
        ],
        [
            "Members"
        ],
        [
            "1st DistrictJimmy LabampaGigi Valenzuela De-MesaRodil MarcelinoFanella Joy Panga-CruzGamaliel San PedroCarlito OgalinolaRaul AquinoLamberto Mañosca2nd DistrictNicky SupanJaime GarciaMarisse Balina-EronYasser PangandamanJomil Bryan SernaEd PradoEdgar BaptistaAlex PenolioLiga ng mga Barangay PresidentJorge Daniel BocoboSK Federation PresidentJoana Mae Pagkalinawan"
        ],
        [
            " • Electorate894,648 voters (2022)Area"
        ],
        [
            "Taguig (Tagalog:"
        ],
        [
            "The city is located alongside the northwestern shores of Laguna de Bay in Metro Manila, Philippines.",
            "The city is widely known for Bonifacio Global City, one of the leading financial centers of the Philippines.",
            "Originally a fishing village during the Spanish and American colonial periods, it experienced rapid growth when former military reservations were converted by the Bases Conversion and Development Authority (BCDA) into financial centers and mixed-use planned communities.",
            "Taguig became a highly urbanized city with the passage of Republic Act No.",
            "8487 in 2004, which was ratified by a plebiscite."
        ],
        [
            "The city covers about 54.04 square kilometers (20.86 sq mi).",
            "It is located in the southeastern portion of Metro Manila and bordered by Pasig and Pateros to the north, Makati and Mandaluyong to the northwest, Pasay and Parañaque to the west, Taytay, Rizal to the northeast and Muntinlupa to the south."
        ],
        [
            "Etymology"
        ],
        [
            "The original farmer-fishermen of the area, about 800 in number, were good at threshing rice after harvest.",
            "Hence, they were referred to as \"mga taga-giik\" (Tagalog for \"rice thresher\") and the settlement as \"pook ng mga taga-giik\" (lit. transl.",
            "place of the rice threshers).",
            "Spanish friar Fray Alonso de Alvarado, together with conquistador Ruy López de Villalobos who crossed the Pasig River to reach the city's present site in 1571, found \"taga-giik\" difficult to pronounce.",
            "\"Tagui-ig\" was later shortened to its current form \"Taguig\".",
            "It is also spelled as \"Tagig\" or \"Tagui\"."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Map of the Union of Tondo and Pasig, circa 1450, with Tagig on the southeast"
        ],
        [
            "Before the Spaniards came, Taguig was a stablished Tagalog settlement with Moro and Chinese present in the area as revealed by the recent archaeological diggings of various artifacts like cups, plates and other utensils, which bear Chinese characters.",
            "This was believed to have originated from China's Ming dynasty.",
            "Duck culture was practiced by the Tagalogs, particularly in the areas where the city and the Municipality of Pateros stands today."
        ],
        [
            "Spanish rule (1571-1898)"
        ],
        [
            "Simborio at Taguig Cemetery"
        ],
        [
            "Taguig was one of the earliest known territories of the Provincia de Tondo, that became the Provincia de Maynila to have been Christianized when the Spaniards succeeded in subjugating mainland Luzon through the Legazpi expedition in 1571.",
            "Between the years 1573 and 1587, Taguig was an encomienda under Captain Cervantes y Vergara with 3,200 inhabitants paying 1,879 and 1/2 tax."
        ],
        [
            "There was an attempt to transfers Tipas from Taguig to Pasig because the residents of that barrio dislike the Cura or Parish Priest stationed at Taguig during that time.",
            "They raised it to the Gobernadorcillo (Leader and Judge) at that time, he said for the issue to be resolve the bells from Taguig and Pasig will be ring simultaneously.",
            "Which of these bells should be heard in Tipas will be town where it belongs to.",
            "The Bells of Taguig prevailed, that's why Tipas remained to be within the Jurisdiction of Taguig."
        ],
        [
            "During that time, Taguig was accessible via the Pasig River, which was connected to two large bodies of water, Manila Bay and Laguna de Bay.",
            "The town produced more than enough rice for consumption but had less sugar cane to mill.",
            "The men lived through fishing while women wove cotton cloth and \"sawali\" from bamboo strips.",
            "The people of Taguig were known to have resisted both Spanish and American colonial rule.",
            "When the Katipunan was on its early years, many from Taguig became followers and later joined the uprising.",
            "The people of Taguig also joined the revolutionary government of General Emilio Aguinaldo on August 6, 1898."
        ],
        [
            "Santiago Bonifacio, the father of revolutionary Andres Bonifacio, hailed from Ligid Tipas."
        ],
        [
            "Attempted transfer of town center"
        ],
        [
            "In the 1880 up to 1919, flood water submerged almost all the lower portion of Taguig from Napindan to Bagumbayan during the months of August up to October.",
            "The Hacenderos of Maysapan and Taguig proposed to transfer the Town center and church to a higher place now part of Fort Bonifacio.",
            "The Parish Priest also supported the move and ordered to ready a parcel of land to be ready to build a new church to house the convent.",
            "However, since the local population of Taguig, during that time, are farmers and fishermen, the decision to move the town center and church was not that popular to them.",
            "They don't want move out away from their farmland and to the river leading them to the bay.",
            "The remnant of the church are still visible until the 1970's.",
            "The place was called \"Bahay Pari\" (Priest House)."
        ],
        [
            "American rule (1898-1946)"
        ],
        [
            "During the American occupation, Taguig natives fought against the forces of General Wheaton under the command of General Pio del Pilar.",
            "It was recorded that on February 6, 1899, Filipino forces including Taguig \"revolutionarios\" dislodged an American position in the hills of Taguig, now a portion of Pateros and Fort Bonifacio.",
            "They were defeated eventually by the Americans with superiority in the armaments and training.",
            "Taguig finally fell to the contingent of the First Washington Volunteer Infantry led by Col.",
            "Wholly."
        ],
        [
            "The defeat of the Filipinos after two years of struggle against the American forces subsequently subjected the Philippines to another system of governance.",
            "On August 14, 1898, United States occupied the islands and established a military government with General Wesley Merritt as the First Military Governor.",
            "He exercised legislative powers until September 1, 1900.",
            "At the start of American occupation, Taguig was proclaimed as an independent municipality with the promulgation of General Order No.",
            "4 on March 29, 1900.",
            "The town was subsequently incorporated to the newly created province of Rizal when the Philippine Commission promulgated Act No.",
            "137 on June 11, 1901."
        ],
        [
            "On October 12, 1903, Taguig, Muntinlupa and Pateros were merged by the virtue of Act.",
            "No.",
            "942 to be known as the Municipality of Pateros, with Pateros hosting the seat of the municipal government."
        ],
        [
            "It was also during the American Colonial Period that the United States government acquired a 25.78 km2 (9.95 sq mi) property of Taguig for military purposes.",
            "This large piece of land, which had a TCT dated 1902, was turned into a camp that became known as Fort William McKinley, named after the 25th president of the U.S. who was responsible for the American colonization of the Philippines."
        ],
        [
            "Japanese occupation (1942-1945)"
        ],
        [
            "When the Japanese occupied the Philippines in 1942, Fort McKinley was taken over by the Japanese Imperial Army.",
            "They occupied the military camp until the end of World War II in 1945."
        ],
        [
            "20th century (1945-1986)"
        ],
        [
            "Fort William McKinley, now Fort Bonifacio, was surrendered by the United States to the Philippines in 1946"
        ],
        [
            "After the Philippines gained its political independence from the United States on July 4, 1946, the US relinquished to the Republic of the Philippines all right of possession, jurisdiction, supervision and control over the Philippine territory except the use of the military bases.",
            "On May 14, 1949, Fort William McKinley was turned over to the Philippine government by virtue of the US Embassy Note No.",
            "0570.",
            "Fort McKinley was made the permanent headquarters of the Philippine Army in 1957 and was subsequently renamed Fort Bonifacio after the Father of the Philippine Revolution against Spain, Andres Bonifacio."
        ],
        [
            "Martial law era (1972-1986)"
        ],
        [
            "When President Ferdinand Marcos placed the Philippines under martial law in 1972, Taguig, which contained Fort Bonifacio, became the host of two detention centers full of political prisoners - the Maximum Security Unit (where Senators Jose W. Diokno and Benigno Aquino Jr. were detained)"
        ],
        [
            "Creation of the National Capital Region (1975)"
        ],
        [
            "In 1974, the name of Taguig's political subdivisions was changed from \"barrios\" to \"barangays\" following the nationwide implementation of the Integrated Reorganization Plan (IRP) under Presidential Decree No.",
            "557."
        ],
        [
            "Late 20th and early 21st centuries (1986-present)"
        ],
        [
            "Fort Bonifacio territorial dispute (1986)"
        ],
        [
            "View of the skyline of Bonifacio Global City from the Manila American Cemetery in Fort Bonifacio"
        ],
        [
            "In 1986, President Ferdinand Marcos issued Proclamation No.",
            "2475, which transferred control of the Fort Bonifacio area to Makati and reserved the area for military personnel and their dependents."
        ],
        [
            "Cityhood (1998)"
        ],
        [
            "In 1998, Republic Act No.",
            "8487 was enacted, pushing for the cityhood of Taguig."
        ],
        [
            "Contemporary history"
        ],
        [
            "The city's slogan with the word \"Probinsyudad\", a registered trademark since 2024"
        ],
        [
            "Aerial view of the Embo barangays in 2018.",
            "The barangays became part of Taguig in 2023 following the Supreme Court's decision favoring Taguig in its decades-long territorial dispute with Makati."
        ],
        [
            "In 2008, the Taguig City Council created ten new barangays – Central Bicutan, New Lower Bicutan, Fort Bonifacio, Katuparan, North Signal Village, South Signal Village, South Daanghari, North Daanghari, Pinagsama, San Miguel, and Tanyag – by virtue of City Ordinance Nos.",
            "24–27, 57–61, 67–69, and 78, Series of 2008, carving them out from the initial 18 barangays.",
            "After a successful plebiscite in December 2008, the creation was approve, thus the number of barangays in the city was increased from 10 to 28."
        ],
        [
            "In 2011, during 424th foundation day, Mayor Lani Cayetano took pride in calling the city a \"Probinsyudad\" (a portmanteau of Tagalog words of Spanish origin probinsya and syudad) because it is the only remaining city in Metro Manila which has the amenities of a highly urbanized city and of a province, what with its more than 10 kilometers (6.2 mi) of lakeshore, with farmers, fishermen, old churches, a historic lighthouse, and with people whose virtue of pagtutulungan (transl.",
            "cooperation) is still very much alive."
        ],
        [
            "By the turn of the 21st century, former military reservations in the Fort Bonifacio area were developed by the Bases Conversion and Development Authority (BCDA) into central business districts and mixed-use townships.",
            "These give rise to one of the Philippines' leading financial centers, the Bonifacio Global City (BGC).",
            "The BCDA also developed other townships in Fort Bonifacio area such as the Bonifacio Capital District and the McKinley Hill.",
            "Other mixed-developments within the city include the Acacia Estate and Scala Estate by Vista Land in the central part of the city, and Arca South by Ayala Land in Western Bicutan.",
            "In February 2018, the Philippine Stock Exchange moved its corporate office from Makati to BGC."
        ],
        [
            "In March 2020, the city recorded its first case of COVID-19, a lawyer who works at BGC and has a history abroad of travelling to Japan."
        ],
        [
            "The decades-long territorial dispute with Makati was ruled with finality in favor of Taguig in April 2023.",
            "The city gained an increase in territory and in population.",
            "However, ownership issues regarding public facilities such as schools, health centers, parks, etc.",
            "still persists."
        ],
        [
            "Geography"
        ],
        [
            "Taguig is located on the northwestern shores of Laguna de Bay, the largest lake in the Philippines.",
            "The Pasig River and its tributary, the Taguig River, run through the northern half of the city, while the Napindan River, another tributary of Pasig, forms the natural border between Taguig in Pasig.",
            "A relatively small area of the city called Ibayo Napindan is located north of the river, adjoining the disputed territories between Pasig, Taguig, and Taytay in Rizal Province."
        ],
        [
            "The West Valley fault of the Marikina Valley Fault System traverses the barangay of Comembo, East Rembo, Pembo, Post Proper Southside, Rizal, Pinagsama, South Signal Village, North Signal Village, South Daang Hari, Central Bicutan, Ususan, Upper Bicutan, Central Signal Village, Maharlika Village, Lower Bicutan, Bagumbayan and Bagong Tanyag."
        ],
        [
            "According to the cadastral map of Taguig, the boundary and jurisdiction limit of Taguig is the Rio del Pueblo now called Tapayan River, a tributary of the Pasig River from Barangay Pinagbuhatan, Pasig to Barangay Santa Ana, Taytay, Rizal.",
            "The city has an area of 54.048 square kilometers (20.868 sq mi), now including the Embo barangays previously under Makati."
        ],
        [
            "Barangays and congressional districts"
        ],
        [
            "Main articles: Legislative districts of Pateros–Taguig and Legislative districts of Taguig"
        ],
        [
            "Political map of Taguig"
        ],
        [
            "Taguig is politically subdivided into 38 barangays.",
            "These barangays were group into two congressional districts, with each district being represented by a congressman in the House of Representatives.",
            "The ten Embo barangays are the latest addition to its jurisdiction after the city won against its territorial dispute with Makati, increasing the city's territory and population.",
            "Those barangays, however, still remain with Makati's 2nd congressional district."
        ],
        [
            "Taguig–Pateros's Lone Congressional District (District I) (2020 population: 484,906) covers the eastern half of the city, including the entirety of the Municipality of Pateros.",
            "The district covers an area of 20.61 square kilometers (7.96 sq mi) and includes the barangays of Bagumbayan, Bambang, Calzada, Hagonoy, Ibayo-Tipas, Ligid-Tipas, Lower Bicutan, New Lower Bicutan, Napindan, Palingon, San Miguel, Santa Ana, Tuktukan, Ususan and Wawa."
        ],
        [
            "Taguig's Lone Congressional District (District II) (2020 population: 467,043) covers the western portion of the city, excluding the ten Embo barangays.",
            "It covers an area of 24.6 square kilometers (9.5 sq mi).",
            "It consists of the western Taguig barangays of Central Bicutan, Central Signal Village, Fort Bonifacio, Katuparan, Maharlika Village, North Daang Hari, North Signal Village, Pinagsama, South Daang Hari, South Signal Village, Tanyag, Upper Bicutan and Western Bicutan."
        ],
        [
            "Makati's 2nd congressional district (District II) (2020 population: 375,016)"
        ],
        [
            "Barangay"
        ],
        [
            "Punong Barangay"
        ],
        [
            "Population (2020)"
        ],
        [
            "Area"
        ],
        [
            "ZIP Code"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Bagumbayan"
        ],
        [
            "Delio J. Santos"
        ],
        [
            "4.0%"
        ],
        [
            "49,319"
        ],
        [
            "3.62"
        ],
        [
            "1.40"
        ],
        [
            "1630"
        ],
        [
            "Bambang"
        ],
        [
            "Ryan C. Esteban"
        ],
        [
            "1.1%"
        ],
        [
            "13,949"
        ],
        [
            "0.92"
        ],
        [
            "0.36"
        ],
        [
            "1637"
        ],
        [
            "Calzada-Tipas"
        ],
        [
            "Rommel B. Tanyag"
        ],
        [
            "2.3%"
        ],
        [
            "28,660"
        ],
        [
            "1.07"
        ],
        [
            "0.41"
        ],
        [
            "1630"
        ],
        [
            "Cembo"
        ],
        [
            "Romeo B. Millo"
        ],
        [
            "2.0%"
        ],
        [
            "25,049"
        ],
        [
            "0.22"
        ],
        [
            "0.085"
        ],
        [
            "1640"
        ],
        [
            "Central Bicutan"
        ],
        [
            "Rodolfo E. Tangpuz II"
        ],
        [
            "2.8%"
        ],
        [
            "33,851"
        ],
        [
            "1631"
        ],
        [
            "Central Signal Village"
        ],
        [
            "Henry A. Dueñas III"
        ],
        [
            "3.6%"
        ],
        [
            "44,126"
        ],
        [
            "1633"
        ],
        [
            "Comembo"
        ],
        [
            "Edgardo P. Cleofas"
        ],
        [
            "1.3%"
        ],
        [
            "15,805"
        ],
        [
            "0.27"
        ],
        [
            "0.10"
        ],
        [
            "1641"
        ],
        [
            "East Rembo"
        ],
        [
            "Thelma P. Ramirez"
        ],
        [
            "2.2%"
        ],
        [
            "26,450"
        ],
        [
            "0.44"
        ],
        [
            "0.17"
        ],
        [
            "1643"
        ],
        [
            "Fort Bonifacio"
        ],
        [
            "Jorge Daniel S. Bocobo"
        ],
        [
            "1.0%"
        ],
        [
            "11,912"
        ],
        [
            "16.26"
        ],
        [
            "6.28"
        ],
        [
            "1635"
        ],
        [
            "Hagonoy"
        ],
        [
            "Rommel R. Olazo"
        ],
        [
            "1.8%"
        ],
        [
            "21,693"
        ],
        [
            "1.62"
        ],
        [
            "0.63"
        ],
        [
            "1630"
        ],
        [
            "Ibayo-Tipas"
        ],
        [
            "Wilfredo D. Flores"
        ],
        [
            "2.1%"
        ],
        [
            "25,808"
        ],
        [
            "1.56"
        ],
        [
            "0.60"
        ],
        [
            "1630"
        ],
        [
            "Katuparan"
        ],
        [
            "Mario R. Hernandez"
        ],
        [
            "2.2%"
        ],
        [
            "27,228"
        ],
        [
            "1630"
        ],
        [
            "Ligid-Tipas"
        ],
        [
            "John U. Lontoc"
        ],
        [
            "0.8%"
        ],
        [
            "10,361"
        ],
        [
            "0.68"
        ],
        [
            "0.26"
        ],
        [
            "1638"
        ],
        [
            "Lower Bicutan"
        ],
        [
            "Roel O. Pacayra"
        ],
        [
            "4.9%"
        ],
        [
            "60,376"
        ],
        [
            "2.35"
        ],
        [
            "0.91"
        ],
        [
            "1632"
        ],
        [
            "Maharlika Village"
        ],
        [
            "Hareem P. Pautin"
        ],
        [
            "1.9%"
        ],
        [
            "23,470"
        ],
        [
            "0.51"
        ],
        [
            "0.20"
        ],
        [
            "1636"
        ],
        [
            "Napindan"
        ],
        [
            "Gerome Michael R. San Pedro"
        ],
        [
            "2.0%"
        ],
        [
            "24,437"
        ],
        [
            "2.70"
        ],
        [
            "1.04"
        ],
        [
            "1630"
        ],
        [
            "New Lower Bicutan"
        ],
        [
            "Ernesto A. Rafael, Jr."
        ],
        [
            "4.6%"
        ],
        [
            "55,928"
        ],
        [
            "1632"
        ],
        [
            "North Daang Hari"
        ],
        [
            "Lhorelyn L. Fortuno"
        ],
        [
            "1.1%"
        ],
        [
            "13,673"
        ],
        [
            "1632"
        ],
        [
            "North Signal Village"
        ],
        [
            "Danilo G. Castro"
        ],
        [
            "2.8%"
        ],
        [
            "34,634"
        ],
        [
            "1630"
        ],
        [
            "Palingon-Tipas"
        ],
        [
            "Charlie M. Mendiola"
        ],
        [
            "1.3%"
        ],
        [
            "16,119"
        ],
        [
            "1.17"
        ],
        [
            "0.45"
        ],
        [
            "1630"
        ],
        [
            "Pembo"
        ],
        [
            "Kim M. Abbang"
        ],
        [
            "3.6%"
        ],
        [
            "44,506"
        ],
        [
            "0.64"
        ],
        [
            "0.25"
        ],
        [
            "1642"
        ],
        [
            "Pinagsama"
        ],
        [
            "Maria Victoria M. Mortel"
        ],
        [
            "4.6%"
        ],
        [
            "56,835"
        ],
        [
            "1630"
        ],
        [
            "Pitogo"
        ],
        [
            "Ives M. Ebrada"
        ],
        [
            "1.2%"
        ],
        [
            "14,654"
        ],
        [
            "0.14"
        ],
        [
            "0.054"
        ],
        [
            "1646"
        ],
        [
            "Post Proper Northside"
        ],
        [
            "Richard C. Pasadilla"
        ],
        [
            "4.7%"
        ],
        [
            "57,940"
        ],
        [
            "2.37"
        ],
        [
            "0.92"
        ],
        [
            "1647"
        ],
        [
            "Post Proper Southside"
        ],
        [
            "Quirino V. Sarono"
        ],
        [
            "5.2%"
        ],
        [
            "63,308"
        ],
        [
            "3.41"
        ],
        [
            "1.32"
        ],
        [
            "1648"
        ],
        [
            "Rizal"
        ],
        [
            "Arnold J. Cruz"
        ],
        [
            "3.6%"
        ],
        [
            "44,536"
        ],
        [
            "0.59"
        ],
        [
            "0.23"
        ],
        [
            "1649"
        ],
        [
            "San Miguel"
        ],
        [
            "Arnold M. Fabian"
        ],
        [
            "0.9%"
        ],
        [
            "10,528"
        ],
        [
            "1630"
        ],
        [
            "Santa Ana"
        ],
        [
            "Roberto M. Flogen"
        ],
        [
            "1.8%"
        ],
        [
            "22,581"
        ],
        [
            "1.92"
        ],
        [
            "0.74"
        ],
        [
            "1630"
        ],
        [
            "South Cembo"
        ],
        [
            "Eva Dian M. Omar"
        ],
        [
            "1.2%"
        ],
        [
            "14,978"
        ],
        [
            "0.20"
        ],
        [
            "0.077"
        ],
        [
            "1645"
        ],
        [
            "South Daang Hari"
        ],
        [
            "Benjie D. Hernandez"
        ],
        [
            "1.8%"
        ],
        [
            "22,448"
        ],
        [
            "1632"
        ],
        [
            "South Signal Village"
        ],
        [
            "Jesus S. Laurel"
        ],
        [
            "3.5%"
        ],
        [
            "43,047"
        ],
        [
            "1633"
        ],
        [
            "Tanyag"
        ],
        [
            "Cecilia C. Teodoro"
        ],
        [
            "1.9%"
        ],
        [
            "23,719"
        ],
        [
            "1630"
        ],
        [
            "Tuktukan"
        ],
        [
            "Suranie U. Benamir"
        ],
        [
            "0.9%"
        ],
        [
            "11,614"
        ],
        [
            "0.31"
        ],
        [
            "0.12"
        ],
        [
            "1637"
        ],
        [
            "Upper Bicutan"
        ],
        [
            "Francis P. Sunga"
        ],
        [
            "3.6%"
        ],
        [
            "44,592"
        ],
        [
            "1.44"
        ],
        [
            "0.56"
        ],
        [
            "1633"
        ],
        [
            "Ususan"
        ],
        [
            "Marilyn F. Marcelino"
        ],
        [
            "4.4%"
        ],
        [
            "53,956"
        ],
        [
            "1.45"
        ],
        [
            "0.56"
        ],
        [
            "1639"
        ],
        [
            "Wawa"
        ],
        [
            "Rosaley A. Buenaflor"
        ],
        [
            "1.2%"
        ],
        [
            "14,350"
        ],
        [
            "1.38"
        ],
        [
            "0.53"
        ],
        [
            "1630"
        ],
        [
            "West Rembo"
        ],
        [
            "Niño B. Cunanan"
        ],
        [
            "2.4%"
        ],
        [
            "29,649"
        ],
        [
            "0.55"
        ],
        [
            "0.21"
        ],
        [
            "1644"
        ],
        [
            "Western Bicutan"
        ],
        [
            "Pedrito B. Bermas"
        ],
        [
            "7.2%"
        ],
        [
            "87,508"
        ],
        [
            "3.55"
        ],
        [
            "1.37"
        ],
        [
            "1630"
        ],
        [
            "Total"
        ],
        [
            "1,223,595"
        ],
        [
            "54.22"
        ],
        [
            "20.93"
        ],
        [
            "Territorial disputes"
        ],
        [
            "Main article: Makati–Taguig boundary dispute"
        ],
        [
            "Contested territories between Makati, Pateros and Taguig."
        ],
        [
            "Taguig was involved in a territorial dispute with Makati and Pateros.",
            "In 1993, Taguig filed a complaint against Makati over the entirety of Fort Bonifacio and the Enlisted Men's Barangays (EMBOs), claiming these areas were within its territory.",
            "The complaint also alleged that Presidential Proclamation Nos.",
            "2475, s. 1986, and 518, s. 1990, were unconstitutional for altering Taguig's boundaries without a plebiscite.",
            "In 2011, the Pasig Regional Trial Court upheld Taguig's claim over the Fort Bonifacio Military Reservation, including the EMBO barangays, and ordered Makati to stop exercising jurisdiction over these areas.",
            "The Supreme Court of the Philippines affirmed this ruling with finality on April 27, 2022, declaring that Bonifacio Global City and the surrounding EMBO barangays were under Taguig's jurisdiction."
        ],
        [
            "Moreover, in around 2001, Taguig and Parañaque resolved a territorial dispute, agreeing that the Bicutan Market and the Bicutan Interchange would be part of Parañaque."
        ],
        [
            "Climate"
        ],
        [
            " Taguig"
        ],
        [
            "Climate chart (explanation)"
        ],
        [
            "J"
        ],
        [
            "F"
        ],
        [
            "M"
        ],
        [
            "A"
        ],
        [
            "M"
        ],
        [
            "J"
        ],
        [
            "J"
        ],
        [
            "A"
        ],
        [
            "S"
        ],
        [
            "O"
        ],
        [
            "N"
        ],
        [
            "D"
        ],
        [
            "30"
        ],
        [
            "26"
        ],
        [
            "22"
        ],
        [
            "31"
        ],
        [
            "27"
        ],
        [
            "22"
        ],
        [
            "33"
        ],
        [
            "28"
        ],
        [
            "23"
        ],
        [
            "34"
        ],
        [
            "30"
        ],
        [
            "25"
        ],
        [
            "34"
        ],
        [
            "30"
        ],
        [
            "26"
        ],
        [
            "32"
        ],
        [
            "29"
        ],
        [
            "25"
        ],
        [
            "31"
        ],
        [
            "28"
        ],
        [
            "25"
        ],
        [
            "31"
        ],
        [
            "28"
        ],
        [
            "24"
        ],
        [
            "31"
        ],
        [
            "28"
        ],
        [
            "24"
        ],
        [
            "31"
        ],
        [
            "28"
        ],
        [
            "24"
        ],
        [
            "31"
        ],
        [
            "28"
        ],
        [
            "24"
        ],
        [
            "30"
        ],
        [
            "27"
        ],
        [
            "23"
        ],
        [
            "█ Average max.",
            "and min.",
            "temperatures in °C"
        ],
        [
            "█ Precipitation totals in mm"
        ],
        [
            "Imperial conversion"
        ],
        [
            "JFMAMJJASOND"
        ],
        [
            "1.2"
        ],
        [
            "79"
        ],
        [
            "72"
        ],
        [
            "1.2"
        ],
        [
            "80"
        ],
        [
            "72"
        ],
        [
            "1.3"
        ],
        [
            "82"
        ],
        [
            "73"
        ],
        [
            "1.3"
        ],
        [
            "85"
        ],
        [
            "77"
        ],
        [
            "1.3"
        ],
        [
            "86"
        ],
        [
            "79"
        ],
        [
            "1.3"
        ],
        [
            "83"
        ],
        [
            "77"
        ],
        [
            "1.2"
        ],
        [
            "82"
        ],
        [
            "77"
        ],
        [
            "1.2"
        ],
        [
            "82"
        ],
        [
            "75"
        ],
        [
            "1.2"
        ],
        [
            "82"
        ],
        [
            "75"
        ],
        [
            "1.2"
        ],
        [
            "82"
        ],
        [
            "75"
        ],
        [
            "1.2"
        ],
        [
            "82"
        ],
        [
            "75"
        ],
        [
            "1.2"
        ],
        [
            "80"
        ],
        [
            "73"
        ],
        [
            "█ Average max.",
            "and min.",
            "temperatures in °F"
        ],
        [
            "█ Precipitation totals in inches"
        ],
        [
            "Under the Köppen climate classification system, Manila has a tropical monsoon climate (Köppen Am), closely bordering on a tropical savanna climate (Köppen Aw).",
            "The climate of Taguig is characterized by two types of season: dry season from November to April, and wet season from May to October.",
            "Rainfall is less evenly distributed.",
            "Together with the rest of the Philippines, Taguig lies entirely within the tropics."
        ],
        [
            "Tropical cyclones are relatively common, which resulted in flashfloods in low-lying areas of the city, especially those near major rivers and the Laguna de Bay.",
            "In 2009, Typhoon Ketsana hit Metro Manila, and the City of Taguig is one of the worst hit areas in the capital region when flood water inundate almost the whole city."
        ],
        [
            "Climate data for Taguig"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "32(89)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "28(82)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "30(86)"
        ],
        [
            "28.5(83.3)"
        ],
        [
            "28(82)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "27.8(81.9)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "9.5(0.37)"
        ],
        [
            "9.5(0.37)"
        ],
        [
            "13.5(0.53)"
        ],
        [
            "15.3(0.60)"
        ],
        [
            "43.8(1.72)"
        ],
        [
            "75(3.0)"
        ],
        [
            "209.2(8.24)"
        ],
        [
            "170.3(6.70)"
        ],
        [
            "149.7(5.89)"
        ],
        [
            "124(4.9)"
        ],
        [
            "40.1(1.58)"
        ],
        [
            "31(1.2)"
        ],
        [
            "890.9(35.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "0"
        ],
        [
            "0"
        ],
        [
            "0"
        ],
        [
            "0"
        ],
        [
            "3"
        ],
        [
            "5"
        ],
        [
            "9"
        ],
        [
            "10"
        ],
        [
            "8"
        ],
        [
            "7"
        ],
        [
            "4"
        ],
        [
            "3"
        ],
        [
            "49"
        ],
        [
            "Mean daily daylight hours"
        ],
        [
            "11.5"
        ],
        [
            "11.5"
        ],
        [
            "12"
        ],
        [
            "12.5"
        ],
        [
            "13"
        ],
        [
            "13"
        ],
        [
            "13"
        ],
        [
            "12.5"
        ],
        [
            "12"
        ],
        [
            "12"
        ],
        [
            "11.5"
        ],
        [
            "11.5"
        ],
        [
            "12.2"
        ],
        [
            "Source 1: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Source 2: NOAA"
        ],
        [
            "Natural hazards"
        ],
        [
            "The West Valley Fault runs through the central part of the city, from north to south.",
            "It is capable of producing large scale earthquakes on its active phases with a magnitude of 7 or higher."
        ],
        [
            "Demographics"
        ],
        [
            "Population Census of TaguigYearPop.±% p.a.1903 6,829—    1918 8,423+1.41%1939 12,087+1.73%1948 15,340+2.68%1960 21,856+2.99%1970 55,257+9.71%1975 73,702+5.95%1980 134,137+12.72%1990 266,637+7.11%1995 381,350+6.93%2000 467,375+4.46%2007 613,343+3.82%2010 644,473+1.82%2015 804,915+4.32%2020 886,722+1.92%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2020 census, the population of the Taguig was 886,722, making it the seventh most populous city in the Philippines, and the fourth most populous city in Luzon.",
            "Following the Makati–Taguig territorial dispute, the city gained ten additional barangays from Makati, thus increasing its population to an estimated of 1.2 million, making it the fifth most populous city in the Philippines, surpassing Zamboanga City and Cebu City."
        ],
        [
            "Taguig has 246,873 households."
        ],
        [
            "Religion"
        ],
        [
            "The Taguig Church is a minor basilica and a declared historic site and cultural property"
        ],
        [
            "Majority of the city's residents are Roman Catholics.",
            "All Roman Catholic churches in the city are under the jurisdiction of the Roman Catholic Diocese of Pasig, with the exception of the five parishes of the Embo barangays, which are under the Roman Catholic Archdiocese of Manila due to having been previously under the civil jurisdiction of Makati."
        ],
        [
            "Poverty, housing and urban slums"
        ],
        [
            "Further information: Slums in Metro Manila"
        ],
        [
            "Poverty incidence of Taguig"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "2006  4.30"
        ],
        [
            "2009  2.65"
        ],
        [
            "2012  2.38"
        ],
        [
            "2015  3.12"
        ],
        [
            "2018  0.76"
        ],
        [
            "2021  4.50"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "In 2007, Taguig was ranked the poorest in Metro Manila, with 5.2 percent of its population, considered poor.",
            "Of the 689,377 informal settler families living in Metro Manila, 20,718 were reported to be living in Taguig.",
            "Of these: 4,778 of these families lives along danger areas, along the lake shoreline, creeks, and rivers; 13,248 occupy government-owned lands; 718 occupy privately-owned lands; and 1,974 families are in Areas of Priority Development.",
            "The poor, who mostly live in informal settlements are the most prone to natural hazards.",
            "In 2000, there are about 21,931 households in informal settlements or about 33.7% of the total household of Taguig."
        ],
        [
            "Housing"
        ],
        [
            "The central courtyard of the Fort Bonifacio Tenement"
        ],
        [
            "The city government of Taguig has undertaken socialized housing projects such as the Family Townhomes, which won the 2009 Galing Pook Awards."
        ],
        [
            "Economy"
        ],
        [
            "Bonifacio Global City is the central business district of Taguig"
        ],
        [
            "The Metrobank Center is the tallest building in the Philippines, standing at 318 m (1,043 ft)"
        ],
        [
            "The Philippine Stock Exchange headquarters in Bonifacio Global City, Taguig"
        ],
        [
            "Taguig is a national hub of business and commerce.",
            "The city is a center for banking and finance, health care and life sciences, medical technology and research, retailing, trade, tourism, real estate, new media, traditional media, advertising, legal services, accountancy, insurance, and the arts.",
            "Bonifacio Global City is the central business district of Taguig and is one of the five major central business districts (CBDs) of Metro Manila, as the other four being the Makati CBD, Ortigas Center, Bay City, and Binondo."
        ],
        [
            "The City of Taguig is continuously improving its ease of doing business.",
            "Aside from lower taxes, the city is simplifying its business registration process."
        ],
        [
            "The office market in Metro Manila is dominated by three major cities with CBDs: Makati, Taguig, and Pasig.",
            "The city has an office space supply of 2.7 million square meters (29 million square feet) as of end-2021, behind Makati's 2.8 million square meters (30 million square feet)."
        ],
        [
            "Despite the rapid urbanization of Taguig, aquaculture and fishing still exist in the city's coastal communities located along Laguna de Bay."
        ],
        [
            "Agriculture"
        ],
        [
            "The Taguig City Agricultural Office is responsible for the planning and implementation of agricultural programs and policies.",
            "The office has set up several urban farms in various places within the city including one in Bonifacio Global City, and its urban farming programs were lauded by the national government."
        ],
        [
            "The Santa Ana Bukid is a 113-hectare (280-acre) melon farm located in Barangay Wawa.",
            "It can harvest up to 30,000 kilograms (66,000 lb) of the fruit per hectare, with different varieties such as honeydew and cantaloupe.",
            "Taguig also celebrates its annual \"Melon Festival\" near Laguna Lake Highway."
        ],
        [
            "Industrial"
        ],
        [
            "Taguig has several industrial areas scattered throughout the city, most of which are located in barangays Ibayo-Tipas, Palingon, Calzada, Napindan, Western Bicutan, and Tanyag.",
            "The Food Terminal Inc. (FTI) in Western Bicutan is a national government-owned agro-industrial hub.",
            "Its goal is to supply Metro Manila with affordable agricultural products.",
            "Mañalac Industrial Estate, located in Bagumbayan, is another industrial hub based in southern Taguig."
        ],
        [
            "Shopping"
        ],
        [
            "SM Aura is one of the city's high-end malls."
        ],
        [
            "Taguig is a major shopping destination where shopping malls, department stores, markets, supermarkets, and bazaars are located, catering mostly to the middle and high-end class.",
            "Numerous high-end malls can be found in or near Bonifacio Global City such as the mixed-use Bonifacio High Street, Mitsukoshi BGC, SM Aura, Uptown Mall, Venice Grand Canal Mall in McKinley Hill, and the upcoming Ayala Malls Park Triangle.",
            "Shopping malls that cater to the middle-class market are the Market!",
            "Market!, Gate 3 Plaza, Sunshine Mall (Taguig's first shopping mall), Vista Mall Taguig, and the upcoming Ayala Malls Arca South."
        ],
        [
            "Tourism"
        ],
        [
            "See also: Tourism in Metro Manila"
        ],
        [
            "The Mind Museum, a science museum in Bonifacio Global City"
        ],
        [
            "Taguig boasts of numerous destinations that caters to both local and foreign tourist.",
            "The Mind Museum is a science museum with more than 250 exhibits.",
            "The Manila American Cemetery, a military cemetery that honors US personnel killed during World War II in the Philippines and other allied nations, is managed and operated by the American Battle Monuments Commission.",
            "The Libingan ng mga Bayani (LMB), is the national cemetery of the Philippines."
        ],
        [
            "The Napindan Lighthouse is a historic lighthouse that served as a meeting point for Katipunan, a revolutionary group that led the Philippine Independence movement."
        ],
        [
            "Diplomacy and international relations"
        ],
        [
            "Embassy of the Republic of Korea in McKinley Hill"
        ],
        [
            "Diplomatic missions to Manila by foreign countries in the Philippines have their embassies located in Taguig:"
        ],
        [
            " Austria"
        ],
        [
            " Colombia"
        ],
        [
            " Denmark"
        ],
        [
            " Hungary"
        ],
        [
            " Italy"
        ],
        [
            " Israel"
        ],
        [
            " Kazakhstan"
        ],
        [
            " Kuwait"
        ],
        [
            " Morocco"
        ],
        [
            " Norway"
        ],
        [
            " Oman"
        ],
        [
            " Panama"
        ],
        [
            " Paraguay"
        ],
        [
            " Poland"
        ],
        [
            " Qatar"
        ],
        [
            " Senegal"
        ],
        [
            " Singapore"
        ],
        [
            " South Korea"
        ],
        [
            " Sweden"
        ],
        [
            " United Arab Emirates"
        ],
        [
            " United Kingdom"
        ],
        [
            "Several international schools are located within the city such as the British School Manila, International School Manila, Korean International School Philippines, Leaders International Christian School of Manila, and the Manila Japanese School."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Further information: Mayor of Taguig and Taguig City Council"
        ],
        [
            "Taguig City Hall in Tuktukan is the city's seat of government"
        ],
        [
            "Taguig is classified as a highly urbanized city (HUC)."
        ],
        [
            "The Taguig City Hall, located in Barangay Tuktukan, serves as the seat of the city government.",
            "Constructed in 1959, it underwent three renovations.",
            "It also maintains a satellite office at SM Aura Tower."
        ],
        [
            "As of May 2022, the Mayor of Taguig is Lani Cayetano.",
            "Arvin Alit, a former councilor, is the city's incumbent vice mayor.",
            "The mayor and the vice mayor are limited to up-to three terms, each term lasting for three years.",
            "They are both restricted to three consecutive terms, totaling nine years, although a mayor can be elected again after an interruption of one term.",
            "The vice mayor heads the Taguig City Council consisting of 18 members: 8 councilors from the 1st district, 8 councilors from the 2nd district, the president of the Sangguniang Kabataan (Youth Council) Federation as sectoral representative of the youth, and the president of the Association of Barangay Captains (ABC) as barangay sectoral representative.",
            "The council is in charge of creating the city's policies in the form of ordinances and resolutions.",
            "The current district representatives of the city are Ricardo \"Ading\" Cruz Jr. for 1st district and Amparo Maria \"Pammy\" Zamora for 2nd district."
        ],
        [
            "National government"
        ],
        [
            "The New Senate Building being constructed as of 2023"
        ],
        [
            "As part of the National Capital Region (NCR), the city is the home to numerous national government bodies such as the Senate of the Philippines set to move in at least 2025."
        ],
        [
            "Several national government agencies calls the city home, such as the Departments of Science and Technology, and Energy, as well as the Intellectual Property Office of the Philippines, National Mapping and Resource Information Authority, and the Technical Education and Skills Development Authority.",
            "Since large tracts of the city's land was reserved for military use since the American colonial period, some of these became the headquarters for the Philippine Army and Philippine Marine Corps.",
            "A Philippine Navy Naval Station, as well as a Philippine Coast Guard Base can be found within the city."
        ],
        [
            "Regional government agencies in the city include the National Capital Region Police Office and the Southern Police District Headquarters, both headquartered at Camp Bagong Diwa."
        ],
        [
            "Finance"
        ],
        [
            "In the 2022 Annual Audit Report published by the Commission on Audit, the City of Taguig has a revenue of ₱15.994 billion, with assets worth ₱41.817 billion, and has a liability of ₱20.113 billion."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Land"
        ],
        [
            "Lawton Avenue looking north from McKinley Hill, Bonifacio Capital District"
        ],
        [
            "The main modes of transportation around the city are jeepneys, buses, and tricycles.",
            "The road network of the city is part of a system of circumferential and radial roads of Metro Manila.",
            "Several national roads, such as Kalayaan Avenue, Lawton Avenue, Circumferential Road 5 (C-5), and Circumferential Road 6 (C-6) runs through the city.",
            "The Southeast Metro Manila Expressway, which is currently under-construction, will traverse parts of the city.",
            "The proposed Taguig Integrated Terminal Exchange, is conceptualized as the primary bus station for buses going to and from Southern Luzon, Visayas, and Mindanao.",
            "It is planned to be connected to the under-construction North–South Commuter Railway (NSCR)."
        ],
        [
            "Taguig has banned e-bikes and e-trikes on its national roads."
        ],
        [
            "Rail"
        ],
        [
            "A Philippine National Railway train at FTI station"
        ],
        [
            "The city is served by the PNR Metro Commuter Line, which is suspended since 2024 due to the construction of North–South Commuter Railway (NSCR) above it.",
            "The NSCR will have two stations at Senate and FTI.",
            "Also, the Metro Manila Subway, with planned five stations within the city limits plus one station near the city's border, will have a common alignment with the NSCR, and there are two common stations planned to be constructed in the city.",
            "The DOST-developed Bicutan Automated Guideway Transit System is planned to have its services extended along C-6 (Laguna Lake Highway)."
        ],
        [
            "Makati Intra-city Subway, a project undertaken by the Makati city government, included plans for stations and a depot in the Embo barangays, which were later incorporated into Taguig.",
            "However, its construction was halted to accommodate necessary reworkings due to the territorial changes."
        ],
        [
            "Ferry"
        ],
        [
            "Guadalupe Ferry Station"
        ],
        [
            "The city is served by one terminal of the Pasig River Ferry Service, the Guadalupe Ferry Station located in Cembo.",
            "The Pinagbuhatan Ferry Station in Pinagbuhatan, Pasig serves the area of Napindan."
        ],
        [
            "Cycling network"
        ],
        [
            "The Active Transport Office of the Taguig City Government is mandated to promote active transport in the city.",
            "The City Government of Taguig has set up bike lanes along Cayetano Boulevard and Bayani Road, and has renovated the bike lane along Laguna Lake Highway (C-6 Road)."
        ],
        [
            "Utilities"
        ],
        [
            "Electricity services are provided by Meralco, the sole electricity distributor in Metro Manila.",
            "Manila Water provides the supply and delivery of potable water, and sewerage system in Taguig."
        ],
        [
            "Human resources"
        ],
        [
            "Education"
        ],
        [
            "See also: List of schools in Taguig and List of universities and colleges in Metro Manila"
        ],
        [
            "Sen. Renato \"Compañero\" Cayetano Memorial Science and Technology High School (SRCCMSTHS) is one of the three science high schools of the city."
        ],
        [
            "International School Manila in Bonifacio Global City"
        ],
        [
            "The Schools Division Office of Taguig City and Pateros (SDO-TAPAT), also known as DEPED-TAPAT, administers all the public elementary and high schools within the city.",
            "The division is under the supervision of the Department of Education.",
            "Following the Makati–Taguig boundary dispute, the city gained 14 public elementary and high schools of Makati in the Embo barangays, whose management and administration was transferred from Makati to Taguig starting January 1, 2024.",
            "There are three science high schools in the city: Taguig Science High School in San Miguel, Senator Renato \"Compañero\" Cayetano Memorial Science and Technology High School in Ususan, and the Makati Science High School, which is originally administered by Makati's SDO, in Cembo.",
            "Notable public schools within the city are the Taguig Integrated School, Taguig National High School, Western Bicutan National High School, among others."
        ],
        [
            "There are numerous religious-affiliated schools in Taguig.",
            "Catholic schools within the city include the Colegio de Santa Ana (formerly Santa Ana Parochial School), and the Saint Francis of Assisi College System.",
            "Notable Christian institutions in the city are The Fisher Valley College in Hagonoy, and the Victory Leadership Institute in Bonifacio Global City.",
            "Taguig is also the home to several Islamic schools, such as the Maharlika Bandara-Inged Integrated School and the Maharlika Village Islamic Madrasa.",
            "Most of the Islamic schools are located in or near Maharlika Village."
        ],
        [
            "Several international schools can be found in Taguig, such as The Beacon School, British School Manila, Chinese International School, Everest Academy Manila, International School Manila, Korean International School Philippines, Leaders International Christian School of Manila, and the Manila Japanese School."
        ],
        [
            "Higher education"
        ],
        [
            "Main building of the Polytechnic University of the Philippines Taguig"
        ],
        [
            "The University of the Philippines Diliman and De La Salle University has established satellite campuses in Taguig, which are both located in University Park, Bonifacio Global City.",
            "Other prominent higher educational institutions in the city include Enderun Colleges, the Meridian International College, and The Fisher Valley College."
        ],
        [
            "There are two state universities in the city, the Polytechnic University of the Philippines Taguig, and the Technological University of the Philippines - Taguig Campus.",
            "The city-run Taguig City University, established through Ordinance No.",
            "29, Series of 2004, operates its main campus on General Santos Avenue in Central Bicutan.",
            "In addition, the University of Makati (UMak), which is managed by the City Government of Makati, is situated in Barangay West Rembo that is now part of Taguig following the resolution of the territorial dispute between Makati and Taguig, which favors the latter."
        ],
        [
            "The Technical Education and Skills Development Authority (TESDA) manages and supervises the technical and vocational education and training programs in the Philippines.",
            "Its headquarters is located along East Service Road in Western Bicutan."
        ],
        [
            "Public health"
        ],
        [
            "See also: List of hospitals in Metro Manila"
        ],
        [
            "St. Luke's Medical Center – Global City is one of the most prominent hospitals in the city"
        ],
        [
            "The Taguig City Heath Office is responsible for the planning and implementation of the healthcare programs of the city government.",
            "The city has 31 health centers, 7 primary care facilities, three super health centers, three main laboratories, 29 community-based laboratories, a dialysis center and 5 Animal Bite Treatment Centers."
        ],
        [
            "The Army General Hospital (AGH) caters to the health and medical needs of the Philippine Army.",
            "Meanwhile, the Ospital ng Makati, which is currently being managed by Makati, is subject to management and ownership dispute following the resolution of the territorial dispute between Makati and Taguig, which favors the latter."
        ],
        [
            "Notable private hospitals in the city are the Bicutan Medical Center, Cruz-Rabe Maternity and General Hospital, Medical Center Taguig, St. Luke's Medical Center – Global City, and the Taguig Doctors Hospital.",
            "The Healthway Cancer Care Center in Arca South is the first dedicated cancer care hospital in the Philippines."
        ],
        [
            "Taguig city government provides Home Health for bedridden patients and Doctor on Call services, which is a 24/7 medical and emergency hotline, for the residents of the city."
        ],
        [
            "Culture"
        ],
        [
            "Cuisine"
        ],
        [
            "The food inutak, which originated from the area of Pateros, is a popular snack of the city.",
            "It is a rice cake filled with coconut milk and sugar, and baked with charcoal fire.",
            "Another popular food that originated from the city is the Tipas Hopia, which was produced by Belen Flores in her bakery at Ibayo-Tipas to compete with the hopia produced by Chinese.",
            "Production started in 1988 and it remains a popular snack for Filipino until today."
        ],
        [
            "Notable people"
        ],
        [
            "Main article: List of people from Taguig"
        ],
        [
            "Sister cities"
        ],
        [
            "See also: List of sister cities in Metro Manila"
        ],
        [
            "Asia"
        ],
        [
            " Bacolod, Negros Occidental"
        ],
        [
            " Goyang, South Korea"
        ],
        [
            " Himamaylan, Negros Occidental"
        ],
        [
            " Iloilo City, Iloilo"
        ],
        [
            " Tabaco, Albay"
        ],
        [
            " Vigan, Ilocos Sur"
        ],
        [
            "Australia"
        ],
        [
            " Blacktown, Australia"
        ],
        [
            "Notes"
        ],
        [
            "^ Barangays Post Proper Northside and Post Proper Southside are omitted due to unclear boundaries, with overlap mostly with Fort Bonifacio, Pinagsama, and Western Bicutan, resulting from Makati's previous claim disputes."
        ],
        [
            "References"
        ],
        [
            "^ \"The Municipal code and the Provincial government act, being Act no.",
            "82, entitled \"A general act for the organization of municipal governments in the Philippine islands\", and Act no.",
            "83, entitled \"A general act for the organization of provincial governments in the Philippine islands\" as amended by the acts of the Philippine commission down to and including May 31, 1905, revised and codified by the Committee on revision and codification appointed by the governor-general.",
            "Published by authority of the Philippine commission\".",
            "University of Michigan Library Digital Collections.",
            "Retrieved April 16, 2024."
        ],
        [
            "^  City of Taguig |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"National Capital Region (NCR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Taguig Website 2.0\".",
            "Taguig City Government.",
            "September 22, 2020.",
            "Retrieved June 29, 2024."
        ],
        [
            "^ \"Philippines\".",
            "Emporis.",
            "Archived from the original on April 7, 2015.",
            "Retrieved July 13, 2022."
        ],
        [
            "^ \"History\".",
            "Official Website of The City of Taguig.",
            "Retrieved April 18, 2016."
        ],
        [
            "^ Ang Tagig at ang Kanyang Kasaysayan.",
            "by Jose Pagtakhan circa 1963."
        ],
        [
            "^ Tomas L., Magat Salamat, archived from the original on October 27, 2009, retrieved July 14, 2008{{citation}}:  CS1 maint: unfit URL (link)"
        ],
        [
            "^ Relacion de las Yslas Filipinas.",
            "Miguel de Loarca; [Arevalo, June, 1582)"
        ],
        [
            "^ a b A gift of faith, 400 years.",
            "Quadricentennial (1587-1987) St. Anne Parish Tagig, Metro Manila; commemorative book page 36, circa 1987."
        ],
        [
            "^ Augustinian Archives, Valladolid, Spain, Libro de Gobierno de la Provincia.",
            "I, folio 55."
        ],
        [
            "^ Labor Evangelica Ministerios Apostolic De los Obreros De la Campania De Iesus.",
            "page 454"
        ],
        [
            "^ \"Taguig's Santa Ana and the \"probinsyudad\" feels\".",
            "The Urban Roamer.",
            "February 5, 2021.",
            "Retrieved June 16, 2023."
        ],
        [
            "^ Ang Taguig at Ang Kanyang Kasaysayan, page 4, Jose Pagtakhan circa 1965."
        ],
        [
            "^ A gift of faith, 400 years.",
            "Quadricentennial (1587-1987) St. Anne Parish Tagig, Metro Manila; commemorative book page 56, circa 1987."
        ],
        [
            "^ \"Santiago Rosales Bonifacio\".",
            "Geni.com.",
            "April 28, 2022.",
            "Retrieved January 8, 2024."
        ],
        [
            "^ Umali, Vannessa; Ramos, Orlando; Delos Santos, Andres (May 2016).",
            "\"Napindan Lighthouse: A Historic Insight Towards Recognition and Preservation\" (PDF).",
            "International Journal of Engineering Research & Technology.",
            "5 (5)."
        ],
        [
            "^ Ang Taguig at Ang Kanyang Kasaysayan, page 5 and 6, Jose Pagtakhan circa 1965."
        ],
        [
            "^ Act No.",
            "137 (June 11, 1901), An Act Extending the Provisions of the Provincial Government Act to the Province of Rizal, retrieved June 16, 2023"
        ],
        [
            "^ Act No.",
            "942 (October 12, 1903), An Act Reducing the Thirty-Two Municipalities of the Province of Rizal to Fifteen, retrieved June 16, 2023"
        ],
        [
            "^ Act No.",
            "1008 (November 25, 1903), An Act Amending Act Numbered Nine hundred and thirty-nine, entitled \"An Act reducing the thirty municipalities of the Province of La Laguna to nineteen,\" and Act Numbered Nine hundred and forty-two, entitled \"An Act reducing the thirty - two municipalities of the Province of Rizal to fifteen,\" and providing that the boundary line between the Provinces of La Laguna and Rizal be changed so as to include in La Laguna the municipality of Muntinlupa now a part of Rizal, retrieved June 16, 2023"
        ],
        [
            "^ Act No.",
            "1308 (March 22, 1905), An Act providing for the return of the former municipality of Muntinlupa from the Province of La Laguna to the Province of Rizal, repealing paragraph (e) of section one and sections two and three of Act Numbered One thousand and eight, and changing the name of the municipality of Pateros, of the Province of Rizal, to Taguig, retrieved June 16, 2023"
        ],
        [
            "^ \"History\".",
            "City Government of Muntinlupa.",
            "Retrieved June 16, 2023."
        ],
        [
            "^ de Villa, Kathleen (September 22, 2018).",
            "\"Remnants of a dark era\".",
            "Retrieved October 21, 2022."
        ],
        [
            "^ a b c \"Detention CampManila Today\".",
            "www.manilatoday.net.",
            "Archived from the original on October 20, 2014.",
            "Retrieved April 19, 2022."
        ],
        [
            "^ Hilario, Ernesto M. (September 16, 2020).",
            "\"Martial Law Stories: Never Again to Martial Law\".",
            "Positively Filipino.",
            "Retrieved October 22, 2022."
        ],
        [
            "^ Velarde, Emmie G. (September 22, 2014).",
            "\"Screenwriter Ricky Lee lived 3 lives in detention\".",
            "inquirer.net.",
            "Retrieved October 22, 2022."
        ],
        [
            "^ Presidential Decree No.",
            "557 (September 21, 1974), Declaring all barrios in the Philippines as barangays, and for other purposes, Official Gazette of the Republic of the Philippines, retrieved June 16, 2023"
        ],
        [
            "^ Presidential Decree No.",
            "824 (November 7, 1975), Creating the Metropolitan Manila and the Metropolitan Manila Commission and for Other Purposes, retrieved June 16, 2023"
        ],
        [
            "^ Presidential Proclamation No.",
            "2475, s. 1986 (January 7, 1986), Excluding From the Operation of Proclamation No.",
            "423, Series of 1957 Which Established the Fort William Mckinley (Now Fort Bonifacio) Military Reservation Situated in the Municipalities of Pasig, Taguig, Parañaque, Makati and Pasay City, Metro Manila, a Certain Portion of the Land Embraced Therein Situated in the Municipality of Makati and Declaring the Same Open to Disposition Under the Provisions of Act No.",
            "3038 and Republic Act No.",
            "274 in Relation the Provisions of the Public Land Act, as Amended, Official Gazette of the Republic of the Philippines, retrieved April 6, 2023"
        ],
        [
            "^ G.R.",
            "No.",
            "168781 (September 14, 2007), City of Makati vs.The Hon.",
            "Judge Briccio C. Ygaña, Presiding Judge, Regional Trial Court, Pasig City, Branch 153, and Municipality of Taguig, The Lawphil Project, retrieved March 23, 2024"
        ],
        [
            "^ Republic Act No.",
            "8487 (February 11, 1998), An Act Converting the Municipality of Taguig, Metro Manila, into a Highly Urbanized City to be Known as the City of Taguig, and for Other Purposes (PDF), retrieved October 8, 2017"
        ],
        [
            "^ Clapano, Jose Rodel (January 26, 2006).",
            "\"SC upholds Taguig cityhood\".",
            "The Philippine Star.",
            "Retrieved June 16, 2023."
        ],
        [
            "^ Villanueva, Rhodina (May 10, 2009).",
            "\"Taguig names heads of city's 10 new barangays\".",
            "The Philippine Star.",
            "Retrieved April 18, 2016."
        ],
        [
            "^ Memorandum Order No.",
            "292, s. 2008 (December 12, 2008), Expressing Concurrence and Ratification in the Deputation of Law Enforcement Agencies and Other Concerned Agencies in Connection With the December 18, 2008 Plebiscite to Ratify the Creation of Barangay San Miguel, Barangay Tanyag, Barangay South Daang Hari, Barangay North Daang Hari, Barangay Central Bicutan, Barangay North Signal Village, Barangay Katuparan, Barangay South Signal Village, Barangay Central Signal Village, Barangay Pinagsama, Barangay Fort Bonifacio and New Lower Bicutan, All of Taguig City, Official Gazette of the Republic of the Philippines"
        ],
        [
            "^ \"NCR's 'ProbinSyudad' holds 424th Anniversary\".",
            "Philstar.com.",
            "April 24, 2011.",
            "Retrieved June 16, 2023."
        ],
        [
            "^ Hicap, Jonathan (March 12, 2024).",
            "\"NCR's 'ProbinSyudad' holds 424th Anniversary\".",
            "mb.com.ph.",
            "ManilaBulletin.",
            "Retrieved April 6, 2024."
        ],
        [
            "^ \"Corporate Profile - History\".",
            "corporate.pse.com.ph.",
            "Philippine Stock Exchange.",
            "Retrieved April 6, 2024."
        ],
        [
            "^ Modesto, Catherine (March 7, 2020).",
            "\"Taguig-based firm says an employee tests positive for coronavirus\".",
            "CNN Philippines.",
            "Archived from the original on April 4, 2020.",
            "Retrieved April 9, 2020."
        ],
        [
            "^ \"Taguig-based firm says an employee tests positive for coronavirus\".",
            "Philippine News Agency.",
            "October 15, 2020.",
            "Retrieved March 21, 2024."
        ],
        [
            "^ G.R.",
            "No.",
            "235316 (December 1, 2021), Municipality of Makati (now City of Makati) vs. Municipality of Taguig (now City of Taguig), Supreme Court E-Library"
        ],
        [
            "^ \"DILG's Taguig office to take control of 10 EMBO villages\".",
            "Philippine News Agency.",
            "November 8, 2023.",
            "Retrieved November 8, 2023."
        ],
        [
            "^ \"DILG-Taguig to handle programs, projects in 10 former Makati barangays\".",
            "inquirer.net.",
            "November 8, 2023.",
            "Retrieved November 8, 2023."
        ],
        [
            "^ https://bonifacioridge.files.wordpress.com/2013/09/cv-98377-municipality-of-taguig-vs-municipality-of-makati.pdf"
        ],
        [
            "^ a b c \"Table 1 Population of Legislative Districts by Province and Selected Highly Urbanized/ Component City: 2020\" (PDF).",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on February 5, 2022.",
            "Retrieved January 12, 2023."
        ],
        [
            "^ \"Roster of Philippine legislators\".",
            "House of Representatives of the Philippines.",
            "Retrieved February 8, 2021."
        ],
        [
            "^ Aurelio, Julie (July 22, 2023).",
            "\"SC ruling opens issue on Taguig House seats\".",
            "Philippine Daily Inquirer.",
            "Retrieved July 23, 2023."
        ],
        [
            "^ \"After SC ruling, Makati's congressional seat hangs in the balance\".",
            "Rappler.",
            "July 26, 2023.",
            "Retrieved July 27, 2023."
        ],
        [
            "^ Panaligan, Rey (April 27, 2022).",
            "\"SC affirms RTC ruling for Taguig City in territorial dispute with Makati City\".",
            "Manila Bulletin.",
            "Retrieved April 27, 2022."
        ],
        [
            "^ Aravilla, Jose (November 12, 2001).",
            "\"Parañaque, Taguig to meet on Bicutan market jurisdiction\".",
            "The Philippine Star.",
            "Retrieved June 8, 2024."
        ],
        [
            "^ \"Situation report Philippines - Typhoon Ondoy\".",
            "ReliefWeb.",
            "September 29, 2009.",
            "Retrieved April 24, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Taguig: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved May 13, 2020."
        ],
        [
            "^ \"'Big One' Is Possible But Metro Is Unprepared\".",
            "Quezon City, Philippines: Bulatlat.",
            "August 14, 2004.",
            "Retrieved February 3, 2010.",
            "If a major earthquake were to hit Metro Manila today, the devastation would be so big even disaster response authorities cannot simply cope with it.",
            "And it even looks like disaster preparedness occupies a low priority among officials down to the municipal level."
        ],
        [
            "^ \"Determination of Flood-Prone Areas in Taguig, Metro Manila\".",
            "Quezon City, Philippines: ArcGIS Online.",
            "Retrieved April 4, 2024."
        ],
        [
            "^ Census of Population (2015).",
            "\"National Capital Region (NCR)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"National Capital Region (NCR)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"National Capital Region (NCR)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Metro Manila, 4th (Not a Province)\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ Census of Population (2020).",
            "Table B - Population and Annual Growth Rates by Province, City, and Municipality - By Region.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ a b \"ANNEX 5 – Taguig City Profile\" (PDF).",
            "Australian Government Department of Foreign Affairs and Trade.",
            "Retrieved May 11, 2024."
        ],
        [
            "^ \"The battle between Makati and Taguig\".",
            "The Freeman.",
            "August 26, 2023.",
            "Retrieved April 24, 2024."
        ],
        [
            "^ \"Demographics\".",
            "City Government of Taguig.",
            "Retrieved March 1, 2024."
        ],
        [
            "^ Esmaquel, Paterno III (March 4, 2024).",
            "\"In Makati-Taguig dispute, here's one thing that won't change for EMBOs\".",
            "Rappler.",
            "Retrieved March 6, 2024."
        ],
        [
            "^ \"DOST-NCR Gives Tribute to Women-led Organizations\".",
            "DOST-NCR.",
            "Retrieved March 1, 2024."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019.",
            "Archived from the original on April 4, 2023."
        ],
        [
            "^ \"Table 2a.",
            "Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision,  by Region, Province and Highly Urbanized Cities:  2018u\".",
            "Philippine Statistics Authority.",
            "June 4, 2020.",
            "Archived from the original on April 4, 2023."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Taguig socialized housing project cited as RP's best\".",
            "GMA News Online.",
            "February 4, 2009.",
            "Retrieved March 1, 2024."
        ],
        [
            "^ \"BCDA turns over two properties for socialized housing | Bases Conversion and Development Authority\"."
        ],
        [
            "^ \"DTI, Taguig simplify business registration for entrepreneurs\".",
            "Manila Standard.",
            "May 2, 2024.",
            "Retrieved May 3, 2024."
        ],
        [
            "^ \"2023 Rankings of Highly Urbanized Cities\".",
            "Department of Trade and Industry.",
            "Retrieved May 3, 2024."
        ],
        [
            "^ \"Occupancy rate in MM's office spaces remain strong at 81%\".",
            "inquirer.net.",
            "July 7, 2022.",
            "Retrieved March 21, 2023."
        ],
        [
            "^ \"2021 Updating of the List of Establishment Final Result\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 20, 2024."
        ],
        [
            "^ \"Share of existing office space supply in Metro Manila in the Philippines as of 4th quarter 2023, by city\".",
            "Statista.",
            "Retrieved April 20, 2024."
        ],
        [
            "^ Cinco, Maricar (July 25, 2021).",
            "\"Program for Laguna de Bay good, but fishers feel forgotten\".",
            "inquirer.net.",
            "Retrieved October 14, 2023."
        ],
        [
            "^ Cudis, Christine (July 21, 2021).",
            "\"Agri-industrial hub to rise in Taguig City\".",
            "Philippine News Agency.",
            "Retrieved October 14, 2023."
        ],
        [
            "^ \"PBBM praises Taguig urban farming project\".",
            "Manila Standard.",
            "October 5, 2023.",
            "Retrieved March 10, 2024."
        ],
        [
            "^ \"P300-million agri-industrial hub to be built in Taguig City\".",
            "BusinessWorld.",
            "July 21, 2021.",
            "Retrieved March 11, 2024."
        ],
        [
            "^ Cayabyab, Marc Jayson (May 18, 2023).",
            "\"Taguig farmers to harvest 30,000 kilos of melon\".",
            "PhilStar Global.",
            "Retrieved March 10, 2024."
        ],
        [
            "^ JDC.",
            "\"SUNSHINE MALL: Oldest Shopping Center in Taguig\".",
            "Taguigeño.",
            "Retrieved April 9, 2024."
        ],
        [
            "^ Zurbano, Joel (November 13, 2022).",
            "\"Taguig government reopens satellite office in Bonifacio Global City\".",
            "Manila Standard.",
            "Retrieved January 8, 2024."
        ],
        [
            "^ Cabalza, Dexter (July 26, 2019).",
            "\"New 17-story Taguig city hall to be completed in 2021\".",
            "Inquirer.net.",
            "Retrieved August 26, 2023."
        ],
        [
            "^ Republic Act No.",
            "7160 (October 10, 1991), An Act Providing for a Local Government Code of 1991, The LawPhil Project, retrieved April 18, 2016"
        ],
        [
            "^ \"New Senate Building\".",
            "aecom.com.",
            "AECOM.",
            "Retrieved November 9, 2023."
        ],
        [
            "^ Cruz, RG (May 27, 2024).",
            "\"Escudero: Senate won't move to new building this year\".",
            "ABS-CBN News.",
            "Retrieved May 27, 2024."
        ],
        [
            "^ Cervantes, Filane Mikee (November 7, 2023).",
            "\"Study on relocation of Congress in Taguig sought\".",
            "Philippine News Agency.",
            "Retrieved November 9, 2023."
        ],
        [
            "^ Punay, Edu (December 19, 2018).",
            "\"Supreme Court purchases BGC land for new complex\".",
            "The Philippine Star.",
            "Retrieved November 9, 2023."
        ],
        [
            "^ \"AAR Local Government Units\".",
            "Commission on Audit.",
            "Retrieved March 23, 2024."
        ],
        [
            "^ Garcia, Angelo (October 11, 2023).",
            "\"The 10 richest cities in the Philippines\".",
            "GMA Lifestyle.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ \"Executive Budget\" (PDF).",
            "City Government of Taguig.",
            "Retrieved March 23, 2024."
        ],
        [
            "^ \"QC, Makati, Taguig are top NCR revenue earners in 2023\".",
            "inquirer.net.",
            "May 30, 2024.",
            "Retrieved June 1, 2024."
        ],
        [
            "^ \"Manila, Taguig tighten rules for e-bikes, e-trikes on national roads\".",
            "GMA Integrated News.",
            "February 22, 2024.",
            "Retrieved March 2, 2024."
        ],
        [
            "^ Cruz, James Patrick (September 6, 2023).",
            "\"$3.5-billion Makati subway project needs rework after Supreme Court ruling on land dispute\".",
            "Rappler.",
            "Retrieved March 15, 2024."
        ],
        [
            "^ Legaspi, Zeus (January 25, 2024).",
            "\"Transfer of Embo barangays to Taguig affected Makati's subway project\".",
            "inquirer.net.",
            "Retrieved March 15, 2024."
        ],
        [
            "^ \"Bike lanes now set up in Taguig\".",
            "Manila Standard.",
            "June 3, 2020.",
            "Retrieved March 2, 2024."
        ],
        [
            "^ Cruz, James Patrick (August 23, 2023).",
            "\"Makati to lease some EMBO schools to Taguig\".",
            "Rappler.",
            "Retrieved August 25, 2023."
        ],
        [
            "^ \"DepEd: Taguig, Makati conclude 'orderly' transition of EMBO schools\".",
            "CNN Philippines.",
            "January 15, 2024.",
            "Archived from the original on January 15, 2024.",
            "Retrieved January 16, 2024."
        ],
        [
            "^ Frialde, Mike (July 21, 2015).",
            "\"Taguig to become 'university city' with new UP, DLSU campuses\".",
            "The Philippine Star.",
            "Archived from the original on January 14, 2016.",
            "Retrieved February 1, 2016."
        ],
        [
            "^ \"Taguig becoming a 'University City'\".",
            "Taguig City Official Website.",
            "Retrieved February 1, 2016."
        ],
        [
            "^ \"Megaworld and DLSU Jointly Inaugurate DLSU McKinley Microcampus, Marking a Milestone in Research and Education\".",
            "Dr. Andrew L. Tan Data Science Institute.",
            "May 1, 2023.",
            "Retrieved January 8, 2024."
        ],
        [
            "^ \"Taguig provides medical services to EMBO residents after closure of health centers\".",
            "Manila Bulletin.",
            "January 8, 2024.",
            "Retrieved April 4, 2024."
        ],
        [
            "^ a b \"Taguig builds more medical facilities\".",
            "Manila Standard.",
            "June 8, 2022.",
            "Retrieved April 6, 2024."
        ],
        [
            "^ \"Army General Hospital\" (PDF).",
            "Philippine Army.",
            "Retrieved April 6, 2024."
        ],
        [
            "^ \"PH's 1st dedicated cancer hospital rises in Taguig City\".",
            "inquirer.net.",
            "April 16, 2024.",
            "Retrieved April 16, 2024."
        ],
        [
            "^ Go, Marianne (December 1, 2023).",
            "\"Finally, a cancer care center for Filipinos\".",
            "PhilStar Global.",
            "Retrieved April 6, 2024."
        ],
        [
            "^ Baustista, Nillicent (January 13, 2024).",
            "\"Makati, Taguig offer health services to 'embo' residents\".",
            "The Philippine Star.",
            "Retrieved April 9, 2024."
        ],
        [
            "^ \"Tourism\".",
            "City Government of Taguig.",
            "Retrieved June 1, 2024."
        ],
        [
            "^ \"Council approves sisterhood, twinning with Taguig\".",
            "SunStar.",
            "May 11, 2012.",
            "Archived from the original on June 16, 2013."
        ],
        [
            "^ \"Taguig forges friendship with Korea's Goyang City\".",
            "MetroManilaPolitics.gov.ph.",
            "July 25, 2023."
        ],
        [
            "^ \"Himamaylan City eyes sisterhood deal with Taguig City\".",
            "SunStar Bacolod.",
            "November 13, 2022."
        ],
        [
            "^ \"Iloilo honors sister cities\".",
            "Manila Bulletin.",
            "August 26, 2018.",
            "Archived from the original on July 25, 2019.",
            "Retrieved July 25, 2019."
        ],
        [
            "^ \"Resolution Expressing Intention for Sisterhood and Twinning With Taguig City\".",
            "Tabaco City.com.",
            "March 21, 2011.",
            "Archived from the original on October 29, 2013.",
            "Retrieved May 14, 2013."
        ],
        [
            "^ \"A Resolution Extending an Invitation to the City of Taguig to Become a Sister City of Vigan, Ilocos Sur\" (PDF).",
            "City of Vigan.",
            "February 18, 2008.",
            "Archived from the original (PDF) on April 19, 2021."
        ],
        [
            "^ \"Taguig Mayor Lani Cayetano Forges Links with Mayor Stephen Bali of Blacktown City in Australia\".",
            "DFA.gov.ph.",
            "March 28, 2018.",
            "Archived from the original on April 21, 2021.",
            "Retrieved July 25, 2019."
        ],
        [
            "Note"
        ],
        [
            "External links"
        ],
        [
            "Official Website of Taguig City"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Think Big Taguig - Official Lifestyle Website Archived November 24, 2020, at the Wayback Machine"
        ],
        [
            "Official Facebook page of City of Taguig"
        ],
        [
            "Taguig City General Information"
        ],
        [
            " Geographic data related to Taguig at OpenStreetMap"
        ],
        [
            "Places adjacent to Taguig"
        ],
        [
            "MandaluyongMakati"
        ],
        [
            "Pateros / Pasig"
        ],
        [
            "Taytay, Rizal"
        ],
        [
            "PasayParañaque"
        ],
        [
            "Taguig"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "Muntinlupa"
        ],
        [
            "vteCity of TaguigHighly-Urbanized CityTopics"
        ],
        [
            "Historical markers"
        ],
        [
            "Mayor"
        ],
        [
            "People"
        ],
        [
            "Public education"
        ],
        [
            "List of schools"
        ],
        [
            "Skyscrapers"
        ],
        [
            "Tourism"
        ],
        [
            "Transportation"
        ],
        [
            "Barangays"
        ],
        [
            "Bagumbayan"
        ],
        [
            "Bambang"
        ],
        [
            "Calzada"
        ],
        [
            "Cembo"
        ],
        [
            "Central Bicutan"
        ],
        [
            "Central Signal Village"
        ],
        [
            "Comembo"
        ],
        [
            "East Rembo"
        ],
        [
            "Fort Bonifacio"
        ],
        [
            "Hagonoy"
        ],
        [
            "Ibayo-Tipas"
        ],
        [
            "Katuparan"
        ],
        [
            "Ligid-Tipas"
        ],
        [
            "Lower Bicutan"
        ],
        [
            "Maharlika Village"
        ],
        [
            "Napindan"
        ],
        [
            "New Lower Bicutan"
        ],
        [
            "North Daang Hari"
        ],
        [
            "North Signal Village"
        ],
        [
            "Palingon Tipas"
        ],
        [
            "Pembo"
        ],
        [
            "Pinagsama"
        ],
        [
            "Pitogo"
        ],
        [
            "Post Proper Northside"
        ],
        [
            "Post Proper Southside"
        ],
        [
            "Rizal"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Ana"
        ],
        [
            "South Cembo"
        ],
        [
            "South Daang Hari"
        ],
        [
            "South Signal Village"
        ],
        [
            "Tanyag"
        ],
        [
            "Tuktukan"
        ],
        [
            "Ususan"
        ],
        [
            "Upper Bicutan"
        ],
        [
            "Wawa"
        ],
        [
            "Western Bicutan"
        ],
        [
            "West Rembo"
        ],
        [
            "Geography"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "Marikina Valley Fault System"
        ],
        [
            "Pasig River"
        ],
        [
            "Taguig River"
        ],
        [
            "Central Business Districts"
        ],
        [
            "Arca South"
        ],
        [
            "Bonifacio Capital District"
        ],
        [
            "Bonifacio Global City"
        ],
        [
            "Historic landmarks"
        ],
        [
            "Camp Bagong Diwa"
        ],
        [
            "Dambanang Kawayan"
        ],
        [
            "Fort Bonifacio Tunnel"
        ],
        [
            "Libingan ng mga Bayani"
        ],
        [
            "Manila American Cemetery"
        ],
        [
            "Minor Basilica and Archdiocesan Shrine of St. Anne"
        ],
        [
            "Napindan Lighthouse"
        ],
        [
            "New Senate Building"
        ],
        [
            "Philippine Navy Golf Club"
        ],
        [
            "Simborio"
        ],
        [
            "Legislative districtsPateros–Taguig"
        ],
        [
            "Pateros–Taguig (1st District)"
        ],
        [
            "Taguig"
        ],
        [
            "Taguig (2nd District)"
        ],
        [
            "Makati"
        ],
        [
            "2nd district of Makati (Embo barangays)"
        ],
        [
            "Metro Manila"
        ],
        [
            "Philippines"
        ],
        [
            "Articles related to Taguig"
        ],
        [
            "vteBonifacio Global CityFort Bonifacio, City of TaguigTowers"
        ],
        [
            "ArthaLand Century Pacific Tower"
        ],
        [
            "BGC Stopover Pavilion"
        ],
        [
            "Clipp Center"
        ],
        [
            "EcoTower"
        ],
        [
            "Metrobank Center"
        ],
        [
            "Icone Tower"
        ],
        [
            "Net Park"
        ],
        [
            "One McKinley Place"
        ],
        [
            "One World Place"
        ],
        [
            "Pacific Plaza Towers"
        ],
        [
            "Picadilly Star"
        ],
        [
            "Serendra"
        ],
        [
            "Shangri-La at the Fort, Manila"
        ],
        [
            "The Finance Centre"
        ],
        [
            "The Infinity Fort Bonifacio"
        ],
        [
            "W Global Center"
        ],
        [
            "World Plaza"
        ],
        [
            "Shopping centers"
        ],
        [
            "Bonifacio High Street"
        ],
        [
            "Market!",
            "Market!"
        ],
        [
            "Mitsukoshi BGC"
        ],
        [
            "SM Aura"
        ],
        [
            "Uptown Mall"
        ],
        [
            "Venice Grand Canal Mall"
        ],
        [
            "Other landmarks"
        ],
        [
            "Embassy of Israel, Manila"
        ],
        [
            "Embassy of Singapore, Manila"
        ],
        [
            "Fort Bonifacio"
        ],
        [
            "Fort Bonifacio Tunnel"
        ],
        [
            "KidZania Manila"
        ],
        [
            "Libingan ng mga Bayani"
        ],
        [
            "Manila American Cemetery"
        ],
        [
            "McKinley Hill Stadium"
        ],
        [
            "St. Luke's Medical Center"
        ],
        [
            "The Mind Museum"
        ],
        [
            "Education"
        ],
        [
            "British School Manila"
        ],
        [
            "Enderun Colleges"
        ],
        [
            "International School Manila"
        ],
        [
            "Korean International School Philippines"
        ],
        [
            "Leaders International Christian School of Manila"
        ],
        [
            "Manila Japanese School"
        ],
        [
            "Transportation"
        ],
        [
            "BGC Bus"
        ],
        [
            "Bonifacio Global City station"
        ],
        [
            "Carlos P. Garcia Avenue"
        ],
        [
            "Kalayaan Avenue"
        ],
        [
            "Kalayaan station (Line 9)"
        ],
        [
            "Lawton Avenue"
        ],
        [
            "Lawton East station"
        ],
        [
            "Lawton West station"
        ],
        [
            "McKinley Road"
        ],
        [
            "SkyTrain"
        ],
        [
            "Italics denote buildings under construction or planned."
        ],
        [
            "vteMetro ManilaNational Capital Region of the PhilippinesManila (capital city)Administrative divisions"
        ],
        [
            "Caloocan"
        ],
        [
            "Las Piñas"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Pateros"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Barangays"
        ],
        [
            "Legislative districts"
        ],
        [
            "Geography"
        ],
        [
            "Manila Bay"
        ],
        [
            "Pasig River"
        ],
        [
            "Marikina River"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "Sierra Madre"
        ],
        [
            "La Mesa Watershed Reservation"
        ],
        [
            "Marikina Valley Fault System"
        ],
        [
            "Rivers and esteros"
        ],
        [
            "Islands"
        ],
        [
            "Parks"
        ],
        [
            "Beaches"
        ],
        [
            "Slums"
        ],
        [
            "Land reclamation"
        ],
        [
            "Bay City"
        ],
        [
            "Manggahan Floodway"
        ],
        [
            "Greater Manila Area"
        ],
        [
            "Mega Manila"
        ],
        [
            "Government"
        ],
        [
            "Metropolitan Manila Development Authority"
        ],
        [
            "Chairperson"
        ],
        [
            "Mayors"
        ],
        [
            "Governor (defunct)"
        ],
        [
            "History"
        ],
        [
            "Prehistory"
        ],
        [
            "Maynila"
        ],
        [
            "Tondo"
        ],
        [
            "Namayan"
        ],
        [
            "Intramuros"
        ],
        [
            "Province of Manila"
        ],
        [
            "Manila–Acapulco Galleon"
        ],
        [
            "Battles of La Naval de Manila"
        ],
        [
            "British occupation of Manila"
        ],
        [
            "1880 Luzon earthquakes"
        ],
        [
            "Cry of Pugad Lawin"
        ],
        [
            "Battle of Manila Bay"
        ],
        [
            "Battle of Manila (1899)"
        ],
        [
            "Province of Rizal"
        ],
        [
            "City of Greater Manila"
        ],
        [
            "Battle of Manila (1945)"
        ],
        [
            "Manila massacre"
        ],
        [
            "City of Man"
        ],
        [
            "People Power Revolution"
        ],
        [
            "World Youth Day 1995"
        ],
        [
            "Rehabilitation of the Pasig River"
        ],
        [
            "Rizal Day bombings"
        ],
        [
            "Typhoon Ketsana"
        ],
        [
            "COVID-19 pandemic"
        ],
        [
            "Timeline"
        ],
        [
            "Oldest buildings and structures"
        ],
        [
            "Cultural properties"
        ],
        [
            "Historical markers"
        ],
        [
            "Economy"
        ],
        [
            "Makati CBD"
        ],
        [
            "Ayala Avenue"
        ],
        [
            "Ortigas Center"
        ],
        [
            "Bonifacio Global City"
        ],
        [
            "Binondo"
        ],
        [
            "Escolta Street"
        ],
        [
            "Philippine Stock Exchange"
        ],
        [
            "Manila Commodity Exchange"
        ],
        [
            "Bangko Sentral ng Pilipinas"
        ],
        [
            "Manila Mint"
        ],
        [
            "Tourism"
        ],
        [
            "Attractions"
        ],
        [
            "Hotels"
        ],
        [
            "Gambling"
        ],
        [
            "Entertainment City"
        ],
        [
            "Mixed-use developments"
        ],
        [
            "Skyscrapers"
        ],
        [
            "Public services and utilities"
        ],
        [
            "Hospitals"
        ],
        [
            "Police"
        ],
        [
            "Manila Electric Company (Meralco)"
        ],
        [
            "Metropolitan Waterworks and Sewerage System"
        ],
        [
            "Water privatization"
        ],
        [
            "Manila Water Company"
        ],
        [
            "Maynilad Water Services"
        ],
        [
            "Pasig River Rehabilitation Commission"
        ],
        [
            "Laguna Lake Development Authority"
        ],
        [
            "Education"
        ],
        [
            "Colleges and universities"
        ],
        [
            "University Belt"
        ],
        [
            "Primary and secondary schools"
        ],
        [
            "International schools"
        ],
        [
            "Libraries"
        ],
        [
            "Culture"
        ],
        [
            "Annual events"
        ],
        [
            "Cemeteries"
        ],
        [
            "Cinemas"
        ],
        [
            "Museums"
        ],
        [
            "Public art"
        ],
        [
            "Religious buildings"
        ],
        [
            "Roman Catholic churches"
        ],
        [
            "Shopping malls"
        ],
        [
            "Songs about Manila"
        ],
        [
            "Manila sound"
        ],
        [
            "Sporting events"
        ],
        [
            "Sports venues"
        ],
        [
            "Theaters and concert halls"
        ],
        [
            "Art Deco theaters"
        ],
        [
            "Newspapers"
        ],
        [
            "Television stations"
        ],
        [
            "Radio stations"
        ],
        [
            "Transportation"
        ],
        [
            "Government"
        ],
        [
            "Department of Transportation (DOTr)"
        ],
        [
            "MMDA"
        ],
        [
            "LRTA"
        ],
        [
            "PNR"
        ],
        [
            "MIAA"
        ],
        [
            "Road"
        ],
        [
            "Bus routes"
        ],
        [
            "P2P routes"
        ],
        [
            "Intermodal terminals"
        ],
        [
            "Rail"
        ],
        [
            "LRT"
        ],
        [
            "MRT"
        ],
        [
            "Water"
        ],
        [
            "Port of Manila"
        ],
        [
            "Pasig River Ferry Service"
        ],
        [
            "Aviation"
        ],
        [
            "Traffic"
        ],
        [
            "Other topics"
        ],
        [
            "Imperial Manila"
        ],
        [
            "Nicknames of Manila"
        ],
        [
            "Notable Manileños"
        ],
        [
            "Sister cities"
        ],
        [
            "Metro Manila Dream Plan"
        ],
        [
            "Burnham Plan of Manila"
        ],
        [
            "Frost Plan of Quezon City"
        ],
        [
            "Outline"
        ],
        [
            "Index"
        ],
        [
            " Category"
        ],
        [
            "vteList of cities in the PhilippinesHighly urbanizedcities"
        ],
        [
            "Angeles City"
        ],
        [
            "Bacolod"
        ],
        [
            "Baguio"
        ],
        [
            "Butuan"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Caloocan"
        ],
        [
            "Cebu City"
        ],
        [
            "Davao City"
        ],
        [
            "General Santos"
        ],
        [
            "Iligan"
        ],
        [
            "Iloilo City"
        ],
        [
            "Lapu-Lapu City"
        ],
        [
            "Las Piñas"
        ],
        [
            "Lucena"
        ],
        [
            "Makati"
        ],
        [
            "Malabon"
        ],
        [
            "Mandaluyong"
        ],
        [
            "Mandaue"
        ],
        [
            "Manila"
        ],
        [
            "Marikina"
        ],
        [
            "Muntinlupa"
        ],
        [
            "Navotas"
        ],
        [
            "Olongapo"
        ],
        [
            "Parañaque"
        ],
        [
            "Pasay"
        ],
        [
            "Pasig"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Quezon City"
        ],
        [
            "San Juan"
        ],
        [
            "Tacloban"
        ],
        [
            "Taguig"
        ],
        [
            "Valenzuela"
        ],
        [
            "Zamboanga City"
        ],
        [
            "Independentcomponent cities"
        ],
        [
            "Cotabato City"
        ],
        [
            "Dagupan"
        ],
        [
            "Naga, Camarines Sur"
        ],
        [
            "Ormoc"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Bago"
        ],
        [
            "Bais"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Batac"
        ],
        [
            "Batangas City"
        ],
        [
            "Bayawan"
        ],
        [
            "Baybay"
        ],
        [
            "Bayugan"
        ],
        [
            "Biñan"
        ],
        [
            "Bislig"
        ],
        [
            "Bogo"
        ],
        [
            "Borongan"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Cadiz"
        ],
        [
            "Calaca"
        ],
        [
            "Calamba"
        ],
        [
            "Calapan"
        ],
        [
            "Calbayog"
        ],
        [
            "Candon"
        ],
        [
            "Canlaon"
        ],
        [
            "Carcar"
        ],
        [
            "Carmona"
        ],
        [
            "Catbalogan"
        ],
        [
            "Cauayan"
        ],
        [
            "Cavite City"
        ],
        [
            "Danao"
        ],
        [
            "Dapitan"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Digos"
        ],
        [
            "Dipolog"
        ],
        [
            "Dumaguete"
        ],
        [
            "El Salvador"
        ],
        [
            "Escalante"
        ],
        [
            "Gapan"
        ],
        [
            "General Trias"
        ],
        [
            "Gingoog"
        ],
        [
            "Guihulngan"
        ],
        [
            "Himamaylan"
        ],
        [
            "Ilagan"
        ],
        [
            "Imus"
        ],
        [
            "Iriga"
        ],
        [
            "Isabela"
        ],
        [
            "Kabankalan"
        ],
        [
            "Kidapawan"
        ],
        [
            "Koronadal"
        ],
        [
            "La Carlota"
        ],
        [
            "Lamitan"
        ],
        [
            "Laoag"
        ],
        [
            "Legazpi"
        ],
        [
            "Ligao"
        ],
        [
            "Lipa"
        ],
        [
            "Maasin"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malaybalay"
        ],
        [
            "Malolos"
        ],
        [
            "Marawi"
        ],
        [
            "Masbate City"
        ],
        [
            "Mati"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Naga, Cebu"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Pagadian"
        ],
        [
            "Palayan"
        ],
        [
            "Panabo"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Sagay"
        ],
        [
            "Samal"
        ],
        [
            "San Carlos, Negros Occidental"
        ],
        [
            "San Carlos, Pangasinan"
        ],
        [
            "San Fernando, La Union"
        ],
        [
            "San Fernando, Pampanga"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Silay"
        ],
        [
            "Sipalay"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Surigao City"
        ],
        [
            "Tabaco"
        ],
        [
            "Tabuk"
        ],
        [
            "Tacurong"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Tagum"
        ],
        [
            "Talisay, Cebu"
        ],
        [
            "Talisay, Negros Occidental"
        ],
        [
            "Tanauan"
        ],
        [
            "Tandag"
        ],
        [
            "Tangub"
        ],
        [
            "Tanjay"
        ],
        [
            "Tarlac City"
        ],
        [
            "Tayabas"
        ],
        [
            "Toledo"
        ],
        [
            "Trece Martires"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Urdaneta"
        ],
        [
            "Valencia"
        ],
        [
            "Victorias"
        ],
        [
            "Vigan"
        ],
        [
            "vte Philippines cities with a 100,000+ population2,000,000 and more"
        ],
        [
            "Quezon City (2,960,048)"
        ],
        [
            "1,000,000–1,999,999"
        ],
        [
            "Manila (1,846,513)"
        ],
        [
            "Davao City (1,776,949)"
        ],
        [
            "Caloocan (1,661,584)"
        ],
        [
            "Taguig (1,223,597)"
        ],
        [
            "500,000–999,999"
        ],
        [
            "Zamboanga City (977,234)"
        ],
        [
            "Cebu City (964,169)"
        ],
        [
            "Antipolo (887,399)"
        ],
        [
            "Pasig (803,159)"
        ],
        [
            "Cagayan de Oro (728,402)"
        ],
        [
            "Valenzuela (714,978)"
        ],
        [
            "Dasmariñas (703,141)"
        ],
        [
            "General Santos (697,315)"
        ],
        [
            "Parañaque (689,992)"
        ],
        [
            "Bacoor (664,625)"
        ],
        [
            "San Jose del Monte (651,813)"
        ],
        [
            "Las Piñas (606,293)"
        ],
        [
            "Bacolod (600,783)"
        ],
        [
            "Muntinlupa (543,445)"
        ],
        [
            "Calamba (539,671)"
        ],
        [
            "200,000–499,999"
        ],
        [
            "Lapu-Lapu City (497,604)"
        ],
        [
            "Imus (496,794)"
        ],
        [
            "Angeles City (462,928)"
        ],
        [
            "Iloilo City (457,626)"
        ],
        [
            "Marikina (456,059)"
        ],
        [
            "General Trias (450,583)"
        ],
        [
            "Pasay (440,656)"
        ],
        [
            "Mandaluyong (425,758)"
        ],
        [
            "Santa Rosa (414,812)"
        ],
        [
            "Biñan (407,437)"
        ],
        [
            "Tarlac City (385,398)"
        ],
        [
            "Malabon (380,522)"
        ],
        [
            "Lipa (372,931)"
        ],
        [
            "Butuan (372,910)"
        ],
        [
            "Baguio (366,358)"
        ],
        [
            "Mandaue (364,116)"
        ],
        [
            "Iligan (363,115)"
        ],
        [
            "Cabuyao (355,330)"
        ],
        [
            "San Fernando (Pampanga) (354,666)"
        ],
        [
            "Batangas City (351,647)"
        ],
        [
            "Cabanatuan (327,325)"
        ],
        [
            "San Pedro (326,001)"
        ],
        [
            "Cotabato City (325,079)"
        ],
        [
            "Puerto Princesa (307,079)"
        ],
        [
            "Tagum (296,202)"
        ],
        [
            "Mabalacat (293,244)"
        ],
        [
            "Makati (292,743)"
        ],
        [
            "San Pablo (285,348)"
        ],
        [
            "Lucena (278,924)"
        ],
        [
            "Talisay (Cebu) (263,048)"
        ],
        [
            "Malolos (261,189)"
        ],
        [
            "Olongapo (260,317)"
        ],
        [
            "Tacloban (251,881)"
        ],
        [
            "Navotas (247,543)"
        ],
        [
            "Ormoc (230,998)"
        ],
        [
            "Meycauayan (225,673)"
        ],
        [
            "Santo Tomas (218,500)"
        ],
        [
            "Valencia (Bukidnon) (216,546)"
        ],
        [
            "Trece Martires (210,503)"
        ],
        [
            "Pagadian (210,542)"
        ],
        [
            "Legazpi (209,533)"
        ],
        [
            "Panabo (209,230)"
        ],
        [
            "Naga (Camarines Sur) (209,170)"
        ],
        [
            "Toledo (207,314)"
        ],
        [
            "Marawi (207,010)"
        ],
        [
            "San Carlos (Pangasinan) (205,424)"
        ],
        [
            "Kabankalan (200,198)"
        ],
        [
            "100,000–199,999"
        ],
        [
            "Koronadal (195,398)"
        ],
        [
            "Bago (191,210)"
        ],
        [
            "Malaybalay (190,712)"
        ],
        [
            "Digos (188,376)"
        ],
        [
            "Calbayog (186,960)"
        ],
        [
            "Sorsogon City (182,237)"
        ],
        [
            "Roxas City (179,292)"
        ],
        [
            "Dagupan (174,302)"
        ],
        [
            "Surigao City (171,107)"
        ],
        [
            "Baliwag (168,470)"
        ],
        [
            "Tuguegarao (166,334)"
        ],
        [
            "Kidapawan (160,791)"
        ],
        [
            "Cadiz (158,544)"
        ],
        [
            "Ilagan (158,258)"
        ],
        [
            "Danao (156,321)"
        ],
        [
            "San Jose (Nueva Ecija) (150,917)"
        ],
        [
            "Sagay (148,894)"
        ],
        [
            "Santiago (148,580)"
        ],
        [
            "Mati (147,547)"
        ],
        [
            "Urdaneta (144,577)"
        ],
        [
            "Cauayan (143,403)"
        ],
        [
            "Calapan (145,786)"
        ],
        [
            "Tabaco (140,961)"
        ],
        [
            "Ozamis (140,443)"
        ],
        [
            "Dipolog (138,141)"
        ],
        [
            "Gingoog (136,698)"
        ],
        [
            "Carcar (136,453)"
        ],
        [
            "Dumaguete (134,103)"
        ],
        [
            "Naga (Cebu) (133,184)"
        ],
        [
            "San Carlos (Negros Occidental) (132,650)"
        ],
        [
            "Silay (130,478)"
        ],
        [
            "Isabela (Basilan) (130,379)"
        ],
        [
            "San Juan (Metro Manila) (126,347)"
        ],
        [
            "San Fernando (La Union) (125,640)"
        ],
        [
            "Gapan (122,968)"
        ],
        [
            "Bayawan (122,747)"
        ],
        [
            "Tabuk (121,033)"
        ],
        [
            "Ligao (118,096)"
        ],
        [
            "Samal (Davao del Norte) (116,771)"
        ],
        [
            "Himamaylan (116,240)"
        ],
        [
            "Iriga (114,457)"
        ],
        [
            "Tayabas (112,658)"
        ],
        [
            "Baybay (111,848)"
        ],
        [
            "Laoag (111,651)"
        ],
        [
            "Tacurong (109,319)"
        ],
        [
            "Talisay (Negros Occidental) (108,909)"
        ],
        [
            "Catbalogan (106,440)"
        ],
        [
            "Carmona (106,256)"
        ],
        [
            "Tagbilaran (104,976)"
        ],
        [
            "Masbate City (104,522)"
        ],
        [
            "Balanga (104,173)"
        ],
        [
            "Guihulngan (102,656)"
        ],
        [
            "Cavite City (100,674)"
        ],
        [
            "Lamitan (100,150)"
        ],
        [
            "vteLargest cities in LuzonPSA Census May 2020"
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            " Pop."
        ],
        [
            "Rank"
        ],
        [
            "Name"
        ],
        [
            "Region"
        ],
        [
            " Pop."
        ],
        [
            "Quezon CityManila"
        ],
        [
            "1"
        ],
        [
            "Quezon City"
        ],
        [
            "National Capital Region"
        ],
        [
            "2,960,048"
        ],
        [
            "11"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Central Luzon"
        ],
        [
            "651,813"
        ],
        [
            "CaloocanAntipolo"
        ],
        [
            "2"
        ],
        [
            "Manila"
        ],
        [
            "National Capital Region"
        ],
        [
            "1,846,513"
        ],
        [
            "12"
        ],
        [
            "Makati"
        ],
        [
            "National Capital Region"
        ],
        [
            "629,616"
        ],
        [
            "3"
        ],
        [
            "Caloocan"
        ],
        [
            "National Capital Region"
        ],
        [
            "1,661,584"
        ],
        [
            "13"
        ],
        [
            "Las Piñas"
        ],
        [
            "National Capital Region"
        ],
        [
            "606,293"
        ],
        [
            "4"
        ],
        [
            "Antipolo"
        ],
        [
            "Calabarzon"
        ],
        [
            "887,399"
        ],
        [
            "14"
        ],
        [
            "Muntinlupa"
        ],
        [
            "National Capital Region"
        ],
        [
            "543,445"
        ],
        [
            "5"
        ],
        [
            "Taguig"
        ],
        [
            "National Capital Region"
        ],
        [
            "886,722"
        ],
        [
            "15"
        ],
        [
            "Calamba"
        ],
        [
            "Calabarzon"
        ],
        [
            "539,671"
        ],
        [
            "6"
        ],
        [
            "Pasig"
        ],
        [
            "National Capital Region"
        ],
        [
            "803,159"
        ],
        [
            "16"
        ],
        [
            "Imus"
        ],
        [
            "Calabarzon"
        ],
        [
            "496,794"
        ],
        [
            "7"
        ],
        [
            "Valenzuela"
        ],
        [
            "National Capital Region"
        ],
        [
            "714,978"
        ],
        [
            "17"
        ],
        [
            "Angeles"
        ],
        [
            "Central Luzon"
        ],
        [
            "462,928"
        ],
        [
            "8"
        ],
        [
            "Dasmariñas"
        ],
        [
            "Calabarzon"
        ],
        [
            "703,141"
        ],
        [
            "18"
        ],
        [
            "Marikina"
        ],
        [
            "National Capital Region"
        ],
        [
            "456,059"
        ],
        [
            "9"
        ],
        [
            "Parañaque"
        ],
        [
            "National Capital Region"
        ],
        [
            "689,992"
        ],
        [
            "19"
        ],
        [
            "General Trias"
        ],
        [
            "Calabarzon"
        ],
        [
            "450,583"
        ],
        [
            "10"
        ],
        [
            "Bacoor"
        ],
        [
            "Calabarzon"
        ],
        [
            "664,625"
        ],
        [
            "20"
        ],
        [
            "Pasay"
        ],
        [
            "National Capital Region"
        ],
        [
            "440,656"
        ],
        [
            "Portals: Geography Asia PhilippinesTaguig at Wikipedia's sister projects:Media from CommonsNews from WikinewsTravel guides from Wikivoyage"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Taguig&oldid=1234236303\""
        ],
        [
            "Categories: TaguigCities in Metro ManilaPopulated places established in 15871587 establishments in the PhilippinesPopulated places on the Pasig RiverPopulated places on Laguna de BayHighly urbanized cities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsPages using the Phonos extensionCS1 maint: unfit URLCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataWikipedia pages semi-protected against vandalismWikipedia indefinitely semi-protected pagesUse Philippine English from March 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from July 2022Pages using multiple image with auto scaled imagesCoordinates on WikidataPages with Tagalog IPAPages including recorded pronunciationsArticles containing Filipino-language textWebarchive template wayback linksPages using largest cities with nav classPages using Sister project links with wikidata namespace mismatchArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}