{
    "name": "Talavera",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Talavera, Nueva Ecija"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPolskiPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°35′02″N 120°55′08″E﻿ / ﻿15.5839°N 120.9189°E﻿ / 15.5839; 120.9189"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Nueva Ecija, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Talavera, Nueva Ecija\" – news · newspapers · books · scholar · JSTOR (October 2012) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Central Luzon, PhilippinesTalaveraMunicipalityMunicipality of TalaveraDowntown"
        ],
        [
            "SealMotto: Sa Talavera...Todo Asenso Bayan at TaoMap of Nueva Ecija with Talavera highlightedOpenStreetMapTalaveraLocation within the PhilippinesCoordinates: 15°35′02″N 120°55′08″E﻿ / ﻿15.5839°N 120.9189°E﻿ / 15.5839; 120.9189CountryPhilippinesRegionCentral LuzonProvinceNueva EcijaDistrict"
        ],
        [
            "1st districtFounded1872Named forTalavera de la Reina, SpainBarangays53"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorNerito S. Santos Jr. • Vice MayorNerivi S. Santos-Martinez • RepresentativeMikaela Angela B. Suansing • Councilors"
        ],
        [
            "Members"
        ],
        [
            "Erwin ChiocoJoel del RosarioAries Gaboy LimBaby PalilioNel RayoLito SilvaApe ReyesRai Rai Villanueva"
        ],
        [
            "  • Electorate94,432 voters (2022)Area • Revenue₱ 439.9 million (2020) • Assets₱ 1,633 million (2020) • Expenditure₱ 411.4 million (2020) • Liabilities₱ 892.2 million (2020)Service provider • ElectricityNueva Ecija 2 Area 1 Electric Cooperative (NEECO 2 A1)Time zoneUTC+8 (PST)ZIP code3114PSGC034930000IDD : area code +63 (0)44Native languagesIlocano TagalogWebsitewww.talavera.gov.ph"
        ],
        [
            "Talavera, officially the Municipality of Talavera (Tagalog: Bayan ng Talavera; Ilocano: Ili ti Talavera), is a 1st class municipality in the province of Nueva Ecija, Philippines.",
            "According to the 2020 census, it has a population of 132,338."
        ],
        [
            "Talavera is part of Cabanatuan conurbation as adjacent urban center in the heart of Nueva Ecija.",
            "It is dubbed as the \"Milk Capital\" and \"Food basket in Inland Luzon\"."
        ],
        [
            "History"
        ],
        [
            "This section is written like a personal reflection, personal essay, or argumentative essay that states a Wikipedia editor's personal feelings or presents an original argument about a topic.",
            "Please help improve it by rewriting it in an encyclopedic style.",
            "(June 2024) (Learn how and when to remove this message)"
        ],
        [
            "Specific accounts pertinent to understanding Talavera’s history and development were generally sparse.",
            "While its beginning could be traced back as far as 1846, no explicit account of its historical development was fully chartered or documented, except perhaps some fragments and rarities that somehow occasioned a kind of historic significance to its otherwise complex development.",
            "In fact, it was only during the term of then Municipal Mayor Romeo F. Maliwat in 1965 that its history was revisited and re-written.",
            "Mr. Tomas I. Pagaduan, then public librarian, was commissioned and tasked to write the history of Talavera.",
            "Said history was printed and published in 1967."
        ],
        [
            "Nevertheless, earlier accounts about Talavera, then known as Catuguian, described it generally as being situated on “flat land and rest on the margin of the river”.",
            "The Spanish scribe Joaquin Rajal aptly characterized it as follows:"
        ],
        [
            "It lacks a church, parish house, court, and schools, and their spiritual administration is equally shared with Cabanatuan, as it has not been appointed since it was formed,"
        ],
        [
            "On the whole, the history of Talavera could be associated, in some general way or other, with the history of the early Augustinian missions in lowland Nueva Ecija in 1595, particularly in Gapan.",
            "The succeeding timelines could provide a rather general view of Talavera’s history."
        ],
        [
            "1846 – 1851: Barrio Catuguian"
        ],
        [
            "Earliest accounts of Catuguian could be traced from the early Augustinian missions in lowland Nueva Ecija, being a component barrio of Cabanatuan."
        ],
        [
            "The establishment of a chapel or visita for religious celebration in Catuguian shaped its succeeding history."
        ],
        [
            "Its population grew after Nueva Ecija became a regular province in 1848,"
        ],
        [
            "The people of Catuguian initiated a petition to  the Alcalde-Mayor of Nueva Ecija in 1852 to create an independent town by consolidating the barrios of La Torre, Concepcion, Pulong Buli (Sto.",
            "Domingo), Valle and Baloc, with Catuguian as its capital.",
            "This was sent to the Governor-General of Manila for approval."
        ],
        [
            "1852 – 1872: From Catuguian to Talavera"
        ],
        [
            "The petition was granted.",
            "An independent pueblo was created, with Catuguian being the capital on December 11, 1852."
        ],
        [
            "On February 4, 1853, it made another petition to the Governor General in Manila, requesting that its name be changed to Talavera, after Talavera de la Princesa e Coruna."
        ],
        [
            "On February 14, 1853, the petition was granted and Catuguian came to be called “Talavera”."
        ],
        [
            "On November 20, 1872, through a Royal Decree issued by King Amadeo I, the Parroquia de Talavera was formally recognized and instituted."
        ],
        [
            "1873 - 1899: The Making of Talavera"
        ],
        [
            "Talavera experienced the rise of landed estates by 1880.",
            "Known Haciendas during this period were Hacienda Bakal, Hacienda Romero, and Hacienda Jacinto."
        ],
        [
            "It became one of the primary suppliers of cattle to the Manila Market, owing to its rich grasslands."
        ],
        [
            "Talavera became one of the tributary districts of Tobacco plantations in the province, with Valle and Concepcion."
        ],
        [
            "By 1892, its population grew as much as 18,786 because of the migration of farm workers and tillers."
        ],
        [
            "The barrios of Sto.",
            "Domingo and Dolores were separated from Talavera to create the Municipality of Sto.",
            "Domingo and its Parish."
        ],
        [
            "1900 – 1940: The rise of landlordism"
        ],
        [
            "The town of Talavera was occupied by Gen. Henry Lawton on November 1, 1899, owing to the Filipino-American War."
        ],
        [
            "Steady expansion of landed estates because Spanish owned estates were sold to Filipino elites, resulting in land exploitation and land grabbing."
        ],
        [
            "Sitio of Bacal, formerly Buenavista (part of San Juan de Guimba), was annexed to Talavera in 1910 upon the recommendation of Honorable Isauro Gabaldon."
        ],
        [
            "The Sitios of Kabisukulan, Rangayan, Rizal, Siniguelas, Pukoc, Agricultura, Pulong-Maragol and Mataas-na-Lupa were separated from Talavera and were organized into an independent municipality under Muñoz in 1912."
        ],
        [
            "Wave of migration to Talavera because of the rising demand for agriculture and livestock grazing, as haciendas grew in size."
        ],
        [
            "Rise of Landlordism & Shared Tenancy System became more prevalent as a result of the growing landed estates."
        ],
        [
            "Peasant struggles became evident in San Ricardo, Bantug, Casili and Morcon, because of landlordism and shared tenancy, including unfair farm practices on rations and tenant pays."
        ],
        [
            "Land Tenure became a problem owing to the government’s failure to effect genuine land transfer of land ownership to peasant farmers."
        ],
        [
            "Galvanization and forging of the peasant movement in Talavera, especially in San Ricardo."
        ],
        [
            "1941 – 1945: Talavera sheds blood"
        ],
        [
            "The Imperial Japanese Army occupied Talavera on December 1941."
        ],
        [
            "San Ricardo experienced the horrors of the war through regular “zona”."
        ],
        [
            "Land disputes became more pronounced alongside waves of resistance against the Imperial Japanese Army."
        ],
        [
            "Squadron 8 of the Hukbalahap was formed in Talavera, with more than 100 members."
        ],
        [
            "Talavera became a strategic line of defense, especially San Pascual and Pinagpanaan, against the retreating Imperial Japanese Army."
        ],
        [
            "Barangay Sibul became a rendezvous point for 510 rescued prisoners of war at Camp Pangatian."
        ],
        [
            "1946 – 1972: Recovery & Rehabilitation"
        ],
        [
            "Talavera experienced the expansion of the HUK forces in Nueva Ecija, where Nueva Ecija became part of what is known as HUKLANDIA."
        ],
        [
            "Armed rebellion among the peasants of Talavera continued, owing to unfair land practices."
        ],
        [
            "Some barrios of Talavera namely General Luna, Morcon, Mabini, Ricarte, Casili and Picon, along with Plaridel and Bosque, were annexed to Llanera in 1955."
        ],
        [
            "Infrastructure projects were implemented covering key impact areas like road development, barangay government centers, greening of the municipal plaza, puericulture centers and schools."
        ],
        [
            "Rise of women revolutionaries in Talavera, with Manuela Sta.",
            "Ana Maclang – the first woman to be elected into the Sangguniang Bayan in 1955."
        ],
        [
            "Massive campaigns for peace and order in the latter part of the 1970s were carried out in Talavera."
        ],
        [
            "1972 – 1986: The Narrow Road to Freedom"
        ],
        [
            "The whole country was placed under martial rule “including all agencies of government and its various instrumentalities”."
        ],
        [
            "Institutionalized curfew hours were imposed in Talavera."
        ],
        [
            "Establishment of Barangay Assemblies in the whole of Talavera."
        ],
        [
            "Creation of the Integrated Civilian Home Defense Forces."
        ],
        [
            "Promotion of health and education services through various infrastructure support to health and education programs."
        ],
        [
            "Construction of the Talavera Extension Hospital during the term of Mayor Marcelo D. Diaz."
        ],
        [
            "Conversion of various barangay High Schools into National High Schools."
        ],
        [
            "Maintenance of peace and order as well as public safety through the barangay assemblies."
        ],
        [
            "1987 – 2013: Laying the Foundations"
        ],
        [
            "Return to democracy after years of martial rule through the Interim Local Government ¬– year of greater aspiration and renewal."
        ],
        [
            "Talavera experienced a government re-organization through the provisional constitution."
        ],
        [
            "There was massive promotion of civil liberties through human rights education"
        ],
        [
            "Talavera was re-classified as a First-Class Municipality in 2001 under the leadership of Mayor Manolito V. Fausto."
        ],
        [
            "Expansion of Social Programs (HS in Sibul and Tabacao, Barrio Markets in San Pascual, San Ricardo, Tabacao, Socialized Housing Projects and other rehabilitation efforts, including fiscal deepening)."
        ],
        [
            "Talavera bore witness to an age of reform through various projects in key decision areas like health, education, social welfare and infrastructure services."
        ],
        [
            "Establishment of the flagship college of the Municipality – the NEUST-MGT, whose acknowledged founding father was Mayor Nerito L. Santos, Sr."
        ],
        [
            "Renovations and constructions of the Public Library, SPED Building, Botika ng Bayan, Health Centers and Greening Program."
        ],
        [
            "2013 – present: The Way Forward"
        ],
        [
            "Beginning of a paradigm shift in Talavera’s political consciousness, after a century of male dominated leadership."
        ],
        [
            "Elected the first woman mayor of Talavera in the person of Mayor Nerivi S. Martinez."
        ],
        [
            "Continuing reforms and innovations in major decision areas in health, education, social welfare, environment and infrastructure."
        ],
        [
            "Establishment of various critical facilities like Talavera Dialysis Center, Balay Silangan Reformation Center, Food Bank and Bakery ng Bayan."
        ],
        [
            "Key innovations in health programs through Nutri-Wheel and Gulayan sa Barangay."
        ],
        [
            "Integration of modernized agriculture and urban growth and development into the local institutional framework through farmers’ forum, convened under the leadership of Mayor Nerito S. Santos, Jr."
        ],
        [
            "Enhanced and wider accessibility in well-being domains through expanded social protection programs."
        ],
        [
            "Integration of disaster risk reduction and climate change adaptation into the local institutional framework through urban resilience and development."
        ],
        [
            "Serious fiscal deepening."
        ],
        [
            "Partnership with the University of the Philippines-Diliman, through the College of Architecture for the conceptualization and design of its proposed Civic Center."
        ],
        [
            "Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "House Bill No.",
            "194 was filed on July 1, 2019, by Nueva Ecija's 1st district Representative Estrellita Suansing for the conversion of the municipality of Talavera into a component city."
        ],
        [
            "On June 30, 2022, House Bill No.",
            "215 was filed by Rep. Mikaela Angela B. Suansing which seeks to convert Talavera into a component city."
        ],
        [
            "Geography"
        ],
        [
            "Talavera is relatively flat, with a slope ranging from 0 to 3%.",
            "Its elevation, which ranges from 31m to 61m above sea level, with an average elevation of 42m, is importantly suitable for agricultural, commercial and industrial developments.",
            "Its aggregate arable land amounts to 12, 6981 ha or 89.075% of its total land area, of which less than 70% is irrigated or cultivated.",
            "Its land form consists generally of a broad expanse of low-lying level plains, with flattened terrains covered usually with greens or grasslands.",
            "The land profile is completely leveled, with relatively smooth-rolling surface and with little or no change at all in elevation."
        ],
        [
            "It is bordered by Cabanatuan, Llanera, Muñoz, Aliaga, General Mamerto Natividad, Santo Domingo and San Jose."
        ],
        [
            "Talavera is 14 kilometres (8.7 mi) from Cabanatuan, 28 kilometres (17 mi) from Palayan, and 130 kilometres (81 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Talavera is politically subdivided into 53 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Barangays in italicized are truly exclaved within Muñoz."
        ],
        [
            "Andal Aliño"
        ],
        [
            "Bagong Sikat"
        ],
        [
            "Bagong Silang"
        ],
        [
            "Bacal I"
        ],
        [
            "Bacal II"
        ],
        [
            "Bacal III"
        ],
        [
            "Baluga"
        ],
        [
            "Bantug"
        ],
        [
            "Bantug Hacienda"
        ],
        [
            "Basang Hamog"
        ],
        [
            "Bugtong na Buli"
        ],
        [
            "Bulac"
        ],
        [
            "Burnay"
        ],
        [
            "Calipahan"
        ],
        [
            "Campos"
        ],
        [
            "Casulucan Este"
        ],
        [
            "Collado"
        ],
        [
            "Dimasalang Norte"
        ],
        [
            "Dimasalang Sur"
        ],
        [
            "Dinarayat"
        ],
        [
            "Esguerra District"
        ],
        [
            "Gulod"
        ],
        [
            "Homestead I"
        ],
        [
            "Homestead II"
        ],
        [
            "Cabubulaunan"
        ],
        [
            "Caaniplahan"
        ],
        [
            "Caputican"
        ],
        [
            "Kinalanguyan"
        ],
        [
            "La Torre"
        ],
        [
            "Lomboy"
        ],
        [
            "Mabuhay"
        ],
        [
            "Maestrang Kikay (Poblacion)"
        ],
        [
            "Mamandil"
        ],
        [
            "Marcos District (Poblacion)"
        ],
        [
            "Matias District (Poblacion)"
        ],
        [
            "Matingkis"
        ],
        [
            "Minabuyoc"
        ],
        [
            "Pag-asa District (Poblacion)"
        ],
        [
            "Paludpod"
        ],
        [
            "Pantoc Bulac"
        ],
        [
            "Pinagpanaan"
        ],
        [
            "Poblacion Sur (Poblacion)"
        ],
        [
            "Pula"
        ],
        [
            "Pulong San Miguel"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Miguel na Munti"
        ],
        [
            "San Pascual"
        ],
        [
            "San Ricardo"
        ],
        [
            "Sibul"
        ],
        [
            "Sicsican Matanda"
        ],
        [
            "Tabacao"
        ],
        [
            "Tagaytay"
        ],
        [
            "Valle"
        ],
        [
            "Dispute with Science City of Muñoz"
        ],
        [
            "While Talavera was undergoing significant fiscal deepening from 1996 to 1999, it entered into a seemingly intractable territorial conflict with the newly chartered special city of Muñoz, then, under the leadership of Mayor Efren L. Alvarez, over claims involving the Barangays of Bakal I, Bakal II, Bakal III and Matingkis.",
            "The latter claimed that these barangays were “replete with facts” that they once belonged to the Science City of Muñoz and as such must be annexed as its component barangays.",
            "The latter further characterized that these barangays were like “uncommon arrows”, being part of the territorial boundary of Talavera, piercing the “belly of development” of the Science City of Muñoz."
        ],
        [
            "Owing to this territorial dispute, the Local Government of Talavera was compelled to act to protect its territorial integrity and its sovereignty over these disputed areas."
        ],
        [
            "By February 1999, the LGU of Talavera created the “Task Force Bacal District” to address this highly tenacious concern, elevating it, in fact, to Congress for possible arbitration.",
            "By the end of March 1999, because of the interventions  of some members of both Houses, and through the collective efforts of the residents of Talavera and its officials, under the leadership of then Mayor Manolito V. Fausto, the “annexation claims” were nullified vindicating, as a result, Talavera’s territorial jurisdiction and integrity.",
            "In a significant way, it was a triumphant moment for Talavera.",
            "At the same time, it was a meritorious and legitimate exercise of its sovereign powers to protect its territorial integrity as a local government unit against then rising Science City of Muñoz."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Talavera, Nueva Ecija"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "31(87)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "4(0.2)"
        ],
        [
            "6(0.2)"
        ],
        [
            "7(0.3)"
        ],
        [
            "12(0.5)"
        ],
        [
            "61(2.4)"
        ],
        [
            "89(3.5)"
        ],
        [
            "96(3.8)"
        ],
        [
            "99(3.9)"
        ],
        [
            "81(3.2)"
        ],
        [
            "88(3.5)"
        ],
        [
            "37(1.5)"
        ],
        [
            "13(0.5)"
        ],
        [
            "593(23.5)"
        ],
        [
            "Average rainy days"
        ],
        [
            "2.5"
        ],
        [
            "3.0"
        ],
        [
            "4.1"
        ],
        [
            "6.3"
        ],
        [
            "15.8"
        ],
        [
            "19.4"
        ],
        [
            "22.5"
        ],
        [
            "21.6"
        ],
        [
            "20.1"
        ],
        [
            "17.5"
        ],
        [
            "9.6"
        ],
        [
            "4.0"
        ],
        [
            "146.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TalaveraYearPop.±% p.a.1903 3,352—    1918 8,658+6.53%1939 20,442+4.18%1948 24,353+1.96%1960 28,603+1.35%1970 44,512+4.52%1975 53,011+3.57%1980 62,225+3.26%YearPop.±% p.a.1990 77,256+2.19%1995 85,797+1.98%2000 97,329+2.74%2007 105,122+1.07%2010 112,515+2.50%2015 124,829+2.00%2020 132,338+1.16%Source: Philippine Statistics Authority"
        ],
        [
            "Religion"
        ],
        [
            " St. Isidore the Worker Parish"
        ],
        [
            "8 out 10 individuals in Talavera are catholic.",
            "Roman Catholicism remains one of the most dominant religious affiliations in Talavera, embracing an outstanding 85.59% of its total household population.",
            "The religious group Iglesia Ni Cristo comes in second, with a little less than 6 percent of its total household population.",
            "Other religious affiliations, roughly around seventy-nine (79) accounted for 8.44% of the total population, with IEMELIEF, as its leading religious affiliation, at 1.12%."
        ],
        [
            "Interestingly, although Talavera is home to a number of religious organizations, 0.2% of its households possess no religion or consider themselves atheists."
        ],
        [
            "Cultural Community and Language"
        ],
        [
            "Cultural Community and Language (CBMS,2022)"
        ],
        [
            "Cultural Community"
        ],
        [
            "Population"
        ],
        [
            "Tagalog"
        ],
        [
            "119,669"
        ],
        [
            "Ilocano"
        ],
        [
            "2,830"
        ],
        [
            "Bisaya/Binisaya"
        ],
        [
            "785"
        ],
        [
            "Bikol/Bicol"
        ],
        [
            "206"
        ],
        [
            "Kapampangan"
        ],
        [
            "189"
        ],
        [
            "Maranao"
        ],
        [
            "143"
        ],
        [
            "Waray"
        ],
        [
            "100"
        ],
        [
            "Pangasinan/Panggalatok"
        ],
        [
            "94"
        ],
        [
            "Hiligaynon,Ilonggo"
        ],
        [
            "84"
        ],
        [
            "Cebuano"
        ],
        [
            "57"
        ],
        [
            "Others"
        ],
        [
            "118"
        ],
        [
            "9 out of 10 individuals in Talavera were Tagalog.",
            "A significantly huge majority of Talavera’s households identified themselves as belonging to the Tagalog Cultural Community, accounted at 96.29% of its total population.",
            "Other cultural communities and language in Talavera included Ilocano(2.28%), Bisaya (0.63%) and many others."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Talavera"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  21.20"
        ],
        [
            "2009  18.30"
        ],
        [
            "2012  17.42"
        ],
        [
            "2015  13.02"
        ],
        [
            "2018  4.42"
        ],
        [
            "2021  10.11"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Market Road and stores"
        ],
        [
            "Talavera is one of the fastest growing municipalities in the province and proposals have been planned for cityhood.",
            "Given its robust economic growth, Talavera enjoys annual progress and wealth.",
            "The town's revenue-generated income as of 2017 is ₱298,361,401.93 and with over 124,829 inhabitants, the town meets the requirements for cityhood.",
            "Both bills are currently pending."
        ],
        [
            "According to the National Competitiveness Council in Cities/Municipalities Competitiveness Index, during the past years, Talavera maintained their rankings as one of the most competitive municipalities in the Philippines."
        ],
        [
            "THE LOCAL ECONOMY"
        ],
        [
            "Talavera’s local economic activities are highly associated with the secondary sector.",
            "In other words, its primary economic base is dominated by personnel services.",
            "Its primary and tertiary economic sectors, although importantly thriving, still require further boost in investment.",
            "Economic productions in these areas, though, are more than sufficient to fuel Talavera’s local economic growth.",
            "In fact, its contributions to Talavera’s gross domestic products keep Talavera afloat.",
            "Similarly, the mobility of its combined labor force constitutes a solid employment structure for Talavera, despite some rare cases of unemployment."
        ],
        [
            "The Primary Sector:"
        ],
        [
            "Agricultural Crops and Croplands"
        ],
        [
            "For Talavera, agriculture is generally viewed as an engine of development.",
            "Some studies for example report that it is an “important material base for all economies” as it produces “indispensable necessities of human life and important industrial material”."
        ],
        [
            "Talavera's inbred rice production from 2015 to 2021 preserves an average rice production of 42,048.14 metric tons in wet seasons, while it averages 26,580.37 metric tons in dry seasons.",
            "Its lowest production has been estimated at 31,894.40 metric tons in 2015 and it  highest production has been posted in 2020, with an annual production of 54,292.99 metric tons.",
            "On the whole, inbred rice production shows moderately increasing trend."
        ],
        [
            "Hybrid rice production, meanwhile, has been observed to gain currency among farmers in Talavera.",
            "In Fact, from 2015 to 2022, its average production has been estimated at 46,617.79 metric tons during the dry season.",
            "Its  low productions average though has been observed in the wet seasons, estimated at 4,037.63 metric tons per harvest from 2015 - 2022.",
            "Nevertheless, in both wet and dry seasons, hybrid rice production post significantly increasing trends."
        ],
        [
            "Vegetable Crop Production"
        ],
        [
            "Vegetable production in Talavera is relatively abundant.",
            "It produces a variety of vegetables yearly.",
            "Common productions include vegetable crops like tomatoes, loofah, gourd and okra."
        ],
        [
            "Other produced vegetable crops are squash, eggplant, cucumber, onion and corn.",
            "In 2022 for example, there has been an ample production of onion, estimated at 3,919.00 metric tons and some 3,234.76 metric tons of squash."
        ],
        [
            "Some families of legumes are also produced like winged bean, string beans and chilli Taiwan."
        ],
        [
            "Livestock and Poultry Productions"
        ],
        [
            "There are five (5) distinct kinds of livestock raised in holdings or in backyard farms in Talavera.",
            "Included here are carabao, swine or hog, goat, cattle and sheep.",
            "Carabao and goat however are the most dominant heads.",
            "Poultry raising production is also evident in Talavera.",
            "The most dominant heads are chicken and duck."
        ],
        [
            "THE SECONDARY SECTOR"
        ],
        [
            "The Secondary Economic Sector is composed generally of the manufacturing industry, Electricity, Gas and Water Services, and Construction Services.",
            "To date, Talavera has a total of 179 registered firms under the secondary economic sector.",
            "While relatively stable, the sector lacks the pertinent competitive advantage.",
            "For one thing, most of its establishments are light industries.",
            "For another thing, its access to financial assistance or grant-in aids is relatively limited.",
            "Finally, Talavera’s secondary sector is yet to fully develop a highly competitive product that can be comparatively advantageous.",
            "Nonetheless, the sector remains stable."
        ],
        [
            "THE TERTIARY SECTOR"
        ],
        [
            "Talavera’s tertiary sector rose by 20.72% in 2022.",
            "Registered business firms under the tertiary sector in 2022 are accounted at 1,375.",
            "It rose by 20.72%, from 1,139 to 1,375.",
            "More than half of these firms, 58.76%, are wholesale and retail industries."
        ],
        [
            "Tourism"
        ],
        [
            "Unlike other municipalities in the country, Talavera is not generally endowed with naturally picturesque spots to support its local tourism development, except its low-lying and completely levelled agricultural spaces that are essentially covered with greens.",
            "Nonetheless, Talavera has a number of importantly recognized cultural landmarks.",
            "They are as follows:"
        ],
        [
            "Diocesan Shrine of St. Isidore the Worker"
        ],
        [
            "Sicsican Bridge (declared as a cultural property in 2020)"
        ],
        [
            "Gabaldon Building (Recognized as a built heritage in February, 2019)"
        ],
        [
            "Rizal Monument (Built between 1922 and 1930)"
        ],
        [
            "Tal-Acacia Tree (Declared as a Cultural Property in 2020)"
        ],
        [
            "Festival"
        ],
        [
            "Talavera, similarly, has a good number of culturally significant religious and social Festivities, aside from the aforementioned cultural properties.",
            "Included here are as follows:"
        ],
        [
            "Linggo ng Magsasaka"
        ],
        [
            "The Linggo ng Magsasaka is a week-long celebration held in honor of Talaverano Farmers.",
            "It culminates on the 15th day of May - the Town Fiesta.",
            "Highlights of the celebration generally include Cultural Dance Competition, Harana, Gandang Kalabaw, Float Parade, Street Dance and Kesong Puti Festival."
        ],
        [
            "Gatas ng Kalabaw"
        ],
        [
            "Gatas ng Kalabaw Festival is celebrated annually from May 12 to 15.",
            "It culminates in the celebration of the Town Fiesta, whose patron saint is Saint Isidore the Worker.",
            "The festival aims to actively encourage, promote and enhance carabao's milk as a nutrition and livelihood industry.",
            "Highlights of the festival are street dancing, followed by float parade, parade of carabaos, carabao race, agri-trade fair, milk drinking contest and ice cream making competition among others."
        ],
        [
            "Semana Santa"
        ],
        [
            "During Holy Week, the members of the church (San Isidro Labrador Parish Church) commemorate Jesus' Paschal mystery.",
            "The church even has a community where each member owns a religious image called the Cofradia de la Sagrada Pasion del Nuestro Señor.",
            "Every Holy Wednesdays and Good Fridays, the members of the Cofradia place the images of their saints in carozzas or karo and exhibits it for the townspeople to witness thru a procession."
        ],
        [
            "Transportation"
        ],
        [
            "There are 24.77 kilometres (15.39 mi) of national roads, including the 16.93-kilometer (10.52 mi) section of Maharlika Highway (Asian Highway 26) that passes through the municipality.",
            "Due to its central location, Talavera is one of the pivotal transport points in Central Luzon."
        ],
        [
            "Talavera is accessible by all means of land transportation.",
            "Regular jeepney trips are from 5:00 am to 9:00 pm.",
            "Tricycles are available 24 hours a day.",
            "Several bus companies also use the Talavera route from Cagayan Valley and Aurora to Manila, Cabanatuan, San Jose City, Baguio and other destinations."
        ],
        [
            "Healthcare"
        ],
        [
            "Talavera General Hospital"
        ],
        [
            "Talavera's populace is served by Talavera General Hospital, a national government-funded hospital formerly known as Dr. Paulino J. Garcia Memorial Hospital - Talavera Extension Program.",
            "Medical and dental clinics also serve the municipality."
        ],
        [
            "Education"
        ],
        [
            "Talavera is served by both public and Department of Education-accredited private schools.",
            "The largest elementary school is Talavera Central School, also known as Central, which is situated at the town proper.",
            "The largest secondary educational institution is Talavera National High School, colloquially knows as TNHS."
        ],
        [
            "University and colleges:"
        ],
        [
            "Nueva Ecija University of Science and Technology – Talavera Academic Extension Campus"
        ],
        [
            "REH Montessori College"
        ],
        [
            "St. Elizabeth Global College"
        ],
        [
            "New Horizon Academy"
        ],
        [
            "Gallery"
        ],
        [
            "Ricefields"
        ],
        [
            "Governor Umali covered courts, gymnasium"
        ],
        [
            "Maestrang Kikay Barangay Hall"
        ],
        [
            "Himnasyo ng Bagong Talavera (lit. transl.",
            "Gymnasium of New Talavera)"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Talavera |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Cities and Municipalities urban population\".",
            "City population.",
            "Retrieved 28 October 2018."
        ],
        [
            "^ Joaquin L. Rajal.",
            "Memoria Acerca de La Provincia de Nueva Ecija en Filipinas.",
            "(Madrid: Establicimiento Tipografico de Fortanet, 1890), p. 15"
        ],
        [
            "^ Elviro J Peres.",
            "Catalogo Bibliografico de los Religiosos Agustinos de la Provincia del Santisimo Nombre de Jesus de las Islas Filipinas Desde su Fundacion Hasta Nuestro Dias.",
            "(Manila: Establicimiento Tipografico del Colegio de Sto.",
            "Tomas, 1901, p.818)"
        ],
        [
            "^ Peres 1901, p. 819"
        ],
        [
            "^ Enrique G. Mhartin.",
            "Apuntes Geograficos de las Islas Filipinas.",
            "(Madrid: Imprenta De Ramon Angelo, 1889), p. 42"
        ],
        [
            "^ Rafael Maria de Aguilar.",
            "Papeles Interesantes a los Regulares que en las Islas Filipinas Administran la Cura de Almas.",
            "(Valladolid: En La Imprenta de la Viuda de Roldan, 1838), p. 12"
        ],
        [
            "^ National Archives of the Philippines.",
            "Ereccion de los Pueblos Nueva Ecija 1779-1898.",
            "SDS 14058, Exp.",
            "16, S340–380b."
        ],
        [
            "^ M. Mclennan.",
            "“Land and Tenancy in the Central Luzon Plain”, in Philippine Studies, volume 17, no.",
            "4 (1969), p. 668"
        ],
        [
            "^ Cesar C. Baroman.",
            "Nueva Ecija, 1896-1946.",
            "(Cabanatuan City: Nueva Ecija Historical Culture and Arts Council, IBP Building, Capitol Compound, 1993), p.13"
        ],
        [
            "^ Salvador Font.",
            "Memoria Acerca de las Misiones de los P. P. Agustinos Calzados en las Islas Filipinas.",
            "(Madrid: Imprenta de Don Luis Aguado, 1892), p. 53."
        ],
        [
            "^ (Ereccion de Pueblos, 1837-1897)"
        ],
        [
            "^ Elihu Root.",
            "The Military and Colonial Policy of the United States: Addresses and Reports.",
            "(Cambridge: Harvard University Press, 1916), p. 231"
        ],
        [
            "^ Executive Order No.",
            "39, series of 1909"
        ],
        [
            "^ (Executive Order No.",
            "72, 1912)"
        ],
        [
            "^ Mclennan, Land Tenancy, p. 669"
        ],
        [
            "^ Benedict J. Kerkvliet.",
            "The Huk Rebellion: A Study of Peasant Revolt in the Philippines.",
            "(Lanham, Boulder, New York, Oxford: Rowman and Littlefield Publishers, Inc., 2002), p. 11"
        ],
        [
            "^ Lawrence M. Greenberg.",
            "The Hukbalahap Insurrection: A Case Study of Successful Anti Insurgency Operation in the Philippines, 1946-1955.",
            "(Washington, D. C.: Analysis Branch, U. S. Army Center of Military History, 2005), p. 6."
        ],
        [
            "^ Kerkvliet 2002, p. 31"
        ],
        [
            "^ Kerkvliet 2002, p. 62"
        ],
        [
            "^ Kerkvliet 2002, pp.",
            "62-66"
        ],
        [
            "^ Kerkvliet 2002, p. 70"
        ],
        [
            "^ Bruce Palmer, Jr. Report: 6th Infantry Division, (July 17, 1945), 23-27."
        ],
        [
            "^ Ralph Teatsorth.",
            "“510 Allied Prisoners Rescued in Daring Raid by Rangers on Luzon; All near Death,” Dunkirk Evening Observer, (Thursday, February 1, 1945), p. 1."
        ],
        [
            "^ Edward J. Mitchell.",
            "“Some Econometrics of the Huk Rebellion,” The American Political Science Review, volume 63, number 4 (December 1969), p. 1159"
        ],
        [
            "^ Kerkvliet 2002, p. 209"
        ],
        [
            "^ “Huks Kill Twenty-One in Outbreak on Luzon,” The Corpus Christi Caller-Times, (Saturday, February 10, 1951), p. 12."
        ],
        [
            "^ \"An Act to Create the Municipality of Llanera in the Province of Nueva Ecija\".",
            "LawPH.com.",
            "Retrieved 2011-04-11."
        ],
        [
            "^ Proclamation No.",
            "1081, s. 1972"
        ],
        [
            "^ Batas Pambansa Bilang 396"
        ],
        [
            "^ Batas Pambansa Bilang 631"
        ],
        [
            "^ Republic Act No.",
            "6169"
        ],
        [
            "^ DO 61, series of 1987"
        ],
        [
            "^ a b House Bill No.",
            "194 (July 1, 2019), AN ACT CONVERTING THE MUNICIPALITY OF TALAVERA, PROVINCE OF NUEVA ECIJA INTO A COMPONENT CITY TO BE KNOWN AS THE CITY OF TALAVERA (PDF), retrieved January 13, 2022"
        ],
        [
            "^ a b Republic Act No.",
            "2040 (February 8, 2021), AN ACT CONVERTING THE MUNICIPALITY OF TALAVERA, PROVINCE OF NUEVA ECIJA INTO A COMPONENT CITY TO BE KNOWN AS THE CITY OF TALAVERA, retrieved September 1, 2021"
        ],
        [
            "^ See Mayor Efren L. Alvares, \"Correspondence to Mayor Lito V. Fausto\", June 27, 2001"
        ],
        [
            "^ Mayor Lito V. Fausto, \"Correspondence to Mayor Efren L. Alvares\", September 17, 2001"
        ],
        [
            "^ SB Resolution No.",
            "127-98, series of 1998"
        ],
        [
            "^ Barangay Bakal II Resolution No.",
            "43-98, series of 1998"
        ],
        [
            "^ Barangay Baka III Resolution No.",
            "036-98, series of 1998"
        ],
        [
            "^ Barangay Matingkis Resolution No.",
            "08-98, series of 1998"
        ],
        [
            "^ See SB Resolution No.",
            "40-99, series of 1999"
        ],
        [
            "^ See Mayor Lito V. Fausto's letter to the Senate President Franklin Drillon dated September 17, 2001"
        ],
        [
            "^"
        ],
        [
            "\"Talavera: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 4 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region III (Central Luzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Nueva Ecija\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ CBMS,2022"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Annual Audit Report\".",
            "Commission on Audit.",
            "Retrieved 19 October 2018."
        ],
        [
            "^ World Association for Political Economy.",
            "\"Globalization, Employment and Agriculture: A Statement of the Eleventh Forum for World Association for Political Economy,\" World Review of Political Economy, Volume 7, Number 4 (Winter, 2016)"
        ],
        [
            "^ {{Johnson, D. Gale.",
            "\"Role of agriculture in Economic development revisited.\"",
            "Agricultural Economics, Volume 8 (1993), p. 429"
        ],
        [
            "^ \"The Ultimate travel guide for tourist\".",
            "Department of Tourism.",
            "Retrieved 19 October 2018."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Talavera, Nueva Ecija."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System Archived 2016-03-04 at the Wayback Machine"
        ],
        [
            "Places adjacent to Talavera, Nueva Ecija"
        ],
        [
            "Science City of Muñoz"
        ],
        [
            "San Jose"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Talavera"
        ],
        [
            "LlaneraGen.",
            "Mamerto Natividad"
        ],
        [
            "Aliaga"
        ],
        [
            "Cabanatuan"
        ],
        [
            "vte Province of Nueva EcijaPalayan (capital)  Cabanatuan (largest city)Municipalities"
        ],
        [
            "Aliaga"
        ],
        [
            "Bongabon"
        ],
        [
            "Cabiao"
        ],
        [
            "Carranglan"
        ],
        [
            "Cuyapo"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Guimba"
        ],
        [
            "Jaen"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Llanera"
        ],
        [
            "Lupao"
        ],
        [
            "Nampicuan"
        ],
        [
            "Pantabangan"
        ],
        [
            "Peñaranda"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Leonardo"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Zaragoza"
        ],
        [
            "Component cities"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Jose"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Talavera,_Nueva_Ecija&oldid=1232560153\""
        ],
        [
            "Category: Municipalities of Nueva EcijaHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from October 2012All articles needing additional referencesCoordinates on WikidataArticles containing Tagalog-language textArticles containing Ilocano-language textWikipedia articles with style issues from June 2024All articles with style issuesCommons category link from WikidataWebarchive template wayback linksPages using the Kartographer extension"
        ]
    ]
}