{
    "name": "Talibon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Talibon"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°07′N 124°17′E﻿ / ﻿10.12°N 124.28°E﻿ / 10.12; 124.28"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bohol, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Talibon\" – news · newspapers · books · scholar · JSTOR (September 2021) (Learn how and when to remove this message)"
        ],
        [
            "Not to be confused with Taliban."
        ],
        [
            "Municipality in Central Visayas, PhilippinesTalibonMunicipalityMunicipality of TalibonTalibon skyline"
        ],
        [
            "FlagSealMap of Bohol with Talibon highlightedOpenStreetMapTalibonLocation within the PhilippinesCoordinates: 10°07′N 124°17′E﻿ / ﻿10.12°N 124.28°E﻿ / 10.12; 124.28CountryPhilippinesRegionCentral VisayasProvinceBoholDistrict"
        ],
        [
            "2nd districtFounded1830Barangays25"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJanette A. Garcia • Vice MayorDave A. Evangelista • RepresentativeErico Aristotle C. Aumentado • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Expedito F. AbuanJocelyn A. AmbaJerald P. TaneoApolinario A. ArtiagaNomie T. ValmoriaPlacidito O. DoroyEdwin P. CresencioRaul C. Austria"
        ],
        [
            " • Electorate42,762 voters (2022)Area • Revenue₱ 258 million (2020) • Assets₱ 613.8 million (2020) • Expenditure₱ 283 million (2020) • Liabilities₱ 96.58 million (2020)Service provider • ElectricityBohol 2 Electric Cooperative (BOHECO 2)Time zoneUTC+8 (PST)ZIP code6325PSGC071243000IDD : area code +63 (0)38Native languagesBoholano dialect Cebuano TagalogWebsitewww.talibon-bohol.gov.ph"
        ],
        [
            "Talibon, officially the Municipality of Talibon (Cebuano: Lungsod sa Talibon; Tagalog: Bayan ng Talibon), is a 1st class municipality in the province of Bohol, Philippines.",
            "According to the 2020 census, it has a population of 71,272 people, making it the second-most populous town in Bohol, behind Ubay.",
            "It is located 115 kilometres (71 mi) from Tagbilaran."
        ],
        [
            "Talibon is the seat of the diocese of Talibon."
        ],
        [
            "Etymology"
        ],
        [
            "The name Talibon is said to come from the word talibong which means bolo or spear, an instrument used in gold mining.",
            "There is no actual record to show how the name came about but as per the records of the travels of Jesuit missionary Fr.",
            "Juan de Torres, S.J., he went to the gold mines of Talibong.",
            "It already had its name before the first arrival of the first Spanish missionary."
        ],
        [
            "History"
        ],
        [
            "According to archival researches of Fr.",
            "Josemaria Luengo, priest, historian, and founder of Mater Dei College in Tubigon, Talibon traces its history back to the time of Ferdinand Magellan after his death on 27 April 1521.",
            "Escaping from the hands of Lapu-Lapu's men, who were bent on revenge for the raping of 50 virgins of Cebu, the ship Trinidad sailed in the direction of Getafe and Talibon, where some of the crew disembarked and mingled with the natives of the place."
        ],
        [
            "Taking native wives and teaching them the rudiments of Christianity, they dedicated the place where they lived to the Most Holy Trinity (Santisima Trinidad) in honor of the patrons of their fateful ship.",
            "The survivors became the first lay missionaries to Bohol and Fr.",
            "Luengo called them the Trinidad Christians of Talibon."
        ],
        [
            "In 1830, Talibon was established as an independent municipality from Inabanga.",
            "The following year, Talibon became a parish dedicated to the Most Holy Trinity, with Fr.",
            "Ramon de Santa Ana as the first parish priest."
        ],
        [
            "At first, a ramshackle hut built by the natives served as the church but in 1852 construction of the permanent church was started.",
            "With forced labor and the use of blocks of coral rocks, the church was built on an elevated plain overlooking the sea and finished in 1899."
        ],
        [
            "In June 1942, the locals woke up one morning to see truckloads of heavily armed troops of the Imperial Japanese Army's 175th Infantry Battalion in Poblacion.",
            "It was the first entry of the Japanese troops in the comparatively peaceful town.",
            "Before properly settling down, the Talibon Central Elementary School became the headquarters of the Japanese soldiers.",
            "After a few days, the invaders ransacked the cabinets in the municipal building for important records.",
            "They went from house to house, rounded up the civilians and ordered them to stay at the municipal hall.",
            "Through an interpreter, a Japanese intelligence officer named 1st Lt. Mitsuo Kimura inquired for the municipal officials and after learning they had fled, he ordered the people to organize a civil government by electing the necessary officials.",
            "The Japanese threatened to burn all the houses and buildings in Poblacion if the people failed to organize the government.",
            "To save the town from the possibility of being reduced to ashes, the people organized a civil government and appointed the young lawyer, Atty.",
            "Maximino C. Boiser as municipal mayor."
        ],
        [
            "During the time of World War II, a guerrilla force against the Japanese 175th Infantry Battalion was secretly organized and then took control and authority over the town of Talibon.",
            "Former Senator Carlos P. Garcia acted as high adviser of the group.",
            "While Talibon was under Japanese occupation, he narrowly escaped capture by fleeing with his family to Leyte.",
            "In reprisal, the Japanese soldiers in Talibon, through the leadership of battalion commander Maj. Ichiro Tokogawa, burned down the Garcia house on 4 July 1942 and tortured volunteer guard Cesario Avergonzado for allegedly misleading them.",
            "Later on in 1943, Atty.",
            "Maximino C. Boiser, the municipal mayor of Talibon at that time, was executed by the guerillas for conspiring with the Japanese forces according to local witnesses."
        ],
        [
            "In 1947, by virtue of Executive Order No.",
            "80 signed by President Manuel Roxas, fifteen barrios from Talibon, along with three from Ubay, were segregated and organized into a separate municipality of Trinidad.",
            "Ipil, one of its former barrios, was designated as the new municipality's seat of government."
        ],
        [
            "In 1957, when Carlos P. Garcia became the eighth president of the Philippines, the church was renovated.",
            "According to the members of the prominent Boiser family of Talibon, the president would regularly visit Mr. Justo C. Boiser's house in Poblacion just to have lunch with him and his family as both sides were politically related.",
            "In honor of the Boisers in Talibon, a street was named after the family, which is located still in Poblacion."
        ],
        [
            "In 1986, the Diocese of Talibon was created."
        ],
        [
            "Geography"
        ],
        [
            "The town of Talibon is located on the northern side of Bohol.",
            "It is bounded on the east by Bien Unido, on the south by Trinidad on the north by Camotes Sea and on the west by Getafe.",
            "Talibon has a land area of 140.46 square kilometres (54.23 sq mi) of which about 7.97 square kilometres (3.08 sq mi) or 5.7% is classified as urban, while the remaining 132.49 square kilometres (51.15 sq mi) is rural."
        ],
        [
            "Accessibility to Talibon from the capital, Tagbilaran, is facilitated by the western or eastern exits of the Bohol Circumferential Road, located 115 and 150 kilometres (71 and 93 mi) away, respectively.",
            "Alternatively, travelers can reach Talibon through the interior road via Loboc, which is 109 kilometres (68 mi) distant.",
            "It can also be accessed by ferry directly from Cebu City or via Tubigon, followed by a journey by road."
        ],
        [
            "Barangays"
        ],
        [
            "Map of Talibon showing barangays and islands"
        ],
        [
            "Talibon is politically subdivided into 25 barangays.",
            "Each barangay consists of puroks, and some have sitios."
        ],
        [
            "There are 17 barangays located on the mainland and 8 island barangays, among which Nocnocan, Calituban, and Guindacpan are among the most densely populated islands in the world."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 071243001   Bagacay"
        ],
        [
            " 5.0%"
        ],
        [
            " 3,561"
        ],
        [
            " 2,911"
        ],
        [
            "  ▴"
        ],
        [
            " 2.04%"
        ],
        [
            " 071243002   Balintawak"
        ],
        [
            " 2.2%"
        ],
        [
            " 1,586"
        ],
        [
            " 1,517"
        ],
        [
            "  ▴"
        ],
        [
            " 0.45%"
        ],
        [
            " 071243006   Burgos"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,022"
        ],
        [
            " 1,020"
        ],
        [
            "  ▴"
        ],
        [
            " 0.02%"
        ],
        [
            " 071243007   Busalian"
        ],
        [
            " 3.0%"
        ],
        [
            " 2,135"
        ],
        [
            " 2,031"
        ],
        [
            "  ▴"
        ],
        [
            " 0.50%"
        ],
        [
            " 071243008   Calituban"
        ],
        [
            " 5.8%"
        ],
        [
            " 4,145"
        ],
        [
            " 4,064"
        ],
        [
            "  ▴"
        ],
        [
            " 0.20%"
        ],
        [
            " 071243009   Cataban"
        ],
        [
            " 1.9%"
        ],
        [
            " 1,348"
        ],
        [
            " 1,262"
        ],
        [
            "  ▴"
        ],
        [
            " 0.66%"
        ],
        [
            " 071243010   Guindacpan"
        ],
        [
            " 3.1%"
        ],
        [
            " 2,216"
        ],
        [
            " 2,202"
        ],
        [
            "  ▴"
        ],
        [
            " 0.06%"
        ],
        [
            " 071243013   Magsaysay"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,446"
        ],
        [
            " 1,347"
        ],
        [
            "  ▴"
        ],
        [
            " 0.71%"
        ],
        [
            " 071243014   Mahanay"
        ],
        [
            " 2.5%"
        ],
        [
            " 1,806"
        ],
        [
            " 1,659"
        ],
        [
            "  ▴"
        ],
        [
            " 0.85%"
        ],
        [
            " 071243017   Nocnocan"
        ],
        [
            " 2.7%"
        ],
        [
            " 1,913"
        ],
        [
            " 1,832"
        ],
        [
            "  ▴"
        ],
        [
            " 0.43%"
        ],
        [
            " 071243021   Poblacion"
        ],
        [
            " 6.1%"
        ],
        [
            " 4,333"
        ],
        [
            " 4,112"
        ],
        [
            "  ▴"
        ],
        [
            " 0.52%"
        ],
        [
            " 071243023   Rizal"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,452"
        ],
        [
            " 1,472"
        ],
        [
            "  ▾"
        ],
        [
            " −0.14%"
        ],
        [
            " 071243024   Sag"
        ],
        [
            " 1.3%"
        ],
        [
            " 908"
        ],
        [
            " 996"
        ],
        [
            "  ▾"
        ],
        [
            " −0.92%"
        ],
        [
            " 071243026   San Agustin"
        ],
        [
            " 6.7%"
        ],
        [
            " 4,747"
        ],
        [
            " 3,867"
        ],
        [
            "  ▴"
        ],
        [
            " 2.07%"
        ],
        [
            " 071243027   San Carlos"
        ],
        [
            " 2.3%"
        ],
        [
            " 1,607"
        ],
        [
            " 1,441"
        ],
        [
            "  ▴"
        ],
        [
            " 1.10%"
        ],
        [
            " 071243028   San Francisco"
        ],
        [
            " 8.5%"
        ],
        [
            " 6,062"
        ],
        [
            " 5,510"
        ],
        [
            "  ▴"
        ],
        [
            " 0.96%"
        ],
        [
            " 071243029   San Isidro"
        ],
        [
            " 6.1%"
        ],
        [
            " 4,371"
        ],
        [
            " 3,598"
        ],
        [
            "  ▴"
        ],
        [
            " 1.96%"
        ],
        [
            " 071243030   San Jose"
        ],
        [
            " 8.6%"
        ],
        [
            " 6,151"
        ],
        [
            " 5,789"
        ],
        [
            "  ▴"
        ],
        [
            " 0.61%"
        ],
        [
            " 071243031   San Pedro"
        ],
        [
            " 2.3%"
        ],
        [
            " 1,670"
        ],
        [
            " 1,500"
        ],
        [
            "  ▴"
        ],
        [
            " 1.08%"
        ],
        [
            " 071243032   San Roque"
        ],
        [
            " 4.1%"
        ],
        [
            " 2,891"
        ],
        [
            " 2,590"
        ],
        [
            "  ▴"
        ],
        [
            " 1.11%"
        ],
        [
            " 071243033   Santo Niño"
        ],
        [
            " 5.7%"
        ],
        [
            " 4,060"
        ],
        [
            " 3,804"
        ],
        [
            "  ▴"
        ],
        [
            " 0.65%"
        ],
        [
            " 071243034   Sikatuna"
        ],
        [
            " 2.4%"
        ],
        [
            " 1,731"
        ],
        [
            " 1,703"
        ],
        [
            "  ▴"
        ],
        [
            " 0.16%"
        ],
        [
            " 071243035   Suba"
        ],
        [
            " 2.7%"
        ],
        [
            " 1,957"
        ],
        [
            " 1,683"
        ],
        [
            "  ▴"
        ],
        [
            " 1.52%"
        ],
        [
            " 071243036   Tanghaligue"
        ],
        [
            " 3.0%"
        ],
        [
            " 2,170"
        ],
        [
            " 2,062"
        ],
        [
            "  ▴"
        ],
        [
            " 0.51%"
        ],
        [
            " 071243038   Zamora"
        ],
        [
            " 2.4%"
        ],
        [
            " 1,681"
        ],
        [
            " 1,401"
        ],
        [
            "  ▴"
        ],
        [
            " 1.84%"
        ],
        [
            "Total"
        ],
        [
            "71,272"
        ],
        [
            "61,373"
        ],
        [
            " ▴"
        ],
        [
            "1.51%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Talibon, Bohol"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "98(3.9)"
        ],
        [
            "82(3.2)"
        ],
        [
            "96(3.8)"
        ],
        [
            "71(2.8)"
        ],
        [
            "104(4.1)"
        ],
        [
            "129(5.1)"
        ],
        [
            "101(4.0)"
        ],
        [
            "94(3.7)"
        ],
        [
            "99(3.9)"
        ],
        [
            "135(5.3)"
        ],
        [
            "174(6.9)"
        ],
        [
            "143(5.6)"
        ],
        [
            "1,326(52.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.0"
        ],
        [
            "14.1"
        ],
        [
            "17.1"
        ],
        [
            "16.8"
        ],
        [
            "23.7"
        ],
        [
            "25.7"
        ],
        [
            "25.8"
        ],
        [
            "23.3"
        ],
        [
            "24.2"
        ],
        [
            "25.9"
        ],
        [
            "24.0"
        ],
        [
            "20.6"
        ],
        [
            "259.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Municipal Hall of Talibon"
        ],
        [
            "Population census of TalibonYearPop.±% p.a.1903 6,085—    1918 12,227+4.76%1939 26,077+3.67%1948 23,455−1.17%1960 30,640+2.25%1970 35,223+1.40%1975 41,270+3.23%1980 46,110+2.24%1990 41,873−0.96%1995 44,854+1.30%2000 54,147+4.12%2007 59,274+1.26%2010 61,373+1.27%2015 66,969+1.68%2020 71,272+1.23%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Talibon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  43.90"
        ],
        [
            "2009  51.41"
        ],
        [
            "2012  36.35"
        ],
        [
            "2015  34.62"
        ],
        [
            "2018  26.50"
        ],
        [
            "2021  29.49"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Major industries in Talibon are farming and fishing with major products such as rice, corn, copra, banana, root crops, and seafood.",
            "It is quickly becoming a hub for retailers, wholesalers, and traders.",
            "The municipality is home to one of the branches of Cebu-based Alturas Group of Companies, which has established a mall and supermarket in the area."
        ],
        [
            "The locals are also into seaweed farming, rice farming, watermelon farming, and making of fish traps, hats, and pottery.",
            "Silica, limestone, diorites, sand, iron ore, and gravel abound and quarrying of these minerals are a large industry at present.",
            "These minerals are shipped to Cebu and Iligan aboard bulk carriers and barges as these locations are known for cement production and mineral processing."
        ],
        [
            "Tourism"
        ],
        [
            "Talibon for years has its share of foreign and domestic tourists who were lured to the town for its unexploited beaches, fresh seafood such as crabs and prawns, friendliness of the people and the general atmosphere of peace and order in the town and the neighboring barrios."
        ],
        [
            "Visitors also flock to the town to explore its historical sites, such as the Talibon Cathedral and the Carlos P. Garcia Monument and Park.",
            "The latter holds significance as the birthplace of Carlos P. Garcia, a prominent figure in the town's history, who played a pivotal role in the guerrilla movement and later served as the 4th President of the Philippines."
        ],
        [
            "Ecotourism"
        ],
        [
            "Among Talibon's natural attractions is Danajon Bank, the Philippines' only double barrier reef and one of the few documented double barrier reefs in the world.",
            "A very rare geological formation, it comprises two sets of large coral reefs that formed offshore on a submarine ridge due to a combination of favorable tidal currents and coral growth in the area.",
            "Talibon shares responsibility over Danajon together with 9 other Bohol towns that have jurisdiction over the reef.",
            "It is home to a vast array of commercially valuable reef fishes, shellfish, crustaceans and invertebrates such as sea cucumbers and sea urchins.",
            "Its extensive seagrass beds are nursery and feeding grounds for various species of rabbitfish (siganids) and sea horses, while its mangroves are spawning habitats for crustaceans, shrimps and various fishes."
        ],
        [
            "In order to showcase and promote efforts to protect and manage Danajon Bank, the municipal government of Talibon opened the CRM Interpretive Center, otherwise known as the Fisheries and Coastal Resource Management Interpretive Center (FCRMIC).",
            "The Center boasts a 3D model of Danajon Bank, the first of its kind in Bohol and even in the whole of the Visayas.",
            "It is now becoming a drop-in site for school and foreign tours alike."
        ],
        [
            "Other natural attractions include pristine islands like the Bongan sandbar, known for its expansive white sandy beach and clear waters, making it an ideal spot for swimming, snorkeling, and scuba diving.",
            "Additionally, the Ipil River offers opportunities for boating, kayaking, fishing, swimming, and shell gathering due to the abundant mollusks in the area.",
            "Inland from the river, visitors can observe wildlife such as wild ducks, herons, and egrets.",
            "In San Isidro, a mangrove area has become a habitat for monkeys.",
            "Another notable feature is the presence of centuries-old piyapi trees, which are abundant in the area."
        ],
        [
            "Education"
        ],
        [
            "Almost every barangay in Talibon's vicinity has its public elementary school, making students, teachers, and parents alike have a sufficient array of choices.",
            "The same goes for secondary schools as it has an abundant selection to private and public education."
        ],
        [
            "Diocese of Talibon"
        ],
        [
            "Blessed Trinity Cathedral, Talibon"
        ],
        [
            "The diocese of Talibon comprises half of the civil province of Bohol."
        ],
        [
            "The territory, covered by the diocese of Talibon, extends from the town of Inabanga on the northwest, through Carmen in the interior, and down to Jagna on the southeast.",
            "Its inland boundary bisects the island northwest—southeast, with the other half of the island under the jurisdiction of the diocese of Tagbilaran."
        ],
        [
            "The first batch of missionaries to arrive were the Augustinian Recollects who came in 1565.",
            "When the Jesuits arrived in 1596 and reached the area of Talibon, they were surprised to discover that a Christian community already existed in the area, owing to the Spanish–Talibongnon intermarriages dating back to the 1520s."
        ],
        [
            "After the Jesuits came, the faith spread fast revolts in the country against Spain.",
            "Tamblot revolted in 1622.",
            "Although his success lasted only for six months, his revolt is recorded as the first unbeaten revolt in Philippine history.",
            "In 1744, Dagohoy revolted and gained independence for the island of Bohol for eighty years."
        ],
        [
            "On 8 November 1941, the Diocese of Tagbilaran was established and was given jurisdiction over the entire province of Bohol, separating it from Cebu, its mother diocese.",
            "On 9 January 1986, the new Diocese of Talibon was created, separating half of Bohol from the Diocese of Tagbilaran.",
            "Most Rev.",
            "Christian Vicente Fernandez Noel, D.D., was appointed as its first bishop in September 1986 and whose office he held until Pope Francis appointed Most Rev.",
            "Patrick Daniel Y. Parcon, D.D.",
            "on 6 June 2014 as its second bishop, and was eventually installed on 22 August 2014."
        ],
        [
            "To this day, there are 25 parishes in the diocese, ministered by 50 priests.",
            "There are also 35 religious sisters active in the running of 16 secondary Catholic schools."
        ],
        [
            "Notable people"
        ],
        [
            "Bernardito Auza, Archbishop, Apostolic Nuncio of Vatican to Spain"
        ],
        [
            "Nonito Donaire, World Champion Boxer"
        ],
        [
            "Carlos P. Garcia, eighth President of the Philippines"
        ],
        [
            "Lauro Mumar, PBA Player"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Talibon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Talibon Feast of the Blessed Trinity\".",
            "www.bohol-philippines.com.",
            "Retrieved February 20, 2019."
        ],
        [
            "^ \"Bohol Festivals Timetable\".",
            "www.bohol-philippines.com.",
            "Retrieved 2019-03-26."
        ],
        [
            "^ CEBALLOS, PATRICIO R. (1975).",
            "\"The Fiesta Plays of Bohol\".",
            "Philippine Studies.",
            "23 (1/2): 190–222.",
            "ISSN 0031-7837.",
            "JSTOR 42635040."
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-17."
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ Mathay, Ponciano (December 12, 1970).",
            "\"Administrative Order No.",
            "256, s. 1970\".",
            "Official Gazette.",
            "Retrieved November 15, 2020."
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ Mathay, Ponciano (December 12, 1970).",
            "\"Administrative Order No.",
            "256, s. 1970\".",
            "Official Gazette.",
            "Retrieved November 15, 2020."
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ \"Executive Order No.",
            "80, s. 1947\".",
            "Official Gazette (Philippines).",
            "Government of the Philippines.",
            "August 14, 1947.",
            "Retrieved March 20, 2023."
        ],
        [
            "^ CEBALLOS, PATRICIO R. (1975).",
            "\"The Fiesta Plays of Bohol\".",
            "Philippine Studies.",
            "23 (1/2): 190–222.",
            "ISSN 0031-7837.",
            "JSTOR 42635040."
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ Talibon (2019-02-13).",
            "\"Where is POBLACION, TALIBON located?",
            "#whereisit\".",
            "Where Is It #whereisit.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Talibon: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 9 May 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Bohol\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Alturas Supermarket Talibon"
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "^ Bohol-Philippines"
        ],
        [
            "^ Serna, Isabel Dela (2011-03-16).",
            "\"BOHOL: Bohol\".",
            "BOHOL.",
            "Retrieved 2020-11-15."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Talibon."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Talibon"
        ],
        [
            "Municipality of Talibon"
        ],
        [
            "Talibon Bohol News"
        ],
        [
            "Places adjacent to Talibon"
        ],
        [
            "Camotes Sea"
        ],
        [
            "Getafe"
        ],
        [
            "Talibon"
        ],
        [
            "Bien Unido"
        ],
        [
            "Buenavista"
        ],
        [
            "Danao"
        ],
        [
            "Trinidad"
        ],
        [
            "vte Province of BoholTagbilaran (capital and largest city)Municipalities"
        ],
        [
            "Alburquerque"
        ],
        [
            "Alicia"
        ],
        [
            "Anda"
        ],
        [
            "Antequera"
        ],
        [
            "Baclayon"
        ],
        [
            "Balilihan"
        ],
        [
            "Batuan"
        ],
        [
            "Bien Unido"
        ],
        [
            "Bilar"
        ],
        [
            "Buenavista"
        ],
        [
            "Calape"
        ],
        [
            "Candijay"
        ],
        [
            "Carmen"
        ],
        [
            "Catigbian"
        ],
        [
            "Clarin"
        ],
        [
            "Corella"
        ],
        [
            "Cortes"
        ],
        [
            "Dagohoy"
        ],
        [
            "Danao"
        ],
        [
            "Dauis"
        ],
        [
            "Dimiao"
        ],
        [
            "Duero"
        ],
        [
            "Garcia Hernandez"
        ],
        [
            "Getafe"
        ],
        [
            "Guindulman"
        ],
        [
            "Inabanga"
        ],
        [
            "Jagna"
        ],
        [
            "Lila"
        ],
        [
            "Loay"
        ],
        [
            "Loboc"
        ],
        [
            "Loon"
        ],
        [
            "Mabini"
        ],
        [
            "Maribojoc"
        ],
        [
            "Panglao"
        ],
        [
            "Pilar"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Sagbayan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Sevilla"
        ],
        [
            "Sierra Bullones"
        ],
        [
            "Sikatuna"
        ],
        [
            "Talibon"
        ],
        [
            "Trinidad"
        ],
        [
            "Tubigon"
        ],
        [
            "Ubay"
        ],
        [
            "Valencia"
        ],
        [
            "Component city"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Islands"
        ],
        [
            "Balicasag"
        ],
        [
            "Banacon"
        ],
        [
            "Bansaan"
        ],
        [
            "Bilangbilangan"
        ],
        [
            "Bohol"
        ],
        [
            "Cabilao"
        ],
        [
            "Cabulan"
        ],
        [
            "Hingotanan"
        ],
        [
            "Jandayan"
        ],
        [
            "Jao"
        ],
        [
            "Juagdan"
        ],
        [
            "Lapinig"
        ],
        [
            "Mahanay"
        ],
        [
            "Malingin"
        ],
        [
            "Mantatao"
        ],
        [
            "Maomawan"
        ],
        [
            "Pamilacan"
        ],
        [
            "Pangangan"
        ],
        [
            "Panglao"
        ],
        [
            "Sagasa"
        ],
        [
            "Sandingan"
        ],
        [
            "Tintinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Talibon&oldid=1226515689\""
        ],
        [
            "Category: Municipalities of BoholHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from September 2021All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}