{
    "name": "Tanauan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tanauan, Leyte"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°07′N 125°01′E﻿ / ﻿11.12°N 125.02°E﻿ / 11.12; 125.02"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Leyte, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Tanauan, Leyte\" – news · newspapers · books · scholar · JSTOR (June 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesTanauanMunicipalityMunicipality of Tanauan"
        ],
        [
            "FlagSealMap of Leyte with Tanauan highlightedOpenStreetMapTanauanLocation within the PhilippinesCoordinates: 11°07′N 125°01′E﻿ / ﻿11.12°N 125.02°E﻿ / 11.12; 125.02CountryPhilippinesRegionEastern VisayasProvinceLeyteDistrict"
        ],
        [
            "1st districtFounded1710Barangays54"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorGina E. Merilo • Vice MayorArchie Kapunan • RepresentativeFerdinand Martin G. Romualdez • Councilors"
        ],
        [
            "List"
        ],
        [
            "• Quintin T. Octa• Archie Lawrence R. Kapunan• Mark Giffren E. Merilo• Bianito M. Fiel• Jovencio K. Badana• Lauro A. Villero• Jose C. Angulo• Paul Emmanuel R. CincoDILG Masterlist of Officials"
        ],
        [
            " • Electorate37,179 voters (2022)Area • Revenue₱ 181.7 million (2020) • Assets₱ 598.3 million (2020) • Expenditure₱ 170 million (2020) • Liabilities₱ 115.7 million (2020)Service provider • ElectricityDon Orestes Romualdez Electric Coperative (DORELCO)Time zoneUTC+8 (PST)ZIP code6502PSGC0803748000IDD : area code +63 (0)53Native languagesWaray TagalogWebsitewww.tanauan-leyte.gov.ph"
        ],
        [
            "Tanauan (IPA:"
        ],
        [
            "Tanauan is one of the oldest towns in Leyte dating back to the year of 1710.",
            "It is composed of 54 barangays.",
            "The town was also known as the “Cradle of the Intellectuals” or the Bungto han Kamag-araman since the Spanish colonial era.",
            "Tanauan is approximately 18 kilometers south of Tacloban City, the capital of the Eastern Visayas Region.",
            "It is bounded on the north by the municipality of Palo, Tolosa on the south, Dagami and Tabon-tabon on its west side and on the east by San Pedro Bay."
        ],
        [
            "The town was heavily damaged by Super Typhoon Haiyan (Yolanda) in November 2013.",
            "The town celebrates its fiesta annually on August 15."
        ],
        [
            "History"
        ],
        [
            "Pre-Spanish and Spanish Colonial eras"
        ],
        [
            "The town got its name from a towering molave tree which served as a look-out tower.",
            "“Tan-awan” or \"taran-awan\" means to \"look out\" in the Waray language.",
            "In Visayan and Mindanao history, a person who served as a lookout is there to watch for Moro pirates who would attack and plunder settlements along the coast."
        ],
        [
            "The first known settlers of Tanauan were the family of Calanao with his wife and only daughter.",
            "In 1661, Juanillo Siengco's family joined the Calanao family in the settlement along the riverbanks of the Bukid River at the foot of Adil Hill.",
            "By the time their settlements were more developed, the plundering of the Moros along the coast intensified.",
            "Seeking for refuge, they built a stone-walled enclosure called cuta in the area of Buaya.",
            "Later, Juanillo's son, Josef, married Calanao's daughter, Sangod, and from the families of Juanillo Siengco and Calanao a tribe was formed, which gave Tanauan its first tribal leaders."
        ],
        [
            "In 1710, during the Spanish reign in the Philippines, the first town officials were appointed by the Spanish authorities.",
            "From 1710 up to the end of the Spanish Colonial era in the 1900s and the start of the American occupation, 47 persons became chief executives of the municipality."
        ],
        [
            "Tolosa, an adjacent town to the south of Tanauan, was once part of the municipality.",
            "Through the efforts of Magdalino Vivero and Domingo Camacho, the Spanish government was petitioned to grant Tolosa autonomy from the municipality.",
            "The petition was granted in 1852."
        ],
        [
            "American Colonial Period to the Japanese Occupation; World War II"
        ],
        [
            "During the American regime in 1901 to 1943, a new set of municipal executives were assigned.",
            "When World War II broke out, Pedro A. Villegas was the incumbent mayor."
        ],
        [
            "When the Japanese occupied the town, Mayor Villegas and his secretary, Janario Perez, refused to serve the Japanese authorities, and thus Rufo Cobacha was appointed mayor by the Japanese, followed by Pedro Bulik who was eventually killed by the local guerrillas."
        ],
        [
            "During the Japanese occupation, the town was burned by the guerrillas in 1943.",
            "This unfortunate event destroyed the municipal building, including its records, and a lot of the big ancestral houses of Spanish architecture along Calle Real.",
            "When the US Allied Forces stormed the town during the liberation of Leyte, it resulted in further destruction of the municipal hall (Lian Chong Building) and the few remaining houses along Calle Real.",
            "However, few lives were lost during the assault as the town's people were warned beforehand and took refuge at the fortified parish church.",
            "Eugenio Avila Sr. was the incumbent mayor when the Filipino and American Liberation Forces occupied the town.",
            "The US Sixth Army initially established its headquarters in Tanauan before the construction of the airfield began in November 1944."
        ],
        [
            "Tanauan Airfield and its logistical importance during the liberation of the Philippines"
        ],
        [
            "The X and XXIV Corps from the United States Sixth Army took part in the liberation of Tanauan from the Japanese Occupation Forces immediately after the US and Allied Forces landed on the beaches of Leyte in October 1944.",
            "Shortly thereafter, the United States Sixth Army, under the command of Lieutenant General Walter Krueger, established its headquarters in Tanauan."
        ],
        [
            "When the US and Allied Forces captured the airstrip at Tacloban, the work to further develop it for US warplanes was handicapped due to the heavy concentration of troops, supplies, and equipment in the area during the early stages of the operation.",
            "It was further hampered by insufficient supply of corals for surfacing the runway.",
            "Works were also simultaneously done on the other two airstrips in Buri and San Pablo in the vicinity of Burauen, but these were halted in the latter part of November 1944, as it was deemed that a considerable amount of time and effort had been spent in the futile attempt to make these airfields usable.",
            "The inability of the Sixth Army to meet its construction dates on the airstrips prevented the US forces from stopping the flow of Japanese reinforcements and made it impossible for the Allied Forces to give sufficient land-based air support to the ground troops."
        ],
        [
            "In a desperate move to have an operational airfield, Lieutenant General Krueger received permission from General Douglas MacArthur to construct an airfield in Tanauan.",
            "On November 28, 1944, the headquarters of the US Sixth Army was moved to Tolosa to start the construction of the airfield."
        ],
        [
            "All Marine Aircraft Group 12 (MAG-12) planes in Leyte, which played an important air support role for the Sixth Army, moved from Tacloban Airfield to Tanauan Airfield in December 1944.",
            "The airfield was used by the following units:"
        ],
        [
            "Tanauan Airfield in July 1945 overlooking what is now known as Barangay San Roque (foreground) and Barangay Sto Niño (halfway to the south of the airfield).",
            "Ambao Hill is seen in the background."
        ],
        [
            "312th Bombardment Group (November 19, 1944 to February 10, 1945)"
        ],
        [
            "340th Fighter Squadron (December 15, 1944)"
        ],
        [
            "341st Fighter Squadron (December 14, 1944)"
        ],
        [
            "460th Fighter-Interceptor Training Squadron (December 12, 1944)"
        ],
        [
            "433rd Troop Carrier Group (January 19, 1945 to May 31, 1945)"
        ],
        [
            "348th FG 460th Fighter Squadron (P-47)"
        ],
        [
            "348th FG 340th Fighter Squadron (P-47)"
        ],
        [
            "348th FG 341st Fighter Squadron (P-47)"
        ],
        [
            "348th FG 342nd Fighter Squadron (P-47)"
        ],
        [
            "25th Liaison Squadron (UC-78 and L-5)."
        ],
        [
            "The airfield was abandoned following the withdrawal of the Allied Forces after the war and was later on referred to as \"landing\" by the locals.",
            "Today, a small remnant of this airfield can still be found in an area called \"Pawa\", located in Barangay Santo Niño.",
            "Most of the remaining areas are now occupied by large business establishments such as the Pepsi Cola Tanauan Plant and New Leyte Edible Oil Manufacturing Corporation compund.",
            "The Tanauan Public Market, various commercial buildings and residential neighborhoods are also now in the area.",
            "The airfield covers the area of what is now known as Barangay San Roque and Barangay Santo Niño.",
            "Maharlika Highway (formerly known as Highway 1), which connects the Eastern Visayas Region with Luzon to the north and Mindanao to the south, traverses the former airfield site."
        ],
        [
            "Post World War II to the present day"
        ],
        [
            "During the liberation, Benito Saavedra was appointed mayor of the newly-restored Philippine government, then succeeded by the following in the order of incumbencies:"
        ],
        [
            "Rufo Cumpio -1945"
        ],
        [
            "Dioniso Boco - 1946"
        ],
        [
            "Pelagio O. Tecson – 1946-1947"
        ],
        [
            "After the liberation period, Dionisio Boco became the first mayor, then succeeded by Pelagio O. Tecson Sr.",
            "In 1950, Barrio Haclagan, the site of the former US Airfield, was renamed Santo Niño."
        ],
        [
            "Pelagio Tecson, Sr. was the mayor during the period of martial law in the Philippines up to February 25, 1986, the date of the EDSA Revolution, when Felix Cortez was appointed Officer-in-Charge (OIC) Mayor by the new government.",
            "The local elections held on February 1, 1988, resulted in the election of Charles R. Avila.",
            "It was during his tenure that he was appointed as Administrator of the Philippine Coconut Authority in January 1991, and Vice Mayor Rodolfo Cinco succeeded him as mayor."
        ],
        [
            "In the May 1992 synchronized elections for national and local officials, Roque Tiu won over five candidates for the mayoralty position.",
            "Tiu was the chief executive of the town until his second term ended in 1998.",
            "Mark Gimenez was elected mayor from 1998 to 2001.",
            "During the 2001 elections, Tiu ran again and won over Gimenez, making Tiu mayor of the town for three consecutive terms from 2001 to 2010.",
            "After Tiu completed his term, his vice mayor, Agapito Pagayanan Jr., ran for the mayoralty position during the 2010 general elections and won.",
            "His term started in 2010 and ended in 2013.",
            "During the 2013 mid-term elections, Pelagio Tecson, Jr. won over the incumbent mayor with only a small margin of votes."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Tanauan is politically subdivided into 54 barangays  Each barangay consists of puroks while some have sitios."
        ],
        [
            "Ada"
        ],
        [
            "Amanluran"
        ],
        [
            "Arado"
        ],
        [
            "Atipolo"
        ],
        [
            "Balud"
        ],
        [
            "Bangon"
        ],
        [
            "Bantagan"
        ],
        [
            "Baras"
        ],
        [
            "Binolo"
        ],
        [
            "Binongto-an"
        ],
        [
            "Bislig"
        ],
        [
            "Buntay (Poblacion)"
        ],
        [
            "Cabalagnan"
        ],
        [
            "Cabarasan Guti"
        ],
        [
            "Cabonga-an"
        ],
        [
            "Cabuynan"
        ],
        [
            "Cahumayhumayan"
        ],
        [
            "Calogcog"
        ],
        [
            "Calsadahay"
        ],
        [
            "Camire"
        ],
        [
            "Canbalisara"
        ],
        [
            "Canramos (Poblacion)"
        ],
        [
            "Catigbian"
        ],
        [
            "Catmon"
        ],
        [
            "Cogon"
        ],
        [
            "Guindag-an"
        ],
        [
            "Guingauan"
        ],
        [
            "Hilagpad"
        ],
        [
            "Lapay"
        ],
        [
            "Licod (Poblacion)"
        ],
        [
            "Limbuhan Daku"
        ],
        [
            "Limbuhan Guti"
        ],
        [
            "Linao"
        ],
        [
            "Kiling"
        ],
        [
            "Magay"
        ],
        [
            "Maghulod"
        ],
        [
            "Malaguicay"
        ],
        [
            "Maribi"
        ],
        [
            "Mohon"
        ],
        [
            "Pago"
        ],
        [
            "Pasil"
        ],
        [
            "Picas"
        ],
        [
            "Sacme"
        ],
        [
            "San Miguel (Poblacion)"
        ],
        [
            "Salvador"
        ],
        [
            "San Isidro"
        ],
        [
            "San Roque (Poblacion)"
        ],
        [
            "San Victor"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santo Niño (Haclagan) (Poblacion)"
        ],
        [
            "Solano"
        ],
        [
            "Talolora"
        ],
        [
            "Tugop"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Tanauan, Leyte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "90(3.5)"
        ],
        [
            "67(2.6)"
        ],
        [
            "82(3.2)"
        ],
        [
            "70(2.8)"
        ],
        [
            "97(3.8)"
        ],
        [
            "145(5.7)"
        ],
        [
            "142(5.6)"
        ],
        [
            "127(5.0)"
        ],
        [
            "132(5.2)"
        ],
        [
            "152(6.0)"
        ],
        [
            "169(6.7)"
        ],
        [
            "144(5.7)"
        ],
        [
            "1,417(55.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "17.0"
        ],
        [
            "13.5"
        ],
        [
            "16.0"
        ],
        [
            "16.5"
        ],
        [
            "20.6"
        ],
        [
            "24.3"
        ],
        [
            "26.0"
        ],
        [
            "25.4"
        ],
        [
            "25.2"
        ],
        [
            "26.4"
        ],
        [
            "23.0"
        ],
        [
            "21.0"
        ],
        [
            "254.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TanauanYearPop.±% p.a.1903 18,256—    1918 18,880+0.22%1939 21,934+0.72%1948 24,573+1.27%1960 23,421−0.40%YearPop.±% p.a.1970 29,438+2.31%1975 30,541+0.74%1980 31,487+0.61%1990 38,033+1.91%1995 40,716+1.29%YearPop.±% p.a.2000 45,056+2.20%2007 47,426+0.71%2010 50,119+2.03%2015 55,021+1.79%2020 57,455+0.85%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Tanauan, Leyte, was 57,455 people, with a density of 730 inhabitants per square kilometre or 1,900 inhabitants per square mile."
        ],
        [
            "Language"
        ],
        [
            "Waray-waray is the language spoken by the people of Tanauan.",
            "It is the lingua franca or common language of the Eastern Visayas region.",
            "However, Tagalog is widely understood and spoken by the locals when talking to other people coming from Manila and other Philippine provinces.",
            "English remains the language used by the local government and schools on official correspondences and documents.",
            "Waray-waray is used as a medium of instruction in schools in the municipality from Kindergarten to Grade 3.",
            "Filipino and English languages are officially taught in schools as part of the primary and secondary education curriculum requirement."
        ],
        [
            "Religion"
        ],
        [
            "Our Lady of the Assumption Parish Church is the primary Catholic church in the municipality."
        ],
        [
            "Tanauan has a 100% Christian population.",
            "Almost 96-97% of the municipality's population are Roman Catholics.",
            "Every village has its own Roman Catholic chapel aside from the parish church in the town proper.",
            "There are also adherents of other Christian denominations and sects like the Iglesia ni Cristo, The Church of Jesus Christ of Latter-Day Saints (Mormons), Seventh-day Adventists (Sabadistas), Evangelicals (Born-Again Christians), Jehovah's Witnesses (Mga Saksi ni Jehova) and many more."
        ],
        [
            "The municipality's patron saint is Our Lady of the Assumption (Nuestra Señora de la Asunción)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tanauan"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  25.10"
        ],
        [
            "2009  26.95"
        ],
        [
            "2012  28.88"
        ],
        [
            "2015  28.47"
        ],
        [
            "2018  20.91"
        ],
        [
            "2021  24.70"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "In 2005, the municipality registered a total income of PHP 47.6 million.",
            "This went up to PHP 56.4 million in 2007, representing an average annual increase of over 9%, mostly coming from considerable increases in local taxes, permits and licenses, and the Internal Revenue Allotment.",
            "This economic performance was attributed largely to the reforms and initiatives introduced by Mayor Roque Tiu, which streamlined the processes of getting business and license permits."
        ],
        [
            "As a result of these reforms, the municipality of Tanauan also earned the \"2006 Most Business-Friendly Municipality in the Country\" award during the closing rites of the 32nd Philippine Business Conference held at the Manila Hotel on October 20, 2006."
        ],
        [
            "The businesses and industries that support Tanauan's local economy are from agriculture, livestock, fishing, forestry and mining, trade and industry, and tourism."
        ],
        [
            "The major investors in the municipality are the following:"
        ],
        [
            "Pepsi Cola (Tanauan plant)"
        ],
        [
            "Wella Metal Corporation"
        ],
        [
            "New Leyte Edible Oil Manufacturing Corporation"
        ],
        [
            "Local industries and crafts"
        ],
        [
            "Tanauan is known for various locally-made crafts, which include bamboo-craft,"
        ],
        [
            "Infrastructure"
        ],
        [
            "Storm drainage system"
        ],
        [
            "Tanauan still lacks an efficient infrastructure for its storm drainage system.",
            "Although storm drainage projects were constructed in the past, it was poorly planned and maintained that resulted in a failure to prevent occasional flooding in various places within the town proper due to sedimentation and clogging of existing drainage canals."
        ],
        [
            "Healthcare facilities"
        ],
        [
            "Tanauan Birthing Facility"
        ],
        [
            "In 2009, Mayor Tiu constructed the birthing facility of Tanauan with assistance from the Japanese government.",
            "The facility became operational in May 2010 and has since been providing appropriate and accessible medical services for pregnant women in Tanauan."
        ],
        [
            "Utilities and Telecommunications"
        ],
        [
            "The following are the telephone, mobile phone, and electric companies serving the area of Tanauan."
        ],
        [
            "Telephone Companies:"
        ],
        [
            "Bayan Telecommunications, Inc."
        ],
        [
            "Eastern Visayas Telephone Company"
        ],
        [
            "Mobile Phone Service Provider:"
        ],
        [
            "Globe Telecom"
        ],
        [
            "Smart Communications"
        ],
        [
            "DITO"
        ],
        [
            "Electric Companies:"
        ],
        [
            "Leyte Electric Cooperative I (LEYECO I)"
        ],
        [
            "Don Orestes Romualdez Electric Cooperative (DORELCO)"
        ],
        [
            "Water Supply:"
        ],
        [
            "Leyte Metropolitan Water District (LMWD)"
        ],
        [
            "Prime Water (PW)"
        ],
        [
            "Parks and playgrounds"
        ],
        [
            "Tanauan currently has one large municipal plaza, which is located at the heart of the town across the back of the old municipal hall.",
            "It has a mini-amphitheater and large outdoor grounds, which is often used as a venue for large open-air activities such as the annual Pasaka Festival Competition among other outdoor gatherings of the town.",
            "It also has two outdoor basketball courts and one outdoor tennis court complex.",
            "Surrounding the plaza are various centuries-old acacia trees that are one of the most well-preserved in the Eastern Visayas Region."
        ],
        [
            "Transportation"
        ],
        [
            "Tanauan is accessible mainly by land through public-utility jeepneys.",
            "Taxis are also available from Tacloban City and the regional airport but generally have fares that cost higher.",
            "When travelling within Tanauan, pedicabs and tricycle cabs are available ."
        ],
        [
            "Education"
        ],
        [
            "Primary School/Elementary School"
        ],
        [
            "Tanauan I Central School (Public)"
        ],
        [
            "Tanauan II Central School (Public)"
        ],
        [
            "Salvador Central School (Public)"
        ],
        [
            "Secondary School/High School"
        ],
        [
            "Assumption Academy (Private)"
        ],
        [
            "Kiling National High School (Public)"
        ],
        [
            "Tanauan School of Craftsmanship and Home Industries (Public)"
        ],
        [
            "Tanauan National High School (Public)"
        ],
        [
            "Tanauan School of Arts and Trade (Public)"
        ],
        [
            "College/University"
        ],
        [
            "Eastern Visayas State University - Tanauan Campus (Public)"
        ],
        [
            "Heritage and Culture"
        ],
        [
            "Local customs and etiquettes"
        ],
        [
            "Most locals take off their slippers, shoes, or flip flops before entering a house.",
            "During weddings, it is customary for the bride and groom to do the traditional folk dance called Kuratsa, and members of the family and guests alike are encouraged to pin money on their attire as a symbol of good luck and prosperity for the couple's future.",
            "Tanauan-anons also observe fiesta celebrations annually in different barangays to honor their respective local Catholic saints.",
            "During the fiesta, it is a tradition to prepare food in every house and invite guests and visitors to share their meal as a sign of thanksgiving."
        ],
        [
            "Church of Our Lady of the Assumption"
        ],
        [
            "The church is one of the six architectural heritage sites in Leyte.",
            "It was originally built by the Jesuit Missionaries in 1704 and was turned over to the Augustinians in the year 1768.",
            "Father Francisco de Paula Marquez spearheaded the repair and enlargement of the church from 1850 to 1860.",
            "He added a transept and constructed thick rock walls at the perimeter of the church with towers on each four corners for defense against pirates.",
            "The Church survived a hurricane and the storm surge of 1897.",
            "The Church takes pride of its Stations of the Cross made in Mexico using Spanish terracotta.",
            "The rectory and pulpit are also restored."
        ],
        [
            "Pasaka Festival"
        ],
        [
            "The town's Pasaka Festival started in 1991.",
            "The word \"pasaka\" means \"assumption\", referring to the Virgin Mary's assumption into heaven.",
            "The festival, which runs from August 1 to 15, is seen as an opportunity to showcase the town's rich cultural heritage.",
            "It is a means of paying homage and thanksgiving to the town's patroness, Our Lady of the Assumption.",
            "It begins with a nightly cultural presentation held from August 1 to 14 at the Tanauan Public Plaza, which showcases the best talents, culture, and tradition of the municipality, participated in by various schools, the local government unit, and non-government organizations of Tanauan."
        ],
        [
            "In the afternoon of August 14, the traditional Pasaka Festival competition is held, which features a colorful presentation of a dance drama and street-dancing that depicts a community paying homage to the Blessed Virgin's Assumption.",
            "The competition is grouped into three categories: the Senior category, participated in by high school students, and the Junior category, composed of elementary pupils and the general public of merry makers.",
            "The festival culminates on August 15, the Feast of the town's patroness, and a Holy Mass celebrated at the Our Lady of the Assumption Parish Church.",
            "It is also observed as Tanauan Day, a local holiday."
        ],
        [
            "Tinikling and its possible origins in Tanauan"
        ],
        [
            "Tinikling is the most popular and best known of Philippine dances and honored as the Philippine national dance.",
            "It is one of the oldest Philippine traditional dances and originated in Leyte province.",
            "The people of Leyte describe the tikling bird, from which the tinikling dance got its name, as having one of the most unique movements—walking around and between tree branches and grass stems.",
            "Tinikling, the creative dance of Leyteños, imitate this bird's movement through branches and stems with the use of bamboo poles."
        ],
        [
            "In 2006, then-Mayor Tiu's attention was called regarding the 2005 calendar of the Philippine National Oil Corporation entitled sulyap (glimpse), which highlighted looking back into the homes of Filipino culture and taking a glimpse into one's roots in relation to moving forward in life.",
            "The second page of the calendar (March–April page) featured the Tinikling with this brief description in Filipino: ...”ang Tinikling ay nagmula sa Tanauan, Leyte.",
            "Isa ito sa mga pinaka-kilalang Pilipinong sayaw sa buong mundo.",
            "Ang pagkamalikhain ng mga taga Leyte ay nagbigay buhay sa simpleng galaw ng ibong tikling, kung saan nakuhaang pangalan ng sayaw.",
            "Sa Tinikling naipamalas ang likas na halina at pagiging masayahin na nabubukod-tangi sa mga Pilipino.” Today, pinpointing the exact origin of this dance still remains elusive."
        ],
        [
            "Anthologist and poet Vicente I.",
            "De Veyra, a native of Leyte, collected folk songs in his book Mga Ambahan, which included one titled \"Tinikling\"."
        ],
        [
            "Skimboarding"
        ],
        [
            "Tanauan is recognized as the “Skimboarding Capital of the Philippines\".",
            "It is told by oral tradition that skimboarding was first introduced in Tanauan in 2001, when a Palau national came to Tanauan to win the heart of a local lass.",
            "Since Tanauan is situated along the coast facing San Pedro Bay, the Palau national started making a skimboard.",
            "However, he was not able to teach the local youths how to use it since he needed to leave and go back to Palau.",
            "He left the skimboard, and the local youths started to train themselves on how to use it.",
            "Thereafter, young people from Barangay San Roque and Barangay Santo Niño started making prototypes of the skimboard which were then sold to enthusiasts.",
            "However, according to the locals, in the year December 1999 skimboarding was already being seen on Tanauan's shore before the Palau national came to the town.",
            "They called it \"sulinap\", using a plastic floater from a scrap of jetski, without knowing that the sport they were playing was called skimboarding.",
            "The first ride happened at \"Air Waves\", now called as Sabang Surf Camp, in Dulag, Leyte.",
            "Darwin de Veyra Maceda was the first rider of \"sulinap\", and he showed it to his brother Beben de Veyra Maceda.",
            "The two embraced the sport and started to teach the locals in Tanauan."
        ],
        [
            "A contending tale has it that the first skimboarder in the Philippines, Michael Miranda, together with his friend Kim Ian \"Dodot\" Montaño, made the first locally-made skimboard, and with their enthusiasm for the sports introduced the skimboard and taught Tanauan locals how to ride it.",
            "The first skimboarding competition was organized by Darwin Maceda with his friends Alexander Cumpio and Nerizza Reynera at Tanauan's Bantay Dagat area on March 31, 2002.",
            "Since then, skimboarding has spread to Tanauan's nearby towns and later throughout the country.",
            "Currently, national and international skimboarding competitions are held annually at the Bantay Dagat area of Tanauan."
        ],
        [
            "Notable personalities"
        ],
        [
            "Charles R. Avila - former Administrator of the Philippine Coconut Authority"
        ],
        [
            "Jaime C. de Veyra - Resident Commissioner to the U.S. House of Representatives from the Philippine Islands from 1917 to 1923 and the 1st Governor of Leyte"
        ],
        [
            "Vicente I. de Veyra - Waray-language poet, anthologist, orthographer and phonetician"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Tanauan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Researchers Probe Possible Origin of Tinikling Folkdance in Leyte\".",
            "Philippine Information Agency.",
            "August 28, 2006."
        ],
        [
            "^ a b c \"Feasibility Study for the Modernization of the New Tanauan Public Market\".",
            "Strategic and Comprehensive Consultants, Inc. 2008.",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ \"Vacariate of Palo\".",
            "The Official Website of the Archdiocese of Palo."
        ],
        [
            "^ a b c d e Cannon, M. Hamlin (1993) .",
            "Leyte: The Return to the Philippines."
        ],
        [
            "^ \"Sixth United States Army Report of the Luzon Campaign, 9 Jan 1945 - 30 Jun 1945\".",
            "I. January 14, 1982.",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ a b c d e f \"Tanauan Airfield\".",
            "PacificWrecks.com.",
            "June 23, 2013."
        ],
        [
            "^ \"An act changing the name of Barrio Haclagan, in the municipality of Tanawan, province of Leyte, to Santo Niño\".",
            "LawPH.com.",
            "Retrieved 2011-04-09."
        ],
        [
            "^ Tiu, Erlinda Olivia (May 16, 2013).",
            "\"Leyte has 17 New Mayors\".",
            "Philippine Information Agency.",
            "Archived from the original on August 5, 2013."
        ],
        [
            "^"
        ],
        [
            "\"Province:\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Tanauan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 February 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2006 Most Business-Friendly Municipality Willing to Share Experience with other LGUs\".",
            "Philippine Information Agency.",
            "October 22, 2006."
        ],
        [
            "^ \"Tanauan Won 2006 Most Business-Friendly Municipality in the Country\".",
            "SamarNews.com.",
            "October 22, 2006."
        ],
        [
            "^ \"Addressing Gender and Enterprise Challenges of the Bamboo Craft Industry in Leyte\".",
            "Philippine Commission on Women."
        ],
        [
            "^ \"Feature: There is Money in Home Industries\".",
            "Philippine Information Agency.",
            "March 26, 2007."
        ],
        [
            "^ \"Japan Turns Over New Birthing Facility to Tanauan, Leyte LGU\".",
            "Philippine Information Agency.",
            "April 27, 2010."
        ],
        [
            "^ \"The Project for Construction of Birthing Facility in the Municipality of Tanauan, Leyte\".",
            "Embassy of Japan in the Philippines.",
            "January 2009.",
            "Archived from the original on 2013-05-09."
        ],
        [
            "^ \"Region VIII/ List of Higher Education Institutions (HEIs)\".",
            "Commission on Higher Education."
        ],
        [
            "^ \"Church of Tanauan, Leyte\".",
            "National Registry of Historic Sites and Structures in the Philippines."
        ],
        [
            "^ \"Pasaka Festival 2007 Showcases Tanauan's Culture and Heritage\".",
            "Philippine Travel Blog.",
            "August 2, 2007.",
            "Archived from the original on April 25, 2012."
        ],
        [
            "^ \"Philippine National Dance - Tinikling!\".",
            "Likha Pilipino Folk Ensemble."
        ],
        [
            "^ Tinikling was originated in Tanauan, Leyte.",
            "It is one of the best known Philippine folk dance.",
            "The creativity of the people of Leyte gave life to the simple movement of the tikling, birds from which the dance got its name, \"Tinikling\".",
            "The dance mirrors the innate grace and joy of Filipinos."
        ],
        [
            "^ \"Biography of Vicente I. de Veyra\".",
            "Waray Museum."
        ],
        [
            "^ \"Tanauan Skimboarding Goes International Next Year\".",
            "Philippine Information Agency.",
            "April 24, 2006."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Tanauan, Leyte."
        ],
        [
            "Wikivoyage has a travel guide for Tanauan, Leyte."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Official website"
        ],
        [
            "Places adjacent to Tanauan, Leyte"
        ],
        [
            "Palo"
        ],
        [
            "DagamiTabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "San Pedro Bay"
        ],
        [
            "Julita"
        ],
        [
            "Tolosa"
        ],
        [
            "Leyte Gulf"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tanauan,_Leyte&oldid=1230062463\""
        ],
        [
            "Category: Municipalities of Leyte (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 errors: missing periodicalCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2013All articles needing additional referencesCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from January 2022Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}