{
    "name": "Tanay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tanay, Rizal"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEsperantoفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°29′50″N 121°17′11″E﻿ / ﻿14.49722°N 121.28639°E﻿ / 14.49722; 121.28639"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Rizal, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Tanay, Rizal\" – news · newspapers · books · scholar · JSTOR (March 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Calabarzon, PhilippinesTanayMunicipalityMunicipality of TanayTanay Municipal Hall"
        ],
        [
            "FlagSealNickname: Tourism Capital of RizalAnthem: Tanay Dakila kaMap of Rizal with Tanay highlightedOpenStreetMapTanayLocation within the PhilippinesCoordinates: 14°29′50″N 121°17′11″E﻿ / ﻿14.49722°N 121.28639°E﻿ / 14.49722; 121.28639CountryPhilippinesRegionCalabarzonProvinceRizalDistrict"
        ],
        [
            "2nd districtFoundedNovember 12, 1606Named for\"Monte de Tan-ay\"Barangays20"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRafael A. Tanjuatco • Vice MayorRex Manuel C. Tanjuatco • RepresentativeEmigdio P. Tanjuatco III • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Allan T. SacramentoIvan Allen B. TongohanAngelo S. PitoralEnrique S. Vergel de Dios IIIPaula B. de GuzmanRomel A. MagwiliNelson M. OcampoAaron R. Guerrero"
        ],
        [
            " • Electorate70,360 voters (2022)Area • Revenue₱ 448.8 million (2020) • Assets₱ 2,297 million (2020) • Expenditure₱ 394.9 million (2020) • Liabilities₱ 942.6 million (2020)Service provider • ElectricityManila Electric Company (Meralco) • WaterTanay Water DistrictTime zoneUTC+8 (PST)ZIP code1980PSGC045812000IDD : area code +63 (0)2Native languagesSinauna TagalogMajor religionsRoman CatholicismFeast dateJanuary 22–24 – Tanay Town Fiesta"
        ],
        [
            "October 28 – Barangay Sampaloc Fiesta"
        ],
        [
            "November – Tanay Hane FestivalCatholic dioceseDiocese of AntipoloPatron saintIldephonsus of Toledo"
        ],
        [
            "Our Lady of Guadalupe – (Town Proper),"
        ],
        [
            "Holy Cross – (Barangay Tandang Kutyo),"
        ],
        [
            "Jude the Apostle – (Barangay Sampaloc), and"
        ],
        [
            "Holy Family – (Barangay Cuyambay)Websitewww.tanay.gov.ph"
        ],
        [
            "Tanay, officially the Municipality of Tanay (Tagalog: Bayan ng Tanay IPA:"
        ],
        [
            "Tanay is located 37 kilometres (23 mi) from Antipolo and 54 kilometres (34 mi) from Manila.",
            "It contains portions of the Sierra Madre Mountains and is bordered by Antipolo in the north-west, Baras, Morong and Teresa in the west, General Nakar (Quezon Province) in the east, and Pililla, Santa Maria (Laguna province) as well as the lake Laguna de Bay in the south."
        ],
        [
            "It is the epicenter of the Tanay Tagalog dialect, which has the deepest modern Tagalog words in the Tagalog language and is the only endangered Tagalog dialect."
        ],
        [
            "History"
        ],
        [
            "San Ildefonso de Toledo Church."
        ],
        [
            "Rizal Shrine near the San Ildefonso de Toledo Church."
        ],
        [
            "Tanay was settled by early Austronesian people.",
            "Shortly after the conquest and subjugation of Manila by the Spaniards and the surrounding lake areas by Juan de Salcedo in 1570–1574, Franciscan missionaries arrived to Christianize the inhabitants of what is now the Morong-Pililla area.",
            "In 1583, both Morong and Pililla were created as separate towns with Tanay forming part of Pililla."
        ],
        [
            "Tanay was founded as a separate pueblo (town) in 1606 under the name \"Monte de Tan-ay\".",
            "In 1620, administration was moved to San Antonio (now called Inalsan or Pantay) and Tandang Kutyo.",
            "In 1638, the town was burned during an uprising of Chinese living in the area, and the town was rebuilt in 1640 at the present day location."
        ],
        [
            "In 1747, the town of Tanay consisted of only eight barangays, namely Nuestra Senora del Rosario, Sa Josep, San Ildefonso de Tanay, San Francisco de Maytubig, San Pedro de Alcantara, San Lucas y San Antonio, San Apostol, and San Agustin de Balugbog."
        ],
        [
            "In 1853, a new political subdivision was formed.",
            "The town of Tanay together with Morong, Baras, Pililla, Angono, Binangonan and Jalajala form the Province of La Laguna, with the capital at Morong.",
            "This district was later changed to Distrito Politico-Militar de Morong after four years."
        ],
        [
            "Tanay became a Municipality in 1894 as an effect of the Spanish Maura Law.",
            "The first election of Public Office took place in 1895–1898 and 1898–1900 under the Revolutionary Government of the Philippines."
        ],
        [
            "Tanay members of the Katipunan fought valiantly during the Revolution against Spain.",
            "The town was the headquarters of the second military area of the Philippine Revolutionary Government under General Emilio Aguinaldo.",
            "And for a brief period between 1899 and 1900, Tanay served as the capital of the then Morong Province after Philippine–American War broke out and the American forces invaded the lake towns and captured Antipolo."
        ],
        [
            "In 1900–1901, Tanay as was under the Government appointed by the American Military under Taft Commission.",
            "From 1903 to 1934 the town leadership was under the American rule then in 1934 Tanay was under the Commonwealth of the Philippines as the Tydings–McDuffie Act was approved on March 24, 1934, until the Philippines fell to the hands of the Japanese during the Second World War in 1942."
        ],
        [
            "In 1942–1945 the Mountains of Tanay served as the Guerrilla base for 'Marking's Fil-American Guerrillas, beginning the Liberation of Tanay in March 1945 a very decorated by the Filipino soldiers of the 4th and 42nd Division of the Philippine Commonwealth Army, 4th Constabulary Regiment of the Philippine Constabulary and the recognized guerrillas against the Japanese occupation forces during World War II.",
            "General Agustin Marking is buried in a private cemetery by the road overlooking his son's farm in Sampaloc."
        ],
        [
            "On June 19, 1959, Republic Act No.",
            "2336, also known as \"An Act Establishing a Summer Resort in Sampaloc, Municipality of Tanay, Province of Rizal\" was approved whereas there is hereby established a summer resort in Sampaloc.",
            "The Commission on Parks and Wildlife shall issue such rules and regulations for the establishment of such resort is taken place."
        ],
        [
            "In October 2003, deposed Philippine president Joseph Estrada was transferred to a rest home in Sampaloc, a mountain barangay.",
            "He remained under house arrest until he was given executive clemency by President Gloria Macapagal Arroyo."
        ],
        [
            "During the Typhoon Ketsana (Ondoy) on September 26, 2009, Tanay was one of the hardest hit towns due to the rising of Laguna Lake and the flooding of Tanay River."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Political subdivisions"
        ],
        [
            "Tanay is politically subdivided into 20 barangays (10 urban, 10 rural).",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Limestone outcrop somewhere in barangay Cuyambay"
        ],
        [
            "Tanay Park near the San Ildefonso de Toledo Church"
        ],
        [
            "Cayabu"
        ],
        [
            "Cuyambay"
        ],
        [
            "Daraitan"
        ],
        [
            "Katipunan-Bayani (Pob.)"
        ],
        [
            "Kay Buto (Poblacion)"
        ],
        [
            "Laiban"
        ],
        [
            "Mag-Ampon (Poblacion)"
        ],
        [
            "Mamuyao"
        ],
        [
            "Madilay-dilay"
        ],
        [
            "Pinagkamaligan (Poblacion)"
        ],
        [
            "Plaza Aldea (Poblacion)"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Isidro (Poblacion)"
        ],
        [
            "Santa Inez"
        ],
        [
            "Santo Niño"
        ],
        [
            "Tabing Ilog (Poblacion)"
        ],
        [
            "Tandang Kutyo (Poblacion)"
        ],
        [
            "Tinucan"
        ],
        [
            "Wawa (Poblacion)"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Tanay, Rizal (1999–2012, extremes 2000–2012)"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "31.0(87.8)"
        ],
        [
            "32.2(90.0)"
        ],
        [
            "33.0(91.4)"
        ],
        [
            "31.0(87.8)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "30.1(86.2)"
        ],
        [
            "29.0(84.2)"
        ],
        [
            "28.5(83.3)"
        ],
        [
            "33.0(91.4)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "26.4(79.5)"
        ],
        [
            "28.2(82.8)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "27.4(81.3)"
        ],
        [
            "26.4(79.5)"
        ],
        [
            "25.8(78.4)"
        ],
        [
            "26.2(79.2)"
        ],
        [
            "26.2(79.2)"
        ],
        [
            "25.6(78.1)"
        ],
        [
            "24.3(75.7)"
        ],
        [
            "26.2(79.2)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "21.4(70.5)"
        ],
        [
            "21.9(71.4)"
        ],
        [
            "22.9(73.2)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "24.3(75.7)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "22.8(73.0)"
        ],
        [
            "21.7(71.1)"
        ],
        [
            "23.1(73.6)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "18.6(65.5)"
        ],
        [
            "18.8(65.8)"
        ],
        [
            "19.4(66.9)"
        ],
        [
            "20.5(68.9)"
        ],
        [
            "21.0(69.8)"
        ],
        [
            "21.1(70.0)"
        ],
        [
            "20.7(69.3)"
        ],
        [
            "20.5(68.9)"
        ],
        [
            "20.4(68.7)"
        ],
        [
            "20.4(68.7)"
        ],
        [
            "19.9(67.8)"
        ],
        [
            "19.1(66.4)"
        ],
        [
            "20.0(68.0)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "14.8(58.6)"
        ],
        [
            "13.0(55.4)"
        ],
        [
            "13.0(55.4)"
        ],
        [
            "16.0(60.8)"
        ],
        [
            "15.5(59.9)"
        ],
        [
            "15.0(59.0)"
        ],
        [
            "16.0(60.8)"
        ],
        [
            "13.5(56.3)"
        ],
        [
            "15.0(59.0)"
        ],
        [
            "15.0(59.0)"
        ],
        [
            "13.0(55.4)"
        ],
        [
            "13.5(56.3)"
        ],
        [
            "13.0(55.4)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "70.7(2.78)"
        ],
        [
            "63.0(2.48)"
        ],
        [
            "59.0(2.32)"
        ],
        [
            "50.6(1.99)"
        ],
        [
            "196.3(7.73)"
        ],
        [
            "257.6(10.14)"
        ],
        [
            "534.2(21.03)"
        ],
        [
            "474.1(18.67)"
        ],
        [
            "482.8(19.01)"
        ],
        [
            "276.5(10.89)"
        ],
        [
            "264.8(10.43)"
        ],
        [
            "202.3(7.96)"
        ],
        [
            "2,931.9(115.43)"
        ],
        [
            "Average rainy days (≥ 0.1 mm)"
        ],
        [
            "10"
        ],
        [
            "9"
        ],
        [
            "8"
        ],
        [
            "6"
        ],
        [
            "14"
        ],
        [
            "18"
        ],
        [
            "22"
        ],
        [
            "23"
        ],
        [
            "21"
        ],
        [
            "18"
        ],
        [
            "18"
        ],
        [
            "16"
        ],
        [
            "183"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "89"
        ],
        [
            "89"
        ],
        [
            "87"
        ],
        [
            "85"
        ],
        [
            "87"
        ],
        [
            "90"
        ],
        [
            "92"
        ],
        [
            "93"
        ],
        [
            "92"
        ],
        [
            "91"
        ],
        [
            "91"
        ],
        [
            "90"
        ],
        [
            "89"
        ],
        [
            "Source: PAGASA"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TanayYearPop.±% p.a.1903 4,124—    1918 6,704+3.29%1939 8,228+0.98%1948 8,627+0.53%1960 13,955+4.09%1970 23,247+5.23%1975 33,382+7.53%1980 40,443+3.91%1990 58,410+3.75%1995 69,181+3.22%2000 78,223+2.67%2007 94,460+2.64%2010 98,879+1.68%2015 117,830+3.40%2020 139,420+3.36%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Tanay, Rizal, was 139,420 people, with a density of 700 inhabitants per square kilometre or 1,800 inhabitants per square mile."
        ],
        [
            "The majority of the population consists of Tagalogs who live near Laguna de Bay, though there is also a significant percentage of mountain-dwelling people living in the northern portions of the municipality.",
            "The town's major trades consist of fishing, agriculture and regional commerce."
        ],
        [
            "The roots of the Sambalic languages can be traced back to Tanay, where the etymologically similar Sinuana or Remontado Dumagat is still spoken in villages in the Sierra Madre mountains between Sampaloc and General Nakar, Quezon."
        ],
        [
            "Economy"
        ],
        [
            "Tanay’s economy has been boosted by its natural resources and nature’s allure.",
            "There are various activities to try in Tanay, Rizal.",
            "There are adventure camps, glamping campsite, staycation sites, cafe and restaurants with beautiful sceneries, and aesthetic photography sites.",
            "To mention some of them, here are the Different Tourist Spots in Tanay:"
        ],
        [
            "Regina Rica – most Filipinos are Catholics, and this place is one of the best places to go if one want to appreciate the Mother Mary statue and different activities like candle-lighting and pilgrim sites.",
            "Most visitors find the place worth the visit and emotional."
        ],
        [
            "Mount Daraitan and Tinipak River – this tourist spot is for the adventurous ones who love to trek and hike.",
            "The place is also for the nature-wanderers because it features clean waters and majestic sceneries."
        ],
        [
            "Treasure Mountain – it is a spot to appreciate the Sierra Madre Mountain Range and with the right-timing the famous Sea of Clouds of Tanay.",
            "To top it all up, visitors don’t need to hike to go here.",
            "Tents may also be used here for overnight glamping."
        ],
        [
            "Ridges and Clouds Nature Camp – with the right-timing during sunrise, the ridges here can also be seen with a blanket of clouds.",
            "This is a perfect place to reflect and reconnect to nature but not for work-away-from-home because there is no mobile data or WIFI signal here."
        ],
        [
            "Calinawan Cave – this is a historical place in Tanay where Filipinos take refuge during colonization in the past.",
            "Tanay is most commonly known for its mountain ranges but this spot is different.",
            "Calinawan Cave is for the adventurous tourists who also want to enjoy the waters."
        ],
        [
            "Poverty incidence of Tanay"
        ],
        [
            "2.5"
        ],
        [
            "5"
        ],
        [
            "7.5"
        ],
        [
            "10"
        ],
        [
            "12.5"
        ],
        [
            "15"
        ],
        [
            "2006  10.40"
        ],
        [
            "2009  10.54"
        ],
        [
            "2012  10.19"
        ],
        [
            "2015  11.61"
        ],
        [
            "2018  6.37"
        ],
        [
            "2021  5.47"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Political Party"
        ],
        [
            "Gather Votes"
        ],
        [
            "Mayor"
        ],
        [
            "Rafael A. Tanjuatco"
        ],
        [
            "PDP-LABAN"
        ],
        [
            "27,400"
        ],
        [
            "Vice Mayor"
        ],
        [
            "Rex Manuel C. Tanjuatco"
        ],
        [
            "PDP-LABAN"
        ],
        [
            "23,992"
        ],
        [
            "Councilor"
        ],
        [
            "Allan Sacramento"
        ],
        [
            "PDP-LABAN"
        ],
        [
            "27,730"
        ],
        [
            "Councilor"
        ],
        [
            "Ivan Tongohan"
        ],
        [
            "AKSYON"
        ],
        [
            "24,223"
        ],
        [
            "Councilor"
        ],
        [
            "Gel Pitoral"
        ],
        [
            "PFP"
        ],
        [
            "22,997"
        ],
        [
            "Councilor"
        ],
        [
            "Itchie Vergel De Dios"
        ],
        [
            "PFP"
        ],
        [
            "22,459"
        ],
        [
            "Councilor"
        ],
        [
            "Lala De Guzman"
        ],
        [
            "AKSYON"
        ],
        [
            "22,091"
        ],
        [
            "Councilor"
        ],
        [
            "Rommel Magwili"
        ],
        [
            "AKSYON"
        ],
        [
            "21,067"
        ],
        [
            "Councilor"
        ],
        [
            "Bong Ocampo"
        ],
        [
            "Liberal"
        ],
        [
            "20,773"
        ],
        [
            "Councilor"
        ],
        [
            "Aaron Guerrero"
        ],
        [
            "AKSYON"
        ],
        [
            "20,626"
        ],
        [
            "ABC Chairman"
        ],
        [
            "TBF"
        ],
        [
            "TBF"
        ],
        [
            "TBF"
        ],
        [
            "SK President"
        ],
        [
            "TBF"
        ],
        [
            "TBF"
        ],
        [
            "TBF"
        ],
        [
            "The Municipal Council approved the P80+ million budget for the construction of the new municipal building of Tanay.",
            "The lending company will be the Landbank of the Philippines, Tanay Branch.",
            "Certain issues and debates from different sectors and influential names about the construction arose, and still now under public consultation and hearing."
        ],
        [
            "Tanay Rodeo Festival"
        ],
        [
            "To promote and market the town's cattle and agri-eco tourism not only within the municipality but also in the Calabarzon region, the Municipal Government of Tanay holds Tanay Rodeo every third week of January each year.",
            "The festival is also in line with the celebration of Tanay Town Fiesta.",
            "It is participated by professionals and rodeo enthusiasts, and veterinary/animal science students from renowned universities in the country."
        ],
        [
            "References"
        ],
        [
            "^ \"Tanay Hane Festival – Municipality of Tanay, Rizal\".",
            "Tanay.gov.ph.",
            "2015-07-10.",
            "Retrieved 2019-10-26."
        ],
        [
            "^  Municipality of Tanay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Municipality of Tanay, Its Profile\".",
            "Archived from the original on 2007-03-22.",
            "Retrieved 2007-06-20."
        ],
        [
            "^ \"Municipality of Tanay, Its Profile\".",
            "Archived from the original on 2007-03-22.",
            "Retrieved 2007-06-20."
        ],
        [
            "^"
        ],
        [
            "\"Province: Rizal\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Tanay now has 20 barangays\".",
            "Manila Bulletin.",
            "Retrieved 2019-10-26."
        ],
        [
            "^ \"MCGI to March for Greener Environment – Members Church of God International (MCGI) – Official Web Site\".",
            "Archived from the original on 2010-10-09.",
            "Retrieved 2010-10-11."
        ],
        [
            "^ \"UNTVWEB.COM – Programang Ang Dating Daan, ipagdiriwang ang 30th anniversary sa Oct. 10\".",
            "Archived from the original on 2010-10-11.",
            "Retrieved 2010-10-11."
        ],
        [
            "^ \"Tanay, Rizal Climatological Normal Values\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on 18 October 2018.",
            "Retrieved 18 October 2018."
        ],
        [
            "^ \"Tanay, Rizal Climatological Extremes\".",
            "Philippine Atmospheric, Geophysical and Astronomical Services Administration.",
            "Archived from the original on 18 October 2018.",
            "Retrieved 18 October 2018."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region IV-A (Calabarzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region IV-A (Calabarzon)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Rizal\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ About Culture and Arts"
        ],
        [
            "^ \"REGINA RICA: All You Need to Know BEFORE You Go (with Photos)\".",
            "Tripadvisor.",
            "Retrieved 2023-11-03."
        ],
        [
            "^ \"MOUNT DARAITAN & TINIPAK RIVER: All You Need to Know BEFORE You Go (with Photos)\".",
            "Tripadvisor.",
            "Retrieved 2023-11-03."
        ],
        [
            "^ Travel, Klook.",
            "\"Where To Go in Tanay, Rizal: 13 Secret Spots You Need To Check Out – Klook Travel Blog\".",
            "www.klook.com.",
            "Retrieved 2023-11-03."
        ],
        [
            "^ Travel, Klook.",
            "\"Where To Go in Tanay, Rizal: 13 Secret Spots You Need To Check Out – Klook Travel Blog\".",
            "www.klook.com.",
            "Retrieved 2023-11-03."
        ],
        [
            "^ \"Explore Tanay Rizal on your next vacation in Philippines\".",
            "Vacationhive.",
            "2022-04-10.",
            "Retrieved 2023-11-03."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Tourism, Tanay.",
            "\"Tanay Rodeo Festival\".",
            "Municipal Government of Tanay, Rizal.",
            "Retrieved 2016-02-12."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Tanay, Rizal."
        ],
        [
            "Official website"
        ],
        [
            "Tanay Profile at PhilAtlas.com"
        ],
        [
            "TanayGeographic.com: Contains images of Tanay, a phone directory, and other information Archived 2012-04-30 at the Wayback Machine"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Tanay, Rizal"
        ],
        [
            "Antipolo"
        ],
        [
            "TeresaMorongBaras"
        ],
        [
            "Tanay"
        ],
        [
            "General Nakar, Quezon"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "Pililla / Santa Maria, Laguna"
        ],
        [
            "Infanta, Quezon"
        ],
        [
            "vte Province of RizalAntipolo (capital and largest city)Municipalities"
        ],
        [
            "Angono"
        ],
        [
            "Baras"
        ],
        [
            "Binangonan"
        ],
        [
            "Cainta"
        ],
        [
            "Cardona"
        ],
        [
            "Jalajala"
        ],
        [
            "Morong"
        ],
        [
            "Pililla"
        ],
        [
            "Rodriguez"
        ],
        [
            "San Mateo"
        ],
        [
            "Tanay"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Component City"
        ],
        [
            "Antipolo"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tanay,_Rizal&oldid=1232552178\""
        ],
        [
            "Categories: Municipalities of RizalPopulated places on Laguna de BayHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from March 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textPages with Tagalog IPACommons category link from WikidataOfficial website different in Wikidata and WikipediaWebarchive template wayback linksArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}