{
    "name": "Tangcal",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tangcal"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°N 124°E﻿ / ﻿8°N 124°E﻿ / 8; 124"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Lanao del Norte, Philippines"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesTangcalMunicipalityMunicipality of Tangcal"
        ],
        [
            "FlagSealMap of Lanao del Norte with Tangcal highlightedOpenStreetMapTangcalLocation within the PhilippinesCoordinates: 8°N 124°E﻿ / ﻿8°N 124°E﻿ / 8; 124CountryPhilippinesRegionNorthern MindanaoProvinceLanao del NorteDistrict"
        ],
        [
            "2nd districtFoundedJune 16, 1956Barangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorSittie Aisah M. Tomawis • Vice MayorFatima M. Tomawis • RepresentativeSittie Aminah Q. Dimaporo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Saidali S. DiragonSalamat L. MauyagAminollah M. MostariElias M. TondiaNorania L. GagasoJonaid M. LiawaoModa S. DitalMasoud A. Batingolo"
        ],
        [
            " • Electorate8,968 voters (2022)Area"
        ],
        [
            " • Revenue₱ 106.7 million (2020) • Assets₱ 155.2 million (2020) • Expenditure₱ 105.2 million (2020) • Liabilities₱ 8.482 million (2020)Service provider • ElectricityLanao del Norte Electric Cooperative (LANECO)Time zoneUTC+8 (PST)ZIP code9220PSGC103521000IDD : area code +63 (0)63Native languagesMaranao Cebuano Binukid TagalogWebsitewww.tangkal.gov.ph"
        ],
        [
            "Tangcal, officially the Municipality of Tangcal (Maranao: Inged a Tangcal; Cebuano: Lungsod sa Tangcal; Tagalog: Bayan ng Tangcal), is a 5th class municipality in the province of Lanao del Norte, Philippines.",
            "According to the 2020 census, it has a population of 16,075 people."
        ],
        [
            "It is also pronounced as Tangkal."
        ],
        [
            "Geography"
        ],
        [
            "It is located about 51 kilometers in the southwest of Iligan City, the commercial center of Lanao del Norte.",
            "Geographically, Tangcal is bounded by the municipalities of Tubod, Magsaysay and Maigo on the north, Munai on the east, Nunungan on the south, and Magsaysay on the west."
        ],
        [
            "Barangays"
        ],
        [
            "Tangcal is politically subdivided into 18 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Bayabao"
        ],
        [
            "Berwar"
        ],
        [
            "Big Banisilon"
        ],
        [
            "Big Meladoc"
        ],
        [
            "Bubong"
        ],
        [
            "Lamaosa"
        ],
        [
            "Linao"
        ],
        [
            "Lindongan"
        ],
        [
            "Lingco-an"
        ],
        [
            "Papan"
        ],
        [
            "Pelingkingan"
        ],
        [
            "Poblacion"
        ],
        [
            "Poona Kapatagan"
        ],
        [
            "Punod"
        ],
        [
            "Small Banisilon"
        ],
        [
            "Small Meladoc"
        ],
        [
            "Somiorang"
        ],
        [
            "Tangcal Proper"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Tangcal, Lanao del Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "25(77)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "26(80)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "159(6.3)"
        ],
        [
            "143(5.6)"
        ],
        [
            "166(6.5)"
        ],
        [
            "183(7.2)"
        ],
        [
            "357(14.1)"
        ],
        [
            "414(16.3)"
        ],
        [
            "333(13.1)"
        ],
        [
            "309(12.2)"
        ],
        [
            "289(11.4)"
        ],
        [
            "285(11.2)"
        ],
        [
            "253(10.0)"
        ],
        [
            "166(6.5)"
        ],
        [
            "3,057(120.4)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.4"
        ],
        [
            "17.2"
        ],
        [
            "20.6"
        ],
        [
            "23.4"
        ],
        [
            "29.3"
        ],
        [
            "29.2"
        ],
        [
            "29.9"
        ],
        [
            "29.4"
        ],
        [
            "27.7"
        ],
        [
            "28.7"
        ],
        [
            "25.5"
        ],
        [
            "19.9"
        ],
        [
            "299.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(February 2020) (Learn how and when to remove this message)"
        ],
        [
            "In 1956, the barangays of Tangcal, Berowar, Pangao, Tawinian, Lumbac, Lawigadato, Somyorang, Bayabao, Pilingkingan, Ramain, Bagigicon, Lamaosa, Meladoc Big, Meladoc Small and Rarab, then part of Kolambugan, were constituted into the municipal district of Tangcal.",
            "Later on, some barangays of the municipality of Munai were also consolidated."
        ],
        [
            "The Batingolo and Mutia families, the prominent political families in Tangcal are from Munai."
        ],
        [
            "A land portion of Tangcal is elevated.",
            "Coconut and corn were the main agricultural products of the town."
        ],
        [
            "Maranao Traditional Government"
        ],
        [
            "Sultan of Bayabao is the highest traditional position in municipality of Munai and municipality of Tangcal.",
            "Sultan of Bayabao term was originally and honorary given by the Sultan of Bayabao in Ramain, Lanao del Sur to the old-old Datus before as sign of friendship according to the folk story.",
            "As prove, there is name barangay Bayabao in the municipality.",
            "Ramain was the one of the originally govern using Sultan traditional government."
        ],
        [
            "Sultan of Kapatagan is the key figure and state man being the traditional historian of all the families living in munai and tangcal"
        ],
        [
            "Sultan of Adel a Maamor"
        ],
        [
            "Sultan of Linao"
        ],
        [
            "Sultan of Punud"
        ],
        [
            "Sultan of Tangcal Proper"
        ],
        [
            "Sultan of Beruar"
        ],
        [
            "Tribal leader who fought against American invasion"
        ],
        [
            "Datu Mayoma was one of the Moro tribe who held and fight the American soldiers at the time of American invasion.",
            "His remain is in Barangay Linao where he holds and fight with American troops."
        ],
        [
            "During the American escalation the lanao del Norte, Datu Mayoma had learned that the American troops were going direction to Tangcal, then he goes to the middle of mountain they called it now Barangay Linao to deck for his small Camp.",
            "Few days later, American troops are now reached barangay Linao where small Camp Datu Mayoma located and he is there alone and waiting them."
        ],
        [
            "According to the old elders story, Datu Mayoma made a traditional ceremonial first (Sagayan in maranao term) before he start to fight against American troops, however and on other hand, easy to the American troops to kill him since ceremonial takes almost an hour, for that when he starts to strike using his sword aiming to the American soldiers, on process they just fire at him because they are ready and watching."
        ],
        [
            "Community Practice before Martial Law"
        ],
        [
            "Tangcal before was one of the very peaceful municipality in Lanao del Norte.",
            "Muslim (Maranao Tribe) and Non-Muslim (Christian) they live together as one Community.",
            "Most of the Muslim Male married with Christian Female, and their children are peacefully live together.",
            "There is Traders Market where Muslims from interior areas and Christians from urvan areas particular in Kolambugan exchange their goods and traditional items."
        ],
        [
            "There was a Christian church build in Barangay Small Banisilon but it was destroyed during Martial Law.",
            "There was a schedule of Disco Club gatherings \"Baylehan in bisaya term\" where all young ladies and young gentlemen including their parents were they meet together just for exchange of cultural and social life.",
            "There was also a Contest Competition Program for Mister and Miss of Municipality of Tangcal, which one of the contestant that time who won for Miss Tangcal is Sittie Fatima Mangansan Mutia-Tomawis a Municipal Mayor of Tangcal."
        ],
        [
            "However and suddenly, all the practices has been totally stopped when Late Aleem Ansari Mangansan Mutia an Elder Brother of Mayor Sittie Fatima Mangansan Mutia-Tomawis who came from abroad for Islamic Study.",
            "Aleem Anshari had advised his Sisters and Brothers and announced in the Public Mosque that those practices (Disco and Mister and Miss Tangcal) are \"Sin\" to Islam."
        ],
        [
            "Collecting of Land Tax"
        ],
        [
            "Majority people living in Tangcal were happy because of the simple living because they do not have any worry at all just can eat any food every day, but, they have panic when the land have taxes."
        ],
        [
            "When then President Diosdao Macapagal signed the Land Reform Law to have tax from the Land.",
            "In Tangcal there are so many Land Lords but just few Land Lords could provide tax for their lands.",
            "On the first process of collecting taxes, sometimes the land lords give the livestock, food, crops just to pay their obligation, however and later soon, the landlords has divided their land to children's, close relatives do not have enough lands and even helpers and workers just to accommodate the paying of much land taxes."
        ],
        [
            "Folk History of Mutia Family"
        ],
        [
            "Originally and before Spain Invasion and later American Invasion, the tradition of the Maranao Tribe Leaders is to have workers “personal helpers” or BISAYA in maranao term (no salary but only shelter and protection).",
            "They usually cross the beach of municipality of Kolambugan to beach of Ozamis City by boat to catch food or a people living in other side land and make them as workers “personal helpers” or BISAYA."
        ],
        [
            "There is a claim story from old maranao tribe leaders that there are Seven (7) Son of Tribe Leader name Datu Mutia living in the interior area in Lanao del Norte.",
            "They go out and cross the sea between Kolambugan and Ozamis City to search and catch human in order to become their own workers' “personal helpers” or BISAYA, however, after long time of searching six (6) of them have return but one of them did not and stay."
        ],
        [
            "On other hand, there was a claim story that Mutia Families in Zamboanga del Norte and Misamis Occidental has originally blood from the people living in Interior area in Lanao del Norte, and even now the claim is still existing because of their great-great-great grandfather of great-great grandfather of Mutia Families in Zamboanga del Norte and Misamis Occidental has lifted a one small piece of book hanging in the center of the big house and told to his children the book is forbidden and do not touch it or even to it, however and long for many years when somebody open “because of their confusion why the book is forbidden” they saw writing inside the book but not familiar language or letters (Spanish language, English language), and some say that the drawings or the direction of letters are near to Arabic letters."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TangcalYearPop.±% p.a.1960 5,338—    1970 6,309+1.68%1975 12,140+14.03%1980 3,928−20.20%1990 4,439+1.23%1995 4,904+1.88%2000 6,117+4.85%2007 9,351+6.03%2010 12,588+11.42%2015 15,181+3.63%2020 16,075+1.13%Source: Philippine Statistics Authority"
        ],
        [
            "Majority of people living in Tangcal are all Maranao tribe and they are supporters of MILF and MNLF.",
            "All the social life and justices are always refer to MILF and MNLF rules \"Sharia Law\""
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tangcal"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "70"
        ],
        [
            "80"
        ],
        [
            "2006  50.50"
        ],
        [
            "2009  67.36"
        ],
        [
            "2012  79.32"
        ],
        [
            "2015  65.90"
        ],
        [
            "2018  44.07"
        ],
        [
            "2021  56.33"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "List of local products"
        ],
        [
            "Corn"
        ],
        [
            "Coconut"
        ],
        [
            "Lumber"
        ],
        [
            "Livestock"
        ],
        [
            "Falcata"
        ],
        [
            "Banana"
        ],
        [
            "Government"
        ],
        [
            "Elected officials 2022–present:"
        ],
        [
            "Municipal Mayor: Sittie Aisah Mutia Tomawis - Adiong"
        ],
        [
            "Vice Mayor: Fatima Mangansan Mutia - Tomawis"
        ],
        [
            "Sangguniang Bayan:"
        ],
        [
            "Saidali Diragon"
        ],
        [
            "Salamat Mauyag"
        ],
        [
            "Jonaid Liawao"
        ],
        [
            "Elias Tondia"
        ],
        [
            "Norania Gagaso"
        ],
        [
            "Aminollah Mostari"
        ],
        [
            "Moda Dital"
        ],
        [
            "Soud Batingolo"
        ],
        [
            "ABC President: Abalos Mapandi Macondara"
        ],
        [
            "SB Secretary: Mr. Camilo Batingulo"
        ],
        [
            "List of former executives"
        ],
        [
            "Mayors after People Power Revolution 1986:"
        ],
        [
            "1987 - 1989, OIC Mayor Fataq Mapandi"
        ],
        [
            "1989 - 1992, Mamalampac Mangansan Mutia"
        ],
        [
            "1992 - 1995, Mamalampac Mangansan Mutia"
        ],
        [
            "1995 - 1998, Mamalampac Mangansan Mutia"
        ],
        [
            "1998 - 2001, Alex Mapandi"
        ],
        [
            "2001 - 2004, Abdulaziz Mutia Batingolo"
        ],
        [
            "2004 - 2007, Abdulaziz Mutia Batingolo"
        ],
        [
            "2007 - 2010, Abdulaziz Mutia Batingolo"
        ],
        [
            "2010 - 2013, Aisha Batingolo"
        ],
        [
            "2013 - 2016, Fatima Mutia Tomawis"
        ],
        [
            "2016 -2022, Fatima Mutia Tomawis"
        ],
        [
            "2022 -present, Sittie Aisah Mutia Tomawis-Adiong"
        ],
        [
            "Vice Mayors after People Power Revolution 1986:"
        ],
        [
            "1987 - 1989, OIC Baraguir Diragon"
        ],
        [
            "1989 - 1992,"
        ],
        [
            "1992 - 1995, Usman"
        ],
        [
            "1995 - 1998, Solaiman Liawao"
        ],
        [
            "1998 - 2001, Kiram Mutia"
        ],
        [
            "2001 - 2004, Kiram Mutia"
        ],
        [
            "2004 - 2010, Mamintal Sedic"
        ],
        [
            "2013 - 2016, Dardagan Maliawao"
        ],
        [
            "2016 - 2022, Dardagan Maliawao"
        ],
        [
            "2022 -present, Fatima Mutia Tomawis"
        ],
        [
            "Tourism"
        ],
        [
            "Kendis River"
        ],
        [
            "Piyamunitan River"
        ],
        [
            "Titunod River"
        ],
        [
            "Linao River"
        ],
        [
            "Banisilon River"
        ],
        [
            "Lindongan River"
        ],
        [
            "Education"
        ],
        [
            "Banisilon Elementary School"
        ],
        [
            "Beruar Integrated School"
        ],
        [
            "Big Banisilon Integrated School"
        ],
        [
            "Pelingkingan Integrated School"
        ],
        [
            "Somiorang Elementary School"
        ],
        [
            "Tangkal Proper Elementary School"
        ],
        [
            "Tangcal National High School"
        ],
        [
            "Sultan Mimbisa Primary School"
        ],
        [
            "Bayabao Primary School"
        ],
        [
            "Sultan Lindongan Primary School"
        ],
        [
            "Lingco-an Primary School"
        ],
        [
            "Lamausa Primary School"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Tangcal |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Tangcal: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 6 February 2020."
        ],
        [
            "^ \"An Act Creating the Municipal District of Tangcal in the Province of Lanao\".",
            "thecorpusjuris.com.",
            "16 June 1956.",
            "Retrieved 2021-09-22."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Lanao del Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Tangcal Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Official site of Tangcal"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Tangcal"
        ],
        [
            "Magsaysay"
        ],
        [
            "Maigo"
        ],
        [
            "Pantao Ragat"
        ],
        [
            "Tubod"
        ],
        [
            "Tangcal"
        ],
        [
            "Munai"
        ],
        [
            "Salvador"
        ],
        [
            "Nunungan"
        ],
        [
            "Madamba, Lanao del Sur"
        ],
        [
            "vte Province of Lanao del NorteTubod (capital)  Iligan (largest city)Municipalities"
        ],
        [
            "Bacolod"
        ],
        [
            "Baloi"
        ],
        [
            "Baroy"
        ],
        [
            "Kapatagan"
        ],
        [
            "Kauswagan"
        ],
        [
            "Kolambugan"
        ],
        [
            "Lala"
        ],
        [
            "Linamon"
        ],
        [
            "Magsaysay"
        ],
        [
            "Maigo"
        ],
        [
            "Matungao"
        ],
        [
            "Munai"
        ],
        [
            "Nunungan"
        ],
        [
            "Pantao Ragat"
        ],
        [
            "Pantar"
        ],
        [
            "Poona Piagapo"
        ],
        [
            "Salvador"
        ],
        [
            "Sapad"
        ],
        [
            "Sultan Naga Dimaporo"
        ],
        [
            "Tagoloan"
        ],
        [
            "Tangcal"
        ],
        [
            "Tubod"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iligan (Administratively independent from the province but grouped under Lanao del Norte by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tangcal&oldid=1177907806\""
        ],
        [
            "Category: Municipalities of Lanao del NorteHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textArticles needing additional references from February 2020All articles needing additional referencesPages using the Kartographer extension"
        ]
    ]
}