{
    "name": "Tibiao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tibiao"
        ],
        [
            "21 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°17′21″N 122°02′03″E﻿ / ﻿11.2892°N 122.0342°E﻿ / 11.2892; 122.0342"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Antique, Philippines"
        ],
        [
            "Municipality in Western Visayas, PhilippinesTibiaoMunicipalityMunicipality of TibiaoTibiao Rice Terraces"
        ],
        [
            "FlagMap of Antique with Tibiao highlightedOpenStreetMapTibiaoLocation within the PhilippinesCoordinates: 11°17′21″N 122°02′03″E﻿ / ﻿11.2892°N 122.0342°E﻿ / 11.2892; 122.0342CountryPhilippinesRegionWestern VisayasProvinceAntiqueDistrict"
        ],
        [
            "Lone districtBarangays21"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorKlemens G. Bandoja • Vice MayorJimmy D. Barrientos • RepresentativeAnthony Agapito B. Legarda • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Gil B. BandojaCheng M. ModestoLucas F. Bandoja Jr.Amador M. CumlaRandy G. BuenafeFred F. EragaPelver Y. MedinaXz G. Lim"
        ],
        [
            " • Electorate18,121 voters (2022)Area • Revenue₱ 137.2 million (2020) • Assets₱ 343.8 million (2020) • Expenditure₱ 100.7 million (2020) • Liabilities₱ 145.3 million (2020)Service provider • ElectricityAntique Electric Cooperative (ANTECO)Time zoneUTC+8 (PST)ZIP code5707PSGC060617000IDD : area code +63 (0)36Native languagesKaray-a Hiligaynon Tagalog"
        ],
        [
            "Tibiao, officially the Municipality of Tibiao (Kinaray-a: Banwa kang Tibiao; Hiligaynon: Banwa sang Tibiao; Tagalog: Bayan ng Tibiao),  is a 4th class municipality in the province of Antique, Philippines.",
            "According to the 2020 census, it has a population of 28,703 people."
        ],
        [
            "History"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Tibiao\" – news · newspapers · books · scholar · JSTOR (January 2021) (Learn how and when to remove this message)This article is written like a personal reflection, personal essay, or argumentative essay that states a Wikipedia editor's personal feelings or presents an original argument about a topic.",
            "Please help improve it by rewriting it in an encyclopedic style.",
            "(October 2020) (Learn how and when to remove this message)"
        ],
        [
            "This article needs to be updated.",
            "Please help update this article to reflect recent events or newly available information.",
            "(November 2023)"
        ],
        [
            "During the Spanish times in the Philippines, Spanish soldiers encountered a group of natives in hatay hatay, a watery and miry land.",
            "They asked the natives the name of the place, pointing to the vast expanse of land covered with tall reed grasses called tigbaw.",
            "The natives, who thought the Spaniards were pertaining to the name of the grass, answered Tigbaw.",
            "It is near the edge of the present-day Tibiao River (sa Tibí Kang subâ).",
            "Sojourners to the place would comment: Tibi haw?",
            "It is a question asking why they locate themselves at the edge of the river.",
            "The term tibí haw eventually evolved into Tibiao.",
            "Since then the place was called Tibiao.",
            "Allegedly, the Spaniards had difficulty pronouncing the word Tigbaw."
        ],
        [
            "The old settlement was in present-day Balanti-an.",
            "The natives had to relocate to the said place, since it was secluded and distant from the shore, and it was secure from piratical raids which were common during those days."
        ],
        [
            "Tibiao was part of Nalupa from 1596 to 1840.",
            "Nalupa, with its central government in present-day Jinalinan controlled the area of what is now Tibiao, Barbaza, and Laua-an.",
            "In early 1730, Nalupa gradually depopulated due to the Moro pirate attacks.",
            "By 1733, Culasi had direct control of Nalupa and Pandan.",
            "In 1796, Nalupa ceded from Culasi.",
            "As an arrabal, notable village chieftains were Paris, Oguid Pagsuguiron, and Nicolas Amar (1818)."
        ],
        [
            "In 1786, Oguid Datu Oguid landed in the shores of Calawgan Creek.",
            "He brought with him his family and settlers from an unspecified place in Borneo, presumably from a place where Kinaray-a is the lingua franca."
        ],
        [
            "On August 6, 1786, Oguid and his followers settled in, what is now, Kamyabsan or a place of guavas.",
            "Kamyabsan is now part of Sawang Sitio in Malabor.",
            "The site was near the shore and accessible to pirate raids.",
            "They later transferred to Balanti-an to coexist with the natives.",
            "When Datu Oguid arrived in Balanti-an, he was confronted by the \"Tumandoks\" but could not understand each other.",
            "In exchange, Datu Oguid offered foods to become acquainted with them which was termed Panguyang or Padu-um."
        ],
        [
            "In 1815, Oguid sent a delegation to Nalupa to petition the Governor of Antique, Rafael Andres Gomez, to make Tibiao a new town separating from Nalupa.",
            "The petition was granted."
        ],
        [
            "On January 1, 1818, Tibiao became a new town with Don Nicolas Amar as Teniente Municipal.",
            "The Governor of Antique that time was Juan Ormido while the Teniente Municipal of Nalupa was a certain Vislilla.",
            "Tibiao remained as a vista of Nalupa."
        ],
        [
            "In 1826, Oguid ceased to be the Teniente Municipal of Tibiao but continued to manage the town's affairs.",
            "On May 2, 1926, he convened a meeting where it was decided to hold a Thanksgiving celebration and construct a church in their settlement.",
            "The church, measuring 20x10x4 yards, featured thatched palm leaf roofing and walls made of wooden slabs, while Juan Mariano served as the Teniente Municipal at the time."
        ],
        [
            "On November 1, 1826, Oguid and Governor Martinez erected a cross on a mountain east of the settlement, now known as Mount Cruz, to mark the occasion.",
            "The following day, a Thanksgiving mass, mass wedding, and baptism took place.",
            "On November 6, 1828, Oguid selected five men to survey the proposed new town site, which was situated between Calaugan and Palaypay creeks.",
            "Juan Amar Sarcino drafted the town plan, and development began immediately, overseen by Mariano Delos Santos, the Teniente Municipal, and Governor Francisco Oreta."
        ],
        [
            "The Parish of Tibiao was established by Augustinian missionaries in 1849, and in 1851, Filipino priest Fr.",
            "Eulogio \"Oloy\" Cardones became the parish priest, coming from Manduariao, Iloilo.",
            "His arrival was celebrated with a fiesta and a Panguyang, marking Tibiao's independence.",
            "Pedro Bandoja, later known as Bandong, led the local revolutionary movement in 1898, while in 1930, Nicolas Amarillo was re-elected Municipal President, initiating developments such as the construction of the Tibiao Central School with the aid of Rep. Segundo Moscoso."
        ],
        [
            "Before the end of Nicolas Amarillo's second term in 1935, he sought Governor Alejandro Lim's assistance in negotiating with the Bishop of Jaro for a church property to be used as the Municipal Building.",
            "Alejandro Tario Lim, who served as Governor of the province and Justice of the Peace of Tibiao, oversaw the construction of the Municipal Plaza and Municipal Building during his term, demonstrating his dedication to the town's development.During World War II, Tibiao faced significant upheaval as Japanese forces burned down the church, municipal building, and bridge on April 19, 1942.",
            "Lt. Absalon appointed Martin Juanillo as Mayor of Tibiao on September 3, 1942, followed by Jose Mendoza Sr.'s appointment by Pio Dioso on November 13, 1942.",
            "As the conflict escalated, Japanese patrols penetrated Tibiao on June 16, 1943, amidst the chaos, with Heriberto Bandoja subsequently appointed as municipal mayor on December 11, 1944, by Calixto Zaldivar."
        ],
        [
            "In 1948, Diodata Tario Lim Bandoja was elected as municipal mayor of Tibiao, sister of the former governor of the province, Gov.",
            "Alejandro T. Lim Sr, Tating is only elementary graduate.",
            "All her siblings were UP College Graduates.",
            "She was made to stop her education to take care of her parents.",
            "But she knew the importance of education so she donated eight hectares land and 40,000php for a school building.",
            "It was named Tario - Lim Memorial High school now University of Antique Tario Lim Memorial Campus in honor of her parents, Vicente \"Quin\" Sanches Lim and Maria Amar Tario."
        ],
        [
            "In 1950, nineteen Huks were sighted in Dalanas.",
            "Soldiers of the Philippines Ground Force were detailed to Tibiao to fight the Huks.",
            "The Municipal Mayor Diodata Tario Lim Bandoja appointed four members of the local police named Manuel Bankaya, Conrado Antonio, Alejandro Amar and Samson Amar.",
            "They caught the eighteen Huks whose commander was Alyas 120."
        ],
        [
            "In 1956, Federico Ruiz Elected as Municipal Mayor of Tibiao.",
            "He donated six hectares land of their cane land.",
            "Through the help of Tobias Fornier and Diodata Lim Bandoja they established the Tario - Lim Memorial Antique School of Fisheries."
        ],
        [
            "In 1960, Remegio Vista represented the country in Mexico Summer Olympics.",
            "His burst of speed was noticed he was dubbed as \"The Fastest Man\" in the first 50 meters of the sprint races."
        ],
        [
            "Mylene Miciano was crowned Lin-ay Kang Antique from Tibiao in 1976, followed by Mary Jane Jereza in 1982.",
            "Carol Josette Cardos received the honor in 1997, while Quennie Bandoja earned the prestigious title in 1999.",
            "In 2003, Krishna Constantino was honored as Lin-ay Kang Antique from Tibiao, continuing the tradition of celebrating the town's beauty and culture.",
            "The tradition persisted into 2011, when Mary Kris Gualberto achieved the esteemed title.",
            "In December 2012, Gracechele Mae Managuit was crowned Lin-ay Kang Antique from Tibiao."
        ],
        [
            "In 1981, Manuel M. Lim Jr. became the youngest mayor of Tibiao at the age of 26.",
            "He was the grandson of former Mayor Diodata Tario Lim Bandoja.",
            "Mayor Nonie, as he was known, served as the town's doctor and, with the help of the Philippine Army, eliminated three commanders and members of the New People's Army in the mountains of Tibiao.",
            "In 1997, Tibiao hosted the First Philippine International Whitewater Kayaking Cup, which attracted participants from 11 countries, showcasing the beauty and adventure of Tibiao River"
        ],
        [
            "In 2012, during the term of Walden M. Lim, Tibiao Eco Adventure Park (TEA PARK) was inaugurated.",
            "In the same year Tibiao was honored as the Tourism Capital of Antique.",
            "In 2013, Gil Baldevia Bandoja, the grandson of former Mayor Felimon Bandoja and son of former Mayor Heriberto Bandoja, was elected mayor of Tibiao.",
            "He served with distinction and was re-elected in both 2016 and 2019, highlighting his enduring popularity and effective leadership.",
            "Following his tenure, Klemens G. Bandoja succeeded him, inheriting the responsibility of leading Tibiao into its next chapter of development and progress."
        ],
        [
            "Geography"
        ],
        [
            "Tibiao is located 75 kilometres (47 mi) from the provincial capital of Antique, San Jose de Buenavista."
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 177.42 square kilometres (68.50 sq mi)  constituting 6.50% of the 2,729.17-square-kilometre- (1,053.74 sq mi) total area of Antique."
        ],
        [
            "Seco Island, over 21 nautical miles offshore, is a 1.5 km sandbar visited by tourists."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Tibiao, Antique"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "64(2.5)"
        ],
        [
            "44(1.7)"
        ],
        [
            "58(2.3)"
        ],
        [
            "83(3.3)"
        ],
        [
            "204(8.0)"
        ],
        [
            "304(12.0)"
        ],
        [
            "334(13.1)"
        ],
        [
            "291(11.5)"
        ],
        [
            "310(12.2)"
        ],
        [
            "281(11.1)"
        ],
        [
            "172(6.8)"
        ],
        [
            "97(3.8)"
        ],
        [
            "2,242(88.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.5"
        ],
        [
            "8.9"
        ],
        [
            "11.3"
        ],
        [
            "14.1"
        ],
        [
            "24.2"
        ],
        [
            "28.0"
        ],
        [
            "29.6"
        ],
        [
            "28.2"
        ],
        [
            "28.1"
        ],
        [
            "28.1"
        ],
        [
            "20.2"
        ],
        [
            "15.2"
        ],
        [
            "248.4"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Tibiao is politically subdivided into 21 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 060617001   Alegre (Lawihaw)"
        ],
        [
            " 1.0%"
        ],
        [
            " 280"
        ],
        [
            " 268"
        ],
        [
            "  ▴"
        ],
        [
            " 0.44%"
        ],
        [
            " 060617002   Amar (Sangyadan)"
        ],
        [
            " 3.6%"
        ],
        [
            " 1,025"
        ],
        [
            " 857"
        ],
        [
            "  ▴"
        ],
        [
            " 1.81%"
        ],
        [
            " 060617003   Bandoja (Lupa-an)"
        ],
        [
            " 2.2%"
        ],
        [
            " 618"
        ],
        [
            " 627"
        ],
        [
            "  ▾"
        ],
        [
            " −0.14%"
        ],
        [
            " 060617004   Castillo (Igtonarum)"
        ],
        [
            " 0.6%"
        ],
        [
            " 182"
        ],
        [
            " 152"
        ],
        [
            "  ▴"
        ],
        [
            " 1.82%"
        ],
        [
            " 060617005   Esparagoza (Ungyon)"
        ],
        [
            " 1.4%"
        ],
        [
            " 414"
        ],
        [
            " 507"
        ],
        [
            "  ▾"
        ],
        [
            " −2.01%"
        ],
        [
            " 060617006   Importante (Balantian)"
        ],
        [
            " 4.6%"
        ],
        [
            " 1,322"
        ],
        [
            " 1,086"
        ],
        [
            "  ▴"
        ],
        [
            " 1.99%"
        ],
        [
            " 060617007   La Paz (Langawon)"
        ],
        [
            " 4.6%"
        ],
        [
            " 1,316"
        ],
        [
            " 1,258"
        ],
        [
            "  ▴"
        ],
        [
            " 0.45%"
        ],
        [
            " 060617008   Malabor (Burok Burok)"
        ],
        [
            " 12.5%"
        ],
        [
            " 3,602"
        ],
        [
            " 2,739"
        ],
        [
            "  ▴"
        ],
        [
            " 2.78%"
        ],
        [
            " 060617009   Martinez (Lamnugan)"
        ],
        [
            " 6.6%"
        ],
        [
            " 1,896"
        ],
        [
            " 1,891"
        ],
        [
            "  ▴"
        ],
        [
            " 0.03%"
        ],
        [
            " 060617010   Natividad (Kulangi)"
        ],
        [
            " 3.2%"
        ],
        [
            " 921"
        ],
        [
            " 718"
        ],
        [
            "  ▴"
        ],
        [
            " 2.52%"
        ],
        [
            " 060617011   Pitac (San Dionisio)"
        ],
        [
            " 4.3%"
        ],
        [
            " 1,228"
        ],
        [
            " 1,264"
        ],
        [
            "  ▾"
        ],
        [
            " −0.29%"
        ],
        [
            " 060617012  Poblacion"
        ],
        [
            " 13.4%"
        ],
        [
            " 3,850"
        ],
        [
            " 3,624"
        ],
        [
            "  ▴"
        ],
        [
            " 0.61%"
        ],
        [
            " 060617013   Salazar (Mamara/Hinonghinong)"
        ],
        [
            " 2.0%"
        ],
        [
            " 585"
        ],
        [
            " 567"
        ],
        [
            "  ▴"
        ],
        [
            " 0.31%"
        ],
        [
            " 060617014   San Francisco Norte (Tumangtang)"
        ],
        [
            " 5.9%"
        ],
        [
            " 1,690"
        ],
        [
            " 1,519"
        ],
        [
            "  ▴"
        ],
        [
            " 1.07%"
        ],
        [
            " 060617015   San Francisco Sur (Butarog)"
        ],
        [
            " 6.2%"
        ],
        [
            " 1,776"
        ],
        [
            " 1,537"
        ],
        [
            "  ▴"
        ],
        [
            " 1.46%"
        ],
        [
            " 060617016   San Isidro (Gingay)"
        ],
        [
            " 3.9%"
        ],
        [
            " 1,126"
        ],
        [
            " 1,075"
        ],
        [
            "  ▴"
        ],
        [
            " 0.46%"
        ],
        [
            " 060617017   Santa Ana (Payatpat)"
        ],
        [
            " 2.1%"
        ],
        [
            " 598"
        ],
        [
            " 593"
        ],
        [
            "  ▴"
        ],
        [
            " 0.08%"
        ],
        [
            " 060617018   Santa Justa (Kubay)"
        ],
        [
            " 4.8%"
        ],
        [
            " 1,365"
        ],
        [
            " 1,351"
        ],
        [
            "  ▴"
        ],
        [
            " 0.10%"
        ],
        [
            " 060617019   Santo Rosario (Karapunan)"
        ],
        [
            " 3.7%"
        ],
        [
            " 1,061"
        ],
        [
            " 1,042"
        ],
        [
            "  ▴"
        ],
        [
            " 0.18%"
        ],
        [
            " 060617020   Tigbaboy"
        ],
        [
            " 1.3%"
        ],
        [
            " 379"
        ],
        [
            " 336"
        ],
        [
            "  ▴"
        ],
        [
            " 1.21%"
        ],
        [
            " 060617021   Tuno"
        ],
        [
            " 5.3%"
        ],
        [
            " 1,514"
        ],
        [
            " 1,502"
        ],
        [
            "  ▴"
        ],
        [
            " 0.08%"
        ],
        [
            "Total"
        ],
        [
            "28,703"
        ],
        [
            "24,513"
        ],
        [
            " ▴"
        ],
        [
            "1.59%"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TibiaoYearPop.±% p.a.1903 7,482—    1918 8,989+1.23%1939 10,830+0.89%1948 13,321+2.33%1960 11,879−0.95%1970 14,280+1.86%1975 15,935+2.22%1980 17,200+1.54%1990 20,192+1.62%1995 19,628−0.53%2000 21,772+2.25%2007 23,228+0.90%2010 24,513+1.98%2015 26,748+1.68%2020 28,703+1.40%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Tibiao had a population of 28,703.",
            "The population density was 160 inhabitants per square kilometre (410/sq mi)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tibiao"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  31.70"
        ],
        [
            "2009  49.57"
        ],
        [
            "2012  22.18"
        ],
        [
            "2015  20.92"
        ],
        [
            "2018  20.70"
        ],
        [
            "2021  31.27"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism"
        ],
        [
            "Tibiao is dubbed the Eco-Adventure Capital of Panay Island.",
            "It offers various adventure activities such as trekking to Bugtong Bato Fall, kayaking and river tubing in Tibiao River, and cultural immersion tour to Antique Rice Terraces."
        ],
        [
            "Notable personalities"
        ],
        [
            "Alfredo Siojo Lim, former Senator and former Mayor of City of Manila.",
            "He is the son of Quintin Tario Lim Sr."
        ],
        [
            "Remegio Vicente Vista, a Filipino Sprinter Representative of his own country, Gold Medalist in Jakarta, the Tokyo Asian Games and Mexico Summer Olympics.",
            "He dubbed as the fastest man in Asia during his time.",
            "Born in a depressed mountain barangay of Salazar, Tibiao, Antique."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Tibiao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Antique\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ Garcia, Jennifer.",
            "\"Discover Seco Island, Antique's hidden paradise\".",
            "ABS-CBN News.",
            "ABS-CBN.",
            "Retrieved 20 July 2018."
        ],
        [
            "^"
        ],
        [
            "\"Tibiao: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 1 May 2020."
        ],
        [
            "^ \"Municipal: Tibiao\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VI (Western Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Antique\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Tibiao (Antique): Travel Guide + Day Trip Activities\".",
            "Tara Lets Anywhere.",
            "2015-12-26.",
            "Retrieved 2020-07-19."
        ],
        [
            "^ Calawag, Flord Nicson (2015-09-14).",
            "\"Rice terraces 'rediscovered' in Antique\".",
            "INQUIRER.net.",
            "Retrieved 2020-07-19."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Tibiao."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Tibiao Travel Guide"
        ],
        [
            "Places adjacent to Tibiao"
        ],
        [
            "Culasi"
        ],
        [
            "Sulu Sea"
        ],
        [
            "Tibiao"
        ],
        [
            "Tapaz, Capiz"
        ],
        [
            "Barbaza"
        ],
        [
            "Jamindan, Capiz"
        ],
        [
            "vte Province of AntiqueSan Jose de Buenavista (capital and largest municipality)Municipalities"
        ],
        [
            "Anini-y"
        ],
        [
            "Barbaza"
        ],
        [
            "Belison"
        ],
        [
            "Bugasong"
        ],
        [
            "Caluya"
        ],
        [
            "Culasi"
        ],
        [
            "Hamtic"
        ],
        [
            "Laua-an"
        ],
        [
            "Libertad"
        ],
        [
            "Pandan"
        ],
        [
            "Patnongon"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "San Remigio"
        ],
        [
            "Sebaste"
        ],
        [
            "Sibalom"
        ],
        [
            "Tibiao"
        ],
        [
            "Tobias Fornier"
        ],
        [
            "Valderrama"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tibiao&oldid=1211720035\""
        ],
        [
            "Category: Municipalities of Antique (province)Hidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Kinaray-a-language textArticles containing Hiligaynon-language textArticles containing Tagalog-language textArticles needing additional references from January 2021All articles needing additional referencesWikipedia articles with style issues from October 2020All articles with style issuesWikipedia articles in need of updating from November 2023All Wikipedia articles in need of updatingArticles needing more detailed referencesCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}