{
    "name": "Tigaon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tigaon, Camarines Sur"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisBahasa HulontaloIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°37′55″N 123°29′51″E﻿ / ﻿13.6319°N 123.4975°E﻿ / 13.6319; 123.4975"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Camarines Sur, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Tigaon, Camarines Sur\" – news · newspapers · books · scholar · JSTOR (January 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Bicol Region, PhilippinesTigaonMunicipalityMunicipality of Tigaon"
        ],
        [
            "FlagMap of Camarines Sur with Tigaon highlightedOpenStreetMapTigaonLocation within the PhilippinesCoordinates: 13°37′55″N 123°29′51″E﻿ / ﻿13.6319°N 123.4975°E﻿ / 13.6319; 123.4975CountryPhilippinesRegionBicol RegionProvinceCamarines SurDistrict"
        ],
        [
            "4th districtBarangays23"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorPamela Rinah B. Fuentebella • Vice MayorClaro F. Llaguno • RepresentativeArnulf Bryan B. Fuentebella • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Jerome T. LelisMa.",
            "Carla S. PilapilSaturnino R. Sanoy Jr.Ruel D. CamatoIryn F. PeloAllan P. ClariñoRuel M. San GasparTeudulfo B. Espinosa Sr."
        ],
        [
            " • Electorate39,355 voters (2022)Area"
        ],
        [
            " • Revenue₱ 217.1 million (2020) • Assets₱ 441.1 million (2020) • Expenditure₱ 159.8 million (2020) • Liabilities₱ 75.03 million (2020)Service provider • ElectricityCamarines Sur 4 Electric Cooperative  (CASURECO 4)Time zoneUTC+8 (PST)ZIP code4420PSGC051736000IDD : area code +63 (0)54Native languagesCentral BikolTagalogWebsitewww.tigaon.gov.ph"
        ],
        [
            "Tigaon, officially the Municipality of Tigaon (Central Bikol: Banwaan kan Tigaon; Tagalog: Bayan ng Tigaon), is a 2nd class municipality in the province of Camarines Sur, Philippines.",
            "According to the 2020 census, it has a population of 60,524 people."
        ],
        [
            "It is in the eastern part of the province of Camarines Sur, between Mount Isarog and Lagonoy Gulf, and occupies a total land area of 12,575 ha., 80% of which is flat.",
            "Of these, 1,045 hectare are irrigated riceland."
        ],
        [
            "Tigaon's economy is based on agricultural products like rice, corn, sugar cane, abaca fiber, fish, and pork.",
            "It is also known for its cottage industry, especially high-quality ships-in-bottles.",
            "The main tourist attractions are the Mt.",
            "Isarog Jungle Park at Barangay Concocep and several beach resorts."
        ],
        [
            "History"
        ],
        [
            "According to a certain parish priest, Fr.",
            "Marcos de Lisboa, the name of the town was attributed to the word \"tigaw\", a shrub that grew in abundance on the riverbanks, and whose leaves when pounded produced extracts which were used as poison to catch fish in rivers and swamps."
        ],
        [
            "Spanish Colonial Era"
        ],
        [
            "The Bicol Peninsula was first sighted by the Spaniards in August 1543 aboard the San Juan de Letran.",
            "In 1574, Captain Juan de Salcedo conquered the Bicol Region.",
            "In 1701, Tigaon was considered a sitio of Sagñay.",
            "In 1794, Tigaon was given her own parish under Fray Jose de Buensalida who carried the mission of St. Clare of Assisi, marking August 12 as her feast day."
        ],
        [
            "Mayon Volcano's eruption in 1834 started a wave of migration from the neighboring province of Albay to the rich verdant slopes of Tigaon.",
            "As the Sword and the Cross became the bedrock of Spanish colonization in the Philippines, the parish priest symbolized the King of Spain and wielded immense power.",
            "This resulted in turmoil and continuous revolts against the atrocities of Spanish rule, thereby leading to the Philippine Revolution of 1898.",
            "For $20,000,000.00, Spain ceded the Philippines to the Americans."
        ],
        [
            "In the early years of the 19th century, Camarines Sur was divided into four districts by the Spaniards.",
            "This division include the districts of Bikol, Rinconanda, Yraya and Mambulao.",
            "The mission of Tigaon in the part of Mount Isarog belonged to the Bikol district."
        ],
        [
            "The history of this town, according to written accounts, was considered to be confusing as there are conflicting records with regards to its establishment as a municipality."
        ],
        [
            "World War II and Japanese Occupation"
        ],
        [
            "In 1941, the Second World War broke.",
            "The Japanese troops entered Tigaon during the term of Mayor Lino Cabaero.",
            "The guerrilla movement evolved as an offshoot of Japanese cruelty.",
            "Clashes were frequent and the church became a sanctuary of most guerrillas.",
            "Fr.",
            "Tomas Bernales was parish priest during the period 1941−1942.",
            "Fr.",
            "Florencio Gonzales took over in 1942.",
            "The infamous Death March propelled Doña Leonor Moll to rescue her son, Dr. Heriberto Moll and forty other Bicolanos from the clutches of death.",
            "Lt. Salvador Natividad died fighting the Japanese at Mabalodbalod.",
            "Captain Edmundo Cea and Majors Salvador and Tomas Garchitorena were at the forefront of the clashes with the Japanese.",
            "Don Pascual Leelin freely disposed his sacks of rice to fellow-Tigaoeños before enemies could confiscate them.",
            "In 1945, American forces came back to reclaim the Philippines, thus paving the way for the surrender of the beleaguered Japanese Imperial Army."
        ],
        [
            "Independent Philippines"
        ],
        [
            "With the advent of independence, Tigaoeños found freedom of expression through the arts.",
            "An abundance of painters, poets, and actors emerged from this town.",
            "Luisita Venida was the first Tigaoeña child actress while Jesus ‘Og’ Ramos became the Tarzan of local cinema and acclaimed “Mr.",
            "Philippines”.",
            "In the late fifties, Batas Pambansa 129 made Tigaon the seat of the CFI in Partido District.",
            "Politics thrived.",
            "Don Mariano Garchitorena became Governor of Camarines Sur in 1945.",
            "Sebastian Caruso Moll was elected Congressman under the Quirino administration.",
            "The same administration chose Don Mariano Garchitorena Secretary of Agriculture.",
            "Edmundo Cea, the first Asian to be invited as guest speaker to the United Nations, gained fame as a congressman, then Senator during the sixties, as a delegate to the 1970 Constitutional Convention and as a member of the defunct Batasang Pambansa.",
            "Jose Fuentebella was Ambassador to Indonesia during the Garcia administration.",
            "Parish Priest Fr.",
            "Florencio Gonzales was succeeded by Fr.",
            "Pedro Oliva (1948−1967).",
            "Municipal mayors of Tigaon during these years: Heriberto R. Moll (1945-1957); Jose Bosito (1958-1964) and again Heriberto R. Moll (1964−1967)."
        ],
        [
            "There was a time when Tigaon was solely owned by 7 hacienderos namely P. Baduria, L. Cea, J. Jacob, M. Estela, A. Garchitorena and S. Moll.",
            "Now their lands were distributed to the people through the Agrarian Reform."
        ],
        [
            "Martial Law"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2020) (Learn how and when to remove this message)"
        ],
        [
            "The NPA Movement in the Bicol Region started in Tigaon which at best typified a feudal society.",
            "Brothers Romulo (Kumander Tangkad) and Ruben (Kumander Benjie) Jallores actively guided the growth of this movement.",
            "Agrarian unrest became the legitimate cause for the fuelling of socialist ideology.",
            "Tenants forcibly planted rice and corn within abaca lands.",
            "Eventually, abaca production declined."
        ],
        [
            "In 1972, martial law was declared.",
            "Agrarian Reform was implemented.",
            "Felix Fuentebella was appointed governor in 1976, the same year Nelson Baduria Tria was ordained and became the first Tigaoeño priest.",
            "The Marcos dictatorship hunted down insurgents and tortured them.",
            "Senator Edmundo Cea took the cudgels for Ninoy Aquino's widow, Corazon.",
            "The church played an important role in the series of events that was to lead to the overthrow of Ferdinand Marcos in the EDSA Revolution of 1986.",
            "Tigaon's St. Clare of Assisi Parish became the rallying point of Cory Aquino's cause in Camarines Sur's third district.",
            "Parish priests in Tigaon were Fr.",
            "Jose Rey (1967−1984) and Fr.",
            "Felix Barela (1984−1985).",
            "In 1986, Fr.",
            "Gallardo Bombase, Jr. Dominican Priest was ordained.",
            "He became the first Filipino parish priest of Santisimo Rosario Parish, University of Santo Tomas, Sampaloc, Manila (1984-1993).",
            "Municipal Mayors during this time: Gualberto Cea Manlagñit (1968−1971); Lucio Palaypayon, Jr. (1972); Federico Moll (acting capacity, 1973–1974) Gallardo P. Bombase (acting capacity, 1974−1976); and Claudio Francisco (appointed 1976/ elected 1980−1986)."
        ],
        [
            "Sponsored by: Acting Mayor Bombase with Councilors Nolasco, Genio with other Municipal Employees"
        ],
        [
            "Gradually, order was restored.",
            "The Senate and Congress were once again part of the country's democratic process.",
            "Delfin Recto was appointed Mayor of Tigaon.",
            "Julian Cea Napal became Vice Governor of Camarines Sur.",
            "Francis Garchitorena occupied the position of SandiganBayan Justice.",
            "The crusade of the NPA Movement gained recognition from the ruling administration.",
            "Continuing peace talks were held to resolve the differences between government and the CPP/NPA."
        ],
        [
            "The democratic form of government once more dominated the political scene.",
            "Municipal Mayors were: Roman de Leon, Jr. (OIC, 1987, Transitional Gov’t); and Eleanor R. Lelis (1988−1992).",
            "Arnulfo Fuentebella, elected in 1992, held the congressional seat for Camarines Sur's third district."
        ],
        [
            "Parish priests were Fr.",
            "Alfonso Grageda (1985−1991) and Fr.",
            "Eutiquio Infante (1991−1997)."
        ],
        [
            "Recent years"
        ],
        [
            "Former flag of Tigaon"
        ],
        [
            "Once more, Tigaon is on the move.",
            "Municipal Mayor Mariano B. Llaguno (1992−1998) was succeeded by Mayor Elmo L. Bombase while Fr.",
            "Danilo Tuason became Parish Priest of Tigaon.",
            "The Sword and Cross have never been apart in the Tigaoeño way of life.",
            "Hand in hand with the construction of the Parish rectory was Tigaon's new municipal building.",
            "After a nine-year term, Mayor Bombase was succeeded by Mayor Arnie Fuentebella (2007–present).",
            "The Rev.",
            "Msgr.",
            "Juan Celzo, Fr.",
            "Rodolfo Sales and incumbent parish priest Fr.",
            "Noel Emmanuel Alforte were assigned successively to continue the church's mission in Tigaon."
        ],
        [
            "Geography"
        ],
        [
            "The west of the municipality is mountainous, and the east has a flat surface.",
            "It borders Goa and San Jose in the north and Ocampo to the west and Sagñay in the south and Lagonoy Gulf in the east.",
            "Tigaon is 30 kilometres (19 mi) from Pili and 480 kilometres (300 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Tigaon is politically subdivided into 23 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Abo"
        ],
        [
            "Cabalinadan"
        ],
        [
            "Caraycayon"
        ],
        [
            "Casuna"
        ],
        [
            "Consocep"
        ],
        [
            "Coyaoyao"
        ],
        [
            "Gaao"
        ],
        [
            "Gingaroy"
        ],
        [
            "Gubat"
        ],
        [
            "Huyonhuyon"
        ],
        [
            "Libod"
        ],
        [
            "Mabalodbalod"
        ],
        [
            "May-Anao"
        ],
        [
            "Panagan"
        ],
        [
            "Poblacion"
        ],
        [
            "Salvacion"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Talojongon"
        ],
        [
            "Tinawagan"
        ],
        [
            "Vinagre"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Tigaon, Camarines Sur"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "33(91)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(83)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "82.88(3.26)"
        ],
        [
            "137.93(5.43)"
        ],
        [
            "63.69(2.51)"
        ],
        [
            "78.31(3.08)"
        ],
        [
            "229.42(9.03)"
        ],
        [
            "288.31(11.35)"
        ],
        [
            "280.99(11.06)"
        ],
        [
            "112.39(4.42)"
        ],
        [
            "210.87(8.30)"
        ],
        [
            "599.07(23.59)"
        ],
        [
            "194.80(7.67)"
        ],
        [
            "454.3(17.89)"
        ],
        [
            "2,732.96(107.59)"
        ],
        [
            "Average rainy days"
        ],
        [
            "24"
        ],
        [
            "28"
        ],
        [
            "18"
        ],
        [
            "20"
        ],
        [
            "24"
        ],
        [
            "29"
        ],
        [
            "31"
        ],
        [
            "27"
        ],
        [
            "27"
        ],
        [
            "30"
        ],
        [
            "29"
        ],
        [
            "31"
        ],
        [
            "318"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Tigaon municipal hall"
        ],
        [
            "Population census of TigaonYearPop.±% p.a.1903 5,711—    1918 7,418+1.76%1939 10,039+1.45%1948 16,912+5.97%1960 20,337+1.55%1970 20,224−0.06%1975 25,282+4.58%1980 26,504+0.95%1990 33,650+2.42%1995 39,186+2.89%2000 40,210+0.55%2007 45,509+1.72%2010 48,611+2.43%2015 55,272+2.48%2020 60,524+1.80%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Tigaon was 60,524 people, with a density of 840 inhabitants per square kilometre or 2,200 inhabitants per square mile."
        ],
        [
            "Isarog Agta Language"
        ],
        [
            "In 2010, UNESCO released its 3rd world volume of Endangered Languages in the World, where 3 critically endangered languages were in the Philippines.",
            "One of these languages in the Isarog Agta language which has an estimated speaker of 5 people in the year 2000.",
            "The language was classified as Critically Endangered, meaning the youngest speakers are grandparents and older, and they speak the language partially and infrequently and hardly pass the language to their children and grandchildren anymore.",
            "If the remaining 150 people do not pass their native language to the next generation of Isarog Agta people, their indigenous language will be extinct within a period of 1 to 2 decades."
        ],
        [
            "The Isarog Agta people live within the circumference of Mount Isarog, though only 5 of them still know their indigenous language.",
            "They are one of the original Negrito settlers in the entire Philippines.",
            "They belong to the Aeta people classification but have distinct language and belief systems unique to their own culture and heritage."
        ],
        [
            "Religion"
        ],
        [
            "St. Claire of Assisi Parish Church"
        ],
        [
            "Roman Catholicism first emerged in 1794 with the birth of its town.",
            "Now, there are 4 parishes in Tigaon."
        ],
        [
            "St. Claire of Assisi Parish - The oldest parish.",
            "Established in 1794.",
            "It is located in Aguinaldo St., Tigaon."
        ],
        [
            "Parish of St. Catherine of Siena is located beside Siena College Tigaon (Ginaroy Campus) on Gingaroy, Tigaon."
        ],
        [
            "St. Raphael the Archangel Parish is the parish located at San Rafael, Tigaon."
        ],
        [
            "Parish of Our Lady of Sorrows - the newest parish, located at Abo, Tigaon."
        ],
        [
            "Presence of Protestant Churches are seen in Tigaon, particularly in the streets of Baranggay Talojongon,"
        ],
        [
            "Presently, the Protestant Churches in Tigaon are:"
        ],
        [
            "Members Church of God International (Ang Dating Daan)"
        ],
        [
            "Seventh Day Adventist"
        ],
        [
            "The Church of Jesus Christ of Latter-Day Saints"
        ],
        [
            "Jehovah's Witnesses"
        ],
        [
            "Jesus Miracle Crusade"
        ],
        [
            "Iglesia Ni Cristo"
        ],
        [
            "United Church of Christ in the Philippines"
        ],
        [
            "Jesus the Loving Shepherd Christian Fellowship"
        ],
        [
            "A group of Born-Again Christians"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tigaon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  39.30"
        ],
        [
            "2009  41.86"
        ],
        [
            "2012  27.93"
        ],
        [
            "2015  34.28"
        ],
        [
            "2018  28.70"
        ],
        [
            "2021  40.22"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Commercial establishments include open market, banks, pawnshops, hardware stores, self-service supermarkets, drug stores, food chains and restaurants, pension house.",
            "Tigaon is also home to a slaughterhouse and information technology centers."
        ],
        [
            "Local products include palay, corn, root crops, sugarcane, coconut, citrus, vegetables, fish and other marine products, livestock and poultry products are also available."
        ],
        [
            "Despite being the administrative seat of Partido it still is one of the Top 5 poorest municipalities in Camarines Sur and is one of the slowest progressing too."
        ],
        [
            "CASURECO IV with its main office in Tigaon supplies power requirement in all Partido towns."
        ],
        [
            "Tourism"
        ],
        [
            "Tourist destinations include the Hibiscus, Consocep Mountain Resort, beach resorts in Barangays Casuna and Ranso, and the Kawa-kawa, Tumaguiti and Bulalakaw waterfalls."
        ],
        [
            "Transportation"
        ],
        [
            "There is a total of 71.456 kilometres (44.401 mi) of road classified as National, Provincial, Municipal and Barangay roads."
        ],
        [
            "Presence of a bus terminal where air-conditioned as well as ordinary buses have regular trips to Manila and other provincial key cities and other light air-conditioned vehicles available for hire."
        ],
        [
            "Education"
        ],
        [
            "Tigaon has currently has 23 elementary schools, one for each barangay, 7 high schools and 4 colleges."
        ],
        [
            "Elementary schools"
        ],
        [
            "Tigaon North Central School"
        ],
        [
            "Tigaon Central Pilot School"
        ],
        [
            "Abo Elementary School"
        ],
        [
            "Casuna Elementary School"
        ],
        [
            "Caraycayon Elementary School"
        ],
        [
            "Consosep Elementary School"
        ],
        [
            "Coyaoyao Elementary School"
        ],
        [
            "Don Tomas Garchitorena Elementary School"
        ],
        [
            "Eulalia Elementary School"
        ],
        [
            "Gaao Elementary School"
        ],
        [
            "Gingaroy Elementary School"
        ],
        [
            "Huyonhuyon Elementary School"
        ],
        [
            "Juanita Clerigo Elementary School"
        ],
        [
            "Libod Elementary School"
        ],
        [
            "Mabalodbalod Elementary School"
        ],
        [
            "May-Anao Elementary School"
        ],
        [
            "Panagan Elementary School"
        ],
        [
            "Salvacion Elementary School"
        ],
        [
            "San Antonio Elementary School"
        ],
        [
            "San Miguel Elementary School"
        ],
        [
            "San Rafael Elementary School"
        ],
        [
            "Tinawagan Elementary School"
        ],
        [
            "Vinagre Elementary School"
        ],
        [
            "High School and College"
        ],
        [
            "San Rafael National High School"
        ],
        [
            "Dr. Rodolfo V. Pamor Jr. Memorial National High School"
        ],
        [
            "Tinawagan National High School"
        ],
        [
            "Huyonhuyon High School"
        ],
        [
            "La Salvacion National High School"
        ],
        [
            "Partido Agro-Industrial National High School"
        ],
        [
            "Cabalinadan High School"
        ],
        [
            "Genesis Colleges Inc. - Tigaon Branch"
        ],
        [
            "Partido Mission Academy"
        ],
        [
            "Colleges"
        ],
        [
            "Siena College Tigaon (formerly Santa Clara College)"
        ],
        [
            "Shepherdville College (formerly Jesus the Loving Shepherd Christian College)"
        ],
        [
            "Lower Isarog Foundation Exponent"
        ],
        [
            "Notable personalities"
        ],
        [
            "Don Andres Garchitorena, Governor and one of Aguinaldo's general"
        ],
        [
            "Don Mariano Garchitorena, Governor and Secretary of Agriculture and Commerce"
        ],
        [
            "Justice Francis E. Garchitorena, SandiganBayan Justice"
        ],
        [
            "Jomari Yllana and Anjo Yllana, actors."
        ],
        [
            "Jose Manuel Estela Stilianopoulos, Marcos' appointed Ambassador to the Court of Saint James, England, was also born in this town."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Tigaon |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b Malanyaon, Jaime (1991).",
            "Istorya Kan Kabikolan.",
            "Naga City, Philippines: AMS PRESS."
        ],
        [
            "^ Administrator.",
            "\"HISTORY\".",
            "www.tigaon.gov.ph.",
            "Retrieved 2015-08-08."
        ],
        [
            "^"
        ],
        [
            "\"Tigaon, Camarines Sur: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 29 October 2017."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region V (Bicol Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Camarines Sur\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Tigaon, Camarines Sur."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Official Site of the Province of Camarines Sur"
        ],
        [
            "Official website"
        ],
        [
            "Places adjacent to Tigaon, Camarines Sur"
        ],
        [
            "Mount Isarog"
        ],
        [
            "Goa"
        ],
        [
            "San Jose"
        ],
        [
            "Ocampo"
        ],
        [
            "Tigaon"
        ],
        [
            "Lagonoy Gulf"
        ],
        [
            "Sagñay"
        ],
        [
            "vte Province of Camarines SurPili (capital)  Naga (largest city)Municipalities"
        ],
        [
            "Baao"
        ],
        [
            "Balatan"
        ],
        [
            "Bato"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Caramoan"
        ],
        [
            "Del Gallego"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Goa"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Lupi"
        ],
        [
            "Magarao"
        ],
        [
            "Milaor"
        ],
        [
            "Minalabac"
        ],
        [
            "Nabua"
        ],
        [
            "Ocampo"
        ],
        [
            "Pamplona"
        ],
        [
            "Pasacao"
        ],
        [
            "Pili"
        ],
        [
            "Presentacion"
        ],
        [
            "Ragay"
        ],
        [
            "Sagñay"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Component city"
        ],
        [
            "Iriga"
        ],
        [
            "Independent component city"
        ],
        [
            "Naga (Administratively independent from the province but grouped under Camarines Sur by the Philippine Statistics Authority.)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tigaon,_Camarines_Sur&oldid=1231032370\""
        ],
        [
            "Category: Municipalities of Camarines SurHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Central Bikol-language textArticles containing Tagalog-language textArticles needing additional references from July 2020Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}