{
    "name": "Tubao",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tubao"
        ],
        [
            "23 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsŚlůnskiSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°21′N 120°25′E﻿ / ﻿16.35°N 120.42°E﻿ / 16.35; 120.42"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in La Union, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Tubao\" – news · newspapers · books · scholar · JSTOR (August 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesTubao"
        ],
        [
            "San Isidro de TubaoMunicipalityMunicipality of TubaoTubao Municipal Hall"
        ],
        [
            "FlagSealMotto: Ti Panagkaykaysa Isu ti BilegMap of La Union with Tubao highlightedOpenStreetMapTubaoLocation within the PhilippinesCoordinates: 16°21′N 120°25′E﻿ / ﻿16.35°N 120.42°E﻿ / 16.35; 120.42CountryPhilippinesRegionIlocos RegionProvinceLa UnionDistrict"
        ],
        [
            "2nd districtFounded1886Barangays18"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJonalyn G. Fontanilla-Piayas • Vice MayorWilfredo S. Garcia • RepresentativeDante S. Garcia • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Marilou G. BulaoMary Muriel M. VercelesDomingo S. EstoestaDominga R. CaburianMichael M. MapaloEstela M. GayoJoseph G. QuimadoWilliam F. Mariñas"
        ],
        [
            " • Electorate20,469 voters (2022)Area • Revenue₱ 108.8 million (2020) • Assets₱ 179 million (2020) • Expenditure₱ 111.2 million (2020) • Liabilities₱ 33.81 million (2020)Service provider • ElectricityLa Union Electric Cooperative (LUELCO)Time zoneUTC+8 (PST)ZIP code2509PSGC013320000IDD : area code +63 (0)72Native languagesIlocano Pangasinan TagalogWebsitewww.tubao.gov.ph"
        ],
        [
            "Tubao, officially the Municipality of Tubao (Ilocano: Ili ti Tubao; Filipino: Bayan ng Tubao), is a 4th class municipality in the province of La Union, Philippines.",
            "According to the 2020 census, it has a population of 31,763 people."
        ],
        [
            "Formerly known as the \"Home of the Native Tobacco\", Tubao was famous for its tobacco leaf and cigars.",
            "It had a tobacco trade for decades where its town center was littered by huge tobacco warehouses and trading posts for tobacco.",
            "Today, corn is its prime agricultural output where Chichacorn is among its by-products."
        ],
        [
            "The town has an average annual income of PHP 42,803,624 pesos."
        ],
        [
            "Etymology"
        ],
        [
            "Legend states that Tubao got its name when the Spaniards led by Father Luis Gonzaga y Espinosa, in their desire to spread Christianity, headed towards the eastern parts of Agoo.",
            "At that time, these parts of Agoo were hinterlands and heavily forested.",
            "While the Spaniards were resting under the trees, they distributed manuscripts of the cartilla and catechism to the natives.",
            "Suddenly, they heard a loud chorus of the sound \"tuao\", emanating from the top of the trees.",
            "These sounds made by the birds locally known as kalaw, (the rufous hornbill, Buceros hydrocorax) attracted and bewildered the Spaniards.",
            "As the Spaniards went further east, the sound persisted.",
            "When Father Espinosa returned from their journey, he reported an area called \"Tuao.\"",
            "However, due to inadvertent recordings made by the Spanish authorities, the word \"Tuao\" was written as \"Tubao\", hence, the name of the place."
        ],
        [
            "History"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Photocopy of a portion of the original Spanish document creating the new municipality of Tubao in 1885."
        ],
        [
            "Tubao first surfaced in the mid-1880s.",
            "It was a barrio in the eastern boundaries of Agoo and Aringay.",
            "The place was a former visita of the parish of Agoo.",
            "During the Spanish period, a visita was a settlement with a church but was visited periodically by a non-resident clergy whose headquarters was at the mother town.",
            "The early settlers of the barrio called it San Isidro de Tubao in honor of its patron saint whose feast is celebrated annually on May 14 and 15."
        ],
        [
            "On March 28, 1873, residents of the settlement, composed of nine barrios from Agoo (Macoton, Amboot, Caoigue, Pideg, Damosil, Masalip, Linapew, Anduyan and Ambañgonan) together with six other barrios from Aringay] (Santa Theresa, Copang, Calopaan, Bugarin, Guinitaban and San Pascual) petitioned for the creation of a new municipality."
        ],
        [
            "Pugo, then part of Tubao was called Rancheria Tulosa.",
            "It was in 1883 that quail (locally known as pugo) hunters who frequented the place changed the name into Rancheria Pugo after the birds."
        ],
        [
            "Municipal council of Tubao circa 1900"
        ],
        [
            "However, it was not until July 20, 1885, when a superior decreto embodied in the expediente of August 28, 1885 created the town of Tubao.",
            "On August 21, 1885, La Union's Spanish Military Governor Federico Francia proposed a review of the petition to redefine the border limits of Aringay."
        ],
        [
            "On November 10, 1885, real orden No.",
            "901 affirmed the July 20th superior decreto.",
            "On November 16, 1885, Francia acknowledged the existence of the \"nuevo pueblo de Tubao\" from the barrios that were yielded by Agoo and Aringay.",
            "Hence, Tubao became the 14th town of La Union.",
            "Four months later, on March 8, 1886, Governor Francia inaugurated the town."
        ],
        [
            "Tubao Parish and the legacy of the Belgian missionaries"
        ],
        [
            "During the Spanish period until the 20th century, Roman Catholicism played a major role in the life of the people of Tubao.",
            "Tubao was a visita of the Parish of Agoo.",
            "A chapel and a convent of light materials were erected in 1884.",
            "Ten years later, the parish of Tubao was founded.",
            "Its first pastor, Father Juan Garcia arrived in March 1896.",
            "The cause of the delay was the subsidy to be voted upon in the Cortes Generales of Madrid.",
            "The missionary started gathering materials for a new church and a convent but could not carry out his plan as he left in January 1898; it took more than 30 years before these projects materialized."
        ],
        [
            "1896 (Heritage) St. Isidore the Farmer Parish Church"
        ],
        [
            "Church facade"
        ],
        [
            "As of 2012, the St. Isidore the Farmer Parish Church of Tubao (canonically erected in 1896),  2509 La Union, celebrates its fiesta every May 15.",
            "It is under the jurisdiction of the Roman Catholic Diocese of San Fernando de La Union (Dioecesis Ferdinandopolitana ab Unione, Suffragan of Lingayen – Dagupan, which was created on January 19, 1970, and erected on April 11, 1970, comprising the Civil Province of La Union, under the Titular, St. William the Hermit, February 10).",
            "The Church is under a diocese of the Latin Church of the Roman Catholic Church in the Philippines from the Archdiocese of Nueva Segovia."
        ],
        [
            "The Tubao Church is under the Vicariate of St. Francis Xavier with Vicar Forane, Fr.",
            "Joel Angelo Licos."
        ],
        [
            "The Church was rehabilitated and renovated in 1980 under Jose D. Aspiras."
        ],
        [
            "American era"
        ],
        [
            "On March 8, 1900, during the Philippine–American War, the people of Tubao petitioned against the return of the friars."
        ],
        [
            "Capt.",
            "Santiago Fontanilla, heading 130 men with four officers and 87 rifles, fought against the Americans.",
            "When he narrowly escaped capture in Kapangan, he abandoned personal equipment which included a horse and Colt .45 pistol both belonging to Colonel Gutierrez, his commander."
        ],
        [
            "Up to 1912, the condition of the young parish was unstable and precarious.",
            "The priests did not stay long and several times, Tubao was without a spiritual father.",
            "In 1908, it became again a visita, but of Aringay this time."
        ],
        [
            "Conditions were better in Pugo.",
            "Although smaller and never given a pastor in the Spanish time, it had a Dutch-born resident priest since 1909, Rev.",
            "Gerard Martens.",
            "When Tubao lost its priest once more in 1911, the parishioners sent a petition to the bishop requesting his excellency to send a missionary of the Congregation of the Immaculate Heart of Mary (Congregatio Immaculati Cordis Mariae) in case no Filipino priest should be available.",
            "On 20 November 1911, Father Morice Vanoverbergh arrived from Bauko, a CICM sister mission of Bontoc.",
            "His stay was short.",
            "About 8 February 1912, he learned that Father Jules Sepulchre, one of the founders of the mission in Bontoc and Bauko, became ill upon his return to Bauko.",
            "Vanoverbergh went on horseback to visit him climbing the Santo Tomas mountain and arrived in Bauko on 14 February just in time for the burial, Sepulchre  having died in Bontoc Hospital the day before.",
            "Vanoverbergh was asked by his superior to take over that mission.",
            "After two months, Father Martens was transferred to Tubao and stayed for eighteen years."
        ],
        [
            "During his stint, Father Martens extended the boundaries of the church yard and constructed the main part of the church.",
            "He rebuilt in 1916 the chapel in barangay Santa Teresa and gave a school chapel to Caoigue in 1917 and an ermita to Anduyan in 1926.",
            "He acquired the rectory which was put up in Spanish time.",
            "He also started a primary school in Anduyan and Caoigue in 1913.",
            "In June 1915, he opened a Grade I class on the ground floor of the rectory or convent to be later named Tubao Catholic School and conducted a parish census.",
            "A Belgian missionary from the same congregation (Congregatio Immaculati Cordis Mariae) Rev.",
            "Father Charles Beurms, assisted Father Martens and became the first director of the school.",
            "Father Martens also founded \"The Apostleship of Prayer\" (1912) and \"Los Defensores de la Libertad\" which later became the \"Cabsat ni San Isidro.\""
        ],
        [
            "In 1922, the first group of Belgian missionary sisters of the Immaculate Heart of Mary (Immaculati Cordis Mariae) arrived headed by Mother Marie Andrea and followed by Mother Marie Ambroise in 1923.",
            "The latter became the first principal for the Tubao Catholic high school with the opening of the First Year class.",
            "In 1924, the Second Year class was added."
        ],
        [
            "The lot on which the church building and the convent of the Sisters were built on was bought from Doña Laureana Novicio de Luna, mother of the famous Luna brothers -- Juan Luna and Antonio Luna."
        ],
        [
            "In 1923 the priests acquired the house of Don Urbano Dacanay for P1,000 pesos, west of the plaza, and housed in it the newly founded Tubao Catholic High School.",
            "It was renamed the Msgr.",
            "Martens Building.",
            "This building was destroyed in World War II during the liberation from the Japanese occupation.",
            "In January 1951, Father Albert Van Nuffelen sold the lot back for P1,800 pesos to the relatives of the former owner viz., Mr. Bernardino Madriaga and Milagrina Oller who built their house on it."
        ],
        [
            "From 1930 to 1933, during Father Alois Proost's term, the church sanctuary and sacristies were completed.",
            "He donated the big church bells.",
            "He organized a scout band, a string band and the first girl scout unit in the Philippines.",
            "He also added Third and Fourth year classes in the Tubao Catholic High School established by Father Martens before.",
            "A primary school was also opened in Pideg (1931) and Amallapay (1933?",
            ")."
        ],
        [
            "From 1934 to 1935, Father Morice Vanoverbergh installed the tiled floors on the church.",
            "He was a scholar and did outstanding work in botany, anthropology and linguistics."
        ],
        [
            "The parish priests expanded the church yard and bought more lots in the 1920s up to the 1950s.",
            "In 1927, a land was bought from Baltazar Dulay for P200 pesos, north of the church.",
            "A few years later, the sacristy was built on this property.",
            "Another lot, west of the sacristy, was bought from Don Francisco Zandueta (La Union Governor from 1910 to 1912) and was partly occupied by a bamboo warehouse for storing tobacco rented by Chan Chin Ko Baltazar, father of Florencio Chan Baltazar who later became municipal mayor.",
            "The warehouse was converted into three classrooms for boys of the intermediate class.",
            "In 1940, Father Carlos Desmet procured the means to have a new school building within the premises to replace the old bamboo shack.",
            "It was the Sancho Building named after Msgr.",
            "Sancho, the bishop of Nueva Segovia who helped with the means.",
            "Again, this building was razed to the ground during the war.",
            "Today the area is an open field of the school."
        ],
        [
            "Japanese occupation"
        ],
        [
            "During the Japanese occupation from 1942 to 1944, classes were suspended.",
            "As the bombs destroyed the old Martens and Sancho buildings, primary classes were held in the house of Benedicto Verceles, southeast of the rectory or convent while intermediate and high school classes were held in the convent."
        ],
        [
            "President Diosdado Macapagal inaugurating the Masalip Dam Irrigation project in Tubao, La Union.",
            "June 17, 1962 Among those who found refuge and passage in the town were top officials of the land led by then Executive Secretary Manuel Roxas who was later captured by the Japanese in 1942, Senator Quintin Paredes, future Speaker Jose Laurel Jr. and Teofilo Sison."
        ],
        [
            "Philippine independence"
        ],
        [
            "Father Albert Van Nuffelen, parish priest from 1949 to 1954 constructed two new buildings and named these the new Martens and Sancho buildings, south and north of the present basketball court which he also built."
        ],
        [
            "In 1954, Father Jose de Hayes became parish priest and school director.",
            "He proposed the school to have a Christian name.",
            "In 1956, Tubao Catholic School was renamed San Alberto Magno Academy (SAMA) in honor of Saint Albert the Great and his predecessor, Father Albert Van Nuffelen."
        ],
        [
            "More lots were acquired from Doña Maxima Zarate in October 1950 by Father Albert Van Nuffelen where the present high school building now stands; Alfredo Milanes, Felix Garcia, Teodoro Ramos, Timoteo Ramos for the lots at the eastern side of the church in 1951.",
            "The northern section of the school garden was bought from Valeriano Mapalo by Father Jose de Hayes in 1957."
        ],
        [
            "On June 17, 1962, President Diosdado Macapagal inaugurated the multi-million peso Masalip River Irrigation Project together with First Lady Eva Macapagal."
        ],
        [
            "In 1963, Father Henry Geeroms initiated and sought means to construct another building which was located at the back of the Sancho building to house a library, a laboratory and four classrooms.",
            "Today, that building has been demolished and a new building now has been constructed in its place."
        ],
        [
            "During the Golden Jubilee in 1965, the school populace was 1,393 including the 115 pupils of Caoigue.",
            "But enrollment gradually dwindled due to the opening of free public schools in the different barangays.",
            "Elementary classes were phased out in 1973 due to financial constraint."
        ],
        [
            "In 1966, Father Jaime Quatannens, organized the credit union/cooperative to find an alternative lending facility other than those provided by unscrupulous moneylenders.",
            "On August 13, 1966, with 39 pioneer-members and a starting paid-up capitalization of Three hundred fourteen pesos (P 314.00), the Tubao Credit Union, Inc. as originally named was formally organized and registered with the Cooperative Administration Office (CAO) under RA 2023 and approved on October 26, 1966, under Registration No.",
            "001503."
        ],
        [
            "In 1974, then Tourism Minister Jose Aspiras brought Miss Universe Amparo Muñoz of Spain and other beauties to Tubao for a tour."
        ],
        [
            "After 68 years, the Belgian CICM and ICM sisters handed the school administration in 1984 to the Diocese of San Fernando, La Union.",
            "The last ICM principal was Sister Cleofe Bacon who left in 1998."
        ],
        [
            "The Sancho building was damaged by the 1990 Luzon earthquake and was renovated.",
            "Only the first floor remains of the original building built by Father Van Nuffelen.",
            "The Martens building now houses the Saint Isidore School for grade school classes which was revived in the late 1990s."
        ],
        [
            "On December 30, 1996, Fr.",
            "Noel C. Mabutas, Parish Priest and Mr. Jose C. Taveres, Parish Council President signed the Centennial Marker in the Church Door, under the lead of Archbishops Oscar V. Cruz, Antonio R. Tobias, D.D.",
            "and Antonio Ll.",
            "Mabutas, D.D.",
            "with the Centennial Executive Board."
        ],
        [
            "The 1954 Our Lady of Lourdes Grotto (built by Fr.",
            "Albert Van Nuffelen, CICM, on 1954) was enthroned with Marker on February 11, 2005, by Rev.",
            "Camilo P. Villanueva, Parish Priest."
        ],
        [
            "On December 30, 2006, 110th Anniversary of the Church the Trailblazer Memorial honoring the Centennial Celebration of the CICM - RP 1911–1982, 7 Decades, was erected on the Church door, and blessed by Bishop Antonio Rillera, S.V.D., D.D."
        ],
        [
            "Geography"
        ],
        [
            "An inland land-locked town, Tubao is located in Region I lying along the south-eastern side of La Union province.",
            "It is bounded on the north by Aringay, on the east by Pugo, on the south-west by Santo Tomas, on the south by Rosario, and on the west by Agoo.",
            "It is located 42 kilometres (26 mi) south of the capital city San Fernando, 243 kilometres (151 mi) north of Manila, and 44 kilometres (27 mi) west of Baguio."
        ],
        [
            "Barangays"
        ],
        [
            "Tubao is politically subdivided into 18"
        ],
        [
            "barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Amallapay"
        ],
        [
            "Anduyan"
        ],
        [
            "Caoigue"
        ],
        [
            "Francia Sur"
        ],
        [
            "Francia West"
        ],
        [
            "Garcia"
        ],
        [
            "Gonzales"
        ],
        [
            "Halog East"
        ],
        [
            "Halog West"
        ],
        [
            "Leones East"
        ],
        [
            "Leones West"
        ],
        [
            "Linapew"
        ],
        [
            "Lloren"
        ],
        [
            "Magsaysay"
        ],
        [
            "Pideg"
        ],
        [
            "Poblacion"
        ],
        [
            "Rizal"
        ],
        [
            "Santa Teresa"
        ],
        [
            "Topography"
        ],
        [
            "Rural topography is seventy percent (70%) alluvial plains and thirty percent (30%) uplands.",
            "Highest portion is located in Barangay Rizal, which is more than 500 metres (1,600 ft) above sea level.",
            "Flat lands are found in the middle portion of the town, in between its southern and northern hilly sections."
        ],
        [
            "Slope"
        ],
        [
            "0-8 percent where slope of land is nearly level and gently sloping accounts 2,664 hectares.",
            "Most of these are located in Santa Teresa, Leones East, Poblacion and Gonzales with some part of Linapew, Francia Sur, Halog East and lower lands of Rizal;"
        ],
        [
            "8-30 percent slope which are rolling to moderately steep with the lowest share of 60 hectares, mostly found in Halog East and West;"
        ],
        [
            "30-50 percent slope of land which are steep comprising an area of 1,070 hectares and are found in Amallapay, Pideg and some part of Lloren, Magsaysay and Anduyan;"
        ],
        [
            "50 percent and above are very steep slopes of land found mostly in Rizal and the boundary lines of Pideg, Linapew and Amallapay.",
            "This accounts 1,427 hectares."
        ],
        [
            "Soil type"
        ],
        [
            "Soil types are found as follows: San Manuel silt loam in Barangay Santa Teresa with an approximate area of 336 hectares; Umingan Clay loam in Poblacion and Anduyan; Barcelona Clay in Barangay Leones; Mountain soils, annam clay loam and Bauang clay in Santa Teresa, Halog, Gonzales, Anduyan, Linapew and Garcia.Soil types are found as follows: San Manuel silt loam in Barangay Santa Teresa with an approximate area of 336 hectares; Umingan Clay loam in Poblacion and Anduyan; Barcelona Clay in Barangay Leones; Mountain soils, annam clay loam and Bauang clay in Santa Teresa, Halog, Gonzales, Anduyan, Linapew and Garcia."
        ],
        [
            "Climate"
        ],
        [
            "The climate prevailing in the municipality is characterized by two distinct seasons, dry from November to April and wet during the rest of the year."
        ],
        [
            "Annual main rainfall as recorded by PAGASA is 217.8 ml with a peak of 1,059.6 millimeters in December.",
            "The mean temperature is 27.5 Celsius.",
            "It rises to as high as 29.2 Celsius in May and goes down as low as 25 Celsius in January.",
            "Monthly average number of rainy days is 11.2, while relative humidity is 78.9."
        ],
        [
            "Direction of the wind blowing in the area is mostly from south-west to north-east due to south-west monsoons.",
            "The area has a natural shield of winds blowing from the east because of the Cordillera mountain ranges.",
            "During summer, in the absence of any weather disturbance, wind blows from west to east as natural sea breeze."
        ],
        [
            "Climate data for Tubao, La Union"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "33(91)"
        ],
        [
            "34(93)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "15(0.6)"
        ],
        [
            "16(0.6)"
        ],
        [
            "24(0.9)"
        ],
        [
            "33(1.3)"
        ],
        [
            "102(4.0)"
        ],
        [
            "121(4.8)"
        ],
        [
            "177(7.0)"
        ],
        [
            "165(6.5)"
        ],
        [
            "144(5.7)"
        ],
        [
            "170(6.7)"
        ],
        [
            "56(2.2)"
        ],
        [
            "23(0.9)"
        ],
        [
            "1,046(41.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "6.3"
        ],
        [
            "6.6"
        ],
        [
            "9.5"
        ],
        [
            "12.8"
        ],
        [
            "20.6"
        ],
        [
            "23.5"
        ],
        [
            "25.4"
        ],
        [
            "23.4"
        ],
        [
            "23.2"
        ],
        [
            "21.4"
        ],
        [
            "14.0"
        ],
        [
            "8.2"
        ],
        [
            "194.9"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TubaoYearPop.±% p.a.1903 7,030—    1918 9,181+1.80%1939 8,344−0.45%1948 9,105+0.97%1960 12,304+2.54%1970 14,552+1.69%1975 15,462+1.22%1980 17,604+2.63%1990 21,138+1.85%1995 23,039+1.63%2000 24,773+1.57%2007 26,402+0.88%2010 26,993+0.81%2015 28,729+1.19%2020 31,763+1.99%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Tubao was 31,763 people, with a density of 630 inhabitants per square kilometre or 1,600 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tubao"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  31.40"
        ],
        [
            "2009  26.22"
        ],
        [
            "2012  17.00"
        ],
        [
            "2015  8.56"
        ],
        [
            "2018  3.69"
        ],
        [
            "2021  10.75"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Just as the national government, the municipal government of Tubao, is divided into three branches: executive, legislative and judiciary.",
            "The judicial branch is administered solely by the Supreme Court of the Philippines.",
            "The LGUs have control of the executive and legislative branch."
        ],
        [
            "The executive branch is composed of the mayor and the barangay captain for the barangays."
        ],
        [
            "The legislative branch is composed of the Sangguniang Bayan (town assembly), Sangguniang Barangay (barangay council), and the Sangguniang Kabataan for the youth sector."
        ],
        [
            "The seat of Government is vested upon the Mayor and other elected officers who hold office at the Tubao Town hall.",
            "The Sanguniang Bayan is the center of legislation, stationed in Tubao Municipio."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Dante S. Garcia"
        ],
        [
            "Mayor"
        ],
        [
            "Jonalyn G. Fontanilla-Piayas"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Wilfredo S. Garcia"
        ],
        [
            "Councilors"
        ],
        [
            "Marilou G. Bulao"
        ],
        [
            "Mary Muriel M. Verceles"
        ],
        [
            "Domingo S. Estoesta"
        ],
        [
            "Dominga R. Caburian"
        ],
        [
            "Michael M. Mapalo"
        ],
        [
            "Estela M. Gayo"
        ],
        [
            "Joseph G. Quimado"
        ],
        [
            "William F. Mariñas"
        ],
        [
            "List of former Chief Executives"
        ],
        [
            "For 378 years, from 1521 to 1899, Local Chief Executives of the “pueblos” or towns were appointed by the Spaniards and in the year 1901 up to 1910 they were appointed by the Americans.",
            "Afterwards, election was the mode of selection."
        ],
        [
            "Early local government was covered by the Maura Law which was passed in 1893 that changed the title or designation of town heads from gobernadorcillo to capitan municipal.",
            "It was ruled by the members of the Tribunal Municipal, the \"cabezas de barangay\" and the \"principales\" (the local oligarchy as delegates), who elect the members of the Tribunal Council."
        ],
        [
            "The following local officials held the positions either as Tenientes Absolute Gobernadorcillos, Capitanes, Presidentes Municipal and Municipal Mayors, for the terms opposite their respective names:"
        ],
        [
            "Gobernadorcillos"
        ],
        [
            "Don Felipe Lloren 1886-1889 (appointed)"
        ],
        [
            "Don Carlos Orencia Gonzales 1890-1891 (appointed)"
        ],
        [
            "Capitan Municipal/Alcalde"
        ],
        [
            "Don Buenaventura Dacanay 1892-1893 (appointed)"
        ],
        [
            "Don Santiago Fontanilla 1894-1895 (appointed)"
        ],
        [
            "Don Miguel Halog 1896-1897 (appointed)"
        ],
        [
            "Don Catalino Zarate 1898-1899 (appointed)"
        ],
        [
            "Don Santiago Fontanilla 1899-1900 (appointed)"
        ],
        [
            "Don Teodorico Asprer 1901-1902 (appointed)"
        ],
        [
            "Don Ambrocio Oribello 1902-1903 (appointed)"
        ],
        [
            "Don Dionisio Tabora 1904-1906 (appointed)"
        ],
        [
            "Don Fabian Fangonil 1907-1908 (appointed)"
        ],
        [
            "Don Dionisio Tabora 1909 (appointed)"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Don Feliciano Zarate 1910-1912"
        ],
        [
            "Don Vicente Estolas 1913-1916"
        ],
        [
            "Don Juan Verceles 1916-1919"
        ],
        [
            "Don Marcos Acosta 1919-1921"
        ],
        [
            "Don Isabelo Leones 1921-1925"
        ],
        [
            "Don Calixto Lloren 1925-1928"
        ],
        [
            "Don Basilio Halog 1928-1934"
        ],
        [
            "Don Mariano Viloria 1934-1937"
        ],
        [
            "Don Basilio Halog 1938-1942"
        ],
        [
            "Don Emilio Laroya 1942-1944 (appointed)"
        ],
        [
            "Don Gregorio Mapalo 1944-1945 (appointed)"
        ],
        [
            "Don Basilio Halog 1945-1946 (appointed)"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Francisco Quesada 1946-1947 (appointed)"
        ],
        [
            "Gregorio Mapalo 1947-1951"
        ],
        [
            "Florencio Baltazar, Sr. 1951-1967"
        ],
        [
            "Lorenzo Baltazar 1967-1971"
        ],
        [
            "Antonio Verceles 1971-1986"
        ],
        [
            "Conrado Baltazar 1986-1987 (appointed)"
        ],
        [
            "Arcadio Diaz II Dec. 1987-Feb. 1988 (interim)"
        ],
        [
            "Antonio Verceles 1988-1998"
        ],
        [
            "Violeta Verceles 1998-2004"
        ],
        [
            "Dante Garcia 2004-2013"
        ],
        [
            "Jonalyn Fontanilla 2013-Present"
        ],
        [
            "Municipal town halls"
        ],
        [
            "Tubao Municipal Building, built in the late 1940s under the incumbency of Mayor Gregorio Mapalo, Sr. and lasted until the early 1960s."
        ],
        [
            "Tubao Municipal Building (the Moncada Model), under construction in the early 1960s during the incumbency of Mayor Florencio Baltazar, Sr.",
            "The building was destroyed during the July 16, 1990, earthquake."
        ],
        [
            "The Moncada Model in its pristine state."
        ],
        [
            "Current Town hall"
        ],
        [
            "Politics"
        ],
        [
            "2012 assassination attempt"
        ],
        [
            "Tubao Mayor Dante Garcia survived an assassination attack when he escaped unscathed from an ambush early on September 9, 2012, along the Aspiras National Highway in Barangay Lloren, Tubao.",
            "But Attorney Lazaro Gayo, a former vice mayor of the town and an aspiring candidate for Sangguniang Panlalawigan was murdered."
        ],
        [
            "The Civil Society Group (CSG) and the La Union police therefore held a rally at Freedom Park in Agoo to protest the series of unsolved extrajudicial killings in Tubao and Agoo.",
            "The public indignation was led by Reverend Mariano C. Apilado of Peace Builders La Union, Melvin Macusi of Amnesty International, Danilo Balino from the Commission on Human Rights and Fr.",
            "Leo Nedic of TIGNAY-PPCRV, other human rights Groups, Kanlungan, Bannuar and leaders of the Catholic and Protestant Churches."
        ],
        [
            "Gallery"
        ],
        [
            "Christ's Sermon on the Mount, sculpted by Ilongot-Igorot (Isinay stock) sculptor Anselmo Day-ag, in 1978 and erected on a mountain grotto park in 1981 by the Philippine Tourism Authority through the initiative of the late Tourism Minister and Assemblyman Jose D. Aspiras and then General Manager Bernardo Vergara in Francia Sur overlooking the Marcos Highway.",
            "It was Day-ag's version of the original art deco statue of Christ the Redeemer in Brazil.",
            "The statue collapsed and fell during the July 16, 1990, earthquake and still remains buried in rubble and dirt on the mountain slope."
        ],
        [
            "Junction (crossing, Tubao Highway)"
        ],
        [
            "Rang-Ay Bank"
        ],
        [
            "Barangay Gonzalez Welcome Arch"
        ],
        [
            "Centuries-old Acacia trees guard the water reservoir in the Plaza"
        ],
        [
            "Statue of the Tobacco Farmer, that stood in the Aspiras Highway junction."
        ],
        [
            "Notable personalities"
        ],
        [
            "Bernardo Vergara Former Mayor and Congressman of Baguio"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Tubao |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Ereccion de pueblos, La Union"
        ],
        [
            "^ a b c d e Ereccion de pueblos, La Union: 13th bundle.",
            "This contains the \"Expediente sobre la provincia de La Union, 1885,\" por El Señor Gobernador politico militar Federico Francia"
        ],
        [
            "^ a b c d e f g h i j Baltazar, Florencio Sr. (1961) A Short History of Tubao Parish 12-13."
        ],
        [
            "^ David M. Cheney.",
            "\"San Fernando de La Union (Diocese)\".",
            "Catholic-hierarchy.org.",
            "Retrieved 2015-04-04."
        ],
        [
            "^ \"Diocese of San Fernando de La Union\".",
            "Claretianpublications.com.",
            "Retrieved 2015-04-04."
        ],
        [
            "^ Scott, William Henry (1986) Ilocano Responses to American Aggression 1900-1901 186."
        ],
        [
            "^ Scott, William Henry (1986) Ilocano Responses to American Aggression 1900-1901 23."
        ],
        [
            "^ Scott, William Henry (1986) Ilocano Responses to American Aggression 1900-1901 58."
        ],
        [
            "^ Excerpt from 2005 90th SAMA Foundation Day and Grand Alumni Homecoming Souvenir Program 5."
        ],
        [
            "^ a b c Excerpt from the 153rd Foundation Anniversary program of La Union, 231-232."
        ],
        [
            "^ a b c d e Excerpt from 2005 90th SAMA Foundation Day and Grand Alumni Homecoming Souvenir Program"
        ],
        [
            "^"
        ],
        [
            "\"Province: La Union\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Tubao: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 26 April 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of La Union\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Local Government Code of the Philippines, Book III\" (PDF).",
            "Department of the Interior and Local Government.",
            "Archived from the original (PDF) on 2009-03-26.",
            "Retrieved 2015-04-04."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 6, 2022."
        ],
        [
            "^ \"Breaking News\".",
            "SunStar.",
            "2011-07-06.",
            "Retrieved 2015-04-04."
        ],
        [
            "^ \"Hepe ng pulisya sa Tubao, La Union at Sta Cruz, Ilocos Sur, sinibak | Ulat Filipino\".",
            "GMA News.",
            "2012-11-14.",
            "Retrieved 2015-04-04."
        ],
        [
            "^ \"PIA | Philippine Information Agency | Tubao town has new police chief\".",
            "www.pia.gov.ph.",
            "Archived from the original on 16 April 2013.",
            "Retrieved 3 February 2022."
        ],
        [
            "^ \"PIA | Philippine Information Agency | Civic groups hold peace rally in la Union\".",
            "www.pia.gov.ph.",
            "Archived from the original on 16 April 2013.",
            "Retrieved 3 February 2022."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Tubao."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Tubao"
        ],
        [
            "Aringay"
        ],
        [
            "Agoo"
        ],
        [
            "Tubao"
        ],
        [
            "Tuba, BenguetPugo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Rosario"
        ],
        [
            "vteProvince of La UnionSan Fernando (capital and largest city)Municipalities"
        ],
        [
            "Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Bacnotan"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Bangar"
        ],
        [
            "Bauang"
        ],
        [
            "Burgos"
        ],
        [
            "Caba"
        ],
        [
            "Luna"
        ],
        [
            "Naguilian"
        ],
        [
            "Pugo"
        ],
        [
            "Rosario"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santol"
        ],
        [
            "Sudipen"
        ],
        [
            "Tubao"
        ],
        [
            "Component city"
        ],
        [
            "San Fernando"
        ],
        [
            "BarangaysSee: List of barangays in La Union"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tubao&oldid=1230865000\""
        ],
        [
            "Category: Municipalities of La UnionHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from August 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Filipino-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}