{
    "name": "Tubod",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tubod, Lanao del Norte"
        ],
        [
            "25 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuBahasa MelayuNederlandsPangasinanPortuguêsSimple EnglishSvenskaTagalogไทยاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 8°03′N 123°48′E﻿ / ﻿8.05°N 123.8°E﻿ / 8.05; 123.8"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Capital of Lanao del Norte, Philippines"
        ],
        [
            "Municipality in Northern Mindanao, PhilippinesTubodMunicipalityMunicipality of Tubod"
        ],
        [
            "SealMap of Lanao del Norte with Tubod highlightedOpenStreetMapTubodLocation within the PhilippinesCoordinates: 8°03′N 123°48′E﻿ / ﻿8.05°N 123.8°E﻿ / 8.05; 123.8CountryPhilippinesRegionNorthern MindanaoProvinceLanao del NorteDistrict"
        ],
        [
            "1st districtFoundedOctober 17, 1946Barangays24"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorDionisio \"JIMMY\" Y. Cabahug Jr. • Vice MayorClifford J. Jumalon • RepresentativeMohamad Khalid Q. Dimaporo • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Lemuel B. TaduraNoreen P. CortesEduardo C. MansuetoNelly M. PepitoJean TibonRudy L. PepitoNicasio Lacson Jr.Alfredo S. Manosa Jr."
        ],
        [
            " • Electorate29,460 voters (2022)Area • Revenue₱ 235.6 million (2020) • Assets₱ 627.6 million (2020) • Expenditure₱ 189.6 million (2020) • Liabilities₱ 241.5 million (2020)Service provider • ElectricityLanao del Norte Electric Cooperative (LANECO)Time zoneUTC+8 (PST)ZIP code9209PSGC103522000IDD : area code +63 (0)63Native languagesMaranao Cebuano Binukid TagalogWebsitewww.tubodldn.gov.ph"
        ],
        [
            "Tubod, officially the Municipality of Tubod,  (Cebuano: Lungsod sa Tubod; Maranao: Inged a Tubod; Tagalog: Bayan ng Tubod), is a 1st class municipality and capital of the province of Lanao del Norte, Philippines.",
            "According to the 2020 census, it has a population of 60,182 people."
        ],
        [
            "Etymology"
        ],
        [
            "Tubod derived its name from the spring located at Sitio Baybay in Barangay Poblacion.",
            "According to the old folks, even during the longest dry season, the spring will not drain.",
            "Tubod comes from the Cebuano language, meaning “the water source”.",
            "History pointed out that Christian immigrants from Luzon and Visayas settled in this part of the region."
        ],
        [
            "History"
        ],
        [
            "History pointed out that migrant from the Christian provinces in Visayas and Luzon settled in this part of the region.",
            "Latest survey shows that the Christian-Muslim in the municipality is about 97.3."
        ],
        [
            "Republic Act No.",
            "58 separated the Barrios of Tubod, Baroy, Lala, Daromawang, Bolod, Taguiquiron, Sagadan and Princesa from its mother municipality of Kolambugan to become a municipality \"Tubod\" effective October 17, 1946.",
            "On February 3, 1982, Parliamentary Bill No.",
            "568 was enacted by the Batasang Pambansa in session assembled, transferring the site of Provincial Government of Lanao del Norte from Iligan City to Municipality of Tubod, making it the \"Capital town\" of the Lanao del Norte."
        ],
        [
            "Rufo dela Cruz was sworn into office as the appointed Municipal Mayor on March 14, 1947.",
            "In the local election of 1947, Fausto Alvia as elected as Municipal Mayor."
        ],
        [
            "On March 22, 1949, President Elpidio Quirino issued Executive Order No.",
            "208, creating the municipality of Lala from the barrios of Rawaan, Gumagamut, Lala (poblacion), Simpak, Daromawang, Abagan, and Lanipao."
        ],
        [
            "On June 10, 1949, the President Quirino issued Executive Order No.",
            "222 creating the Municipality of Baroy whereby all the elected Municipal Officials except the councilor Arsenio A. Quibranza, opted to serve Baroy thus leading to the appointment of the Municipal Officials of Tubod with the Arsenio A. Quibranza as Municipal Mayor effective June 24, 1949."
        ],
        [
            "In 1951 local elections the latter was elected as the Municipal Mayor and was re-elected twice during the 1955 and 1959 local elections, his term ended on March 8, 1962, when he was appointed by President Diosdado Macapagal as Vice Governor of Lanao del Norte.",
            "By the law of succession, the Vice Mayor Trifon A. Tabuco became the Municipal Mayor of Tubod and held the position until December 31, 1963.",
            "In the 1963 election,  Jesus Perez was elected Municipal Mayor and was re-elected also in the 1967 election whose term ended on December 31, 1971.",
            "In 1971 election, the Marcelino Pepito was elected Municipal Mayor whose term ended on January 31, 1979, when Romana dela Cruz Neri too her oath and assumed office as appointed Municipal Mayor.",
            "In 1980 election, the latter was elected as the Municipal Mayor whose term ended as an aftermath of the February 25, 1986, EDSA Revolution.",
            "The Municipal government of Tubod was governed since by OICs Panfilo dela Cruz, Rooseque B. Calacat and Panfilo Labunog, respectively, until January 31, 1988.",
            "In the February 2, 1988, election, the Romana dela Cruz Neri was elected again as the Municipal Mayor of Tubod.",
            "She held the same office until she was defeated by Constancio A. Pepito in 1992 synchronized national and local elections, who held the position for three consecutive terms.",
            "In 2001 elections,  Eduardo C. Mansueto was elected as Municipal Mayor and held the position for three consecutive terms.",
            "During the national and local election in 2010, the Nelieta Quibranza-Noval, who boarded the wagon of politics just like her father the late Arsenio A. Quibranza, was elected as Municipal Mayor and re-elected during the 2016 national and local election but she died on September 7, 2016."
        ],
        [
            "Geography"
        ],
        [
            "Tubod is located along the southeastern shores of Panguil Bay and is about 60 kilometres (37 mi) southwest of Iligan City, 10 kilometres (6.2 mi) south of Ozamiz City and about 2 kilometres (1.2 mi) west of Tangub City.",
            "The Panguil Bay Bridge, currently under construction, will link the municipality to the city of Tangub after the bridge's completion."
        ],
        [
            "It is bounded by Panguil Bay and the municipality of Kolambugan on the North, and Magsaysay on the North East, the municipality of Munai on the East, and the municipalities of Salvador and Nunungan on the South, and the municipality of Baroy on the South West.",
            "It has a regular terrain with low planes in the interior and undulating hills to rugged mountains along the Northern portion down to South Eastern portion of the municipality."
        ],
        [
            "Tubod has 24 barangays and occupies a land area of 24,000 hectares (59,000 acres).",
            "Rainfall present every month although it is outside the typhoon belt.",
            "It has an annual mean temperature of 26.6 °C (79.9 °F) and a mean monthly rainfall distribution of less than 74 millimetres (2.9 in).",
            "Of the total area of the municipality, 289.05 hectares as public lands both alienable and disposable and forestal land, 310 hectares rice land, 73.24 hectares as fishpond and swamp lands and 117.44 hectares as residential land."
        ],
        [
            "Barangays"
        ],
        [
            "Tubod is politically subdivided into 24 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Barakanas"
        ],
        [
            "Baris (Lumangculob)"
        ],
        [
            "Bualan"
        ],
        [
            "Bulod"
        ],
        [
            "Camp 5"
        ],
        [
            "Candis"
        ],
        [
            "Caniogan"
        ],
        [
            "Dalama"
        ],
        [
            "Kakai Renabor"
        ],
        [
            "Kalilangan"
        ],
        [
            "Licapao"
        ],
        [
            "Malingao"
        ],
        [
            "Palao"
        ],
        [
            "Patudan"
        ],
        [
            "Pigcarangan"
        ],
        [
            "Pinpin (Tadura)"
        ],
        [
            "Poblacion"
        ],
        [
            "Pualas"
        ],
        [
            "San Antonio"
        ],
        [
            "Santo Niño"
        ],
        [
            "Taden"
        ],
        [
            "Tangueguiron"
        ],
        [
            "Taguranao"
        ],
        [
            "Tubaran"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Tubod, Lanao del Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "69(2.7)"
        ],
        [
            "58(2.3)"
        ],
        [
            "67(2.6)"
        ],
        [
            "60(2.4)"
        ],
        [
            "109(4.3)"
        ],
        [
            "114(4.5)"
        ],
        [
            "83(3.3)"
        ],
        [
            "78(3.1)"
        ],
        [
            "76(3.0)"
        ],
        [
            "92(3.6)"
        ],
        [
            "86(3.4)"
        ],
        [
            "63(2.5)"
        ],
        [
            "955(37.7)"
        ],
        [
            "Average rainy days"
        ],
        [
            "12.8"
        ],
        [
            "11.6"
        ],
        [
            "14.8"
        ],
        [
            "17.4"
        ],
        [
            "24.8"
        ],
        [
            "23.5"
        ],
        [
            "20.7"
        ],
        [
            "18.5"
        ],
        [
            "17.4"
        ],
        [
            "22.5"
        ],
        [
            "21.6"
        ],
        [
            "15.6"
        ],
        [
            "221.2"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TubodYearPop.±% p.a.1948 32,171—    1960 18,511−4.50%1970 23,138+2.25%1975 20,129−2.76%1980 24,740+4.21%1990 36,083+3.85%1995 41,295+2.56%2000 43,067+0.90%2007 44,095+0.33%2010 46,332+1.82%2015 47,165+0.34%2020 50,073+1.18%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tubod"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  34.40"
        ],
        [
            "2009  48.31"
        ],
        [
            "2012  37.99"
        ],
        [
            "2015  36.80"
        ],
        [
            "2018  18.06"
        ],
        [
            "2021  28.43"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Banking"
        ],
        [
            "Landbank of the Philippines"
        ],
        [
            "Development Bank of the Philippines"
        ],
        [
            "CitySavings Bank (A subsidiary of UNIONBANK )"
        ],
        [
            "Rural bank of karomatan"
        ],
        [
            "BDO Network Bank"
        ],
        [
            "CBS China Savings Bank"
        ],
        [
            "Tourism"
        ],
        [
            "Mindanao Civic Center"
        ],
        [
            "Tubod is the site of the Mindanao Civic Center which houses a hotel, cafeteria, gym, swimming pool, oval, and other sports facilities.",
            "MCC is a 71-hectare integrated complex with 5-hectare provincial trade center, 18-hectare sports facilities with 48-hectares still open for the proposed 18-hole golf course, picnic park and sports academy.",
            "The gymnasium capacity was 3,500 and the main stadium was 5,000.",
            "MCC was the first sports hub of the First Mindanao Friendship Games."
        ],
        [
            "And also, MCC is the site of several motorcross events in the country, giving the distinction of Tubod and the whole province as the \"Motorcross Capital of the Philippines\"."
        ],
        [
            "Culture"
        ],
        [
            "Festival"
        ],
        [
            "Tubod is primarily an agricultural towny.",
            "Of its land area of 24,000, 80.7% is dedicated to agricultural use with a large percentage planted with bananas.",
            "Therefore, the ups and downs of the economic situation of the people in the interior barangay is more or less dependent on banana Industry.",
            "Cognizant with the bright prospect of banana products playing a vital role of livelihood of the people, in 1986, the LGU of Tubod,Lanao del Norte initiated the conceptualization of a festival that would give an all out emphasis on Council was organizeds to assist the LGU of Tubod in designing what is now known as the Sagingan Festival, as well as to determined priority measures to enhance the product of the economic symbol of Tubod.",
            "With close coordination of the Department of Agriculture, the banana yields of Tubod were given special treatment ( ex.",
            "Research, variety classification, soil analysis etc.).",
            "In 1987, the first Sagingan Festival celebrated by Tubod during the commemoration of the Towns creation (Charter day October 17).",
            "The celebration highlighted the presentation of the different varieties of bananas In Tubod (52 varieties as of last count).",
            "Seeing the festival enlightens the Tubodnons on the importance of Bananas in generation income, it was enhanced, developed, and sustained by the LGU of Tubod.",
            "Indeed, from the time, a portion of the LGU's 20% development fund was allocated for the Sagingan Festival.",
            "In 1992, Sagingan Festival was officially accredited with the Department of Tourism and included in the calendar festival in the entire Philippines.",
            "There festivals are highlighted with Street dancing Competition, Best Decorated Caromata, Booth Contest, Search for Ms. Sagingan Festival which use of 75% of Banana materials, banana Festival, and Agro-industrial Trade Fair.",
            "Folk Dance Competition and Sports Competition were incorporated to add and grandeur to the celebration.",
            "Romana dela Cruz-Neri is known as the Grandmother of the Sagingan Festival."
        ],
        [
            "Telecommunication"
        ],
        [
            "Globe Telecom"
        ],
        [
            "Globe fixed line"
        ],
        [
            "Smart Communications"
        ],
        [
            "PLDT fixed line"
        ],
        [
            "DITO Telecommunity"
        ],
        [
            "Healthcare"
        ],
        [
            "Tubod Community Hospital - Brgy.",
            "San Antonio"
        ],
        [
            "Rural Health Unit - Poblacion"
        ],
        [
            "Education"
        ],
        [
            "Elementary:"
        ],
        [
            "All 24 barangays"
        ],
        [
            "Secondary:"
        ],
        [
            "Mercy Junior College (Private)"
        ],
        [
            "A.A.Q.N.H.S (Bualan)"
        ],
        [
            "T.A.Q.N.H.S (Pualas)"
        ],
        [
            "L.N.P.S.H.S (Malingao)"
        ],
        [
            "Rufo Dela Cruz Integrated School"
        ],
        [
            "Pigcarangan Integrated School"
        ],
        [
            "Dalama Integrated School"
        ],
        [
            "Vocational:"
        ],
        [
            "TESDA-LNNAIS"
        ],
        [
            "Main Campus (Bualan)"
        ],
        [
            "Satellite Campus (Tubod)"
        ],
        [
            "Tertiary:"
        ],
        [
            "Tubod College - the first tertiary school in town (2018-2019)"
        ],
        [
            "Media"
        ],
        [
            "RADYO ARANGKADA 93.5Mhz"
        ],
        [
            "DXNE 94.3Mhz RADYO KALAMBUAN"
        ],
        [
            "97.1 Spring FM Tubod-Baroy"
        ],
        [
            "ARANGKADA BAG-ONG TUBOD FB PAGE"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Tubod |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Tubod: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved February 6, 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region X (Northern Mindanao)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Lanao del Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved December 17, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "March 23, 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "August 3, 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "May 31, 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "July 10, 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "December 15, 2021.",
            "Retrieved January 22, 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "April 2, 2024.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Mindanao Civic Center Sports Complex\".",
            "Province of Lanao del Norte.",
            "Retrieved February 18, 2019."
        ],
        [
            "^  Lanao del Norte hosts first international motocross summit - GMA News Online"
        ],
        [
            "External links"
        ],
        [
            "Tubod Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Official site of Tubod"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Tubod, Lanao del Norte"
        ],
        [
            "Ozamiz CityPanguil Bay"
        ],
        [
            "Kolambugan"
        ],
        [
            "Tangub City / Panguil Bay"
        ],
        [
            "Tubod"
        ],
        [
            "Magsaysay"
        ],
        [
            "Baroy"
        ],
        [
            "Salvador"
        ],
        [
            "Tangcal"
        ],
        [
            "Articles Related to Tubod, Lanao del Norte"
        ],
        [
            "vte Province of Lanao del NorteTubod (capital)  Iligan (largest city)Municipalities"
        ],
        [
            "Bacolod"
        ],
        [
            "Baloi"
        ],
        [
            "Baroy"
        ],
        [
            "Kapatagan"
        ],
        [
            "Kauswagan"
        ],
        [
            "Kolambugan"
        ],
        [
            "Lala"
        ],
        [
            "Linamon"
        ],
        [
            "Magsaysay"
        ],
        [
            "Maigo"
        ],
        [
            "Matungao"
        ],
        [
            "Munai"
        ],
        [
            "Nunungan"
        ],
        [
            "Pantao Ragat"
        ],
        [
            "Pantar"
        ],
        [
            "Poona Piagapo"
        ],
        [
            "Salvador"
        ],
        [
            "Sapad"
        ],
        [
            "Sultan Naga Dimaporo"
        ],
        [
            "Tagoloan"
        ],
        [
            "Tangcal"
        ],
        [
            "Tubod"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iligan (Administratively independent from the province but grouped under Lanao del Norte by the Philippine Statistics Authority.)"
        ],
        [
            "vteNorthern Mindanao (Region X)Regional center"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Provinces"
        ],
        [
            "Bukidnon"
        ],
        [
            "Camiguin"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Iligan"
        ],
        [
            "Component cities"
        ],
        [
            "El Salvador"
        ],
        [
            "Gingoog"
        ],
        [
            "Malaybalay"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Tangub"
        ],
        [
            "Valencia"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Malaybalay"
        ],
        [
            "Mambajao"
        ],
        [
            "Oroquieta"
        ],
        [
            "Tubod"
        ],
        [
            "Municipalities"
        ],
        [
            "Aloran"
        ],
        [
            "Alubijid"
        ],
        [
            "Bacolod"
        ],
        [
            "Baliangao"
        ],
        [
            "Balingasag"
        ],
        [
            "Balingoan"
        ],
        [
            "Baloi"
        ],
        [
            "Baroy"
        ],
        [
            "Baungon"
        ],
        [
            "Binuangan"
        ],
        [
            "Bonifacio"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Calamba"
        ],
        [
            "Catarman"
        ],
        [
            "Clarin"
        ],
        [
            "Claveria"
        ],
        [
            "Concepcion"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Don Victoriano Chiongbian"
        ],
        [
            "Gitagum"
        ],
        [
            "Guinsiliban"
        ],
        [
            "Impasugong"
        ],
        [
            "Initao"
        ],
        [
            "Jasaan"
        ],
        [
            "Jimenez"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kapatagan"
        ],
        [
            "Kauswagan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kinoguitan"
        ],
        [
            "Kitaotao"
        ],
        [
            "Kolambugan"
        ],
        [
            "Lagonglong"
        ],
        [
            "Laguindingan"
        ],
        [
            "Lala"
        ],
        [
            "Lantapan"
        ],
        [
            "Libertad"
        ],
        [
            "Libona"
        ],
        [
            "Linamon"
        ],
        [
            "Lopez Jaena"
        ],
        [
            "Lugait"
        ],
        [
            "Magsaysay (Lanao del Norte)"
        ],
        [
            "Magsaysay (Misamis Oriental)"
        ],
        [
            "Mahinog"
        ],
        [
            "Maigo"
        ],
        [
            "Malitbog"
        ],
        [
            "Mambajao"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Manticao"
        ],
        [
            "Maramag"
        ],
        [
            "Matungao"
        ],
        [
            "Medina"
        ],
        [
            "Munai"
        ],
        [
            "Naawan"
        ],
        [
            "Nunungan"
        ],
        [
            "Opol"
        ],
        [
            "Panaon"
        ],
        [
            "Pangantucan"
        ],
        [
            "Pantao Ragat"
        ],
        [
            "Pantar"
        ],
        [
            "Plaridel"
        ],
        [
            "Poona Piagapo"
        ],
        [
            "Quezon"
        ],
        [
            "Sagay"
        ],
        [
            "Salay"
        ],
        [
            "Salvador"
        ],
        [
            "San Fernando"
        ],
        [
            "Sapad"
        ],
        [
            "Sapang Dalaga"
        ],
        [
            "Sinacaban"
        ],
        [
            "Sugbongcogon"
        ],
        [
            "Sultan Naga Dimaporo"
        ],
        [
            "Sumilao"
        ],
        [
            "Tagoloan (Lanao del Norte)"
        ],
        [
            "Tagoloan (Misamis Oriental)"
        ],
        [
            "Talakag"
        ],
        [
            "Talisayan"
        ],
        [
            "Tangcal"
        ],
        [
            "Tubod"
        ],
        [
            "Tudela"
        ],
        [
            "Villanueva"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vte Provincial capital cities and municipalities of the PhilippinesLuzon"
        ],
        [
            "Abra: Bangued"
        ],
        [
            "Albay: Legazpi"
        ],
        [
            "Apayao: Kabugao / Luna1"
        ],
        [
            "Aurora: Baler"
        ],
        [
            "Bataan: Balanga"
        ],
        [
            "Batanes: Basco"
        ],
        [
            "Batangas: Batangas City"
        ],
        [
            "Benguet: La Trinidad"
        ],
        [
            "Bulacan: Malolos"
        ],
        [
            "Cagayan: Tuguegarao"
        ],
        [
            "Camarines Norte: Daet"
        ],
        [
            "Camarines Sur: Pili"
        ],
        [
            "Catanduanes: Virac"
        ],
        [
            "Cavite: Imus / Trece Martires1"
        ],
        [
            "Ifugao: Lagawe"
        ],
        [
            "Ilocos Norte: Laoag"
        ],
        [
            "Ilocos Sur: Vigan"
        ],
        [
            "Isabela: Ilagan"
        ],
        [
            "Kalinga: Tabuk"
        ],
        [
            "La Union: San Fernando"
        ],
        [
            "Laguna: Santa Cruz"
        ],
        [
            "Marinduque: Boac"
        ],
        [
            "Masbate: Masbate City"
        ],
        [
            "Mountain Province: Bontoc"
        ],
        [
            "Nueva Ecija: Palayan"
        ],
        [
            "Nueva Vizcaya: Bayombong"
        ],
        [
            "Occidental Mindoro: Mamburao"
        ],
        [
            "Oriental Mindoro: Calapan"
        ],
        [
            "Palawan: Puerto Princesa"
        ],
        [
            "Pampanga: San Fernando"
        ],
        [
            "Pangasinan: Lingayen"
        ],
        [
            "Quezon: Lucena"
        ],
        [
            "Quirino: Cabarroguis"
        ],
        [
            "Rizal: Antipolo"
        ],
        [
            "Romblon: Romblon"
        ],
        [
            "Sorsogon: Sorsogon City"
        ],
        [
            "Tarlac: Tarlac City"
        ],
        [
            "Zambales: Iba"
        ],
        [
            "Visayas"
        ],
        [
            "Aklan: Kalibo"
        ],
        [
            "Antique: San Jose de Buenavista"
        ],
        [
            "Biliran: Naval"
        ],
        [
            "Bohol: Tagbilaran"
        ],
        [
            "Capiz: Roxas"
        ],
        [
            "Cebu: Cebu City"
        ],
        [
            "Eastern Samar: Borongan"
        ],
        [
            "Guimaras: Jordan"
        ],
        [
            "Iloilo: Iloilo City"
        ],
        [
            "Leyte: Tacloban"
        ],
        [
            "Negros Occidental: Bacolod"
        ],
        [
            "Negros Oriental: Dumaguete"
        ],
        [
            "Northern Samar: Catarman"
        ],
        [
            "Samar: Catbalogan"
        ],
        [
            "Siquijor: Siquijor"
        ],
        [
            "Southern Leyte: Maasin"
        ],
        [
            "Mindanao"
        ],
        [
            "Agusan del Norte: Cabadbaran / Butuan1"
        ],
        [
            "Agusan del Sur: Prosperidad"
        ],
        [
            "Basilan: Lamitan / Isabela1"
        ],
        [
            "Bukidnon: Malaybalay"
        ],
        [
            "Camiguin: Mambajao"
        ],
        [
            "Cotabato: Kidapawan"
        ],
        [
            "Davao de Oro: Nabunturan"
        ],
        [
            "Davao del Norte: Tagum"
        ],
        [
            "Davao del Sur: Digos"
        ],
        [
            "Davao Occidental: Malita"
        ],
        [
            "Davao Oriental: Mati"
        ],
        [
            "Dinagat Islands: San Jose"
        ],
        [
            "Lanao del Norte: Tubod"
        ],
        [
            "Lanao del Sur: Marawi"
        ],
        [
            "Maguindanao del Norte: Datu Odin Sinsuat"
        ],
        [
            "Maguindanao del Sur: Buluan"
        ],
        [
            "Misamis Occidental: Oroquieta"
        ],
        [
            "Misamis Oriental: Cagayan de Oro"
        ],
        [
            "Sarangani: Alabel"
        ],
        [
            "South Cotabato: Koronadal"
        ],
        [
            "Sultan Kudarat: Isulan"
        ],
        [
            "Sulu: Jolo"
        ],
        [
            "Surigao del Norte: Surigao City"
        ],
        [
            "Surigao del Sur: Tandag"
        ],
        [
            "Tawi-Tawi: Bongao"
        ],
        [
            "Zamboanga del Norte: Dipolog"
        ],
        [
            "Zamboanga del Sur: Pagadian"
        ],
        [
            "Zamboanga Sibugay: Ipil"
        ],
        [
            "1 de facto seat of provincial government"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tubod,_Lanao_del_Norte&oldid=1234287790\""
        ],
        [
            "Categories: Municipalities of Lanao del NorteProvincial capitals of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Infobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from August 2017Pages using the Kartographer extension"
        ]
    ]
}