{
    "name": "Tubod",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tubod, Surigao del Norte"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 9°33′17″N 125°34′11″E﻿ / ﻿9.5547°N 125.5697°E﻿ / 9.5547; 125.5697"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Surigao del Norte, Philippines"
        ],
        [
            "Municipality in Caraga, PhilippinesTubodMunicipalityMunicipality of Tubod"
        ],
        [
            "FlagSealMap of Surigao del Norte with Tubod highlightedOpenStreetMapTubodLocation within the PhilippinesCoordinates: 9°33′17″N 125°34′11″E﻿ / ﻿9.5547°N 125.5697°E﻿ / 9.5547; 125.5697CountryPhilippinesRegionCaragaProvinceSurigao del NorteDistrict"
        ],
        [
            "2nd districtFoundedSeptember 18, 1957Barangays9"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 88.69 million (2020) • Assets₱ 236.7 million (2020) • Expenditure₱ 75.71 million (2020) • Liabilities₱ 25.72 million (2020)Service provider • ElectricitySurigao del Norte Electric Cooperative (SURNECO)Time zoneUTC+8 (PST)ZIP code8406PSGC166727000IDD : area code +63 (0)86Native languagesSurigaonon Agusan Cebuano TagalogWebsitewww.tubod.gov.ph"
        ],
        [
            "Tubod, officially the Municipality of Tubod (Surigaonon: Lungsod nan Tubod; Tagalog: Bayan ng Tubod), is a 5th class municipality in the province of Surigao del Norte, Philippines.",
            "According to the 2020 census, it has a population of 15,043 people."
        ],
        [
            "History"
        ],
        [
            "Tubod was a virgin forest where native inhabitants, the Mamanwa Tribe, had been living.",
            "Nomadic in nature, the tribe traveled from the hinterland of Tubod and stayed near riverbanks.",
            "Derived from words \"Man\" - meaning people, and “Banwa,” meaning jungle - A Mamanwa simply means 'a man living in the jungle.'"
        ],
        [
            "The tribe still occupies the hinterlands of Tubod particularly in Barangays Cawilan and Motorpool.",
            "They are very significant in building homes for the Tuboranons, and the eventual development of municipality."
        ],
        [
            "Agustin Mendez is recognized as Tubod's Founding Hero and the first Christian settler who discovered the woods.",
            "An immigrant from Ubay, Bohol Province, he began to develop Tubod and put the town in the map of Surigao del Norte.",
            "It was him who also organized the first Cabeza de Barangay that created the first Sitio."
        ],
        [
            "The Original Tuboranon Cabeza de Barangay founding members were - Agustin Mendez, Donato Pacatang, Florencio Gallenero, Gabriel Sumania, Isaias Calamba, Marciano Dapar, Galanida, Basil, Lumayag and Barro.",
            "Mendez led the Cabeza de Barangay bloc and young Galanida was their Secretary.",
            "The rest were known as Cabeza Council members."
        ],
        [
            "To create the name for the newly founded Sitio, Mendez commissioned a priest from Carrascal, Surigao del Sur but was not able to come as the means of transportation that time was only through the use of a Kayak to reach Placer, nearest location to Tubod, from Carrascal, then via horses to Barangay Timamana."
        ],
        [
            "However, Tubod Founding Hero Agustin Ganot Mendez did not stop dreaming.",
            "He requested and sought service of a clergyman in Jabonga, Agusan del Norte.",
            "They cruised along Tubod River to Sabang, Lake Mainit to reach the Sitio and celebrate Tubod's founding."
        ],
        [
            "Christian settlers believed it was important for a First Christian mass to be celebrated during foundation.",
            "This was also the day when the new Sitio's name was conceived.",
            "Rev.",
            "Father Sanidad officiated the first Mass and declared the new sitio after his name “Sitio Union Sanidad” on the 3rd of April."
        ],
        [
            "Sitio Union Sanidad consisted of rough roads and community nipa houses where only a few people settled.",
            "Its progress began with Barangay Timamana in Placer, where Agustin Mendez first established residence and cultivated farmlands day in and out.",
            "He then later transferred his family to Barangay Poblacion, Tubod."
        ],
        [
            "Later, through an order from constituted authorities, Sitio Union Sanidad was declared independent from Barangay Timamana and was called Barangay Tubod by 1908."
        ],
        [
            "With Agustin Mendez leading the barangay, he became its First Leader & Originator (Barrio Lieutenant) and named the woods \"Tubod\" from the local dialect \"Tuboran\" that meant 'source of water.'"
        ],
        [
            "Barangay Tubod had a population of roughly 100 people, mostly immigrants from Bohol, Cebu, Leyte, Camiguin and Surigao.",
            "Its main socio-agricultural sources of income were from abaca, coffee, rice, as well as root crops such as ube, camote and calibre."
        ],
        [
            "As the barangay's progress continued, it became a big source of copra and soon began its own irrigated rice farming."
        ],
        [
            "Barangay Tubod is surrounded by mountainous terrains, hills and the famous Mt.",
            "Maniayao standing overlooking the town.",
            "With mountain ranges, the presence of natural deposit and mineral resources like gold, silver, copper, chromate and iron are all blessings to the Tuboranons to this day."
        ],
        [
            "Mendez donated Tubod Roman Catholic Church Lot and two (2) solid wood sculptures of patron saints Peter and Paul, and celebrates their feast day that falls on June 28–29 each year."
        ],
        [
            "Tubod's Founding Hero Agustin Mendez's legacy includes several donations made to the Municipality and Roman Catholic Church settlement."
        ],
        [
            "Recognizing his efforts, a Municipal Resolution in 1989 asserted Agustin “Usting” Mendez as Tuboranon Local Hero for his work including a series of donations from portions of lands that enticed people to live in the municipality."
        ],
        [
            "Politics were also led by Mendez establishing Tubod with appointed and elected officials found in Tubod's Municipal Archives records."
        ],
        [
            "Tubod was previously part of the Municipality of Mainit, Surigao del Norte.",
            "It was created by virtue of Executive Order No.",
            "269 dated September 18, 1957."
        ],
        [
            "Geography"
        ],
        [
            "Songkoy Spring"
        ],
        [
            "Tubod lies in a valley at the centre of the peninsula that is the mainland portion of Surigao del Norte, with hills and mountains to the east and west of the town.",
            "A natural feature in the western hills is Songkoy Spring, where clear water emerges from the rainforest and collects in a natural pool that is a popular local swimming place."
        ],
        [
            "Rural areas along the valley floor are dominated by agriculture, while the hills are home to coconut plantations, rainforest and gold mining.",
            "To the south of Tubod is Lake Mainit on the border between Surigao del Norte and Agusan del Norte."
        ],
        [
            "The Maharlika Highway runs through the centre of Tubod and links the town with the major center of Surigao City in the north.",
            "The closest airport is in Surigao City which has flights to Cebu and Manila.",
            "Ferries at Surigao City connect the mainland with the adjacent islands of Surigao del Norte and the neighbouring province of Southern Leyte."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Tubod, Surigao del Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(83)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "24(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "210(8.3)"
        ],
        [
            "161(6.3)"
        ],
        [
            "123(4.8)"
        ],
        [
            "85(3.3)"
        ],
        [
            "148(5.8)"
        ],
        [
            "186(7.3)"
        ],
        [
            "164(6.5)"
        ],
        [
            "157(6.2)"
        ],
        [
            "141(5.6)"
        ],
        [
            "190(7.5)"
        ],
        [
            "223(8.8)"
        ],
        [
            "200(7.9)"
        ],
        [
            "1,988(78.3)"
        ],
        [
            "Average rainy days"
        ],
        [
            "21.0"
        ],
        [
            "16.8"
        ],
        [
            "18.5"
        ],
        [
            "18.2"
        ],
        [
            "24.9"
        ],
        [
            "27.7"
        ],
        [
            "28.4"
        ],
        [
            "27.0"
        ],
        [
            "26.1"
        ],
        [
            "27.6"
        ],
        [
            "24.6"
        ],
        [
            "22.0"
        ],
        [
            "282.8"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Barangays"
        ],
        [
            "Tubod is politically subdivided into 9 barangays.",
            "Each barangay consists of puroks  while some have sitios."
        ],
        [
            "Capayahan"
        ],
        [
            "Cawilan"
        ],
        [
            "Del Rosario"
        ],
        [
            "Marga"
        ],
        [
            "Motorpool"
        ],
        [
            "Poblacion (Tubod)"
        ],
        [
            "San Isidro"
        ],
        [
            "San Pablo"
        ],
        [
            "Timamana"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TubodYearPop.±% p.a.1960 6,197—    1970 6,665+0.73%1975 7,366+2.03%1980 8,056+1.81%1990 11,194+3.34%1995 10,318−1.52%2000 10,923+1.23%2007 11,664+0.91%2010 12,569+2.76%2015 14,206+2.36%2020 15,043+1.13%Source: Philippine Statistics Authority"
        ],
        [
            "The Surigaonon language is the common local language, while Cebuano, Filipino, and English are also spoken."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tubod"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  30.61"
        ],
        [
            "2009  47.78"
        ],
        [
            "2012  30.98"
        ],
        [
            "2015  30.60"
        ],
        [
            "2018  29.36"
        ],
        [
            "2021  26.49"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Coconut trees in the hills west of Tubod"
        ],
        [
            "See also"
        ],
        [
            "Lake Mainit Development Alliance"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Tubod |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Tubod: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 20 November 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Caraga\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Caraga\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Caraga\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Surigao del Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Tubod, Surigao del Norte."
        ],
        [
            "Tubod Profile at PhilAtlas.com"
        ],
        [
            "Tubod Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Municipal Website Blog of Tubod"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Tubod, Surigao del Norte"
        ],
        [
            "Placer"
        ],
        [
            "Mainit"
        ],
        [
            "Tubod"
        ],
        [
            "Bacuag"
        ],
        [
            "Alegria"
        ],
        [
            "vte Province of Surigao del NorteSurigao City (capital)Municipalities"
        ],
        [
            "Alegria"
        ],
        [
            "Bacuag"
        ],
        [
            "Burgos"
        ],
        [
            "Claver"
        ],
        [
            "Dapa"
        ],
        [
            "Del Carmen"
        ],
        [
            "General Luna"
        ],
        [
            "Gigaquit"
        ],
        [
            "Mainit"
        ],
        [
            "Malimono"
        ],
        [
            "Pilar"
        ],
        [
            "Placer"
        ],
        [
            "San Benito"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro"
        ],
        [
            "Santa Monica"
        ],
        [
            "Sison"
        ],
        [
            "Socorro"
        ],
        [
            "Tagana-an"
        ],
        [
            "Tubod"
        ],
        [
            "Component city"
        ],
        [
            "Surigao City"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tubod,_Surigao_del_Norte&oldid=1194742310\""
        ],
        [
            "Categories: Municipalities of Surigao del NortePolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Tagalog-language textCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}