{
    "name": "Tulunan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tulunan"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 6°50′N 124°53′E﻿ / ﻿6.83°N 124.88°E﻿ / 6.83; 124.88"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Cotabato, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Tulunan\" – news · newspapers · books · scholar · JSTOR (June 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Soccsksargen, PhilippinesTulunanMunicipalityMunicipality of Tulunan"
        ],
        [
            "FlagSealMap of Cotabato with Tulunan highlightedOpenStreetMapTulunanLocation within the PhilippinesCoordinates: 6°50′N 124°53′E﻿ / ﻿6.83°N 124.88°E﻿ / 6.83; 124.88CountryPhilippinesRegionSoccsksargenProvinceCotabatoDistrict"
        ],
        [
            "3rd districtFoundedAugust 6, 1961Barangays29"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 226.7 million (2020) • Assets₱ 515.7 million (2020) • Expenditure₱ 199.7 million (2020) • Liabilities₱ 162.9 million (2020)Service provider • ElectricityCotabato Electric Cooperative (COTELCO)Time zoneUTC+8 (PST)ZIP code9403PSGC124714000IDD : area code +63 (0)64Native languagesHiligaynon Cebuano Maguindanao Ilianen TagalogWebsitewww.tulunan-cotabatoprov.gov.ph"
        ],
        [
            "Tulunan, officially the Municipality of Tulunan (Cebuano: Lungsod sa Tulunan; Hiligaynon: Banwa sang Tulunan; Maguindanaon: Inged nu Tulunan, Jawi: ايڠايد نو تولونن; Tagalog: Bayan ng Tulunan), is a 2nd class municipality in the province of Cotabato, Philippines.",
            "According to the 2020 census, it has a population of 60,978 people."
        ],
        [
            "History"
        ],
        [
            "This article needs to be updated.",
            "Please help update this article to reflect recent events or newly available information.",
            "(November 2023)"
        ],
        [
            "The name \"Tulunan\" originates from the Maguindanaon term \"tulun,\" signifying \"a place of abundance\" or \"where grace falls.\"",
            "Initially, the area was inhabited by Muslim tribes in the lowlands, while nomadic groups like the B'laans and Bagobos resided in the hills and mountains.",
            "The governance system followed datuism, with Datu Enok considered the inaugural ruling datu."
        ],
        [
            "During Datu Enok's reign, the community flourished, benefiting from plentiful harvests from their kaingin.",
            "This prosperity led to the adoption of the name \"Tulunan,\" reflecting the abundance and grace bestowed upon the area, as indicated by the Muslim term \"tulun.\""
        ],
        [
            "Initially, the population consisted of small nomadic groups reliant on hunting, but contact with other groups led to improvements in their way of life.",
            "With the introduction of Islam by Sharif Kabungsuwan in the 14th century, the influence of religion reached Tulunan through settlers who identified as Maguindanaon.",
            "However, minority groups such as Bagobos and B’laans occupied the eastern highlands."
        ],
        [
            "Sultan Solaiman was a prominent Muslim leader, succeeded by Datu Mangko Ambag and his advisors like Dappil Tuden, Kasan Kandugon, and Datu Parangan, who settled in the lowlands near rivers, engaging in kaingins and fishing."
        ],
        [
            "Datu Dempon emerged as a notable leader of the B’laans, leading to clashes with the Maguindanaons that disrupted peace and order.",
            "However, peace was restored through the marriage of Datu Mangko to a B’laan woman, leading to the subjugation of the B’laans under Datu Mangko's leadership, strengthening the Muslim group."
        ],
        [
            "In the early part of 1956, a group of leaders led by Datu Udtog Matalam petitioned for Tulunan's separation from its mother municipality, M’lang, but faced opposition.",
            "Another effort led by the \"BIG FIVE\" group, composed of Datu Dabpil Tuden, Arsenio Villamor Sr., Juan Jinen, Mauro Quibrantar, and Jose Ordenia, succeeded in achieving independence for Tulunan."
        ],
        [
            "Establishment"
        ],
        [
            "Tulunan is one of the granddaughter municipalities of Kidapawan.",
            "After the Second World War, in 1947, the municipal district of Kidapawan was converted into a municipality, with merging of then forested M'lang-Tulunan area.",
            "This was due to the closeness of the Manobo with the Maguindanaons, along with the increase of Ilonggo settlers with relatives in the municipal districts into a then-mostly Maguindanaon territory."
        ],
        [
            "It was formed by virtue of Executive Order No.",
            "441, signed on August 6, 1961, by President Carlos P. Garcia, upon the separation of 28 barrios and sitios of M'lang in the then-undivided Cotabato; with the seat of government at the Barrio Tulunan."
        ],
        [
            "With the establishment of M'lang and Tulunan, Kidapawan's direct access to the Ligawasan Marsh was cut off."
        ],
        [
            "The initial appointed officials included Datu Ibrahim Paglas Jr. as the municipal mayor, Arsenio Villamor Sr. as the vice mayor, and councilors Datu Mangko Ambag, Roberto Jover Sr., Benito Cabello, and Datu Diadel Kamag, with Antonio Caballero serving as the first Municipal Secretary."
        ],
        [
            "Six months before the 1963 election, Datu Ibrahim Paglas Jr. resigned as the municipal mayor to pursue his candidacy for Municipal Mayor of Buluan.",
            "Consequently, Vice Mayor Arsenio Villamor Sr. succeeded him, becoming the first Christian Mayor of Tulunan."
        ],
        [
            "In the 1963 election, Godofredo Laluyan emerged as the first elected Mayor of Tulunan.",
            "However, the political landscape shifted in the 1967 election, favoring Mayor Conrado Lemana, who served until 1980.",
            "In the 1980 election, the people's confidence was placed in the incumbent Municipal Mayor Josue Faustino, who diligently implements various government programs with wisdom."
        ],
        [
            "During Marcos presidency"
        ],
        [
            "In early 1983, the municipality was among the eleven in the province, along with other provinces in central Mindanao, where most families suffered food shortage due to the long drought."
        ],
        [
            "On April 11, 1985, Italian Roman Catholic priest Tullio Favali of the Pontifical Institute for Foreign Missions, the town's parish priest, was killed by an armed paramilitary group led by Norberto Manero Jr. in Barangay La Esperanza.",
            "The case was among a few under the Marcos presidency that successfully prosecuted; in 1987, Manero, convicted of murder and arson, was sentenced to reclusión perpetua since death penalty had been suspended earlier.",
            "Manero later became controversial for his freedom from jail, both by presidential pardon and by escape, and was eventually released in 2008."
        ],
        [
            "Contemporary"
        ],
        [
            "Galidan was the sole barangay in the municipality to request inclusion in the Bangsamoro,"
        ],
        [
            "Geography"
        ],
        [
            "Tulunan is located in southern Cotabato Province, 31 kilometers (19 mi) from Kidapawan City, the provincial capital.",
            "It is bordered by M'lang to the north, Datu Paglas, Maguindanao del Sur to the south, Liguasan Marsh to the west, Makilala to the northeast, and Magsaysay, Davao del Sur to the east."
        ],
        [
            "Barangays"
        ],
        [
            "Tulunan is politically subdivided into 29 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 1204714001   Bagumbayan"
        ],
        [
            " 3.8%"
        ],
        [
            " 2,297"
        ],
        [
            " 2,226"
        ],
        [
            "  ▴"
        ],
        [
            " 0.31%"
        ],
        [
            " 1204714002   Banayal"
        ],
        [
            " 3.0%"
        ],
        [
            " 1,816"
        ],
        [
            " 1,667"
        ],
        [
            "  ▴"
        ],
        [
            " 0.86%"
        ],
        [
            " 1204714003   Batang"
        ],
        [
            " 0.9%"
        ],
        [
            " 523"
        ],
        [
            " 223"
        ],
        [
            "  ▴"
        ],
        [
            " 8.90%"
        ],
        [
            " 1204714004   Bituan"
        ],
        [
            " 1.4%"
        ],
        [
            " 879"
        ],
        [
            " 721"
        ],
        [
            "  ▴"
        ],
        [
            " 2.00%"
        ],
        [
            " 1204714005   Bual"
        ],
        [
            " 10.0%"
        ],
        [
            " 6,114"
        ],
        [
            " 5,055"
        ],
        [
            "  ▴"
        ],
        [
            " 1.92%"
        ],
        [
            " 1204714006   Daig"
        ],
        [
            " 2.6%"
        ],
        [
            " 1,589"
        ],
        [
            " 1,596"
        ],
        [
            "  ▾"
        ],
        [
            " −0.04%"
        ],
        [
            " 1204714007   Damawato"
        ],
        [
            " 4.4%"
        ],
        [
            " 2,654"
        ],
        [
            " 2,521"
        ],
        [
            "  ▴"
        ],
        [
            " 0.52%"
        ],
        [
            " 1204714008   Dungos"
        ],
        [
            " 5.7%"
        ],
        [
            " 3,471"
        ],
        [
            " 2,508"
        ],
        [
            "  ▴"
        ],
        [
            " 3.30%"
        ],
        [
            " 1204714009   Kanibong"
        ],
        [
            " 2.9%"
        ],
        [
            " 1,750"
        ],
        [
            " 1,569"
        ],
        [
            "  ▴"
        ],
        [
            " 1.10%"
        ],
        [
            " 1204714010   La Esperanza"
        ],
        [
            " 7.0%"
        ],
        [
            " 4,251"
        ],
        [
            " 3,685"
        ],
        [
            "  ▴"
        ],
        [
            " 1.44%"
        ],
        [
            " 1204714011   Lampagang"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,250"
        ],
        [
            " 748"
        ],
        [
            "  ▴"
        ],
        [
            " 5.27%"
        ],
        [
            " 1204714012   Bunawan"
        ],
        [
            " 1.1%"
        ],
        [
            " 680"
        ],
        [
            " 662"
        ],
        [
            "  ▴"
        ],
        [
            " 0.27%"
        ],
        [
            " 1204714013    Magbok"
        ],
        [
            " 1.2%"
        ],
        [
            " 705"
        ],
        [
            " 621"
        ],
        [
            "  ▴"
        ],
        [
            " 1.28%"
        ],
        [
            " 1204714014   Maybula"
        ],
        [
            " 2.8%"
        ],
        [
            " 1,688"
        ],
        [
            " 2,130"
        ],
        [
            "  ▾"
        ],
        [
            " −2.30%"
        ],
        [
            " 1204714015   Minapan"
        ],
        [
            " 5.4%"
        ],
        [
            " 3,304"
        ],
        [
            " 3,019"
        ],
        [
            "  ▴"
        ],
        [
            " 0.91%"
        ],
        [
            " 1204714016   New Caridad"
        ],
        [
            " 1.8%"
        ],
        [
            " 1,069"
        ],
        [
            " 871"
        ],
        [
            "  ▴"
        ],
        [
            " 2.07%"
        ],
        [
            " 1204714017   New Culasi"
        ],
        [
            " 3.1%"
        ],
        [
            " 1,890"
        ],
        [
            " 1,784"
        ],
        [
            "  ▴"
        ],
        [
            " 0.58%"
        ],
        [
            " 1204714018   New Panay"
        ],
        [
            " 2.9%"
        ],
        [
            " 1,766"
        ],
        [
            " 1,598"
        ],
        [
            "  ▴"
        ],
        [
            " 1.00%"
        ],
        [
            " 1204714019   Paraiso"
        ],
        [
            " 1.2%"
        ],
        [
            " 703"
        ],
        [
            " 629"
        ],
        [
            "  ▴"
        ],
        [
            " 1.12%"
        ],
        [
            " 1204714020  Poblacion"
        ],
        [
            " 11.5%"
        ],
        [
            " 7,005"
        ],
        [
            " 6,733"
        ],
        [
            "  ▴"
        ],
        [
            " 0.40%"
        ],
        [
            " 1204714021   Popoyon"
        ],
        [
            " 2.2%"
        ],
        [
            " 1,313"
        ],
        [
            " 1,319"
        ],
        [
            "  ▾"
        ],
        [
            " −0.05%"
        ],
        [
            " 1204714022   Sibsib"
        ],
        [
            " 7.2%"
        ],
        [
            " 4,377"
        ],
        [
            " 4,153"
        ],
        [
            "  ▴"
        ],
        [
            " 0.53%"
        ],
        [
            " 1204714023   Tambac"
        ],
        [
            " 2.0%"
        ],
        [
            " 1,226"
        ],
        [
            " 1,113"
        ],
        [
            "  ▴"
        ],
        [
            " 0.97%"
        ],
        [
            " 1204714024   Tuburan"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,018"
        ],
        [
            " 952"
        ],
        [
            "  ▴"
        ],
        [
            " 0.67%"
        ],
        [
            " 1204714026   F. Cajelo"
        ],
        [
            " 2.5%"
        ],
        [
            " 1,516"
        ],
        [
            " 1,454"
        ],
        [
            "  ▴"
        ],
        [
            " 0.42%"
        ],
        [
            " 1204714027   Bacong"
        ],
        [
            " 5.0%"
        ],
        [
            " 3,047"
        ],
        [
            " 2,501"
        ],
        [
            "  ▴"
        ],
        [
            " 1.99%"
        ],
        [
            " 1204714028   Galidan"
        ],
        [
            " 2.9%"
        ],
        [
            " 1,742"
        ],
        [
            " 1,606"
        ],
        [
            "  ▴"
        ],
        [
            " 0.82%"
        ],
        [
            " 1204714029   Genoveva Baynosa"
        ],
        [
            " 0.5%"
        ],
        [
            " 299"
        ],
        [
            " 373"
        ],
        [
            "  ▾"
        ],
        [
            " −2.19%"
        ],
        [
            " 1204714030   Nabundasan"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,036"
        ],
        [
            " 847"
        ],
        [
            "  ▴"
        ],
        [
            " 2.03%"
        ],
        [
            "Total"
        ],
        [
            "60,978"
        ],
        [
            "54,884"
        ],
        [
            " ▴"
        ],
        [
            "1.06%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Tulunan, Cotabato"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "33(91)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "32(89)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "21(70)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "19(0.7)"
        ],
        [
            "14(0.6)"
        ],
        [
            "15(0.6)"
        ],
        [
            "18(0.7)"
        ],
        [
            "33(1.3)"
        ],
        [
            "42(1.7)"
        ],
        [
            "44(1.7)"
        ],
        [
            "42(1.7)"
        ],
        [
            "30(1.2)"
        ],
        [
            "31(1.2)"
        ],
        [
            "28(1.1)"
        ],
        [
            "17(0.7)"
        ],
        [
            "333(13.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "6.9"
        ],
        [
            "5.6"
        ],
        [
            "6.9"
        ],
        [
            "8.1"
        ],
        [
            "15.1"
        ],
        [
            "17.5"
        ],
        [
            "17.8"
        ],
        [
            "18.5"
        ],
        [
            "14.9"
        ],
        [
            "14.9"
        ],
        [
            "12.4"
        ],
        [
            "8.0"
        ],
        [
            "146.6"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Tulunan experiences a climate characterized by relatively even distribution throughout the year and rainfall ranging from 60 mm to 215 mm, with an average annual rainfall of 115.04 mm.",
            "The dry season typically occurs in January, February, March, and December, while the remaining months see occasional rains.",
            "January and December are generally the coldest months, with an average temperature of 28.25 degrees Celsius.",
            "Prevailing winds come during the wet/rainy season.",
            "Despite being outside the typhoon belt and protected by small mountains, Tulunan may still experience heavy rains, leading to the overflowing of rivers like Malasila, Tulunan, and Bual.",
            "These occurrences, particularly in August and September, result in severe flooding hazards in barangays Damawato, Bual, Popoyon, Tambac, Bagumbayan, Minapan, and Dungos, affecting approximately 1,200 hectares or 3.43% of the total area.",
            "Such climatic conditions adversely affect agricultural productivity in these barangays, as floods can unexpectedly destroy crops, often resulting in losses ranging from 50% to 100%."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TulunanYearPop.±% p.a.1970 24,538—    1975 12,367−12.84%1980 19,941+10.02%1990 31,412+4.65%1995 34,584+1.82%2000 41,756+4.12%2007 47,159+1.69%2010 54,884+5.68%2015 56,513+0.56%2020 60,978+1.51%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Tulunan, Cotabato's population was 60,978, with a density of 180/km² or 470/mi²."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tulunan"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  34.70"
        ],
        [
            "2009  38.22"
        ],
        [
            "2012  45.39"
        ],
        [
            "2015  38.56"
        ],
        [
            "2018  35.40"
        ],
        [
            "2021  30.95"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agricultural commodities such as rice, corn, upland rice, legumes, scallions, root vegetables, tobacco, rubber, assorted vegetables, sorghum, and coconuts."
        ],
        [
            "Government"
        ],
        [
            "Municipal leaders of Tulunan"
        ],
        [
            "Year in office"
        ],
        [
            "Mayor"
        ],
        [
            "Vice mayor"
        ],
        [
            "Notes"
        ],
        [
            "1961–1964"
        ],
        [
            "Datu Ibrahim Paglas"
        ],
        [
            "Datu Catong Madidis"
        ],
        [
            "1964–1967"
        ],
        [
            "Godofredo Laluyan"
        ],
        [
            "Arsenio Villamor Sr."
        ],
        [
            "1967–1972"
        ],
        [
            "Condrado Lemana"
        ],
        [
            "Alfredo Tadiaque Sr."
        ],
        [
            "1972–1980"
        ],
        [
            "Reynaldo Yata Sr."
        ],
        [
            "1980–1986"
        ],
        [
            "Josue Faustino(First time)"
        ],
        [
            "1986–1988"
        ],
        [
            "Juan Perez Sr."
        ],
        [
            "Pedro Amigable"
        ],
        [
            "Officers in Charge"
        ],
        [
            "1988–1992"
        ],
        [
            "Josue Faustino(Second time)"
        ],
        [
            "Hermilio Pancho"
        ],
        [
            "1992–1995"
        ],
        [
            "Engr.",
            "Rodolfo Peñafiel(First time)"
        ],
        [
            "Armando Casalan"
        ],
        [
            "1995–1998"
        ],
        [
            "Ernesto Pedregosa"
        ],
        [
            "1998–2001"
        ],
        [
            "Armando Casalan"
        ],
        [
            "Nestor Almirante"
        ],
        [
            "2001–2004"
        ],
        [
            "Engr.",
            "Rodolfo Peñafiel(Second time)"
        ],
        [
            "Ernesto Porras Jr."
        ],
        [
            "2004–2007"
        ],
        [
            "Nestor Ta-asan"
        ],
        [
            "Joemar Cerebo"
        ],
        [
            "2007–2013"
        ],
        [
            "Lani Candolada"
        ],
        [
            "2013–2016"
        ],
        [
            "Joel Villamor"
        ],
        [
            "2016–2019"
        ],
        [
            "Reuel Limbungan"
        ],
        [
            "Lani Candolada"
        ],
        [
            "2019–2022"
        ],
        [
            "Maureene Ann Villamor"
        ],
        [
            "Since 2022"
        ],
        [
            "Abraham Contayoso"
        ],
        [
            "Notable personalities"
        ],
        [
            "Mary Jean Lastimosa - actress, model, and Miss Universe Philippines 2014, reaching the Top 10 in Miss Universe 2014."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Tulunan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"TULUNAN\".",
            "www.cotabatoprov.gov.ph.",
            "Archived from the original on November 13, 2012.",
            "Retrieved April 25, 2022."
        ],
        [
            "^ a b c David, Karlo Antonio (January 3, 2024).",
            "\"Moppiyon Kahi Diid Patoy: The Greater Kidapawan Area\".",
            "MindaNews.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ \"Executive Order No.",
            "441, s. 1961\".",
            "Official Gazette (Philippines).",
            "Government of the Philippines.",
            "August 6, 1961.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ Far East Broadcasting Company (April 1, 1983).",
            "\"Mindanao families face hunger\" (PDF).",
            "Southeast Asia Report.",
            "No. 1277.",
            "Foreign Broadcast Information Service.",
            "p. 70.",
            "Retrieved April 14, 2024 – via Defense Technical Information Center."
        ],
        [
            "^ Arguillas, Carolyn (January 25, 2008).",
            "\"Timeline: Favali murder 11 April 1985 – 25 January 2008\".",
            "MindaNews.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ \"Backgrounder on Norberto Manero, Jr\".",
            "GMA News Online.",
            "January 25, 2008.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ Arguillas, Carolyn (January 14, 2019).",
            "\"67 villages in 7 North Cot towns will vote in Feb. 6 Bangsamoro plebiscite\".",
            "MindaNews.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ \"Republic Act No.",
            "11054\".",
            "Legislative Digital Resources.",
            "Senate of the Philippines.",
            "July 27, 2018.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ \"Proclamation No.",
            "656, s. 2019\".",
            "Legislative Digital Resources.",
            "Senate of the Philippines.",
            "January 21, 2019.",
            "Retrieved March 7, 2024."
        ],
        [
            "^ Cabrera, Ferdinandh (November 21, 2019).",
            "\"NorthCot turns over 63 barangays to Bangsamoro region\".",
            "MindaNews.",
            "Retrieved March 7, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: North Cotabato\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region XII (Soccsksargen)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Tulunan: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 30 January 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region XII (Soccsksargen)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region XII (Soccsksargen)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of North Cotabato\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ 2021 paper from University of Mindanao.",
            "Retrieved 04-14-2024 — via Scribd."
        ],
        [
            "^ \"Eleksyon results: Tulunan\".",
            "GMA Network.",
            "2016.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ \"Eleksyon results: Tulunan\".",
            "GMA Network.",
            "2019.",
            "Retrieved April 14, 2024."
        ],
        [
            "^ \"Eleksyon results: Tulunan\".",
            "GMA Network.",
            "2022.",
            "Retrieved April 14, 2024."
        ],
        [
            "External links"
        ],
        [
            "Tulunan Profile at the DTI Cities and Municipalities Competitive Index"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Tulunan"
        ],
        [
            "Pagalungan, Maguindanao"
        ],
        [
            "M'lang"
        ],
        [
            "Makilala"
        ],
        [
            "Paglat, MaguindanaoGen.",
            "S. K. Pendatun, Maguindanao"
        ],
        [
            "Tulunan"
        ],
        [
            "Magsaysay, Davao del Sur"
        ],
        [
            "Pandag, Maguindanao"
        ],
        [
            "Datu Paglas, Maguindanao / Columbio, Sultan Kudarat"
        ],
        [
            "vte Province of CotabatoKidapawan (capital)Municipalities"
        ],
        [
            "Alamada"
        ],
        [
            "Aleosan"
        ],
        [
            "Antipas"
        ],
        [
            "Arakan"
        ],
        [
            "Banisilan"
        ],
        [
            "Carmen"
        ],
        [
            "Kabacan"
        ],
        [
            "Libungan"
        ],
        [
            "Magpet"
        ],
        [
            "Makilala"
        ],
        [
            "Matalam"
        ],
        [
            "Midsayap"
        ],
        [
            "M'lang"
        ],
        [
            "Pigcawayan"
        ],
        [
            "Pikit"
        ],
        [
            "President Roxas"
        ],
        [
            "Tulunan"
        ],
        [
            "Component city"
        ],
        [
            "Kidapawan"
        ],
        [
            "Related"
        ],
        [
            "Symbols"
        ],
        [
            "Special Geographic Area (part of Bangsamoro)"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tulunan&oldid=1225227781\""
        ],
        [
            "Categories: Municipalities of CotabatoPolitical divisions established by Philippine executive orderHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from June 2014All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Hiligaynon-language textArticles containing Maguindanaon-language textArticles containing Tagalog-language textWikipedia articles in need of updating from November 2023All Wikipedia articles in need of updatingPages using the Kartographer extension"
        ]
    ]
}